{"ratings": 3704, "userreviews": [{"userName": "Matt", "userReviewDate": "Oct 25, 2011", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Known for his epic novels of historical fiction, Jeff Shaara has further distanced himself from those within the genre by writing solely (or, at least predominantly) about war, through American eyes. This novel, the first in a tetralogy on the Western Theatre of the US Civil War is no exception in its greatness. Shaara chooses to focus the first novel on the Battle of Shiloh, to that point the bloodiest battle ever fought on US soil, in Spring, 1862. Shaara chooses wisely as he moves the focus west (in this case, West would be along the lines of Kentucky and Tennessee), at times on the cusp of the North-South divide. As he states in his introduction, Shaara is careful to choose a handful of characters to tell this story. From the Union side, narratives include those with a focus on General Ulysses S. Grant and faceless soldier Fritz Bauer. Offering a balance, Shaara hands the reins to Confederate General Albert Sidney Johnston and Cavalryman James Seeley. Within the narrative, characters advance not only the plans of the battle as both sides mobilised, but some of the inner struggles that both the mighty and peons felt, some barely able to grasp the concept of war. As pressure mounts and the major battle seems imminent, the characters are forced to their limits and the little-known Bauer and Seeley become central, allowing them to describe the horrors they witness. While historians have focussed much attention on the views of Grant and even Johnston, this insight into the blood, gore, and loss of the frontline soldiers helps stir events as Shiloh becomes less about a land grab and more the piercing of souls and loss of innocence. By the end, with bodies strewn all over, neither side can truly say they have won, even though history will record it as a significant Union victory. Shaara offers another round of 'the horrors of war' as it echoes throughout the pages of this powerful novel, peppered with just enough reality to provide the reader with additional chills.I have long been a fan of Shaara and his writing. His style of getting to the core of the issue, the views of the day-to-day soldiers offers something refreshing that is missing from biographies or pieces of historical non-fiction. Shaara pulls out a random (usually fake) soldier and levies much of the real insights of war through their eyes. This allows the reader to better understand things, with less of the clean-cut precision that war historians tend to offer. His use of real sources helps to support the claims of truth behind the novels he pens, though they remain fiction because of the dreamt-up dialogue he uses to propel the story forward. That being said, I will admit that there are times that I got lost in the minutiae or the dialogue and details, even though I am focussed with a keen narrator through the audiobook version. I struggled repeatedly to find some of the key moments of character development or the crucial lead-up to events. I found myself learning about some of the characters, but ask me specifics about their plights or worries and I would be lost. I find this to be more my lack of sustained interest in the intricate details of the US Civil War (sorry, my American friends) than Shaara's writing. I cannot, in good conscience, offer up a five-star rating for this book, though I feel it is more my impediment than the author's inability to transmit things. I find myself in the position where I hold my nose and rate the book more along the lines with what I know it is worth rather than how it made me feel, disconnected from what I know of the author. I also promised myself that I would read all the books in this tetralogy and I will. I want to open my mind and perhaps catch myself enthralled by the time this is all over and done with. I owe it to myself and Jeff Shaara, whose past work has been stellar, even to a lowly Canadian such as myself.Kudos, Mr. Shaara, for you would still make your father proud with a novel like this. While I sometimes have troubles with concepts or intricate battle plotting, I know I need to pay better attention and I will surely learn a great deal from you.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Michael", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "As I read more from Shaara I can’t help but appreciate how close he is getting to the story presentation skills of his father, Michael, in his great novel of the Battle of Gettysburg, “The Killer Angels.” The formula is to present an account of major historical battles from a fictional perspective of the minds of a select set of commanders. Since completing his father’s intended trilogy on the major Civil War battles in the East, he’s had a lot of practice in books about other American wars, portraying the thoughts and feelings of the likes of Washington in the Revolutionary War, Robert E. Lee in the Mexican War, and Eisenhower in World War 2. Here he initiates a series on the Civil War in the West (i.e. between the Appalachian Mountains to the Mississippi River), starting with the first big battle after Bull Run, the Battle of Shiloh, also known as the Battle of Pittsburg Landing.The battle is an important phase in the struggle over control of the Mississippi River and the railroads, which were the lifeblood of the economy and war making capacity of the South. It is also important that the horrific losses on both sides revealed to all that easy victory in this war was not in the cards and that tremendous sacrifices were called for to resolve the conflict. As usual, Shaara provides perspectives from both sides of the conflict, and as in all books since the trilogy, he adds the important viewpoints of some front line soldiers in addition to generals. A star in this show is Confederate General Albert Sydney Johnston, a Texan transplant given command of the Western theater by his fellow West Pointer Davis. On the Union side, Shaara covers the perspectives of Ulysses S. Grant and William Tecumseh Sherman, the former riding on victories at Forts Donelson and Henry on rivers in western Tennessee and the latter smarting from the panic and failure of is troops at Bull Run. The other two voices in the book include Union Private Willliam Bauer, son of a German butcher from Wisconsin, Confederate Lieutenant James Seeley, a cavalryman under Col. Nathan Bedford Forrest, and Isham Harris, the Governor of Tennessee who serves as a civilian aide-de-camp for Johnston. As the curtain unfolds, Johnston’s forces have been driven out of Kentucky and he is being forced to abandon Nashville. In the face of the loss of the two river forts, he consolidates his army at Corinth in northern Mississippi, site of a critical railroad junction. Grant’s forces decamp 20 miles north in the area around Pittsburg Landing on the Tennessee River, and is ordered by the Union Commander for the Western Theater, Henry Halleck, to wait there for the arrival of the Ohio army under General Don Carlos Buell before pursuing the Rebel army. A sum of the battle is that Johnston’s army catches Grant’s forces in a surprise attack, drives them back toward Pittsburgh Landing, but reinforcements overnight from a neighboring river landing and from the arrival of some of Buell’s army allow Grant to counter attack the next day, forcing the Confederates to retreat back to Corinth. About 100,000 fought in the battle, and roughly 25,000 casualties resulted, evenly divided, with about 3,000 total killed in action. This two-day total was more casualties that all the previous U.S. wars combined. The battle was a horror show, especially for green troops ordered to make wave after wave of assaults over the mud and creeks against a flood of musket and artillery fire (shades of the Somme even without machine guns). Private Bauer is awed and shocked by his comrade in arms ability to take joy in the killing. The advance and retreat over the same killing ground meant crossing over the bodies of those fallen before. Maybe Shelby Foote did a better job in his first book, a novel, in capturing the experience of combat at Shiloh, but Shaara impressed me with this passage from Bauer’s perspective:There had been too many horrors that day, no way to erase any of that, his ears still wringing from the astounding volume of musket fire thrown across such tight spaces in never-ending waves, a steady hum and roar like some ungodly swarm of hornets. On the retreat, the men who littered the ground were nearly all in blue, and it was impossible to ignore the gut-twisting sight of so many pieces of men, severed arms and legs, corpses chopped in half by cannon fire, some shredded by canister. …So many had their eyes open, and Bauer could not escape that, either, the dead seeming to watch him as he moved past, the eerie notion flowing through his mind that even in death, they were seeking something, an answer, an explanation, some kind of relief he could not offer them.The value of a fictional treatment for me is to get a chance to experience a considered version of the mind of key players at critical turning points where there is still debate by historians. How was it that Grant and Sherman were caught unprepared for the attack? How did it come to pass that Johnston was killed in action while leading troops in an attempt to flank Grant’s forces to the east along the river? How was it that General Beauregard, Johnston’s second in command, halted the attack when it was so close to complete success? And, the next day, how was it that Grant held back pursuit of the Confederates when he had them on the run? Blame for these failures was pointed in many directions after the battle and long after the war. In this account, Shaara paints a plausible answer to these questions while trying to capture some of the personalities and experience of the men behind the decisions. In a preface, Shaara reminds the reader that: “my goal is not to offer a complete detailed history of the event. If that’s what you seek, then by all means, read Shelby Foote or Jim McPherson.” For a short and readable account of these historical issues, try this recent article by Winston Groom, a novelist who wrote a popular history of Shiloh, Why Shiloh Matters.I am reminded of what I recently read in Barnes’ “The Sense of an Ending” where the narrator recounts his prep school teacher asking his students: “What is history?”:'History is the lies of the victors,' I replied, a little too quickly.'Yes, I was rather afraid you'd say that. Well, as long as you remember that it is also the self-delusions of the defeated. ...'Finn?'‘History is that certainty produced at the point where the imperfections of memory meet the inadequacies of documentation.’ Shaara’s vision is sympathetic to all of his main characters. Halleck and Beauregard come off as idiots, the nemeses of his generals. Here’s a sample of Grant’s negative thoughts (not including subsequent reflection that he should follow his wife’s advice to not be so judgmental): Grant stared forward, couldn’t escape the image of Halleck, an image that appeared far more often than Grant would have liked. But the man’s very being had infiltrated every move Grant made. … There’s not anything going on in St. Louis that requires the Big Man to stay neatly tucked away in his office. He knew the scene well, Halleck at his desk, puffy eyes under a raggedly receding hairline, a chinless martinet whose vanity oozed out like the mud that stirred beneath the riverboat. One of these days, he thought, there will come a time when Henry Halleck stretches too far his belief in his own magnificence. There will be some mistake, something only he can be faulted for, and by God, his genius will be seen for what it is, the imagination of a small, frightened scoundrel, who rubs his army the way a child plays with toys. Right now, I am just that …one of his toys.In the following excerpt, Shaara tries to capture Sherman’s ability to shrug off his failures to Grant at the end of the first day of Shiloh, showing some of the ego and chutzpah that allowed him to become such a favored and brutally effective general later in the war:“The enemy took full advantage, and I had to pull some of my people out of good strong ground, pull ‘em back, form up as best we could. Only brigade that held up was Buckland. He needs a promotion. The rest of ‘em …they need a firing squad.”“And what do I do with you? You’re their commander. It’s your responsibility after all.”…“Learned something today. Lots of mistakes. Lots of blundering.” He looked at Grant, as though trying to convince him. “Won’t happen this way again. If I’m allowed to keep my command.”“Shut up, Sherman. Only one likely to lose his command is me. This fight isn’t over, and once it is, there’s people with bigger britches than you or me who’ll make those decisions. Damn them to hell.”The outcome of the battle was a public relations challenge for both sides. That the conflict was bound to become an inglorious war of attrition was hard to accommodate. At the end of the battle, Bauer is surprised how his mentor in the field has turned so gloomy, responding to his query over whether the whipped Rebels will be ready to surrender:...We’re going to keep killing each other until nobody’s left. Maybe one soldier. There’ll be some big final fight, and one soldier will walk away, the luckiest damn man in these United States. He’ll be able to stand up and do all the crowing he wants … that he won the war. If President Lincoln is lucky, too, that man’ll be wearing blue.This was not great literature, but it made an important early stage in the Civil War come alive for me. I am looking forward to reading the two others in the series, one on the Battle of Vicksburg and the third on the Battles of Chickamauga and Chattanooga. The book was provided by the publisher through the Goodreads Giveaway program."}, {"userName": "Steven Peterson", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/1677868-steven-peterson", "userReview": "This is another in a series of works by Jeff Shaara, whose father authored the well acclaimed work \"The Killer Angels\" (a novel of the battle at Gettysburg). Shaara has military historical novels on the American Civil War, World War II and so on. The mode of operation is the same, between both pere and fils. Several figures are selected to act as characters in their novels. We see the particular battle or campaign through their eyes. By, then, aggregating these individual views, we get an overall sense of the nature of the battle or campaign. Generally, this has worked well.This novel focuses on the first major bloodletting in the Civil War--making Bull Run seem like a skirmish. Shiloh. Here Ulysses Grant's forces met an equal sized army, led by Albert Sidney Johnston, a Confederate general who had a towering reputation--but who had not fared as well as what people had expected from him.In this novel, there are more \"ordinary\" characters, \"grunts\" in both the Union and Confederate armies. Other characters who provide us their view of the battle include William Sherman, Albert Sidney Johnston, and so on.The work gives is insights into the character of some of the major figures in both armies, from U. S. Grant to Pierre G. T. Beauregard, the hot tempered Braxton Bragg, Nathan Bedford Forrest, and on.The novel takes us from the aftereffects of Grant's victories at Forts Henry and Donelson, which wrecked Johnson's defensive line from the Mississippi River to Eastern Tennessee. The story of his retreat, linking with forces led by Beauregard and Bragg, and his subsequent decision to mount a surprise attack on Grant's forces, now camping at Pittsburg Landing (Shiloh was a small church in the land above the Mississippi).The surprise attack turned into a nightmare for the Confederates (the anger and frustration among Confederate generals is well told). Union forces seemed stubbornly resistant to recognizing signs of an imminent attack. Then, the battle.The view from the ground continues to work well. Some issues did arise here though. There seemed to be an overemphasis on the humdrum lives of the grunts, which slowed the development of the action. It was fine for giving a sense of the private's perspective, but did it really add to the narrative?The historical aspects of this novel seem pretty well done (I am an amateur in terms of history, but most of the book is consistent with my understanding of this sanguinary battle)."}, {"userName": "Stephen", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/7240015-stephen", "userReview": "Come all you gallant soldiers, a story I will tellAbout the bloody battle on top of Shiloh's hillIt was an awful struggle; it'll cause your heart to chillAll from the bloody battle on top of Shiloh's hill. In 1974, Michael Shaara wrote an unparalleled novel about the Battle of Gettysburg, eschewing a traditional narrative and telling the story directly from the point of view of various generals and infantrymen who contended against one another amid Pennsylvania’s rocky hills and woodlands. The novel met enormous critical and popular success, and when it became a movie, Shaara’s son Jeff was prompted to consider picking up where his late father left off and writing similar novels in the same time. He responded with Gods and Generals, concerning the war’s beginning, and later with The Last Full Measure, making his father’s original part of an American Civil War trilogy. Keeping his father’s style, Shaara followed up on his success with novels set in all of the United States’ major wars – the Invasion of Mexico, the War of Independence, and the two world wars. The WW2 novels saw Shaara attempting to create his own narrative approach, one focused on fewer characters, but in A Blaze of Glory he returns to both his original style and setting: 1862, the American Civil War. But this time Shaara writes not of Lee and Grant, of the armies of the Potomac and of Virgina. Here, the action begins in the west, and the main event is the staggeringly bloody battle of Shiloh. Shaara turning his attention to the little-regarded western theater is most welcome: although the battles of Shiloh and Vicksburg may have some name recognition, the eastern characters and battles (Lee and Grant; Bull Run, Antietam, Gettysburg) dominate the national imagination. I also welcome Shaara’s return to his and his father’s former style: the WW2 novels were overly dominated by one or two characters and didn’t deliver the varied substance of The Killer Angels and other works. Here, Shaara’s panel includes Albert Sidney Johnston, Nathan Bedford Forrest, Grant, Sherman, and a few infantrymen from both sides. This allows Shaara to tell the story from both sides, without demonizing either. Consistently, the generals chide their men for dehumanizing the enemy, pointing out that the “rebs” or the “bluebellies” are just as clever, just as tough, and just as resolute in believing the righteousness of their cause as their respective side is. Shaara’s writing in A Blaze of Glory is as compelling as ever: he captures splendidly the utter confusion in the opening day of battle, as the southern troops hammer through a bewildered Union line, and the grisly impact of the bloodshed on the second day. It’s an experience that leaves one stunned, especially when main characters become part of the carnage. At novel’s end, one can’t help but reflect on how much was lost in one battle for relatively nothing, and the epilogue doesn’t improve judgments of the battle’s worth. Unlike battles covered in other novels, there’s no triumph to celebrate, nothing to redeem the carnage and make it seem worthwhile. And yet even knowing this, I’d read it again, because Johnston is a particularly inviting character, and the suspense and action make it an exciting read even given the subdued ending. If Blaze of Glory is any indication of what we have to look forward to, Shaara’s new ACW trilogy will prove quite a treat, for it begins with a battle that is both a thriller and gives opportunity for sober reflection on the costs of the war.Although we won the battle, my heart is filled with painThe one that brought me to this life I'll never see againI pray to the lord if consistent with his willLord save the souls of them poor boys that died on Shiloh's hill.Related:The Killer Angels; Gods and Generals; The Last Full Measure; Gone for Soldiers; Michael and Jeff ShaaraShiloh, 1862, Winston Groom\"The Battle of Shiloh Hill\", various artists. The most haunting version I've yet heard is Bobby Horton's. YouTube has a cover by Wayne Erbsen."}, {"userName": "Pop", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/24432934-pop", "userReview": "My first experience with Jeff Shaara was an excellent one. \"A Blaze of Glory\" was actually a book that lived up to its title. My review is for the audiobook read by Paul Michael, a very long audiobook I must add (18 hours & 23 minutes). I'm glad I listened to the book rather than reading it. Miahael's reading was able to portray the various characters' human qualities (or lack thereof) that probably would not have been apparant otherwise. I am somewhat of a Civil War history junkie and the book, while fiction, was true to the carnage that was the Battle of Shiloh. I look forward to more from Jeff Shaara."}, {"userName": "Sam Sattler", "userReviewDate": "Apr 25, 2012", "userURL": "http://www.goodreads.com/user/show/8300581-sam-sattler", "userReview": "A Blaze of Glory: A Novel of the Battle of Shiloh begins the new Jeff Shaara trilogy focusing on events of the Civil War’s Western Theater. As fans of Shaara’s The Last Full Measure and his father’s The Killer Angels will attest, his return to the Civil War era is a welcome one. I was particularly pleased to see that the new series begins with the Battle of Shiloh because of the number of hours I have spent walking that particular battlefield site over the years. A Blaze of Glory leaves me with a better understanding of what happened during those two critical days in 1862 and, just as importantly, what might have happened if either army had been better prepared for the fight. (My interest probably stems from the fact that my great-great grandfather was a member of the 18th Louisiana Infantry Brigade that suffered a forty percent casualty rate on the battle’s first day – him not among them.)Shaara, as in his past historical novels, uses a range of characters (some real, some fictional) to tell his story. This allows the author to offer insights into the personalities, motivations, jealousies, fears, doubts, and dreams that were carried to the field by all those soldiers on April 6-7, 1862. All told, more than 100,000 men fought on this relatively small patch of ground and almost 24,000 of them are counted as casualties of Shiloh (although less than 4,000 actual deaths are included in the total). The battle’s rotating points-of-view include those of Generals Grant, Sherman, Johnston, and Beauregard, along with those of a few lower-ranking officers and enlisted men.Caught by surprise at dawn on the first day of the battle, Union troops, as dusk approaches, have been driven as far as they can go without drowning themselves in the rain-swollen Tennessee River. Unfortunately for the Confederacy, General Albert Sidney Johnston is dead (having bled to death from a leg wound he barely seemed to notice at the time) and has been replaced by his second-in-command, the more cautious General P.T.G. Beauregard. The battle will turn on Beauregard’s decision to rest and reorganize his men for what he sees as a certain Union surrender requiring only a last surge on his part the next morning. But the next morning, the reinforced Union army attacks first and the Confederates are the ones forced to concede the field to a victorious army.One must remember, of course, that A Blaze of Glory is historical fiction and that Shaara uses the genre to speculate his way inside the heads of some of American history’s key players. His books, however, are not some alternate history version of America’s past. Shaara does not change historical facts. Rather, he uses his research and insight into the human condition to explain why things happened as they did. Naturally, his speculation and interpretation of events can be disputed, but without a doubt, he has humanized the Civil War in a way that even the best history books are unable to match. Shaara’s painless history lessons are so exciting that many of his readers will, I am certain, be compelled to pick up “real” history books for the first times in their lives."}, {"userName": "Donna Davis", "userReviewDate": "Apr 27, 2014", "userURL": "http://www.goodreads.com/user/show/11510694-donna-davis", "userReview": "To clarify: this is a five-star review. It was erroneously entered as four stars at some point, and the system is resisting my effort to correct it. FIVE stars. Not four. FIVE!I am a longstanding fan of Jeff Shaara's. I see people write criticism of his work that sometimes approaches hysteria, and frankly, I don't get it. Like his Pulitzer-winning father before him, Shaara uses a combination of extensive knowledge of the war; a fertile imagination; and considerable writing skill to turn America's most pivotal war into stories. Story, in turn, is a tremendously effective vehicle for teaching about history.At this point, I should mention that I got my copy courtesy of the First Reads program; my thanks go to the publisher. This copy will hold a place of pride in my personal library, alongside the other books of Shaara's that were given me as gifts or purchased outright for full jacket price. Is it worth full price? I say yes, with this qualification. It's worth it if you have a serious interest in the American Civil War, and if you are open to reading historical fiction. It's so named because any time one takes the known facts and adds dialogue, or inner dialogue, presuming to know the thoughts of historical characters, then of course part of it is made up. If you can't live with that, either stick to nonfiction or go away.Interest in the Civil War is key here because nobody can turn the battle of Shiloh into a fun read. It isn't a fun subject. It was tragic. So if you want a fluffy beach read, this book isn't that.I was somewhat surprised to note that my own Goodreads shelves had listed this book as read by me, and the rating as 4 stars. I think it may have been an error, because I usually write a review, even if the book wasn't free to me. However, another possibility exists: if I read it on the e-reader I owned when this book was first published in 2012, a reader now moribund so I can't go in and check, it might have negatively influenced my perspective. Don't read this book on your e-reader! You need to be able to see the maps, which are pivotal to understanding the action as Shaara describes it. If you didn't need it, the author and publishers would not have devoted the space to it. I flipped back a few times to give those maps a second and third glance as I was reading. I do love my (new) e-reader and I use it a lot, but when possible, I read military history and historical fiction on paper. It's more effective.When I taught American history, I always kept some of Shaara's other work on my classroom shelves. Fiction is often more accessible to students who have come to believe that history is a meaningless list of names, places, and dates. When story is used, the reader comes to understand that what took place involved real human beings and sometimes, they even recognize that their lives today might be different from what they are if things had unfolded differently back then. And had I not read Michael Shaara's The Killer Angels, I might not have decided to read The Battle Cry of Freedom, the Pulitzer winning nonfiction tome by McPherson. I found this was also true of my students, that fiction was often a necessary conduit that made them more willing to read nonfiction on the same topic. And once that bridge is crossed, it doesn't matter that there was no actual soldier named Bauer who did the things Jeff Shaara's foot soldier did.This brings me to the last thing I want to say about this well researched, carefully crafted book. Is a writer of strong historical fiction bound to include only real players in the story he reels out before us? Of course not. It's fiction; he can write anything he wants to.Well then, if he invents a character and gives him as much breath and life as the others, who were real, is his writing unworthy of our time and attention? I stand by the writer in this case. There were so many fresh-faced young soldiers out there who won no permanent place in our nation's history. The working class, the lowest on the totem pole, are often disenfranchised by the fact that their history goes unwritten. For Shaara to create a single character to show that these men are not forgotten is gutsy and laudable. While leadership was critical to winning the war, it's very important not to forget all those unknown boys and men who marched, slept in the rain and the mud, and sometimes died of dysentery before the next day's march began. Others can say what they wish, but I really appreciate what Shaara has done in helping us remember the common soldier.The more good historical fiction I read, the more I am inspired to read more of McPherson, Sears, and Catton. The Shaaras inspired me to read the memoirs of Grant and Sherman; I have a biography of Stonewall Jackson as my next-in-line galley. But the more I read of these masters of nonfiction, the more credible Shaara's work looks to me.Again, is this worth your bookstore dollars, or is it something only to be read free or cheap? If you have a strong interest in both historical fiction and the battle of Shiloh, there's nothing better. Buy the book and read it; if you have to pay the full cover price, do it. It's a worthwhile investment, and maybe some young person in your life will be inspired to borrow it. What could be more important?"}, {"userName": "James", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/11772943-james", "userReview": "Interesting novel about one of the most dreadful slaughters of the Civil War.Jeff Shaara successfully captures the futility and carnage of the Battle of Shiloh in his novel A Blaze of Glory. With over 100,000 troops engaged and nearly 25,000 casualties (about 13,000 Union and 10,000 Confederate), Shiloh was earliest of the major slaughters of the Civil War (April 1862) with total casualties in this one battle that were said to exceed all of the casualties of the American War for Independence, War of 1812 and Mexican War combined. As it was soon exceeded in bloodletting by Antietam and Gettysburg, battles captured by the eastern news media and photographers, Shiloh in far away western Tennessee became one of the lesser known major battles of the Civil War. Shaara’s novel is a welcome addition.The generals, their various strategies and conflicting personalities are depicted along with the perspectives of young soldiers on both sides attempting to gain experience and preparation for the cauldron of battle into which they would be so suddenly thrown. Among the best depictions presented by Shaara is of little known, but highly respected Confederate commanding General Albert Sydney Johnston. Johnston decided to combine all available forces to crush Grant’s Union troops at Pittsburgh Landing before he could be reinforced by Union divisions commanded by Don Carlos Buell for a drive further south. Although slowed by logistical problems and bickering among commanders, Johnston’s divisions were assembled and launched their attack on the morning of April 6, 1862. Despite ample warnings, Union commanders Grant and Sherman were caught off guard and the Rebel attack nearly achieved complete success. After General Johnston was killed on the afternoon of the 6th, his successor, General Beauregard failed to follow up the assault. Reinforcements from General Buell enabled Grant to recover the lost ground on April 7 and drive the Rebel forces back. Although a Union victory, it was not decisive and came close to becoming a major disaster. The courage and steadiness of union foot soldiers (such as the character Private Fritz “Dutchie” Bauer of the 16th Wisconsin) in the face of fierce attacks by equally determined Confederate infantry saved the day for Grant and Sherman in what otherwise might have been an end to their careers (and/or lives) on that battlefield. Shaara aptly describes the confusion, blunders and downright stupidity on both sides as well as the shock and terror of those young soldiers who were suddenly and unexpectedly thrust into a nightmarish slaughter the likes of which had never yet been witnessed in North America."}, {"userName": "happy", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/9369133-happy", "userReview": "Good read! Shaara use his tried and true template to tell the story of one of the bloodiest battles of the Civil War - the bloodiest up to that point of the war.He starts the book with the Confederate abandonment of Nashville and the political pressure that put on Johnston.He mainly uses the Confederate Gen's Johnston, Bragg and Beauregard to tell the Rebel side of the story. He mainly uses Gen's Grant and Prentiss and one fictional character, Pvt Bauer to tell the Union side. His vividly describes the reasons and results of the complete surprise of Sherman's division on the morning of the 6th of Apr as well as Union's defense of the Hornet's Nest and Peach Orchard during the middle of the day.He also describes the broken Union command structure on the second day.I highly recommend this to anyone interested in the Civil War."}, {"userName": "David", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/63194726-david", "userReview": "This is a read long delayed. When I was still a growing boy at home, I traveled to Shiloh during a \"Senior Trip\" with some high school teachers, my favorite, Mrs. Helen Darby the leader. I had endured her history classes, had little interest, until Shiloh. That visit touched my heart and from that day forward I became interested in Civil War history, ultimately the history of our nation.This read is for you, Helen Darby. You were the spark. Blessings in heaven to you, my dear teacher.Jeff Shaara did a great job with this one. Tough read regarding the pain and suffering but necessary to understand the men who served on both sides."}, {"userName": "Colin", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/7782805-colin", "userReview": "I just received the Advanced Uncorrected Proof from the First-Reads drawing! I am going to delve into this book tonight. I love reading historical fiction and this is going to be my 1st book by Shaara. I cannot wait to travel back to the Civil War and let his words put me into the lifes & times of the Battle of Shiloh. Will revise my review when I finish the book."}, {"userName": "Tom Darrow", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/5712506-tom-darrow", "userReview": "Not Shaara's best book, although not bad for historical fiction. The battle of Shiloh was/as a very confusing affair, both as a soldier and as a writer. Shaara correctly points out in the conclusion that very little was written about the battle after it was done, and most that was written was the Union officers fighting among themselves over where the blame and praise should lie. It was very ambitious for Shaara to take this battle on.Where this books shines is where Shaara always shines... he delves enough into the officer's names and historical terminology for a historian to feel appreciated, but makes it easy enough for Joe Everyman to read. His depictions of some scenes are vivid and the relationships between some of the characters are very personal. I went to the Shiloh battlefield about a year ago and was surprised by its appearance. It had nothing of the grand views and open fields that Eastern Theater battlefields have. Shaara's explanation of the trudging through mud, the woods and the ups and downs of the terrain made me feel like I was there in many ways. I wish I had read this book closer to when I went to the battlefield.On the negative side, some of the characters are very familiar and lame in feeling. We have all read a book of historical fiction where a private has their buddy private, the sergeant they hate and the captain they respect. This is another one of those. Also, this book had a few too many of the \"Red Badge of Courage\" moments... with the in depth descriptions of hospitals and inner monologues of \"is he going to run away or not?\" Finally, I don't feel like he did as good of a job depicting the historical characters as he has done in other books. I'm sure part of that has to do with the distorted nature of this battle, both during and after, but it still takes a bit away."}, {"userName": "Carl Alves", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/1435359-carl-alves", "userReview": "I have read some of Jeff Shaara's Revolutionary War novels, which were quite good, so I was looking forward to reading this novel that takes place during the Civil War at the Battle of Shiloh. After abandoning the city of Nashville, General Johnston and the Rebel troops are hunkered down in Tennessee. Meanwhile General Grant and Buell are planning on combining their forces and crushing Johnston. When Johnston gets wind of this, he sneak attacks Grant while he is still waiting for Buell. This starts the Battle of Shiloh, perhaps the bloodiest battle of the Civil War.There was a lot to like about this novel. Shaara does a great job with historical research, and I certainly appreciate that. The battle itself was dramatic and intriguing from a historical perspective. But what I think that I most liked about this novel was the humanization of some of these historical figures. It's hard to capture that just by reading a history book. I knew about the basic things that happened in the Civil War and who were the main players, but Shaara really brought these people to life with his writing. General Sherman was battling a confidence crisis with a loss at the Battle of Bull Run. General Grant was the brilliant mind who had to watch his steps with his superiors or risk being removed again from the field. Johnston was the strong-willed guiding force, who had he lived, could have guided the South to victory. Beauregard was the arrogant general whose hubris may have cost them the battle. On the down side, I thought the novel was overly long, and there was a decent bit of fluff that could have been cut out of this. In all, this was both informative and entertaining--a book that I recommend.Carl Alves - author of Two For Eternity"}, {"userName": "Travelling Sunny", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/8549273-travelling-sunny", "userReview": "UPDATED:So as I laid in bed last night starting into a new book, my hubby turned on the television to watch a new History Channel show about the Hatfields and the McCoys. Starring Kevin Costner and Bill Paxton. That's right - similar time frame, similar characters. And, I was distracted from my awesome new book by the awesomeness, the vividness, the intensity of the show. So, although I'm leaving this on the abandoned shelf for now, I'm only going to LOAN it out. I want to try this one again; perhaps when I'm in a different mindset... I still believe there's an audience for this.ORIGINAL:I think it's time to call this one done for me. I tried, I really did. It's clear that Shaara knows his stuff. The research put into this can't be argued. But, I'm just not ENJOYING it.I was super-excited when I read the synopsis. It sounded like the Battle would be brought to life for me. And, it's not bad when there's dialogue. But, I'm not really connecting with the big name characters, and I'm tired of reading through pages and pages of what feels like textbook history to help set the stage for me. I'd hoped the story would take me on that ride, but it feels more like I needed to have already known the main characters and history in order for the story to engage me.Couple that with the version I was reading - an uncorrected proof that was missing several of the explanatory maps - and that just left me confused.There's an audience for this, and I see a lot of great reviews for it here. It just wasn't for me."}, {"userName": "C.H. Cobb", "userReviewDate": "Dec 24, 2016", "userURL": "http://www.goodreads.com/user/show/5767233-c-h-cobb", "userReview": "Shaara’s account of the battle of Shiloh in the form of a historical novel does a great service by bringing to attention a battle the import and impact of which has been largely lost in the mists of history. The fields of slaughter produced by that conflict (24,000 casualties out of 100,000 combatants) are among the most horrific of the Civil War.Shaara continues with his style of tracing the movement of the battle through the eyes of a select set of characters on both sides, most historical, some fictional. His research, as always, is impeccable.On the negative side, there was too much climbing inside the thoughts of the characters, causing me as a reader to lose the thread of the tale. And the book could have used double the number of maps. In Shaara’s defense, the confusion I experienced trying to stay atop the action might have had something to do with the confusing reality of the battle itself. The generals running the show appeared to have the same confusion that I did reading the story so long after the fact.This one I would not characterize as a page-turner, but definitely a worthwhile and enjoyable read. Three and a half stars."}, {"userName": "David", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/3705706-david", "userReview": "I have read every one of Jeff Shaara’s historical fiction novels. These are well researched and put the reader into the mind of both the leaders and the shmucks on the ground during the key events of the wars. In A Blaze of Glory, Shaara begins a trilogy of books about the smaller battles of the Civil War, in this case the Battle of Shiloh. I do appreciate that there is value in bringing the story of this part of the war to life as many tens of thousands of Americans died. The difference in A Blaze of Glory is that the actual events that take place don’t seem as momentous as Gettysburg, the Revolutionary War or even the Mexican American War. The back and forth of the battlefield seems to go on and on and through poor leadership and stubbornness, many lives were unnecessarily lost. The lack of inspiring participants in this portion of the Civil war unfortunately detracts from my interest in its retelling. This is not representative of Sharra’s other excellent works. I give A Blaze of Glory a fair read."}, {"userName": "Suzanne", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/3739451-suzanne", "userReview": "A Blaze of Glory is the first in a series of four (so far) novels about important U.S. Civil War battles by Jeff Shaara. If you haven't read any of Shaara's works, I highly encourage you to do so. There is no finer writer of historical fiction when it comes to war.The focus of this novel is the Battle of Shiloh. Shaara presents the perspective of this battle through various military officers and less important soldiers. What's impressive of this novel (and all Shaara's works), is that the battles are so detailed and descriptive, as if he was there, and yet, you know all those details are accurate, because he obtained them through soldier's journals and memoirs.As a reader, I came to care about the characters (who were real people). I felt the excitement, the despair, the fear, and the anger. It's a truly riveting work, and one that was hard to put down. 4 1/2 stars."}, {"userName": "Christopher", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/12306131-christopher", "userReview": "An enjoyable but somewhat unfocused novel about the battle of Shiloh. Shaara focuses primarily on Albert Sydney Johnston and William Sherman and does a fine job portraying both men. Nathan Bedford Forest makes an appearance but that seems more gimmicky than anything, at least as a POV character. Shaara also continues his trend of POV chapters from junior enlisted on both sides and it's a welcome change from a General-centric narrative.The novel does a fine job setting up the two armies' maneuvers leading to the battle and spends its bulk on the first day's battle. Unfortunately, the second day of the battle (where the Union forces finally push back the Confederates), gets REALLY short shrift and feels too much like an afterthought."}, {"userName": "Russ", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/1001566-russ", "userReview": "I was pretty disappointed with this book. I've read Shaara's other nineteenth century historical novels, and his World War I novel as well, and found them all to be well written with pretty engaging characters. This book just didn't grab me. Of the point of view characters, Albert Johnston was the only compelling character, with Sherman and Grant being at least interesting. But the two \"in the ranks\" characters were dry and forgettable. The history behind Shiloh is, of course, interesting but if that's all I wanted, I could either read the battle's wikipedia entry or get a straight history of the battle. I'm pretty disappointed in this effort and I hope Shaara returns to form for the final two books of this trilogy."}, {"userName": "Cheryl", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/1425243-cheryl", "userReview": "This was a LOT of detail about a single Civil War battle...the Battle of Shiloh. When I was young, my family visited the site of this battle and I have never forgotten the special feeling that I felt there...similar to the feeling at Gettysburg. It is unbelievable the huge number of people who gave their lives on both sides for a cause they felt so passionately about!The single thing that impressed me the most about Jeff Shaara's account was that he did not portray one side or the other as the good guys or the bad guys, as so often happens. He simply chronicles all that happened on both sides...showing greatness and courage on both sides and the humanity and cruelty involved in a war."}, {"userName": "Rob", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/6578075-rob", "userReview": "You can't fault Shaara for innaccuracy in painting the history of the war and the personalities who fought it. I understand Shiloh better now than ever before, and so my historical interest is gratified, and so I become an even greater bore at parties. It would be unfair to carp that the dialogue sounds a bit modern. Perhaps that was the author's conscious choice, given the impatience of many modern readers. Even so, the book is a page turner, page after spellbinding page--and all the more interesting as it's completely true. I'm glad Shaara's doing this. He's the tonic for all those, like me, who got history poisoning in school but remained curious."}, {"userName": "Marilyn", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/3100006-marilyn", "userReview": "Excellent. I never really understood about the battle of Shiloh that took place in southern Tennessee in April 1862. Fourteen thousand casualites. Heartbreaking. No one writes better explaining these battles than Jeff Shaara. This is the first of what was supposed to be a trilogy but now has been extended to encompass four books that follow from Shiloh to Vicksburg, to Chickamauga-Atlanta-Savannah, and finally the the end of the fighting in North Carolina by Sherman and Joe Johnston. Lee had already surrendered to Grant two weeks earlier."}, {"userName": "John Nellis", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/5191125-john-nellis", "userReview": "Very good historical novelisation of the battle of Shiloh. Involves many of the key leaders of the battle; as well as fictional characters. This helps to give a good description of the battle. How it unfolded; and what it was like for the typical soldier as well. I really enjoy Jeff Shaara's style of writing historical fiction. It always tells of the event; and presents it in a very enjoyable reading style."}, {"userName": "Jeff", "userReviewDate": "Jul 12, 2014", "userURL": "http://www.goodreads.com/user/show/801557-jeff", "userReview": "One of my favorite authors, Shaara focuses on the Civl War's Battle of Shiloh in this novel. After reading so many of his books, the format is predictable and I didn't find the characters as engaging as past novels. However, this was still an interesting read, particularly for fans of historical fiction."}, {"userName": "Jim Bullington", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/8165513-jim-bullington", "userReview": "Excellent book. After having walked the Shiloh battle-field, this book brought the memories to life, through the eyes of those that were in the battle. I found through Ancestry.com that Isham Harris,an active participant in this battle, is an ancestor. I am going to continue to follow these armies in the second book in this trilogy."}, {"userName": "Harry", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/19244230-harry", "userReview": "I liked this book, but did not love it. It's not that the writing was sub-par, it's just that the subject matter feels very \"done\". But if you are Civil War enthusiast, this would be a fine book for you."}, {"userName": "Jon", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/253137-jon", "userReview": "I don't usually like historical fiction, but when I do I like books written by Jeff Shaara. As far as I can tell, Jeff has long since stepped out of his father's shadow and established himself as an accomplished writer. Shaara is quick to point out that if you really want to learn about the Civil War, Shelby Foote remains one of the best sources.I'm very much a civil war novice, but I did get the new Grant (Ron Chernow) biography this Christmas so I'm looking forward to taking a deep dive soon. Actually, I had never hear of the Battle of Shiloh, the focus of this book, before reading it.The Battle of Shiloh took place on April 6-7(8), 1862. At its conclusion it was the bloodiest battle at its time , with almost 24,000 casualties (13,000 from the Union and 10,000 from the South / Secesh). The battle took place in Tennessee, but near the Mississippi border. While the South did retreat from the site, it's really hard to call it a win for the North. It was hotly debated during and after the war and from what I can tell still is. Errors / incompetence on both sides cost thousands of lives. The majority of the deaths were the first day, followed by the 2nd, and the 3rd day isn't really the battle of Shiloh, but a skirmish off site.US Grant described the carnage, \"I saw an open field, in our possession on the second day, over which the Confederates had made repeated charges the day before, so covered with dead that it would have been possible to walk across the clearing, in any direction, stepping on dead bodies, without a foot touching the ground.\"The South had many more experienced soldiers / generals than the Union. The death of the southern General Albert Sydney Johnston at the Battle of Shiloh may have been the greatest loss to the South. Johnston had over 30 years of experience and had fought in several wars.Shaara ends many of his books by writing about what the characters in the book went on to do. The historian in me, enjoys these immensely. I was surprised to learn more about General Lew Wallace. Grant blamed Wallace for the Union's losses because his troops arrived late to the battle. Wallace never really recovered from the loss at Shiloh in a professional / military sense. A lawyer, Wallace served on the military commission that tried the Lincoln assassination collaborators. He then presided over what would be the first war crimes trial in the US, against a war camp director named Henry Wirz. Wallace went on to write Ben Hur, one of the most successful / popular books written in the 19th century. I've read the book Ben Hur and treasure it as one of the best books I've read. I grew up watching Charlton Heston in the movie Ben Hur.  This is probably about my third Shaara book on the Civil War. I've read an excellent one on the Mexican -- American War as well. I don't know how Civil War Buffs look at Shaara's books, but I continue to read them and learn more about the battles and personalities of the war."}, {"userName": "Steve", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/187108-steve", "userReview": "As 1862 takes hold of the calendar, the Confederate forces are faring none too well in the Western Theater. General Ulysses S. Grant has led Union forces in successful assaults on Forts Henry and Donelson, the first two significant victories for the Union. Confederate soldiers under the command of Albert Sidney Johnston flee the Forts and run deeper south, yielding the city of Nashville to the oncoming Union army. Most of Tennessee is now in possession of the northern aggressors.As A BLAZE OF GLORY opens, we see General Johnston attempting to hold together his forces and secure a retreat by having his cavalry, led by Colonel Nathan Bedford Forrest, hold the Union at bay for as long as practicable. He needed to unify his forces with those of General P.G.T. Beauregard, who was massing troops in Corinth, Mississippi. The Rebels were fairly broken and struggling to hold together, making them a perfect target for advancing Union forces.Luckily for them, General Halleck was more concerned with looking good for the papers and making sure his reputation with higher-ups out East was in good standing. He squabbled with those who reported to him and tended to punish those who found more success and made better names for themselves. One of his great targets was Grant. With General George Tecumseh Sherman by his side, Grant drove his men downriver and settled into camp at Pittsburg Landing. He was to wait there for reinforcement from Buell, and once united, they would strike down in pursuit of Johnston. Buell was slow in coming.On April 6th, Johnston and Beauregard led a surprise assault on Grant's army at dawn. Grant was not present, however, having been wounded two days earlier when his horse fell on him. Instead, General Sherman was in charge and had not anticipated an attack. The unsuspecting soldiers were forced back against the Tennessee River. A sunken road that became known as the Hornet's Nest provided the Union commanders with enough time to establish a viable counterstrike and lay defenses. The horrible fighting of the Hornet's Nest was both a success and a loss for each side: the Union troops bought time but lost over 2,000 men as prisoners to the Confederates. The rebels won that ground but were devastated when their commander, General Johnston, was mortally wounded; he would be the highest ranking soldier on either side to die during the war. Beauregard took command and continued to strike at Grant and Sherman, but he could not break them. Both sides settled in for the night and prepared for the next day's conflict. Beauregard had no real sense for the battle lines and was unaware that, as the night wore on, Buell had arrived with reinforcements for Grant. Upon waking, Beauregard was unknowingly outnumbered.The battle of the second day was no less fierce than before, and the reconstituted Union force continued to drive and pummel Beauregard's lines, pushing them to retreat back to the old Shiloh Church. There, Beauregard would hold the Union for a time, but as evening came on, they would begin to fall back to Corinth. Grant and Buell would argue over whether to pursue the Confederates, but Grant stated that his tired men would not march. He sent a force with Sherman the next morning to move toward Corinth. In an area known as Fallen Timbers, Sherman encountered Nathan Bedford Forrest. The great Confederate Cavalry leader would be severely wounded by a shot to the hip, but he would still escape with his men.Grant would be vilified by the media for the loss of life and poor performance on the first day of battle. Rumors would swirl that he was drunk. Lincoln refused to remove Grant, but Halleck would demote him for a time. Sherman, who had recently come back to the fighting after a sabbatical for mental issues, proved his worth in remarkable fashion. Their ability to work together as a cohesive unit would bring further victories for the Union as the days and years wore on.It is here, in the grim killing fields of Shiloh, that Jeff Shaara brings us back into the Civil War, and he does it will all the exquisite skill one has become accustomed to when picking up a volume of his work. A BLAZE OF GLORY is a riveting installment in Shaara's historical fiction catalog. Once more, the depth of his knowledge and research about the combat and its related soldiers is unparalleled.The main leaders are brought out as fascinating, living actors on this bloody stage; Grant, chewing on his cigars, his tactical mind showing its under-appreciated skill and the fiery drive of Nathan Bedford Forrest as he contemplates the best way to destroy the north. The most impressive, however, is George Tecumseh Sherman. Shaara is masterful at showing the Union General and his nervous, paranoid nature, seeing the enemy behind every shadow and fearful of ambush. All of this will fade as the hellfire of battle erupts, and he must take charge of the lines, putting himself amongst his men to urge them and inspire them.Shiloh, to this point of the war, is the bloodiest battle in American history with over 23,000 killed or wounded. While A BLAZE OF GLORY excels with the presentation of the military minds behind the strategy, it surpasses an already high plateau as we are introduced to the simple men called to fight on behalf of their warring nations. These fictional representations settle the reader into the very heart of the conflict and bear witness to the true horrors described, as the Hornet's Nest is assaulted and men fall fast and furious in the Peach Orchard as blossoms rain down from the trees during the firefight.Shaara isn't here to lay out every fact and detail of Bloody Shiloh. In fact, in his introduction, he advises those seeking to get the numbers and tactics right down to the last detail to read books by prominent historians. His purpose is to present the battle with a scintillating amalgamation of fact and a dose of fiction. The results in this case are brilliant.The title of the book is drawn from a quote from James A. Garfield, a Union General and future President, and presented in the opening pages: The horrible sights that I have witnessed on this field I can never describe. No blaze of glory, that flashes around the magnificent triumphs of war, can ever atone for the unwritten and unutterable horrors of the scene of carnage.We will never fully understand nor be able to wholly comprehend the savage and horrific scenes that unfolded on the land surrounding the old Shiloh church. But Shaara has transported the reader onto that drenched field, leaving them shivering in the night following the first exchange of fire and listening to the wounded and the dying crying out as the rains come down again, men weary from long marches, sickness and war. It is not too difficult to smell the wet wood, marvel at the drifting peach blossoms as the trees are torn apart, or feel the weight of a broken nation as its sons fall in numbers too great to justify. These things all emerge from the dust of history because of the deft writing of Shaara, which makes A BLAZE OF GLORY a work to be embraced."}, {"userName": "Kenneth Barber", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/12840025-kenneth-barber", "userReview": "This volume traces the events leading up to and including the battle at Shiloh. Grant has brought his army South to the Tennessee River and established his base at Pittsburg Landing. He is ordered by General Halleck to await the arrival of General Don Carlos Buell and his army of the Ohio. Their objective is Cornith, Mississippi and the railroad junction located there. The southern army, commanded by Albert Sidney Johnston, has fortified the city. Johnston decides to advance on Grant's army and surprise him with an attack. The Union forces are caught completely by surprise and routed. However, Johnston is fatally wounded and Beauregard assumes command. He inexplicably halts the attack just when the route seems poised to destroy the Union army. This reprieve gives the Union forces time to reorganize and for Buell's army to arrive to re-enforce Grant. The tide is turned the next day and the Union forces force the Confederates to retreat back to Cornith. This battle is one of the bloodiest battles of the war with 24,000 casualties combined. The author tells the story through the eyes of the officers and enlisted men. It details the action on both sides of the conflict and tells a factual story."}, {"userName": "Robin Friedman", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/22269025-robin-friedman", "userReview": "I read \"A Chain of Thunder\" (2013), Jeff Shaara's novel of the siege of Vicksburg, and then worked back to Sharra's novel of last year \"A Blaze of Glory\", (2012), a historical novel of the Battle of Shiloh. The two books form part of a projected trilogy of historical novels of the Civil War in the West. The third volume, which will cover the War in Georgia and the Carolina's, including Sherman's March to the Sea, will be published next year. Each of the three books commemorates the 150th anniversary of the events they describe.Fought April 6-7, 1862 on the banks of the Tennessee River about 20 miles north of Corinth, Mississippi, the Battle of Shiloh was a pivotal conflict of the war. The Confederates launched a daring surprise attack against a Union Army encamped but without entrenchments at Pittsburgh Landing, Tennessee. The attack seemed to come close to success on the first day of hard fighting but the Confederate Army was pushed back to its base at Corinth on the second day. The Confederates launched the attack to try to recover previous severe reverses in Tennessee and Kentucky.The battle presents a good subject for a historical novel with hard fighting, heroism, and many tantalizing possibilities. In a short introduction to the reader, Shaara describes the difference between historical accounts of a battle and historical fiction. A history is limited to the evidence at hand and focuses on information and on external events, such as troop movements. A novel explores character and motivation, by imagining conversations, reflections, and actions of the characters that help bring understanding to events. Shaara writes: \"the points of view of the characters in this story are more appealing than the blow-by-blow facts and figures that are the necessary products of history textbooks. For that reason, I try to find those specific characters who pull me into the story, whose actions affect the history of the event, and whose own points of view will, I hope, bring that story to you in a way you find more intriguing and more personal than what you might have read in high school.\"For Shaara, the character interest in this story centers in the figure of the Confederate commander, Albert Sidney Johnston, who has, for many, become a legend. A highly regarded and charismatic figure, Johnston had been severely criticized for the Confederate reverses at Forts Donelson and Henry, with many in the South calling for his ouster. He sought to redeem himself at Shiloh. In the middle of the first day's fight at Shiloh, April 6, Johnston was killed while in the front of the battle, seeking to encourage reluctant troops to extend the Confederate line against Union defenders. He became, and remains, the highest ranking American general to die in combat. Shaara offers a thoughtful portrayal of Johnston as a man and as a commander in ways that would not always be discussed in a standard history. His account of Johnston's death, for example, is moving and appropriate for a figure of heroic stature.Johnston dominates this novel of Shiloh. Shaara also offers portrayals of the leaders on both sides, including U.S. Grant and Sherman for the Union and P.T. Beauregard, Braxton Bragg, and Nathan Forrest for the Confederacy. Beauregard was Johnston's second in command and became the commander upon Johnston's battlefield death. Shaara also introduces fictitious characters to represent the troops on the line. For example, he creates the character of Thomas Bauer from Wisconsin, a young man who receives his first exposure to combat at this horrific battle. Bauer also plays a prominent role in Shaara's subsequent Vicksburg novel. Each chapter in the book is presented from the perspective of one of the major characters, from the Union or Confederacy.The book is long and flags in places. It is most effective in its depictions of Johnston and in the sections that are most novelistic. These scenes tend to involve small groups of characters when they discuss proposed actions and their thoughts about them. Shaara also works to get inside the minds of individual characters. Shaara also captures the confusion, indisciplined, and hard-fought actions of the battle. Most of the account centers, as it should, on the April 6 combat while the successful Union counterattack on April 7 gets a much briefer treatment. The battle scenes would have benefitted from tighter, more succinct writing.The combat and battle plan at Shiloh was difficult and remains controversial. Shaara offers a lucid approach to the battle and to the Confederate Army's strategy and tactics in the fight. Shaara follows the standard historical approach to the battle by emphasizing the Union stand at the center of the field at the Hornet's Nest under troops commanded by General Benjamin Prentiss. Many modern students of the battle argue that the significance of the Hornet's Nest has been overemphasized at the expense of action at other parts of the field.Students of the battle have reached varying conclusions on the impact of Johnston's death. Beauregard called off the offensive late in the afternoon of August 6. His decision has been questioned by many with the implication that Johnston might have pressed the attack to a successful conclusion and won the day. Shaara's account shows some sympathy with this view, together with a great deal of sympathy for Johnston over Beauregard. Many students of the battle have supported Beauregard's decision to halt the fighting on April 6.Shaara's novel will serve as a good introduction to Shiloh for readers who do not want to be bogged down in complex military histories. He tells a good story well. Readers with a serious interest in Shiloh will have an enhanced understanding after revisiting the battle in Shaara's account.Robin Friedman"}], "description": "In the first novel of a spellbinding new trilogy, New York Times bestselling author Jeff Shaara returns to the Civil War terrain he knows best. A Blaze of Glory takes us to the action-packed Western Theater for a vivid re-creation of one of the war’s bloodiest and most iconic engagements—the Battle of Shiloh.   It’s the spring of 1862. The Confederate Army in the West teeters on the brink of collapse following the catastrophic loss of Fort Donelson. Commanding general Albert Sidney Johnston is forced to pull up stakes, abandon the critical city of Nashville, and rally his troops in defense of the Memphis and Charleston Railroad. Hot on Johnston’s trail are two of the Union’s best generals: the relentless Ulysses Grant, fresh off his career-making victory at Fort Donelson, and Don Carlos Buell. If their combined forces can crush Johnston’s army and capture the railroad, the war in the West likely will be over. There’s just one problem: Johnston knows of the Union plans, and is poised to launch an audacious surprise attack on Grant’s encampment—a small settlement in southwestern Tennessee anchored by a humble church named Shiloh.   With stunning you-are-there immediacy, Shaara takes us inside the maelstrom of Shiloh as no novelist has before. Drawing on meticulous research, he dramatizes the key actions and decisions of the commanders on both sides: Johnston, Grant, Sherman, Beauregard, and the illustrious Colonel Nathan Bedford Forrest. Here too are the thoughts and voices of the junior officers, conscripts, and enlisted men who gave their all for the cause, among them Confederate cavalry lieutenant James Seeley and Private Fritz “Dutchie” Bauer of the 16th Wisconsin Regiment—brave participants in a pitched back-and-forth battle whose casualty count would far surpass anything the American public had yet seen in this war. By the end of the first day of fighting, as Grant’s bedraggled forces regroup for could be their last stand, two major events—both totally unexpected—will turn the tide of the battle and perhaps the war itself.", "title": "A Blaze of Glory\n      \n          (Civil War: 1861-1865, Western Theater #1)", "url": "http://www.goodreads.com/book/show/12788664-a-blaze-of-glory", "average": 4.03, "cover": "https://images.gr-assets.com/books/1344368928l/12788664.jpg", "reviews": 459, "authors": [{"url": "https://www.goodreads.com/author/show/14655.Jeff_Shaara", "name": "Jeff Shaara"}], "type": ["Historical", "Military History", "Fiction", "War", "War"], "outlinks": ["http://www.goodreads.com/book/show/12788664-a-blaze-of-glory", "http://www.goodreads.com/book/show/12788665-a-blaze-of-glory", "http://www.goodreads.com/book/show/23384512-a-blaze-of-glory", "http://www.goodreads.com/book/show/17162139-a-blaze-of-glory", "http://www.goodreads.com/book/show/29925.Gods_and_Generals", "http://www.goodreads.com/book/show/29923.The_Last_Full_Measure", "http://www.goodreads.com/book/show/36446571-rise-to-rebellion", "http://www.goodreads.com/book/show/29917.The_Rising_Tide", "http://www.goodreads.com/book/show/785003.The_Glorious_Cause"]}