{"ratings": 17993, "userreviews": [{"userName": "Wendy Darling", "userReviewDate": "Apr 22, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "4.5 stars Wow. Is this really being shelved in young adult fiction? Laura Whitcomb's writing is deliciously wordy, witty, and wonderful, and the story surprisingly complex with many mature themes. The author did a fantastic job of minding the formal speech and thought patterns of Helen's background and contrasting them with the jarring reality of present day, all while ruminating on human existence and forgiveness and the value of a life well-lived. This is an exceptionally intelligent YA book that does not spare the emotions of love and grief and the heavy weight of responsibility. I particularly enjoyed Helen's delight at the burst of sensations she experiences when as she discovers the touch and taste of certain things for the first time, as well as the sad, aching pull of her attachment to her human hosts.The suddenness of the physical relationship between Helen and James surprised me, though, as until that point everything had unfolded very slowly and naturally. Still, the connection between these two lost souls is undeniable, as they are so well matched as lovers of literature, people of integrity, and most profoundly, as the only known beings in that plane of existence. I'm astounded by the places this book was bold enough to explore, and I am deeply satisfied with how the story was resolved. It's truly remarkable when an author can make a ghost feel so eloquently and painfully human."}, {"userName": "Emily May", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "This is a book I've had sitting on my shelf for over a year, I'd heard plenty of good things about it but still remained sceptical* about the whole ghosts + romance thing. Eh, really? Ghosts are somewhere down near zombies on the sexiness scale, could I really become invested in such a relationship? Apparently yes, but these ghosts have found a way around the whole touching predicament (and wasted no time getting back into it) by possessing the bodies of people whose souls have abandoned them.I have read some of the negative reviews on A Certain Slant of Light and the thing most often pointed out is something which usually annoys me: the way Helen and James fall so quickly in love and have sex after only meeting each other a few times. The reason this whiff of insta didn't bother me so much in this case is because I was sold on the idea of their loneliness, the pain Helen felt in watching so many people grow, have fun and die whilst she can never be a part of their lives... it led me to understand why these two lost and lonely souls would latch onto one another straight away and cling together to find what they've been missing for so many years. I could believe in the desperation.And that's all I really want: to understand. It's why I'm turned off by insta-love and destiny-bound lovers, because that's \"tell\", not \"show\" and it's empty. In this novel, Laura Whitcomb gives me what I need to care about the couple, whilst maintaining a beautiful and slightly creepy atmosphere.However, this story it still far more than just a romance. Helen and James are haunted by a few scattered and incomplete memories of their past and they must put the pieces together to remember who they are, how they died, and what holds them in this strange limbo. But will the truths of their past be too much to handle? Or will they finally get some peace? As well as this, they also begin to discover why the souls of their host bodies have abandoned ship, what it was in their lives that made them give up.James possesses the body of a drug addict who's been in trouble with the police multiple times and lives alone with his temperamental brother. With both parents gone, the two young men struggle along by themselves. Helen, on the other hand, possesses the body of a teenage girl who's parents are extremely religious - right away we are introduced to the \"abortion is murder\" bumper stickers - they have prayer time and read the Bible every night before bed. As events unfold, it becomes clear that not everything is as holy as it seems in this family and, though it may not be the main part of the story, this subplot about religious hypocrisy was quite brilliant... and a little scary.I recommend this for paranormal fans who enjoy something a bit out of the ordinary............................................................................................................*I wrote \"sceptical\" in another review and a really nice person told me to learn how to spell. So, just to let you know, this is actually the correct spelling in Britain. I'm British. Just thought I'd save trolls some typing time."}, {"userName": "Hannah", "userReviewDate": "May 24, 2010", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "What a disappointing read this was. After seeing all the high ratings for this (including my own daughter's 4-star rating), I was eagerly anticipating a unique and touching ghost story. Sad to say, nothing in this story touched me in any way, and in fact it's one of the worst books I've read in 2011 so far, filled with ham-fisted stereotypes and unbelievable character actions.Whitcomb actually had a fairly interesting premise starting out. Helen, a young woman dead for 150 years, makes her way out of purgatory/hell(?) and cleaves to a succession of human hosts. Helen haunts them until they die, and then finds another to stay with. They are never aware of her, however, so Helen stays in this static limbo for over a century. Her current host is a senior high English teacher, Mr. Brown, and it is in his class that she realizes that there is, in fact, someone who sees her.This is where the story disintegrated into a cliched, stereotypical YA teen-angst drama. I am supposed to swallow the idea that Helen, a post civil war young lady, and James, a WWI doughboy who died 85 years ago and now inhabits a 17 year old stoner boy's body, meet and instantly fall \"in love\" (\nlove, really? how about lust\n) and consumate their physical relationship after only a day or so. Riiiiiiiiight. Guess all those decades in limbo does crazy things for the libido, (\nregardless of the time period and social mores that Helen and James lived in\n). And we all know that teenagers just can't control their sexual urges and will do the deed with anyone, anytime, anywhere. And it makes it especially *cool* that Helen now inhabits the 15 year old body of a virgin whose parents fulfil every cliche of religious nut cases, (\n'cause of course that gives this book that \"push the envelope\" kind of edginess that it needs to attract teens\n). I found this entire section of the story trite and melodramatic, and it didn't do anything to further what might have been an interesting story about death, the afterlife and the premise of haunting. In essence, it became just another bad piece of YA fiction, filled with foul language, inappropriate sex scenes and cliched stereotypes of teenagers and religious people.Promising beginning. Interesting final pages. Utter dreckage in between."}, {"userName": "Morgan F", "userReviewDate": "Aug 22, 2010", "userURL": "http://www.goodreads.com/user/show/2941288-morgan-f", "userReview": "I started this book the day the world ended. No, not in a literal 2012-tsunami-earthquake kinda way, but in a my-cell-phone-and-laptop-just-so-happened-to-break-on-the-same-day kinda way. And when you are a 17 year old girl, that is really, really bad. So while I was rolling around on the ground suffering from texting withdrawl, a thought occurred to me: Go read a book, you idjit! So I did. And in no time at all, I forgot the outside world existed. To say I loved this book would be a severe understatement. So here is a list of adjectives I feel are adequate descriptions: (courtesy of Dictionary.com and my own unique vocabulary):Awesome, addicting, seductive, intense, articulate, lush, fantasmic, suspenseful, beautiful, poetic, dark, amazing, unique, mysterious, romantic, excellent, gorgeous, wistful, eerie, superb, breathtaking, magnificent, wonderful, fascinating, Gothic, OMG, astounding, perfect, sublime, tender, painful, and last but not least, Jesus. So, in short, it was damn good. I just loved everything about it. The luscious writing, painfully real characters, intriguing premise and hushed tone. Everything, especially the ending, was just perfect. As soon as I was finished with it, I wanted to start it all over again (and I very nearly did). Initially, I thought this book would scare the crap out of me, with the creepy cover and all. I read Laura Whitcomb's book The Fetch first, and I loved it, even though this novel is more universally loved. So perhaps I was biased going into it. But I'm positive I would have loved it no matter the scenario. As for the SEQUEL *OMG SQUEAAAALLL*, I don't think it's really needed, but hey, I'll devour it anyway. I'm a little worried it won't be as good as Certain Slant. seeing as most unplanned sequels aren't, but even if its half as good, I'll still love it."}, {"userName": "Tatiana", "userReviewDate": "Apr 30, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "I don't think I would have read this book if it wasn't recommended to me. I am just not that into ghosts. However this book is so much more than that. It is about love and finding peace and happiness in your (after)life. The motives of forbidden and impossible love and \"body snatching\" reminded me strongly of certain Stephenie Meyer novels we all know, but SM's books seem to a be pile of mediocrity in comparison to A Certain Slant of Light. The depth of feeling SM failed to achieve in 3000 pages of fluff prose is achieved by Laura Whitcomb in 300. I highly recommend this book to anyone interested in quality literature."}, {"userName": "Catie", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "[It seems that the author is hinting quite strongly (the menstruation calendar comment, the fainting, the nausea, the fluttering) that Jenny is pregnant. How are these two young people, who barely know each other and have extremely different histories, going to manage a pregnancy? Jenny is only fifteen years old! And the whole meeting between Jenny and Billy at the end feels so contrived and forced. It is as if she’s saying, “oh, don’t worry, it’s okay, because these kids totally would have approved of their bodies being used!” No. (hide spoiler)]"}, {"userName": "Buggy", "userReviewDate": "Jan 04, 2010", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening Line:\"Someone was looking at me, a disturbing sensation if you're dead.\" This is one of the best books that I've read in a long time. And although it's being touted as YA this can absolutely be enjoyed by adults and as one I'll be recommending it to all my friends. It's just a beautiful story of fated romance no matter what your age. A CERTAIN SLANT OF LIGHT tells the story of a girl named Helen who's been dead for a 130 years. She is now a ghost or \"light\" as the author calls her existence. In order to keep from plunging into hell Helen must cling to a human host, never leaving their side. She has had many hosts over her years, her latest being Mr.Brown, an English teacher. It's in his classroom that she meets James, the first person able to see her since she died.James was \"light\" until recently when he took over the body of his host during his drug overdose. Helen and James begin meeting and quickly fall in love. Eventually James convinces Helen that she should also inhabit a host so that they can both be human and together they choose Jenny. The only problem with Jenny is that her parents are religious fanatics and James's host Billy is a former drug addict with questionable friends. This makes living their hosts lives and maintaining a relationship kinda tricky. The writing here is beautiful and the story original and interesting. The obstacles our lovers have to face as they try to find their HEA are incredible. This book had me up late at night and I will be thinking about it for a long time to come. Highly recommended for all ages. Cheers!"}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "A Certain Slant of Light is often disturbing and very heavy as far as paranormal books go, but it's also a beautiful story of facing the past to find the future, and its characters, though not always likable, are understandable and captivating."}, {"userName": "Giselle", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "[They basically take 2 bodies and have sex with them! Haha (hide spoiler)]"}, {"userName": "Leslie", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/5433591-leslie", "userReview": "What a difficult, beautiful and fascinating book. It wasn't riveting or necessarily suspenseful, although it was filled with incredibly unique descriptions from a ghost's point of view, that if I didn't know any better, I would sincerely believe the author actually spent time as one. Helen is a ghost and for the first time in 130 years, human eyes are looking at her. Those eyes belong to a boy who has not seemed remarkable until now. Helen is terrified and also unnerved by the fact that he can see her; but she also finds herself incredibly intrigued. She is immediately drawn to him and discovers his name is, James. The fact that he is in a body and she is not presents this preposterous couple with their first challenge. Now, the two of them struggle to find a way to be together as they begin to discover the secrets of their former lives and also of the young people they come to possess.If you're reading the synopsis of this story or even describing it to someone, it actually sounds a little \"hokey.\" However, it works and on so many different levels - and is a story of forgiveness and ultimate healing for the dead and the living. The author intertwines modern-day dysfunction with 130 year old history, to develop a surreal yet difficult to imagine kindredship amoungst her hero and heroine; all the while making it believable. I did, however, wish Whitcomb had devoted more pages to the romance between Helen and James - but the time they did spend together was beautifully written.This is not a \"feel-good\" story - it's unapologetically \"heavy\" and attempts to send a message. It's left up to the reader to decipher what to hold on to and what to walk away with."}, {"userName": "Rachel", "userReviewDate": "Jun 04, 2010", "userURL": "http://www.goodreads.com/user/show/2499261-rachel", "userReview": "For some reason, I feel as though to be able to review this book, I need to qualify whatever I'm going to say with the fact that I'm not really a romantic person. I believe in the possibility of establishing a human connection with someone after first meeting, and I believe in the possibility of lust at first sight. But I also believe that there is a giant difference between infatuation and lust, and actual love. And yes, to me infatuation and lust are more common but much lesser entities than the latter, which takes time and conversation to develop.Phew. So that's why I wasn't moved by the majority of A Certain Slant of Light, by the romance of ghosts Helen and James. Two ghosts who are the only other ghosts each other has ever known would of course feel a spiritual connection to one another. I'm just not sure that that has to be resolved by inhabiting earthly bodies for constant kissing and sexing, y'know?The technicalities and sensations (or lack thereof) of being in the middle place between life and afterlife were interesting, though, and I absolutely adored the development at the end, when we learn more about what Helen had on Earth. Without spoiling anything, there is a relationship that Helen had in her earthly life that I was much more interested in than anything she did as Jenny. (Or, since I'm never above stooping to a corny joke, anyone she did as Jenny.)"}, {"userName": "Jessica", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "TBR Reduction Challange #4 (Kirsten)I have never read anything like this before!I must admit that it took me some time to get used to the whole concept of body snatching and that I could never really shake the feeling that James and Helen were doing something wrong by inhabiting those \"empty\" bodies but nevertheless, after about 50 pages I was completely hooked. I remember going through a mass of different emotions while reading this. I loved seeing how James and Helen experienced how it is to be alive again, I was sick to my stomach whenever I read about Jen’s parents and their twisted believes, I was creeped out by Jen’s father and was dying to know what he was hiding from his family and I was constantly afraid that another one of Billy’s hidden packages would show up and that something awful would happen. I’m having a hard time finding the right words to describe this but A Certain Slant of Light is definitely one of those books I recommend to everybody. A captivating story that impresses with its brilliant writing."}, {"userName": "Asghar Abbas", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "Now this was an actual ghost story. But it is not horror. The distinction is an important one. Not all ghosts haunt nor all memories hurt. It took me a while to understand the title, I am so slow sometimes, but when I finally got it, I was like, ok that's clever.The silence in this book absolutely reminded me of the one in Never Let me Go, it's gorgeous. It would be interesting to see if they make a movie out of this. Under a stylist director, preferably European, maybe Nicolas Winding Refn ? But after Drive he swore off Hollywood, can't say that I blame him. I wonder how they'll show ghosts and their human counterparts, will they use the same actors when traveling in and out of bodies. So much potential to have fun with, the technical aspects of this finely tuned story. The writing in this book is so nuanced, everything is so subtle, nothing is spelled out. That's when you know a book is intelligent. A teacher wrote this, so it is hardly surprising it is this well written. That she did it with such understanding of ghosts and their humans, is what makes this such a delight to read. So smooth and cool. I also enjoyed the running metaphor; our ghost was somewhat like a muse to her host, how muses are kinda like ghosts, so that's apt. On the other hand, I have always thought of writers as ghosts. Religion is well handed, no sentimentality or hidden agenda. No preaching here. It is selfless and not overbearing. She believes in a God but it's actually relevant to the story. Plus, there is a valid critique of self-righteousness found in some if not most people. It is all done very Lightly and not in your face. No confirmation biases here, at least. Can we say what a lovely cover. The writing, the prose is so very beautiful, but it is gentle."}, {"userName": "Kristy", "userReviewDate": "Nov 15, 2010", "userURL": "http://www.goodreads.com/user/show/2705039-kristy", "userReview": "Ok, I can here you all shouting \"We told you so, we told you so!!!\" It was awesome, unlike any other book i've ever read. WOW, just WOW!!!!This is a story of a Spirit, Light as named in the book. The Spirit of Helen, who has shadowed people for over 100 years. Helen who finally meets someone who can see her, James. James who is also a 'spirit', but he has inhabited a person's body, someone who seemed to have no spirit left. Helen is amazed. She finds her 'body'. A girl named Jenny. We follow Helen in the life of Jenny. Jenny's family are religious fanactics, but they are not the faithful subjects they project to the outside world. Helen must kill Jenny's personal demons, but on this quest she finds out she must kill her own. Deep and moving. I can't even describe this one to make you understand how good it is!!! I have to admit it took me to about page 100 to really understand and get into it, but WHAM after that it was on like donkey kong!!If you are a YA reader, I am Screaming at you to pick this one up!!!If you are interested in Spirits, Wraiths, etc., but not to the point of being scary... pick it up!!!If you want a different book, that is hauntingly beautiful... you know what to do, pick it up!!!!Worth buying."}, {"userName": "Bonnie", "userReviewDate": "Oct 06, 2012", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "'That I am your heart's secret fills me with song. I wish I could sing of you here in my cage. You are my heart's hidden poem. I reread you, memorize you every moment we're apart.'This was a real shocker for me that I enjoyed it as much as I did. For one, this has been on and off my TBR shelf several times as I would occasionally decide that this is simply not for me and I have no plans to read it. But go figure a few months later it pops up on my Goodreads timeline, I take another glance and decide it may be worth a shot. Thanks, Wendy, for giving me that final push. :)I was actually quite touched by Helen and James' relationship/connection (at least I was once I overlooked their questionable acts). Helen had been Light (a spirit) for well over a century and not once spoke to anyone that entire time and had never quite realized how desperately she craved the company of another. Their feelings for each other were instantaneous yet it thankfully managed to not feel akin to every other insta-love situation these days in YA literature. Helen and James have their own special situation and instead of calling it insta-love I would consider it more of an extreme fascination with one another as they are the only ones of their 'species' as they called it. I know that I should have been repelled by the whole concept of human's walking around 'empty' just ripe for the taking for deceased spirits. That their soul can be absent, drifted off to a new place, while their body remains living its life. It really was a creepy concept/possibility but what honestly scared me the most were Jenny's religious extremist parents. Before Helen came along, she watched Jenny for some time as she simply went through the motions of life without exuding any sort of emotion. Being so constricted by your family, being forced to obey and follow such rigid rules, and forcing their religion into every facet of your very being? Now that's scary.This is one of those books where the writing truly took my breath away. It flowed so beautifully and was a real delight. I loved how she kept Helen's speech true to form considering she wasn't from this day and age. That type of extra little touch really helped make this a very special book.This is a novel about love but it's mostly about learning to forgive yourself for the very reason Helen and James were still on Earth to find each other was because they hadn't relived their final moments in order to forgive themselves for the actions they made. This was a wonderful, mature, YA novel with hints of romance, paranormal, and learning to find peace.'Your mind will never lose anything forever that's worth keeping.'"}, {"userName": "Heidi", "userReviewDate": "Oct 02, 2007", "userURL": "http://www.goodreads.com/user/show/127529-heidi", "userReview": "Oh my, this book was good. I only meant to read it during my lunch hour, but I found myself engrossed. Needless to say, I didn't get much work done yesterday.It's a ghost story, but not a scary one. Helen has been dead for 130 years and remembers only that she was a woman who had been married. She finds herself stuck between earth and hell, knowing that something about how she died is keeping her from heaven. She attaches to \"hosts\" who don't know she's there but still feel her influence somehow. She's happy with this existence, until one of the students in her host's high-school English class sees her. She finds out that it's not really the student who sees her but James, the ghost inhabiting the student's body. For some reason the student's spirit had chosen to leave his body, but the body hadn't died. So James, who was 29 when he died, jumped in and took over. James also finds himself stuck. Of course the two ghosts fall in love, and James helps Helen find another abandoned body to inhabit. This causes complications in the lives they've adopted, and they learn more about why their adopted identities abandoned their bodies, as well as more about the circumstances of their own deaths.I'd hesitated picking up this book because one of the reviews on Amazon said something about \"graphic sex,\" but I found that it was neither graphic nor gratuitous nor titillating. Still, with what is there and the few (non-gratuitous) uses of the f-word, I know some people (Jessica) wouldn't like it. It does leave some \"what now?\" questions at the end, but even those situations are hopeful, and you know that even if the characters have some tough times ahead of them, they're going to be ok, and better off than they were. And some elements of the ending were so tender that I found myself tearing up."}, {"userName": "Meredith", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/603582-meredith", "userReview": "Ugh. So many things I hate about this book. Newsflash, Helen: the reason you didn't get into heaven is because you suck! It's not a badly written book-parts of it are actually quite beautiful. But the plot fills me with so much rage!!! For example, right after you and your ghost boyfriend have sex during your free period at school, you tell your mom that he's a gentleman. NO. HE'S NOT. First of all, gentlemen don't skip class to do it with you in the auditorium. Second of all, those aren't your bodies!!! Possessed people/ghost sex is just disgusting, and I really, really hate this book for it. And the stereotypical hypocritical Christians were so lame that I wanted to die to escape them. Definitely not a book I'd recommend.This book has about a billion good reviews, but I honestly don't know why. HATE."}, {"userName": "Kat (Lost in Neverland)", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/5749698-kat-lost-in-neverland", "userReview": "[the day after Helen takes Jenny's body, the first time she sees James they immediately start making out and have sex in the auditorium.I get it, you're both dead and you've never met your own kind before and you're adults, but GEEZ. These are kids you're inhabiting here! (hide spoiler)]"}, {"userName": "ivana18", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/4939889-ivana18", "userReview": "There's so much to say about this book that I fear that my words will not be good enough. A Certain Slant of Light is unconventional in so many ways.First of all it is labeled as a YA but it is not a YA book. The main character is 27 year old Helen who died 130 years ago and she's been haunting people ever since. She wants to go to Heaven, wants to cross over, but something mysterious and painfully terrifying is keeping her in between worlds. So in order to keep the pain at bay she clings to people, her hosts. All of her hosts are artistic. Her first host The Saint loves poetry, the second host The Knight is also into poetry, and then there's The Playwright and The Poet and Mr. Brown who holds a special place in her heart. When she's near them she doesn't feel pain. Helen coexists with them in kind of a symbiotic way, she feels safe with them, and the loneliness is tolerable because the hosts she's with are good people, people she cares for very much. And she feels like she's giving something back to them by whispering ideas to them, by being their muse.No one knows Helen exists and no one can see her. She feels like she's the only one of her kind in the World, the only Light, so she's bewildered when a teenage boy in Mr. Brown's class not only sees her, but is like her himself. James is a young man who died at the age of 29 and has been dead for 85 years. He's not haunting people but places (actually one place in particular) and one day he sees a teenage boy, Billy Blake, whose soul has left his body, so he enters him and starts living his life as Billy.The connection between Helen and James is strong and (of course) they fall in love/lust with each other. In order to truly be together they need to find a body for Helen, so they find Jenny's body, and Helen enters her.I found the body snatching quite disturbing. It felt wrong, not just because they are using their bodies, but they are taking their places in the real world. I mean, I really do understand their need to be seen and heard again after so many lonely years, and to breathe and taste food, and to touch and be touched by another person....but being human again comes with a price, because both Billy and Jenny have skeletons in their closets. They have secrets that drove them away from their bodies. James and Helen slowly learn what those secrets are, but they don't now how to deal with them....those are not their secrets to deal with, and those are not their families. And after a while they realize that the body snatching has an impact on other people in Billy's and Jenny's life. They are trying to pick up the peaces of their host's lives, while trying to come to terms with their own pasts and the reasons why they have not crossed to the other side.I'm going to stop here, because every reader needs to figure out the rest for himself/herself.Whitcomb's writing is beautiful and the book is beautiful, it has so many layers....so much depth. The reason I gave it 4 stars and not a 5 stars is because, at one point I found Helen a bit childish and irresponsible. Her reactions to some of the stuff that were happening to Jenny's family and to Mr.Brown were cowardly and childish reactions. She's not a child and she's been around for 130 years, so she should be able to act more grown up about some things (especially about what happened to Mr. Brown!!!!). James was much more responsible while dealing with Billy's life and family. He did the right thing much sooner then she did (actually, she didn't do much and, in the end, it felt like she failed Mr.Brown).But the ending was beautifully done. Whitcomb really knew what she was doing when writing the ending. It was liberating.Like I said, this is not a YA book. When Helen went into Jenny's body it felt a bit more like a YA book, but it was still an adult book. It's almost like an adult book has snatched a body of a YA book....the surface is YA, but the content is so very much grown up. Do publishers think that just because the main characters are teenagers (or should I say adults occupying teens bodies) that this should be labeled as a YA book?But it's suitable for younger readers. I should warn you that it has some sex scenes, but they are not graphic.I really hope that the sequel is good, I really want to know more about what's happening to Jenny and Billy."}, {"userName": "Penny", "userReviewDate": "Aug 23, 2009", "userURL": "http://www.goodreads.com/user/show/679025-penny", "userReview": "I was told it is a modern ghost story. But really, it is so much more then just a ghost story. Yes, the main character, Helen, is dead. And yes, I will admit Helen haunts people, or rather, attaches herself to certain people. But the people she \"haunts\" are, for the most part, unaware of her presence. She doesn't go around scaring people. So I want to make it clear, this isn't a spooky ghost story. When all is said and done, this story is about love, self-discovery and forgiveness. Laura Whitcomb does a fantastic job drawing the reader in right from the beginning. It doesn't take much to like Helen, she's kind, sweet and has a love of literature. However, it is clear that she is stuck on earth and cannot move on for some reason. Helen doesn't even know why because she is only able to remember a few small details of her life here on earth. And, as far as she knows, no one can see her until, one day a young man stares at her and not through her. This is when things get truly interesting... Anyway, I highly recommend this book, it's a quite good. Also, even though I'm not a huge fan of romantic story lines, I really like the one in this book."}, {"userName": "Rachel", "userReviewDate": "May 31, 2010", "userURL": "http://www.goodreads.com/user/show/2755471-rachel", "userReview": "What a beautiful, compelling, and unique story. Definitely one of the better young adult novels I've read. The best part is it was almost like getting two stories in one. You've got Helen and James' super natural story, then you've got Jenny and Billy's more grounded one. I found myself caring greatly for the outcome of both sets of characters. The author did an amazing job at keeping the two story-lines separate. There was never any confusion as to who was who, yet they were also so closely intertwined and connected that you never really had one without the other. The concept of the story, in my opinion, was truly original. You have two lonely, wayward spirits, Helen and James, who coast through decades (maybe even a century or two) of never being seen or heard. Forced to be observers in the game of life that, since their deaths, they are no longer allowed to play. Until one day they miraculously connect and find each other only to inhabit the bodies of two high school students who couldn't more opposite if they tried. Billy, a drug-abuser from a broken home, and Jenny, who's family is rigidly strict in their religious practices. The term star-crossed comes to mind here.The emotion in this book was so well established and represented. I could really feel Jenny's loneliness and despair living in a religiously oppressive household. I couldn't help but find myself feeling a little stifled while following alongside Helen as she was forced to go through the motions of portraying Jenny while she was with her family. I have to admit, Helen's emotional journey of finally letting go in the end actually had me reaching for the tissues. A very endearing read that was beautifully done."}, {"userName": "Keertana", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "A Certain Slant of Light is both a pleasant surprise and...not. On one hand, I am incredibly impressed with Whitcomb's story. It is a paranormal love story, but of a very different nature than most. Helen and James, the couple in question, are ghosts left behind in the Light, having been dead for nearly 130 years. Thus, when they find each other and take over two teenage bodies to be together, their relationship is an adult one - only in a teenage body. Needless to say, this brings up quite a few difficult situations, but Whitcomb weaves through these with ease. Not only does she present us with sticky dilemmas, but her solutions are just as complex. Furthermore, she never hesitates to answer many of the moral questions that possession brings up and the entire plot of this novel is nothing short of brilliant. On the other hand, though, I couldn't really connect with the characters. I liked them well enough and I especially enjoyed their depth, but I wasn't wholly invested in them for some reason. By the time this short volume was over, I was overjoyed. I couldn't wait to leave this narrative voice, despite having been stunned by it. I can't say where A Certain Slant of Light went wrong, but I doubt I'll be picking up the companion novel to this anytime soon. I would, however, highly recommend it for fans of romance, ambiguous morality, and ever-so-slightly open endings."}, {"userName": "Angela", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/3169021-angela", "userReview": "There are a few reasons why I decided to give this novel a 5 star rating. They are as follows:1. I cried at the end. I cannot say that about many books.2. It's just different. The story is unique. The characters are as well. Overall, I've never read anything like it.3. I adore the main character (Helen) and her James.4. I enjoy Ms. Whitcomb's writing style. It's poetic and lovely to read.5. I couldn't put this book down. At one point I was reading it while waiting at a red light. Yeah.... Not such a good idea.Overall, I really enjoyed this story. It's not perfect and it's a little overly melodramatic, but it's beautifully written, completely unique, and a very satisfying read. I highly recommend this novel."}, {"userName": "Karla", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/3024056-karla", "userReview": "5 Haunting Stars!It took a few pages before the book grabbed me and then it didn't let go. A very emotional read and so different from anything I've read. To summarize it without giving anything away I would say it was about two souls saving two souls. Loved it!"}, {"userName": "Ameriie", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/8636182-ameriie", "userReview": "Whitcomb seamlessly blends literary, fantasy, and even a bit of gothic horror. The writing is beautifully poetic but not florid, and the humanity of the ghost protagonist comes through so clearly it was easy to identify with her pain and desires."}, {"userName": "Cyndi", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/7132123-cyndi", "userReview": "This is one of those books that you will remember years from now. It's a very original concept for a romantic YA novel. Just, lovely."}, {"userName": "Rinoa Heartilly", "userReviewDate": "Mar 08, 2011", "userURL": "http://www.goodreads.com/user/show/1946963-rinoa-heartilly", "userReview": "Parasites use human bodies and impregnate a 15-year old girl. That's this book. And we're supposed to like the parasites."}, {"userName": "Miss Bookiverse", "userReviewDate": "Apr 22, 2009", "userURL": "http://www.goodreads.com/user/show/1250419-miss-bookiverse", "userReview": "[Sie schlafen zum Beispiel miteinander, obwohl Jenny noch Jungfrau ist und verhüten nicht. Das grenzt doch schon fast an Vergewaltigung. Davon abgesehen finde ich nicht, dass dieser körperliche Akt zu Helens sonst so altmodischer Art gepasst hat.Helen bringt aber auch in Jennys Familienleben ordentlich Chaos (nicht, dass da vorher Ordnung geherrscht hätte). Im Endeffekt könnte sich zwar einiges positiv auf Jennys zukünftiges Leben auswirken, aber auch nur, weil Jennys Geist rechtzeitig in ihren Körper zurückkehrt. Hätte Helen sich (bzw. Jenny) umgebracht, hätte sie Cathy (Jennys Mutter) ganz allein zurückgelassen. Man kann doch nicht einfach das Leben eines fremden Menschen komplett umdrehen und dann nicht mal ein schlechtes Gewissen haben. (hide spoiler)]"}, {"userName": "Maya", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/6545351-maya", "userReview": "This is very close to 4 stars.I'm a bit shocked that all quotes listed on goodreads from this novel only concern the romance side of the story, because it has much more to offer.This is the story of two ghosts who have been haunting people and places for decades, alone, without knowing why they were stuck on earth. When they finally meet, they fall in love and try to find their way, to find happiness.The love story is touching and beautifully told, both characters are very likeable. It just makes you happy to read about them being happy ;)But to me the romance wasn't even the best thing about this book. I started reading expecting a touching love story, but the author does a great job interwining the quest of the two lovers with the stories of their hosts, especially the two young people whose bodies they end up borrowing. A Certain Slant of Light is about children being strangled indirectly by their parents controlling every aspect of their lives or, on the opposite, by neglecting them. In the story their souls flee from their bodies when the child can't bear it any longer and gives up on his life, leaving behind an empty shell that moves without a will, a consciousness inside. And in reality ... well, these children do exist and I wish for their parents to read this book.What made me end up with 3 stars rather than 4 was that Helen really did act a tiny tad too stupid at times just so that she would provoke a new conflict and the ending, which somehow wasn't really my thing, but that doesn't mean it was bad. It's a really good book from beginning to end, and very beautifully written.However, I cannot recommend this book if you're looking for some light reading or simply for a cute romance. A Certain Slant of Light was much darker than I had anticipated. It makes you think and question things about life, and it doesn't necessarily make you happy. I had to watch some episodes of The Big Bang Theory right after finishing to change my mind XD So it really depends on what you are looking for. If you're in the right mood for this, go ahead :)"}, {"userName": "Thomas", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "3.5 stars.I liked this tale of two lurid lovers, but I didn't enjoy it enough to give it a higher rating.Laura Whitcomb's writing was wonderful, considering A Certain Slant of Light is her debut novel. It's sensational yet sweet, hair-raising yet unhurried - there were a few quotes I took special notice of but now regret not writing down. After quickly scanning the first chapter or two, here's a quote that I think shows her talent:\"I had two strong and seemingly contradictory sensations. One was a fear of being seen by a mortal - as if beheld naked when you know you are clothed. The other was an almost indescribable sensation of attraction - the vine curling toward the sun's light in slow but single-minded longing.\"However, I had issues with the plot. While it's plain to see this book delved deeper into the heart of human emotion than most young-adult books, Whitcomb's execution of the storyline unsettled me. There was so much going on - Helen and James's past lives and their struggle to fit into modern society, Jenny and Billy's current lives, the spiritual side of the story, etc., that I couldn't connect to the characters. If she had taken a couple of these story elements or conflicts and fleshed them out further, perhaps I would have loved this book instead of merely liking it.Overall I wanted less, but I wanted more at the same time. I apologize if that's confusing. Nevertheless A Certain Slant of Light can only be truly understood by a reader possessing an open mind and the maturity to handle some serious stuff, so if that doesn't sound like you, I would avoid this book. Certainly not a bad read, though.*cross-posted from my blog, the quiet voice."}], "description": "In the class of the high school English teacher she has been haunting, Helen feels them: for the first time in 130 years, human eyes are looking at her. They belong to a boy, a boy who has not seemed remarkable until now. And Helen--terrified, but intrigued--is drawn to him. The fact that he is in a body and she is not presents this unlikely couple with their first challenge. But as the lovers struggle to find a way to be together, they begin to discover the secrets of their former lives and of the young people they come to possess.", "title": "A Certain Slant of Light\n      \n          (Light #1)", "url": "https://www.goodreads.com/book/show/289601.A_Certain_Slant_of_Light__Light___1_", "average": 3.83, "cover": "https://images.gr-assets.com/books/1441806268l/289601.jpg", "reviews": 1851, "authors": [{"url": "https://www.goodreads.com/author/show/87534.Laura_Whitcomb", "name": "Laura Whitcomb"}], "type": ["Young Adult", "Fantasy", "Fantasy", "Romance", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/289601.A_Certain_Slant_of_Light", "http://www.goodreads.com/book/show/8691503-a-certain-slant-of-light", "http://www.goodreads.com/book/show/8134766-a-certain-slant-of-light", "http://www.goodreads.com/book/show/3920088-the-fetch", "http://www.goodreads.com/book/show/9677397-under-the-light", "http://www.goodreads.com/book/show/6433184-novel-shortcuts", "http://www.goodreads.com/book/show/35784773-seelenh-ter", "http://www.goodreads.com/book/show/34933401-your-first-novel-revised-and-expanded-edition", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}