{"ratings": 215, "userreviews": [{"userName": "Scribble Orca", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/4402387-scribble-orca", "userReview": "[If you insist, because this novel is best read blind (no pun intended), the construction and use of the two protagonists allows Adair to tell a Modernist story with Postmodernist flair ie dialogue only, but by virtue of the plot, the camera is always present, always descriptive. Enough hints of the coming atrocity are left lying in the text, including a discussion on the text, the art of writing, the reader and the writer (yes, no prize for guessing who is who with names like Paul Reader and John Ryder....or is it really that simple?) and a meditation on being victim of circumstance, darkly satirical given the denouement. The sins of the progenitors are always visited upon the progeny, but there is no moral certitude or just deserts to be had in the telling. This is how all thrillers deserve to be written. (hide spoiler)]"}, {"userName": "MJ Nicholls", "userReviewDate": "May 21, 2010", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "There is a paradox in the title—once you have closed A Closed Book, you will immediately seek re-entry—so the title should be A Perpetually Reopened, Thumbed, and Not Often Closed Book. (But, as a title, you would have to agree, this is lacking that Waterstones wow factor). Adair is one of the few writers who has used the more subtle narrative techniques common among postmodernists in genre writing (although pastiche is his passion—a popular pursuit of the pomoist), and in this thriller he uses the dialogue-only (minus deceptive passages in italics) technique (common among die-hard Barthesians who want to kill the narrator/author at all costs) to drive forward an entertaining and fast-paced novel for both plebs and snobs to delight in at both shallow and cerebral levels. A narratorless style in a book with a blind protagonist and a sneaky antagonist is an obvious stroke of genius, and Adair is the perfect man to milk this constraint for all kinds of suspense, typical in-jokes, and clever callbacks. The unfair irony is that Adair was to go blind in the last year of his life—on the same year the film version with Daryl Hannah was released, so praise be for small mercies."}, {"userName": "Stephen P", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/11602286-stephen-p", "userReview": "A Closed Book gets a 4 star rating for its innovative POMO style rendered nearly complete in dialogue. Scribble Orca you are absolutely right about this narrative-less expression form. By removing the narrator, therefore one further layer of distance, the characters inherited a vitality I hadn't experienced before.Unfortunately I had to wrench away 1 star due to the experiment (Bold-Courageous,) of mixing this innovation with a genre story of suspense. It grew dense, at times sluggish. Nowhere did this seem necessary to me to maintain or increase the aesthetic hold, prop or further the plot. When the suspense began its twisting of plot and possibilities of turns of events I felt tugged to lean this way or that in a direction leading toward the eventual surprise conclusion. Possibly this time the surprise might be no surprise.I enjoy suspense novels, especially as a break from reading what for me are difficult books. Here I was jarred since without a narrator, the person writing these characters must get me to the end. Get me set up, fool me, twirl me in a circle and surprise me. This felt strongly intrusive in a text written in a style which had removed authorial intrusion. There I found myself in a printed text of letters arranged to manipulate the reader.Although there were a few events I needed to buy into to have the book's weight sufficiently propped open, Adair is a skillful writer. The story of a blinded and disfigured author living cut off from society hiring a young man to depend on to be his amanuensis to complete a final book, is intriguing. Scenes of what it is like to be blind, to live in a world of darkness, too see the darkness, are sublime. Although not the nicest of people, easy to identify with, both characters are alive and vivid. The problem and the lost star I believe was the attempt to mix this innovative and successful style with a genre fiction piece.This being my first Adair I can see that if he took the leash off each allowing them to scamper where they might like to go within their own books a great success could be in store."}, {"userName": "Davidberlin", "userReviewDate": "Jan 14, 2010", "userURL": "http://www.goodreads.com/user/show/3153194-davidberlin", "userReview": "I am a fan of Adair - all of his books are worth reading. His subject matter is extremely varied but the defining link is his interest in deconstruction.A Clsed Book is clever, very readable but with a fatal flaw in its conception which it would be a shame to divulge as the unexpected nature of the narrative is central. This is a kind of Agatha Christie/Hitchcock thriller which questions the whole art of how a writer creates a world and misleads the reader."}, {"userName": "Steffi", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/2632212-steffi", "userReview": "Ein blinder Schriftsteller engagiert einen jungen Mann, der mit ihm in seinem Haus in den Cotswolds leben und ihm bei der Verfassung eines autobiografischen Texts helfen soll. Das gesamte Buch besteht aus Dialogen zwischen diesen beiden (nur selten kommen weitere Figuren hinzu), der Stil ist phantastisch. Man ahnt die ganze Zeit ein Geheimnis, aber nicht nur das hält den Leser bei der Stange; auch der Prozess des Schreibens und die Art wie dieser bestimmte Autor schreibt, werden wunderbar karikiert. Es fällt schwer das Genre zu bestimmen: Literatursatire? Kammerspiel? Krimi?Auf jeden Fall: Witzig, britisch, boshaft, brillant, spannend!"}, {"userName": "Katie", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/5084921-katie", "userReview": "I enjoyed this book. I thought it was very clever to only write in dialogue, as the main character is blind and so can only discover what is going on based on what he hears/feels. The dialogue was never boring and it was well thought out and written. The plot was intresting and the twists, whilst I sort of expecting them (it started to fall into place about half way through), it still somewhat shocked me."}, {"userName": "Die Kleine", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/63717115-die-kleine", "userReview": "Ich bin wirklich froh eines schönen Tages über Gilbert Adair gestolpert zu sein, nicht nur wegen der Evadne Mount-Trilogie, sondern auch wegen einer Perle wie Bildband. Die Geschichte des blinden Autoren und seines Gehilfen kommt gänzlich ohne szenische Beschreibungen aus und lebt rein von seinen Dialogen.Es ist ein stürmischer Abend, an dem Sir Paul, ein einsamer, erfolgreicher und vermögender Schriftsteller, den jungen John Ryder einstellt, damit er ihm beim Schreiben seines neuen Buches hilft. Während seiner Tätigkeit soll Ryder auch bei dem alten Mann wohnen – in einem einsamen Herrenhaus in tiefster englischer Provinz. Sir Paul will ihm seine Autobiographie diktieren, weil er sie selbst nicht mehr schreiben kann. Seit einem Autounfall ist er erblindet und auf Hilfe angewiesen.Die Atmosphäre in dem Buch ist von Anfang an befremdlich, zuweilen auch grotesk. Das Unheil liegt bereits von Beginn an in der Luft, ohne dass man es an etwas Konkretem festmachen könnte. Im weiten Verlauf scheint sich die düstere Vorahnung zu bewahrheiten, denn es häufen sich irrwitzige Vorfälle, die auf ein sadistisches Spiel schließen lassen. Wer würde einen Blinden wegen eines Puzzles an der Nase herumführen? Wer würde ihm erzählen, Tony Blair sei an AIDS verstorben? Irgendetwas, ahnt der Leser, scheint den Schriftsteller und seinen Adlatus miteinander zu verbinden. Aber auch Sir Paul ist gewiss kein Sympathieträger, sondern verschlagen und arrogant. Spielt John Ryder überhaupt ein falsches Spiel oder bildet sich der alte Mann alles nur ein?Was Blindband auszeichnet, ist nicht einmal der Plot an sich, der zum Ende leider etwas abfällt. Das Besondere ist, dass die Blindheit Sir Pauls die Erzählstruktur vorgibt. Aldair schreibt einen reinen Dialogroman, der ohne erklärende Worte auskommt und nur geringfügig von tagebuchartigen Einschüben Sir Pauls unterbrochen ist. Keine Stimmungen oder Zustände werden beschrieben, keine Physiognomien veranschaulicht. Als Leser sehen wir genausowenig wie der blinde Sir Paul und dennoch hat man nie das Gefühl, dem Buch fehlt etwas Wesentliches."}, {"userName": "Harshita Kale", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/29141014-harshita-kale", "userReview": "I was sure that this was going to become an all-time favourite until the last 40 pages or so. The story was beyond intriguing. We had insight from a narrator who seemed very confident, helpful and skilled, but we, unfortunately, could view him only through a talented writer's eyes, which had been clouded forever. I flew through his book, flipping the pages incessantly, thinking about it while doing other mundane activities; which doesn't happen to me quite often.However, the ending was not only shocking but worth quite a few grimaces from me. Perhaps, another would have enjoyed it but it just didn't fit in well with me. Nevertheless, a pretty fantastic read, one which I wouldn't hesitate to pick up again and read up until the last section."}, {"userName": "Sara Aye Moung", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/76756089-sara-aye-moung", "userReview": "Picked this up in a secondhand bookshop attracted by the back cover references to Stephen King and Agatha Christie. It is indeed a bit of both and more. All written in dialogue form which could be off putting but in my view isn’t and adds to the suspension. It’s actually more a 3.5*"}, {"userName": "Lily Smalls", "userReviewDate": "Mar 07, 2013", "userURL": "http://www.goodreads.com/user/show/4015250-lily-smalls", "userReview": "Considering the craft of writing A Closed Book is linguistically well done and plot-wise not badly shaped either. As the dominant form of narration is dialogue, it’s rather an intimate play than a novel. However, it’s an entertaining read with a couple of surprising twists. It’s dense, at times a little spooky, it’s got some good ideas and it’s quite clever. Yet, it never entirely drew me in. On the contrary, I was irritated from the outset and the closer I reached towards the end, the more I was put off. Maybe that was even part of the author’s intention. I guess now it’s about time to provide an insight into the story.Besides a few minor characters Adair only deals with two central characters, the hero and his antagonist, so to speak, enlivened in the sightless and acclaimed author Paul and his new assistant John Ryder. Paul had a severe car accident in which he didn’t just lose his sight but also his eyes. It took him four years of solitude before he decided to get back to writing and to work on his last book, an autobiographical memoir. This is where the story sets in. John Ryder turns up for an interview, moves in with Paul and is henceforth \"the blind author’s eyes and writing hand\". As the days pass by John starts playing odd tricks on Paul by changing news about the world outside of Pauls microcosm. To give just one example, he claims Tony Blair resigned from office because he suffered from AIDS. Johns lies seem inexplicable and purposeless until Adair in the last eigth of the book reveals why he comes up with such inventions.I truely got fed up with those two guys. No, I actually couldn’t connect with them at all, at no point of the story. I neither felt a great deal of sympathy for them nor did I despise them. I couldn’t have cared less, no matter how shocking the actual nature of their encounter was. I can't say Adair neglected his characters but maybe the form of narration admirable as it be was the wrong choice for his story. I don’t necessarily need to identify or sympathise with a character for a good reading experience but if I can't relate to a character I expect a little more content, something that gets my brains racking.So, I can see glimpses of genius in the form of narration and construction of the plot, but I’m afraid A Closed Book on the whole was just not my cup of tea."}, {"userName": "Franziska", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/10713441-franziska", "userReview": "Irgendwie fällt es mir bei diesem Buch schwer meine Meinung darüber zu formulieren, obwohl man bereits an der Tatsache, dass ich es innerhalb von wenigen Stunden gelesen habe, sicher erkennen kann, dass es weder an der Spannung noch am guten Textfluss fehlt - vielleicht einfach deshalb weil man am Ende nicht mehr weiß, wem man seine Sympathie nun widmen soll.Sehr auffällig ist natürlich zunächst einmal, dass fast die ganze Handlung des Buches nur über Dialoge abgehandelt wird, abgesehen von dem Ende und einigen Monologen des erblindeten Autors. Nichtdestotrotz erhält man eine detailreiche Beschreibung des Hauses und der nahen Örtlichkeit durch die Beschreibungen, die John Ryder für Sir Paul anfertigt.Was das Buch für mich etwas in die Länge gezogen hat, waren die diktierten Textpassagen. Diese stehen recht ausführlich drin, mit den ganzen Vermerken bzgl. der Interpunktion oder auch von Textänderungen. Teilweise kommen diese Texte aber später sowieso nochmal vollständig (in \"ordentlich\" niedergeschriebener Form), sodass ich mit der Zeit dazu tendiert habe, diese Diktierstellen zu überspringen in der Hoffnung, dass die Texte in Reinform später noch einmal kommen.Da ich ansonsten bezüglich der Handlung nicht zuviel verraten möchte, kann ich nur sagen, dass diese bis zum Ende spannend bleibt und noch einige Überraschungen birgt - auch über einige \"Flecken\" in der Biografie von dem blinden Autoren Paul.Nicht zu vergessen ist natürlich auch der typische britische Humor - für die, die ihn schätzen Augenzwinkern ...Fazit: Durchaus lesenswert, wenn man nicht von Anfang an zuviel erwartet. Die Idee ist gut, die Entwicklung der Handlung über die Dialoge ebenfalls. Teilweise gibt es einige Längen, die man überbrücken muss, und für manchen wirkt das Ende vielleicht auch etwas überladen, für andere ist gerade diese Überraschung das Beste vom Buch - aber das muss letztlich jeder selbst entscheiden."}, {"userName": "yexxo", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/2622581-yexxo", "userReview": "Unbedingt 2x lesen!Paul Reader, berühmter Schriftsteller, seit einem Unfall blind, grauenhaft entstellt und in völliger, selbstgewählter Isolation lebend, plant ein neues Buch zu schreiben. Dafür engagiert er den wesentlich jüngeren John Ryder, der für ihn schreiben und Recherchen durchführen soll. John zieht bei ihm ein und trotz Pauls schwieriger Art zeigt die Zusammenarbeit Fortschritte, das Buch nimmt Gestalt an. Doch etwas scheint mit John nicht zu stimmen... Fast der komplette Roman ist in Dialogform wiedergegeben, lediglich wenige Mal unterbrochen von Gedanken und Überlegungen Pauls. Paul ist ein unangenehmer, egozentrischer, überheblicher und arroganter A...., so dass es trotz seiner Blindheit und Verunstaltung schwer fällt, Mitgefühl für diese Figur zu entwickeln. Je weiter man liest desto unklarer wird die Atmosphäre zwischen den beiden Männern. Hat John finstere Absichten? Oder sind es nur Hirngespinste eines Blinden? Weshalb nun zweimal lesen? Weil die Lösung dieses Falles im ganzen Buch immer und immer wieder angedeutet wird. Nur Kleinigkeiten, die man beim ersten Mal überliest, beim zweiten Mal jedoch mit einem 'Ach so!' kommentiert. Beispielsweise die Sache mit den Wasserspeiern oder der Hintergrund der nicht vorhandenen Leerstellen. Erst die wiederholte Lektüre erschließt einem wirklich das ganze Buch!"}, {"userName": "Katya", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/9232279-katya", "userReview": "Blind writer cut off from the world by his own will hires a secretary who is supposed to become a replacement for the eyes the writer had lost in a car accident. But how can one trust the eyes of another person?I would give the book 3.5 stars. The plot is not bad: after all, revenge is a traditionally fascinating motif :))The main character's contemplations on blindness and literature are not uninteresting, but seem to be somewhat ostentatious. Despite of the very promising plot and quite interesting characters, the denouement was disappointing - the whole book ultimately boils down to the \"passion fatale\" a la Dumas.  I have to admit that Rider's pranks were really a lot of fun. The book is quite clever, but lacks the depth, in my opinion, and the fact that it is written all in dialogue does not help it much."}, {"userName": "Anna", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/7233300-anna", "userReview": "Очень двойственный впечатления у меня остались от этой книги. С одной стороны большая ее часть, а точнее примерно 90%, представляет собой унылое нечто ( здесь на язык просится совсем другое, но слишком грубое слово:)) читать которое было откровенно скучно и я несколько раз порывалась бросить этот утомительный процесс. НО с другой стороны, финал истории очень-очень хорош! Не сказать, чтобы он сразил меня наповал, но удивил точно! Я конечно подозревала, что не все так чисто и гладко во взаимоотношениях героев книги, но чтобы ТАКОЕ...Этого я представить себе не могла! :). В итоге, суммируя впечатления, ощущения и эмоции, получается скорее нейтральная оценка. Больше поставить, к сожалению, не могу."}, {"userName": "Al", "userReviewDate": "Sep 30, 2012", "userURL": "http://www.goodreads.com/user/show/3022238-al", "userReview": "What a strange book.........I picked this up at a second hand book store and had never heard of the author.It started off really slowly and I wondered when something would start happening...An isolated cottage deep in the Cotswolds where a recently- blinded author lives.He decides to write another book and advertises for somebody to assist him so that he can dictate the book to him.All goes fairly well until the house-keeper's husband is taken ill and she no longer comes in to work. The assistant then starts doing the cooking etc as well.And that is when the plot develops.....................Worth a quick read."}, {"userName": "Robin", "userReviewDate": "May 11, 2009", "userURL": "http://www.goodreads.com/user/show/1843208-robin", "userReview": "One reason I picked up this book to read: it is written (almost) entirely in dialogue. At first I got the impression that this style would be confusing, but not so. A bit slow at first - the book writing part was a bit of a bore, but reading on, little by little, the tension mount, and I was hooked. Finished this in one sitting! Oh, this is one of the books that fares better if you knew nothing about it beforehand, so I have to stop here :)"}, {"userName": "Denisa", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/16368000-denisa", "userReview": "Another rating: 5/10I don't know why but I really didn't enjoy this book. Story was transparent and main character didn't act logically. I mean he was blind but he believed his assistant without any caution or suspicion. If I were him I wouldn't invite someone unknown to my house like that (and of course I wouldn't believe him so calmly). I thought assistant was some sociopath and it would be better than some miserable man who wanted only stupid revenge."}, {"userName": "Erelin", "userReviewDate": "Mar 03, 2008", "userURL": "http://www.goodreads.com/user/show/908253-erelin", "userReview": "Very interesting! This book is written ENTIRELY in dialogue. Spooky too!"}, {"userName": "Ben Lainhart", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/2464332-ben-lainhart", "userReview": "One of the most interesting, oddly suspenseful, and thought-provoking books I've read."}, {"userName": "Moira Russell", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/1630617-moira-russell", "userReview": "Ohh man, the book got turned into THIS? http://www.imdb.com/title/tt1320236/ Poor Adair."}, {"userName": "Sarah", "userReviewDate": "Mar 16, 2010", "userURL": "http://www.goodreads.com/user/show/3439491-sarah", "userReview": "I really enjoyed this one. Quite a page-turner and an interesting concept. You are really never sure what's going on until the end."}, {"userName": "Elisa", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/26216830-elisa", "userReview": "I almost gave this book 4 stars, but I found the twist at the end rather disconcerting, and for me it didn't add to the book. I just enjoyed the drama leading up to it."}, {"userName": "Isabel Mansfield", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/9925138-isabel-mansfield", "userReview": "Interesting read"}], "description": "An isolated cottage deep in the heart of the Cotswolds. A writer's den, as dusty, gloomy and full of exotic objets d'art as the cell of a medieval monk. Two men sit opposite each other, one of them talking, the other typing. But why, in such already sombre surroundings, does one of the two men wear thick dark glasses? What is the other typing so industriously and so apparently imperturbably? Why is the light left on in an unoccupied bathroom? What is the precise significance of the jigsaw puzzle laid out on the study table? Why, too, are some of its pieces missing? Whose statue actually stands on the empty plinth in Trafalgar Square? Who or what, above all, is causing an unearthly shadow to fall across these two inextricably interwoven destinies?With an atmosphere of eerie morbidity reminiscent of Poe, Hoffmann and even Stephen King, and an eleventh-hour double whammy of a twist of which Agatha Christie herself would have been envious, Gilbert Adair's novel, one which - for a reason it would be unpardonable to divulge in advance - the reader hears rather than reads, is one of his most brilliant.", "title": "A Closed Book", "url": "http://www.goodreads.com/book/show/56915.A_Closed_Book", "average": 3.47, "cover": "https://images.gr-assets.com/books/1393107649l/56915.jpg", "reviews": 23, "authors": [{"url": "https://www.goodreads.com/author/show/15924.Gilbert_Adair", "name": "Gilbert Adair"}], "type": ["Thriller", "Fiction", "Contemporary", "European Literature", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/56915.A_Closed_Book", "http://www.goodreads.com/book/show/2006952.Blindband", "http://www.goodreads.com/book/show/624641.The_Dreamers", "http://www.goodreads.com/book/show/1698710.The_Act_of_Roger_Murgatroyd", "http://www.goodreads.com/book/show/1916509.A_Mysterious_Affair_of_Style", "http://www.goodreads.com/book/show/2412676.The_Death_of_the_Author", "http://www.goodreads.com/book/show/624648.Love_and_Death_on_Long_Island"]}