{"ratings": 11989, "userreviews": [{"userName": "Hannah", "userReviewDate": "Jun 12, 2009", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "As a long-time fan of Karon, I must say I was greatly dissapointed in A Common Life and embarrassed that I purchased it before reading more reviews. I would have certainly checked it out at the library and been equally dissapointed but $... dollars richer.I feel cheated as a reader and a fan because it seems as though Karon took advantage of her fan base. This magazine-length story is marketed to \"appear\" like all her other books, while a quick flick through the pages indicates larger fonts and hyper-margined text pages. While I might have forgiven her for what could have been a publishing decision, Karon obviously left her writing talent elsewhere while penning this story. There was nothing new to add with this addition, and even what there was wasn't written very well. I kept asking myself, \"why bother?\"Well, I've learned a good lesson from this purchase, and I have lost some respect for the author. I'll give her another chance, but not on my dime!"}, {"userName": "Jocelyn", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/3143350-jocelyn", "userReview": "I really liked the part where got to experience the other character's ponts-of-view. Especially Cynthia and Dooly's. This was a great little addition to the series, and it only took me a day to get through it. I'm reading through the series for the second or 3rd time and read this book in between the second and third books even though it was written far later in the series. It fit very well."}, {"userName": "Jan", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/1841448-jan", "userReview": "reread May 20, 20184.5 - 5 Stars (although I gave it 4 Stars when I read it back in 2002."}, {"userName": "Carol", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/2534237-carol", "userReview": "First, I can't say how happy it made me that the last chapter was titled The Beginning.As far as stories go, Father Tim and Cynthia's wedding wasn't overly-dramatic. I think it was the quotidian element that captured me. They both faced paralyzing fears before their marriage. That's not uncommon. The work of blending their lives involves decisions and negotiations. No surprise. Their premarital counselling is a tad awkward. Sounds familiar. We see their relationship deepen and open as they approach their wedding day. The letters and prayers are a highlight for me.The word common is related to community. The magic Jan Karon weaves are the responses and reflections of the community around Father Tim and Cynthia. Several residents reminisce about their own courtship and marriage. The wedding cake, flowers, music, jokes, and food are all gifts from the heart, a way for Mitford to enter into the celebration instead of simply spectate. [No spoiler] There is another wedding written about in great detail at the end of the Mitford series of books. I am eager to set the two weddings side by side and admire both."}, {"userName": "Ali", "userReviewDate": "Dec 24, 2010", "userURL": "http://www.goodreads.com/user/show/804942-ali", "userReview": "Well I said I needed an antidote to the gritty reality of my last read. This certainly fitted the bill. Although the 6th in the Mitford Years series - this story is chronologicaly out of time. It is the story of Father Tim and Cynthia's marriage. Father Tim 62 years old, marrying for the first time, his neighbour, children's writer and illustrator Cynthia Coppersmith. We see Timothy contemplating his marriage, thinking about his feelings for Cynthia as composes a letter, and we see what the marriage of these two lovely people mean to the other characters of Mitford, including of course the adorable Dooley Barlow, the troubled boy Father Tim took into his home a couple of years earlier. It was also wonderful to encounter again the marvelous Miss Sadie - who of course died in an earlier book. As with the other Jan Karon books, this is gentle, moral and uplifting, a bit twee prehaps, but ever so lovely and very definitely good for the soul."}, {"userName": "Piepie", "userReviewDate": "Jun 17, 2015", "userURL": "http://www.goodreads.com/user/show/663327-piepie", "userReview": "I don't understand why people have so much of an issue with Jan Karon going back in time with book #6 and giving us the story behind the wedding of Father Tim and Cynthia. For me, this rewinding of time was not a problem. I loved seeing various Mitfordians as they remembered sweethearts who they had loved...and in some cases, lost. One of my favorite parts is when a lovestruck Father Tim sends his fiancee a letter...by way of his stubborn dog...and as a result we see Cynthia, usually so bubbly and outgoing, as this missive strikes deep within her soul, and she is moved to tears. Cynthia has not been without loss, she has been divorced and her first husband scorned her for not being able to bear children, but she has found her missing piece, her soulmate, within the episocopalian rector.This is a beautiful story, that any fan of the Mitford books will zip right on through, and it comes complete with a picture-perfect ending <3"}, {"userName": "Julie", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/815058-julie", "userReview": "As soon as I realized that the \"sixth book the Mitford series\" was just about a wedding that happened in an earlier book, I took it back to the library. It may seem silly, but I felt cheated. I wanted to know what happens after the fifth book leaves off, not more about something that happened books ago. I'm officially finished with the Mitford series."}, {"userName": "Susan Snodgrass", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "I am rereading this wonderful series this year for the third time! Nothing soothes the soul like a Mitford novel. Except Christ, that is. These books have been such a blessing to me over the years! Sometimes I yearn for there to be a real Mitford to which I could go and definitely live. All these precious characters have set down roots in my heart, forever to stay!This one is the book celebrating the wedding of Father Timothy Kavanagh and Cynthia Coppersmith. Only the wedding. For more, you'll have to read the rest of the Mitford novels. The love between these two, Father Tim is now 62 and Cynthia in her fifties, is just the most precious thing ever. Father Tim writes to Cynthia, \"I have given my heart only once, and that was to Him. Now He has, Himself, set aside in my heart a room for you.\" Any woman receiving a note with that sentence would just feel the most precious woman in the whole world! And their love for each other is just that precious. Through this and the remainder of the Mitford books. I cherish each one! They will be read again, too."}, {"userName": "Teri-K", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/2524448-teri-k", "userReview": "This was a nice listen - the narrator is perfect for these stories - but I really ended up wishing there had been more to the story. Though the honeymoon section was sweet."}, {"userName": "Joyce", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/5394427-joyce", "userReview": "Library copy. Reading through the Mitford series. The wedding was in one of the other books, so I thought I had already read this, but there were some things in it that were new to me.This book stands alone, even though it's in a series, but the better acquainted you are with the characters who were introduced previously the more you will appreciate the little things. This book might be confusing to someone who didn't know the characters.I love the many varied characters in the Mitford series. Uncle Billy Watson is one of my favorites. I love his jokes! I love the way the author takes flawed people and makes them valuable without changing them.Dooley is one of my favorites as well. He doesn't have a big part in this book, but the part he has is significant. I love the way the main characters quote the written word, fiction and the Bible, and how their weaknesses become part of the backbone of their relationship, which is now their marriage.This book is filled with hope and joy and yes, happiness. I recommend it highly to all readers -- the entire Mitford series, starring Father Tim Cavanaugh. Oh, and there is a faith element, and the writing is squeaky clean, pristine. This was a quick read."}, {"userName": "Janice", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/1136840-janice", "userReview": "A Common Life is not just a wedding story. It's also an intimate portrait of the unfolding love between Cynthia and the shy Father Tim, complete with fears and hesitations, professions of commitment, and Barnabas the dog delivering love letters. But there's nothing heavy-handed here. The tensions don't run any higher than wondering if Cynthia will make it to the wedding on time after getting locked inside her own bathroom, or guessing if Esther will make her famous three-layer orange marmalade cake for the reception. Told in the warm, down-home style that Karon has built her reputation on, A Common Life is sweet without being saccharine, charming without being cloying. It's an invitation to a literary reunion of the best kind, and like all weddings, it will probably coax a few tears and plenty of smiles. --Cindy Crosby --I love this series!"}, {"userName": "Joy Gerbode", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/5049682-joy-gerbode", "userReview": "This installment in the Mitford series is a quick and easy read, with some details regarding Father Tim & Cynthia and their courtship and wedding. It was good for a fantastic laugh ... as well as some tender and very heartfelt moments, some great truths about marriage, and a wonderful prayer for marriage partners."}, {"userName": "Rachel", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/2868865-rachel", "userReview": "This is chronologically the third book of a laid back series about an Episcopalian priest in a small town in North Carolina. It is often funny and sweet with the occasional sad vignette mixed into the plot. I'm enjoying rereading this series. This is the shortest and most basic book of the series since its main focus is the wedding itself."}, {"userName": "Pam", "userReviewDate": "May 23, 2007", "userURL": "http://www.goodreads.com/user/show/87937-pam", "userReview": "My least favorite of the Mitford Books. This one is a flashback to Father Timothy and Cynthia's wedding. Kind of fills in some gaps, but not as good as the rest. It is a fast read, and kind of sweet, but only true lovers of the Mitford series will enjoy."}, {"userName": "Josh Belice", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/3660575-josh-belice", "userReview": "This book needs a 5-Hour Energy shot and a dash of darkness to liven it up. There is no reason to read this book other than to waste time. The main characters, Father Tim and Cynthia, are under-developed and McGregor would label this as the epitome of a Theory-Y read."}, {"userName": "Becky", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/9960279-becky", "userReview": "This was my least favorite of the Karon books. It's called #6 but really since it's all about the wedding it would've made more sense to have been read back when the wedding actually occurred. It was very short and shallow - just took a couple of hours to read. I was disappointed in this book."}, {"userName": "Marsha", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/4862742-marsha", "userReview": "This is book #6 in a series. You will love all of the previous books. The characters are exemplary and charming. I love the Mitford series. I found a whole set at a library sale and I'm starting over. This is a series you will hate to put down."}, {"userName": "Debbie", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/3128061-debbie", "userReview": "I didn't think I liked going back in time in this book of the series, but honestly now that I have read it I can't imagine the series without this book. It fills in a lot of the gaps. I loved the tenderness of Father Tim and Cynthia. What an example to us all."}, {"userName": "Winter Sophia Rose", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/32134258-winter-sophia-rose", "userReview": "Sweet, Captivating, Witty & Charming! An Excellent Read! I Loved It!"}, {"userName": "Chris", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/10983379-chris", "userReview": "I read this one after book 2, since I read what one reviewer wrote and said to read this one before moving on, which I did and very glad. Some reviewers felt cheated if they read this in order, which I can see. This is very clean, pristine series. There is quite a lengthy interview w/the author at the end and appears her fans complained that they missed the wedding, So book 6 was born, maybe a little too late for some reviewers:-) THIS SUMMARY/REVIEW WAS COPIED FROM OTHER SOURCES AND IS USED ONLY AS A REMINDER OF WHAT THE BOOK WAS ABOUT FOR MY PERSONAL INTEREST. ANY PERSONAL NOTATIONS ARE FOR MY RECOLLECTION ONLY**Although the 6th in the Mitford Years series - this story is chronologicaly out of time. It is the story of Father Tim and Cynthia's marriage. Father Tim 62 years old, marrying for the first time, his neighbour, children's writer and illustrator Cynthia Coppersmith. We see Timothy contemplating his marriage, thinking about his feelings for Cynthia as composes a letter, and we see what the marriage of these two lovely people mean to the other characters of Mitford, including of course the adorable Dooley Barlow, the troubled boy Father Tim took into his home a couple of years earlier. It was also wonderful to encounter again the marvelous Miss Sadie - who of course died in an earlier book. **This book stands alone, even though it's in a series, but the better acquainted you are with the characters who were introduced previously the more you will appreciate the little things. This book might be confusing to someone who didn't know the characters.I love the many varied characters in the Mitford series. Uncle Billy Watson is one of my favorites. I love his jokes! I love the way the author takes flawed people and makes them valuable without changing them.Dooley is one of my favorites as well. He doesn't have a big part in this book, but the part he has is significant. I love the way the main characters quote the written word, fiction and the Bible, and how their weaknesses become part of the backbone of their relationship, which is now their marriage.** One of my favorite parts is when a lovestruck Father Tim sends his fiancee a letter...by way of his stubborn dog...and as a result we see Cynthia, usually so bubbly and outgoing, as this missive strikes deep within her soul, and she is moved to tears. Cynthia has not been without loss, she has been divorced and her first husband scorned her for not being able to bear children, but she has found her missing piece, her soulmate, within the episocopalian rector."}, {"userName": "Debbie Phillips", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/7403953-debbie-phillips", "userReview": "Flashback. A Common Life goes back to the wedding of Father Tim and Cynthia. Karon gives us detail that we did not have before. She skipped the planning and the wedding in the earlier book. I much enjoyed this. Same great characters. Same wonderful town.Planning weddings can be stressful. It can cause arguments and rifts between the couple getting married. Marriage is a long term commitment, weddings are one day.“I think,” he said, “that I'm overwhelmed on every side. I still can't think why God should give me this tremendous blessing – a gracious and loving soul who comprehends the depths of my own soul completely – and then to add financial resources beyond my wildest dreams...” (pg 64)I love the spiritual perspective and the depth of Jan Karon's writing. It truly lifts the soul.Father Tim is praying... Yes. There it was. The old and heavy thing he so often ignored, that needed to be said. “Father – continue to open me and lay me bare, for I have been selfish and closed, always keeping something back, even from You. Forgive me...” (pg 37)Her descriptions and writing equally as good... “A great flow of crimson and gold was spilling across the sky like lava, running molten from west to east. He watched, awestruck, as the pyre consumed the blue haze of the firmament and bathed the heavens with a glory that shook and moved him to his very depths.” (pg 5)Beautiful. I can see it in my mind. Lovely.And fun... the joke on page 180-181, at the reception, was clean and fun and made me laugh out loud. I cannot copy the whole thing here. You will have to read if for yourself... and no skipping ahead either.Ultimate Popsugar Reading Challenge prompt(s) –A book written by someone you admire"}, {"userName": "Cathy", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/51647109-cathy", "userReview": "I am rereading this series after my mom, and thoroughly enjoying it. I thought, for a minute, that I had these books out of order, since this book is more about the wedding, and the characters are already married in prior books. But this is more of memories and flash-backs for the characters.A sweet read.The part about Joe Joe asking Puny out on a date was so funny that I read it to our 7th grader, who asked, \"Is that about grown-ups?\" \"Yes.\" \"Because the boys in my class have dumb conversations like that.\" \"I thought so; I thought 7th grade was about right.\" There was a great deal of laughter, and then the 7th grader said, \"I feel sorry for boys talking dumb like that, like they can't think of anything better to say.\"Favorite quotes:\"May we treat the love You've given us with gratitude and devotion, humor and astonishment. May it be a river of living water to bring delight and encouragement to others, Lord, ...\"On love: \"A miracle! Let no one ever say or even think that God does not work miracles, still; every common day, every common life is filled with them, as you know better than anyone I have ever met.\""}, {"userName": "Dav", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/67735346-dav", "userReview": "A Common Life: The Wedding Story ● by Jan Karon.Back to Mitford to experience the wedding day. This is the sixth book, but it falls chronologically between books 2 and 3. It's the shortest of the series & disappointingly so, with fewer than 200 large print pages.Short as it is, the story of Father Timothy Kavanagh's marriage to Cynthia Coppersmith is still just as enjoyable. Uncle Billy wants to find just the right joke for the occasion. Father Tim's \" adopted\" son Dooley has a part to play. A number of Mitford's citizenry recall their own times of romance & Cynthia provides her experience in her own words.Of course, the wedding does not go off without a hitch--those are the problems that make the day all the more memorable. Short, but good.The Mitford - Father Tim seriesAt Home in Mitford (1994)A Light in the Window (1995)These High, Green Hills (1996)Out to Canaan (1997)A New Song (1999)A Common Life: the Wedding Story (2001)In This Mountain (2002)Shepherds Abiding (2003)Light from Heaven (2005)Home to Holly Springs (2007)In the Company of Others (2010)Somewhere Safe with Somebody Good (2014)Come Rain or Come Shine (2015)"}, {"userName": "William", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/7123324-william", "userReview": "I finished this over a month ago; but it got lost among a pile of things that put aside. If you are a fan of Karon's Mitford books you've probably read this a while back. Somehow I missed this when it came out, but I did remember that somehow Karon skipped over this time period in the history of Father Tim, etc. so I enjoyed this. As I've noted before (I think I did, anyway) one of my joys in reading this series is the quotes from Father Tim's reading. One of my favorites from this one is from G.K. Chesterton: \"The Christian ideal has not been tried and found wanting. It has been found difficult, and left untried.\" I'll have to get back to reading Chesterton myself to find the source (a glad reminder to do something worthy). I continue to be impressed with Karon's depth of reading; she couldn't know these without a good habit of reading worthwhile books."}, {"userName": "viemag", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/50209106-viemag", "userReview": "A Common Life: The Wedding Story by Jan Karon is listed as the 6th installment in her Father Tim series. However, I was wondering why it wasn't the 3rd installment. At the end of the 2nd installment Father Tim proposes to Cynthia and when Installment 3 opens they are already married and setting up their household in Mitford. This book covers, the proposal, the town's reaction, their wedding planning, their wedding and their honeymoon. It is a very sweet sweet read."}, {"userName": "Beth", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/15888260-beth", "userReview": "I was looking for an easy book to fill a few days while I could get up the gusto to return to another I wasn't loving. Bought three or four Jan Karon books at a recent sale and I know I am not reading in order but the book was simple enough that I think I'll be fine reading out of order. Enjoyed for the simple story it was. Enjoyed the characters and the simple, sweet story."}, {"userName": "Elena", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/33586309-elena", "userReview": "After reading (and adoring) Out To Canaan earlier in the month, I decided to skip over the fifth novel and read the sixth novel of the series, which is actually a flashback to the Father Tim and Cynthia's wedding (which occurred earlier in the series). From the proposal to the honeymoon, the reader peeks into not only the Bride and Groom's perspective of the days leading to their Big Day, but also their friends and fellow townspeople, many of whom are beloved characters from earlier books. It was an overall good read but felt a lot more choppy than the other books in the series since it jumped around from the perspectives from so many different characters, whereas the other books mostly stick to Father Tim's perspective."}, {"userName": "J", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/8261103-j", "userReview": "Slightly different than the series so far, written from the multiple perspectives of the characters of Mitford, not just from Father Tim's perspective. There's something about a wedding, and this story gives the reader all the details from flowers, to cake, and even includes music. I listened to this on Audible. It's an old tape recording that's been digitized. The recording isn't that clean, and even though it's not narrated by John McDonough as most of the series is, the narration is lovely. I just wish it didn't have poor sound quality. So if you like to cry at weddings, grab a hanky and give this a listen. There won't be a dry eye in the house."}, {"userName": "Melinda", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/24012384-melinda", "userReview": "Always find Jan Karon's MILFORD SERIES very relaxing and soothing to read, especially after a couple of difficult reads in our Book Group, or a hard couple of weeks of just plain Living !! As one critic said, her books are \"a refuge from the harsh world\"—especially of our evening national and inter national news!"}, {"userName": "Virma", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/28060878-virma", "userReview": "This is the story before book 5. This is the story of Fr Tim's wedding to Cynthia and the beauty of the realization of how he is blessed to have found her. It was very nice to have brought us back to the biggest day in Fr. Tim's life and allow the readers to be part of the festivities. I had been feeling a little left out of their wedding but this book certainly alleviated those feelings."}], "description": "The sixth novel in the beloved Mitford series, by the bestselling author of At Home in Mitford  and  Somebody Safe with Somebody Good  Laughter and wedding bells ring as Jan Karon takes her millions of fans back in time to the most cherished event in Mitford! Mitford's Lord's Chapel seats barely two hundred souls, yet millions of Jan Karon's fans will be there for the most joyful event in years: the wedding of Father Tim Kavanagh and Cynthia Coppersmith. Here at last is A Common Life, and the long-awaited answers to these deeply probing questions: Will Father Tim fall apart when he takes his vows? Will Cynthia make it to the church on time? Who'll arrange the flowers and bake the wedding cake? And will Uncle Billy's prayers for a great joke be answered in time for the reception?All the beloved Mitford characters will be there: Dooley Barlowe, Miss Sadie and Louella, Emma Newland, the mayor; in short, everybody who's anybody in the little town with the big heart.A Common Life is the perfect gift for Mother's Day, Father's Day, anniversaries, and for a bride or groom to give to his or her beloved. In truth, it's perfect for anyone who believes in laughter, relies on hope, and celebrates love.", "title": "A Common Life: The Wedding Story\n      \n          (Mitford Years #6)", "url": "https://www.goodreads.com/book/show/71785.A_Common_Life", "average": 4.21, "cover": "https://images.gr-assets.com/books/1434322517l/71785.jpg", "reviews": 352, "authors": [{"url": "https://www.goodreads.com/author/show/40552.Jan_Karon", "name": "Jan Karon"}], "type": ["Fiction", "Christian Fiction", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/71785.A_Common_Life", "http://www.goodreads.com/book/show/1758370.A_Common_Life", "http://www.goodreads.com/book/show/665886.A_Common_Life", "http://www.goodreads.com/book/show/246575.A_Common_Life", "http://www.goodreads.com/book/show/1292685.A_Common_Life", "http://www.goodreads.com/book/show/15680775-a-common-life", "http://www.goodreads.com/book/show/71776.At_Home_in_Mitford", "http://www.goodreads.com/book/show/112872.A_Light_in_the_Window", "http://www.goodreads.com/book/show/71784.A_New_Song", "http://www.goodreads.com/book/show/112874.These_High_Green_Hills", "http://www.goodreads.com/book/show/78674.Out_to_Canaan"]}