{"ratings": 419, "userreviews": [{"userName": "Eddie Watkins", "userReviewDate": "Jan 06, 2009", "userURL": "http://www.goodreads.com/user/show/1131783-eddie-watkins", "userReview": "Surprisingly surprising! Surprisingly violent! And to think that this yellowing Avon paperback languished in my parents’ unused basement sauna for at least 10 years, only to be rescued by me during the holidays; which is one of the few heartwarming stories in these “tough economic times”, as I’ve been reduced to scrounging around for free books anywhere I can, and if they’re set in the depression so much the better.The back cover copy says that “A Cool Million dismantles, piece by piece, its hero and the Horatio Alger myth”. Nothing could be more literally true. Poor Lem Pitkin is much like the heroine of de Sade’s Justine (another book rescued from the same sauna at the same time, though I read that one years ago) – a multiply gullible innocent systematically destroyed by a maliciously self-centered world. By the end his corpse has been scalped, de-thumbed, de-legged, de-teethed, and de-eyed - but not de-dumbed; even as a chopped up man he still believes in the American dream and his pursuit of a “cool million”. And why was he seeking this $$ in the first place – because a rich Jew, Asa Goldstein, had bought his quaint ancestral home, thereby displacing himself and his mother (who’s never seen again), so he could install it as the showpiece in his Manhattan shop window! Delillo has never put together so potent a satirical sequence as this.I forgot to mention that Lem’s childhood sweetheart, after being raped by a local bully and left for dead, was abducted by Italian speaking Chinese hoodlums and made into a sex slave. Sick and funny stuff.Upon reading this I was asked who Horatio Alger was and I realized I didn’t know much. I thought maybe he had written a book with a rags-to-riches theme, but I wasn’t sure about much else, so I looked him up (wikipedia), and his story was nearly as interesting as this book. As a young Unitarian minister he quickly and quietly quitted his post, and the town, after a scandal involving two teenage boys. It wasn’t until after his death that it was confirmed he had engaged in “the abominable and revolting crime of unnatural familiarity with boys”. After his departure he spent the rest of his life tirelessly working to help impoverished children, his many “American dream” books being just one aspect of this compassion. (Note: Compassion comment not ironic. Mr. Alger, contrary to whatever myths and stories have circulated down through time, seems like he was a complex guy who truly cared about kids.) I could say more, such as a biography that was actually a non-researched fantasia stood as the definitive life of Mr Alger for decades, and that his hometown recently removed his name from their annual celebration of his work with children once they found out about the pedophelia scandal... but this is a review of Nathanael West's novels...The Dream Life of Balso Snell is even more wildly inventive than A Cool Million, but didn’t engage me nearly as much; though the hero’s initial entry into the anus of the Trojan Horse definitely got my attention. From what I could gather the book is a send-up of many literary tastes and trends of the day – stream of consiousness, Gertrude Stein, Dostoevsky, etc – all a la Faust Part II."}, {"userName": "Jonfaith", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Certainly lacking in contrast, both of these works percolate in the fears and insecurities of not only a nation unsure of regaining its footing, there is something fundamental in his horror, Edmund Wilson was correct, West was our Kafka."}, {"userName": "Jay", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/6137835-jay", "userReview": "This books resides on my \"WTF-s\" bookshelf because of the novella \"The Dream Life of Balso Snell\". Not to spoil anything, but the novel recounts the said Mr. Snell's journey into the anus and up the colon and beyond of the Trojan Horse (of yore) and his encounters with various personages along the \"journey\". One might call this \"experimental\" fiction, but it's more of an odd footnote (I almost said \"hoofnote\") to the genre of \"the hero's quest\", though Mr. Snell is not exactly heroic. Critics have read all manner of ridiculous and strained interpretations into this, the weakest of West's writings, which interpretations are as much a load of road apples as are absent in the Horse. Read this if you're a Nathaniel West fan, or if you've got nothing better to do and are looking for a break from meaningful literature. There's some humor here, but Mr. Ed was funnier.Footnote: The \"writer's bio\" on Goodreads for Nathaniel West contains this statement: \"At Brown University in New York, he befriended writer and humourist S. J. Perelman (who later married his sister), and started writing and drawing cartoons.\" \"In New York\"??? Obviously, this biographer, who used the British spelling of \"humourist\", doesn't know his arse from a crumpet: Brown University, also my alma mater, is in Providence, Rhode Island, and always has been."}, {"userName": "tENTATIVELY, cONVENIENCE", "userReviewDate": "Mar 07, 2008", "userURL": "http://www.goodreads.com/user/show/534016-tentatively-convenience", "userReview": "I probably found out about Nathanael West & read his 4 short bks when I was in my late teens. What a discovery! I divide his novels into the absurd (these 2) & the 'realistic' (\"Miss Lonelyhearts\" & \"The Day of the Locust\") but the delineation is tenuous. All 4 novels are social criticism. \"The Dream Life of Balso Snell\" is from 1931 & is a slim 60 pages. All I remember of it is that the protagonist finds the Trojan Horse & enters it thru its asshole - finding graffiti along the way. This was my favorite, probably b/c it was the most absurd. \"A Cool Million\" is West's parody of Horatio Alger stories - you know the ones: the newspaper boy works hard & thru dedication & the reward system of capitalism becomes a successful millionaire businessman. West blows the well-deserved holes thru that one. The subtitle of \"A Cool Million\" is \"The Dismantling of Lemuel Pitkin\" & the hero pursues fame & fortune w/ Alger-like naivity, failing every step of the way & gradually losing body parts in the process. 113pp, 1934, set in the depression."}, {"userName": "Gareth Reeves", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/19475076-gareth-reeves", "userReview": "I feel that A Cool Million deserves more readers. An outrageous lampooning of the American dream and a picaresque which manages to out-brutalize Lazarillo de Tormes. The Dream Life of Balso Snell was a bit of a mess, not really worth my time."}, {"userName": "Kirsten Mortensen", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/6695939-kirsten-mortensen", "userReview": "\"A Cool Million.\" A savage, dark, cynical, and very un-PC little book. You were warned ;-)\"The Dream Life of Balso Snell.\" I read this book -- also very short (about 60 pages) -- as an allegory. The protag is a poet who enters the Trojan horse (i.e. an iconic artifact of the classical literary canon) through \"the posterior opening of the alimentary canal\" (heh) (The only other two openings were the the mouth, but that was out of Balso's reach, and the navel, but that \"proved a cul-de-sac.\" Double heh.)Once inside the horse's digestive tract, Balso encounters a number of peculiar individuals, all of whom want to talk his ear off. He finally realizes what they all have in common:\"The wooden horse, Balso realized as he walked on, was inhabited solely by writers in search of an audience.\"Kind of like my Twitter feed :-DAs soon as Balso reaches that realization, he makes a resolution:\"H]e was determined not to be tricked into listening to another story. If one had to be told, he would tell it.\"Totally cracked me up. Yet interestingly, the book ends not by Balso writing/telling a story . . . suggesting that for West, the resolution of Balso the poet's dilemma was not to write, but something else entirely . . ."}, {"userName": "Cullen Gallagher", "userReviewDate": "Aug 17, 2008", "userURL": "http://www.goodreads.com/user/show/696310-cullen-gallagher", "userReview": "\"A Cool Million\" is to literature what Preston Sturges' \"Miracle at Morgan's Creek\" was to cinema: a cleverly satirical jab at society that uses conventional narrative forms as a means of criticism and creativity...and unstoppable laughter. West's \"Million\" is like a cinema serial gone completely awry...as though the naive heros and heroines of those cliffhanger episodes were dragged through the worst that contemporary life had to offer. \"The Dream Life of Balso Snell,\" on the other hand, is an intriguing if incoherent riff on Dante's Inferno, led through the innards of a Trojan Horse. As the hero encounters one desperate failed writer (and lover, and human being) after another, one can't help but be disturbed by West's rampant nihilism. Humor is eclipsed by his uniquely jaded psychosis....I can't figure what it all means. Not as good as \"Million\" but worth reading to see West's wide range of talents."}, {"userName": "Bill", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/2002005-bill", "userReview": "Nathanael West wrote two of my favorite 20th Century American novels: Miss Lonelyhearts and Day of the Locust. I didn't realize (until a few months ago) that he'd also written two other novels: The Dream Life of Balso Snell and A Cool Million. These novels aren't nearly as good as his others and aren't really worth reading, unless you are a student of American Literature or a completist.Of the two in this collection, A Cool Million does have some entertaining moments, but gets so ridiculous that I had to force myself to finish it. I was struck by how much the Shagpoke Whipple character seemed almost contemporary in the way that he championed the capitalist American Dream (like a Ronald Reagan or Rush Limbaugh). I guess West was spoofing Horatio Alger stories in this novel; but since I haven't read anything by Alger, that point didn't increase my enjoyment of the book."}, {"userName": "John G.", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/11307916-john-g", "userReview": "Greatly enjoyed this book and these stories! Hard to believe these were written in 1931 and 34, the language and issues are quite contemporary. West has a unique voice and vision, I read his \"collected works\" sometime back and these were the two stories that stood out from that collection, even thought they aren't hailed as his best pieces. Dream Life of Balso Snell is simply bizarre and weird and trippy, never read anything quite like it. Wonderfully inventive and playfully irreverent! A Cool Million is a sad, dark, brutal indictment of the free market ideology, an anti-Horatio Alger story if there ever was one. Again, this story is hauntingly ahead of it's time and captures the current mood and mindset of this election campaign to a tee. West was almost a century ahead of his time, have to get his other books too and reread them with fresh eyes."}, {"userName": "Zach", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/8720137-zach", "userReview": "Balso was fun but weird. A Cool Million was exactly as advertised, a very (very) sarcastic jab at Horatio Alger stories. Both were good. Day of the Locust/Miss Lonelyhearts are clearly the high points in his criminally short career. I always forget how funny West is and more so, how modern his humor feels. His sarcasm and satire still feel razor sharp today. I really wish we could have gotten one more novel out of him. Reading his earlier work has only reinforced my feeling that he was one novel away from \"great american novel\" levels of quality."}, {"userName": "Stuart", "userReviewDate": "May 02, 2008", "userURL": "http://www.goodreads.com/user/show/1062920-stuart", "userReview": "One of Hunter Thompson's favorites, and thanks to the Doctor for listing it. Stunningly cynical, this dark little gem decapitates the Horatio Alger myth and dumps a load down its throat. In its own evil way, \"A Cool Million\" sheds more light on the American Dream - our most cherished national delusion - than a hundred thousand pages of Ayn Rand."}, {"userName": "Dan", "userReviewDate": "Mar 18, 2008", "userURL": "http://www.goodreads.com/user/show/929972-dan", "userReview": "Narratorial intrusions, shifts of person and register (pastiches of Fyodor Dostoevsky, Arthur Rimbaud, and William Shakespeare in the latter work), and different literary forms—the letter, the drama, the narrative, the poem. The resonance with Thomas Pynchon’s work is evident—verbal excesses, fantasies, satiric exaggerations."}, {"userName": "Tom", "userReviewDate": "Aug 13, 2008", "userURL": "http://www.goodreads.com/user/show/126378-tom", "userReview": "Haven't read A Cool Million yet, although I plan to.Read Dream Life over the course of a couple drunken train rides back from the city, and maybe it's not such a great book to read when you're not sober. Intentionally, kind of over-the-top bizarre in a way that isn't so satisfying, as I never felt like there was much of a payoff."}, {"userName": "Nick Scandy", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/6142862-nick-scandy", "userReview": "Some moments of brilliance, but there's a reason why most people talk about Miss Lonelyhearts and The Day of the Locust as his masterworks.The Dream Life of Balso Snell, however, makes me wonder if John Barth or any of the other slightly wacky metafiction folks held it as an influence, especially since it was written all the way back in 1931."}, {"userName": "Sarah", "userReviewDate": "Jun 28, 2010", "userURL": "http://www.goodreads.com/user/show/3937736-sarah", "userReview": "Did West assume his readers were too simple to understand any degree of subtlety or was he too simple to write with one? At least it was a quick read. I didn't mind either tale, and did find humor in several parts, but thought there wasn't as much substance behind the too-obvious satire as I had hoped to uncover."}, {"userName": "David Parson", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/5749921-david-parson", "userReview": "The thing with Nathanael West is that his concepts are more interesting than his prose style. Yes, he's funny, but he's also straightforward and dry, in my opinion. So as a grouping of novels, yes, he's a terrific satirist. But taken individually, the novels are...meh."}, {"userName": "James", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/236956-james", "userReview": "Not as resonant as A Day of the Locusts, but certainly worth the time it takes to read these novellas. A Cool Million just gets drearier and drearier. I laughed a lot. Strange that West isn't required reading."}, {"userName": "Becky Lipsitz", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/9130290-becky-lipsitz", "userReview": "Nathanael West changed my life in college. My professor William Melvin Kelley suggested I read him and everything about West's writing blows me away. I wish I could write like him. Please read these two novels. West deserves to be heard."}, {"userName": "Ginger Heskett", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/13479937-ginger-heskett", "userReview": "I registered a book at BookCrossing.com!http://www.BookCrossing.com/journal/14346123"}, {"userName": "Tamara Vallejos", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/1580308-tamara-vallejos", "userReview": "The. Worst. Just total ugh and disgusting on multiple levels. For a very particular sense of humor that I'm very thankful not to have."}, {"userName": "kasia", "userReviewDate": "Sep 08, 2009", "userURL": "http://www.goodreads.com/user/show/48206-kasia", "userReview": "What fun!"}, {"userName": "Penelope", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/4138484-penelope", "userReview": "chock full o' 19th century russian lit references and bizarro sentences that feel just right"}, {"userName": "Bob Logan", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/4531525-bob-logan", "userReview": "Incredible, a must-read."}, {"userName": "Jonny Cigar", "userReviewDate": "Jan 16, 2010", "userURL": "http://www.goodreads.com/user/show/1130257-jonny-cigar", "userReview": "What I learned from this book: try as you may, brave soldier, you will be shot."}, {"userName": "Ahk", "userReviewDate": "Aug 29, 2010", "userURL": "http://www.goodreads.com/user/show/4110785-ahk", "userReview": "Have only read A Cool Million. Reminds me of Candide, but very American."}, {"userName": "Hillary", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/1455294-hillary", "userReview": "The Dream Life of Balso Snell is brilliant!Cool Million was also really enjoyable but not quite as hilarious.Both are heavily satirical and ironic. West is (as always) a brilliant writer"}, {"userName": "Christopher", "userReviewDate": "Dec 20, 2010", "userURL": "http://www.goodreads.com/user/show/1116719-christopher", "userReview": "Read them again. Still great."}, {"userName": "Liz", "userReviewDate": "Oct 21, 2008", "userURL": "http://www.goodreads.com/user/show/268746-liz", "userReview": "A bit sophmoric and heavy handed when compared with Day of the Locust and Miss Lonelyhearts, but then what isn't?"}, {"userName": "theheadofthequeen", "userReviewDate": "Mar 17, 2008", "userURL": "http://www.goodreads.com/user/show/999384-theheadofthequeen", "userReview": "'a cool million' is perfect satire, capturing the amercian dream in a twisted yet oddly humerous way"}, {"userName": "Maria", "userReviewDate": "Nov 16, 2007", "userURL": "http://www.goodreads.com/user/show/146468-maria", "userReview": "A hard and sarcastic allegory of the American dream."}], "description": "A Cool Million (1934) subtitled \"The Dismantling of Lemuel Pitkin\", is a satiric Horatio Alger story set in the midst of the Depression and is written in a bracing, mock-heroic style that has lost none of its wit or power. The Dream Life of Balso Snell (1931), West's first work, was described by one delighted critic as \"a fantasy about some rather scatalogical adventures of the hero in the innards of the Trojan Horse.\"", "title": "A Cool Million and The Dream Life of Balso Snell: Two Novels", "url": "http://www.goodreads.com/book/show/229585.A_Cool_Million_and_The_Dream_Life_of_Balso_Snell", "average": 3.75, "cover": "https://images.gr-assets.com/books/1388647930l/229585.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/65685.Nathanael_West", "name": "Nathanael West"}], "type": ["Fiction", "Literature", "Novels", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/229585.A_Cool_Million_and_The_Dream_Life_of_Balso_Snell", "http://www.goodreads.com/book/show/2967036-the-dream-life-of-balso-snell-a-cool-million", "http://www.goodreads.com/book/show/138613.A_Cool_Million_The_Dream_Life_of_Balso_Snell", "http://www.goodreads.com/book/show/113441.The_Day_of_the_Locust", "http://www.goodreads.com/book/show/294459.Miss_Lonelyhearts_The_Day_of_the_Locust", "http://www.goodreads.com/book/show/250041.Miss_Lonelyhearts", "http://www.goodreads.com/book/show/887082.Miss_Lonelyhearts_and_A_Cool_Million", "http://www.goodreads.com/book/show/2295674.A_Cool_Million"]}