{"ratings": 310, "userreviews": [{"userName": "Sofia", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/8703838-sofia", "userReview": "\"Os lenços cada vez mais pequenos acenando, desfraldadas diante de ninguém e de nada, lembravam-me a partida de todas as vidas desprendendo-se do seu último cais, sem hipótese de regresso,a caminho do absurdo do fim. Não era aquele um sentimento de guerra?\"Penso que este é um daqueles livros que se ama ou se odeia. A maneira como a história é contada é bastante estranha e confesso que detestei a primeira metade. Na segunda já consegui sentir algum interesse, o que me permitiu terminar o livro.Parafraseando os soldados do último capítulo: \"tanta merda por uma história de cornos\"."}, {"userName": "Sonia Gomes", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/1948955-sonia-gomes", "userReview": "With a flick of a pen, Lidia Jorge, transports you to the battlefield of the colonial war in Mozambique, where she and her husband, a Portuguese soldier lived for six years. ‘A Costa dos Murmúrios’ seems to be an echo of those terrible years of sadness, frustration and most of all of disillusionment. Narrated in a dead pan voice of Evita, we are taken back to Mozambique, to a war which did not help anyone, a war that destroyed a country and turned ‘normal’ men into inhuman beings.But let’s get back to the hauntingly beautiful book, ‘A Costa dos Murmúrios’, let Evita narrate her strange tale of life as the wife of a soldier fighting a war so far away from home, in surroundings totally alien to him, a war that had nothing romantic about it, as had those battles fought in the arena of the Second World war. Evita, full of love and hope as any young bride should be, travels to Mozambique to marry her college sweetheart Luis, now a soldier posted in Mozambique fighting the Colonial War. The wedding held at the Stella Maris hotel, where the Officers are billeted, is very good, all the guests have a lovely time, food and champagne flow; the highlight of the evening is when the Commandant graces the occasion and as a mark of respect to Luis dances with the bride. As on any honeymoon, things are good, lots of laughter, lots of sex. But although Evita does not want to admit it even to herself, she does notice subtle changes in her Luis, why does he worship the Commandant, who struts around in fine muslin shirts, a scar on his chest to be seen and envied? Or why does Luis get so angry when reminded of his days at the University which she, Evita, had shared with him with so much joy? Why does he act so strange in their bedroom recreating ambushes, jumping out of the cupboard, playing cat and mouse games? So amusing really. But the worst thing, something that leaves her utterly bewildered and to some extent sad, is his utter disdain for his beloved Mathematics, small things no doubt, Evita the new bride ignores all this but…..come on now, no cause for alarm, it is their honeymoon and most importantly it is her beloved Luis that we are talking about. There are other strange happenings too, in the place where they are billeted, some days ago huge numbers of Blacks had died of Methyl Alcohol poisoning, but everyone had said, ‘You know how these Blacks are, crazy, plain crazy for Alcohol, they will do anything for a drink’ ‘Did you see any Whites dying? Did you see any Whites dying of Methyl Alcohol poisoning’ ‘No chance, after all we are not like those Blacks, we have superior intelligence, animals they are, plain animals’. And truly so many Blacks had died, that they were carried away in dumpers and dumped in mass graves. The Officer’s wives at the Stella Maris crowded the railings watching the movement of the dumpers carrying the dead bodies of those stupid, animalesque, Blacks who will do anything for a drop of alcohol. Chattering, laughing, preening swinging their well ironed hair from shoulder to shoulder, the ladies truly a gay bunch of lovely women shared in the unusual excitement of dead people being carried away in dumpers, even if strictly speaking Blacks cannot be termed as people. And then one fine day….. the brave Portuguese soldiers, prepare to vanquish those Blacks, rout them forever from their territory, from their Mozambique, a total decimation of Blacks, it would be an All-White Victory…..The battalion moves to the front, after all since times immemorial men have fought battles to protect their territory, the women as always stay at home, are left alone at the Hotel Stella Maris. The women do what women are best equipped to do; they wait for their brave men to come home from War, of victory they have no doubt. Meanwhile there is always something to do, hair to be ironed and straightened, clothes to be given to the washerwoman, children if any, to be looked after. Gossip about distorted fragments of War, reaching very infrequently to strike the walls of the Hotel Stella Maris, but never fear, one thing they are very, very, sure about is that it will be an All-White Victory with total annihilation of the Blacks. They know it, they have heard it so often, there are no doubts about it at all, an All-White Victory it will be with total decimation of the Blacks. And what does Evita do amongst this gaggle of ladies, Evita too waits, leads a serene life, walks on the seashore, swimming in the beautiful warm waters, conversation with the other ladies. Waiting can be pleasant when you wait for your loved one…..And then one fine day, whilst swimming lazily, she finds a bottle, a bottle in the ocean; could it have a message for her? Strangely it did, the bottle of wine encased in straw, tasted of Methyl Alcohol. It strikes Evita, sadly realization dawns, Evita now is sure, the blacks had not been drinking Methyl Alcohol, the wine they had been drinking had been poisoned. A dash to the local newspaper yields no results, the reporters are tired, they have no time for controversial stories, or so it seems to Evita. It is then that Evita befriends the Commandant's wife, Helena, a lady she never really had time for, a lady who lives alone in a bungalow. Their friendship progresses, and then Helena, shows Evita things which make her flesh crawl, her heart stop, her mind reel with disgust and disbelief, her beloved Luis, her mathematician husband whose only preoccupation had been Mathematics, is a man who kills Blacks for pleasure with no remorse, just sheer unadulterated pleasure. Pictures of Luis atop a straw hut, machamba, the head of a Black skewered on to a lance, Luis setting fire to straw huts with women and children inside, Luis shooting off the cloaca of hens with extreme accuracy. Isn’t he now called Luis Galex? The photographs are proof of their loyalty to the White Regime; an All White Supremacy that would rule Mozambique after the Blacks had been decimated. And then the battalion returns, their men return………..no, no, not victorious, not covered with laurels as imagined, but well and truly beaten. Luis, the destroyer of the Blacks is a totally dejected, crushed, hollow figure who has nothing to live for, dreams of an All-White-Supremacy well and truly shattered. Now for some cleaning up, mopping up of all the evidence, the Commandant and Luis, obliterate all evidence, burn their dreams and those incriminating photographs of their efforts to exterminate the Blacks, out with that desire and dream of an all White Supremacy. Destroy those huge barrels of Methyl Alcohol, who will understand that the black scum were not people but vermin to be eliminated at any cost. Did anyone force those Blacks to drink that wine? Vermin that they were, they lapped it, brain dead illiterates, who could call such vermin humans, pity we could not wipe the entire population of scum, make it a white country And then, Luis comes to know that Evita has taken up a lover, much like his beloved Commandant had behaved, when Helena had taken up a lover, Luis goes in search of the lover, he wants to crush this lover, salvage some pride, be a Man once again, retrieve some part of his lost soul, but the lover forewarned, escapes and the sad and empty thing that Luis has turned, commits suicide. Eva or Evita, who had come to Mozambique in search of her beloved Luis, ready to live a life with him, finds nothing but disillusionment, terrible loneliness and wonderment at how things could have gone so wrong. And Luis, when did he change from that intense Mathematician into a killing machine, when did he change into Luis Galex?Yes, the Officers wives lead pathetic and lonely lives, with nothing to do, nowhere to go. In their little capsule, Stella Maris, they exist for the time that their husbands will return, and they will be a part of the White Supremacy. Of course, they deserve to be rewarded for their sacrifices; they deserve to benefit from the spoils of war."}, {"userName": "Marisa Martins", "userReviewDate": "Sep 20, 2011", "userURL": "http://www.goodreads.com/user/show/2102508-marisa-martins", "userReview": "Estamos em África, nos princípios dos anos 70 e com a guerra colonial como pano de fundo. No centro da trama, estão dois casais, Eva Lopo e o alferes Luís Alex, e Helena de Tróia e marido Capitão Forza Leal. Cabe à primeira a responsabilidade de narrar as suas histórias. Quando os maridos eram destacados para partir em missões que os obrigavam a deslocar-se para o mato, o Hotel Stella Maris tornava-se na residência temporária das esposas. E é aí que Lídia Jorge tece a vida de um grupo de pessoas peculiares que tentam sobreviver num continente em guerra e, acima de tudo, num continente onde reina a incerteza no amanhã. \"África é amarela, minha senhora – disse o comandante, apertando pelo carpo a mão de Evita – \"As pessoas têm de África ideias loucas. As pessoas pensam, minha senhora, que África é uma floresta virgem, impenetrável, onde um leão come um preto, um preto come um rato assado, o rato come as colheitas verdes, e tudo é verde e preto. Mas é falso, minha senhora, África, como terá oportunidade de ver, é amarela. Amarela-clara, da cor do whisky!\"Enquanto escrevo esta review, tento decidir se gostei ou não da leitura. Ainda não sei e está cada vez mais complicado. A história é estranha ou pelo menos eu achei-a estranha.Gosto de ler sobre África e gosto ainda mais de ler sobre a África doutros tempos. O choque cultural e a forma de vida fascinam-me.A escrita é, sem dúvida, a mais valia do livro. O enredo dos personagens não cativou-me e talvez seja essa a razão que faz com que seja complicado ter uma opinião sobre este livro. Terei de ler outro livro da Lídia, antes de colocá-la totalmente de lado."}, {"userName": "Colin", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/17594936-colin", "userReview": "Este texto era para ser uma opinião sobre um livro mas acabou por se tornar uma dupla-opinião, sobre um livro e um filme. A razão para esta decisão vai se revelar em breve.Comecei a ler “A Costa Dos Murmúrios” de Lídia Jorge no inicio de Outubro, mas custou-me muito entender o enredo. O livro desenrola-se em Moçambique, no principio dos anos setenta, durante a guerra colonial e tem a ver com o horror inerente a um sistema daquele género, baseado em violência e arrogância que envenena as vidas das pessoas assim como o álcool metílico envenenou as pessoas que beberam o vinho logo do início do livro.Entendi cenas, sim, diálogos e parágrafos, mas é escrito num estilo muito literário que me faz lembrar os romances de Graham Greene e de Joseph Conrad. Por isso, não consegui entender o enredo inteiro. Ainda por cima, Lídia Jorge utiliza muitas palavras desconhecidas. O meu dicionário ficou sempre perto de mim. Porém, às vezes, até o dicionário não chegou. Por exemplo, havia uma palavra “mainata” que não conhecia. Não a encontrei no dicionário, e a minha mulher não sabia o significado. Hum, uma mulher deu nomes às mainatas e mainatos. Os nomes eram nomes de vinhos. Um deles, Mateus Rosé, morreu. Perguntei ao Google.Exmo GoogleO que é que é uma mainata por favor?ObrigadissimoColinO Google respondeu com imagens de pássaros pretos que se chamam “mynah” em inglês. Falam ainda melhor do que os papagaios. Boa. Durante o resto do livro, imaginei estes pássaros de estimação lá em casa.Quando cheguei ao fim, decidi ver o filme para que pudesse ter certeza do que é que tinha acabado de ler. Imediatamente, vi o meu erro. Um(a) mainato/a não é um pássaro, mas sim um empregado doméstico. Talvez seja uma palavra especifica do ultramar, e só significa um empregado negro. Não sei. Senti-me ridículo por ter feito um erro tão estúpido!Há outros aspectos do filme e do livro que me deixaram confuso. Por exemplo, ainda não entendo o relacionamento entre a escritora e a protagonista, Evita. A Autora escreveu o papel dela no primeiro capitulo do livro mas não percebi exactamente o que é que ela queria dizer. Gostei do livro mas estou muito contente por ter visto o filme também porque ajudou-me muito a entender a história."}, {"userName": "Joana", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/4896550-joana", "userReview": "Sendo uma autora tão apreciada e tratando de um tema que me agrada (Guerra Colonial), estava com bastantes expectativas. Só que o livro é estranho, não que a escrita seja complicada ou o enredo demasiado confuso, mas é simplesmente estranho, acho que não tenho outra palavra para o descrever. De resto, lê-se bem, a escrita é boa, simpatizei com a personagem principal, as coisas resolveram-se, não ficaram muitas pontas soltas. Enfim, não consigo decidir se gostei ou não, pois, por um motivo que não consigo explicar, o livro é esquisito, sem ser mau."}, {"userName": "Carolina", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/4098632-carolina", "userReview": "[não deixando opção às Helenas se não excluírem os homens da sua sexualidade, para se resgatarem a si mesmas de uma relação manchada pela iniquidade. Já as Evitas podem emancipar-se e transformarem-se em Evas Lopo, revoltando-se através do exercício da sua sexualidade com homens que se distinguem pela sua inofensividade ou crítica velada à guerra. (hide spoiler)]"}, {"userName": "Eric Piotrowski", "userReviewDate": "Jul 29, 2007", "userURL": "http://www.goodreads.com/user/show/233776-eric-piotrowski", "userReview": "This is one of the most difficult books I've ever read, but also one of the most fascinating. History, narrative deconstruction, time, violence, love -- the neuroses of the world encapsulated into a magnificent but woefully underappreciated novel."}, {"userName": "Felipe Chevarria", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/51249327-felipe-chevarria", "userReview": "Que livro fantástico! Polifonia vibrando em cada página, nem sabia mais quem tava narrando, lindo <3"}, {"userName": "Nanou", "userReviewDate": "Oct 26, 2013", "userURL": "http://www.goodreads.com/user/show/16091222-nanou", "userReview": "Le rivage des murmures, c’est une même histoire racontée de deux façons différentes. D’abord, une nouvelle de quelques dizaines de pages, Les sauterelles, qui met en scène une jeune femme, Evita, fraîchement arrivée au Mozambique, encore colonie portugaise, pour épouser Luis Alex, sous-lieutenant qui effectue son service militaire. C’est la soirée de leur mariage qui se déroule sur la terrasse de l’hôtel Stella Maria, au milieu de la bonne société locale, représentée par les colons et les militaires. Ces derniers doivent bientôt rejoindre une zone de combats près de Mueda et Luis Alex fera partie de l’expédition. Au matin qui suit leur nuit de noce, Evita et Luis sont réveillés par le manège incessant de camions-bennes venus récupérer des corps, charriés par le fleuve et qui viennent s’échouer sur la côte de l’Océan Indien. Au début, nul ne comprend ce qui se passe et les esprits s’agitent. Puis, on apprend qu’un stock de bidons d’éthanol a été dérobé sur un bateau et que les locaux ont bu cet alcool, s’empoisonnant en masse. L’intérêt des occidentaux retombe alors comme un soufflé, jusqu’à ce que le cadavre d’un homme blanc apparaisse au milieu des noirs. Un reporter photographe, certain de dénicher un sujet qui intéressera ses lecteurs, veut prendre des photos de cet homme blanc et Luis Alex est chargé de l’en empêcher. Il part à sa poursuite, alors qu’un banc de sauterelles s’abat sur la ville, noyant tout sous une nuée verte. Un coup de feu retentit, le jeune sous-lieutenant ne revient pas, son corps est retrouvé quelques heures plus tard, un trou au milieu du front. L’enquête rapide de l’armée conclura à un suicide.Vingt ans plus tard, Eva Lopo, qui ne se fait plus appeler Evita, lit la nouvelle, fait part de ses commentaires à l’auteur et explique ce qui s’est réellement passé. Elle raconte l’ambiance lourde et poisseuse de la ville, le changement de caractère que la vie militaire a provoqué chez Luis Alex. Dans la vie civile, Luis était un jeune mathématicien, rêvant uniquement de résoudre des équations à plusieurs inconnues qui avaient mis en échec Evariste Gallois. Au retour des missions auxquelles il participe, il n’est plus le même. Evita, qui s’est liée avec la jeune femme du capitaine, découvre des photos qui montrent les exactions pratiquées par les soldats sur les autochtones, mettant à jour les réalités du conflit entre les autorités militaires portugaises et les populations locales, les enjeux de cette guerre coloniale qui ne s’avoue pas.J’ai bien aimé la construction de ce roman, très originale. La succession de deux visions des évènements, et la présence de la même femme, à deux âges de sa vie, apportent une perspective très intéressante. Dans la nouvelle, c’est la vision des Portugais colonisateurs qui s’exprime, en parallèle à la découverte d’un pays par une jeune femme sensible et naïve. Dans la suite du roman, à côté de la révélation d’épisodes terribles, c’est aussi la vie des femmes de soldats qui est évoquée, elles qui attendent leurs hommes pendant qu’ils sont en mission, et qui doivent s’adapter à leurs changements d’humeur et aux conséquences des horreurs qu’ils ont vécues.La langue de Lídia Jorge est très évocatrice, décrivant aussi bien les sensations et les sentiments de ses personnages que les couleurs et les odeurs du Mozambique."}, {"userName": "Ricardo", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/12748651-ricardo", "userReview": "Set in one of Portugal's old colonies, and during the rebelions which led to its independence, this book starts with the depiction of an event for which at first we aren't able to understand are its origins.In the next chapters, we discover that the first chapter is in fact a book which describes that event in a metaphorical way.Troughout the book the main character explains the full context, motives and characters associated with the event and with its conclusion.A powerfull story which didn't grasp me quite as much as I'd expect mostly because of the way it's structured.Altough the language and story aren't complex, the narrative structure made me feel lost at some times, thus breaking (for me at least) the flow of the reading and that is mainly the reason of my two-star rating."}, {"userName": "Rodrigo", "userReviewDate": "May 07, 2013", "userURL": "http://www.goodreads.com/user/show/7000522-rodrigo", "userReview": "Eu gostei até gostei mas, na minha singela opinião, tem um valor lúdico muitíssimo maior que o seu valor literário. Com uma escrita bonita e um sentido narrativo bastante coerente, tem a capacidade de nos ensinar mais (e de uma forma bastante descontraída) sobre as Guerras Coloniais, proporcionando uns momentos interessantes ao leitor. No entanto, e não desfazendo das suas qualidades, não foi um livro de que gostasse particularmente, talvez pelo tema que estava a ser a descrito não ser, de todo, dos meus temas de eleição. Foi, mesmo assim, uma boa e descontraída leitura, que recomendo, em especial a quem esteja interessado no tema! 2.5*."}, {"userName": "DonQuijote", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/9945545-donquijote", "userReview": "Era la segunda vez que intentaba leer este libro. Lidia Jorge es una autora portuguesa de prestigio, pero nada fácil de leer y quizás por esto, no puedo decir que me haya gustado el libro. Una historia ambientada en los últimos días de la Guerra Colonial en Mozambique con muchos personajes que al final no sabes ni quién son ni cómo son. Unos hechos que se van desarrollando sin seguir una lógica en el tiempo, unas metáforas que ya no sabes si son metáforas, descripciones de los recuerdos de la narradora, verdad o mentira. No sé, demasiado complicado."}, {"userName": "Jessica Alves", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/19911590-jessica-alves", "userReview": "Li este livro num fim-de-semana, sem pressas, para apreciar o estilo, por vezes, quase poético. Gostei do retrato do colonialismo, da descrição de África dos anos setenta, da maneira como Lídia Jorge descreve a guerra, cruel para com os colonizadores e os colonizados. Mas, o que me atraiu mais foi a personagem de Eva Lopo e a forma de ela lidar com as memórias. Vale a pena ler este retrato de uma fase conturbada da história Portugal e das, então, colónias."}, {"userName": "Mario Soares", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/28628801-mario-soares", "userReview": "Santo Deus!!!!!! Estou ainda a algumas (e certamente intermináveis) páginas para terminar de ler \"A Costa dos Murmúrios\" e já ansioso em ler algo que tenha pé e cabeça. O estilo de Lídia Jorge, de fato, é bonito, o problema é a falta de pé e de cabeça. Duvido que a própria autora haja entendido 100% do que narrou."}, {"userName": "Pequete", "userReviewDate": "May 31, 2008", "userURL": "http://www.goodreads.com/user/show/1192324-pequete", "userReview": "Ao que parece é um dos livros mais célebres sobre a guerra colonial, mas a verdade é que não consegui passar das primeiras páginas, coisa que já me aconteceu com outros livros da autora…Libertei-o através do BookCrossing"}, {"userName": "Ines Amaral", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/8365373-ines-amaral", "userReview": "Confesso que não gostei deste livro. Da primeira à última página, não me cativou absolutamente nada."}, {"userName": "Cláudia Santos", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/39760034-cl-udia-santos", "userReview": "Muito difícil de ler e compreender... aliás peço desculpa se vou ferir susceptibilidades, mas não percebi nada!"}, {"userName": "Carla Ramalho", "userReviewDate": "Oct 30, 2015", "userURL": "http://www.goodreads.com/user/show/42907030-carla-ramalho", "userReview": "Comecei duas vezes e não consigo (pelo menos para já) continuar. Não me identifico com a escrita da autora, é confusa ... não me prendeu."}, {"userName": "Hugo Filipe", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/18326930-hugo-filipe", "userReview": "Não é das leituras mais fáceis, mas compensa o esforço, apesar de faltar alguma fluidez."}, {"userName": "Maria Luisa", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/5848993-maria-luisa", "userReview": "A very surprising book – an account of the colonial war from the experience of the wife of a young officer. A very intelligent look of the past."}, {"userName": "Landslide", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/2268339-landslide", "userReview": "Opinião no meu blog"}], "description": "Romance de um império de ocupação de costa, nada é atenuado ou escamoteado neste livro. Enredo e personagens arrastam consigo o significado caótico de um universo desregulado, onde o risco permanente torna os protagonistas dependentes em extremo de fortuitas coincidências.", "title": "A Costa dos Murmúrios", "url": "http://www.goodreads.com/book/show/7607017-a-costa-dos-murm-rios", "average": 3.39, "cover": "https://images.gr-assets.com/books/1356218019l/7607017.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/1001034.L_dia_Jorge", "name": "Lídia Jorge"}], "type": ["Fiction", "European Literature", "Eastern Africa"], "outlinks": ["http://www.goodreads.com/book/show/7607017-a-costa-dos-murm-rios", "http://www.goodreads.com/book/show/3371637-a-costa-dos-murm-rios", "http://www.goodreads.com/book/show/209671.Murmuring_Coast", "http://www.goodreads.com/book/show/17162622-a-costa-dos-murm-rios", "http://www.goodreads.com/book/show/18718292-le-rivage-des-murmures", "http://www.goodreads.com/book/show/5462859-o-vento-assobiando-nas-gruas", "http://www.goodreads.com/book/show/6065554-combateremos-a-sombra", "http://www.goodreads.com/book/show/11542264-a-noite-das-mulheres-cantoras", "http://www.goodreads.com/book/show/8261224-o-dia-dos-prod-gios", "http://www.goodreads.com/book/show/20957823-os-memor-veis"]}