{"ratings": 392, "userreviews": [{"userName": "Jenny (Reading Envy)", "userReviewDate": "Feb 15, 2014", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I received an advance copy of this from NetGalley in exchange for an honest review.I was first exposed to Ellen Gilchrist to her book about writing, a book that is more of a memoir. From that, I learned that she came late to writing, has always put her family before her career, and that she is a southerner through and through.These things all come through in her stories. I'd like to read some of her earlier work to compare, because these stories definitely have a feeling of someone ruminating about life and death and family from the vantage point of having already lived through it.Each story spins around a death or disaster - flood, suicide, car accident, tornado, hurricane (making the book title Acts of God very clear) - and by the end everything is okay and the living have learned important life lessons. To me, stories like this are just one step up from the Chicken Soup for the Soup type, which makes me suspect I am not Gilchrist's usual audience. But then I stop myself and remind my head that she won the National Book Award at one point. I definitely need a point of comparison.All of the stories are set in the south, except one that is set at the London Heathrow Airport, featuring southerners. All the characters feel older, despite some of them being given younger ages, they always felt like they were in their 50s and 60s."}, {"userName": "Maggie", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/231635-maggie", "userReview": "*Minor Spoilers*I hate to give this one a middling review. I've been a fan of Ellen Gilchrist for years, and was so excited to come across a new collection, but it seemed like these stories were rushed through and not given the level of care and attention to detail that I've so admired in her other books. Some of the 'too-happy' endings were irksome, like the story where the young widow who is struggling financially - of course - is brought together with the too good to be true (and also rich) single father because a child made a wish. The guy proposes to her within six weeks and they live happily ever after (perhaps that one especially bothers me because my own experience of accepting a six-week proposal ended in four years of misery and a restraining order that had to be renewed -twice). Also, there were editorial inconsistencies. One story that comes to mind mentioned a character, a young girl aged four 'who would eat chocolate pudding all day' if her mother let her - a few pages later, the same character is mentioned as her mother worries about her because she's in second grade and not yet reading. An oversight that could be easily overlooked, yes, but together with stories that were so much less complicated and more easily resolved than those I've come to love made me feel this collection is not her best work.If you're new to Ellen Gilchrist's work, don't let this book discourage you from reading more. Maybe she rushed to get this one out, or maybe she was working with an inexperienced editor or a publisher who was pushing her toward more mainstream appeal? Either way, I'm looking forward to her next collection and hope it rocks as much as the stories I've read before."}, {"userName": "Amanda", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/802351-amanda", "userReview": "Meh. I've read many Gilchrist books and enjoyed them, but it's been years and I have to wonder if my tastes have changed. I quickly remembered her way of writing, which I can't decide if I like or not; sometimes it's nice to read details that aren't always plot-driven; they are just kind of a \"slice of life\". On the other hand, sometimes it comes across as tedious to me. Most of the characters irritated me; they all seemed pretty well-to-do and whiny."}, {"userName": "R. Scott Anderson MD", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/5901166-r-scott-anderson-md", "userReview": "Acts of God \tI’m not going to start off with the pretense that this is an unbiased review. I have long thought Gilchrist to be one of the most talented writers of the second pantheon of Southern writers. (She is temporally post-Faulknerian, and was, in fact, a student of Welty's at Milsaps College.) She arrived alongside the likes of Willie Morris, James Dickey, Walker Percy, Shelby Foote, and Barry Hannah and she more than held her own, she thrived. She avoided the pitfalls of success that hobbled so many of her contemporaries and her writing grew in depth and complexity. She won The American Book Award for Victory Over Japan, but that wasn’t my favorite of her books. To me the high water mark came early. In the Land of Dreamy Dreams was so very intense in terms of language and theme that I found it to be the standard for the modern short story, in many ways. \tGilchrist has written in every form, poetry first, short stories, novels, and memoirs are all in her oeuvre, and she is good at them all. But it is the short story that is her strong suit. In this collection she is back in top form. Is it as good as Victory over Japan? I have to say yes. Is it as good as In The Land of Dreamy Dreams? I have to say, perhaps. It is different, it is written by a more mature author in a different time in the world, but it is an analysis of that world that is every bit as sharp and every bit as spot on as In The Land of Dreamy Dreams was when it was written.\tI got to cheat on this book quite a bit, we were able to publish Toccata and Fugue in D Minor in the first issue of China Grove and I knew when I first read it that it was Gilchrist at her best. Brave, incisive, and hopeful facing a world plagued by the faces of terror. I got to spend time with her and heard the descriptions of the stories in this collection during our interview that came out in that same issue and then again at the Welty festival at Mississippi University for Women in Columbus, MS. So, I knew what the stories in this collection were about, I just wasn’t sure how she’d write them.\tLast night, lying in bed next to my wife, I had just finished reading Collateral.\t“My God, she did that just right,” I said. “The way she finished that story. I didn’t know exactly where she was going with this, I just wasn’t seeing it, but she finished it perfectly.” \t“I’m sure she was concerned you’d think so,” my wife replied smiling.\t“What do you mean?”\t“Ellen is how old?”\t“She's in her seventies...”\t“So, she is a seventy-plus year old woman, who has spent her whole adult life writing some of the most outstanding short stories in the English language. I’m sure she’s just sitting over there in Arkansas, worrying what you were going to say about Collateral. You should call her first thing in the morning. Right when you first wake up, to save her from worrying through another day.”\t“I think I will.”\t“I think you should.”\t“Why do you think she wouldn’t care what I thought?”\t“Because she knows more about writing than you know about reading. She has the voice in her head to tell her what’s true. She doesn’t need your voice on the phone.”\tLater I read aloud to her from The Dogs.\t“I can’t picture Ellen saying that,” I interjected.\t“Because, she didn’t, Rhoda said it, the same Rhoda who went hunting with her daddy. It’s exactly what she would say.” My wife answered.\tSee, this is what I’m trying to get to, this collection is so crisp, it is so clear, it is so transparent that it fits in your life. These are people you know. This is an author who shows you a glimpse into a world that is different and old and modern and good and scary all at the same time and leaves you convinced that it’s worth it. And if we all are facing our own mortality, there is hope even in that.\t\t\t\t\t\t\t\tScott Anderson MD\t\t\t\t\t\t\t\tEditor, China Grove"}, {"userName": "Sascha", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/5889555-sascha", "userReview": "I have been a fan of Ellen Gilchrist's for many years and when I saw this new collection of short stories, I was very much looking forward to reading it. Unfortunately I was disappointed. Don't get me wrong. There are some great moments in Acts of God, but there are also stories that cover so much ground chronologically and don't envelop the reader because it seems as if the theme or the idea is more important than the characters' relationships to them.Most of the stories are about upheaval or disasters and human reaction to them. Perhaps the best is the one in which a young woman who is in the Air National Guard is called to New Orleans to rescue people from roofs after Katrina. This is one of the few stories in which a virtuous act is not cushioned by selfishness or self-absorption, but one in which the character reacts to horrors and the small miracles and feels changed and is changed. Perhaps a couple of the other stories ring true simply because the characters are materialistic and self-absorbed and view an extraordinary situation from the viewpoint of what they can get from it or what it will make them into. There is some heavy-handedness with what I consider to be preachiness and I am not certain that it's Gilchrist's intent for that to be unleashed upon the reader (because I am giving her the benefit of the doubt), but then again, it's been years since I have read any of her work and maybe what I once overlooked is now an elephant."}, {"userName": "Monica", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/1572417-monica", "userReview": "I am a huge fan of Ellen Gilchrist, and I am a sucker for a collection of her finely crafted short stories. \"Acts of God,\" however, was no \"Victory Over Japan\" (one of her best collections). The stories in \"Acts of God\" are too \"all ends well.\" And, Gilchrist's exceedingly well-to-do, athletic, well-positioned, beautiful, white, rich Southerners come off as overly optimistic because -well - who wouldn't be if you had all that damn privilege...There are some lovely lines in the work, and I love to see what familiar characters are up to - Rhoda and Louise in these stories. There, overall, was a grit and honesty that was lacking in this collection. Having said that, I love Gilchrist's prose and willful women characters; so, although this collection is a one star for Gilchrist, it is still a three star work because Gilchrist is a master short story writer who respects and likes her reader. Gilchrist's fond feelings about sharing the beauty of literary exchanges between writer and reader show through in her good writing time and time again."}, {"userName": "Catherine Shattuck", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/6453935-catherine-shattuck", "userReview": "Reading Ellen Gilchrist always makes me feel the same way, like being alive is about the best thing there ever was. Her recent work (last 10 years or so) hasn't been nearly as good as her earlier work, and after the first few stories in this new collection I was thinking the same thing about this book, but then with \"Toccata and Fugue in D Minor) she introduced some of her old and much loved characters (or their relations) and the stories started to sing again and I fell in love. My favorite stories were \"Acts of God\", \"Toccata and Fugue in D Minor\", \"The Dogs\" (Rhoda's back! God, I love her. Probably my favorite Gilchrist character ever, not to mention my first), and \"The Dissolution of the Myelin Sheath\", which was my most favorite of all."}, {"userName": "alsmilesalot", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/137070-alsmilesalot", "userReview": "For years, I've been disappointed in 90% of the short stories I've read, and yet, I still consider myself someone who loves the form. Ellen Gilchrest is in part, why (2 very different writers, Raymond Carver and Jim Harrison, are also responsible)..It's been at least 8 years since I read anything by her (but had, up until that point read almost everything) and I didn't realize how much I missed her writing until I picked up this collection. I'm not sure any would make it to my \"top 10 EG stories\" but they shine with compassion and humor.Maybe I'd really only give 4 stars for the stories, but it's an unequivocable 5 for the joy of rediscovering a long lost favorite."}, {"userName": "Lorraine", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/573080-lorraine", "userReview": "Acts of God? More like Acts of Humanity or even Humanism. The first story, Acts of God, was humourous. \"Miracle in Adkins, Arkansas\" was heart-warming. \"Toccata and Fugue in D Minor\" (about the woman with the loser boyfriend who (the woman not the boyfriend) rescues people in New Orleans from rooftops and returns as a celebrity and meets Mr. Perfect) was eye-rolling chicklit. From there the stories just got worse. \"The Dogs\" was ridiculous, and the others just silly. Not my thing.(Note: I received this as an ARC from LibraryThing's Early Reviewers program.)"}, {"userName": "Angela Hursh", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/27870169-angela-hursh", "userReview": "A very solid and thoroughly enjoyable collection of short stories. Several of these read like articles in a magazine... they have a journalistic tone and pace. The first story is amazing--the best of the bunch. The last story was a dull and unmemorable way to end the book, which was quite a disappointment. But I'd still recommend the book to anyone who loves short stories, as I do."}, {"userName": "Amy", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/11902973-amy", "userReview": "I liked some of the stories much better than others, but overall it's a good read. She is excellent at giving you a rich feel for characters and setting in short stories.I will say that as someone who has MS, I hated the story about the MS patient. My favorite was Carly's story."}, {"userName": "Ryan Dejonghe", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/21649558-ryan-dejonghe", "userReview": "Let’s get this warning out of the way: this is a modern anthology of short stories with a southern touch. Key words: modern; touch of southern. In other words, southern, bible-belt evangelicals will take issue with the premarital sex, suicide, gay marriage, and f-bombs contained in this book. For the rest of us that are okay with all of this in our literature, proceed.Now that we’ve gotten rid of those folks, let’s talk about this book. National Book Award-winner Ellen Gilchrist spent nearly a decade writing the ten short stories appearing here, in ACTS OF GOD. I’m assuming you are like me, and have some basic questions you want answered before reading a short story collection. Here’s my attempt at reading your mind (any other questions, drop in the comment section below):1)\tHave these short stories been previously published elsewhere?Not that I can tell by the copyright page.2)\tIs there a congruent theme among all the stories?The idea “acts of God” affect people. This is loosely defined, though. There are hurricanes and tornados, but there are also terrorist attacks and love making. Congruency depends on your definition of acts of God. Most of the stories take place in the south, minus one story taking place in Europe while some ladies are on a getaway vacation.3)\tDoes the author’s voice vary from story to story?The same southerly charm persists throughout, but to some disservice to the work. In cases such as younger protagonists needing “a rubber”, the author’s aged reference breaks believability. The material is good for front porch swing reading, but to some chagrin. 4)\tDo any stories stand out as particularly good or bad?I appreciated the eponymous “Acts of God” and the last two works “Jumping off Bridges into Clean Water” and “Hopedale, A History in Four Acts”. They were succinct and charming. “Collateral” and “Toccata and Fugue in D Minor” both felt long in the tooth and a bit unbelievable.Overall, the stories try to show ordinary people reacting to life situations, both ordinary and extra-ordinary. Themes present include: independence among the elderly, finding hope in tragedy, connecting with lost love, overcoming bias, and dealing with broken bodies. The age reference may appeal to readers over fifty, but there is enough charm for the younger crowd, too.Thanks to Algonquin Books for providing me with a review copy of this book."}, {"userName": "Kathleen", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/1062592-kathleen", "userReview": "I am always humbled by the skillful short story writer, and these ten short stories are exquisitely skillful. I realized after the first two that I had been holding my breath, bracing myself, waiting for tragedy to strike. Then I understood that the people in these stories, perhaps blindsided by “an act of God” or well practiced in living a life filled with challenges, had already experienced the unexpected, the crisis, the tragedy, big or small. And they were figuring it out, maybe not in conventional ways but making deliberate choices to live life on their terms, not defeated by adversity. To say that the protagonist in each story is resilient, calling on inner resources, and all of that would be an understatement. Gilchrist’s characters mean what they say to each other and to the reader: Look around you. Pay attention. Do something.Gilchrist’s perceptions about human behavior are insightful and often imprinted with her light touch…“Who would have such a job, watching old people to keep them from driving their car?”… “I’m not interesting. I’m a cliché inside a self-fulfilling prophecy inside a stereotype.”…“My advice to all of you is to take all the dogs out into the country and turn them loose so they will have at least a few days of freedom in their lives. Then come back to town, put on sackcloth and ashes, and sign up to teach children to read and do math.” Her facility with words reflects her expertise, the economy of language that so often challenges the short story author; certain sentences jumped from the page to me…“He was afraid of nothing and would have no need to be for many years.”…“His face looked like a place where nothing had happened for a long time.”… “It felt like I’d never known what to think before and all of a sudden I knew exactly what to think.”… “I long for conversations with people who don’t want anything from me.”Each of the stories captures the quintessence of Southern life, past and present, without apologies and a great reverence for the women who are the backbone of the South and represent perhaps its strongest face. The final “take away” from this collection might be summed up in the closing sentence in a story set within Hurricane Katrina… “The human race. You have to love it and wish it well and not preach or think you have any reason to think you are better than anyone else. Amen. Good-bye. Peace…”"}, {"userName": "Sam Sattler", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/8300581-sam-sattler", "userReview": "Ellen Gilchrist has long been considered one of our finest short story writers. And “Acts of God,” her latest story collection, is sure to reinforce her reputation and assure fans that Gilchrist is still very much at the top of her game. The characters in all ten of the book’s stories experience “acts of God” that will forever change – or, perhaps, end - their lives. Whether they suffer hurricane, tornado, flood, terrorist attack, or simply a new neighbor whose dogs never seem to stop barking, most of them manage to benefit from the experience. In fact, even those who die, do so on their own terms.Two stories, “Toccata and Fugue in D Minor” and “The Dogs,” are particularly outstanding in the way they display the author’s wit and insight into the culture and gentry of the old South. Gilchrist is herself a product of the Mississippi Delta, and she knows her people well. “Toccata” tells of three middle-aged Vanderbilt sorority sisters traveling together to Italy for a much anticipated reunion. Comfortably settled in one of Heathrow’s first class lounges while waiting for their final flight connection, the women are suddenly caught up in an airport lockdown that threatens to scuttle their plans. The conversations between themselves and their fellow travelers are brilliant in the ease with which Gilchrist manages to fully develop so many characters in a handful of pages.“The Dogs” is told through a series of letters exchanged by a writer and her neighbor whose constantly-barking dogs make it impossible for the writer to work at home. As things between the two escalate, there are letters to and from the writer, her attorney, other neighbors, and the dog owner. The unexpected resolution of the story involves a lesson about shifting alliances that is both funny and ironic. Other favorites of mine include the title story about an elderly couple that escapes their “sitter” for one final day of independence and another titled “Miracle in Adkins, Arkansas” that recounts the day that a tornado positively changes the life of a 16-year-old girl forever. Ellen Gilchrist’s characters, be they witty, irritating, or sentimental ones, are always memorable, and the stories in “Acts of God” offer just such a cast. They, along with Gilchrist’s remarkable sense of time and place, assure that this collection will be appreciated by her fans."}, {"userName": "Claudia Putnam", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/4162791-claudia-putnam", "userReview": "The first thing I need to get off my chest is that the ebook version came in an unalterable and extremely ugly and clunky font. Often you can change a font you don't like, but in this case, which was egregious, no. I hope the \"real\" book doesn't look like that. On to matters of substance: I've loved Ellen Gilchrist in the past, but am having a hard time reacting to this collection. Maybe it's the positive spin on experience? I disapprove of positive experiences. Even suicide is (often) presented in a transcendent light. I happened to have read Emily Smith's essay in the New Criterion recently, in which she argues that while it's fine enough to consider suicide a mental health issue, we ought to bring back moral censure of it. In these cases, the suicides are elderly people with terminal illnesses, who are trying to take charge of their endings. Okay. But an ending is an ending, and I'm not convinced it's better to leap into the rotors of a cruise ship engine instead of dying of MS. I was a little startled to see Robert McCrum, barely disguised as Robert McArthurs, and my school chum Sarah Lyall appearing in these stories (Sarah gets a mention; her ex-husband Robert is a character in the story). I guess he was supposed to represent transcendence and hope and beauty in the story in question. Hm. Most of the people are privileged, first-class travelers, etc. Didion made the argument in the memoir about her daughter (ostensibly; it seemed to be as much about aging) that privileged people can suffer too--that being privileged doesn't protect you from illness or grief, for instance. It sure gives you more options, though. The more choices a person has, the lower the tension in the story. Still, I liked the piece about the woman who served with the National Guard rescuing people from Katrina. The message there was that good things can happen to good people, and for a few moments, for which I am grateful, I was able to believe that. And I thought, maybe I should surrender to all this positivism for just a book's worth. It's contrarian to most literary aesthetics and not a bad place to hang out, for a bit."}, {"userName": "Sara", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/343980-sara", "userReview": "I discovered Gilchrist a bit late--maybe four or so years ago. I remember loving Victory Over Japan, but I don't know that I've read much else of her work. This is her first story collection in 8 years, and I found it a bit uneven. Might have to put a little blame on listening to the audiobook--I tend to struggle with short stories on audio for unknown reasons. There are moments of soaring brilliance, so I don't regret it at all."}, {"userName": "Josh Ang", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/4870273-josh-ang", "userReview": "This collection from Arkansas short story writer Ellen Gilchrist focuses on characters who deal with forces beyond their control; from natural disasters like hurricanes, debilitating illnesses, terrorist attacks, accidents, to simply the passing of time and old age. Despite the potentially sombre subject matter, Gilchrist approaches each of the ten stories with a light touch, doling out in small doses, her wit and backporch wisdom that betray her Southern roots. Longtime readers will be pleased to welcome back the brash and alarming Rhoda Manning, who had seared herself into readers' consciousness in Gilchrist's earlier writing. Rhoda feature in \"The Dogs\", in a fiery exchange of letters with her new neighbours, and with an interesting development by the end of the story. Writer Anna Hand, another familiar character, makes an appearance via her niece, a documentary writer, in of all places, Heathrow airport, during the terrorist attacks in the summer of 2004 in the piece \"Toccata and Fugue in D Minor\". Two stories focus on characters who respond to the call for help. A group of teenagers help out in Adkins in the aftermath of a tornado and are forever changed by a moving event in \"Miracle in Adkins, Arkansas\". Single Mother, new professor and a First Responder with the National Guard, goes on a Mission to New Orleans, suffers betrayal and finds an unexpected turning point in her life that gives her a second wind.In all of these stories, Gilchrist shows how people deal with the unexpected, and while they may not always handle the situations in the most ideal ways, they always look for that little bit of grace and beauty, and some dignity, when they confront their own mortality."}, {"userName": "The Book Maven", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/47212-the-book-maven", "userReview": "For some odd reason, I have a hard time appreciating short stories. Maybe it’s because I like a good, substantial novel I can sink my teeth into and commit to for a few days at a time. Or maybe it’s because it seems like most of the short stories I’ve read seem to reflect the nature of life: fleeting, uncertain, and filled with ambiguous endings. I don’t need to read a short story to experience that, I often think to myself. I can just live my life and get the same feelings. And yet—when I read the various reviews for Ellen Gilchrist’s Acts of God, I found myself lured into giving this collection of stories a chance. Maybe it’s due to Ms. Gilchrist’s Southern origins (I spent almost 20 of my most formative years in the South), or maybe I just wanted to keep giving this literary form another chance. Either way, I found myself extremely surprised with this book, which offers everything from enchanting descriptions of quotidian life in the South to terrorist threats to daring rescues and acts of compassion, to people simply taking moments to revel in the realness of the moment. Even when there is no overt tone of optimism, there are always grains of profound spiritual connection and comfort and a strong core of humanity running through this fantastic addition to the short story genre. Definitely a book that I will end up buying..."}, {"userName": "Sarah-Hope", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/9059923-sarah-hope", "userReview": "Ellen Gilchrist’s short story collection, Acts of God, is a quick, interesting read that will leave you with lots to turn over in your mind. The characters in these stories face, as the title suggests, acts of God: floods, hurricanes, and smaller, but equally unnerving disasters. These characters aren’t heroic in any grand sense. They’re ordinary—sometimes irritatingly so—individuals faced with immense challenges outside their control. As the publisher’s write-up notes, these people “somehow manage to survive, persevere, and even triumph.”In so many permutations, this cast of characters and their ability to overcome could lead to unsatisfactory results: sacchrine or histrionic or just plain unbelievable. Gilchrist’s achievement is that she allows her characters to overcome while keeping them human. Some of their triumphs are small, but they ring true. And together these stories build a sense of hopefulness that feels more like realism than like wishful thinking.This is a good book to pick up when you’re feeling worn down, dissatisfied, and short on energy. It won’t transport you to any magical world—but it will make this world seem a bit less daunting."}, {"userName": "Kandace", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/2838969-kandace", "userReview": "AuthorEllen GilchristPublication DateApril 8, 2014SynopsisFrom Goodreads: Master short story writer Ellen Gilchrist, winner of the National Book Award, returns with her first story collection in over eight years. In Acts of God, she has crafted ten different scenarios in which people dealing with forces beyond their control somehow manage to survive, persevere, and triumph, even if it is only a triumph of the will. High PointsGilchrist was able to deftly convey the emotions one runs through when tragedy falls - the anger, the despair, the hopelessness. Being from Kentucky, I love the southern feel of her writing. Low PointsAt times the writing felt more like fact listing. I think her best writing is in her dialogue. You'll love it if......you like southern writers. ...you are interested in the emotional toll of natural disasters. Overall 3.5 starsE-galley was received from NetGalley in exchange for an honest review. For more review from the Readist, please visit www.thereadist.com."}, {"userName": "Ellen", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/19931168-ellen", "userReview": "The crackling dialog from women with deep insights into the messy worlds they live in, and the cast of characters we all meet at the dry cleaner and grocer every day are back here telling us their deepest secrets. These people have hopes and dreams same as we all do. They squabble and worry think up big ideas too. And Ms Gilchrist understands this daily experience of what it means to be a human better than anyone. She has always been a brilliant and compassionate psychologist hiding inside her writer's coat. Her perceptive insights make me wince and grab hold of myself. The tender way she explores aging left me rereading and piling up her words around me like a fat bunch of pillows. Plus my old friends, the Hands, make another appearance and we get to check in on them and see that thankfully they are right where we left them---loving and bossing and living big juicy lives. It's been eight long years but this was worth waiting for. Acts of God is a beautiful little book. I am ever grateful she wrote it"}, {"userName": "Meghan", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/14613561-meghan", "userReview": "It's hard to characterize these stories without seeming to be disparaging them. The words that kept coming into my mind while reading them were \"simple\" and \"plain\", both of which can be used dismissively, but absolutely not in this case. I suppose what I mean is that these stories are genuine - the people within act without irony or duplicity. There's nothing postmodern here. It's refreshing to read something of this sort when it seems so many writers now use tricks or traps or non-standard story-telling measures. Like drinking a cool glass of water.Some of the stories are slightly entwined - a character mentioned in one story becomes a secondary character in another and is related to a character in a third. It's fun to piece together all the strings while reading. I'd never read nor heard of Ellen Gilchrist before - perhaps because she writes of the southern United States and I'm in Canada, but this collection of stories piqued my interest in going through her back catalogue.I received a free copy of this book in exchange for an honest review."}, {"userName": "Anne", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/808671-anne", "userReview": "I fell in love with Ellen Gilchrist's writing in my 20s and recognized her characters from my mother's southern side of the family. I devoured everything she wrote over the years. Most i loved and some i didn't like, but I am so happy to read this latest one and see that she is just as good as ever. I recognized some of the characters from her earlier writing and love how she has brought the stories in to our current events and her characters get older with me. I'm amazed that some reviewers felt they were depressing stories, as i thought just the opposite. Her characters have her signature way of looking at life with a sense of humor, wonder and pragmatism all at the same time. If you haven't read any of her books, it's fun to start at the beginning so you can get to know her characters as they go through life. In fact, I'll probably start at the beginning again soon. She also has a book of essays called Falling Through Space that i read about a 100 times."}, {"userName": "Jeff", "userReviewDate": "Apr 28, 2014", "userURL": "http://www.goodreads.com/user/show/2830383-jeff", "userReview": "This was a ARC book I got thru LT's Early Reviewer group. It is a collection of 10 (even the back cover says 11, I think I got gypped) stories where the characters go thru some tragedy (a lot of them centered around natural disasters; flood, tornado, hurricane) and come out on the other side better for the experience. The title, I think more refers to the tragedies that occur and less on the \"lesson\" that the characters learn from them.A quick read that I enjoyed. A several of the stories had me on the verge of leaking water from my eyes. A couple stories I didn't really connect with, but the they were in the minority. To be honest, prior to reading it, it wouldn't have caught my eye in the bookstore. But after drawing the lucky straw with ER, I'm glad I read it.S: 4/24/14 - F: 4/27/14 (4 Days)"}, {"userName": "Nancy Simmons", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/22973287-nancy-simmons", "userReview": "For me, so not up to snuff for Ellen Ghilchirst. She is probably my favorite author, and her novels and short story collections have been among my favorites for years. Her novels have resonated with me. Her characters have become old friends, developing over the years. This collection seems to have a common thread of all the great disaster of our recent American history. Katrina, tornados, deaths, destruction. And then she gives us the mundane real reactions of these characters who grieve and pick themselves up to move on.... I love her writing, her so very true sentences/sentiments grip me. But I expected a five star book and I gave this a three."}, {"userName": "Melyssa", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/1147715-melyssa", "userReview": "I won a copy of this book in a giveaway by the publisher. All of the stories in this collection relate to the title Acts of God in some way, built around natural disasters like tornadoes and hurricanes, accidents, and illnesses. They are all set in different parts of the South.The stories aren't repetitive though. Some of them were quite shocking. I enjoyed this collection and am glad I won a copy. I sometimes find short story collections difficult but this one was great. Ellen Gilchrist certainly has a distinctive voice, and makes great use of the South as a setting. I haven't read any of her work before, and now want to read her National Book Award winning collection."}, {"userName": "Terry Perrel", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/1930063-terry-perrel", "userReview": "When I was young, I adored Ellen Gilchrist. The sometime after Victory over Japan, I read a book that no longer enthralled me. I gave her up for a long while. Now, decades later, I just closed Acts of God, her latest short story collection, and I enjoyed most -- three-fifths of the collection. This book is meant for women in or past their prime, which can be less than upbeat, but in these stories Gilchrist is able to see the light through the dark times. Most of the book is worth five stars. There are two entries that seem kind of like tan editor said, \"Oh, you you need a bit more. . .\""}, {"userName": "Betsy", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/592634-betsy", "userReview": "Easy in, easy out, repeatedly with this collection of truly short short stories. Some of them are pretty much just character sketches with dialogue. A few have some descriptive language or a semblance of a story line. One or two I found hard to follow and think an editor could have helped. Almost all are about peoples' experiences during or in the wake of an \"Act of God\" - tornado, hurricane, death, terrorism (that probably doesn't qualify) - in places like Arkansas, where Gilchrist lives, or nearby (Mississippi Delta, New Orleans etc.)"}, {"userName": "Susan Emmet", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/3856714-susan-emmet", "userReview": "Natural disasters (all human-influenced) populate the ten stories, as do often finely drawn characters, most southern, white, privileged and a bit above it all.I've not read Gilchrist before, but I will again.I found the anthology gained force and impact with each succeeding story.Especially liked Toccata and Fugue in D Minor, Jumping Off Bridges Into Clean Water, and Collateral.Spunky, outspoken, \"nail it\" characters keep this collection afloat."}, {"userName": "Celia", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/15596818-celia", "userReview": "I have liked Ellen Gilchrist's work but sometimes find her books slow.As in many short story collections, the stories are uneven. For whatever, reason I like the last group of five stories much better then her first group of stories.As in some of her novels, you have to not mind stories of older people killing themselves before they die of a disease.'I received a copy of this book for Netgalley in exchange for a honest review."}], "description": "The human race. You have to love it and wish it well and not preach or think you have any reason to think you are better than anyone else. Amen. Good-bye. Peace . . .\n Master short story writer Ellen Gilchrist, winner of the National Book Award, returns with her first story collection in over eight years. In Acts of God, she has crafted ten different scenarios in which people dealing with forces beyond their control somehow manage to survive, persevere, and triumph, even if it is only a triumph of the will. For Marie James, a teenager from Fayetteville, Arkansas, the future changes when she joins a group of friends in their effort to find survivors among the debris left when a tornado destroys a neighboring town. For Philipa, a woman blessed with beauty and love and a life without care, the decision she makes to take control of her fate is perhaps the easiest she has ever made. As she writes to Charles, her husband and lifetime partner, “Nothing is of value except to have lived well and to die without pain.” For Eli Naylor, left orphaned by a flood, there comes an understanding that sometimes out of tragedy can come the greatest good, as he finds a life and a future in a most unexpected place. In one way or another, all of these people are fighters and believers, survivors who find the strength to go on when faced with the truth of their mortality, and they are given vivid life in these stories, told with Ellen Gilchrist’s clear-eyed optimism and salty sense of humor. As a critic in the Washington Post wrote in reviewing one of the author’s earlier works, “To say that Ellen Gilchrist can write is to say that Placido Domingo can sing. All you have to do is listen.\"", "title": "Acts of God", "url": "http://www.goodreads.com/book/show/18293425-acts-of-god", "average": 3.45, "cover": "https://images.gr-assets.com/books/1404580456l/18293425.jpg", "reviews": 91, "authors": [{"url": "https://www.goodreads.com/author/show/34005.Ellen_Gilchrist", "name": "Ellen Gilchrist"}], "type": ["Short Stories", "Fiction", "American", "Did Not Finish", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18293425-acts-of-god", "http://www.goodreads.com/book/show/1037457.Victory_Over_Japan", "http://www.goodreads.com/book/show/281114.In_the_Land_of_Dreamy_Dreams", "http://www.goodreads.com/book/show/196032.The_Anna_Papers", "http://www.goodreads.com/book/show/196029.Drunk_with_Love", "http://www.goodreads.com/book/show/105484.Rhoda"]}