{"ratings": 392, "userreviews": [{"userName": "Lynne Perednia", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/388812-lynne-perednia", "userReview": "Jo Donovan, widowed young and taking over a literary agency from her mentor, has made a good life. She's terrific at what she does, and doesn't see many changes on the horizon. One night, she is accosted by a wanna-be author whose manuscript Jo's agency turned down. Soon, there are attacks against her business and even her clients. Suspicions are cast among the people at the agency and the police even wonder if Jo didn't have too much to gain when the attacks turn deadly.In Barbara Rogan's smashing new thriller, Jo will have to look clearly at her colleagues, herself and her past if she's going to see it through. Every aspect of A DANGEROUS FICTION works together and works so wonderfully well. Rogan's experience as a literary agent provides a fascinating look at how the business works. The hopes and dreams of writers are balanced against the realities of publishing. The personal life of the widow of a literary giant such as Jo and her pursuit by a biographer are played against each other well, and serve the story's marvelously realized journey of its protagonist. Anyone interested in a picture of how publishing works will be fascinated by the inner workings. As someone who once read unsolicited manuscripts for a mystery house, I can certainly attest to the quality of so many submissions in the scenes addressing this. Rogan's love of good books also shines through.Jo is an interesting character who came up from nothing the hard way. That she didn't let her austere, loveless upbringing warp her is part of the reason the entire novel works so well. She is strong but not perfect (and the explanation of a \"Mary Sue\" character created by a fictional writer shows just how well Jo is developed). Her colleagues and writers are fascinating to watch. There are easily more heroes than suspects, and to have a strongly written novel in which so many characters are shown to be good-hearted is a pleasure to read. And, while it may not be the most important part of the story to many, setting is strongly evoked throughout the novel. The bustle of Manhattan, the glory of a farmhouse, the entrancing Santa Fe are all portrayed in their best light. It's a treat to read a story in which it's so easy to picture the characters where they are.Just make certain you have time set aside when you start A DANGEROUS FICTION because this fast-paced novel is the kind you don't want to put down until the last page is read."}, {"userName": "Katherine Clark", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/5115292-katherine-clark", "userReview": "What a shame. I feel as though it has been weeks since I read a good book. Oh well. In this book, I found the protagonist annoying--she is incredibly beautiful and incredibly talented, and wealthy and beloved--wow! But she has had a tough life. Oh dear God. Anyway, I guessed the murderer really early, and while I liked the growth of the protagonist (well done) it just wasn't enough. I don't understand why the book was so well-blurbed. REally? Well, I don't need to read any others by Rogan."}, {"userName": "Julie", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/3208300-julie", "userReview": "Literary agent Jo Donovan is in charge of a highly successful agency representing some great talent. Widow of a talented and well-regarded author, Hugo Donovan, Jo has made a name for herself and is much sought after. But when a would-be author begins stalking her, insisting she must read his manuscript and take him on as a client, things start to go wrong. Soon, her clients are attacked, and Jo is reunited with an old flame who is now a police detective in charge of her case.A Dangerous Fiction by Barbara Rogan is a mystery that encompasses the world of publishing. Rogan brings us into the everyday happenings of a literary agency, the roles people play in choosing and promoting books and authors, and the dangers that arise when authors are rejected. The mystery was well-done, keeping me turning pages from beginning to end, and not giving away the truth until it was finally revealed.As much as this is a page-turner, I found it a bit of a slow read ~ for a good reason. The writing style was wonderful. I found I wanted to linger over every word and sentence, rather than reading quickly as I tend to do with mysteries. Here's an example from the preface: \"He smiled as one does at an oft-heard joke. I looked at him properly for the first time. The boyishness was gone, but the lines around his eyes and mouth suited him, lending gravitas to his face. His eyes were green, but a darker, warier shade than I remembered, rain forest instead of meadow. I wondered if he'd ever married. His ring finger was bare, which meant nothing. Hugo and I exchanged rings when we married, but Hugo never wore his. It chafed him when he wrote, he'd said.\"The characters in A Dangerous Fiction are well-drawn, although we definitely get to know Jo more than others. I still felt the other characters with whom she works and interacts were quite realistic. And it was fun to get a glimpse into a literary agency. While there is some violence ~ it's a murder mystery, after all ~ this is more of a cozy mystery than the more harsh thrillers I sometimes read. I highly recommend it to anyone who enjoys mysteries, especially those interested in publishing."}, {"userName": "Kimberly", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/20147847-kimberly", "userReview": "The book kept me guessing until the end when the final twist is revealed. Part of what I enjoyed about the book was the idea of story and how we create our own story often because we are afraid to face what really happened. The protagonist is the young widow of a well-known author. She owns one of the top literary agencies in New York. She believes that she had the perfect marriage. She refuses to listen to anything that conflicts with the story of her marriage that she has convinced herself is true. Ultimately her inability to critically examine her past puts her in the path of a murderer bent on revenge.A want-to-be writer begins stalking Jo Donovan after his manuscript is rejected by her literary agency. Her world begins to rapidly fall apart after various actions threaten her agency and people close to her are murdered. A couple of her clients offer help. One of them, a former FBI profiler turned writer, encourages her to go to the police. The NYPD detective assigned to the case turns out to be her former boyfriend who has a very different perspective of their relationship and how it ended. Everyone is a suspect at some point as the police try to find Jo’s stalker and the murderer (are they one and the same?) before the murderer strikes again.Disclosure: I received this book as part of a Goodreads giveaway on the premise that I would review it."}, {"userName": "Brandi Larsen", "userReviewDate": "Jul 26, 2013", "userURL": "http://www.goodreads.com/user/show/326512-brandi-larsen", "userReview": "I loved this book! It's really an incredible read. The characters are interesting and evocative, and I loved the setting. She kept me guessing until the final reveal. (She also kept me turning pages way past my bedtime.) My favorite part of Rogan's writing was the way she used structure and pov. Both widen as the narrative progresses. It's a brilliant move that made me love the book even more as I continued to read it.Is it too soon to say that I can't wait for the next one?I work for Penguin but that didn't affect this review."}, {"userName": "Stacy", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/19720822-stacy", "userReview": "This was a very fun book! A different setting, and full of twists and turns. I recommend it to anyone who loves mysteries, or is a writer. Like the main character, the story seemed a bit shallow at first, but keep reading, and it reveals a bit more complexity than initially expected. I hope there will be more about Jo Donovan and her literary agency. Full disclosure, I received an advance copy of this book from Goodreads FirstReads."}, {"userName": "Kelly", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/21667496-kelly", "userReview": "Barbara Rogan showed me an entirely different life in this book. The life of a writer and publisher. I found it so interesting that I read very late at night to capture every sense of Jo Donovan who makes the people around her feel like she is in control even though she questions every aspect of her life even to the very end. I enjoyed the book very much."}, {"userName": "Lauren", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/802066-lauren", "userReview": "I loved everything about \"A Dangerous Fiction\": the strong female protagonist, the publishing house setting, the secrets and intrigue - even the cover! Barbara Rogan crafts an excellent, malicious mystery and I'm hoping we see more in this series!"}, {"userName": "Briana Alzola", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/4886160-briana-alzola", "userReview": "Good twist and interesting subject matter."}, {"userName": "Kay", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/4962626-kay", "userReview": "A Dangerous Fiction is a witty and intense mystery novel for anyone who appreciates a good story. I can say that I have never read a book like this one before, it is definitely unique. I liked it way more than I thought I would and I am more than happy to try and convince you to read it. This was an incredibly fun read. The main character, Jo Donovan, is a literary agent and she views everything through that literary lens, making this a delightful read, especially for readers and writers. The reader gets a look inside the publishing industry and how it is for literary agents. Getting that inside look was probably one of my favorite things about this book. Jo is a very strong female, but she also has some flaws, making her more real. I can tell you with absolute certainty that I loved every single character in A Dangerous Fiction. They were all unique and each one added a little something special to the story. I grew attached to all of them. I would give you a run down but there are too many, so instead you should just read the book to find out. Oh and for you animal lovers out there, there is an amazing guard dog in this book that I think you will love.A Dangerous Fiction is incredibly more complex than it may seem at first. It’s full of twists and turns and a few omg moments. This book made me feel so many different emotions while reading, one minute I was laughing and the next I was crying. It will play with your emotions and once you hit a certain part of the story you will want to find this horrible stalker more than the main character herself. I had an inkling of who it may be, but I never guessed. It was really intense near the end of the book. I still get goosebumps thinking about it. I promise the bad guy reveal will be worth the read.I recommend this book to everyone, but especially those of you who are avid readers, writers, or interested in the publishing industry. This was a unique mystery novel with memorable characters. Take a chance on A Dangerous Fiction and be ready for a well written novel that shows us just how much stories play a part in our everyday lives. ** I received a free copy through Shelf Awareness and the publisher for my honest review. Thanks!"}, {"userName": "Christie", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/15175784-christie", "userReview": "So good! But an understated good, if that makes sense. I read quite a few ARC's, so it's always great when I get to read one I enjoy so much. And this one was published in July, so if you like a good mystery novel, go buy this or get it from your library.The tone of the novel harkens back to classic crime novels, i.e.: \"It was a dark and storm night,\" from Paul Clifford. Literary Agent Jo Donovan has lead a tough life, but she's a fighter and has come out on top. She runs on of the best literary agencies, although widowed, had a wonderful relationship with a renowned author, and has some great close friends.But an ambitious writer threatens to ruin it all, when he starts stalking her and attacking those around her. At the same time, and ambitious author working on a biography of her late husband, starts digging around, causing Jo to question if her memory is as accurate as she thinks.And of course there needs to be a little romance, as an old fame who is now a NYPD detective takes her case, and tries to help her track down who her stalker is.As I said above, I really enjoyed it and it was hard to put down (which is my favorite type of book). The plot is neat, and ties up loose ends, which I appreciate. And the characters are complex and true to life.The author's page on GoodReads mentions this is the \"first in a new mystery series set in the high-stakes world of big publishing,\" so I'm excited to hear there may be more. I could see this becoming a really great movie. A triller with heart.*I received a free copy of this book from the publisher, but it in no way effects my review of the book."}, {"userName": "Dina Desveaux", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/4979837-dina-desveaux", "userReview": "4.6 StarsA DANGEROUS FICTION occupies that middle ground between the formula cozy and hard-hitting crime fiction: a clever whodunit with great pacing, a compelling setting and memorable characters. Expect a page-turner.Following the death of her famous author husband, Jo Donovan inherits a literary agency and becomes the target of an escalating personal and professional smear campaign. A rejected ‘writer’ turn stalker is the obvious culprit, or is he?When the attacks begin targeting those closest to her and turn deadly, suspicion is cast among those very people she relies on for support.Enter the publishing world intrigues and jealousies.“Editors might be laid off in droves, production outsourced to India, and lists slashed to the bone, but the publishing lunch will never die.”As a writer, I LOVED the bookish setting with all of its publishing trade intrigue. The book is shock full of gems. In terms of opportunities for improvement:There were a couple of plot contrivances that felt a little thin, the main character’s personality didn’t ring quite true (in light of her childhood), and I would have preferred the ending to wrap up a few pages earlier. However, Rogan’s writing style more than made up for any shortcomings, and in no way, did they detract from a thoroughly enjoyable read.Barbara Rogan knows how to set up a good mystery. She kept me guessing, whodunit? And she kept me guessing until the final reveal.Thanks Barbara for a great wrap up my summer readings (which I generally devote to mysteries).Time to start my fall readings (cue the Giller & other contest nominees)"}, {"userName": "J Reed Rich", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/7775401-j-reed-rich", "userReview": "Jo Donovan is a widow who's inherited a literary agency from her late husband, an infamous philanderer and celebrated author. On the surface, she's flawless: intelligent, a great agent, stoic and strong but tender and emotional. She's built a safe life idealizing her husband's memory, but that life is threatened by blow after blow to her reputation, personal life, employees, and clients. When her best friend is murdered, she begins to seriously doubt her memories and must confront her past. A mystery set in the world of New York literary agents and publishers--with spot-on descriptions of the writer's plight. A few quotes:\"Writers. Every one I’d ever met was bipolar, the poles being arrogance and insecurity.\"What writer hasn't felt that way? Ack.\"One has to make allowances for writers, especially the unpublished ones. Rejection gets to everyone after a while, and those poor bastards swim in a sea of it.\"Why, yes, it does get to us, but we don't really swim in the sea--we tread water at best. In choppy waters.Although I've worked in nonfiction publishing, the world of fiction publishing is very different. If you're in the midst of the submission process, you'll find this an intriguing story. Be forewarned: It echoed my feelings so well that it was depressing. The characters are interesting, the pace steady, and the plot layered. The gradual realization that Jo has been lying to herself is fascinating. It's a bit more than a cozy mystery, but it reads like one."}, {"userName": "Yvann S", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/4856009-yvann-s", "userReview": "\"In the well-ordered world of fiction, murder and mayhem never arrive unheralded. For as long as men have told tales, disaster has been foreshadowed by omens and signs. But if there were portents the day my troubles began, I never saw them.\"Successfully running a publishing firm, Jo Donovan's life seems to be coming together again after the shock of the death of her husband. When a would-be client starts stalking her, she starts to see ominous shadows everywhere. Then someone close to her dies in suspicious circumstances, and Jo herself becomes a suspect. It's been a few months since I read this one so I'm struggling to remember all the details, but it was very enjoyable. For a start, I didn't figure out who the baddie was at all - massive surprise at the end. And the way that Jo's security was taken away, step by step, was quite... not chilling, but obviously devastating for Jo. The cast size is just about right. Rogan develops 5-6 characters enough that they could all be suspects and that Jo has thorough interactions with them, without any of them feeling like they take over the story. There are some cute bit-part characters too. I loved the ex-Marine with the guard dog.It's all set in New York and is very New York, though not as totally New York as a couple of other books I read later in the year (particularly Let The Great World Spin and My Salinger Year).Definitely worth a read - it's a quick thriller, but with a fun literary setting and pretty well done."}, {"userName": "Erin Bell", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/21641467-erin-bell", "userReview": "\"A Dangerous Fiction\" by Barbara Rogan is a well written mystery novel about a young woman who grew up a tough orphan in the Country, having fought hard to leave the past behind, she comes through on the other side a successful literary agent with wealth some celebrities would be jealous of. After the death of her husband she is forced to re-examine the life she has built for herself and the very foundation of it. Having no family of her own, she had grown close to many around her creating an alternate family of the people she loved and trusted the most. This world comes crashing down around her and she’s forced to comb through the facts to re-discover the fairy tale life she thought she'd had. As a mysterious stalker emerges she begins to question not only what is fact and what is fiction in her life, she also begins to question who she can and cannot trust around her. Was this tight knit circle as loyal and protective as they seemed, or was someone trying to cover their tracks?I received this book for free in a contest from Goodreads First Reads. I opened the book on Friday and was finished by Sunday. I pride myself in being able to discover the “truth” fairly quickly in novels and although I could sense that a twist in the ending was coming, it was not at all what I expected. I thoroughly enjoyed this book and looking forward to reading more books by Barbara Rogan in the future."}, {"userName": "Sinead", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/10319665-sinead", "userReview": "I received this book as a winner of a Goodreads First Reads giveaway. Very enjoyable novel with a fast-moving plot and tons of characters to love. I saw this book at my local library and the cover automatically intrigued me. Then when I won the book on Goodreads, it was perfect. Took me about 2 days to read. At some points, I couldn't even put the book down. My favorite part of the book was the behind the scenes info on how publishing companies and literary agencies work. I found this part absolutely fascinating. This also made the book so unique. It was a whole new world opened up to me. I loved Jo's friend, Max. Such a good friend to Jo and a realistic character. I love all of the characters in the office as well. I think what made the book so good was how many important secondary characters there were. It provided the reader with dimension and depth. Now, I must admit, about halfway through I correctly predicted who the \"bad guy\" was. I was pretty proud of myself with that, but the reason behind it, I did not see coming at all. Kept me guessing the whole time. Hope this gets made into a series of some sort because I would love to read more about Jo, Tommy, Max, and Mingus!!! I highly recommend this book. I even recommended it to some friends already. Update: Just read that this is going to be a series. Beyond excited!"}, {"userName": "Michael", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/2065514-michael", "userReview": "It's a joy to find a book that entertains from start to finish and this book is all of that.Jo Donovan owns a literary agency. One day she's stopped on the street by a man claiming to be Sam Spade. He tells her he has the best book she's read in ages and she will be overwhelmed by its excellence.He's so pushy that one of Jo's employees has to help her escape from the man's clutches.Soon after she attends a literary event and her laptop is separated from her luggage. It's found but shortly thereafter a number of Jo's clients begin getting emails that their work has been accepted or some other false statement. This is humiliating and Jo has to send a disclaimer to her clients.Other events follow and it is sure Jo is being stalked. Then there is a murder and the suspense mounts.The author has an excellent feel for the literary scene in New York and the side events such as the literary function. As a writer who has one published book and is trying to publish again, I empathise with the central character and her clients.The plot is refreshing and the characters are just what the reader would imaging. 4.5. stars moving to 5 stars for the entertainment, the well done conclusion and realistic presentation of the story."}, {"userName": "April ", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/4034908-april", "userReview": "This was a very good book! I could scarcely put it down. Rogan's deft touch with characterization, particularly the heroine's character was just so spot on! The plot description reads like a formula potboiler, but this book was so much more than that. Jo Donovan, still mourning her Nobel prize winning writer of a husband after 3 years, runs a small but high class literary agency. She is at first annoyed, then disturbed, and eventually frightened by a stalker, who seems intent on ruining her life. As mean pranks escalate into murder, she must re-evaluate her married life with Hugh, her writer husband and delve into her own past and what he meant to her. I love the way Rogan plays with Jo's fatal flaw--she is very Holly GoLightly--and with her own reliability as a narrator. And I also loved the ending, which I won't describe in more detail to avoid spoilers. I would definitely like to read more Rogan and think she is one of those authors who loves writing and writers, as well as reading and readers."}, {"userName": "Laura", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/1262476-laura", "userReview": "Fun little number with what I'd guess are rookie mistakes (although the woman MUST have an editor and I'd say he/she kind of fell down on the job). LOTS of repetition of Jo's various character flaws which might strengths which might flaws, etc. We get it. She's one tough cooking except when she's not. We also get it by about page 50 that she loved her husband dearly and saw by about page 51 that their marriage wasn't going to be quite the marriage she'd thought it was. Also, some instances where Jo claims to not understand the thinking of another character but then she ends up pondering the same questions.I hope that Rogan sticks with Jo and writes more with her. I LOVED the book world setting and all the publishing trade intrigue. And generally I'd say a REALLY strong debut. Just don't rush the next one and clean up all the stuff that Jo, as an editor par excellence herself, would NEVER permit to go to press."}, {"userName": "Linda", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/2087687-linda", "userReview": "I happened upon A Dangerous Fiction while browsing the shelves at the library some time back. Because its synopsis intrigued me, I renewed it a few times before actually picking it up to read. I wish now I had picked it up much sooner….then I could already be reading other books by this author. A Dangerous Fiction was both thought provoking and pure entertainment. The book is so aptly titled, referring to much more than the jealousies and competitive nature of the literary arena. (How fun it was to have a peek into that arena!) Are there times in our lives when the things we know are simply what we choose to know? Rogan peels back the layers of Jo’s memory while yet writing a solidly entertaining mystery. Her pace is quick, yet with the necessary details and her characters believable. All in all, a thoroughly enjoyable read."}, {"userName": "Paula", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/18979687-paula", "userReview": "I received this book from the Goodreads First reads giveaway program. Thank you author/publisher for allowing me the opportunity to read and review your newest book.A Dangerous Fiction by Barbara Rogan is a mystery set in New York City. Jo Donovan is a literary agent/owner of a successful literary agency. A hopeful newbie writer sends in his manuscript and doesn't get the response he hopes for. Suddenly, bad things start happening to her clients in an attempt to ruin their lives and Jo's reputation...I felt this book was a good-read and it did keep me guessing on who was responsible ... and it wasn't who I was expecting!Barbara Rogan is the author of eight novels. A Dangerous Fiction is the first in a series of books."}, {"userName": "Darlene", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/210608-darlene", "userReview": "It's cliched to say \"I couldn't put it down!\", but that's how I felt about A Dangerous Fiction. Rogan brings an insider's keen view, pulling the reader into the New York publishing milieu with all of its jealousies, intrigue, excitement and larger-than-life personalities. At the heart of the story is a woman's need to uncover the truths about her own life, even as she's the target of malevolent foes she can't identify. Danger, suspense, romance and the deep bonds of friendship--A Dangerous Fiction has it all.(Disclaimer--I received an advance review copy of this novel from the publisher)"}, {"userName": "PopcornReads", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/5725748-popcornreads", "userReview": "Book Review & Giveaway: How could any bookaholic resist a murder mystery involving a literary agent and authors? I know I couldn’t so, when the publisher approached me about reviewing A Dangerous Fiction by veteran publishing insider Barbara Rogan, I jumped up and down with glee. Whether or not you’ve ever wondered how the mysterious world of literary agents works, this is one mystery you’ll want to know more about. And the publisher has graciously provided a finished copy for our giveaway at http://popcornreads.com/?p=6365."}, {"userName": "Michelle", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/13357029-michelle", "userReview": "Full disclosure, I received an advance copy of this book from Goodreads FirstRead.I loved this book, it was a very fun and interesting mystery. If you like mysteries then pick this one up and you will not be able to put down.Started off a bit slow but by the 4th chapter Jo Donovan and the rest of the characters had me wanting more. Wait till the end you won't believe who it is... \"Do you hear me now!\" Yes, I do and I never would of guessed it. Perfect mystery novel."}, {"userName": "Joy", "userReviewDate": "Sep 10, 2013", "userURL": "http://www.goodreads.com/user/show/3668179-joy", "userReview": "I absolutely and unreservedly loved this book. It was not only a clever who dunnit but also had depth of characters and probed deeper questions about the lies we tell ourselves. I enjoyed the supporting cast almost as much as the main character. There were a couple of plot contrivances that were a little thin, but the writing style and literary allusions more than made up for them. Best book I've read in ages. I'll be seeking out more by this author."}, {"userName": "Pat", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/7824569-pat", "userReview": "Excellent.Main character ( Jo) is the owner of a literary agency. The agency's records are hacked and false emails are sent to clients in an attempt to destroy the business. Then, the former owner, Molly and a client, Rowena are murdered. The murderer turns out to be the secretary. When she was a child, both her and her mother were evicted from her apartment when the guy married Jo. This was her revenge.Good characters, good plot."}, {"userName": "Wheezy Hardin", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/20028531-wheezy-hardin", "userReview": "Loved it! Who would have thought that the literary business could be so dangerous, but it seems that writer, agent, editor mysteries are popping up. The usual thoughts of papercuts fly out of your head with this one and it pulls you into a well written intrigue book that delights and entertains. Thanks for the read I enjoyed it!"}, {"userName": "Bebe (Sarah) Brechner", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/10381238-bebe-sarah-brechner", "userReview": "Anyone who loves to read about the book publishing world will adore this fascinating, triple-bending story. Full of clever dialogue and with a great look at publishing foibles, this is a winner! Great writing at a very compelling pace. I thoroughly enjoyed it and hope that author Barbara Rogan will continue to publish more!"}, {"userName": "Kelly", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/7467167-kelly", "userReview": "A great mystery. Barbara had me guessing at each chapter and reading late into the night. I like Jo Donovan and \"seeing\" into the world of big publishing, literary agents, and their authors. A great read if you like mystery, suspense, or if you are a writer yourself. It's fun to see the other side of the publishing coin. :)"}, {"userName": "Bobby", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/13564460-bobby", "userReview": "This was a very good mystery which I kept waiting to turn bad, but the author's style is excellent. I'm hoping this becomes a series; I'd like to see Jo & Tommy continue to solve crimes, plus some of the other characters staying on, especially Max."}], "description": "A romp of a publishing mystery that introduces Jo Donovan, literary agent-cum-detective, that will delight fans of Janet Evanovich, Lisa Lutz, Alan Bradley, and ABC's \nCastle\n Jo Donovan always manages to come out on top. From the backwoods of Appalachia, she forged a hard path to life among the literati in New York City. At thirty-five, she’s the widow of the renowned author Hugo Donovan and the owner of one of the best literary agencies in town. Jo is living the life she dreamed of but it’s all about to fall apart. When a would-be client turns stalker, Jo is more angry than shaken until her clients come under attack. Meanwhile, a biography of Hugo Donovan is in the works and the author’s digging threatens to destroy the foundations of Jo’s carefully constructed life. As the web of suspicion grows wider and her stalker ups the ante, she’s persuaded by her client and friend—FBI profiler-turned-bestselling-thriller writer—to go to the police. There Jo finds herself face-to-face with an old flame: the handsome Tommy Cullen, now NYPD detective.A Dangerous Fiction marks the welcome return of Barbara Rogan and the start of a terrific new series.", "title": "A Dangerous Fiction: A Mystery", "url": "http://www.goodreads.com/book/show/16158594-a-dangerous-fiction", "average": 3.77, "cover": "https://images.gr-assets.com/books/1355575515l/16158594.jpg", "reviews": 110, "authors": [{"url": "https://www.goodreads.com/author/show/557716.Barbara_Rogan", "name": "Barbara Rogan"}], "type": ["Mystery", "Fiction", "Thriller", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/16158594-a-dangerous-fiction", "http://www.goodreads.com/book/show/1135321.Suspicion", "http://www.goodreads.com/book/show/1135320.Hindsight", "http://www.goodreads.com/book/show/1135328.Rowing_in_Eden", "http://www.goodreads.com/book/show/1135323.A_Heartbeat_Away", "http://www.goodreads.com/book/show/1700586.Cafe_Nevo", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}