{"ratings": 924, "userreviews": [{"userName": "Judith Starkston", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/4596767-judith-starkston", "userReview": "A Day of Fire is a collection of six interconnected stories set in Pompeii on the day Vesuvius blew up. The stories immerse us into a variety of strata of Roman life in this iconic city. They build a rich palette of characters despite being in the format of short stories, and we genuinely care what happens to each of them: senators and other officials, whores, a pregnant lady of privilege, an insecure but appealing young man, and more than one determinedly independent woman. Despite the setting, it’s not all gloom and doom—well, the gloom covers the sky for much of the book on a literal level, but there’s light in a metaphorical sense. Some characters survive and some don’t, and hence suspense builds with each story as we watch their choices and weigh the possibility of life for these three-dimensional souls we’ve gotten to know. I found myself trying to will certain characters into a speedy departure from Pompeii, but these are complex people, held or drawn back by love, duty and spirituality, as well as the expected fear. Some of the victims face their fates in a way that gives the collection a sense of hope and a positive outlook. Sometimes it’s raw courage found deep in the inner reserves when no one would have suspected its presence. Some characters responded to the challenges around them with transformative growth, even in the short time allotted. When that development happens with a character who lives on, the destruction gains a mitigating purpose for the reader. When such growth occurs just before death, the character is imbued with a dignity and sense of self worth in those final moments that lifts the reader out of a grim view to a powerful one. We, after all, are looking in from a world that continues unburied by ash and fire, and we want to believe that humans are hard-wired for positive metamorphosis. The stories explore the ethics of what we owe other human beings even at the risk of our lives. This is a universal idea that here is also played out against the decidedly Roman ideals of civic duty and family obligation. A Day of Fire also plumbs notions of ancient spirituality and what they offer as a promise of hope or optimism even in the grimmest of environments. These stories place us back in Roman times not only through their vivid and painstakingly accurate depiction of Pompeii’s physical setting and daily life but also through the philosophical and ideological underpinnings of that world. A good writer makes lots of bad things happen to his or her characters. By that measure this is one knock-out book—but all those bad things do not add up to a depressing read. That’s skillful writing where meaning and excitement are interwoven. This is a talented group of writers, so I’m not surprised, but even with my premonitions of a good read, I was still delighted with how much fun this book was. You’re not supposed to enjoy disaster this much. A Day of Fire is a perfect read if you’d like to visit Pompeii on its last day but don’t want to get burned."}, {"userName": "Sarah", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/305349-sarah", "userReview": "Confession: I’ve read A Day of Fire twice. The first time, I breezed through the pages, gripped by each individual storyline, their multidimensional characters, and the collective whole. For the second round, I paid more attention to the structure, thinking about what a detailed process it must have been to put together. Because it really has been very carefully assembled, and the result is impressive.Six well-known historical authors – Stephanie Dray, Ben Kane, E. Knight, Sophie Perinot, Kate Quinn, and Vicky Alvear Shecter – got together to collaborate on a high-concept novel set in Pompeii. Separately and together, they evoke the lives of a large cast of characters during the lead-up to the eruption of Mount Vesuvius that destroyed the port city in 79 AD.Within their six interlocking stories, the people come from different walks of life and across the social spectrum: an earnest young man, a Roman senator, a young woman of wealth, a former soldier, an expectant mother, her proud father, and two slaves working in a tavern at the Vesuvian side of town. The way the authors construct their tales, the protagonist of one will appear in many of the others. It allows for a distinctive form of character shaping and progression throughout the entire book. This isn't limited to the main characters; even Cuspius Pansa, the handsome, much-despised aedile (magistrate) of Pompeii, has a satisfying story arc.Regardless of each person’s status, the personal danger bearing down upon them forces them all to re-evaluate their lives as they fight to escape. Real-life historical suspense doesn’t get more dramatic. Not everyone survives, but because impending peril often elicits courage from deep within, the overall tone isn’t gloomy; rather, the novel works as a celebration of life.Within most short story anthologies – generally not my preferred format – there are some strong entries and some less memorable ones. There are no weak links in this bunch, though. A few notes on each:Vicky Alvear Shecter’s “The Son” was the perfect choice to open the novel, with its youthful tone and portrayal of a young man’s emergence into maturity (complicated and messy, as it always is). My figuring out his historical identity partway through was an added bonus.“The Heiress” by Sophie Perinot, which sees a privileged young woman torn between a gorgeous bad-boy type and the sensible older man her father wants her to marry, stands out for the thoughtfully realistic transformation of its heroine.I enjoyed the scene-setting details, camaraderie, and build-up of suspense in Ben Kane’s “The Soldier,” which looks at a military man from a less frequently seen angle: the trying years of near-poverty after his career in the legions has ended.Kate Quinn’s “The Senator” brought back, to my delight, two characters I’d last met in her standalone novels. Their witty banter kept the action moving along, and it was great to see a take-charge woman getting the job done.When the heroine of E. Knight’s “The Mother” first appeared, in Vicky Alvear Shecter's \"The Son,\" I had a sinking feeling of where her story would lead. The difference in style between it and the previous segment made the telling feel a bit formal at first, but that soon faded away once the characters' situation became clear. Reading this was a wrenching experience, but it held some surprises, too, in seeing how the members of one family interacted and changed during these all-too-brief moments.Stephanie Dray’s “The Whore” successfully brings the collection full circle, to a hot-tempered prostitute introduced in the very beginning – and to her spiritually-minded sister, who plays a minor but significant role in several other stories. The grand finale is intense and shattering, and I mentally applauded at the epilogue. Masterfully done.Throughout the book, readers also see the ongoing development of the most overarching character of all, Mount Vesuvius: the initial earth tremors, the rising cloud of ash and tainted air, the flying missiles of molten rock, the deadly hot flow of lava. Both the big picture and the little details matter here.Each entry complements and enhances the others and gives you a chance to sample the work of authors you may not have tried before. Although it’s based on the latest archaeological research, no prior knowledge is needed; you’ll experience the last moments of a once-vibrant city just as its people might have done. If you seek out fiction set in the ancient world, it’s not to be missed."}, {"userName": "Erin ", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/2997696-erin", "userReview": "Find this and other reviews at: http://flashlightcommentary.blogspot....I have a hard time with anthologies and collaborations, but Grand Central proved such a wonderful experience that I swore I'd keep an open mind if another struck my fancy. Four months later A Day of Fire caught my eye and here I sit, once again amazed at the result.Taking their cues from the graffiti littered walls of its ruins, these six authors set out to tell the story of a city's final moments, to chronicle the tragedy of Vesuvius' first century eruption through the experience of her citizens as a torrent of rock, pumice and fire rained hell from above.Their characters come from all walks of life and offer extensive insight to the intricacies of life in the Roman Empire, but it is the drama they imagined and the intrigue they coaxed from the ashes that make A Day of Fire impossible to put down. From the Herculaneum Gate to the Garden of the Fugitives, their combined efforts culminate in a highly compelling portrait of Pompeii and her people.═════════ ❧ ═════════The Son by Vicky Alvear Shecter═════════ ❧ ═════════I liked Vicky Alvear Shecter's Curses and Smoke, but I loved The Son. I'll grant comparing a young adult piece to general fiction is an apples to oranges association, but the tone of the contribution, the mature nature of its themes and the dynamic Shecter created between Gaius Caecilius and Gaius Plinius Secundus really appealed to me.Those familiar with the history know how significant Gaius Caecilius is to Pompeii which is why I got such a kick out of Shecter's portrayal. Far from the respected historian, here is seventeen year old boy, plagued with insecurities and grappling with his first taste of romance. The resulting contrast is both authentic and amusing and represents a creativity I can't help but admire.═════════ ❧ ═════════The Heiress by Sophie Perinot═════════ ❧ ═════════It's been a few years since I tackled Sophie Perinot's The Sister Queens, but The Heiress reminded me why I hold its author in such high esteem. Taking inspiration from the frescos that grace the Villa dei Misteri, Perinot delves into the wedding traditions of ancient Rome and presents a surprisingly nontraditional love story that cuts straight to the heart. I wasn't sure about Aemilia Lepida, but the passion she harbors for Faustus quickly showed her as more than the poor little rich girl she initially appears to be and I adored the parallel Perinot created in Aemilia's experience and the famous imagery that graces her walls. That said, it was Gnaeus Helvius Sabinus that made the greatest impression on me. A historic figure of no particular importance, the highly educated would-be aedile proved my favorite of all the characters that appear in A Day of Fire. ═════════ ❧ ═════════The Soldier by Ben Ken═════════ ❧ ═════════I selfishly hoped Ben Kane would tackle the gladiators and the Amphitheatre of Pompeii when I realized he'd contributed to this project and I'm happy to report I wasn't disappointed. I mean no offense to the other authors, but after reading Spartacus: Rebellion, I felt Kane and his particular expertise best suited for the material. The action in the arena was brilliantly done, but I loved how Kane balanced the physicality of those sequences against the everyday politics of life in Pompeii. Career soldier Lucius Satrius Rufus has enemies both on and off the field and I thought the illustration of his personal relationships and how those affiliations dictated his decisions during the eruption quite fascinating. ═════════ ❧ ═════════The Senator by Kate Quinn═════════ ❧ ═════════I've read enough of her work to know that sitting down with anything by Kate Quinn will leave a smile on my face. Mistress of Rome, Daughters of Rome and Empress of the Seven Hills have graced my top shelf for some time so I was understandably excited about The Senator, but I readily admit Quinn's eye for historic detail and keen sense of comedic timing surpassed even my expectations.Diana of the Cornelii and Senator Marcus Norbanus are a phenomenal pairing and while I have a sneaky suspicion their contrary personalities would prove entertaining just about anywhere, I took particular amusement at watching them butt heads in the Lupanar of Pompeii. I harbored a fondness for these characters prior to reading A Day of Fire and adored the insight this small chapter afforded, but more than that, I appreciated how seamlessly their story fit with the other contributions. All the entries are linked, but I felt Quinn's effort the most coordinated and comprehensive of the collection. ═════════ ❧ ═════════The Mother by E. Knight═════════ ❧ ═════════Historically, the home of Julius Polybius is one of the most impressive and enlightening buildings buried in the volcanic ash of Vesuvius, but the pregnant woman who died there is equally intriguing. A cameo character in several of the earlier contributions, Julilla finally enjoys the spotlight in E. Knight's The Mother. Maybe it's because Anne Seymour was such a firecracker in My Lady Viper, but I associate Knight with the creation of vibrant and passionate heroines which is why I was confused by the happily married and contented Julilla. Eagerly awaiting the birth of her child, the soon-to-be mother radiates maternal joy, but didn't fit the mold I'd envisioned. At least, not initially. As the situation worsens, Julilla's soul-searching reveals an uncommonly complex woman torn by loyalty, honor, expectation, duty, and a desire to be at the forefront of the decisions that determine her fate. ═════════ ❧ ═════════The Whore by Stephanie Dray═════════ ❧ ═════════None of those who contributed to A Day of Fire were unfamiliar to me. I've fond memories of reading many of their solo efforts, including Madame Tussaud by Michelle Moran who supplied the introduction to the six part novel. That said, author Stephanie Dray was something of an anomaly within the group. I've followed her on social media for years, but I've not read her work and so approached The Whore with fresh and entirely unbiased objectivity. Considering her background it should come as no surprise that Dray's story incorporated the Temple of Isis and a spiritual connection to the Egyptian goddess, but it was the personal reflections of Capella and Prima that captured my imagination. The sisters are as different as night and day, but their trials comprise some of the most powerful moments and intimate revelations of the entire book."}, {"userName": "twelvejan [Alexandria]", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/16210144-twelvejan-alexandria", "userReview": "5 explosive stars!Review to come.Like a petulant child...Something of Kate Quinn's to nibble on while I wait to devour Lady of the Eternal City. And a great opportunity to check out the other authors!"}, {"userName": "Deborah Pickstone", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/37849334-deborah-pickstone", "userReview": "Absolutely fabulous, brilliant collaboration and excellent editing by one of them! Now I want to write my own Pompeii story - there is no greater compliment to anything than that it makes me want to create something too!Vale!I re-read this 18 months later and it's just as good. My imagination was inspired by this book and I have read and looked at almost everything about Pompeii that is on the net; to me, it proves that people have never changed - what was going on the is going on now. All that has changed is the level of technology and people's culture. To me, this creates the most fascinating history of all!"}, {"userName": "Stephanie Thornton", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/4078547-stephanie-thornton", "userReview": "What could be better than six fabulous novelists collaborating on the destruction of Pompeii?Answer: Not a whole lot. I've been enthralled with Pompeii since my freshmen geography class, where for the instructor required that we watch a documentary on Mount Vesuvius, and have been fortunate enough to visit the modern day archaeological site. A Day of Fire brought me back to the mean streets of the Roman resort town and, even better, fleshed it out with prostitutes from the lupinar hawking their specialties, gladiators training for their next bout, and frescoed villas populated by the wealthy elite. One might think that a novel about the doomed city would be nothing but tears and terror, and while there are plenty of both, there's also moments of quiet beauty and even humor. Fans of Kate Quinn's Daughters of Rome will love to see sparks fly between Senator Marcus Norbanus and fiery Diana, and Stephanie Dray's prostitute sisters Prima and Capella made me want to cheer and cry between alternating pages. This is a riveting read for anyone who has seen the plaster casts of the bodies found in Pompeii and wondered at the stories of those left behind as the volcano rained down death and destruction on their heads. Highly recommended!"}, {"userName": "Audra (Unabridged Chick)", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/3083001-audra-unabridged-chick", "userReview": "I love the idea of collaborative novels but find that unless it's a duo, anything more is usually a bit of a disaster (\nNaked Came the Manatee\n or \nHotel Angeline\n). But I wasn't going to pass up this hist fic, which features six standout historical novelists all writing about Pompeii's deadly explosion -- and to my delight and great relief, this was a knockout.Set on, or a few days before, the day of the destructive Mount Vesuvius eruption -- the novel follows seven interconnected characters. Each author tackles one character and one small portion of the overall story arc, although the same characters are threaded through the entire narrative.  The disaster is pieced out in a series of snapshots but there isn't a disconnected, vignette-y feel.  Instead, the shifting lens provides a extra layer of tension as I raced through the story to see if my favorite characters were going to appear again, and if I would learn more about their fate.The entire novel reads like one cohesive piece in part because the authors intentionally worked that way, constantly consulting with each other about characters and plot points.  (I learned this and other fun details in my interview with them; it'll be posted tomorrow.)  That extra effort is felt quite clearly in the distinct narrative arc that holds the volume together, and the seemingly disparate threads are tied up as neatly as can be in a disaster.  (And kudos to the authors for resisting wholly pat endings!) We don't learn how everyone ultimately ends up, and it leaves a deliciously bittersweet feeling at the end.I loved every story in this volume but I'll admit to sobbing like a crazy thing while reading E. Knight's 'The Mother'. Being a pregnant lady six days from her due date is likely why it affected me so greatly, but the stories have a wonderful balance of action, emotion, and at moments, grim humor.  As the book continues, the characters are deeper and deeper in the throes of the eruption, and the stories race even while focusing on some serious emotional development -- plot isn't thrown over for character, nor vice versa.There's eight pages of Historical Notes to go with this, for the volume and each story, which provides the kind of geeky historical detail and narrative nuts and bolts I love.Highly recommended for historical fiction fans, especially those who love disaster flicks, ancient settings, and/or armchair escapes that leave you gasping for air.  Those who are fans of the authors in this volume will not be disappointed and those who are new to these authors will be excited to have more of their works to dig into.  A wonderfully creative endeavor.  I'd love to see this group do something like this again!"}, {"userName": "Tara Chevrestt", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/2544368-tara-chevrestt", "userReview": "The first story...I was afraid I would have to take Ms. Moran's advice in the foreword and skip to the next. The premise given on the back cover is a simple sentence. \"A boy loses his innocence in Pompeii's flourishing streets.\" And considering the story opens with a boy excited about visiting a tavern wench for some skin action, you can see why I was reluctant. Unless you're into erotica.Boy, was I pleasantly surprised and glad I didn't skip it. The author is a genius for making us think one thing and yet presenting us with another. Just who has the dirty minds, eh? Regardless, this story was very enjoyable, as see that what separates the men from the boys has nothing to do with tavern wenches or pleasures of the flesh. It's honor and integrity.The second story follows a young girl dreading her upcoming marriage to a \"boring\", old man. There's a similar moral here about what makes a man a true man, a man worth desiring. It has nothing to do with looks or sweet words, but will he protect and respect you?The third was just too much testosterone for me. But the fourth...the fourth was probably my favorite. It follows a depressed senator who sees this as his chance to die, but a fiery horsewoman comes to his rescue in more ways than one. I loved both characters and the story made me chuckle a few times despite the seriousness of their situation. This was absolutely superb writing from Kate Quinn. And the way the woman and the man team up to save each other...especially the determination of the woman just wowed me. I also loved how she wanted so badly to save someone. The moral in this...there's always something to live for.The last two stories, I'm hard pressed to come up with a moral. Naturally, there were not really many survivors of Pompeii. An earthquake was followed by the raining of ash and the eruption of a volcano. (That's the extent of my knowledge.) Some got away, but many of them were buried alive or caught in the black river. Needless to say, there were some unhappy endings. The story about the pregnant woman was bittersweet and sad. Extremely well written. I was torn about this one. It is tragic, romantic, and something else I can't find the word for. I thought it crazy that the woman finally gets a say in her life and it's such a hard choice to make.http://wwwbookbabe.blogspot.com/2014/..."}, {"userName": "Samantha", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/4465950-samantha", "userReview": "This was a fantastic compilation novel! With each chapter you get deeper into the story and it gets so intense that you can feel the earth quaking and yourself gasping for breath with the characters. I loved the intertwining of the characters and how my feelings for some of then changed as they evolved because of their circumstances. The book had something for everyone; passion, violence, love, sex, shame, and power. The authors layered their tales flawlessly and I am now finding myself eager to read up on the history of Pompeii. I hope that these fantastic writers will team up again in the future."}, {"userName": "Kara", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/1288287-kara", "userReview": "Warning: the book is very blunt about the ancient Roman Empire’s thriving industries of sexual slavery and entertainment murder. That said -This. Was. Awesome.I laughed a lot and cried twice and was utterly enthralled the whole time.This isn’t an anthology – it’s a collaboration between several authors, sharing characters and each writing separate stories about the same cast, stories that both stand on their own and come together to chronologically follow them throughout the disaster, gelling into a complete novel. It was so good I’m going to look up all these authors now to read more of them.If you know your Pompeii history, you know which of some of the characters that are definitely going to die, but there is a lot of suspense over the rest of the cast.Loved the mix of science, history and genuine gamut of human emotion.Side point – the book gets into the cult of Isis and wow did the early Christians very obviously just hit copy and paste to create most of the cult of the Virgin Mary! Loved this book and highly recommend to anyone who loves really well done historical fiction."}, {"userName": "Erica", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/18690067-erica", "userReview": "A beautifully written novel by five authors I've never read and one I have. It was no surprise that Ben Kane was part of this brilliant story about the people of Pompeii. The novel is written in six parts, each part by a different author. My favorite story was \"The Mother\" by E. Knight about a pregnant woman and her family that choose to stay in Pompeii. I loved them all and didn't want it to end. I look forward to reading more from all of these talented authors. Thank you for such a great read."}, {"userName": "Derek Birks", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/12946464-derek-birks", "userReview": "I must admit that when I received an early copy of this book I was a little apprehensive about it. It's a brave endeavour because you have six writers putting themselves out there. Six writers and one story - that sounded fraught with difficulties. I had heard of all six writers but had only read Ben Kane’s work before. Well, I can tell you that I shall be exploring the work of the other writers very soon, for this book is an excellent read.The story plays upon our ongoing fascination with the people of Pompeii and their individual fates when ‘you know what’ happened. There have been quite a lot of stories about the eruption but this one manages to come across as fresh and original - no mean feat. It is the idea of six intertwined and overlapping tales that makes this different.The advantage of six authors is demonstrated by the breadth of themes explored in the novel. The human condition with all its frailties exposed is given a thorough going over in this work. Yet the individual stories with all their scope for gloom nevertheless manage also to demonstrate the best of human qualities alongside the worst.But the real triumph of this work is that all of this is accomplished whilst the story builds in tension and excitement. I kept thinking as I finished each story: how is the next writer going to top this? But they did!I must make at least a brief reference to each story though I shall not do them enough credit in so few words.Story 1 - The SonThe first story has a tough job. It has to hook the reader but it must not give an overload of information - too many characters too soon and we will be lost. It starts simply but it takes us into the heart of the story in a tale of innocence, love and the journey from adolescence into manhood.Story 2 - The HeiressThis story shifts the focus to a different, though connected, group of characters as it examines the roles of Roman women, their independence - or lack of it - and marriage. All of this is set against the backdrop of growing concern in Pompeii, as the early signs of volcanic activity begin to dominate events.Story 3- The SoldierHere the lot of the slave is examined a little more and our understanding of the power politics in the town is enhanced. The tension and excitement builds further both in terms of the earth tremors and rock showers, but also in the development of the plot. This story is an excellent example of how each one gives us its own protagonists but also links brilliantly to the others.Story 4 - The SenatorEach story increases the tension and more pieces of the whole jigsaw fall into place. But we are still left guessing about the fate of many of the characters to whom we have been introduced. I think this story just might have been my favourite… until I read the next two and then it was too close to call!Story 5 - The MotherHeartbreakingly relentless - you just do not know how this one’s going to end!Story 6 - The WhoreI was captivated by the final story which gives us different insights into several characters we think we already know very well. Just when you think it will end one way, it veers away to take you by surprise.Overall, I can’t praise this book highly enough. It's a rattling good tale of disaster, death, resolution and rebirth. It has a diverse range of characters that are well-drawn and woven convincingly into the story. Terrific tension builds through the six stories and there is something here for everyone."}, {"userName": "Sarah u", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/7810988-sarah-u", "userReview": "I have been interested in A Day of Fire ever since I read that it was being written. I enjoyed Sophie Perinot's novel The Sister Queens, and Stephanie Dray's novella The Princess of Egypt Must Die, which increased my initial interest. I did have reservations, though. I wondered if the book was going to tell the same story repeatedly from different perspectives, if Vesuvius was going to erupt over and over, or if character crossovers within the narrative would be jarring.Fortunately, none of my reservations came to pass. Each chapter is written by a different author (there are six, plus an epilogue (which I think was written by Dray)) and clearly a lot of work and communication between the authors has gone into the making of this novel because no character loses his voice, nothing jars, no-one inexplicably appears in one place when he should be in another, and so on. It also works well as a novel because each chapter moves us through the day Vesuvius erupted, with the first chapters ending with the disaster starting and the final chapter closing near the end of the disaster. Character crossovers throughout work well, and through these crossovers the reader learns the fates of all of the main characters of the story.On the whole A Day of Fire is a great read. Naturally some chapters are stronger than others, but the book is so well constructed that they work together to make a good whole. The story made me smile, yet at the same time brought a tear to my eye. I definitely recommend this book, and will be seeking out novels by several of the authors who wrote chapters for it. 4.5 stars."}, {"userName": "Sonja Arlow", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/6449756-sonja-arlow", "userReview": "This was my first experience with collaborative fiction and was blown away. The book consists of 6 stories by 6 different authors and they complemented each other beautifully. Each story is perfectly crafted and the collection never felt like short stories, each flowing seamlessly into the other.Everyone knows about Pompeii but I have never actually read any historical fiction about this and loved every minute. The imagery is rich and vivid similar to what I experienced with Memoirs of Cleopatra. But besides the great characters in each story I also learned a lot about the Pompeian traditions and culture.We have the son, the heiress, the solder, the senator, the mother and the whore. Some of them get out and some do not.And then there was the added bonus of not only reading great historical fiction but to discover new authors along the way. The only author I was familiar with is Kate Quinn (who I love) and I will definitely be exploring books from all the others as well. This is a must read for all fans of historical fiction."}, {"userName": "Kate", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/5737182-kate", "userReview": "A superb compilation! These are six separate stories by different (and hugely accomplished) writers but they are all linked, not just by the events of Vesuvius's eruption but also by characters who come and go through the stories. The result is powerful, dramatic, intensely moving and terrifyingly real."}, {"userName": "S.J.A. Turney", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/2344297-s-j-a-turney", "userReview": "The benefit of such a tale being told in six different stories by six different people is that it bears a certain resemblance to the good old-fashioned disaster movie. These days they tend to be released as love stories or thrillers or suchlike against the background of a disaster, but you remember the old ones? The Poseidon Adventure? Airport? The Towering Inferno? Even Volcano, I suppose. Part of the joy of those movies was that the story was not one plot but a basket of inter-weaved plot-lines set against a single series of events, often throwing disparate characters together and telling the whole tale from a variety of viewpoints. And that’s what we have in Day of Fire, with the stories cleverly interlinked to a greater or lesser extent.Off the bat, I’ll say that the only writer of the six included here that I’ve previously read is Ben Kane, but his pedigree is such that it would hook me regardless. Happily I was pleasantly surprised. There being such a variety within I couldn’t hope to review the book as a whole without attention to the individual tales, so here’s a blow-by-blow review, interspersed with a few appropriate pics of Pompeii ripped from my collection for colour.The Son by Vicky Alvear Shecter introduces us to the locale, the time, and the initial problems with Vesuvius, taking us through a story of young lust, betrayal and intrigues, told with an easy, familiar style that is well informed and thick with Pompeian atmosphere, dropping us into the troubled life of the nephew of the great admiral Pliny the Elder. I was initially unsure of it as an opening tale, perhaps because it is so often said that a novel will only sell if the opening scenes are crammed with blood and action (and such is my most common reading fare) and perhaps, given the fact that this is a tale of Vesuvius, I was expecting an opening scene filled with volcanic action. But very soon I settled into the tale and started to enjoy the ride. The last stages of the story were particularly well presented and the story left me with an impression of polished style and a solid understanding of human nature. All in all, it was a superb opening to the collection.The Heiress by Sophie Perinot I found a little more troublesome. Not for the story or the characters, which were both very well presented, and again the flavour was just right, but for the fact that the story was written from two viewpoints and one of them was presented in the first person, present tense, which I find faintly headache-inducing to read. Still, as I said, the story was well enough told that it made me persevere, and I’m glad I did, for the end result was one of enjoyment and, after all, half of the tale is told in the first person past tense. This story of a woman hurtling with unstoppable momentum towards an arranged marriage she fears has a real feel of humanity about it, and introduces us to a number of recurring characters. It also perhaps made me reconsider the importance of the arranged marriage in Rome and the effects upon those involved.The soldier by Ben Kane is a Kane tale in spades. Ben is one of the leading lights in both the Roman and Military genres for a reason. Unlike many who can admirably present a battle and a tale of spilled blood and spilled brains, Kane is one of the very best for interlacing a human element that gives such stories a real depth of feeling, and that is if anything more pronounced here than in his previous novels. This tale of a broke and desperate ex-soldier pinning all his hopes of surviving his creditors on a gladiator is a real gem. Kane’s usual military action comes here in the form of the games in the arena rather than battle, but that is a small part of the whole, which is a tale of brotherhood and survival more than anything else. This is also the first tale in the collection that focuses heavily on the effects of the eruption on the city of Pompeii, which has been building in the previous two.The Senator by Kate Quinn was the biggest surprise of the collection for me. It was, I think, also my favourite tale in the book. I’d not read anything by Kate before, and while I may well read other books by these writers going on, I have already bookmarked Quinn’s ‘Mistress of Rome’ on the strength of this. Essentially this section, which builds beautifully on the back of characters and events that have already appeared in the earlier tales, tells the story of a disillusioned senator about ready to give up on life who finds himself, after an earlier encounter, trapped in the doomed city in the company of a feisty young woman (also following her earlier appearance.) It is the story of their journey through the destruction and terror of the disaster and their interaction, in particular the effects said interaction have upon each other. It is told with warmth, understanding, humour, love and at times a bleakness. I would rank it one of my favourite explorations of character I’ve ever read.The Mother by E. Knight to be quite honest I had a little trouble with again, since again the whole tale is written in first person, present tense for each point of view. I persevered, since the story once again built upon characters and events from earlier in the collection, and by the time you hit tale 3 in this book, you want to know what happens to everyone (which is a good sign.) And once again, I have to say that the story was fine and well-told, but made hard work for me by the tense in which it was written. The story of a woman about to give birth in a doomed city is a deep and troubling one.The Whore by Stephanie DrayCuriously, I’m at loggerheads with what I want to say about the the sixth and final tale in the collection. It is another (like the second) that tells two viewpoints with two different ways – one of them being First Person, present tense. Upon first realising that I almost gave up and skipped it but, having been through the other five and knowing that this tale revolved around two characters who have been part of the series from the start, I found myself reading and soon discovered that I could not stop. I managed to overcome my aversion to the tense very easily to read this tale of two whores in the last throes of Vesuvius, confronting and overcoming their long-term issues as they try to decide whether to stay in hell and do their duty for their owner, to flee the disaster, or – in one case at least – follow the dictates of their heart. This is the tale that ends the book. This is the on that makes you think. This is the wrap up and it is beautifully done in terms of character.So there you have it. Six tales, interlinked and telling the stories of numerous inhabitants of Pompeii on the day Vesuvius erupts – the Day of Fire. As is noted in the book’s introduction, while all the tales are connected, none of the connections are critical to the understanding of the others, so if one does not take your fancy, you can easily skip to the next. The interweaving is extremely well done and becomes clearer as the collection progresses, and the progress of the eruption and the destruction of the city is well-portrayed, advancing slightly with each tale. I am pleased to see a realistic approach to the eruption here, by the way. No vast lava flows snaking through the streets or fireballs or explosions. The eruption described here follows the known sequence of events and does not – as is apparently so often the case – mix up what happened to Pompeii with what happened to Herculaneum (or even in the most dreadful cases Mt Thera or Krakatoa!)Essentially, A Day Of Fire has something for everyone, and I cannot imagine any reader of historical fiction not finding within one or more tale that suits them. I have picked up a number of new authors to follow, which is the symptom of a good read."}, {"userName": "Stephanie (Bookfever. ♥)", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/4939266-stephanie-bookfever", "userReview": "Part one: The Son by Vicky Alvear ShecterI'm a big fan of this author and I was thrilled when I saw that the first part was her story. The Son is about a young man discovering the joys and disappointments of first loves and acceptance. I really liked this story because I soon discovered about who exactly (historically speaking) the story is about. But more than that, Vicky Alvear Shecter is a great writing and she pulled me right into the middle of Pompeii. Part two: The Heiress by Sophie PerinotSophie Perinot is a unknown author to me but I loved her story. All the stories and characters in this book are connected but yet they're all different. I liked this story because it showed the struggles of marriage in ancient Roman times and how women didn't really have a show there. It also showed how people are not what they seem at first. Although Aemilia and Sabinus were very different, in age as well as personality, I still really liked Sabinus because he really wanted to take care of Aemilia and in the end he certainly did. Part three: The Soldier by Ben KaneBen Kane is also a first time author to me. Just like the previous stories, I loved this one. I think it's impossible for me to hate a story about Pompeii but still, the story was great, the writing was excellent and it had a great pace. This story was a bit different from the other because it featured Rufus, an ex-soldier with debts. I really liked reading this point of view because it was more about the gladiators and the rougher side of Pompeii. Part four: The Senator by Kate QuinnThis part was yet another amazing addition to the book. Definitely a favorite one of mine. Why? Because Diana (who appeared in the second story first, if I'm not mistaken) came in it, though it mainly focuses on senator, Marcus. Diana is a fantastic character because she's so different from the other women. She's fierce, independent and loyal. So how could I not love her? I liked her interactions with Marcus a lot and admire her so for not abandoning him in all the craziness. Marcus was a totally different story. Due to events happening in his lifetime he became a bit suicidal and didn't want to leave Pompeii when hell broke loose until Diana came to his rescue. Part five: The Mother by E. KnightI had expected this part to be sad because I anticipated where this story would go but I hadn't expected it to completely destroy me. It simply brought me to tears. Not many stories can do that so I applaud E. Knight for being able to do that with this story. It was beautiful in a tragic sort of way. The characters where this part focuses on were fantastic to read about, I loved them all and felt so badly for them. Heartbreaking but it was absolutely intriguing at the same time.Part six: The Whore by Stephanie DrayThis part was excellent (just like the others) but I think I liked this one the best of them all because it ties everything up in the end and some of the other characters appear in it and what ultimately happens to them. This story is about Prima and Capella, two prostitues that are also sisters. They were definitely one of the more interesting characters, both very different but I thought reading both their points of view was so good. This story was also kind of sad but wonderfully told. Overall:I've always been fascinated by Pompeii but in the last year or so my fascination has grown even more so when I found out this book was happening I was so excited about it. The authors are all insanely good, though I had only read books by one of them. I heard a lot of amazing things about the others. Obviously, I wasn't wrong about it at all. The authors all delivered greatly and the book is one of the best I read this year. I might even call it the very best book I have read this year. Although these are stories written by seperate authors, all the parts and characters are connected. Characters from one part appeared in others and so on and on. I can't say enough how much I loved this. Because of this, this amazing collection of stories read as a full book. I can't express enough how much I loved this book. A Day of Fire: a novel of Pompeii is one absolutely stunning book with such excellent and colorful writing, full of history about Pompeii, its citizens and the disaster that struck everyone there. I completely recommend this brilliant read!"}, {"userName": "Erin", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "What's that you say? Six historical fiction authors are getting together and writing stories about the fall of Pompeii. Oh and author Michelle Moran( who I just adore) is going to give the eloquent introduction. I am going to fully embrace the book nerd in me and say that I have been waiting with relish to get my hands on this book. Gotta love March Break! Get ready because I am about to gush about the love that I feel for this book. It is also a great book to read as I am eagerly anticipating the next book from KQ.  Although I am only acquainted with the writing of Kate Quinn and Stephanie Dray, I felt completely immersed in the sights, sounds, and going-ons of each stories characters in the days leading up to and including the destruction of Pompeii. \" A Day of Fire\" is an intricate web of story without any tangles. Quite simply, each author has a character that they are responsible to bring to life on the pages. However, the reader isn't left dangling after their story is finished. In fact, characters cris-cross across the pages constantly and what it creates is a sense of closure that will leave readers fairly satisfied. Did I have a favorite? While I cannot help but be partial to the re-emergence of Quinn's Senator Marcus Norbanus and Diana of the Cornelii. They provide for some much needed comic relief as Pompeii heads into permanent darkness. Each author does a fantastic job of making their character(s) memorable. I felt emotionally and mentally invested as the mounting tension towards the eruption of Mount Vesuvius came closer. Honestly, I think I am going to re-read it right now! The only question that remains is- when are these six authors going to collaborate on something again? So many good lines but this one just sticks out!\"I did not choose to be born in fire. No one chooses the manner of their birth, I suppose, and women have precious little choice about anything after they draw that first breath. Fifteen years ago, the Fates decreed I be born a girl, slippery and willful, as my family fled Rome in fire and blood.Being reborn is a different matter. As I felt my city quake from a distance today, and watched tendrils of smoke rise from her, I elected to be reborn a woman. Reborn not in the act of putting on a wedding veil, or consigning my childhood treasures to the flames, but by choice—a choice given me by the grace of a man's understanding, and by the actions I will take hereafter in response to his act of faith.\"- \"The Heiress\" by Sophie Perinot"}, {"userName": "Susan Spann", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/8081849-susan-spann", "userReview": "I picked this up for two reasons: First and foremost, it's a novel about Pompeii, and the eruption of Vesuvius has fascinated me since I read a National Geographic article about it over twenty years ago. It's the personal elements of the tragedy that fascinate me most, probably due to the unique nature of the event, the scene, and the remains and ruins found there.A DAY OF FIRE promised to tell \"a novel in six parts\" - and to fictionalize the story of the horrific eruption and disaster through the eyes of six different authors and multiple characters. The novel did not disappoint, and in fact I found the manner in which the authors wove the separate stories together both compelling and far more skillful than I anticipated (and, honestly, I know these authors, so I expected a lot).The second reason I chose the book is that I do know some of the authors personally (and others I know online) - but that actually made my expectations higher rather -- not lower. Again, I was delighted. I would not have been disappointed if I'd paid \"full market\" for this, in hardback, and I strongly recommend it to anyone who likes compelling historical fiction, fast-paced stories, and well-told, intricate tales.I read this until 3:30 am, put it down to get a little sleep, and stopped work early to finish it the next afternoon (instead of a nap, no less). Loved it. I'm only sorry it's over - though I will probably read it again."}, {"userName": "Rio (Lynne)", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/3803025-rio-lynne", "userReview": "I recently visited Pompeii, so when I saw this book I was excited. Several authors came together to weave a story about characters who lived the devastation. It doesn't matter if you have visited there or not, all you have to do is look online to see the destruction caused by Mt Vesuvius and see the casts of the bodies to feel for this city and it's victims. The first 2 stories started strong, but the book went downhill after that. The authors had an opportunity to take the real victim's whose casts have been found and try and put their stories together. Instead, we the reader, got a lot of sex, profanity and repetition. Not that sex didn't exist in Pompeii...it did. I remember walking through those streets, the whore house, the villas, Temple of the Gods, the gladiator's quarters....and I loved revisiting that, but this story just seemed hokey to me. Not legit. The ending was not climatic.......how could it NOT be? It's Pompeii for God's sake! \"The ocean rolling down a mountain\" I was scratching my head on that one. We know the surrounding towns did not survive the heat, but in the end (well...I won't spoil it) just say, once again I was scratching my head. I felt the authors had a chance to write a moving, touching story and try to give life to those casts and instead they wrote about characters I never got attached to, never liked and in the end I felt cheated."}, {"userName": "Jen", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/3884981-jen", "userReview": "[Sabinus being actually being a good guy who she might love (hide spoiler)]"}, {"userName": "Faith Justice", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/4243191-faith-justice", "userReview": "A lively anthology by some of our best historical fiction writers. Stories feature a wide range of people: tavern whores, senators, gladiators, pregnant mothers, priests, proto-mafia money lenders, and more. The stories are linked by characters who show up in multiple stories--sometimes just as background, others in crucial plot twists--as well as the inevitable volcanic explosion. Most anthologies I read are uneven in quality: there are a couple of stand-out stories, a couple which could have been left out, with most good, but not especially noteworthy. This collection is \"above average,\" in that all the stories were good, solid, and touched me. One had me sobbing on an airplane and I had to switch to the in-flight magazine so as not to alarm my fellow travelers. (Note: It's not all doom and gloom--several characters survive, but inevitably some don't. There is a definite theme of redemption that runs through the stories even for the more unsavory characters.) I particularly enjoyed the attention to historical details that all these authors are known for and the way they wove their stories together. Bravo!"}, {"userName": "Tania", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "In Pompeii there were only the dead, the dying and the desperate.3.5 stars. A quick, interesting introduction to Pompeii - I was amazed by how much I learned about life in Pompeii, but also about the volcanic eruption itself. I liked the idea of the six authors doing overlapping and interlinking stories as they all focused on different aspects, but it also meant that I had problems really connecting to a specific character. It has convinced me to try a few new authors though.The Story: This book was written by six top historical novelists who joined forces to bring readers the stories of Pompeii’s residents—from patricians to prostitutes—as their world ended."}, {"userName": "Vicki Cline", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/2844127-vicki-cline", "userReview": "6 stories written by 6 authors about what happened to various people living in Pompeii on the day Vesuvius exploded. Some of the characters are real, like Pliny the Younger and some are mentioned in graffiti on Pompeii's walls. The stories are somewhat intertwined by having people featured in one story show up peripherally in others. The book gives you a really good look at what it must have been like to have been there on that day. Sadly, not all of the stories end happily, but some of the characters you get attached to do survive."}, {"userName": "Avi", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/5121522-avi", "userReview": "Wow! This was a fantastic read, I really didn't want it to end. All of the writers that created this book were excellent. I will definitely read it again in the future :)"}, {"userName": "Robin", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/2842201-robin", "userReview": "You might think \"a novel of Pompeii\" is a little misleading, since this is not a full length novel but rather a collection of six short stories or novelettes, all set in the days leading up to the eruption of Mount Vesuvius. But this is more than just a bunch of independent tales, each story is pulled together by overlapping characters. A side character in one story might wind up being a main character in another, so you're not left wondering what happened to this person or that (except Ben Kane's characters, of course), their story picks again up later on. This gave it more of a novel-feel, just as it's claimed to be. It also gave the reader more time to emotionally attach to certain characters, unlike most short stories, making it a much more powerful book.At first, I was concerned that these stories would all wind up being more like young adult romance because the first two stories reminded me of this. A young man falls in love with a prostitute and is willing to sacrifice his integrity to win her. A young woman is in love with a man below her station while betrothed to an older man who practically repulses her. Such stereotypical tales, especially in young adult romance, are what greet you with the first two chapters. It occurred to me that one of the first two stories is indeed written by a young adult author though so I guess it's not surprising.But the first two chapters wound up being more like a lead up. Unlike other short story compilations where each story may be set in totally different years, these tales are told chronologically so the first two stories are mostly set in the days before the eruption and the latter stories start at the beginning or in the middle of the destruction falling around everyone. The built up carries through the whole book, rather than there being a build up in each story. This too gave it more of a novel-feel than a collection of short stories.It's also very impressive that this many established authors were able to collaborate to come up with overlapping characters and well written, interwoven stories. It was much more than I expected it to be.Review from Historical Readings & Reviews"}, {"userName": "Heather", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/2291692-heather", "userReview": "I LOVED this collection! Let’s just start with that fact. I have noticed a new trend lately of authors getting together to write a collection of short stories that tell a cohesive narrative, and I find this to be a really exciting trend! This is the first of these types of collections that I have had the chance to read, however I am also looking forward to reading Grand Central.The stories told in this collection each would hold up as a stand-alone short story, however when read together you get a complete story of the city of Pompeii and the disaster that took its life; because quite frankly, that is what this book is really about. Sure there are great characters who you quickly become attached to and you learn their stories as well, but this book tells the fate of Pompeii, from the preceding days, to the actual eruption of the volcano, to the aftermath. We see Pompeii at her best, worst, and everything in between. There is great drama, pain, and luck. There are those who survive and those who don’t. You will experience a mixed bag of emotions here, so prepare yourself.While each story focuses primarily on its own character or set of characters, there is definitely crossover between stories. You may catch a glimpse of a character from a prior story passing through the background of another story; these glimpses are sweet little treats. And if you are a fan of Kate Quinn’s novels, you will get the opportunity to see a couple beloved characters appear in this collection!With a variety of authors writing this collection you run the chance of their voices not meshing with one another. That is not the case here. Their storytelling styles are so similar, you don’t really notice that you are reading different authors – which is a good thing in this circumstance.An excellent job all around here – the writing style, the choice of stories told, the evolution of characters, the drama. I couldn’t have asked for anything better. Way to go!This review was previously posted at The Maiden's Court blog and received for review."}, {"userName": "Reeda Booke", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/11260161-reeda-booke", "userReview": "This is a tale made up of 6 inter-connected stories taking place during events leading right up to the explosion of Mt. Vesuvius, as seen through the eyes of several people from different social backgrounds. You have a wealthy senator, a privileged pregnant woman, a prostitute, a 17 year old who has become a man, a woman on the verge of marrying a man she doesn't love and several others.The authors did a tremendous job in writing a seamless story, picking up where the other has left off, to form a complete and captivating story, rich in drama. All the characters are linked together by an event which changes all of their lives. Their research is impeccable and it shows in how they richly describe Pompeii and its culture of the time, and the horror these people must have experienced during that terrible time. I highly recommend this book! I have read most of the books of all the authors who have contributed to this one except for 2 of them. I plan to rectify that soon! I would love to see them do something like this again!"}, {"userName": "Louise", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/8854624-louise", "userReview": "Even though I love historical fiction, I rarely read novels based in Roman times. The whole gladiator/slave thing doesn't appeal to me at all. I purchased this book on my kindle app a few months ago because it was on sale but just got round to reading it. To my own surprise I really enjoyed it. I liked the format of this book, in which six different authors tell a story about a single event, with characters carrying over from story to story. It worked well. I liked several of the characters, and found I cared about what happened to them. The stories were really quite poignant."}, {"userName": "Lyn", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/35846220-lyn", "userReview": "Stunning view of Pompeii. This amazing book breathes life into Pompeii and the eruption of Vesuvius.I loved learning about the everyday lives of these people and their heroic efforts to escape the disaster."}], "description": "Pompeii was a lively resort flourishing in the shadow of Mount Vesuvius at the height of the Roman Empire. When Vesuvius erupted in an explosion of flame and ash, the entire town would be destroyed. Some of its citizens died in the chaos, some escaped the mountain's wrath . . . and these are their stories: A boy loses his innocence in Pompeii's flourishing streets. An heiress dreads her wedding day, not knowing it will be swallowed by fire. An ex-legionary stakes his entire future on a gladiator bout destined never to be finished. A crippled senator welcomes death, until a tomboy on horseback comes to his rescue. A young mother faces an impossible choice for her unborn child as the ash falls. A priestess and a whore seek redemption and resurrection as the town is buried. Six authors bring to life overlapping stories of patricians and slaves, warriors and politicians, villains and heroes who cross each others' path during Pompeii's fiery end. But who will escape, and who will be buried for eternity?", "title": "A Day of Fire: A Novel of Pompeii", "url": "http://www.goodreads.com/book/show/23241868-a-day-of-fire", "average": 4.16, "cover": "https://images.gr-assets.com/books/1410955762l/23241868.jpg", "reviews": 160, "authors": [{"url": "https://www.goodreads.com/author/show/4072332.Stephanie_Dray", "name": "Stephanie Dray"}, {"url": "https://www.goodreads.com/author/show/1088709.Ben_Kane", "name": "Ben Kane"}, {"url": "https://www.goodreads.com/author/show/7265420.E_Knight", "name": "E. Knight"}, {"url": "https://www.goodreads.com/author/show/4877970.Sophie_Perinot", "name": "Sophie Perinot"}, {"url": "https://www.goodreads.com/author/show/2974095.Kate_Quinn", "name": "Kate Quinn"}, {"url": "https://www.goodreads.com/author/show/140762.Vicky_Alvear_Shecter", "name": "Vicky Alvear Shecter"}, {"url": "https://www.goodreads.com/author/show/269069.Michelle_Moran", "name": "Michelle Moran"}], "type": ["Historical", "Fiction", "Cultural", "Historical", "Short Stories"], "outlinks": ["http://www.goodreads.com/book/show/23241868-a-day-of-fire", "http://www.goodreads.com/book/show/23530131-a-day-of-fire", "http://www.goodreads.com/book/show/25817162-america-s-first-daughter", "http://www.goodreads.com/book/show/8413892-lily-of-the-nile", "http://www.goodreads.com/book/show/10741702-song-of-the-nile", "http://www.goodreads.com/book/show/35068592-my-dear-hamilton", "http://www.goodreads.com/book/show/15815772-daughters-of-the-nile"]}