{"ratings": 109765, "userreviews": [{"userName": "Z", "userReviewDate": "Aug 16, 2007", "userURL": "http://www.goodreads.com/user/show/286151-z", "userReview": "I stayed up all night to finish this book, because the climax is simply unputdownable. I am hesitant to formally review it because it's one of those few books that can't be confined within the bounds of a critique or summary, and one that is so magnificent and moving that the idea of reviewing it makes me feel insolent already! So I'll just note what I feel about the book, and the kind of effect it's had on me.It's grim. Very grim. There are moments of tragicomedy, of overjoyed glimpses of the sun on a very grey day, but it's not a happy story, and it makes no pretensions to being one. The heartwrenching ending had me involuntarily wondering what kind of person would want to write a bleak tale like that -- and then I understood Mistry's message through the book, that this is fiction, but not made-up; this is a novel, but larger-than-life; this is yesterday, persisting into today and reaching out its long clammy fingers into tomorrow.Life's vicissitudes toss four unlikely companions into one living space, a dingy little flat, in the \"City by the Sea,\" Bombay. Widow Dina Dalal has lived for decades in solitude, barely making ends meet, watching the sun rise and set everyday with the same transparent indifference; college-student Maneck Kohlah has left his much-loved life and his family's little general store in the Himalayas to study air-conditioning and refrigeration in the city, a course that his father believes will equip him to deal with a world that is hell-bent on destroying nature to further technology; tailors Ishvar and Omprakash Darji, uncle and nephew, have left their village, and their traditional \"untouchable\" occupation of tanning animal hides to seek their fortunes in this city of dreams and earn enough money to go home and live more comfortably. This is the story of how these four people find family in each other, find friendship, laughter, and a courage to struggle and persevere despite all their troubles. This is the story of shattered dreams, of Indira Gandhi's cruel Emergency, of how each person's life is webbed and entangled in its own drama, of caste, poverty, and a positive survival instinct corroded into a dog-eat-dog mentality that strangulates, just as time itself does.Many parts of the book brought tears to my eyes, but by the time I finished it, I was actually sobbing. Somewhere in these six hundred pages the reader becomes friends with the characters, begins to share their joys and sorrows, and desperately wish for a happy ending that he/she knows, deep down, is not to be.This is a life-changing read, and one that I would be truly sorry to see anyone miss out on."}, {"userName": "Jeffrey Keeten", "userReviewDate": "Jun 05, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "“You see, we cannot draw lines and compartments and refuse to budge beyond them. Sometimes you have to use your failures as stepping-stones to success. You have to maintain a fine balance between hope and despair.' He paused, considering what he had just said. 'Yes', he repeated. 'In the end, it's all a question of balance.’ ” \nA Fine BalanceI sometimes take a moment to focus on the corner of my office. The way the two walls come together forming a line, a demarcation. I think of it as bringing the two halves of my brain together, to focus, to think, to ponder. It is an illusion of course, but I’m fortunate that some of my life can be given to fanciful thoughts like thinking I can marshal the powers of my mind by staring meditatively at a conjunction. We all worry about things, ponder things, and even dream about being somewhere else or about being someone else. We all have loose threads that bother us, sometimes they are consuming us, and little do we know these bothersome threads are becoming stronger, like a man imprisoned, who spends vast amounts of time doing pushups and situps, waiting for the bars to open. But it is a small matter, because I eat three meals a day, take a hot shower every morning, and sleep six solid hours a night on a bed that is not too soft nor too hard. I have rights that protect me from my government (at least for the moment). I have law enforcement that doesn’t have to be bribed to protect me from those that wish to do harm for harms sake. I have a circle of family and friends who wish me well and will lend a shoulder to lean on if I falter. I have healthcare and life insurance in case I am unlucky. I live in a bubble of civilization that almost insures me a certain length of life span. So when I do get time to snip those loose threads of my life I’m doing so with a brain that has the luxury of worrying about something more than just NEEDS. As large as my “problems” become they are still,but a small matter. There are a vast array of characters in this novel. Some are at a slightly higher economic level than the rest, but regardless of their circumstances no one can feel safe, no one can worry about matters beyond the most basic needs of water, food, and shelter. The bulk of this story occurs in 1975 in an unnamed Indian city by the sea. It is the time of The Great Emergency which really means that the government has declared a form of martial law...for the safety of the people of course. They have implemented a rigorous Family Planning Program that at first entices people with cash and better ration cards for food if they are willing to have the operation for sterilization. When bribery doesn’t elicit the results the government wants their methods become more invasive and more drastic. The government also implements a beautification program that translates to bulldozing all the temporary structures that have been erected around the city. These were thrown together to house the influx of country people coming to the metropolis to try and scrounge a living doing what others don’t want to do. The hodge podge of housing built out of cast off materials, rubbish to people of means, is not beautiful, not in the way that we are taught to evaluate beauty, but the creativity and the determination to build something for themselves is beyond beauty. It is simply magnificent. As they make a little money they fix something, add something, make it more their home.\nYou build it and they will come. There is no field of dreams in this India.So the government eliminates these eye sores, but does not provide a place for these people to live. They are thrown to the elements to shift for themselves. If truth be known the government would like to see these people vanish, stacked in the same pile as the rubbled remains of their homes. “What sense did the world make? Where was God, the Bloody Fool? Did He have no notion of fair and unfair? Couldn't He read a simple balance sheet? He would have been sacked long ago if He were managing a corporation, the things he allowed to happen...” The two tailors Ishvar Darji and his nephew Omprakash were there when the bulldozers started knocking down homes. Only after all the homes were destroyed did the monster machines stop for twenty minutes to allow people to salvage what they could. The tailors are working for a woman named Dina Dalal who is fortunate to have her own apartment. She still mourns the death of her husband taken from her in a freakish accident many years ago. She nearly went over the brink with grief. “Flirting with madness was one thing; when madness started flirting back, it was time to call the whole thing off.” She has a relationship with her brother that is complicated. She dislikes having to accept his help; and yet, finds herself going to him for money when she is short of rent. In a bid for more independence and more financial security she decides to start making clothes for a large manufacturing company, but her eyesight is failing and so she hires Ishvar and Omprakash to do the sewing. \nFurther help arrives in the form of Maneck Kohlah, a rich boy in comparison to the other people in the apartment, who contributes much needed rent while he is going to school. She is not supposed to run a business out of her apartment. She is not supposed to sublease. The landlord is looking for any reason to get his hands on this apartment so he can finally break the rent controls. It is a recipe for disaster born out of desperation. It is a bid for freedom. “After all, our lives are but a sequence of accidents - a clanking chain of chance events. A string of choices, casual or deliberate, which add up to that one big calamity we call life.” Through a series of unpredictable events they all end up living in the apartment together. The tailors out on the veranda. Dina shoehorned into the sewing room. Maneck in Dina’s old bedroom. There are difficulties mainly because Omprakash begins to resent Dina’s position as overseer. Om perceives her as a big shot, a rich person, when nothing could be further from the truth. Being a manager myself I really identified with Dina’s issues. She would try to be more lenient and the two men would take more and more advantage of her. She would try yelling and the men would become resentful. She would try negotiating with them, but any concessions she was willing to make was never enough. How quickly the men forgot how bad things were before the found the benevolence of the woman with an apartment. Despite those issues for a little while, too short of time, they were happy. “…God is a giant quiltmaker. With an infinite variety of designs. And the quilt is grown so big and confusing, the pattern is impossible to see, the squares and diamonds and triangles don’t fit well together anymore, it’s all become meaningless. So He has abandoned it.”The mystery of happiness. It is so hard to obtain and so difficult to duplicate. You can bring together the same people under the same circumstances and not be able to achieve it again. There is a magic missing, a zing, a spice, a mood or just the will to let it happen. There are a host of satellite characters who add so much vitality to this novel. My favorite was the Beggarmaster. As his title indicates he managed and took care of an army of beggars. He also, for a price, extended protection to people like the tailors, to people like Dina. He is as powerful as a magistrate and the police know not to mess with him or his people. He sees everyone the same whether they are people missing limbs or people still retaining every body part they came into this world with. He sees the world through the lens of the poor. ”Freaks, that’s what we are--all of us.”... “I mean, every single human being. And who can blame us? What chance do we have, when our beginnings and endings are so freakish? Birth and death--what could be more monstrous than that? We like to deceive ourselves and call it wondrous and beautiful and majestic, but it’s freakish, let’s face it.” The Beggarmaster would have been perfectly at home stepping into a Dickens novel as would many of the characters in this novel. Many reviewers have made comparisons to Charles Dickens and nowhere is it more apparent than in the cast of characters that Rohinton Mistry has assembled. Dickens would have also certainly loved taking on the issue of forced sterilization, the issue of sanitation, the issue of deprivation, and the overreach of a government completely out of touch with the largest majority of their population...the poor. You will find yourself living with these characters. You will even feel like you are sharing their deprivation through the power of a gifted writer’s words. Success is fleeting. Disaster ever present. Hopelessness is a shadow around everyone’s heart. No one is immune and everyone is walking on the ledge hoping the wind doesn’t blow. The things that matter to them the most are the essential things. The very things the rest of us take for granted. \nRohinton MistryRohinton Mistry very well may have written a masterpiece. This was recommended to me as a favorite book. I can’t resist when people say a book is their favorite book. So what I would like is for everyone to share their favorite book with me on the comments thread. I will do my best to eventually read every one of them that I haven’t read before. This novel is Highly Recommended!If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"userName": "Garima", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/7915003-garima", "userReview": "But rest assured: This tragedy is not a fiction. All is True. Hence started my journey of a fine book, A Fine Balance. I have no sane excuse for my ignorance about Rohinton Mistry novels. I just didn’t have a single clue about him or his achievements till I joined Goodreads. Yes!! Though it’s not a big deal as one is not supposed to know everything but here’s a writer of Indian origin, writing unbelievably great books about Indians and is still remain unacknowledged by a common Indian reader is densely pitiable. His Facebook page has 7000+ odd likes where, as I gauged from the comments, majority is of non-Indians. But then he is no marketing guru but a writer who writes and writes well, so well that it can make you cringe at the comfortable life you’re having or at least makes you open your eyes to take a good look at the hardships of the hapless lots around you. I don’t read about Politics because it disgusts me. I don’t have a deep understanding about the 1970’s Emergency period because fortunately nobody in my family or acquaintances got affected by it, so basically it’s the experience which tells a story, just watching, simply gives an indifferent shrug. On the surface I know that it happened under the PMship of Indira Gandhi. School mainly tells you: She was the First women PM of India. She was the daughter of honorable Pandit JawaharLal Nehru. She was the mother of one of the youngest PM of India, Rajiv Gandhi. She was the reason why India didn’t face another partition by launching Operation Blue Star, hence reduced the idea of Khalistan into ashes because of which she was later assassinated. Nothing more, nothing less always a glossy and martyred picture of Daughter of India, Ironically. So how does it feel to read A Fine Balance? What does it promise to convey its readers? What makes a 600+ page novel readable or rather a page-turner? What’s different about the lives of Dina Dalal, Ishvar, Om and Maneck that you haven’t witness before especially being an Indian? Well the answer could be “May be nothing is different, all trite”, or; “It’s helluva great story, I haven’t read anything like this before”. But the answer remains somewhere in between and the secret is Rohinton’s great writing. His matter-of-factly narration, awesome character building and plot settings can give you the pleasure like watching ‘Hum Log’ on high definition channel. He is not a man of big bulky words, dictionary is almost dispensable while reading him but the words are piercing enough to make you feel the subject. The story reflects through them in an unmatched finesse. There is no room left for any improvement as he has used every single component at his disposal in building this masterpiece, just like Dina’s quilt in the novel. The story revolves around four main characters, Dina Dalal, a widow and a self-respected lady who treats her independence dearest than any of the relations left in her life. Ishwar, a darji (tailor) whose father sent him to get equipped with tailoring in order to earn him a life of repute which he wouldn’t have got under the fate-imposed Chamaar profession. Om, Ishvar’s nephew, again a darji, a young and aggressive lad and an orphan whose life is dedicated mainly to his uncle Ishvar and vice-versa. And, Maneck, a guy from Mountains, whose struggle to know and feel his worth in lives of others especially his parents and a college friend remained unending. The story is about how four of them got together in one flat not willingly but due to twists and turns life threw at them. It’s a journey of how reluctance was over-powered by compassion, how loneliness made room for companionship and how a house became home , how four of them amidst many doubts and objections became “there for each other” Kind, but it was a home of cards waiting for a gush of insensitive wind to tumble it and its housemates. It’s a sad novel, heart wrenching in fact. It will make you cry (except in case of defective tear ducts) and it will make you very angry. It has its dose of humor but simultaneously it carries an air of apprehension around it like how a moment of happiness is short-lived and shall soon be replaced by gloominess and sorrow. It’s something I felt while watching Clint Eastwood’s Million Dollar Baby and Gran Torino, where as an audience one starts to feel that good days will be balanced out with bad days because Life, the bitch, usually gives us lemons, and to the unfortunate lot, it plants a lemon tree at the backyard of their wretched life. But throughout, this book echoes one universal law, that despair doesn’t have a favorite victim. It befalls upon everyone at some point of time, triggered by fate, destiny or power hungry human beings. History is a witness to how Power breeds evil, breeds mainly on the blood of innocent lives who would have never imagined that their destiny would sacrifice them to such inexplicable atrocities. This book depicts the story revolving around such atrocities and enduring them, living through them, dying through them or merely surviving through them and resilience is the main key to such survival. Rohinton has captured life through his characters, has captured India through an unfortunate time, has captured ugliness of human face and has finally captured resplendence of human soul through his mesmerizing words.READ IT !!!Here's my audio review of this book: https://soundcloud.com/readbetweenlin..."}, {"userName": "Jason", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/4426615-jason", "userReview": "Liking this book makes no sense. Not only are its characters subjected to like, the bleakest set of circumstances ever, but then those circumstances are presented to the reader with such an alarming degree of authorial detachment that you almost have to wonder whether Mistry himself—fed up with the unending series of hardships his characters are required to endure—didn’t just raise his arms in the air and say, “Oh, fuck it.” And yet I could not tear myself away from this train wreck.A Fine Balance presents neither a balanced nor a very fine account of a group of four Indian residents during the late 1970s. These folks, heralding from different castes and backgrounds, are tossed together by their individually perturbing situations to forge an unlikely bond—not unlike the bond formed among the cast members of Big Brother or The Real World except that in this case, the glamorous hot tub around which the characters congregate is replaced by a broken propane stove and a rusty tap from which water can be drawn only occasionally. For those not brushed up on their political history, the late 1970s saw India under the rule of Prime Minister Indira Gandhi who, though largely considered one of India’s greatest prime ministers on account of her centralizing policies (the constitutionality of which, I suppose, could be debated), was certainly not among those in the author’s favor. Throughout the story, Mistry’s characters are continually being caught in Gandhi’s crossfire even while remaining mostly oblivious to the political climate surrounding them. We get the distinct impression that Mistry is trying really hard to keep his own opinions from interfering with the story, but it is pretty obvious dude’s got some serious bitterness issues to work out.Anyway, this book is not without its flaws. A few characters bump into each other under repeatedly, under no plausible pretext other than pure coincidence, and this coincidence occurs frequently enough, especially toward the end of the novel, that the reader has to remind himself that this is India we’re talking about here, right? The one with a population density of a thousand people per square mile? Mistry makes us feel like this might be an India under glass, where the characters are tiny steel balls and Mistry is controlling the flippers.This book is good, though. For all its doom and gloom, I still see the hope in its pages. Three of its characters are clothing tailors, and one of the repeated themes is something about how life is like the patchwork of a quilt, the good parts and the bad parts being sewn together—but if one were to try to remove the bad parts, he’d only end up with holes in his life.(I suppose you’d have to think positively when you share a crapper with 150 other villagers.)"}, {"userName": "Ben Babcock", "userReviewDate": "May 16, 2009", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "This is probably the most depressing book I have ever read in my entire life. Not only is its chronicling of four lives bleak and without the slightest hint of hope or redemption, but it does this with a comprehensive scope and an unforgiving manner. Even re-reading it, knowing what was going to happen, did not mitigate my sadness. If anything, it amplified my emotions, because for all of the good things that happen in this book, the moments of joy, I knew how it was all going to go wrong. And this is not some adventure story or a romance where things get bad for a few hundred pages before the protagonists rise in the face of adversity. No, in A Fine Balance, everything goes to hell. And it doesn't get better.I could spend several paragraphs discussing how this book is depressing. Suffice it to say, A Fine Balance is set in Mumbai, India. It covers over 30 years, from independence in 1947 to the Emergency of the 1970s. Rohinton Mistry follows four characters: two tailors, Ishvar and Omprakash; the widow, Dina Dalal, who employs them in her apartment; and the college student, Maneck, rooming with the widow. These characters endure poverty, oppression, and abuse by those in power and those with power. The tailors, their relatives victims of caste violence in their village back home, arrive in Mumbai only to live in a slum that gets demolished, its slum-lord now in the pay of the government. But living on the streets is not an option, for during the Emergency police have broad discretion when it comes to \"beautifying\" the streets of the overcrowded, overpopulated city, and losing their residence is by far one of the lesser misfortunes that Ishvar and Om experience.The Emergency happened before I was born, in a land far removed from me. It is nothing more than a name to me, a period in the recent history of a country related to mine by imperial ties and immigrant exchanges. So this book lacks the personal resonance it has for those who did live through this period, whether in India or abroad. And I haven't really ever experienced any of the hardships Mistry depicts here. Nevertheless, I can still appreciate A Fine Balance as a depiction of suffering during a time of turmoil and tyranny. And yeah, it is depressing, but I do not agree with those reviewers who find this a valid reason for panning the book. Mistry makes you feel sad for a reason.While not perfect, Mistry's four protagonists are all good people. We learn this early in the book, for he recounts their past to us in a series of flashbacks so verbose as to transcend mere exposition and become true parts of the plot and narrative. Dina grows up under the thumb of her older brother, her dreams of becoming a doctor squashed by a patriarchal society. Instead she resorts to marriage as an escape, enjoys a happiness too rich to last long, and becomes a widow. For her, as with everyone, the question is how to make enough money to get by. Ishvar and Om come from a caste of tanners; their father made the defiant transition to tailoring and paid for the insolence with his life. They carry on in his tradition, but they have come to the city seeking work. Maneck has come to the city also looking for escape and edification; he is enrolled in a one-year college certification on air conditioners. He's not a very good student, but he is happy he has left his hometown, and with it his unsatisfying relationship with his father.These are ordinary, everyday people. They do not invite the misfortune that befalls them. Why do bad things happen to good people? A Fine Balance is many things, but it is not theodicy. It is instead a look at the consequences of a certain zeitgeist present in India at the time of the emergency. We see it in the way that Ishvar, Om, Dina, and Maneck all become victims, yes, but this zeitgeist pervades the novel on every level. It is present in the attitudes of Mistry's minor characters, in the exclamations of approval from Mrs. Gupta and Nusswan regarding the Emergency and its effect on trade unions, in the derision of Beggarmaster and the guilty conscience of Sergeant Kesar. Just as ordinary people ignored the obvious injustices happening during the Holocaust, so too did ordinary people rationalize and justify the brutality and the injustices that occurred during the Emergency. Some, like Mrs. Gupta or Nusswan, do it for economic reasons, whether or not they believe such actions are truly justified—scarily enough, some do. Others, like Sergeant Kesar, care less about the political significance of their actions and more about the moral significance.I like Sergeant Kesar. He is a very minor character, but he is an example of how Mistry manages to make the scope of his political themes so broad. There are plenty of stock characters in A Fine Balance, but for every goonda mindlessly enforcing the will of a landlord or minister, there is a Sergeant Kesar or an Ibrahim, an authority figure with a name and a face. These are antagonists or sometime-allies who, for one reason or another, are probably good people but have managed to end up in the wrong line of work at the wrong time. They struggle with their jobs, with the way they interact with people like Dina Dalal. This struggle is a poignant counterpoint to the innocent suffering of our four protagonists. The Emergency is not a monolithic movement of one group oppressing another. It is, Mistry shows us, a tumultuous period of conflict as one government tries to stay in power while elements subvert it for their own purposes.That seems to fit with India, a country always in flux as a result of its vast population and rich history. Indira Gandhi's desecration of democracy destabilizes the country, but it is just another straw on the back of an already over-laden camel. From Ishvar and Om's backstory we learn of the deterioration of the caste system, and the resulting resistance from those, like the Thakur, who have power in the villages. From Maneck's childhood we see how urban development and expansion, commercialism and competition, are changing India's rural landscape and endangering some enterprises, like his father's general store. Dina's tale is more personal and more gendered, but it is also a story about family and independence. As she points out, independence is an illusion. We are all dependent on each other, especially in a city as big as Mumbai, and the culmination of the relationships of these four characters is an illustration of their interdependence. Ishvar and Om's detainment and disappearance profoundly affects Dina and Maneck, both personally and professionally; likewise, Dina's troubles with the landlord threaten Ishvar and Om's livelihood.But I digress. In A Fine Balance, Mistry juxtaposes the turmoil of the Emergency with many other events occurring simultaneously to alter India's zeitgeist. The result is a snapshot of a country that has always fascinated me for its conflict and its contradictions. Mistry's descriptions of life in Mumbai, especially for the impoverished, are almost beyond my ability to grasp, so different are they from what I know. India is in that interesting zone between developing and developed nation (though I am aware such terminology is, as ever, controversial). Its economy is so huge, so rich, both real and with potential, yet its massive population faces problems of education, poverty, and health. It is a fascinating country with very real challenges, both now and in the 1970s when this novel takes place.All this, of course, does not really address that central question: why so depressing? Why couldn't Mistry weave a thread of hope through his quilt of a story? In my opinion, Maneck's ultimate fate obviates any possible solace one might find in the tenuous equilibrium achieved by Dina, Ishvar, and Om. It is a grace note that manages to overpower the end of the book, cause shock and dismay, and colours anything that follows. I don't want to spoil it if you haven't read the book, but it is an action of such implicit nihilism that it is emblematic of the tone of A Fine Balance.Simply put, if this book ended on a \"happy\" note, if Ishvar, Om, Dina, and Maneck emerged with little in way of complaint, then their suffering would have been meaningless. That is a major claim to make, I know. Other books involve characters who suffer greatly only to emerge triumphant and all the better for it, so what makes these ones different? It is both the nature and the degree of their suffering. Their experiences are so brutal, so dehumanizing, that any serious redemption would minimize them too much for the reader. In order to emerge from such experiences triumphantly, it would have to be through actions of their own doing, through some form of resistance that overcomes the adversity. This would contradict the sense of powerlessness that Mistry wants to communicate, the utter helplessness in the face of an implacable political climate created by corrupt politicians and police. Ishvar and Om are not, cannot be revolutionaries. Dina and Maneck cannot be subversives. So when they suffer and submit and then it is over … well, it cannot really be over, not until they are devastated. Mistry must administer a coup de grâce that finalizes the destruction he has plotted since page one.This book is fiction, so it must have a beginning, middle, and end. But it is as close to being true as fiction can get, both in verisimilitude and in attitude. It is neither uplifting nor endearing but wearing. Even the most optimistic person would feel besieged by Mistry's careful and persistent erosion of everything good from the universe of A Fine Balance. And this holds up to repeated readings, because his depictions of characters both major and minor are just so vivid, so believable, so tortuously touching, that you cannot help but care about what happens to them, even when you know it will be nothing good.And so, I am not sure what to say, except that this is one of my favourite books, and in my opinion, one of the best books ever written, period. There will always be those who disagree, who pick it up, trudge through fifty or a hundred or two hundred pages, and then declare it a waste, a wash, unimpressive or boring at best. I don't know how to respond to those people, or even if I should respond. All I can say is that few books have ever affected me so much as A Fine Balance. Many books have moved me; many have entertained me and charmed me and made me laugh and cry. But A Fine Balance has left an indelible mark upon me. It is a work of consummate skill. This book is fiction, so it must be false. But it is a sad, depressing book, because somewhere out there in the past and the present and, yes, the future, every single bit of it is, in some form, true."}, {"userName": "Riku Sayuj", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "“Poor naked wretches, wheresoe’er you are,That bide the pelting of this pitiless storm,How shall your houseless heads and unfed sides,Your looped and windowed raggedness, defend youFrom seasons such as these? O, I have ta’enToo little care of this! Take physic, pomp;Expose thyself to feel what wretches feel,That thou mayst shake the superflux to themAnd show the heavens more just.”~ King Lear***\n“Why did I dislike him so much, she asked herself? Where humans were concerned, the only emotion that made sense was wonder, at their ability to endure; and sorrow, for the hopelessness of it all.”~ Dina, A Fine Balance\n\nLear’s Patchwork Quilt\nA Fine Balance is a true modern epic, built on the ordinary. If one could read only one book about India, this would make a very good choice. On city, one village, one town, three families - this is the tight canvas in which Mistry paints, or rather, is the quilt that he weaves. They fit together to form a Persian carpet that captures within it an entire country’s desolation. As the characters move from distrust to friendship and from friendship to love, Mistry creates an enduring panorama of the human spirit in an inhuman state, at once unsettling, pitiful, and maddening in its clarity.Never dramatic, never superfluous, the details keep getting added to the quilt, no stray piece left untended, every discarded cloth-piece added and stitched in with exquisite care. Mistry’s quilt is perhaps among the greatest novels composed on modern India, at least in terms of sheer ambition of the construction and the constrained canvas in which it is accomplished.Every anguish, spread across four generations, every tumult and gasp of a country is squeezed into the harrowing tales of a few poignantly realized figures. Indeed, the whole drama is almost Shakespearean in scope - with distinct echoes of King Lear in it - in the pride and distance of each character; in their imaginary walls, which crumple with closeness.Lear’s Storm, Writ LargerMistry is often compared to Dickens, the archetypal author of the Uncaring State. For me, the comparison that kept forcing itself was with Shakespeare. As I mentioned above, I could hear distinct echoes of King Lear as I was reading this magnificent book. However, I was not sure if I was reading this into Mistry since I had just gone very deep into Lear (in which I was reading too much of Plato, to be honest). I did not trust myself and decided to investigate - and I found (to my relief) that Mistry loves King Lear - he had even made an entire novel out of it (not this one, but ‘Family Matters’). It thus turned out to be a very lucky coincidence that I read King Lear almost in parallel with Mistry.In any case, I now feel justified in elaborating on this theme - on the logic that a possibility of a King Lear influence having contributed to 'A Fine Balance' cannot be discounted.I have to confess that once I made this discovery, I became overzealous and did make an attempt to draw the plot of King Lear directly into Mistry’s novel, but Mistry is too much the master for that. I tried to connect the abiding theme of love in both, trying to imagine Dina as an abandoned Cordelia. I tried to think of Maneck as a proxy-Edgar, one who was spared tragedy - but only the obvious hard-hitting ones that we dignify by the word ‘tragedy’, not the creeping disenchantment with life that can be even more cruel. I tried to deconstruct and see if the intermixing story lines of Fine Balance serve the same function as in Lear, the two story lines, the two tragedies mixed into one, joining to form a single base line to the symphony, echoing and reaching the same notes - a ritornello, of sorts. None of this worked satisfactorily.Eventually, my reconciliation is that Mistry has set his novel in an in-between place - between the lunacy of self-inflicting suffering and the self-wrought tragedy of the end, of Lear. Instead, this epic unfolds in the forest, in the storm, the characters thrown into it directly, with no semblance of a ‘why’ or a question of ‘deserving’ anything. Unlike the Shakespearean tragedy, where there is at least an apparent causation for the tragedies that befall each, the condition of the storm, of wild uncaring nature is the default here. All are equal in this world, the same storm lashes them all.One of the major themes in King Lear is the path to understanding (and salvation), forged in the wild under this wild buffeting of nature’s storms - where the ships of varying fates are lashed against each other, making them realize the ‘equality of pathetic mortals’, the only salvation allowed to them to be extracted from the whole tragedy.\n“You know—things falling apart, centre not holding, anarchy loosed upon the world, and all that sort of thing.”\nIn Mistry’s world too, the blind force of the Government and the ‘Emergency’ looms large and ominous in the background - affecting these characters, with no personal enmity or malicious intent - almost like a primal force of nature, grabbing, destroying or sparing the lives and joys of the actors - just like wild nature in King Lear.Mistry also works in a lot of political criticism of the Indian political system. Let us pick a phrase from Mistry to summarize this: A house with suicidal tendencies. The path seems inexorable. Once tyranny makes an entrance, it allows the government to become more and more authoritative, insensitive, even casual in how they treat human lives (and dreams), without any real conscious intent - like the blind pagan gods of Shakespeare. Thus, maybe a step beyond nature then - as powerful, all-pervading and unreadable as the Gods themselves.It makes one wonder how unreasonably powerful our modern governments are - capable of reaching in and snuffing out even the minutest blooms of happiness, at random. Isn’t it scary to have such gods amongst us?\n“Where was God, the Bloody Fool? Did He have no notion of fair and unfair? Couldn’t He read a simple balance sheet? He would have been sacked long ago if He was managing a corporation, the things He allowed to happen …”\nSet against this blind force, the characters of Mistry too blunder blindly through the vast forces of ‘nature’ in search of some reconciliation - their lives too seem to present glimmers of hope until the next wild gust, or random malice, sweeps it away - but finding each other, giving what support they can, realizing that the straws are all that matters to the drowning man, finding what little joys they can in the occasional beauty of their fraying tapestry of a quilt.\n“But how firm to stand, how much to bend? Where was the line between compassion and foolishness, kindness and weakness? And that was from her position. From theirs, it might be a line between mercy and cruelty, consideration and callousness. She could draw it on this side, but they might see it on that side.”\nIf you think about it, that is almost a primal question for a civilized society… From asking a question like that to reaching a point in which the line is erased altogether, at least when seen, at a certain angle, from both sides - that is the only trajectory that deserves the name “progress”. Emergency is an almost comical word, but it is poignant since, as Mistry shows, most stumble from one Emergency to the next, uncomprehending. Some may escape the blindness and see each other, but perhaps only in the minds of visionary authors.All this parallels the distinct evolutionary trajectory of the characters in King Lear too, as the Kings and Nobles realize that underneath their garbs, the thin veneer of civilization, we are all equal. And when fates and ‘higher powers’ tear us apart and smite us with lightening, the poor and the rich can see each other, and their equality, in that fateful  flash.The Finely BalancedSo we come back to this: Indeed, the whole drama is almost Shakespearean in scope - with distinct echoes of King Lear in it - in the pride and distance of each character; in their imaginary walls, which crumple with closeness.The real fine balance, the real circus act, is the flimsily constructed wall that balances so finely between people, between families, between castes, between classes, between societies - but it cannot stand up to personal acquaintance. Which is why we use emotions of fear and disgust to prop it up.This wall, a mere figment of imagination, is made up of stories, fictional ones - the moment it encounters real stories, it tumbles down. Authors like Mistry are the modern equivalents of the quixotic hero, trying to crumple these walls, reaching across thousands of miles, through the pages of a book.Of course, we can see in figures like Nusswan those people who manage to keep the walls of fine balance erected throughout their lives - we see in them ourselves. Can we dare to see ourselves in Nusswan? In a character like Maneck we can see someone who was perhaps lucky to escape childhood without erecting them. In the other poor souls who haunt the book, we see the ones on the other side of our well-tended walls. Then, in Dina we can see the ones who do break free of these finely balanced walls. And we might even aspire to their tragedy - so that we can be free of these walls too. That is the power of a work like this - it makes us crave even for tragedy, if only to let us escape our self-constructed prisons! How powerful is that?"}, {"userName": "Paul Bryant", "userReviewDate": "Sep 27, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Rohinton Mistry has written three whopping novels set in India, Such a Long Journey, A Fine Balance, and Family Matters, and they're all brilliant. He doesn't have pyrotechnic prose like the DeLillos and Pynchons, he's the tortoise to their hares, he plods on with his careful beautiful pictures of the details of people's lives, the complexities and the horrors and the unnoticed pools of affection, where the money comes from and where it goes, how they get through the day and how they don't - his camera never lies. I recommend all of these three novels without any ifs or buts. You may be weeping at the end of them, because life is sad, but you won't mind that."}, {"userName": "Carol", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "OMGOSH! Definitely a five star read for me, but all of my emotions are shot to hell. Did a world like this really exist in 1970's India? Heaven forbid!Rohinton Mistry introduces his four main characters and their individual stories one by one until they merge together sharing a cramped apartment in a world of starvation, suffering and despair.With civil unrest and demonstrations against a corrupt government on the rise, our protagonists needlessly endure despicable injustices to both body and soul just for being in the wrong place at the wrong time.While reading A FINE BALANCE, I lost count on the number of expletives I screamed inside as I encountered shock after unbelievable shock.Excellent, but draining read with absolutely wonderful secondary characters added to the mix and a story I will not forget, and......oh the ending. Don't miss this one......Definitely worth your reading time!"}, {"userName": "Gautam", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/32002534-gautam", "userReview": "A man with paralyzed legs lies on his itchy straw bed, staring at the murky ceiling that seems closing in on him, as his eyes have been fixating it for too long. The time seems reluctant to move on as there is no sign of movements around him; the world seems to have divorced him. His room has no windows that rewarded him with a view of a green patch or a shimmering rivulet to vouch for his existence. The life, as it seems, has no prospect, he thought. As the bleak moments ostensibly passed, he, to his surprise, spots a fly out of nowhere inching towards him. The sound of its vicious flutter of wings and its dull black mass has a portentous import, and, gazing at it, he gulps lumps of fear down his damp throat. As the fluttering, buzzing sound reaches an unacceptable proximity, he waves his arm, almost mechanically, in one vigorous movement, as though terrified by the ominous propinquity, and the fly, as though mocking at his frantic attempts at dissuasion, retreats a short distance only to come back as tenacious as ever. As the moments trudged past lazily, the buzzing sound now seems to be derisive laughter. The unflinching tenacity of the fly begins outriding his remnant resolve. He feels subjugated to the mettlesome fly. He feels subdued. His arms, after repeated waving and sweeping, protested to move further. He truncates his efforts. Despair. He, like a hapless docile creature, accepts the defeat and the fly, with its flourish of invisible wings and triumphant buzzing, licked his skin as though making him know, out of pure derision, the tangibility of misery, failure, and cul-de-sac.I used ‘the man’ here as a metaphor for the poverty-stricken Indians during emergency, with their independence and free-will paralyzed by the whimsical government and its greed for power, making them glued to their hapless lives. The Fly of misery, which came almost always out of nowhere, kissed them mockingly, conquered them, and pushed them into dark abysses of lugubriousness, but only before they had put up a futile fight for stalling time prior to complete subjugation. And in the end, as Maneck Kohlah said, everything ended badly.A few words on Emergency:Inorder to curb ‘internal disturbances’ and to smooth out the threatening, revolutionary waves prevalent throughout the country ostensibly, Indira Gandhi government, on 25th June 1975 , enforced ‘State of Emergency’, which spanned over 21 months that brought endless misery and impoverishment on the Indian landscape. The fine balance that precariously maintained the social and cultural equilibrium had been mutilated causing uproarious fiascos. The gory period is still in an indelible mark as an epoch of calamity, instability and madness.A few words on caste system: To say in a few words, due to lack of time and space, the caste system in India has been like a series of concentric circles : the outermost circle being the most dominant class enjoyed unequivocal prerogatives, and the innermost circle being the socially oppressed and untouchables enjoyed almost nothing. Though the caste system looks antiquated and draconian, it has been prevalent since time immemorial and is a by-product of years of cultural evolution.Main Review:First of all, let me start by saying that Mistry is a prolific writer. He concentrates on the substance and soul rather than the adornment of prose or metaphorical-diarrhea. That said, his prose is unvarnished, earthy and palpable. The story of four protagonists in the novel looks like an arbitrary selection, as if the author had been in a pursuit of finding a constant for the ever-befuddling equation of misery and despair among the common-place Indians during emergency. The novel, as you read it, creates an impression that the story involving the four main protagonists is only a part of a very big story, or collection of stories, that is impossible to contain in a mere novel. “I think that our sight, smell, taste touch, hearing are all calibrated for the enjoyment of a perfect world. But since the world is imperfect, we must put blinders on the senses.Dina Dalal, a hapless victim of a brutal quirk-of-fate, was deprived of her married life, which was cut off at an inchoate juncture. Being a widow, her chance for an independent survival was bleak, but a second marriage was impossible even to think of. She had no one but her brother as a sole living-recourse. The absurd notions such as women are weak without the sturdy shoulder of men to lean on have been prevalent among the Indian families, where women are merely considered as ‘production units’. Her brother too was no different; as soon as his sister became a widow, he started thinking of her matrimonial prospects and began inviting his affluent friends to home who didn’t seem to care about her second marriage. He simply couldn’t imagine or believe a woman could thrive independently without the ‘intrusion’ of a male presence. Epitomizing the virtues of boldness and optimism, and yearning to extricate herself from the sanctimonious, smothering clutches of her brother, she decided to earn for a living, she decided to sew.“Independence comes at a high price: debt with a payment schedule of hurt and regret.”The entry of the tailors, Ishvar and Om, and her new paying-guest, Maneck, unveiled new vistas in her life that had been plunging into the deep recesses of solitude. The room that was once filled with distorted, aimless noises of neighbor’s chores was now being filled with sounds of bustling life and laughter. Her new life, now devoid of forlorn air and solitude, instilled a new found hope and joy in her. The tailoring machines became the beating-heart of her house, and the blood of joy and stability surged through every vein of her abode and being. Presence of another living entity is indeed the most delectable thing after a dry spell of solitude and the accompanying pessimism. The tailors, on the other hand, after their small hut in a slum settlement had been destroyed as a part of Government’s new program of ‘beautification’, sought refuge in Dina’s flat and made themselves home swiftly.“In the WC, the tailors’ urine smell that used to flutter like a flag in the air, and in Dina’s nose, grew unnoticeable. Then it struck her: the scent was unobtrusive now because it was the same for everyone. They were all eating the same food, drinking the same water. Sailing under the same flag.”Ishvar and his nephew Om, due to harrowing poverty, came to the city by the sea to earn a fortune. They were skilled tailors, but their heart and soul were anointed with the indelible ashes of their lugubrious past, making them flustered and tentative. The timeless memories of their lost family, who were burnt alive by the diabolic upper-caste, were now the only green patch in the dry fields of their life. They wanted money to go back again to their village, to fixate their existence in their childhood abode, which now existed only as a mere dreamscape.“If time were a bolt of cloth, I would cut out all the bad parts. Snip out the scary nights and stitch together the good parts, to make time bearable. Then I could wear it like a coat, always live happily.” - OmprakashManeck Kohlah, an apparently rich boy from the mountains, came to the city by the sea under the coercion of his parents who wanted him to go to college and get a job. The concomitant effects of emergency even threatened the serene mountains, as the family land and properties were swallowed by the inscrutable partitions, as the mountains were being destructed for the construction of roads and settlements, obviating their positivity and secureness. He broodingly meditated upon the harrowing events and changes that constantly challenged his equilibrium.“Memories were permanent. Sorrowful ones remained sad even with the passing of time, yet happy ones could never be recreated- not with the same joy. It seemed so unfair: that time should render both sadness and happiness into a source of pain. So what was the point of possessing memory?”- Maneck KohlahEverything in the world is transient; things are bound to change without prior notice. Embracing change becomes an obligation as long as we endure life. The lives of four people, from a blissful spell of optimism and joy, plunge into another phase of dreadful import. The unexpected turn of fate waylaid them and extorted from them the tiny bags of their cumulated happiness. Not every story has a happy ending. “I prefer to think that god is a giant quiltmaker. With an infinite variety of designs. And the quilt is grown so big and confusing, the pattern is impossible to see, the squares and diamonds and triangles don’t fit well together anymore, it’s all become meaningless. So he has abandoned it.”- Maneck Kohlah---------------------------------------------------------------------------The story moves in a steady, uniform pace, without slackening or accelerating even for a second, which imparts a naturality, a life-like experience as you immerse into it. And the expanse of novel is scattered with numerous gems of nostalgia-inducing details that makes you inadvertently smile. For instance:“Rain had fallen during the night. The ground was soft, the mud sucking at their feet like a many-mouthed creature.”Mistry never left anything. In this 600 pages book, the life and culture of India has been jotted down with a heart that beats along with the words. Being an Indian, Mistry had been able to empathize inordinately with the characters and accurately describe the singular environment that encapsulated the lives of the characters. As the reading has been so life-like, I was immersed into the story, camouflaging my identity to the background of the 70s India, where I was one among them- the toiling, sweating proletarians; perplexed moms with hungry little mouths to feed; youths with despoiled ambitions and sprouted political inclinations; beggars and beggar- masters; Ishvar and Om and Maneck and Dina Dalal. “What an unreliable thing is time- when I want to fly, the hours stick to me like a glue. And what changeable thing, too. Time is the twine to tie our lives into parcels of years and months. Or a rubber band stretched to suit our fancy. Time can be the pretty ribbon in a little girl’s hair. Or the lines in your face, stealing your youthful colour and your hair. But in the end, time is a noose around the neck, strangling slowly.”5 stars on 5!-gautam"}, {"userName": "Kris", "userReviewDate": "Feb 17, 2012", "userURL": "http://www.goodreads.com/user/show/5974610-kris", "userReview": "This is a compelling novel. Mistry focuses the story around the lives and interactions of four main characters, who cross paths in an unnamed city in India in 1975 during the State of Emergency. Mistry is unsparing in details of how difficult, even cruel, life is for these characters. Their opportunities are constrained by caste, gender, government corruption locally and across the country, and greed. In detailed flashbacks, Mistry describes the pasts of the characters with such humanity that it's impossible not to identify with them in some way.This is a fast read, in part because of how beautifully drawn the characters are, and in part because you want to read on quickly to discover how the characters will handle the challenges life throws at them. It's a disturbing read as well, because Mistry provides clear descriptions of the violence, greed, and lack of compassion each character faces. At the same time, though, the novel is filled with countless examples of ways, large and small, that the man characters and others help each other, with the most generous sometimes being the characters with the least power and resources. In the end, I came away with the message that, even in the face of prejudice, greed, and hatred, people can survive hardships through loving ties with others."}, {"userName": "Kevin Ansbro", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/43579369-kevin-ansbro", "userReview": "Because it wasn't an unputdownable, hold-you-in-its-thrall, page-turner, this novel took me weeks to finish.My only real issue was that I loved the writing WAY more than the actual story.And what’s not to like about Mistry’s beautifully-crafted prose? I drooled over his penmanship and revelled in his wordplay. Like Rushdie and Shakespeare, he intermingles pathos with humour.The story, though, didn’t grab me by the ears and snog me.Which is why it drops one star."}, {"userName": "Stephen P", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/11602286-stephen-p", "userReview": "A book, along with two others which mysteriously appeared on my living room couch. My wife, equally at a loss had no idea where they came from. No one had been to the house previously, certainly not the dear family friend who just finished A Fine Balance and asked if I would read it. Reluctantly taking a break from Walser and The Tanners, I began my 600 page responsibility to a person who has always been there for us. The book's first four pages were partially folded from use, not to signify any important passage or point. The remainder of the pages were white and crisp except for the occasional single letter or short word erased from use. It wasn't clear whether they were fading or attempting to emerge. No name of ownership or penned notes showed anywhere or any other sign the book hand been read in another's hands.On a good day I can read thirty pages. Immediately the words vanished and one hundred pages were completed each day. Immersed in a foreign culture, India, 1975, under the brutal reign of Prime Minister Indira Ghandi and her State of Emergency, the tortures of a caste system, the mass murders of a government discarding citizen rights and reaching for complete and lasting control, left me as fearful as the characters whose lives I lived. The world of death and torture was hideous, the stench of relentless fear. Other manners of the denial of life emerged more silent yet still brutalizing the living of a life. In small villages in order to provide safety for oneself and one's family life had to be ordered according to one's station as provided within the unwritten sanctions of caste. Aspirations, dreams, uniqueness were sacrificed to live as one was expected to live by the citizen's of the town. The hope flourished that children would follow suite, marrying and having their children quietly dragging the yoke of this life, participating in the small happinesses of the allotted conventions. In the large and growing cities life also was abdicated by the grasp for power where no matter where it was found there was a higher power controlling it, or the striving for upper or middle class existence with its conformity, safety, accoutrements, and agreed upon cliche's which passed off the burden of hypocrisy, the breath-quickened unreasoned reason for the, \"Necessary,\" flood of blood. Precious life was taken, but also discarded by buckling to what others thought, the pronounced model of success, being, \"Right,\" kneeling before the altar of arbitrary convention created to support the edifice of reigning power.The great vampire that sucked the blood out of life was, time. It devoured individuals. Families were crushed, their ways of life vanishing, then vanished. This is the work of the world, the passage of time lost opening to its precarious renewal in different forms. A tragedy in this story is that time passed but did not open onto a new time for the many that might provide a continuation or a new existence with further meanings. Many reached a dead end as did the repetitions of the changing of power in new vestments with old designs of clothing hidden beneath.Yet, there was a woman who defied custom and went off to make a life on her own despite the expectations that she was chosen for success within the fence-lined beliefs of her village. It was always difficult, one obstacle after another, then another waiting in line to follow. She was not the customary hero, nor never sought that trophy. Her heroism was in being herself and trying to survive where odds said she could not. This question hung in the air till near the end of the story, survival. Over time she found unexpectedly a familial love with the two tailors and a young border who lived with her in her small flat. Concern, giving, and caring sprung from people I never imagined could, would. The evil also carried hearts which could warm at times. Did she make the right choice? It could have been easier if she listened to the insistence of her brother and married at an early age, or marry at all. Tough, with all the difficulties she did live her life, patch-worked as it may have seemed to those doing what they were supposed-to-do. Those readers who love quiet heroes, this is a woman to adore, a story to adore, who can adore unexpected small gestures of kindness that flourish tender within bleakness.This is beautiful and seamless writing that does not call attention to itself but gifted to the reader for the telling of this story. As I write I am understanding why when I finished and since, I have been emotionally wrought. I wanted to get back to reading Walser, a newspaper, listening to music, anything. This may be due to something personal within me and my identification with these characters and this story, or the literary accomplishment, or both. Although writing about it has now helped me to understand it there is still no resolution. I sit here embroiled. The past tells me to allow it to rage within and not get in its way. In the end it will open up for me, as great books do, a life with a fuller meaning."}, {"userName": "Whitaker", "userReviewDate": "Sep 20, 2010", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "This book was like a punch in the gut, or a hard kick to the balls. The kind where you double over dry heaving. That's how powerful it was. Mistry's novel traces the lives of four people over the period of about one year when they come together under one roof. That one year is also year one into Indira Ghandi's State of Emergency, declared after the Indian Supreme Court rules her election illegal.There are some excellent set peices. notgettingenough's review describes one. I won't repeat it here, but recommend that you go read what she has to say. My own personal favourite was the scene where the tailors, together with the inhabitants of their shantytown, are forcibly gathered by the police and bussed to a location where the \"beloved\" Indira Ghandi would be giving a speech. The ceremony, filled with much bowing and scraping by her political allies, ends with a helicopter flying past and throwing rose petals on the prime minister. The people pretty much ignore the entire ceremony, cheering only when told to do so. They do, however, get some excitement when the helicopter's strong downdraft causes a large signboard cut out in the shape of Indira Ghandi to fall on the crowd below. Another hardhitting scene occurs several days later when the police and labour contractors come to round up the beggars and poor sleeping in the street. They have clearly been told by the Ghandi adminstration to clear the streets of the poor and give them jobs as part of a \"beautification\" project. What this means is that the poor are rounded up by force, beaten if necessary. When the contractor protests that he can't do anything with injured people, the police officer in charge replies, \"Don't worry, my men know how to hit people without leaving visible marks.\" The contractor pays the police officer, brings the poor to a construction site, and is paid in turn for them. The poor are, of course, forced into hard labour, their only pay being a meagre portion of food and shelter. Slavery, of course, by another name. Other atrocities follow: corrupt officials who carry out vascectomies on old men to meet their imposed quotas, the shantytown gets bulldozed to the ground. All of this brings brownie points to the officials for \"doing their job\", and a little extra money on the side as well. Mistry works a fine balance with these scenes: comedy and absurdity juxtopose neatly with the pathos and despair.In the end, however, I was hard pressed to give this book five stars. I'm docking it one star because the ending didn't work for me. The last third of the book sees the comedy and tragedy heighten to the point of melodrama, which was pitched at a level higher than I would have liked. Perhaps I needed to read it straight through rather than over several weeks, so that the emotional impact would outweigh my difficulty in suspending disbelief. It's wholly subjective, of course, and I would certainly recommend this book as a good read."}, {"userName": "Margitte", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "1975. India. The Great emergency. Martial Law. Murder-on-instinct; survival of the fittest. The old, disabled, the poor - fair game. Political mayhem. Family Planning Program going as insane as the population explosion. Riots, violence, families destroyed. Chaos. A Beautification Program chasing people with bulldozers like unwanted sewerage down the isles of perfection. Their lives worth less than the holy cows meandering the trash heaps and destitution of the destruction everywhere. Despair in abundance. Hope in short supply. A fine balance as futuristic as the abolishment of the caste system. Amidst it all, the two tailors Ishvar Darji, his nephew Omprakash, and the young widow, Dina Dalal, tried to survive and prosper. For an extra income she took in her friend's son, Maneck and together these four people became the axle around which numerous lives and events played themselves out.A beautifully written story of hard-break and hardship on an unimaginable scale. A masterpiece in the historical fiction genre.An excellent companion for this book is 'A Suitable Boy' by Vikram Seth to widen the perspective on what was, and still is, happening in India.RECOMMENDED."}, {"userName": "rahul", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/7747793-rahul", "userReview": "As I scramble for words to speak of this book and even manage to get hold of some. I wait till they fall from my tongue into the depths of infinite hopelessness. And someday, I  hope  these words will find me again. These words, these thoughts will help me accept the  despair that is this thing called life."}, {"userName": "Kelli Oliver George", "userReviewDate": "Mar 05, 2008", "userURL": "http://www.goodreads.com/user/show/46296-kelli-oliver-george", "userReview": "WOW. Beautiful. Haunting. Sad. Compelling. Interesting. Educational. This book covers the stories of four characters living in India during the mid-70s during a time in which Prime Minister Indira Gandhi declares a State of Emergency and in its name, countless human rights violations were committed. I am not sure I can say much that would do this book proper justice. It certainly had what I refer to as The Linger Factor. After I finished it, I sat thinking about it for awhile. When I woke up at 5 am and couldn't get back to sleep, I thought about it some more. I thought about it AGAIN while in the shower. Then later, while I was doing my hair and makeup, I pondered even more points, turn of events and the title (which had so much meaning). This book was not an easy read. The author delves into deep detail on each of the main characters back stories. It was tough going because these people did not live happy lives. However, it was important to the overall theme of the book that you truly get inside each of the characters heads so that you fully understand the reasoning and the extent of their actions and choices. To not give the full history on each of them would have made some of the events appear to be melodramatic and it would have been all too easy to paint certain characters as selfish or even villainous in their choices. Instead, it was heartbreaking, because you understood and could feel the humanity of these characters. You knew them and your heart sank and soared with each various plot point. As in life, nothing was black and white with this book. Again with the \"wow\"."}, {"userName": "Nidhi Singh", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/2034949-nidhi-singh", "userReview": "This was life? Or a cruel joke? He no longer believed that the scales would ever balance fairly. If his pan was not empty, if there was some little sustenance in it for his days and nights, it was enough for him.\nThis is one book that made me want to clutch the life I live, as some blanket of security, and hide within. I have never known what it is to live with such constant uncertainty. That one could be completely uprooted today, the next day, or any day. Each day of struggle, each day of building the hopes for a future which comes undone with the incessant tugs and pulls of life. With my fictional foray, maybe I lived a little of what Om, Ishvar, and Dina lived. Maybe I traced a part of the space they made for themselves. Maybe I felt a bit of what they did. Breathing, fighting, heaving through life. Life hard enough to break one’s bones with the sheer weight of its unpredictability. When one has to collect the scraps of it, weave each day of it, like the patches of the quilt Dina sews. It never seems as bleak to them as it does to me. I can sense the foreboding, the unalterable doom before they can. That it is all so hopeless. But who could have the heart to say it. They are never tired of it; tired of life no matter how much life tires them out. \nWhere humans are concerned, the only emotion that made sense was wonder, at their ability to endure...\nI had never thought so much about the worth of human life. How much it is and how little it is. I could figure their histories buried in the casualties of the Emergency: forced sterilization, governmental brutality, upper caste atrocities. ‘A Fine Balance’ encompasses the tale of many who fared no better than jaded cattle, or bent and battered pieces of old furniture. Men and women, hoarded together, in the slums, in the irrigation camps, on the pavements. Infants of beggars sent away for ‘professional modifications’. There are explicit bodily details, of the infestations, the stench, the odor. The intricate descriptions of the physicality of life, so organism like, which breathes and lives as long as it is permitted to, as long as it is of service. With the barest detail of humanity stripped of love, of kindness, of dignity. In a sense, it is the disposability of human lives. \nYou see, we cannot draw lines and compartments and refuse to budge beyond them. Sometimes you have to use your failures as stepping-stones to success. You have to maintain a fine balance between hope and despair.\nBetween hope and despair, are mostly their quiet dreams, the claim to the future of their liking. To have something of their own in the world, their own space, their family, their children, the success they always wanted, the long-awaited return to their land, the ache for their loved ones, the pride of their community. Then there is the anger; silent and smothered, but it lives. And one knows where it comes from, what provokes it and that it wouldn’t die out. It would strike back only to inflict destruction on oneself. But it needs to be seen and acknowledged and avenged. I felt such helplessness, embarrassment, anger with myself and everything. While I can never stop asking more from this life, they have been denied the very least. Everything about this book made me look towards something I long believed or pretended to be invisible. \nIf there was an abundance of misery in the world, there was also sufficient joy, yes - as long as one knew where to look for it.\nAnd there is beauty in the squalor, hope in hopelessness, strongest bonds formed across insurmountable boundaries. There is an affirmation of life, but not in how everything turns out to be right in the end, how all the good balances the bad. Because that, probably doesn’t or won’t happen. Maybe it lies in the trust and recognition we place in each other. The close family that is formed among complete strangers. Something that Dina, Ishvar, Maneck, and Om built up for themselves. That moment in time would always belong to them, no matter what turn life takes, or how it all concludes in the end."}, {"userName": "notgettingenough ", "userReviewDate": "Jul 16, 2010", "userURL": "http://www.goodreads.com/user/show/2658311-notgettingenough", "userReview": "Maybe this review, about exploitation as much as anything, should have stayed on this site...http://alittleteaalittlechat.wordpres...(I am told some sort of word minimum is necessary on this site. In order to conform....rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb rhubarb)"}, {"userName": "Algernon", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "[ Maneck a suicide, Dina an unpaid servant in her brother’s house, Ishvar and Om beggars on the streets of the big city, one with his legs amputated, the other made an eunuch on the eve of his marriage  (hide spoiler)]"}, {"userName": "Savanna", "userReviewDate": "Jul 14, 2008", "userURL": "http://www.goodreads.com/user/show/1316491-savanna", "userReview": "Unlike many of the Indian novels I have read, this book focuses on the Emergency years under Indira Gandhi. Mistry’s characters live through the terrifying campaigns of forced sterilization and “beautification” (slum destruction). But there is more to the novel than the abuses that occurred during the Emergency. Mistry takes the reader into the world of rural India in the 1960s and 70s where challenges to the caste system often resulted in beating, maiming, and sometimes death. He describes the discriminatory and violent, but sometimes loving, interactions and relationships between Indians of different religions. The bulk of the novel, however, explores the world of India’s urban poor. The beggars in A Fine Balance add a fascinating, disturbing edge to the novel, especially Shankar. The book is mesmerizing, complex, funny, and terribly, terribly sad. It is a consuming work, one that made me hold my breath hoping that the characters would make it through unharmed. Also unlike several of the Indian novels I have read, everything in the story seems perfectly, painfully real. While not ultimately an upper, A Fine Balance is such a complete story, such a beautiful exploration of life in a particular place and a particular time that all the tragedies cannot stop it from being a pleasure to read."}, {"userName": "Jaidee", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/17295672-jaidee", "userReview": "3 \"tragedy diminished by histrionics\" stars.I know this is a good book and that Mr. Mistry is an excellent writer. The use of language is mostly elegant, vivid and the stories interweave in a logical and natural way. There was not a dull moment to be had in this sprawling saga set in 1970s India. The characters were likable and their struggles are real, heart-wrenching and horrendous.I have a HUGE issue though with the presentation of the characters' emotional and psychological lives. Although at times Mr. Mistry got the emotional timbre \"bang on\" (especially in the very moving epilogue), more often the very sad and tragic events were shrouded not only with histrionic melodrama but often really tasteless slapstick that jarred the senses and I was left feeling \"are they going to start in on Bollywood singing and dancing?!?\"Many of my real life friends and by the looks of it my Goodread buddies found this book to be a masterpiece. For me though, this book was a good read tinged with disappointment. This was an excellent story covered in a too brightly colored cloth that was then wrapped with cheap gaudy gold ribbon that was then placed in a too bright metallic basket. Too much bloody glare to really appreciate the true gems that lay underneath!!!"}, {"userName": "Alice Poon", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/28700577-alice-poon", "userReview": "This is one of those heartrending books that would be burned into my memory. The story of the four main characters is told in a calm, understated and sometimes dry-humored tone, but the characters, their poignant back stories as well as the settings just jump right off the page. The whirlpool of corrupt and brutal politics, the inhumane caste system, ethnic hatred, sexual abuses, abject poverty and social despair gives the narrative a pulsating realism that keeps the reader well-grounded in its authenticity.Dina Dalal, a widow trying to live independently of her overbearing brother, and Maneck Kohlah, a congenial college student and her sub-tenant, are from the relatively well-off Parsi community. Ishvar Darji and his nephew Omprakash Darji are from the lowly Chamaar caste of untouchables. A strange twist of fate brings them together under one roof and a beautiful story unfolds of the four skeptics-turned-friends, of the Darjis’ endless struggles with unspeakable tragedies, and of Dina’s and Maneck’s mutual friendship and their compassion and succor for the Darjis.Generally, it is a novel that is unapologetic in its assail against the dark side of human nature, the absurd cruelty of those who wield power and the venom of bigoted conventions. It leaves the reader to ponder whether in the end human goodness will balance out evil.Here are some philosophical quotes that I like:-“A lifetime had to be crafted, just like anything else, she thought, it had to be moulded and beaten and burnished in order to get the most out of it.”“’You see, you cannot draw lines and compartments, and refuse to budge beyond them. Sometimes you have to use your failures as stepping-stones to success. You have to maintain a fine balance between hope and despair.’”“Memories were permanent. Sorrowful ones remained sad even with the passing of time, yet happy ones could never be recreated – not with the same joy. Remembering bred its own peculiar sorrow. It seemed so unfair: that time should render both sadness and happiness into a source of pain.”The novel was a long read (my copy has 713 pages), but worth every minute. I’m giving it 5-stars."}, {"userName": "K.D. Absolutely", "userReviewDate": "Aug 01, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "I have nothing but praise for this book. This is the book that makes me a reader. No matter how busy I am, I will always be a reader if the book that I have is similar to this. Take away my Facebook account. Take away the online games (Clash of Clans, Angry Bird, Plants Vs Zombies). Take away the television (The Voice Kids, Nathaniel, Pangako sa Yo). But give me this kind of book and I will be a happy camper. I can read all day and night in a corner and will not bother you even in a single minute.It is a long novel but the storytelling is straightforward. It is as grand as Salman Rushdie's Midnight's Children (5 stars) but bereft of big words and technical literary pizzazz. Rohinton Mistry (born 1952) seems to be telling us that he can write sad and bleak novel about Indian in a plain simple way so that ordinary readers (like me) can appreciate how rich India is in terms of its culture, politics and complex human dilemma. This is the story of four Indian nationals that happened to be living in the same house: Dina the widow who decides to live in her own by hiring two tailors; Ishvar and Om who are untouchables. On their way to Dina's place, they met Maneck who Dina is accepting as a boarder to augment in the rental of her place. The lives of the four become interwined as they live together and transcends from the cycle of love, hate and love again. As Mistry puts it \"life is a fine balance between hope and despair.\"It is easy to relate to this kind of story for me because I am also living in a third world country that shares the same situations like that of India. We also had Martial Law for a long time during the reign of the deposed Ferdinand Marcos. We don't have the caste system but we have a wide gap between rich and poor people. We also have the assassinations and killing due to politics and religious fanatics. Lastly, majority of our people live below poverty line that they are having a hard time eating 3 times a day or for those with jobs, still find difficulty in trying to make ends meet.Good writing. Simple language (no need to open your dictionary). Familiar characters and situations. Heartfelt if not heart-wrenching scenes. Almost made me cry (only if not because I was sleepy from working too much). A must read! Believe me, you MUST read this."}, {"userName": "Snotchocheez", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "5 stars(completely forgot to review this; too busy trying to un-depress myself).If you were following along with some of my updates for Rohinton Mistry's  A Fine Balance, you might've detected a bit of my cynicism poking through toward the end of this 600 page behmoth novel of India's woes. I was starting to reach a breaking point: how much calcuated heartache could  Misery (*ahem*) Mistry throw at the reader and not expect an emotional backlash? Yeah (Lobstergirl), this is probably one of the most depressing novels I've ever read, but the corollary to this supposition is: for a novel to be truly depressing, it must include characters you care about. And, excavating through the miasma of wretched mid-'70s Bombay/Mumbai/\"The City by the Sea\" (a torrent of filth, poverty, crooked politics and unrelenting caste policies), several extraordinary, unforgettable characters emerge from the effluvia. How can you not be moved by the plight of tailors. Omprakash and Ishvar, desperately trying to stay afloat and ply a trade outside of their fetid leather-making caste; or their employer \"Aunty\" Dina, ever-constantly harangued by her landlord and his goons for running a sewing business out of her flat after her husband tragically dies; or Dina's roommate Maneck, the relatively privileged young man from the Himalayas to attend school, only to be persecuted ceaselessly by fellow residents at a khat-soaked, roach- and vermin-infested youth hostel. (?)It's these four characters (with their backstories, and attendant minor characters: Beggarmaster, Monkey Man, Shankar the beggar with no legs or fingers, the hair fetishist, among dozens of others) that patch together a quilt so heart-rending, I'm not likely to ever forget it anytime soon. I know this might annoy a few people who railed on Katherine Boo's  Behind the Beautiful Forevers but I think both that non-fiction account of the garbage slums in Mumbai and Mistry's novel  A Fine Balance are worthy shelf-mates. I was haunted by them both. There are lessons to be learned in each (with global implications) if only we'd take the time to wallow through the muck to glean them. It probably goes without saying, but  Highly Recommended."}, {"userName": "Himanshu", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/10261330-himanshu", "userReview": "What an unreliable thing is time - when I want it to fly, the hours stick at me like glue. And what a changeable thing, too. Time is the twine to tie our lives into parcels of years and months. Or a rubber band stretched to suit our fancy. Time can be a pretty ribbon in a little girl's hair. Or the lines in your face,stealing your youthful colour and your hair. But in the end, time is a noose around the neck, strangling slowly.\nI have just finished reading this book by an author who wrote the above words; which at one read would seem pithy and intriguing. But then, when you've read the story of the people that Mistry chose to tell you in this book, you'd be contemplating each sentence with a different perspective. You'd end up with a huge fight inside your head, because half of it would want you to renounce all the faith in humanity/system/God itself. And the other half would want you to believe in hope/silver lining because we are so pathetically weak that we need an anchor to go on.Ultimately you'll be in a quest to find A Fine Balance to settle the thoughts and move on.This book is written around one of the most difficult times that India has faced. The time at which we were independent of the British Raj but ended up in Gunda Raj. The time that tested every trait of us humans - Compassion, Honesty, Faith, Love, Friendship, Empathy etc. The time when we failed at each of them.At some points I felt so wretched that I felt I couldn't read one more word. At some others I felt a subtle joy because of the way the characters could find happiness and satisfaction with so little in hand. I got goosebumps when a chapter ended and I read the name of the next one. They could kindle a hope in my heart for the good time to come or they could fill me with dread, as to what now!The Beggarmaster, Monkey-man, Hair-Collector and the diseased Proof-reader were extremely fascinating. Ultimately, the story of the four main characters, a widow, a college student, a chamar-turned tailor and his nephew, was beguiling. Happy to move this to my Favorites."}, {"userName": "Hugh", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "This is about as close to an epic Victorian novel as modern fiction gets. Mistry weaves together the stories of four main protagonists whose fates are thrown together by the upheavals of India's Emergency in 1975. Dina is a Parsee widow, with a rich family but struggling to maintain her independence in her late husband's flat. She employs Ishvar and Om, two tailors taking refuge from their rural community after reprisals following their family's refusal to conform to the expectations of their low caste status. The fourth is Maneck, a young student who lodges in the house. Much of the plot is driven by Mistry's determination to expose the injustices of Indian society and the brutal repression and arbitrary violence of the Emergency. On one level the book could be seen as relentlessly bleak, in that the expectations of the protagonists are constantly dashed. Mistry's characters are masterfully drawn, and there is also a lot of humour and picaresque adventure. My only slight criticism is that, as in many Victorian novels, there are too many coincidences in the chance encounters, particularly those with the peripheral characters, and that the ending seems a little too neat given the chaotic and brutal events that characterise the rest of the book."}, {"userName": "Đông Huynh", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/23518356-ng-huynh", "userReview": "Rất khó để nói cuốn sách này hay \"Những đứa con của nửa đêm\" mới là kiệt tác của năm. Riêng tôi thì thích cuốn sách này hơn, đơn giản vì cách viết thực sự lôi cuốn, đến nỗi khó mà rứt ra được. Cùng với \"những đứa con của nửa đêm\", cuốn sách đã góp phần hoàn thiện bức tranh về đời sống con người ở Ấn Độ trong thời kỳ của \"tình trạng khẩn cấp\", thời kỳ của sự triệt sản, kiểm soát bùng nổ dân số, sự khủng bố, những xung đột về tôn giáo và sự cai trị vô cùng độc ác của giới cầm quyền, dưới quyền \"mụ góa phụ độc ác\" Indira Gandhi.Cân bằng mong manh có thể được xếp vào dạng sách về \"cuộc sống\", vì nó quá thực (với những ai từng chu du trên mảnh đất Ấn Độ đầy lạ lùng, sẽ cảm nhận rõ ràng sự chân thật của cuốn sách này), phong phú và đầy màu sắc của sự sống. Nếu bạn cần một cuốn sách nói về nỗi đau, niềm tin, hy vọng và tuyệt vọng, mất mát và chữa lành, bất hạnh và sung sướng, cuốn sách này sẽ cho bạn tất cả. Trên hết, nó khiến bạn tin rằng cuộc sống mà bạn đang sống là vô cùng may mắn. Nếu bạn vẫn còn thời gian để ngồi đọc sách, uống một ly cà phê, thỉnh thoảng đi đây đó, hoặc đơn giản là ngồi tám với bạn bè thôi, thì hãy tin tôi, bạn đã là người rất rất may mắn rồi đấy! :DP/s: như thường lệ, sách của NXB Trẻ vẫn đắt, và có vài lỗi chính tả (có lẽ đây là thương hiệu riêng của NXB??)"}, {"userName": "Dolors", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "Four people from very different backgrounds cross their paths for a year during the seventies in India, and as we learn of their pasts, their presents and eventually of their futures, we get to know the political and social situation during that turbulent period in one of the poorest countries of the world.I agree with most of the positive reviews when they say that this story is a faithful portrait of what might have been like to live in the India of the 70's and 80's (a complete nightmare), and of course, to show the kind of life its people led there, with all the complicate relationships between them. Social distinctions between castes and tribes, the role of women in Indian society, and their struggle to survive in a complicate moment, just when the country starts to fight for a political independence in a corrupt society. Utterly depressing, if I may say so.And yes, the descriptions are accurate, the setting interesting, and the characters thoroughly developed, which make the story highly believable and realistic, devastatingly realistic. A reality in which the much oppressed population lead miserable lives so that a few can lead luxurious ones, and as the tittle says, reaching a Fine Balance.But then, I think the story lingers and lingers more than necessary, and even with all the dramatic events happening simultaneously to all the characters, I felt detached from the story, maybe because of too many disgraces put together from the beginning. Every time I finished a chapter I thought it couldn't get worse and I was wrong each time, things never improved and I was actually despairing by the end of the book. Even with one of the most supposed-to-be shocking scenes which should shake the reader, I just read through it and closed the last page without thinking twice.So I'd just say that this is a well written book, which will interest those who want to know more about India and its people, but beware, because comparisons can be awful, and I have to say that the book didn't manage to move me the way Vikram Seth's \"A Suitable boy\" did.Maybe the fatalistic point of view of an occidental writer who doesn't really know that life in a place like India can be beautiful as well."}, {"userName": "Sue", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "What to say about such an overwhelming book.It is a masterfully written story of four people who happen to come together in the 1970s in India. Of course there are more than four people involoved in this tale of everyday life, death, misery, occasional happiness, government excess and cruelty in the most densely populated country on earth. The four are: Dina, middle-aged at 30 and struggling to maintain her independence; Maneck a 17 year old student who will take a room in her apartment; and Ishvar and Om, uncle and nephew tailors seeking a living in the city so they can return as successful men to their country homes.This is a powerful and difficult book to read but also, I believe, important for those of us who have not experienced such a tenuous existence, a life with no rights, little future, no real hope, where power resides in the greedy and evil. But still there are wonderful moments of humanity amidst the squalor. There are also eye-opening scenes about the caste system that still remained at the time this book was written. Though the book is lengthy it is so well-written that it passed quickly for me, except when I was slowed by sadness at events occurring. Highly recommended"}, {"userName": "Andrea", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/9582364-andrea", "userReview": "Memories were permanent. Sorrowful ones remained sad even with the passing of time, yet happy ones could never be recreated – not with the same joy. Remembering bred its own peculiar sorrow. It seemed so unfair: that time should render both sadness and happiness into a source of pain.In many ways this sums up the feel of A Fine Balance, which is helpful because it goes some way to explain why I thoroughly enjoyed every page of this epic tragedy. While the disasters kept piling up -- from simple loss to bereavement to full-on torture -- Mistry softened this with humour and with the warmth of the four main characters for each other.This is Indira Ghandi's India of the 1970s; the start of the Emergency, where the poor and the helpless are controlled by government-sanctioned thuggery. Coming together in the 'city by the sea' are: Dina, now in her 40s, poor and widowed after only three years of marriage as a young woman; Maneck, an easygoing student and the son of an old school friend of Dina's; and two tailors, Ishvar and his nephew Om, members of the Untouchable caste, from the countryside.In particular, the story of Ishvar and Om had an almost Homeric feel to it. Their lives were plotted as a series of incidents. The pair seemed to attract misfortune, and as time passed, their misfortunes escalated in degree. How much can two people bear? But they always had each other, and for a time they enjoyed the happiness and security of being part of Dina's unlikely little 'family'.On the surface, Maneck appeared to have everything going for him. A loving family, a level of financial security and success with his studies. But a lingering feeling of rejection by his beloved father is indirectly the catalyst for both Maneck's happiest period as well as his darkest hours.Then there is Dina, a bit of a firecracker as a young girl, but her life is irrevocably changed when her young husband is killed in a straightforward accident. The path Dina chooses from that point is to steadfastly hang onto her widowhood, much to her older brother's frustration. To do this, she builds up some pretty strong defences, and she is perhaps more surprised than anyone when the tailors and the student succeed in breaking them down and contributing to a fleeting period of contentment for her.There are a whole host of curious minor characters too - Worm, the Beggarmaster, Chachaji Ashraf, the Haircollector and even, actually speaking, Sergeant Kesar. Nusswan, Dina's uptight brother, provides a bit of comic relief, like when he met Maneck for the first time (expecting a suitor):Nusswan rose and shot his cuffs, ready to extend a warm greeting to the man who would be brother-in-law. When he saw Maneck’s youth enter the office, his knees almost gave way. His crazy sister had done it again! He clenched the edge of the desk, pale with visions of shame and scandal in the community. “Are you turning into a European, Nusswan? Or are you sick?” asked Dina. “I’m fine, thank you,” he answered stiffly.So the tragedy is not entirely unrelenting, but in the words of Maneck: Everything ended badly."}], "description": "A Fine Balance, Rohinton Mistry’s stunning internationally acclaimed bestseller, is set in mid-1970s India. It tells the story of four unlikely people whose lives come together during a time of political turmoil soon after the government declares a “State of Internal Emergency.” Through days of bleakness and hope, their circumstances – and their fates – become inextricably linked in ways no one could have foreseen. Mistry’s prose is alive with enduring images and a cast of unforgettable characters. Written with compassion, humour, and insight, A Fine Balance is a vivid, richly textured, and powerful novel written by one of the most gifted writers of our time.From the Hardcover edition.", "title": "A Fine Balance", "url": "http://www.goodreads.com/book/show/19302749-a-fine-balance", "average": 4.35, "cover": "https://images.gr-assets.com/books/1386555804l/19302749.jpg", "reviews": 7664, "authors": [{"url": "https://www.goodreads.com/author/show/3539.Rohinton_Mistry", "name": "Rohinton Mistry"}, {"url": "https://www.goodreads.com/author/show/75520.Pico_Iyer", "name": "Pico Iyer"}], "type": ["Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/19302749-a-fine-balance", "http://www.goodreads.com/book/show/5211.A_Fine_Balance", "http://www.goodreads.com/book/show/869425.A_Fine_Balance", "http://www.goodreads.com/book/show/828697.A_Fine_Balance", "http://www.goodreads.com/book/show/774157.A_Fine_Balance", "http://www.goodreads.com/book/show/23300896-c-n-b-ng-mong-manh", "http://www.goodreads.com/book/show/18432941-a-fine-balance", "http://www.goodreads.com/book/show/19661.Family_Matters", "http://www.goodreads.com/book/show/19660.Such_a_Long_Journey", "http://www.goodreads.com/book/show/19659.Swimming_Lessons_and_Other_Stories_from_Firozsha_Baag", "http://www.goodreads.com/book/show/4936164-the-scream", "http://www.goodreads.com/book/show/522485.Threebies"]}