{"ratings": 2367, "userreviews": [{"userName": "Readyourselfhealthy", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/5882716-readyourselfhealthy", "userReview": "This is the story of a boy with severe autism and how getting a family dog helped him to 'recover.' It is an emotional rollercoaster of a story and one that is exhausting to witness. The early years with their son were much more than most parents could endure. What I really like about this book is the fact that it shows what can be done with patience and an unwillingness to give up. This boy had severe autism right from birth and no one could predict what he could one day accomplish. Getting a family dog was not a miracle cure, but one that helped bridge the gap between the son and his parents. They used the dog to communicate with their son, eventually reaching him. I have used a similar approach with my son's Sesame Street characters when I cannot get his attention and it almost always works. These parents are one of the most patient that I have encountered, and it is only by their sheer will and patience that their son does as well as he does. It also gives hope for all with such a severe case of autism."}, {"userName": "Faith Chin", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/6762586-faith-chin", "userReview": "I think this book was A-MA-ZING!!!! I never knew a non fiction book could be so interesting!!! Never judge a book by its cover!!! This book is about, well, the author herself, Nuala Gardner, her autistic son Dale, and a dog that changed their lives. Yes, a dog. The character I'm going to do today is none other than Dale. The first thing you must know about Dale is that he's autistic. Autism is not a sickness but a condition. It's something you're born with. Dale does have autism, but it was so severe, Nuala couldn't do anything to help her son and break into his autistic world. She almost wanted to commit suicide once because she can't take any more of Dale's autism. When Dale had autism, he was just a young toddler and that is when his autism was so great. He'd scream when angry. He'd go crazy. He acts so stubborn and rude. Autism has taken over his body. But as he grew up, things changed a little. He got a new dog. Yes. He named his golden retriever dog Henry after one of the trains in Thomas the Tank Engine show. Henry was a train he really loved. He loved trains. With Henry, he could do anything. Communicate, make eye contact, learn to go potty, eat proper food, take a bath and even say the words \"I love you\". It is very hard for people who has autism to show feelings, especially love. When Nuala heard those words, oh, they were music to her ears and the words she'd finally wanted to hear. When he grew up, of course he acts like a normal teenager. Hanging out with friends, chatting and so on. He became the person Nuala wanted him to be. But Henry has come to an end. Henry has done an awful lot for Dale that made Dale change his life and the person Dale is now. Henry has finally broke into his autistic world and change Dale. When Nuala gave birth to Dale's little sister, Amy, she too, has autism. Dale spend his time helping Nuala with Amy. Henry, he became an old dog. He did an awful lot to help this family and they bid him farewell when he died of a terrible sickness. Dale, can never forget his life with Henry. Holding back tears is hard but I did anyway. People, read this. Just do it. Friends are important to have, but a friend like Henry can really make someone happy. Can a dog this special really change someone's life? The Gardners never knew what hit them, when they found a friend like Henry."}, {"userName": "Lydia LaPutka", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/1628404-lydia-laputka", "userReview": "This book was very enjoyable. I highly recommend it to teachers, dog lovers, and anyone affected by autism. It takes you through many emotions--depression, elation, frustration, heartbreak, joy, anxiety, etc., etc. I think I gasped aloud on several occasions! Any book that elicits that much physical, stark emotion in me is right up my alley. Having had several mildly autistic students in my years as a teacher, I can't imagine parenting one with classic autism. This author poured her heart and soul into telling her family's story. Even now, I can't fully imagine how hard it must be. It's overwhelming and exhausting just thinking about it. I loved that the author accepted a different normal and fought tooth and nail for her children. For me, I would have liked to learn more about Nuala's husband, Jamie. I realize this was her account of their life, but I know Jamie did more than the story explains. Men handle crises so much differently than women, so it would have been fascinating to hear more from his perspective. I loved the end where we got Dale's perspective about his upbringing and challenges. How insightful and profound!"}, {"userName": "Sheree", "userReviewDate": "Dec 15, 2008", "userURL": "http://www.goodreads.com/user/show/1612410-sheree", "userReview": "A harrowing & inspirational true story of the Gardner family written from the mother's perspective in honest, blunt language.This is not a flowery, descriptive telling, it is a matter-of-fact recount of day to day life with a severely autistic child. Nuala & Jamie's fight to have Dale's autism recognised & officially diagnosed, the anger & sadness, the depths of despair reached, the exhaustion & the small triumphs that kept them going. The all-consuming struggle to break into Dale's world in order to give their child a chance at a normal life.I found Nuala's struggle to get Dale diagnosed heartbreaking. She is a community nurse and qualified midwife and many of the scenes she described with the medical profession were unfortunately all to familiar to me when seeking help for my own son.* Doctors acting as if the parents were seeking attention rather than help for their son * honest, passionate accounts of home difficulties were classed as negative responses * factual accounts amounted to Nuala being rather cold and detached* professionals stating that conflict between parents and child causing Dale's behavioural difficulties.It's very distressing when a life that is already such an arduous climb becomes an insurmountable mountain courtesy of so called professionals. On a positive note, there is no substitute for a parent's determination when it comes to protecting the rights and well being of their child. When Dale was finally diagnosed & Nuala & Jamie found the best assistance for him, the years of support & encouragement provided were immeasurable. Of course the momentous breakthrough that unlocked Dale's world came through the friendship & love of a labrador named Henry. Henry helped introduce Dale to many of the normal activities & communications most parents take for granted. The special bond between Dale & Henry was heartfelt and humbling.There was a scene described by Nuala early in the book where she was helping her son cross a busy street. Dale dropped Mickey and half- way across the road a massive head-banging, screaming, kicking episode ensued. It was Nuala's description of onlookers reactions that I found apalling and very close to home. I hope that the honesty of people like Nuala, opening her heart and her life, improves public awareness of these 'unseen handicaps'. Maybe the judgemental & ignorant responses such as \"that kid needs a damn good smacking\" & \"Disgusting behaviour\" will be less forthcoming.In this book Nuala pays tribute to Henry, Dale's grandparents, friends & professionals & their incredible efforts to help Dale in his journey. The ultimate reward watching Dale grow to be the compassionate, well-adjusted young man he is today."}, {"userName": "Donna", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This was nonfiction about a family who watches their young son pulling away into autism. I liked how this wasn't all about the parents and their trials in learning to deal with the effects that autism had on their life. While it did cover that, it was mostly about their son, Dale. And later they had a daughter, and she too was diagnosed with autism. I loved the parental voice in this. They were not perfect. They didn't try to dismiss their mistakes or make all their successes about how wonderful they were. This felt completely honest and authentic. When their son was young, they brought home a dog and they soon realized how this dog was able to reach Dale in ways they couldn't. It was a touching story about how this dog named Henry, made all the difference in the world. I really enjoyed this."}, {"userName": "Jane", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/8231290-jane", "userReview": "This was a remarkable true story. I learnt so much about autism from a mother's perspective and how she managed to unlock the people within her children. It is told with honesty and emotion, an important read for any professional dealing with autism."}, {"userName": "Jackie Lane", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/1885732-jackie-lane", "userReview": "OMG, I bawled my eyes out at the end of this book. I could barely make it through it.This is the story of a boy with autism and how through communication through a puppy/dog, he can enter mainstream society."}, {"userName": "Melissa", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/4368718-melissa", "userReview": "An unexpected loan from a friend, this novel is truly a touching read and I recommend it to all! A Friend Like Henry is about a family's struggle in coping with their son's autism and how a Golden Retriever named Henry changed their lives in ways they couldn't even imagined.I have no experience dealing with autism, neither do I know anyone with autism, but I do know what some of the signs of it are, and reading this novel, I definitely have developed a greater sense of respect for each and every family who has to go through what they do everyday. In this book, Nuala Gardner writes of her joy when she becomes pregnant with her first child and later, of her despair and frustration when her son displays signs of autism. This book is definitely emotional because readers will feel invested in the family's situation. When Nuala was frustrated at the fact that the system wouldn't accept Dale's condition and pretty much placed the blame wholly on Nuala and James (her husband), I felt frustrated too. I cannot imagine what they must have felt like when they were told that they wanted their son to be autistic because they couldn't deal with his slow developmental progress. It would later take them years and the help of friends and family before Dale could get the help and proper diagnosis he required.But in spite of all these adversities, hope came in the form of Henry. I truly believe that Henry was some sort of a guardian angel for Dale. The leaps and bounds Dale made because of Henry was just amazing and to prevent myself from giving anything away, there's all I'm saying. But really, please go read the book. It will give you a renewed hope and who knows, maybe even convince you to get a pet."}, {"userName": "Kalyn", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/11718370-kalyn", "userReview": "Nuala Gardner opens up her family to us and shares the joys and sorrows of raising children with Autism. I applaud her style of not seeking to blame a reason for her children's disability but to use their abilities to expand their worlds. As a special education teacher it can be challenging to work with families that don't carry on the education at home. Nuala Gardner shares her struggles with getting the proper education for her children and unfortunately this can still be a struggle today. This is a must read!"}, {"userName": "Maggie", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/1335578-maggie", "userReview": "Before reading this book all I knew about autism was that those afflicted with it didn't make eye contact and seemed to be emotionally closed off. This book opened my eyes to what autism is, how incredibly hard both the suffer and parents must work so that they get the right schooling and then succeed in that schooling, and what those strange behaviors may indicate that they are suffering. I found this book fascinating and especially educational for me."}, {"userName": " PuMbA's MoMmy*•.♥.•* ", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/4756353-pumba-s-mommy", "userReview": "What a beautiful story. I never thought about the hurdles parents with autistic kids had to go through. After reading this I now realize just how much harder parenting can be for them. Henry came into this family's life at the right time. A dog's love can provide so much comfort to a human being that it's almost mind boggling. Henry was a very special dog to Dale and I am sure he is now his little guardian angel. I suggest readers have tissue handy when reading this book."}, {"userName": "chucklesthescot", "userReviewDate": "May 03, 2010", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "When Dale was born his mother noticed that he had trouble communicating and had behavioural problems.She suspected that her son was autistic but health professionals seemed happier to blame the parents for the way Dale behaved.This is her struggle to be heard and to find a way into Dale's lonely world. Very heavy going and I couldn't keep reading about every tantrum the boy had.I was getting mentally tired with the story!"}, {"userName": "Catarina Vaz", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/51207421-catarina-vaz", "userReview": "This book is very good! It's very emotive! If you get into the story as I did, you'll probably cry a lot at the end. I learned about autism a lot, so I felt much more cult, personally!Also I realised how hard life can be sometimes... but even so, how someone manages to live with so many life struggles.And of course, clearly, dog is Man's best friend."}, {"userName": "Danielle", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/5882183-danielle", "userReview": "Very insightful and poignant. I really enjoyed this book. I have great respect for the Gardners in how they each dealt with the struggles in their lives and became stronger and wiser through it all. The story of Henry and his love and protection of his family was beautiful. Highly recommend this book."}, {"userName": "Zoe", "userReviewDate": "Jan 23, 2010", "userURL": "http://www.goodreads.com/user/show/2482560-zoe", "userReview": "I found this story very touching and was very close to crying many times! The way the parents are treated by other people is digusting and it gives the reader hope because the parents keep on fighting. The book contains lots of feeling and is very honest and open, drawing the reader in. It's easy to read and very hard to put down!"}, {"userName": "Karen", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/1006779-karen", "userReview": "What a wonderful book about a dog that changes the lives of two children with Autism. Yes, it was a heartwarming story about a Golden Retriever, but it was so much more than that. I found myself riveted by the Gardners' story and how as a family they learned about raising children with Autism."}, {"userName": "Jeanne", "userReviewDate": "Oct 18, 2014", "userURL": "http://www.goodreads.com/user/show/8071101-jeanne", "userReview": "I wanted to read a book about how dogs can have a therapeutic role in treating autism. But this book read like someone's annual Christmas newsletter. It was dry and personal and not very informative."}, {"userName": "Pauline", "userReviewDate": "Nov 27, 2008", "userURL": "http://www.goodreads.com/user/show/1689725-pauline", "userReview": "True story of parents coping with autism in their son.A real insight into the plight of parents not getting the help they need and how they fight for their childs rights."}, {"userName": "Miz", "userReviewDate": "Feb 23, 2012", "userURL": "http://www.goodreads.com/user/show/6907245-miz", "userReview": "Interesting look at autism through a parent's eyes. How difficult the situation, but amazing human resilience."}, {"userName": "Teri", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/5697221-teri", "userReview": "Such an amazing story!!!"}, {"userName": "Laura", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/177384-laura", "userReview": "This was a touching story about what a mother, her child with autism, and entire family go through as they help him (her child) navigate the world. Henry is their dog who plays a huge role in helping Dale (their son) begin to communicate and interact with people. The writing was kinda not great though. Also, one thing that bothered me about this book is that the mom, Nuala, is constantly trying to figure out how to make her son blend in so that he seems the same as other, non autistic children. This goes so far that she mentions that as late as high school none of his classmates even realize he is autistic. While it's clearly important for Dale to function well in the world, this all seems to me a negative view of autism -- that the \"solution\" is to make him into someone who appears \"normal\" and to hide his autism from others."}, {"userName": "Natalie Williams", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/45548675-natalie-williams", "userReview": "Although I really enjoyed this book and it was amazing to see the progress Dale made, I just couldn't give it 5 stars as there were certain parts I felt quite uncomfortable about - particularly in relation to not celebrating diversity and uniqueness and instead his parents essentially encouraging him to 'hide' the fact from his friends that he's autistic! I've still got the second book to read though, so I'll see if that changes at all. Like I say, it was a brilliant book but just couldn't give it 5 stars for those reasons..."}, {"userName": "Gillian Wiseman", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/5116832-gillian-wiseman", "userReview": "Very interesting and warm-hearted. Made me want to slap some of the \"professionals\" who caused the author so much frustration. My only real dislike was the author's clear buy-in to the old \"vaccines cause autism\" canard - to the point where they nearly did not vaccinate their daughter - very frustrating to me!"}, {"userName": "Okidoki", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/7103418-okidoki", "userReview": "Min vän Henry: Om en pojkes sjukdom och en hunds helande kraftDetta är den hjärtknipade berättelsen om en familjs kamp för att kunna förstå sin autistiske son och om hur en hund kommer att få en avgörande betydelse. Mitt betyg: Så illa skriven. Inte tillräckligt intresserad av ämnet för att stå ut med långrandigheterna."}, {"userName": "Anargi", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/30786906-anargi", "userReview": "Book Information:Author: Nuala GardenerTitle: A friend like henryPublication Date: 2007 ‘A friend like Henry’ is a true story about Dale, a severely autistic boy, who has difficulty adjusting to his surroundings. He is not diagnosed with autism in his early years, and his family struggles to understand him and him, them. They use many methods to deal with his tantrums that arise from little things that sometimes upsets him. Their biggest challenge is to help Dale understand emotions and to move in society as a regular child. When Dale’s family adopts Henry, a golden retriever puppy, quite by chance, it changes Dale’s world. Dale and Henry develop a special bond and it helps the boy to understand emotions and adjust to his life at home and at school. Henry becomes the tool through which Dale learns. “…suddenly here was Henry, the most amazing, living educational resource I had been given to date- and I was certainly going to embrace the opportunities this provided””(p.135) . The story takes us through the life of Dale and Henry, up until Dale is about fifteen years old. Nuala Gardner, who is also the mother of the main character Dale, wrote this book as an attempt to document her son’s and their family’s journey, and especially to record the amazing progress her son made in life as a child with autism. She may have also written this book as an inspiration and almost a guide for families with autistic children. Another important aspect I see in Mrs.Gardner writing and publishing this story is that it enlightens people about autism and autistic people, who are a widely misunderstood group in society. It is also about the author’s fears for her child and her pain as well. Perhaps she meant for the book to strengthen parents who face similar situations and let them know that they are not alone in their struggles. Nuala Gardner has not demanded change in an aggressive way. However, she does make the reader think and to a large extent change their opinions through the information that she has included in the biographical story. I believe that her intended audience included teenagers to adults. I think that even a 10-12 year old might understand most of the story, but the more complicated aspects of it are probably intended for an older audience. The author of this book is a credible source because it is her own story and her life experience that she has chosen to share with her readers. She has years of experience working with her two autistic children, as well as many families who have consulted her. She is a registered community nurse and a qualified mid wife. She is also an autism consultant who has developed an Autistic Facilitator Dog Program. Her medical background has helped her in dealing with her children who are both Autistic and also helped her in writing about autism through her books. She does not seem to have a particular agenda except education the public about autism. ‘A friend like Henry’ is story written very sensitively about the connection between an autistic boy and his pet dog. It explores the role of a pet in the life of the boy and how it helped him to identify with human emotions and function in society. Gardner does not seem to have any political goal in her writing except educating people about Autism. I feel that she has succeeded in achieving her goals in reaching out and influencing others. This book appeals to both adults and teenagers because it written in simple honest language. Her message is applicable for anyone who is seeking to understand Autism. Further, the author documents Dale’s life, and uses this story to demonstrate that the connection with a pet is a way of combatting the challenges faced by autistic children. I feel that this is the goal she has most succeeded at achieving, because through the life of her son she shows how he grows up to lead a normal life. At fifteen years old, Dale attends school just like every other child, and no one even knows that he is autistic.It is a very convincing story, even to a person who may have never heard about autism, because it is a real experience written in a beautiful and simple manner. This shows that the author’s purpose was not to create a literary masterpiece, but to educate. This book is useful for anyone, and especially for people who are working with autistic children.Although it doesn’t directly relate to me, I feel that this gives me an idea about identifying and about being sensitive toward others who may be going through similar struggles. It is very useful because there are lots of instances in school when children who are different are misunderstood and bullied. Through books like this, I think that children and teenagers learn a valuable lesson in sensitivity, that not everyone is the same as ‘me’. I would recommend this story to everyone, because I think it is an important aspect about the people we may meet everyday that Nuala Gardner has written about. The simple way in which the author has written such a difficult story, captures the emotions and feelings of the characters very well. Overall, I think that this is an excellent book and I would give it a rating of five stars because, it is a uniquely written book which combines simplicity and eloquence."}, {"userName": "Martijn Euyen", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/23765196-martijn-euyen", "userReview": "Ontroerend verslag van een moeder van een zoon die autisme heeft en de rol die Henry de hond in het gezin heeft gespeeld. Gelezen in het kader van ons besluit om een hond te nemen dit jaar. Op heel wat punten veel herkenning. Verdrietig en tegelijkertijd hoopvol."}, {"userName": "Kea Smith", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/23180449-kea-smith", "userReview": "An excellent true story of struggling and love. Wow. Highly recommend!"}, {"userName": "Heather", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/7589439-heather", "userReview": "This story was a very sweet story written by the boy's mother. A lot of relatable concepts and I shed a few tears!!"}, {"userName": "Hazel Hardy", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/82501319-hazel-hardy", "userReview": "An amazing empowering book for anyone to read on how a Mother raised her Autistic Child against all odds."}, {"userName": "Mariana Neves", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/54125969-mariana-neves", "userReview": "Para quem quer entender o Universo de uma criança autista: perfeito! Realmente comovente e cheio de esperança para uma das batalhas mais dolorosas :)"}], "description": "This is the inspiring account of a family's struggle to break into their son's autistic world - and how a dog made the real difference. Dale was still a baby when his parents realised that something wasn't right. Worried, his mother Nuala took him to see several doctors, before finally hearing the word 'autism' for the first time in a specialist's office. Scared but determined that Dale should live a fulfilling life, Nuala describes her despairat her son's condition, her struggle to prevent Dale being excluded from a 'normal' education and her sense of hopeless isolation. Dale's autism was severe and violent and family life was a daily battleground. But the Gardner's lives were transformed when they welcomed a gorgeous Golden Retriever into the family. The special bond between Dale and his dog Henry helped them to produce the breakthrough in Dale they had long sought. From taking a bath to saying 'I love you', Henry helped introduce Dale to all the normal activities most parents take for granted, and set him on the road to being the charming and well-adjusted young man he is today. This is a heartrending and fascinating account of how one devoted and talented dog helped a little boy conquer his autism.", "title": "A Friend Like Henry", "url": "http://www.goodreads.com/book/show/1268313.A_Friend_Like_Henry", "average": 4.12, "cover": "https://images.gr-assets.com/books/1182380014l/1268313.jpg", "reviews": 325, "authors": [{"url": "https://www.goodreads.com/author/show/610897.Nuala_Gardner", "name": "Nuala Gardner"}], "type": ["Nonfiction", "Autobiography", "Animals", "Animals", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/1268313.A_Friend_Like_Henry", "http://www.goodreads.com/book/show/3032014-a-friend-like-henry", "http://www.goodreads.com/book/show/2450517.A_Friend_Like_Henry", "http://www.goodreads.com/book/show/6215672-um-amigo-chamado-henry", "http://www.goodreads.com/book/show/19517466-friend-like-henry", "http://www.goodreads.com/book/show/18460886-mijn-vriend-henry-memoires", "http://www.goodreads.com/book/show/19287613-all-because-of-henry", "http://www.goodreads.com/book/show/28650804-le-chien-et-l-enfant-qui-ne-savait-pas-aimer", "http://www.goodreads.com/book/show/38914143-le-chien-et-l-enfant-qui-ne-savait-pas-aimer", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}