{"ratings": 6108, "userreviews": [{"userName": "Tamara Tilley", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "WOW! I can't believe I found an author I like as much as Dee Henderson. AGAINST ALL ODDS has everything anyone who likes Christian/Romance/Suspense is looking for. When Evan \"Coop\" Cooper, a member of the FBI Hostage Rescue Team, is assigned to protect Monica Callahan-a woman who doesn't want anyone interfering in her life-sparks fly. Those sparks ignite something deep inside Coop. But with Monica's safety on the line, he ignores his personal feelings even though he knows he is falling in love with Monica. Monica, estranged from her father, is angered that her world has been turned upside down. But when she realizes the threat against her life is for real, she relies on Coop to keep her safe. What she's not ready for is the way Coop has invaded every part of her world, including her heart.Irene Hannon has masterfully weaved a story filled with intriguing suspense and dramatic romance. Her characters are rich and warm, and the banter between them as they try to deny their feelings for each other is what keeps you turning page after page. AGAINST ALL ODDS will definitely be cataloged as one of my favorites."}, {"userName": "Hannah", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "Hmmm. I know I read this for the May challenge, but somehow I managed to not rate or review it. Horrors!Monica is a very spunky and memorable character. I love how she's determined not to let this rude interruption into her life ger her down or defeat her. She's a go-getter, even when she's in danger and feels terrible. I'm always drawn to a heroine with such a plucky attitude toward life and hardships.The Christian element of the story is also very well shared; both Monica and her fearless protector have some serious forgiveness issues from their childhoods, and Coop is drawn to her faith by the way he sees her struggle with her need to forgive her father.I've quickly decided that I love Irene Hannon's books, and this is one of the best of hers that I've read so far."}, {"userName": "Stefanie", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/64200589-stefanie", "userReview": "Irene Hannon is a wizard with suspense. I loved book one of the Heroes of Quantico series and I can't wait to read the rest!Coop and Monica were such relatable characters and I could feel the suspense and tension with every turning of the page. Great read!"}, {"userName": "Jeremy", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/1543342-jeremy", "userReview": "A second book that I read because it was a free giveaway on Kindle, I was only aware of the 'suspense' part of the 'Christian romantic suspense' descriptor for its genre when I began reading. The Christian aspects are certainly present, but well-handled (even as a non-Christian reader, I didn't find them overbearing.) The romance, on the other hand, was rather heavy handed, though there was no sex. The main characters were constantly noticing how attractive the other was, and how they'd never felt like this about anyone before. Instant physical attraction and emotional bonds forming between people is something that really shakes my suspension of disbelief in a story -- I prefer to see relationships developing over the course of time, so I found that aspect rather jarring.The author has clearly done some research, though she still suffers from some errors like three million dollars cash fitting into a backpack (it would not) and referring to Afghanistan as part of the Middle East and Afghans as being of Middle Eastern descent (to be fair, there are definitions of the Greater Middle East that do include Afghanistan, but the typical eastern border of the region is Iran.) It would also have been nice to see an Afghan who _wasn't_ a terrorist as an actual character -- I believe there's exactly one of those in the book, and he's basically just a name. Combined with bad guys who are essentially cardboard cutouts who are there to be evil, it's probably for the best that there's not a single mention of Islam to be found.All in all, probably better for the romance fan who likes a little suspense mixed in."}, {"userName": "Staci", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "I've read several Irene Hannon novels written in the past few years. Against All Odds was her first suspense novel. While I enjoy her more recent work better, Against All Odds was a good romantic suspense novel."}, {"userName": "Sarita", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "This is my second book from Irene Hannon and all of her books are now top of my list to read.If you are a romantic suspense lover, you need to read her books. The suspense was good and the detail of the FBI was well researched. Her characters are also written in a like-able way. The build up of the romance is also done in a non-overbearing cheesy way.Monica's father is a hostage negotiator in Afghanistan. Now the terrorists issued a threat against Monica and two HRT operatives, Coop and Mark, is assigned to Monica's protection detail. Something went wrong and Monica's is kidnapped.The way the kidnapping was executed was well researched and came across as possible. I liked Monica, she is an independent strong women but not without her issues. I really like the interaction between her and Coop and loved Coop's partner, Mark and looking forward to read more about him in book two.The lesson of forgiving and reconcile relationships when you still have time came across strongly.I enjoyed this book a lot and recommend it for all romantic suspense readers."}, {"userName": "Joan", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/11965438-joan", "userReview": "I df'd when the churchy-preachy stuff became impossible to skim over. The only character I was really interested in was the father. A predictable story."}, {"userName": "PepperP0t ", "userReviewDate": "May 28, 2011", "userURL": "http://www.goodreads.com/user/show/4859493-pepperp0t", "userReview": "3star read This light Christian Contemporary Romantic Suspense novel wasn’t bad but could have been better. My feeling is more disappointed that it wasn’t better. I did have some issues with it – let’s get those out of the way. Mainly it seemed as if the God/Faith mantra was a little much. Originally it was implied that this would have a place in the story but as a secondary storyline it had too much prominence. That one of the central characters was very religious made this aspect important – but as it bled into other aspects of the story it was a bit much. Secondly the romance portion was going steady – then switched gears – then wrapped up. I felt it was a little disjointed. What there was of the romance was good but it should have been more consistent. Finally the typesetting was off so that some sentences were duplicated or partially duplicated. The good things included the characters although not deeply drawn were likable, the overall plot & storyline were good but not necessarily strong. The complexity of Monica’s character made her interesting but made Evan’s character seem dull in contrast – however it also portrays some real couples"}, {"userName": "Sarah", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/5887927-sarah", "userReview": "I liked parts of this book but there were a few moments in it that weren't so great. I might try another book by this author."}, {"userName": "Byron Ridlen", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/64809787-byron-ridlen", "userReview": "Fun read little slow at times but kept my attention."}, {"userName": "Joleen", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/5543196-joleen", "userReview": "David Callahan was a dignitary in a very high position for the United States. Terrorists holding citizens hostage were demanding things from him before the hostages would be released. Usually this goes unheeded, because giving in to terrorists' demands only means it works, and they will continue to use that tactic, creating even more terror. Callahan had to stick to this resolve, except now they are threatening to kill his daughter, Monica, who, unbeknownst to them, has been estranged from her father for many years. But he still loves her and sees to it a group of FBI agents are assembled to protect her. Coop and Mark are those FBI agents who have the task of informing her of life threatening danger, and to try to get her to a safe house. She is resistant because she's an author and has speaking engagements.But as things begin to happen even in her own house, she's left with no choice but to go to this safe house.This doesn't stop the terrorists from their plot to kidnap her and use her as another hostage. But Coop and Mark both have taken their job seriously and have even become fond of her. Their determination to save her knows no bounds.I liked this book a lot, and I don't believe I've ever been disappointed in anything Ms. Hannon has written. Great intrigue, surprising vulnerability in a man whose trained to be stoic and who needs a solitary life. Satisfying growing feelings between Monica and one of the agents.My only disappointment was how the romance wrapped up so easily, and how neatly the agent set aside his lifelong non-feelings about faith, and need for a solitary life. Yes, there was conflict discussed about it, but he changed too easily into a church-going sweet guy, when before he looked forward to weekends where he could go to bars, get drunk and pick up chicks. It just needed more development, in my humble opinion. But, that aside, it was really well done. The FBI tactics and terrorists involvement aspects were well researched and if I didn't know Ms. Hannon's life was far removed from this sort of life, I would have thought I was reading words from an expert."}, {"userName": "Patrice", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/4681894-patrice", "userReview": "This is a story for our time. It deals with extremists and terrorists. Three Americans are taken hostage in Afghanistan and it’s up to diplomat negotiator David Callahan to get them released. He’s followed the United States’ stance on not giving into to demands from hostage takers. Then in a twist, David is informed by the terrorists that should he not meet their demands, his daughter, Monica Callahan, would become a fourth hostage. More unfortunate is that he and his daughter have been estranged for the better part of 20 years. She wants nothing to do with him and won’t take his calls. This leads to David Callahan to use everything at his disposal to protect his daughter.\tA directive from the White House to the FBI Hostage Rescue Team (HRT) is called in. Evan Cooper, “Coop”, and his partner, Mark Sanders, are brought in to handle the situation. This should be a relatively straight forward assignment, but there is nothing easy in dealing with Monica. She feels that her father is being over-dramatic and that it’s” too little, too late”. She is a published author of self-help books and a professor at the local University in Washington D.C. She refuses to be intimidated by a threat from terrorists in the Middle East and wants the HRT to disrupt her life as little as possible. Coop is finding Ms. Callahan too much of a distraction and can’t figure out what it is about this woman that has him thinking about things he has tried to keep buried in his past and making him question some of his choices in life.Then a very personal warning is left for her and she realizes how much danger she is really in. After that it takes all their know-how and the help of the local FBI officers to keep her safe. They follow all the standard procedures and know they are doing their best, but the terrorist kidnappers seem to be a step ahead of them at each turn. Will David Callahan give in to the terrorist demands? Will the HRT and Coop be able to keep Monica safe? What will happen to the hostages? Will Coop do anything about his new realizations about himself and what part Monica Callahan plays in them?"}, {"userName": "Dora Hiers", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/5298284-dora-hiers", "userReview": "FBI Hostage Rescue Team Member Evan Cooper is content to work hard and party even harder, and with plenty of available, attractive women, he avoids commitments and emotional entanglements...until he's assigned to protect Monica Callahan. Monica's gentle prodding breaks down the barriers he's erected since his mother's death and father’s subsequent emotional withdrawal.Estranged from her father after his abandonment to pursue his diplomatic ambitions, Monica overcame hurt and betrayal, earning a PhD in communications and forging a successful career. If she ever commits to a relationship, she intends it to be with a man who communicates well, someone who doesn't put his career first. Not Coop. But, she finds herself drawn to the quiet, determined-to-protect-her man. I like how Monica, a believer, struggles with the issue of forgiveness towards her absentee father. Considering forgiveness a tenet for Christianity, Coop doesn’t understand, and calls her on it. She admits that’s her biggest failing, and in doing so, opens the door for several conversations. I found her honesty refreshing and their discussions on faith realistic.Monica’s father attempts to reconcile his moral principle of not negotiating with terrorists with his desire to save his daughter. He's never told his daughter he loves her, yet now she hears his unspoken message. I love how this unfolds during the story. Wow! With a fast paced, action-packed, nail-biting plot, you might be tempted to sail through this book in a few hours. But I'd recommend against that. This book is flavored with spiritual and moral issues, juicy nuggets I preferred to chew on for a few days. Although it lacks the physical intensity (um, more displays of affection) I generally prefer, Against All Odds more than compensates in emotional and spiritual depth as love and forgiveness transform Monica and Coop. Action, suspense, a tender romance~this book has it all! Definitely a keeper!Disclaimer: I purchased this book. No monies were received in exchange for my fair and unbiased review, and all opinions expressed are my own."}, {"userName": "Karen Baney", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/5138267-karen-baney", "userReview": "I bought this book because many people say Irene Hannon's books are similar to Dee Henderson's. While I agree that the subject matter is similar, I strongly disagree that her writing style is similar. Unlike Henderson, Hannon repeatedly has the same character thinking the same basic thoughts over and over again when self-reflecting. I tend to read very fast, often reading a book in a day or two, so I don't need to be reminded that a character is thinking or feeling a certain way. One of the things that almost made me put the book down was the frequent head popping between Monica's point of view and Coop's with no line breaks (at least in the Kindle version) to prepare the reader for the shift. There were several scenes throughout the book that did this. I don't mind changing points of view in a scene, there just needs to be some warning - otherwise it throws me out of the story until I can make sure I didn't just totally misunderstand which character's point of view I just read. The overall story was okay. I liked the hint of romance. As far as suspense goes, I thought there were several instances where the suspense was diffused because the author gave too much away. For example, one of the bad guys is talking to another about how he found Monica where the FBI was certain no one could have found her. The bad guy gives it all away. I think it would have created much more tension to leave the reader in the dark until later in the story - let us wonder \"how did they do it?\". That's what I expect from suspense."}, {"userName": "Julie Graves", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/74167-julie-graves", "userReview": "Monica and her father are estranged. Her father gave up his family for his country. Now his job has put Monica in jeopardy. Terrorists have kidnapped 3 American citizens. They have now threatened to kidnap Monica if her father does not give in to their demands.Mark and his partner Evan Cooper(Coop) are sent to protect Monica. They are part of the FBI’s HRT(Hostage Rescue Team). Monica thinks that everyone is overreacting and refuses to go to a safe house. She agrees to let Mark and Coop protect her in her home, but doesn’t see the need to disappear. Unfortunately these terrorists are serious about their need for revenge on both her father and on the United States.Coop and Monica have an instant attraction towards each other. Coop is a man of few words though. Monica has written a book entitled “Talk the Walk” stating that words are necessary in relationships. Monica has a faith in God that Coop does not understand or think is logical. But he is soon to learn that faith may be all that he can trust in when Monica’s life is thrown into even more danger.I liked the action of this book. The story was suspenseful and entertaining. I thought that the issues of faith were portrayed very weakly though. I appreciate a spine-tingling story without all of the cursing and sex that you find in mainstream fiction. I look forward to reading Irene Hannon’s next two books in this Heroes of Quantico series."}, {"userName": "Joan Reeves", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/5232286-joan-reeves", "userReview": "Irene Hannon is a skilled author because she managed to keep me reading to the end of Against All Odds which was a fairly successful marriage of mystery/suspense and Christian sensibilities. I wanted to see how everything worked out. I don't automatically dismiss a book because it's Christian-based fiction, but I don't seek them out either.The problem with this book is not so much the book itself as the public's perception of the hard-as-nails men of a Hostage Rescue Team and the violent terrorists who will stop at nothing to achieve their goals. Men like these don't usually talk as nicely as the characters in this book.Although well plotted with a coherent story, the other problem I had was with that plotting. Without giving away some of the plot elements, I'll just say that some of the events were rather naively portrayed. I have a hard time believing that professionals were just so dense that they couldn't figure out certain things.All in all, Ms. Hannon had a difficult task to write a story like this without the profanity one would think characters portrayed therein would use as well as weaving the element of Christianity into the narrative. None of that is easy. Compelling characters and a compelling story enable one to suspend disbelief, or, at least, to suspend most of one's disbelief.I'd like to see Irene Hannon bring her talents to a more realistic telling of this kind of story."}, {"userName": "⚜️Trea", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/5223520-trea", "userReview": "I'd been looking forward to this book for a while now. Sadly, I wound up a bit disappointed by it. I have to say, the writing was good, and it kept me on the edge of my seat wondering what would happen. However, the pacing felt off to me. The book dragged, to the point where it took me two days to read it and I wanted to DNF it a couple of different times. The characters were easy to connect to and identify with, and the romance that grew between them was actually believable. The religious angle present in the story really wasn't preachy at all. In fact, some of the thoughts and conversations that the characters had really made me think about my own religious life! I am hoping that the flaws in this book are a fluke contained to this book, as the second book in the series was deeply discounted yesterday and I picked it up. It is a 2.5 star read for me, that I am rounding up to 3 stars."}, {"userName": "Jo Notary", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/51531738-jo-notary", "userReview": "337p For FBI Hostage Rescue Team member Evan Cooper and his partner, dignitary protection duty should have been a piece of cake. Unfortunately, Monica Callahan isn't making it easy. Estranged from her diplomat father--who is involved in a sensitive hostage situation in the Middle East--she refuses to be intimidated by a related terrorist threat back in the States. That is, until a chilling warning convinces her that the danger is very real--and escalating.As Coop and his partner do their best to keep her safe, Monica's father triggers an abduction that puts his daughter's life at risk. And with every second that ticks by, Coop knows that the odds of saving the only woman who has ever breached the walls around his heart are dropping. After all, terrorists aren't known for their patience--or their mercy."}, {"userName": "Gerald", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/38933163-gerald", "userReview": "Hmm. I have heard so much about Irene and her romantic suspense prowess. I wasn't disappointed by this one. It was thoroughly enjoyable. I liked Cooper the most and I can identify with the dilemmas of David Callaghan - the tension between career and family.I expected more between the duos of Cooper and Monica but I was satisfied with what I got. I would say that Madam Irene was very deliberate and reserved in her romantic description. Well, she is a Christian and I don't expect her to be vulgar.This was a good read. I plan to read more of her works but I am likely to pick a new series than continue on this one. Recommended."}, {"userName": "Seawood", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/6350127-seawood", "userReview": "Just...no. Which is such a shame because it starts out well and I was looking forward to a good thriller - I liked the characters initially and the set-up was interesting, but before I got 1/3rd of the way through the massive religious agenda was so offputting I had to delete it off my Kindle. It really didn't add anything to the story, and having flicked through the other reviews I'm glad I didn't continue to waste my time. As the saying goes, having a religion is like having a penis - it's great to be proud of it but don't shove it down my throat unless I ask you to."}, {"userName": "Brittany", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/29473258-brittany", "userReview": "I enjoyed the mystery aspect of this book and I liked that the author had you reading from the 'bad guys' view point, so you knew what their plans were though the good guys didn't. I don't think I have ever read a book with that, so that was pleasantly surprising. The romance was a little much in my opinion and most focused on physical attraction. Also, the main lady character was almost raped and the main guy character at the beginning was introduced as a 'wild' seeming guy. So I would give this a 2.5 star rating."}, {"userName": "Rachel", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/24104675-rachel", "userReview": "Very good book! Irene Hannon does a good job on the romantic suspense story. It definitely kept my attention and pulled me into the story! Both the hero and heroine had to do some changing before they could allow their love to happen and they did. Both grew in faith and had to allow themselves to forgive a parent. Can't wait to finish the series. :)"}, {"userName": "Pamela(AllHoney)", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/884792-pamela-allhoney", "userReview": "The first book in the Heroes of Quantico series. Christian romantic suspense. It moved at a good pace and the characters were nicely developed. As a christian romance, I didn't feel it was overly \"preachy\". It focused more on the subject of forgiveness."}, {"userName": "Holly", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/1881626-holly", "userReview": "mostly this book was boring. I did manage to finish it, but just barely. It gets a big meh from me."}, {"userName": "Rebekah Tooley", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/43608220-rebekah-tooley", "userReview": "{3.5} a good clean mystery book with no swearing. Only 1 or 2 semi detailed kisses."}, {"userName": "Amanda", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/7535238-amanda", "userReview": "I listened to this book and had a difficult time paying attention. It was not as action packed as I expected. I also didn't connect with the characters."}, {"userName": "Charity U", "userReviewDate": "Mar 19, 2012", "userURL": "http://www.goodreads.com/user/show/4849122-charity-u", "userReview": "Amazing romantic suspense! I loved this book. Highly recommended. Very exciting!"}, {"userName": "Victoria Lynn", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/51943097-victoria-lynn", "userReview": "It has been a while, but I liked the book. It was a little on the violent side for me, but a good book!"}, {"userName": "Sarah", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/40147342-sarah", "userReview": "[Three Americans are being held hostage by terrorists. They are demanding an exchange, but diplomat David Callahan has a hard line: do not negotiate. At least not publicly. Then the terrorists up the stakes by threatening Callahan's daughter, Monica. David calls in some favors and gets a team to protect her. Even Cooper (Coop) and his partner Mark are the ones assigned. Monica is not happy that her father's career is once again interfering in her life. But slowly, she starts to appreciate how much danger she is in and begins to cooperate more with those assigned to protect her. At first, she refused a safe house, but when her house is compromised, she agrees to go. The terrorists infiltrate the safe house and grab Monica. When Coop and Mark discover she's gone, the agencies go into a frenzy trying to find her. The search isn't really going anywhere until David is granted a phone call with Monica. She is able to work some innocent sounding clues into her chat and a rescue is arraigned. On the other side of the world, an informant spilled the beans about where the hostages are being held and who masterminded it. Two rescue operations going on simultaneously. Monica's rescue gets all the attention and it's intense. Back to David. He was on his way to meet with some important politician and his car is blown up by an IED. He is taken to Germany in critical condition. Despite being in no shape to travel, Monica is determined to go support her dad, with whom she's just started mending her relationship. He put his life on the line for her, the least she can do is be there for him. But she doesn't get the chance. He has a heart attack during surgery and dies.Monica gets some healing through a letter that was found in his embassy office. But there is still regret. Coop is there for her. They are both interested in seeing where this might lead. The epilogue is great. And that's all I'm going to say about it.  (hide spoiler)]"}, {"userName": "Elizabeth", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1110759-elizabeth", "userReview": "I enjoyed this book, even though it's only four stars, but I did enjoy it. I thought it was a nice light read and I liked the characters. The characters felt real and I wanted them to win, instead of the bad guys, so I really appreciated that. I was worried we were going to get sympathetic with the enemy, which would have not worked at all for the book, so I'm glad she stuck to clear lines of good guys and bad guys. Also, I have a feeling that, if you're a fan of NCIS, you're probably going to be a fan of this book and the rest of the series.Also, before I get into my spoilers, which start after this paragraph, I am an agnostic. I did not mind the fact that this had a lot of faith in it. When I started reading, I didn't realize that it was going to have that. I got this as a free book off of Amazon back when I first got a Kindle and I just read synopsis back then of book covers I liked. I really liked the cover and then I liked the plot line. The fact that the faith is there but also in the background until you get to the end, where it is needed in my opinion due to Monica's background, was nice. I want to read more by her because of that and, in a way, not feeling like it was shoved in my face. It was a plot device and treated as such and not preaching to the reader in a breaking the 4th wall way.Ok, now spoilers.That said, this book was a bit on the predictable side when it came to the plot. This is a good and bad thing, because it played into the genre it is in, but you knew certain things were going to happen. The twist of Monica being kidnapped? Yep, that was going to happen. The predictable strand of one of the kidnappers wanting to use her for \"stress relief\" (which, EW). The big bad guy being double crossed because someone didn't agree with him and wanted to get away. The big wrapped up bow of the ending with a marriage proposal - which I did go \"awww\" and loved - but you saw it coming. With big glaring headlights. I think the only big shock was the dad being hit by the IED and then his death. I was hoping that we would get a big squishy make up with dad ending along with Monica and Coop getting engaged but, you know, not to be. It's the only reason that I'm only giving it four stars is because it was predictable.That all said, I want to read the next book in the series. We're going to have Mark as the main character, Coop's partner, and I hope we'll see Coop and Monica's wedding through the book. I kind of like the idea that we're going to hop over to another character instead of testing Monica and Coop's relationship through his job. It seems... well, Monica wouldn't stand for it. At all. It would be a really short book. So, yes, predictable. Is it going to stop me from reading more of her work? Nope! Thanks for reading my review!"}], "description": "For FBI Hostage Rescue Team member Evan Cooper and his partner, dignitary protection duty should have been a piece of cake. Unfortunately, Monica Callahan isn't making it easy. Estranged from her diplomat father--who is involved in a sensitive hostage situation in the Middle East--she refuses to be intimidated by a related terrorist threat back in the States. That is, until a chilling warning convinces her that the danger is very real--and escalating.As Coop and his partner do their best to keep her safe, Monica's father triggers an abduction that puts his daughter's life at risk. And with every second that ticks by, Coop knows that the odds of saving the only woman who has ever breached the walls around his heart are dropping. After all, terrorists aren't known for their patience--or their mercy.Book one in the Heroes of Quantico series, this suspense-filled novel will whisk readers along for the thrilling ride.", "title": "Against All Odds\n      \n          (Heroes of Quantico #1)", "url": "http://www.goodreads.com/book/show/4740496-against-all-odds", "average": 4.1, "cover": "https://images.gr-assets.com/books/1441423349l/4740496.jpg", "reviews": 413, "authors": [{"url": "https://www.goodreads.com/author/show/97710.Irene_Hannon", "name": "Irene Hannon"}], "type": ["Christian Fiction", "Romance", "Christian", "Suspense", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/4740496-against-all-odds", "http://www.goodreads.com/book/show/8122953-against-all-odds", "http://www.goodreads.com/book/show/7723696-against-all-odds", "http://www.goodreads.com/book/show/19098956-against-all-odds", "http://www.goodreads.com/book/show/6630482-in-harm-s-way", "http://www.goodreads.com/book/show/8125734-fatal-judgment", "http://www.goodreads.com/book/show/6326105-an-eye-for-an-eye", "http://www.goodreads.com/book/show/10593071-deadly-pursuit", "http://www.goodreads.com/book/show/15863526-vanished", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}