{"ratings": 2976, "userreviews": [{"userName": "Meredith", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "Dark, eerie, and super creepy! A Game of Ghosts, the 15th book in the Charlie Parker series, is filled with supernatural elements, oddball characters, and of course as the title implies, ghosts.  Tasked by SAC Ross to track down a PI gone missing, Parker; along with Angel and Louis, uncover a sick and twisted inhuman cult-like family known as “The Brethren.” This group is responsible for death and destruction spanning hundreds of years. Currently, the clan is led by brother and sister, Kirk and Sally, who let’s just say have their own special relationship. Sally is tasked with paying off the family’s debt, and must stop at nothing to protect \"The Brethren\" from eternal damnation. However, as Parker gets closer to discovering the secrets of “The Brethren,” the family begins to unravel. At the same time, Parker is fighting with his ex, Rachel, over custody of his daughter. Sam, who possesses her own unique abilities, guided with the help of Parker’s daughter who died, Jennifer, po, is also working to protect her father from the danger of \"The Brethren.\" . Once again, Connolly seamlessly weaves together a complex, multi layered plot. I haven’t read all the books in the series, and at times, was a little lost. However, I was able to eventually piece things together. If you are interested in starting this series, start with book one. Can’t wait for the next book, but in the meantime I need to go back and catch up on the ones I have missed."}, {"userName": "Karl", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "As the next chapter in John Connolly's Charlie Parker exploits hit the floor running with \"A Game of Ghosts\". One realizes just how fond we have become of Charlie and his family, yet having to wait an entire year for the next installment has caused a certain amount of salivation to occur.On a side bar for anyone who might be interested and does not want to wait for the US publication of the book, the series usually is first printed in Ireland or England, If you have an Irish connection, or know of a reliable shop there, a signed hardcover copy can usually be obtained at no additional cost. I ordered mine a couple of months ago from the Book Depository and paid sixteen dollars for the hardcover with free shipping to around the world, and they mail your order on the release day in England. In this installment Charlie is coerced into searching for a private detective named Jaycob Eklund.Jaycob, beyond snooping into people's lives, is obsessed with ghostly incidents in America's history.He has also been hired by the FBI to track a series of homicides and disappearances, each linked to reports of hauntings. Now he has disappeared. Enter Charlie into the picture.I greatly enjoyed this book and would highly insist that anyone interest should begin the series with Book One in order to understand the backstories of many of the players. As always both the innocent and guilty alike are pawns in this highly exciting saga."}, {"userName": "Phrynne", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Book 15 in the Charlie Parker series and I loved every word of it! Everyone who matters was in it, Charlie, Angel, Louis, Sam, Jennifer, even Rachel although if she sinks any lower in my estimation I will be glad if she is not in the next one! Oh and the Collector of course featured largely.John Connolly writes well which makes it a very enjoyable reading experience. This episode digs deeper into the supernatural than we have maybe been before but it was very neatly done. And Sam is becoming a real force to be reckoned with which will be something to look out for in future books.A great book but best not read as a stand alone. This is a series that really needs to be read from book one in order to enjoy it completely."}, {"userName": "Zoeytron", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "At some point, the screaming will end . . . Strangeness abides within these pages.  A series of hauntings, those who wander the paths of the dead, and others who stagger under the gravity of grief.  The Brethren, watching and waiting.  The Hollow Men, with their crispy whispers and voracious appetites.  And Mother. Crochety comment time.  Someone had a picnic in this book, and it was not any of the characters inside.  I borrowed this from the public library, and the pages were full of smears and actual fragments of stuck-on foodstuffs.  Nasty.  Have a little pride when you are reading a book that does not belong to you."}, {"userName": "Liz Barnsley", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "Oh look its that time of year where I’m reading the next novel in the Charlie Parker series from John Connolly, ending up emotionally traumatised (and boy was THAT true this time) then wondering what the heck else I can say that I haven’t already said that can get across the pure brilliance of this series.It really is a difficult one because you end up going around in circles and coming back on yourself then thinking well surely if I haven’t sold it by now its just never going to happen. But we’ll give it a go and I’ll even try and stay relatively sensible about the whole thing. Relatively.This instalment finds Charlie on the hook again to FBI Agent Ross (a man I still haven’t made up my mind about) who sends him off on the trail of a missing private detective. This man, Jaycob , has been messing with things he can’t possibly understand so things are going to get fraught. Well lets face it if Charlie found him in the next town then went home for tea it wouldn’t be NEARLY SO TRAUMATIC. And breathe..I can’t tell you anything else without then having to kill you, but suffice to say the indomitable Mr Connolly takes us on another emotional rollercoaster read, where the ongoing mythology deepens and just wraps you up in that enigmatic something that I have no words for, the current shenanigans are dark and so beautifully terrifying, the storytelling genius just gets me every single time. And THIS time particularly some things happen that had me needing to lie down. I’m still not over it.I don’t know another writer around today that has such a gorgeous, descriptively haunting and brilliantly incisive prose, the scene setting is sublime, the entire time you are just enveloped into this whole other world that feels as real as any you leave behind whilst in it. Emotionally charged readers will understand what I mean when I say life is blurred around the edges slightly when coming out of it and it takes a while to settle down. It is just CLEVER. From the first book to this book and probably on into further books, the quality never falters, every one feels fresh, you genuinely never know where they might take you next. The best crime series out there currently? In this readers opinion definitely. Head and shoulders above the best of the rest.Angel and Louis never cease to be funny yet inevitably flawed, Charlie himself is still facing down the problem of a daughter who may be scarier than he is, more revelations about the underneath of it all are drip fed out to us and overall this was a purely dazzling reading experience which once again left me desperate for more. But I’ll have to wait. I don’t like waiting. It makes me crazy. It’s worth it though. Every single time.Fans of Charlie Parker do not fear. This is everything you were hoping for and more.A note – A Game of Ghosts is book 15 and whilst I’m fairly sure that it might be more helpful to be able to say you could read it as a standalone, I’m afraid I’m often to be found screeching at people NO PUT THAT DOWN YOU MUST READ IN ORDER. There is of course no must about it, each book is a brilliant read and you’ll pick up some of the layers, but genuinely, if you don’t follow the arc’s I feel you will lose a lot of the soul of it. And it has a HELL of a lot of soul. So if you’ve not read these yet, you make your bets and you take your chances but I can almost guarantee book one will hook you and we won’t see you for a year while you burn through the rest (Every Dead Thing is where to start by the way)Highly HIGHLY recommended."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "I read a lot of books, but if I had to pick just let's say five books to read during one year would the latest Charlie Parker book be among them. It strange to think back to the first time I read a Charlie Parker book (not from the beginning) and how I liked the book, but never thought that one day would come when it would be like Christmas every time a new book would be released.So, how was A Game of Ghosts? Well, let me put it this way. This is a series that keep on being great, this is the fifteenth book and I loved it from the first page until the last and I both wanted to end the book and at the same time did I not want it to end.In A Game of Ghosts is Charlie Parker contacted by FBI agent Edgar Ross to track down the missing private detective Jaycob Eklund. However, as usual, it's not an ordinary case, Eklund is obsessed with ghost and his investigation into a missing man have led him to the Brethren, a group of people both of this world and next and Parker, who has a track record of being something of a destroyer of evil people and groups is starting to get too close to them for their liking. And, the Brethren has reason to worry because The Collector is also interested in the case. And, he's not a man to cross. And as usual, has Parker his faithful friends Louis and Angel to help him out.A Game of Ghosts is a fantastic book. I was deeply worried about the life of my favorite characters while reading the book, and the passing of one of them was both a surprise and something that saddened me. I loved the part Parker's daughters Sam and Jennifer played in the book and the ending made me crave more. Definitely one of the best books I have read this year!I want to thank the publisher for providing me with a free copy through NetGalley for an honest review!"}, {"userName": "Debra", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "3.5 stars A Man is a very small thing, and the night is very large and full of wonders. - Lord Dunsany Charlie Parker has been asked by Edgar Ross, an agent of the Federal Bureau of Investigation to locate a private detective, Jaycob Eklund, who has vanished. Eklund has been investigating a series of homicides and disappearances which have been linked to hauntings. Those who are not familiar with John Connolly's paranormal mysteries may be scratching their heads and saying \"huh?\". Connolly is a master of writing mysteries with paranormal elements that make sense, are chilling, often eerie, and yes, haunting. As Charlie Parker, Angel and Louis begin to search for Eklund, his personal life continues to unravel, and he has been served custody papers by his ex, Rachel. Their daughter Sam is still young and has a special \"gift\" which we see more of in this book. She continues to have contact with Jennifer, Parker's daughter who was viciously murdered along with her Mother (Jennifer's Mother/Parker's First wife.) The vicious murder of his first wife and daughter continue to haunt him. Parker is no stranger to pain and suffering. His daughter, Jennifer, continues to watch over him and provides what protection she can. Also looking over everything is The Collector. Series fans will enjoy seeing this character again.Along with Louis and Angel, Parker meets with \"Mother\" and her creepy son, Phillip who had ties to Eklund. Eklund was hired by them and after he failed to make his monthly contact, they became “worried” and are interested in Eklund’s whereabouts. Parker is on their radar and he is on theirs but just how do they tie into the Brethren?aaah yes, the Brethren with their sick and twisted relationships. They are in this world and in the next. It’s the plight of their family and their deepest secret which they want to remain a secret. Parker is getting close, what will they do to keep their secret(s) safe?This book is the 15th in the series and I would not advise reading this as stand-alone novel. Of course, one could do that, but the beauty of this series is the character development/evolution of characters, the ongoing personal issues of Parker and the continuation of his story. I would advise those interested in this series to go back to the beginning. It's worth the time of effort. My first Charlie Parker book was “The wolf in Winter\" and I have been a fan ever since. After reading that book as a stand alone novel, I read some of the earlier books and have continued to be a fan.I do not feel that \"A Game of Ghosts\" was the best book in the Charlie Parker series, but it is a nice addition. As I previously stated, I think John Connolly is a master at writing mysteries with paranormal elements. His books are well written, well thought out, perfectly paced and entertaining. Connolly often has various plots going at once, there is great character development, and dialogue. His books are eerie, chilling and dark while at the same time being intelligent, witty and entertaining. As long as Connolly keeps writing this series, I will keep reading!See more of my reviews at www.openbookpost.com"}, {"userName": "Char", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "[ I am hoping for an entire new series featuring Sam and her  insane  capabilities  (hide spoiler)]"}, {"userName": "CL", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/10871763-cl", "userReview": "I have read every Charlie Parker book and I have loved every one. In this book Charlie Parker is tasked to find a missing investigator and is not told the real reason why. As he gets closer and closer it becomes clear this man was more than a simple investigator. He has been following disappearances and homicides that may go back decades and he has been working with the husband of a missing woman who was missing for a couple of years and whose body has just been discovered and she has not been dead as long as she has been missing. The clues take Charlie and his crew into the path of organized crime and Rachel has started proceeding for sole custody of the daughter. I cannot wait for the next Charlie Parker book. A great read. I would like to thank the Publisher and Net Galley for the chance to read this ARC."}, {"userName": "Bam", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "*4.5 stars. Get ready for a spine-tingling ghost story as Charlie Parker once again delves into the supernatural in this fifteenth book in the series. Who is Charlie Parker? A detective who 'died not once but three times following [a] shooting at his home and was brought back by the physicians. But the man who came back was not the same as the one who had fallen under a volley of shotgun blasts and pistol shots. He had seen what lay beyond, and he remembered.'Charlie is under contract to SAC Ross of the FBI and this time he has been assigned to investigate the disappearance of Jaycob Eklund, a private investigator who has been looking into a series of strange disappearances and murders that he feels are somehow tied to a clan called The Brethren with roots in America's early past whose founder was a charismatic man named Peter Magus. Around 1860, he and his followers would prey on travelers: stealing, murdering and then hiding the evidence. Magus established a settlement for his clan in Capstead near the Mississippi and Missouri Rivers. Eventually their acts of murder and mayhem became so infamous that authorities attacked and most of the clan were killed in a Waco-style conflagration. They became known as the Capstead Martyrs. But a few escaped...Charlie and his two friends Angel and Louis follow the trail of clues, looking into Eklund's life and work. The relationship those three guys have is always good for a laugh. More heavy though are the problems Charlie is having with Rachel, the mother of his child. She is suing for sole custody of Sam but the girl has other plans. And then there's Jennifer; that's on a whole different plane.The cast of characters is fleshed out with some interesting and wacky people along the way--there's the Collector, and Mother, gangsters, and a nosey neighbor, just to name a few. Be prepared to not get much sleep till you finish this one. There's a couple of surprising twists at the end which make me say the Charlie Parker series just keeps getting better and better. Many thanks to NetGalley, the publisher and the author for allowing me to read an arc of this thrilling new novel."}, {"userName": "Sue", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "John Connolly is an amazing writer and Charlie Parker a great creation. This outing contains so many aspects of the mystery, with supernatural overtones, that I appreciate, that it's difficult to know where to begin. First of course is Parker himself with his unconventional life, family and cohorts who might bristle under the title of friends. There is an unexplained disappearance, hints of otherworldly influences, (one of my favorite aspects in suspense novels), mysterious daughter(s). I do have to pick up more of the back story, though my enjoyment of this book was not lessened by my lack of knowledge.As I have been advised by other readers, more experienced with this series, the violence, while present, is not gratuitous and so much of the story is carried out in a more thought-full sphere, as Charlie works to piece together multiple strands of a large puzzle.All in all, an excellent story, well told.A copy of this book was provided by the publisher through NetGalley in return for an honest review."}, {"userName": "Brandon", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "At the conclusion of the eleventh book in the series, THE WRATH OF ANGELS, Parker came into contact with a list containing the names of many evil men and women. Following the discovery of this list, Parker connected with FBI Agent Ross, a man with whom Parker has since struck a deal. In exchange for selected pages over time, Parker is given impunity to seek out and hunt those named. Along with this negotiated freedom, Parker also receives a generous retainer in exchange for his services to Ross and the FBI, albeit under the table.Unfortunately, along with the retainer are requests from Ross for additional work. In A GAME OF GHOSTS, Parker is tasked with tracking down Jaycob Ecklund, a private investigator who recently went off the grid working a case for Ross. As Parker, along with Louis & Angel, begin digging into Ecklund’s life, they quickly become caught up in a web of organized crime, murder and the mysterious actions of a deadly cult that will stop at nothing to protect its anonymity.A GAME OF GHOSTS, the fifteenth book in the series, is the most transformative since the above mentioned THE WRATH OF ANGELS. While dealing with a deadly cult is nothing new for Parker, there are several major moments that will irreparably alter the timeline. Although Connolly has crafted a rich world filled with deeply developed characters, it’s good to know he isn’t just content to coast and is willing to shake things up when needed. I wish I could spill the beans about one of the several shocking events, but I’d ruin it for fans of the series seeing as it hasn’t even been released in North America yet (I nabbed the early UK release).As far as supernatural activity goes, on a scale of one to ten, if the first novel in the series was a one, then A GAME OF GHOSTS is an eleven. Over the course of the series, Connolly has slowly ratcheted up the scare-factor with each passing entry. Now, at book fifteen, we’re seeing Connolly throw realism completely out the window. While I can remember being hesitant initially with this gradual change in direction, I’ve come to alter my opinion as it helps the series stick out and feel different in a sea of thrillers.I am forever grateful to Mr. Connolly for providing his readers with a new installment of Charlie Parker’s story every single year. There are not many authors who can do that yet still keep the quality of their work at such a high level. I’d lament about having to wait a whole year for the next book but then I think of George R.R. Martin fans and well.. it could be much worse."}, {"userName": "Faith", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/17430801-faith", "userReview": "I'm not a huge fan of series, but I have read some of the other books in this series, including the last 3 books, and they seem to be trending more towards the paranormal and less towards the thriller genre, but maybe my memories of the earlier books are faulty. In any event, you shouldn't start reading this series unless you are prepared to devote a significant amount of time to it. The books have been slowly doling out a complicated and apparently endless mythology of spooky and extremely violent goings-on with no conclusion in sight. I keep reading them though because I enjoy the writing style and I like the dialog and interplay among Charlie Parker and his colleagues Louis and Angel. I also like Charlie's daughter Sam and her dead half-sister Jennifer.Charlie is now working on a retainer for the FBI and is asked to locate Jaycob Eklund, a missing private investigator. The chapters of Charlie's investigation are interspersed with chapters dealing with his relationship with Sam and her mother Rachel and chapters introducing numerous characters who are involved in various forms of paranormal events (floating men, precognition, ghostly voices, etc.). My major problem with the book is that there are way too many characters to keep track of. A lot of them are dead by the end of the book, but I was not invested enough in any of them to care. There is also too much paranormal mumbo-jumbo happening here - ghosts, angels, the Brethren, the Collector, the Hollow Men. People who come in contact with any of these are in serious danger.While I like Charlie and his crew, I wanted a more focused plot and fewer characters. I'm ready for the series to reach some conclusion with its underlying supernatural storyline. Enough with the spooky groups of bad guys. Cut to the chase about what is lying in wait for Charlie and let me see exactly what powers Sam has. But I guess then the series would be over.I received a free copy of this book from the publisher."}, {"userName": "Linda Strong", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/13684015-linda-strong", "userReview": "I received only an excerpt .. Chapter 1 only ... of this latest Charlie Parker thriller. Since I have not read all the previous books, I felt a little left out in the cold. And with only one chapter to read, there is a lot left to desire.Charlie Parker meets his employer, Edgar Ross, an FBI Agent, in a restaurant in the middle of winter. Almost the entire first chapter is descriptive of the weather, and lamenting his numerous aches and pains and old wounds.The two men have a drink and order their dinner and then make small talk until the food arrives. And then Parker asks the question .... Why am I here?This could have been any number of books. I found nothing compelling that would draw me in and keep me involved in the story line. I am sure that a fan of this author would not agree.To explain my rating --- It is so difficult to rate an entire book on only one chapter. Unless it was an explosive beginning or a dreadful beginning, I feel it fair to put it right in the middle and let readers of the entire book be the judge. Many thanks to the author / Atria Books / Netgalley for the excerpt of this novel. Opinions expressed here are unbiased and entirely my own."}, {"userName": "Emma", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "Despite hitting number 15, this series remains as brutally, bloodily vibrant as its first offering. Not only that, but things change- this is a novel of transformation, most of it far from good. The strands of recent trauma tighten to life threatening levels, while the hints about Sam's nature become ever more worrying. This many books in and we still have questions, about Parker especially. There are buried truths, and buried gods, which are still to come to light. Or which may yet drag us into the shadows..."}, {"userName": "Bill", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "John Connolly is really at the top of his game with “A Game of Ghosts\". Hands down, the best supernatural thriller series out there. I am always bummed when I finish the latest in the series and have to wait for the next release. I want it now."}, {"userName": "Gatorman", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/3940952-gatorman", "userReview": "Another exceptional entry in the Charlie Parker series with Charlie investigating the disappearance of a private investigator at the request of the FBI man Ross, with a mysterious group known as The Brethren working its way into the mystery. All of the familiar characters are present in this one and the story contains some surprising developments for important characters. Further proof as to why this is the best series out there and Connolly is the best thriller writer alive, bar none. If you're not reading this series you are seriously missing out. 4.5 stars. Very highly recommended for fans of the series."}, {"userName": "Truman32", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/22271857-truman32", "userReview": "Howard “Nippy Zippy” Berg is widely considered to be the fastest reader of all time. Like an alien from deep outer space, or a mutant that has obtained the next level of human evolution, Berg is able to read a blazing 25,000 words per minute. Yet when John Connolly releases a new addition to his Charlie Parker detective series, I feel I have the Nippy Zippy beaten by a good several thousand words!There is just something about Connolly’s Parker thrillers that makes me go full throttle through the pages, all sense of well-being, conditioning, decorum or modesty be damned!A Game of Ghosts, the 15th book in this exceptional series is no different. As always, the riveting plot sucked me right in and soon I was dashing through the story at a turbocharged pace. As I bolted through the pages, trying to find the whereabouts of the missing detective Parker and his cahoots: Angel, Louis, and the Collector were seeking, I made the classic rookie mistake and blew out the IT band in my left eyeball. I had been suffering eyeball fasciitis previously for several months (having to use my peeper foam roller every morning when I got up and every evening before bed), but I guess I still think I’m a young man. Invincible when it comes to gripping thrillers. Well, I’m not. Parker is enlisted by his contact in the F.B.I to seek out a missing P.I., Jaycob Eklund. Eklund has been investigating a number of homicides where the victims had seen ghosts in the days before their untimely demise. These murders have stretched for decades, yet the ghosts that had been detected all look strikingly similar. The Parker novels have great dialogue, a wonderful attention to setting (oddly I seem to have visited/lived in several of the sites visited in the series –I’m looking at you Natick!)that really plants you in the locale. Strong spooky mysteries, and a satisfying sense of retribution (like a prizefight, there is a sense of a buildup between two fighters in these stories. Atonement will be served!) are staples of the series. And this all holds true for Game of Ghosts.While the Parker stories have 15 volumes of mythology and deep underlying questions that would make even George R.R. Martin come up with wild fan theories, one dose not really need to have read the other volumes to enjoy A Game of Ghosts. Which brings me to my only criticism with the novel. Connolly has teased and enticed us for years with these mysteries regarding his characters, yet has been very greedy in sharing any answers. I feel like the testicles of a high school virgin on Prom night after his date abruptly leaves the hotel after party. Stop the teasing now. We need some answers, Connolly, I’m turning blue here!!!!Still, A Game of Ghosts was a great read that finished much too quickly (even with my damaged eyeballs)."}, {"userName": "Chris", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/6316008-chris", "userReview": "I received an advance copy of this novel from the publisher through Netgalley in exchange for an honest review.One of my favorite mystery series with a supernatural element that started out low key in earlier installments and has come more and more to the forefront. Clearly, we are building toward a big confrontation with a barely described demonic entity and stage is being set for the showdown.In A Game of Ghosts Charlie Parker, Louis, and Angel have been hired to locate a missing private investigator who handles cases for the FBI that are too otherworldly for the regular agents to handle. When he goes missing Parker and company is really the only team for the job of tracking him down and bringing him home—if he is still alive, that is. Unlike his predecessor, who worked alone, Parker has the advantage in that he always brings Louis and Angel with him—two guys that always believe in bringing a submachine gun to a knife fight.  And if that trio is not formidable enough (and they are, make no mistake), Charlie brings supernatural weapons as well. He is guarded by his dead wife and daughter. Meeting up with them is very unpleasant if you plan on trying to harm Parker. Also, reprising his continuing role, is the Collector, trailing smoke and the shadows of evil men and collecting up Charlie’s enemies who have corrupted their souls enough to get his attention and feeding them to his hollow men. He follows Parker and always keeps the playing field more or less even, although Charlie and company are the odds on favorite in any fight.This is a “middle” book. As much fun as it is, I feel that it is setting the stage for something bigger to come. And that something involves Charlie’s daughter Sam . If Charlie and his crew are dangerous, Sam is an outright game changer. You get hints of her ability in earlier installments and any character that attempts to attack her or her father is very quickly overmatched. She is being saved, however, I think, for when the heavy hitter arrives. I feel that we have only examined the tip of the ice berg with her.Fair warining: This is the 15th book in a series and I cannot recommend strongly enough starting at the beginning. There are many references to events from the past, all the way back to the very first book. Knowing the background on these wonderful characters and their carefully constructed story arcs brings much more enjoyment than starting in a later volume and then trying to catch up. These are not stand alone novels in my view."}, {"userName": "Michael Hicks", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/6409681-michael-hicks", "userReview": "After taking a backseat for much of the prior book's narrative, PI Charlie Parker returns as the central focus to A Game of Ghosts. Escaping into the works of John Connolly is always a welcome retreat for me, although this fifteenth entry into this author's eponymous detective series fell a bit flat for me.Still recovering, and likely permanently diminished, from the attempt on his life a few books back, Parker is back in action and tasked with locating a missing private eye, Jaykob Ecklund. This investigation leads Parker to The Brethren, a familial organization looking to keep its existence secret.The Brethren also makes this the third book, out of the last four, in which a small, tightly-knit community-type band of sociopaths and psychotics are the central antagonists, following the far more dangerous members of Prosperity, ME from The Wolf In Winter and last year's cultish members of The Cut featured in a A Time of Torment. While there are some cool supernatural aspects behind The Brethren and the psychic visions the females of this line possess, the group are fairly weak villains taken as a whole. On a narrative front, the story itself is a bit too complicated than is necessary, bulkier than it should be, and more than a smidge unsatisfying in its resolution. Connolly loads in a handful of secondary and tertiary characters, including a whole other subplot about the son of a deceased mob boss looking to make inroads into the heroine trade. Ultimately, this latter is a wholly superfluous addition to a narrative that already's stuffed with questionable motives, a series of homicides that may or may not be related either to one another or even the plot as a whole, and everybody's neighbors.On the bright side, Connolly does inject a few surprising shake-ups, including the death of well-established character, and a final twist that puts an extra shade of gray on all that preceded it. The writing is grand, even if the story it services may not be the best, and the usual Parker series staples are on hand - good camaraderie, wry observations, witty dialogue, and enough subtle threats to make you feel mobbed up until the final page. [Note: I received an advanced copy of this title from the publisher via NetGalley.]"}, {"userName": "Raj", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/60424605-raj", "userReview": "Classic Connolly as always! You'd be treated to all your favorite characters, and more. Don't want to give away spoilers , but news awaits hardcore fans of the series in terms of one of the regular Characters........ - there, thats all I'll say! Enjoy the ride! Eagerly awaiting the next installment."}, {"userName": "Taryn", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/1334938-taryn", "userReview": "These are my thoughts after reading the six-page first chapter.Private detective Charlie Parker ruminates about his past as he walks the snowy streets of Portland, Maine. His body has been through the wringer. He's scheduled to meet with FBI agent Edgar Ross at a bar, but he doesn't know why he's been summoned. He doesn't seem to fully trust the man, because he has backup guys listening in.This is my first experience with John Connolly and the Charlie Parker series. The first chapter was too short to reel me in plot-wise, but I am intrigued by the series because I really liked the writing, atmosphere, and the sense of place. It gave me a sense of nostalgia for something I've never experienced! I'm interested in trying one of Connolly's full-length novels someday.From reading the description, I think readers of John Connolly might be interested in John Jenning's graphic novel Blue Hand Mojo: Hard Times Road. Similar vibe!Thank you to Netgalley & Atria/Emily Bestler Books for a chance to read this sneak peek. This does not affect my opinion of the book or the content of my review. It's available now!"}, {"userName": "Mark", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/6755739-mark", "userReview": "Another year and another excellent installment in a new Charlie Parker installment and I must admit John Connolly did deliver once again in an excellent novel that read as easily as usual and the story was as exciting as always and yet light on its feet like a boxer floating like a butterfly and stinging like a bee.Charlie Parker is on some sort of pay-list for somebody in the FBI who really wants the list that Parker has but satisfies himself with having Parker doing a search for a missing PI who also did the occasional work for some people. Parker once again crosses the path of some ancient evil in the guise of men and women that pray on the innocent and have made the mistake crossing the path of an interested partner of a certain federal organisation.Parker and his daughter Sam also have to find a way to make sure that Rachel, Parkers old partner and mother of his daughter, does not do the unthinkable and take her away form Parkers life. Even if Parker does understand why she should do such a thing considering the mess his daughter ended up last novel. But Sam and Parkers dead daughter Jennifer have an idea of their own concerning this matter.Anyhow when Parker goes looking for the missing PI he kicks a hornets nest that starts a cascade of situations that will will end in a showdown of evil versus good in which Louis & angel do their part as does this dark fellow called \"the Collector\"and his hollow men. And again a captivating read that will keep you reading until you are done and realize there is another year of waiting the next installment of the series in which you know an important part will be played by Louis & Angel, Parkers friends and partners in good.If you read this review and want to read the book, my advise to you is seek out number one and read them in sequence and you will savor this novel even better with all the insight you will have. And believe me I am jealous of you discovering such a grand series of thrillers that will certainly enchant you 15 books long and a sixteenth forthcoming.Well advised to friend and enemies alike."}, {"userName": "The Just-About-Cocky Ms M", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/11969567-the-just-about-cocky-ms-m", "userReview": "OK, not the best--the best in this series were the first five books, I thought--but still a very good read. It's amazing that an author can keep a series going to this extent, with little or no lessening of writing craft and style, solid plots, and strong characters not found by the dozens elsewhere.Even after all this time, I simply cannot imagine the denouement of this series, but I certainly plan to be there for it."}, {"userName": "Jeanette", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "John Connolly is a decathlon writer. There are at least 10 different skills he excels at and which are demonstrated here. A thriller, a mystery, a viscous cabal from several dimensions, a criminal mob, a trio of investigators and their employer, FBI tangents, educational prof., psychics which exist all over the place and one who is spacing out at his furniture sales work as he views these things, neighborhood community block group and nosy neighbor set- and that's just the main characters. There's a whole lot going on here. I haven't even mentioned some of the more cut to type under characters. Like Philip the insane. Or ones that have generic names only; like the one called The Collector.Does it keep your interest? OH YES! And the cliff hangers continually make it hard to end that \"read for the day\" or \"hour\". Where to stop? Is it long? VERY! And is it chewy as a moderate Stephen King. Absolutely! More so. The body count is beyond anything I've read in this genre for eons. It's as bad as Chicago was last weekend, an \"off\" one in August- with 63 shot in just a few neighborhoods on the Southside. And they are worried/concerned or offended about stone statues? That's how ridiculous to actual life reality in any sense this book becomes. As well as the absurdity of the Brethren that you have to swallow as possible. For any reader? Well I'd say the horror loving crowd would like this one as much or more than the thriller or mystery people would. Or maybe just all those who like red, mutilated, and burned to black the most.It seems, like within a Stephen King and his entities in the sewers, people enjoy believing in the Boogie Man and his/her associates. If you know your Bible you will recognize the Archangel in this one.But I can't say I didn't enjoy this book. Because he is that skilled at plotting and melodrama writing within the Parker series. Much better than the perils of Pauline interludes that used to be linked at theaters to get you to come back \"next week\". You are entrapped. Within the short, clipped sentences and hundreds of mini rotating chapters. Perfect for the minute tech attention span users too, come to think of it.A Mother that is anything but. A daughter to Parker that has a skill set which is expanding. And a body count that goes into the dozens times two. Most of them in present time telling but many also in the past of those relating memory. Or of finding bodies, or what is left of them by the ghosts.This is NOT a book you want to read if you avoid all occult, demon, or psychic evils. Possibly not even if you are in the Theresa Caputo crowd.I'm going to stick to Bosch with the other Connolly. I left Parker many books ago and wondered why. Now I know. As if there aren't mutilations and horrors enough in this actual and natural Earth world conducted by both animals and humans within world wide news reality."}, {"userName": "Rowena Hoseason", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/29937893-rowena-hoseason", "userReview": "This is the 15th outing for Connolly's PI turned supernatural avenger, and once again Charlie Parker confronts the latest cult of ancient evil to come crawling out of the undergrowth. Like all the best series, the Parker saga is being told in slow time and the overall arc creeps forward infinitesimally with each episode. Connolly delivers a self-contained good vs evil narrative in each book… while dropping huge great hints at what’s really going on with Parker’s mission, his cohorts, and his increasingly intimidating, otherworldly daughter.‘Ghosts’ also does some sneakily sophisticated things which can be obscured by the page-turning pace of the plot. It delivers the comfortable familiarity of a cracking cast of characters, offset by the unsettling strangeness which has become keynote of this series. It explores the gruesome violence of sinister religions, the insidious evil which hides in small-town society, bakes cakes on Saturday, attends church on Sunday, and mass murders on Monday. Simultaneously, Connolly provides a social commentary about the tricky business of marital divorce and disputed child custody. He’s also a dab hand with dialogue. There’s a splendid scene in a diner featuring detective Charlie, hitman Louis and his scruffy, loveable and lethal partner, Angel. The situation is perfectly observed and adroitly delivered: a subtle snapshot of human empathy, full of warmth, humour and stark mortality, deftly smuggled into the subtext of genre fiction.If you’re new to John Connolly and don’t like deviations into the unexplained then you should probably starts back at the beginning of the Charlie Parker series – see if you like the cut of his jib before things wander into the twilight zone. Similarly, those readers who want more old-fashioned detecting and less evil incarnate are likely to be frustrated by the obvious aspects of the uncanny ‘Ghosts.’ Can I suggest you try Steve Hamilton, Giles Blunt, John Sandford or Stephen Hunter instead?But if like me you relish the writing and the ride, then sit back and relax. You're in good hands.9/10You'll find more reviews about crime thrillers over at http://www.murdermayhemandmore.net"}, {"userName": " Olivermagnus  ", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/9919989-olivermagnus", "userReview": "Game of Ghosts is the fifteenth book in a series featuring private investigator Charlie Parker. Parker’s bloodstained past has turned him into a man for whom evil is not just a philosophical concept, but a palpable presence. At this point in time, Parker is working off the books for FBI Agent Edgar Ross. He's never quite sure what Ross' agenda is, but it pays well and he hasn't been asked to do anything illegal. Ross asks him to find a man named Jaycob Eklund, another off the books investigator he's been using who has come up missing. Parker recruits his friends, Louis and Angel, a pair of deadly killers devoted to Parker. They are also one of the high points of the series, providing comic relief while at the same time often saving the day with their incredible cache of weapons. Eventually they tie Eklund to an investigation into a group called The Brethren, evil people who have been living in the shadows for generations. Parker's young daughter, Sam, plays a role in this book, along with his long dead daughter, Jennifer. It appears that Sam and Jennifer are teaming up to play a protective role for their father. There's a strong element of the paranormal in all of the series but it's never done at the expense of a great suspense/thriller. Fans of the series know that Parker is a good man who always tries to do the right thing. Charlie Parker continues to be one of the best drawn characters in fiction. Each of Connolly's books has a great blend of suspense, atmospheric horror and wonderfully realistic characters. The author provides enough of a backstory that each novel can be read alone, but I highly recommend starting this series at the beginning with Every Dead Thing."}, {"userName": "Pamela Scott", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/5554077-pamela-scott", "userReview": "https://thebookloversboudoir.wordpres...This is the 15th Charlie Parker thriller and the books get better each time. I’ve been a rabid fan of Parker’s strange cases since the first book, Every Dead Thing which means I have been reading the author for more than 15 years. That gave me quite a chill. Anyway, I thought A Game of Ghosts was amazing. This book deals with a lot of repercussions of the novel, A Time of Torment especially in relation to Parker’s relationship with his daughter Sam and his already tenebrous relationship with his ex, Rachel. I look forward to seeing where this will lead but something tells me it’s not going to be good. This was quite a dark book. I’ve noticed the books have gotten darker since Parker almost died in The Wolf in winter. I wonder where this will lead. Parker is getting old. Angel is one of my favourite characters and his health is starting to ail. What is the exact nature of Sam’s gift? Who or what is the Dead King? Will he rise? What will the consequences be? I sense the end coming for Charlie Parker and I expect it to be nothing short of spectacular. I thought A Game of Ghosts was amazing and would highly recommend it."}, {"userName": "Lisa Machin", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/32209266-lisa-machin", "userReview": "Just love the Charlie Parker series....cant put the book down and have to read it in almost one sitting! The characters are intriguing and I am always wondering at the relationship between Louise and Angel...will more about Angel be revealed in coming books? What about Sam, what is it that is coming for her? So many questions, cant wait for the next instalment......great reading and you can easily fall back in with the storyline for each new book ( even though the wait is a killer :) - John Connolly is one of my favourite authors and the Parker family feel like friends. Highly enjoyable reading."}, {"userName": "Mommacat", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/9223630-mommacat", "userReview": "I'll be posting my review around the 1st of July. Publication date is July 4, 2017!"}], "description": "Internationally bestselling author John Connolly returns with another superb fusion of noir and the supernatural (My Bookish Ways) in this latest thriller in his gripping Charlie Parker series. It is deep winter and the darkness is unending. A private detective named Jaycob Eklund has vanished and Charlie Parker is assigned to track him down. Parker s employer, Edgar Ross, an agent of the Federal Bureau of Investigation, has his own reasons for wanting Eklund found. Eklund is no ordinary investigator he is obsessively tracking a series of homicides and disappearances, each linked to reports of hauntings. Now Parker is drawn into Eklund s world: a realm in which the monstrous Mother rules a crumbling criminal empire, in which men strike bargains with angels, and in which the innocent and guilty alike are pawns in a game of ghosts...\"", "title": "A Game of Ghosts\n      \n          (Charlie Parker #15)", "url": "http://www.goodreads.com/book/show/31396389-a-game-of-ghosts?from_choice=true", "average": 4.29, "cover": "https://images.gr-assets.com/books/1490834743l/31396389.jpg", "reviews": 342, "authors": [{"url": "https://www.goodreads.com/author/show/38951.John_Connolly", "name": "John Connolly"}], "type": ["Horror", "Thriller", "Mystery", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/31396389-a-game-of-ghosts", "http://www.goodreads.com/book/show/33620314-a-game-of-ghosts", "http://www.goodreads.com/book/show/31351922-a-game-of-ghosts", "http://www.goodreads.com/book/show/33268389-a-game-of-ghosts", "http://www.goodreads.com/book/show/34742955-a-game-of-ghosts", "http://www.goodreads.com/book/show/69136.The_Book_of_Lost_Things", "http://www.goodreads.com/book/show/175242.Every_Dead_Thing", "http://www.goodreads.com/book/show/175246.The_Killing_Kind", "http://www.goodreads.com/book/show/6411440-the-gates", "http://www.goodreads.com/book/show/175243.Dark_Hollow"]}