{"ratings": 31565, "userreviews": [{"userName": "Jeff", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/6252868-jeff", "userReview": "Well, I have to say that I grew up one of the 300 people that lived in Mooreland. I lived there from infancy until about age 12. I wasn't friends with the author (I'm 5 years younger), but I knew who she was. My brother and the author were in the same class together, and he is actually pictured in the class photo from the book (S. Jones). There are several things that I can verify that the author wrote in the book, one that really stuck with me was the neighbor of the author, Edith, who really was a crazy as the author states. I also remember the old school that I went through until after first grade. It closed then and the kids were shipped off to a consolidated school several miles away. The veterinarian, Doc. Austerman is still around, and continues to give my dogs their rabies shots every year. Mostly what I remember is her mother. By the time I knew her well she was a teacher, and probably ranks as my favorite teacher ever. She was instrumental in turning me into the reader I am today. I said all this to let anyone reading this know that I am a bit biased. That said, I really had a good time reading this book, it brought back a lot of memories, not just of the authors life, but of what was going on in mine, a few blocks away. I strongly recommend this book to anyone. You won't be sorry."}, {"userName": "Tracyj", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/2601643-tracyj", "userReview": "I was really put off by the amount of animal abuse throughout the stories. No animals were spared - pets, farm animals, wild animals, animal corpses - they all got abused in Zippy's world and it was all described in a rather nonchalant matter-of-fact manner. Just when you think you're reading a story that you're safe from the horrors of an another animal meeting with cruelty at the hands of the nuts in Zippy's world, she manages to slip one in. In a story about her sister, she writes \"Petey Scroggs starved a rabbit until it ate its own paw.He showed it to me.\" I'm sorry, was I supposed to find this funny? Given the large number of positive reviews of this book,many people did. What do I know - I'm one of the few who thinks Michael Vick should be cleaning up animal feces in an animal shelter instead of being considered for NFL MVP."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nI should probably leave well enough alone and not post any sort of review regarding little Zippy, but I’m not gonna. I’ve been seeing this title pop up on various lists and whatnot for YEARS now and always managed to avoid it due to the eternal question I ask myself whenever I see a memoir written by a non-famous person: “WTF was so special about you that you think everyone else wants to read about it???” But then the dang thing came back again when I was perusing the Faceplace and saw my library’s weekly question post, which this time around was “what’s the last book you read that made you laugh out loud.” Some of the answers provided by rando strangers on the interwebs I agreed with, some made me want to find out where they live so I could go smack them around a bit for obviously being super unfunny people and probably a real drag to hang around with and then there was Zippy. Again. I popped over to GR and saw my few friends who had read it had enjoyed it and then I noticed reviews from others. Those people belong in a category I like to call . . . . \nIt didn’t take long for me to figure out this might be my type of memoir when on Page 2 I discovered the author’s sister’s reaction when she discovered Haven Kimmel planned on writing about growing up in their small town was . . . \n“I know who might read such a book. A person lying in a hospital bed with no television and no roommate. Just lying there. Maybe waiting for a physical therapist. And then here comes a candy striper with a squeaky library cart and on that cart there is only one book – or maybe two books: yours, and Cooking with Pork. I can see how a person would be grateful for Mooreland then.”\nSince I had already read Cooking with Pork myself, I figured what the hell. And what did I find? First, I really did laugh out loud and second . . . \n“It’s a memoir, and a sigh of gratitude, a way of returning.”\nI spent nearly the entire book trying to figure out why (aside from the fact that a lot of pieces of Zippy’s life – especially those of the camping variety - seemed to mimic my upbringing) I was having quite the spell of déjà vu all the way up to the last page when finally it dawned on me . . . . . \nAnd speaking of that last page. Dammit woman!!!!!\nWTF? I thought I was signing up for something that triggered everybody and their brother, not one that made my eyeballs get tingly with happy tears about dogs as Father’s Day presents or the most magical Christmas ever.Now, before you go putting this on your TBR, here are some things I know almost for certain about the people who will be able to enjoy this book: 1. They need to be a bit long in the tooth. This is the story of a girl who was brought up in the late ‘60s and early ‘70s. It’s not what you would call “politically correct” so the younger generation will definitely find 1 or 12 things to get worked up about. 2. They need to be familiar with small town life. We’re talking about real small town life – Zippy grew up in a town with a population of 300.3. They have to be able to differentiate between animal abuse and (i) farm living as well as (ii) the foreshadowing that your neighbor Petey Scoggs might grow up to become Jeffrey Dahmer.4. An appreciation of this statement regarding food groups as being gospel: \n“fried, meat, bread, coke, and ice cream. She was an excellent cook.”\n A first-hand knowledge of the difference between a FryDaddy and a FryGranddaddy is also a necessity.5. A pretty iron stomach, being raised with an aluminum Christmas tree (and if you were rich, the accompanying color wheel) in your house (and not because it’s awesomely “retro” now – even though I agree it is), knowing how bad it sucked to have to “ride the hump” or sit in the “way-way back” of the Family Truckster on road trips, and quite possibly have your only braggable talent being that you could \n“sing along with every word of a complicated song”\n (for Zippy, it was the “canticle part of Scarborough Fair” – for me it was We Didn’t Start the Fire by Billy Joel).Did you answer in the affirmative/take a trip down memory lane with respect to all of the above? If so, maybe you should give this one a try . . . . \nIf not? Well, go ahead and fill this out in triplicate and Shelby will be with you shortly . . . ."}, {"userName": "Heather", "userReviewDate": "Nov 08, 2007", "userURL": "http://www.goodreads.com/user/show/609784-heather", "userReview": "This is one of the most enjoyable books I've ever come across. I tore through it, often laughing OUT LOUD in inopportune public places (you know, when you are reading something funny and you kind of guffaw and then catch yourself, stifle the laugh, and look around to see if anyone is watching?).It's hard to explain what it is about, because it is really just what the subtitle says: \"Growing Up Small In Mooreland, Indiana.\" It's an autobiographical collection of impressions, moments, memories, funny stories, dares, characters, struggles, and ephemera from the childhood of a unique & hilarious girl (nicknamed Zippy) as she goes about her days in the late '60s/early '70s in a very small town. Sounds like a totally touchy-feely Babysitters' Club premise for a book, right? But it is intelligent, well-written (she really captures the voice and the perception of herself at 7 or 8), emphatically NOT-schmaltzy, and funny as all get out. And also shreddingly poignant at times when you least expect it. I bought this for all my friends one Christmas after reading it; it's that good, you just gotta share it."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "This is a memoir of childhood days, growing up in the 1960s and 70s in the small town of Mooreland, Indiana (pop. 300). Lots of quirky or downright eccentric characters populate the town and the pages of this book. There's no real plot here; it's pretty much a collection of small town stories and anecdotes. Some of the stories involve animal neglect or abuse, the thoughtlessly cruel kinds of things that many small town people didn't consider really wrong back in the day, so sensitive readers beware. People's foibles, faults and troubles, like her family's poverty, her mother's depression and her father's alcoholism, are all seen through the childish eyes of the narrator. Even at a young age, Zippy is dubious about her religious beliefs, especially when she's forced to go to her mother's Quaker congregation every Sunday; she'd rather worship in her father's Great Church of the Outdoors. How you feel about someone questioning Christianity in humorous ways is another thing that may affect how you feel about this book. It occurs to me, in fact, that this book has a lot of different possibilities for offending people.There are also a lot of stories involving teasing and small cruelties that may strike you as terrible or humorous, or both, like when Zippy's older sister (falsely) tells her that she's adopted, and Zippy, who's maybe 8 or 10 years old, goes to ask her mother:\"How could you not tell me I was adopted! Don't you think I have a right to know? And who were my real parents anyway?\" I was trying to be mature, but periodically spit flew.\"Gypsies, honey.\" She still had not looked up from Isaac Asimov Explains the Whole of Reality and Then Some.\"Gypsies? Really?\" This was somewhat compelling. I sat down.\"Yes, I thought we managed a very wise trade. . . Plus, you were born with a tail.\"I looked at her, completely speechless, my mouth hanging open exactly like a creature with a tail.\"We had it removed so your pants would fit.\"The most poignant story, for me, was near the end of the book (this isn't really a spoiler because there is no real plot, but if you want to read the book yourself, you may want to skip this next part): A local man, Mr. Sewell, begins to teach some of the elementary students how to play various band instruments. He volunteers to give Rose, one of Zippy's friends, private lessons after school once a week. A little later Zippy is spending the night at Rose's house:We were mostly not talking, when Rose scooted over closer to me and whispered, \"I'm scared of something.\" I whispered back, \"What?\"\"I don't want to do private lessons with Mr. Sewell any more.\"This didn't surprise me, because I never would have wanted to do it in the first place. \"Why? Is it boring and stupid and you'd rather be outside?\"\"No.\" Rose didn't say anything for a long time. \"I told my mom, but she thinks I'm making it up or being silly.\"\"Making what up?\"\"I'm just afraid. He . . . never mind. Forget it.\"The next time Mr. Sewell comes, Zippy stays after school, telling him that she's required to wait for Rose and walk home with her. At the end of the private lesson he offers the girls a ride home, \"but we turned it down, even though we had a long, long walk ahead of us.\" The capper is that Zippy tells another friend, a devout Christian, that she's a failure at doing good deeds and helping others. \"Good works just aren't for me.\"This memoir is often humorous, occasionally ironic, sometimes poignant, frequently insightful.3.5 stars."}, {"userName": "Susan", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/2429588-susan", "userReview": "I'm done with the small amount I read of this book (25 pgs). I stopped when Zippy and her friend took home a little piglet to nurse. When said piglet died, friend swung poor little piglet over fence to feed vicious dog. And all the author commented on was what a perfect arc the little dead body made before it cleared the fence.This is not something I read for my enjoyment time. Shame on the author for writing this tripe."}, {"userName": "Jonathan", "userReviewDate": "Jan 12, 2008", "userURL": "http://www.goodreads.com/user/show/91339-jonathan", "userReview": "[Ack -- 3 out of 5 stars seems so vague, as meaningless as ratings in general; 3 out of 5 is so ... Rolling Stone.]Anyway, true or false: Are male memoirists seen as witty, pithy, and insightful while female memoirists are derided as self-involved or -indulgent? Food for thought, and not just pertaining to lit. I have everything in mind from Anne Lamott vs. Donald Miller to Justin Timberlake's career arc vs. Janet Jackson's relative plummet (think Super Bowl '04).Now to this memoir about \"Growing Up Small In Mooreland, Indiana\" (subtitle): It's not at all necessary, and it's thoroughly amusing. Kimmel's vignettes of her childhood spent as a strange bird surely make up for not having spoken a word until age 3. She unloads on her immediate family, on her childhood chums and (un)patient schoolteachers, and on her fellow parishioners at the local Quaker church. And on all the crotchety old people (the drugstore owner, the lady with 68+ animals) in the much-afraid way that only a child can.These dispatches, worded cleverly but mostly through the speak of a 5- to 9-year-old girl, let her get away with saying what she will about the people. Over 275 pages it makes for one round of chuckles after another, as Kimmel largely uses her gifts of wit and wording for the powers of good.You can see why her book rankled some townspeople, though. Some of the bits seem like they simply must be distorted or embellished; they're Sedaris-esque in that respect, but in defense of that, this isn't a historical document. People like this know that laughter can still be a brand of medicine. Others among her stories just have to be true, such as the account of her brother, late for the school bus, ripping the bathroom door off its hinges and forceably removing their sister from the sink. (Holy empathy!)Kimmel's parents are the best-drawn here. Meanwhile her older sibs, Dan and Melinda, are given relatively short shrift. Sometimes she began an anecdote about one or the other, and it just trailed off or ended without the depth into their beings hoped for. Ah, well. So it goes when you're 7.“He was tall and muscular, but lean, and he unconsciously flexed his jaw muscles all the time, the way some people jingle the spare change in their pocket. Of my parents’ children my brother fared the best, genetically speaking, and was in fact so handsome that both Mom and Dad were reluctant to take credit. Regardless of the fact that he was beautiful, and should have had every advantage because of it, the world was not right for my brother. There was some standard by which he measured everyone, all human activity, without articulating it or giving us any clue where we were going wrong. He was silent and furious nearly all the time. Girls were crazy about him.”She's a bit smug about her own unbelief when it comes to the local Friends, and to a so-holy classmate or two, but a couple of the briefs on her religious upbringing (all while adhering to nothing really) are poignant.Could've done without the slightly disturbing image of Jesus accompanying one chapter, but a lot of the other photos are just classic. In the end, she's penned a breezy, decidedly happy childhood memoir (holy rarity!), and I'm glad she could get it out of her system and, however briefly, lodge it in mine.“I had some disappointments with Santa, but not many. The only clear one I remember is the year I asked for a Skipper doll, who was an early, extra-perky friend of Barbie. Nobody had Barbies in Mooreland, and this could have posed a problem for the social Skipper, which might have been what Santa was thinking. Skipper was not the kind of girl to thrive in solitude. She wasn’t doing much looking inside.”"}, {"userName": "Jennifer", "userReviewDate": "May 17, 2007", "userURL": "http://www.goodreads.com/user/show/84676-jennifer", "userReview": "This is the book I reach for when I need a pick-me-up...a reminder that life is humorous and wonderful and that even the everyday moments are meaningful…that even the quietest, smallest life is worth living. Haven Kimmel's childhood memoir is more than a stroll down memory lane...she pieces together her life, her family, and her town until the reader sees her so clearly, you may feel convinced afterwards that you grew up with her! The writing is sharp, witty, and refreshingly uplifting. You will read \"Zippy\" and want to return to Moreland, Indiana again and again."}, {"userName": "Ashley", "userReviewDate": "May 01, 2008", "userURL": "http://www.goodreads.com/user/show/1089142-ashley", "userReview": "I had completely mixed feeling about this book. One minute I was laughing out loud (I loved the part when the cat falls down the chimney and gets drop-kicked out the front door by the nast old lady neighbor), because there are some awfully funny bits, and the next I was feeling very awkward and wanted to escape this girl's terrible environment. What is wierdly endearing though is how she seems to be blissfully unaware/unaffected by events any one of which would have caused me some emotional scarring as a small child (I had an admittedly sheltered, probably too sheltered childhood). What this book did do for me though was make me feel like a better parent. At least my kids aren't sleeping in sleeping bags on the couch every night. On the other hand though, I do think that the message of this book is that no matter what Zippy's environment was like she did seem to know that her parents loved her."}, {"userName": "Indra", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/1237939-indra", "userReview": "I just reread this book and remembered how much I love it. I give it five stars even though I like the sequel, \"She Got Up Off the Couch\", a bit better...both are so very beautifully written. I love the narrator's clear-eyed child's view of the people around her, and the fact that this tells the story of a different world than most of us know, the mostly idyllic small town many years ago. Serious issues are hinted at, not avoided, but neither are they dwelled upon. I loved the characterization of Zippy's family, particularly her father, and also that of her friends, since friends are such a huge part of the universe to a kid in grade school. I think my favorite section in the entire book is the section called \"Baby Book\". It's laugh-out-loud funny and sweet, just like Zippy herself."}, {"userName": "Arminzerella", "userReviewDate": "Dec 28, 2008", "userURL": "http://www.goodreads.com/user/show/1769011-arminzerella", "userReview": "This is an absolutely hysterical down-home kind of memoir of Haven Kimmel’s growing up years in Mooreland, Indiana. She’s goofy and strange, and full of spunk and energy. Listen to the audiobook, which is read by the author, as she really brings her own experiences to life. She’s got a childlike innocence still that resonates in this work. The scene where her dad borrows all of the hunting dogs to get back at a cranky neighbor is truly one of the most amusing things I have ever heard. This is not one of those “just the facts, ma’am” kind of memoirs – rather, it’s a collection of stories told by a most entertaining storyteller. I’m so glad she was brought to my attention."}, {"userName": "Rebecca McNutt", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "A Girl Named Zippy is a great book, not necessarily unique in its trip down memory lane but still a vibrant and sometimes humorous look at 1960's America from the eyes of a child who lived it."}, {"userName": "Suzanne", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/3695758-suzanne", "userReview": "This memoir is 30 very short chapters, stories about Haven Kimmel’s odd family and even odder townspeople in Mooreland, Indiana, in the 1970s, a book about a little girl growing up in a very small town. It had me reaching for the tissues a few times, but not because it was sad. There were some touching episodes, but the Kleenex box came in handy for the several times I laughed so hard the tears were streaming. I was thankful I was at home each time I came to one of those passages, and not in public, because you know how sometimes when you laugh really hard, it can be hard to stop? Told in a unique and wacky voice, this is an entertaining palate cleanser if you need a break from the dire news of the day or weightier, artsier tomes."}, {"userName": "Amber", "userReviewDate": "Dec 01, 2007", "userURL": "http://www.goodreads.com/user/show/625328-amber", "userReview": "Zippy was a mottled mess of mixed up and metastasized memories. The whole time I was reading it I kept wondering why it is that I liked it. But I did like it, despite it's obvious flaws. Any book that can make me laugh out loud is worth reading. I enjoyed the author's flippant, unceremonious style of writing. Her character, Zippy, was bright and reckless, loveable and startling all at the same time. I found it interesting how well she wrote from a teen, tween, child's perspective. I got sucked into seeing her world through her eyes and had to force myself to remember what I was reading. When I think about the book now, I am much more objective about it and critical of the \"true life\" characters...Like Zippy's insane mother? I could go on. It is interesting the details the author goes into in describing a particular scene because the most \"important\" things she says are very written so briefly you could almost miss them. Ironic. Like the subtle hints she drops about how unhappy her sister is, how detached her mother is, how poor they are. I think I need to read this book again. And then I'm like \"What? Why do I want to read it again? Why did I like it?\" And I just sit here perplexed."}, {"userName": "Anne-Marie", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/558379-anne-marie", "userReview": "I had one of those weekends where every book I started was a complete disappointment.This thing has been floating around my house forever and I was finally desperate enough to read it. The first chapter or so was promising. Her parents thought maybe she was \"special\". She is anything but.I don't know, it was kind of like she was trying to pull of some David Sedaris moves and failed miserably. I had trouble even concentrating on this thing. It was disjointed and not funny. At all. She kept talking about people torturing animals. Ugh.There was this part where she was like, \"my dad said he was going to turn me upside down and spit in my butt.\". I think I would have kept that one to myself."}, {"userName": "Elizabeth", "userReviewDate": "Feb 21, 2008", "userURL": "http://www.goodreads.com/user/show/126327-elizabeth", "userReview": "I was really, really disappointed with this book (I only read half of it). I had really liked Haven Kimmel's Something Rising Light and Swift, so I thought this would be great, adn I read all sorts of great reviews for it too! But only halfway through, her memoir mentioned SO many times about animals and pets being harmed, killed, neglected, and so on... I know that in that type of lower small-town rural environment, pets are not coddled like they are today. But I found it really strange why she had to put into her memoir SO many poor animals and their horrible fates! It very much turned me off of reading the rest of the book. Really a disappointment."}, {"userName": "Laurie", "userReviewDate": "Oct 22, 2009", "userURL": "http://www.goodreads.com/user/show/2866200-laurie", "userReview": "I did not like this book so much I threw it away rather than swap or donate. During Zippy's childhood in rural America almost every chapter/event involves animals getting killed and I'm a real animal lover. I just don't think it's funny because it came across that the value placed on these animals lives is minimal. They died in fires, from neglect, etc. so there was nothing completely intentional but I could not appreciate this story."}, {"userName": "Desiree", "userReviewDate": "Jun 04, 2008", "userURL": "http://www.goodreads.com/user/show/1212011-desiree", "userReview": "This book is guffaw-out-loud-on-the-subway-despite-the-stares funny!!!From the book...\"The distance between Mooreland in 1965 and a city like San Francisco in 1965 is roughly equivalent to the distance starlight must travel before we look up casually from a cornfield and see it.\" (From A Girl Named Zippy, p. 2.)Haven Kimmel may be older than me but we both grew up in small towns and I found her literary musings about said life to resonate very deeply. I remember growing up in rural Maryland and feeling like many worlds must have existed between me and anything even remotely interesting (which may explain my exodus to NYC)...But where small town life may lack the urban culture of museums, dive bars, art houses, coffee shops, student centers, indie film houses etc...there is a certain something about looking back with Zippy on the quirky neighborhood folk she grew up around and her reminiscing about church socials and fire hall bingo that makes a small town gal feel, I dunno, grateful? And might even inspire a little jealousy from a \"city-fied\" readerThe book is very charming, I particularly enjoyed her writing about her father and his \"church in the woods\"Ms. Kimmel writes how Norman Rockwell painted, Americana at its absolute apple pie-eating best. I ended the book and felt at peace about and even happy being born and bred in small town America...and THAT is pretty rare for me given the state of things today."}, {"userName": "Jennifer", "userReviewDate": "Dec 03, 2010", "userURL": "http://www.goodreads.com/user/show/3987746-jennifer", "userReview": "Couldn't get through it. Too many stories of dead animals, maimed animals and other grotesque animal stories. Didn't strike well with the vegetarian in me..."}, {"userName": "Tamara Bennett", "userReviewDate": "Jun 28, 2010", "userURL": "http://www.goodreads.com/user/show/2881733-tamara-bennett", "userReview": "occasional cute/humorous anecdotes from kind of a 'white trash' family & their small town, but interspersed w/ an unbelievable amount of animal mistreatment & abuse descriptions. quit on page 65 after the last incident - a live rabbit stapled to a wall. could not bring myself to turn the page. was afraid of what could be next. shocked that this was recommended reading & that anyone could ever get past these incidents & not be truly bothered by them."}, {"userName": " Erin", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/94162-erin", "userReview": "This book was pleasurable enough to read, but because it wasn't very plot driven, it took me forev-ER to complete. Zippy's narration is amusing and I enjoyed her descriptions of a more innocent time of small town Americana, when farm animals were kept in backyards, and kids could ride their bikes (complete with streamers and horns) to the corner drug store for a 26 cent lemon phosphate. But beyond that, I'm not entirely sure what she was trying to convey in her memoir, and I wasn't compelled to reflect much deeper. The weaving of certain characters and themes throughout was nice, and when Zippy does finally do her good deed and appreciate her mother's insistence on sunrise Easter church attendance, it is sweet, not cheesey, as it easily could have been."}, {"userName": "Marie", "userReviewDate": "May 04, 2009", "userURL": "http://www.goodreads.com/user/show/1060805-marie", "userReview": "I must say that it is refreshing to read a memoir in which the author does not grow up in a dysfunctional family or face overwhelming odds in his or her life.This is the story of a normal, small-town childhood. Zippy was an odd little creature of a child, but I found her adventures to be amusing and the descriptions of her family and neighbors to be well drawn.I grew up in a suburb rather than a small town, one year before Haven Kimmel, so I could relate to the cultural references. (Although I've never had a lemon phosphate in my life, and I don't even know what that is!)The book had several memorable passages, such as \"Dad had a way of emphasizing certain words that was like Winnie-the-Pooh gone bad,\" or \"it's hotter than billy-be-doggone bangtree outside.\"It makes me realize how much excess our children are growing up with to read about how special that one Christmas present was, or how much Kimmel coveted her friend's small jewelry box from Acapulco (lined with red velvet and covered with little shells). Kimmel writes about viewpoints and experiences that feel so genuine--like how she didn't really believe in Jesus, but she wanted him to be her boyfriend instead. Or how she intuited that the music teacher was hurting, or threatening to hurt her best friend when he gave her private lessons after school, so she insisted on staying there with her friend.This was definitely a book worth reading. The only reason I am not giving it four stars is that I was ready to be done with it at the end, so I could move onto something that moved on a little more quickly. The chapters did not really connect to each other in any way; it was like a series of short stories about small town life. And I'm not really a fan of short stories. The book left me wondering what happened to her parents and brother, in particular, all complex and sad characters in their own way. Her sister, I have no doubt, has probably lived a happy life.P.S. I have just read that Kimmel wrote a Zippy Part 2 book, in which I might find out the answers to my questions. I will take a break and then read that one, too, sometime in the next year. Maybe my questions will be answered!"}, {"userName": "Cristina", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/680523-cristina", "userReview": "Okay so I have to be honest here...I really didn't like this book, which is strange because it seems like everyone out there that I have talked too; absolutely loves it and thinks it's hilirious. I was mostly interested in reading the book because my mom grew up in a small town in Indiana so I thought it would be fun to see some similarities in how she was raised compared to Zippy's upbringing but honestly I really struggled getting through the book. I actually would fall asleep reading it even in the middle of the day and I honestly didn't think it was that funny; I guess if you think watching rabbits being killed or a cat being thrown out the front door by an old stinky lady or the fact that another old lady was living with over 60 dead pets in her house is funny than you will like this book. Often times I was wincing and wanted out of this horrible environment that this little girl, who didn't seem to be affected one way or the other, was living in. Honestly....how does this girl not have severe emotional problems after that childhood?!! I guess I honestly didn't get the point to the book.I gave it 2 stars because it was an easy-fast read, which I always enjoy and I did like the way the book ended...finally something happy!I guess if you are wondering whether you should read this book or not, you may want to read some other reviews other than mine because it seems I am one of the few that didn't enjoy the book tremendously."}, {"userName": "Sterlingcindysu", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/946086-sterlingcindysu", "userReview": "3.5 This was my first \"pool book\" of the summer--you know, a paperback book you can read at the pool that you don't mind getting wet and is something you can pick up and get into quickly. A funny book written about the same time I was growing up as well. Her comments about all the mothers taking ceramics and decoupage were exactly right! But I could sense tension between the family members and sure enough, it looks like there's a second book she's written to continue the tale. There were parts that made me a little squimish, such as when she heard mice in the kitchen, or she literally had a grey neck from not washing. It does make you realize how summertime activities of kids have changed in 2 generations. I remember having scabs on my knees from June to September and now kids' knee are completely bruise free!"}, {"userName": "Donna", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This would have been 4 stars, but I had to 'up it' one star because I could identify with so much of it. The author is very close to my own age, and just how she describes life and her neighbors and friends, sounded eerily familiar. It brought back memories.This was laugh out loud funny in some parts. It was hard to control the laughter in public. I will caution animal lovers out there: there is a fair amount of animal cruelty in this. The author handles it as delicately as possible and adds humor to balance that out. Overall, I loved this.....and I would read it again. I especially loved the mother in this. She was hilarious. I recommend this to anyone and everyone."}, {"userName": "Irene", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/1887310-irene", "userReview": "This is a series of light, sweet vignettes about growing up in a small town in Middle America among quirky neighbors and a loving family. This is a time when parents did not feel responsible to protect children from broken bones, road rash and wounded hearts, but believed it was their responsible to help kids heal from and live through them. These felt like the self-contained stories one might find in Family Circle or similar magazine. It is not my preferred reading material, but is a good example of its genre. It is the pick for my local book group to discuss tomorrow night, and members are already talking about how much they enjoyed it."}, {"userName": "Susan", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/2908494-susan", "userReview": "A good book about a girl's childhood in Mooreland, IN."}, {"userName": "Katie", "userReviewDate": "Aug 23, 2009", "userURL": "http://www.goodreads.com/user/show/80861-katie", "userReview": "You know that moment in life when you realize that stories of the things that loom large in childhood -- like your absolute terror of the woman who lives next door or your absolute certainty that some of the cards in a deck of playing cards are female and some male -- can be condensed, as if through a trash compactor, into little nuggets of pure cuteness and innocence that you can then hand to others for the rest of your life in one long show-and-tell, knowing they are obligated to laugh nostalgically and then hand you theirs?Actually I don't know quite what or when that moment of realization is, but we all must go through it to get to adulthood, because we all have those anecdotes we tell -- the things we were afraid of, the things we were sure of -- told now with the requisite amused adult chuckle and shake of the head.This book is basically a collection of those from the life of Haven Kimmel, and where you might expect to find them cloying in bulk, they are anything but. Maybe she just tells them better than most people. Or maybe she has better, funnier stories. Or maybe she does a better job of keeping the events to the scale of childhood perception. She doesn't bring in a lot of \"I know so much better now\" voiceover, which is refreshing. But I think it has the most to do with her always having seen herself as a character. The caboose in her family, late to talk and late to grow hair, little Zippy seems more like her family's mascot than their third child, and even as a kid she seems to know she has more leeway and can exist more languidly in her childhood fancies than perhaps her siblings were able to. It helps that she has parents who seem to enjoy her and share in her delight in just making stuff up. For no apparent reason, they tell her she was adopted from a family of gypsies (traded for an especially nice bag), even though you have only to look at a single baby picture to know it's a lie. Her dad's a bit unhinged, and her mom exhibits signs of depression, but their affection for Zippy and their taste for the absurd are such constants that somehow this still manages to be a book about a happy childhood, without sanitizing or idealizing it. Two steps over in tone and this could have been a different kind of memoir (think Julia Scheeres' Jesusland). But being essentially down with the goofiness and even the trials of youth is what makes A Girl Name Zippy unique and so worth giving yourself over to. Some chapters are better than others, but whatever -- basically I just envy everyone who still has this book ahead of them."}, {"userName": "Kristin", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/19025805-kristin", "userReview": "i laughed put loud more than once. being close in age, so much if this book could mirror times in my childhood. sweet, quick read, i want to pass on to friends."}, {"userName": "Tracey", "userReviewDate": "Sep 05, 2007", "userURL": "http://www.goodreads.com/user/show/349264-tracey", "userReview": "A pass-along from my mom, I read through A Girl Named Zippy in just a few hours over the past couple of days.A memoir along the lines of Jean Shepherd (of A Christmas Story fame), Kimmel recalls vignettes from her rather bizarre childhood in the tiny town of Mooreland, Indiana. She was \"an afterthought\" with siblings 10 and 13 years older than she; slow to talk (her first words -- actually a complete sentence - coming at age three) and by her own description, funny-looking. She was also quite the tomboy, wearing dresses only under protest & preferring to climb trees and ride her bike all around town.Her father worked at a local factory and liked to drink, gamble and hunt. He gave her the nickname of Zippy, \"after a little chimpanzee he saw on television\". Her mother spent most her days lost in books, housework being a distant concern. Since her brother & sister were so much older, she was more of a plaything or nuisance to them than a sibling. The ways Kimmel tells the story, you can see their shortcomings -- the poverty and resignation; but little Zippy was blissfully unaware, her time and energy spent with the animals of the neighborhood or getting into minor scrapes.Her friends were as oddball as she: Julie, who didn't talk; Rose, the only left-handed Catholic in town; Dana from Los Angeles. There were adult eccentrics as well: the old lady who walked her dog around town all day and had a house full of cats; the drug store owner who always yelled at her. Religion, a major feature of small-town Midwestern life, wasn't really for Zippy, as she recalls her distaste for going to church with her mother, and a revelation about her father's spiritual life.Kimmel definitely has a way with words - her turns of phrase gave me reason to do quite a bit of underlining. \"There are a finite number of times one can safely climb the same tree in a single day\". Some of the stories are laugh-out-loud funny; others are very touching. Having grown up in small towns in Michigan and Indiana; I could relate with the atmosphere of her hometown. Recommended to anyone with an interest in childhood memoirs that lean more towards the amusing than the tragic."}], "description": "When Haven Kimmel was born in 1965 in Mooreland, Indiana, it was a sleepy little hamlet of three hundred people. Nicknamed \"Zippy\" for the way she would bolt around the house, this small girl was possessed of big eyes and even bigger ears. In this witty and lovingly told memoir, Kimmel takes readers back to a time when small-town America was caught in the amber of the innocent postwar period—people helped their neighbors, went to church on Sunday, and kept barnyard animals in their backyards.To three-year-old Zippy, it made perfect sense to strike a bargain with her father to keep her baby bottle—never mind that when she did, it was the first time she'd ever spoken. In her nonplussed family, Zippy has the perfect supporting cast: her beautiful yet dour brother, Danny, a seeker of the true faith; her sweetly sensible sister, Lindy, who wins the local beauty pageant; her mother, Delonda, who dispenses wisdom from the corner of the couch; and her father, Bob Jarvis, who never met a bet he didn't like.Whether describing a serious case of chicken love, another episode with the evil Edythe across the street, or the night Zippy's dad borrowed thirty-six coon dogs and a raccoon to prove to the complaining neighbors just how quiet his two dogs were, Kimmel treats readers to a heroine who is wonderfully sweet and shy as she navigates the quirky adult world surrounding Zippy.", "title": "A Girl Named Zippy\n      \n          (Zippy #1)", "url": "http://www.goodreads.com/book/show/15171.A_Girl_Named_Zippy", "average": 3.79, "cover": "https://images.gr-assets.com/books/1334082673l/15171.jpg", "reviews": 3627, "authors": [{"url": "https://www.goodreads.com/author/show/9464.Haven_Kimmel", "name": "Haven Kimmel"}], "type": ["Autobiography", "Nonfiction", "Humor", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/15171.A_Girl_Named_Zippy", "http://www.goodreads.com/book/show/406185.A_Girl_Named_Zippy", "http://www.goodreads.com/book/show/15169.Girl_Named_Zippy", "http://www.goodreads.com/book/show/15167.She_Got_Up_Off_the_Couch", "http://www.goodreads.com/book/show/534274.The_Solace_of_Leaving_Early", "http://www.goodreads.com/book/show/15173.The_Used_World", "http://www.goodreads.com/book/show/15174.Something_Rising", "http://www.goodreads.com/book/show/2258390.Iodine"]}