{"ratings": 66, "userreviews": [{"userName": "Claudia Piña", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/2636359-claudia-pi-a", "userReview": "3.5Vampiros en Hawai'i: Bastante más interesante de lo que uno esperaría."}, {"userName": "Ariel", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/8095506-ariel", "userReview": "I am blown away."}, {"userName": "Cait", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/37482483-cait", "userReview": "i'm still a sucker for vampire stories, no pun intendedhere"}, {"userName": "Ksenia (vaenn)", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/30923478-ksenia-vaenn", "userReview": "І вкотре маятник вампірської літератури хиляє між романтикою та прагматикою.Уже відгриміла своє апокаліптична Війна, і Гаваї залишаються філіалом раю на землі. Цього разу - як курорт для вампірів. Кровопивці - господарі Всесвіту, люди - поживний (а за певних умов - ще й смачний) ресурс, а головна героїня повільно й невпевнено намацує межі доступної або ж прийнятної колаборації.\"Гавайські фрукти\" - чергова історія про свободу волі та теоретичну чи практичну можливість її реалізувати. Неприємна, похмура, але, по-своєму, дуже переконлива. От тільки флер любовної лінії мені розмив картинку - без неї усе це звучало б ще драматичніше. А от потяг прочитати концепцію елітних \"годівниць\" як аналог проституції гейшевого типу, схоже, цілком природний - на Фантлабі хтось дбайливо додав позначку \"Феминистское\". А чом би й ні - вийшов годящий опис об'єктивації:\"Key has grown used to thinking of her fellow humans as food, but now she is forced to reconcile that indelible fact with another, stranger veneer. The vampires who pay so dearly for Grade Gold humans don’t merely want to feed from a shunt. They want to be entertained, talked to, cajoled (...) Key has never seen anything like this before. She thought that most vampires regarded humans as walking sacks of food. What pleasure could be derived from speaking with your meal first?\""}, {"userName": "Lance Schonberg", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/6539564-lance-schonberg", "userReview": "Part of my quest to read all of the Nebula Short Story and Novelette nominees for this year, A Guide to the Fruits of Hawai'i won the award for Best Novelette. It's also my pick of the group of six.Set some time in the future, after vampires have taken over, the narrator is a human worker in a vampire-owned concentration camp that holds healthy humans for blood production. We watch her past, as a vampire's ally and pet and the tiny part she played in the undead ascension, catch up with her. We watch her begin truly understand what the vampires have done to humanity. And we watch her come to the understanding that she doesn't really want to be one of them after all, no matter the dreams she's held onto since she was a teenager. Of course, the choice has never actually been hers, anyway. The story pulled me through with a strong sense of itself and a couple of interesting twists on vampires that built the world a little more and added to the experience. Not being particularly a vampire fan most of the time, it isn't likely I would have selected this tale on my own, but I'm glad I read it."}, {"userName": "Jack Miller", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/28184038-jack-miller", "userReview": "Read in The Best American Science Fiction and Fantasy 2015Set in a future world where vampires have taken over and keep humans around only in camps where they feed off them like livestock. One woman tells of her experiences as one of the last humans with some sense of freedom and partnership with the vampires.I am sorry to say that my preconceived ideas about vampires and vampire stories may have tainted my view of this story. It did bring about some new ideas of vampires and I specifically enjoyed the ideas of different grades of humans blood and how you can evoke different emotions in the humans to give their blood a distinct taste. However, any story that involves romantic or even semi-romantic relationships with vampires hits a sour spot in my brain that I can't seem to overcome."}, {"userName": "Norman Cook", "userReviewDate": "Jun 19, 2015", "userURL": "http://www.goodreads.com/user/show/4081587-norman-cook", "userReview": "2015 Nebula Award Novelette Winner.After reading all the Hugo Award novelette nominees, I wanted to see how they measured up to one of the better reviewed stories of 2014. Short answer: they didn't.Although there seemed to be some missing backstory of how vampires came to rule Earth, the actual story of a human woman who voluntarily serves the vampires by administering a concentration camp where humans are kept \"on tap\" because she is in love with one of the vampires is an intriguing one. Her dilemma becomes whether to give herself up to become a vampire or to help her human charges escape their incarceration. While not wholly successful, the story is an interesting character study that examines how one's goals may or may not change with maturity and added knowledge."}, {"userName": "Marco", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/11265182-marco", "userReview": "This book is set in a near future where vampires have taken over Earth and they keep humans in concentration camps / blood farms. Do not expect a Young Adult Twilight like story. This novella won the Nebula award and it well deserve it for its originality. The narrator is a human worker in one of such facilities. We discover slowly her past, as a vampire's ally and pet and the tiny part she played in the undead ascension. We see her dream of being turned slowly evolve over time as she understand what vampires have done to human culture and history."}, {"userName": "Darren", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/9131889-darren", "userReview": "Read as part of The Best American Science Fiction and Fantasy 2015. Vampires remind me of junior high school; it's when I last liked them, and still, all these years later, seems to be the demographic of fans. But wow, this was a great story."}, {"userName": "G33z3r", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/7136749-g33z3r", "userReview": "Interesting story that moves along pretty well, from the point of view of a human collaborator in a world where vampires have taken over and raise humans as food. Straightforward but compelling character study."}, {"userName": "Joanna", "userReviewDate": "Jan 07, 2016", "userURL": "http://www.goodreads.com/user/show/12315058-joanna", "userReview": "What a nifty take on a concept I've seen before, in a wonderful setting! I just wish I could taste the fruits mentioned."}, {"userName": "David Mccracken", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/34985786-david-mccracken", "userReview": "Well written vampire story. Very quick read."}, {"userName": "Maria Lidia Lima", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/13730564-maria-lidia-lima", "userReview": "<333"}], "description": "Approx. 9,500 wordsNovelette originally published in Fantasy & Science Fiction, July/August 2014.Winner of the Nebula Award for Best Novelette 2014.", "title": "A Guide to the Fruits of Hawai'i", "url": "http://www.goodreads.com/book/show/25334736-a-guide-to-the-fruits-of-hawai-i", "average": 3.83, "cover": "https://images.gr-assets.com/books/1433702053l/25334736.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/546427.Alaya_Dawn_Johnson", "name": "Alaya Dawn Johnson"}], "type": ["Fantasy", "Short Stories", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25334736-a-guide-to-the-fruits-of-hawai-i", "http://www.goodreads.com/book/show/13453104-the-summer-prince", "http://www.goodreads.com/book/show/20894021-love-is-the-drug", "http://www.goodreads.com/book/show/6977329-moonshine", "http://www.goodreads.com/book/show/1107632.Racing_the_Dark", "http://www.goodreads.com/book/show/12139912-wicked-city"]}