{"ratings": 1566, "userreviews": [{"userName": "Erin", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "3.5 starsSince all the principal characters had been introduced in  The Crown and the Crucible , book 2 definitely had a bit more meat as rebels continue to try and assassinate their Tsar and Anna's brother, Paul is in the mix. Anna and Sergei find themselves parted, Katrina is being courted by a controversial figure, and Anna and Paul's father, Yevno battles a failing heart.I enjoyed this slightly more than the first book, but this is a fairly clean description of the conflict between the Romanov leader and his subjects. However, this is a Christian historical romance which is light on the history and heavy on the romance. Again it is the curiousity of seeing everything play out and the short chapters that pushes me to keep on going."}, {"userName": "Tirzah Eleora", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/39336161-tirzah-eleora", "userReview": "Enjoyable, although certain plot lines were terribly cliché and cheesy. Not as well written as the first book, but there is a lot more action."}, {"userName": "Whitney White", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/44741185-whitney-white", "userReview": "I love this series. I could not put this book down. One thing I really liked about it is the fact that it is in a time period neglected by historical fiction, and history in general. It is always passed up for the more exciting Bolshevik Revolution 30-odd years later, so I found the historical tidbits quite interesting, and it helped me understand better the volatile state of Russia under the Tsar Liberator. The characters are quite well developed, too, and I liked that a significant portion of the story happens in Anna's home village, which was not the case in the first book."}, {"userName": "Gracelyn Buckner", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/63411712-gracelyn-buckner", "userReview": "5 Stars"}, {"userName": "Rachel McMillan", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/2201736-rachel-mcmillan", "userReview": "Re-read"}, {"userName": "Priscilla", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/6539745-priscilla", "userReview": "Starting to realize how awesome this series is! Loving the characters."}, {"userName": "Wendy", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/981722-wendy", "userReview": "3.5 stars for this one! Book 2 in the series was entertaining and picked right up where book 1 left off. I love reading the Russian history and found it very interesting. Katrina and Anna are grown women now and each has someone they love and hoping to plan a future with.I don't mind a little bit of romance in the books I read, but there was much more in this book than the last and it had some cheesy moments. What I most enjoyed reading about were the conflicts between the aristocratic Romanov family and the peasant rebels who fight against them. Good book and well written, but I liked the first one better!"}, {"userName": "Ekaterina", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/39570311-ekaterina", "userReview": "Ok, so I really liked the book, but there was some things that made me not want to give a 4 star rating. First of all, the second book didn't really compare to the first book. I don't know why I didn't like the second book as much. The book was still really good. There were some inaccuracies that I didn't like. In Russia, they don't celebrate mass. Instead of mass, it's called a liturgy, which is a big difference because mass gives the connotation that Russia is Catholic, when it is actually an Orthodox Christian nation. I also felt like some of the story line was extremely unrealistic, especially for the time period. I half disliked it, and half didn't mind it because I was looking for an easy read anyways. I loved reading about the rest of the characters. I liked Katrina's change in character, and watching the relationship between Anna and Sergei grow. I loved those parts. :-)"}, {"userName": "Shala Self Parker", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/53045630-shala-self-parker", "userReview": "Another great book in this series. I can't wait to start the next book. This book gave us more insight into the main characters' lives. As they are growing up and learning who they are and what they believe, it makes us think about what we would do and which character we would hope to become. Great writing and great series."}, {"userName": "Christine", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/24852464-christine", "userReview": "This book was just as satisfying as the first, and I am looking forward to continuing the series. I am not sure if I was just reading too quickly, but it seemed to me that many big details about some of the characters were left out and I had to fill in the blanks myself. Nonetheless, the story is sweet and this book seemed much shorter than it actually was."}, {"userName": "Ruth", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/28041961-ruth", "userReview": "Love winsI love the writing of these wonderful author's! They bring you into the world of the characters. In your minds eye you experience the life of the peasants, the loved of their country,and the heart of Anna!"}, {"userName": "Lynette  Lee (J.Kirby)", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/31590177-lynette-lee-j-kirby", "userReview": "This is the second book of the Russian series by Michael R. Phillips. The historical setting and events follow history perfectly. It's a must read for anyone that enjoys Russian history."}, {"userName": "Taryn Spearey", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/43487135-taryn-spearey", "userReview": "A lovely sequel! Anna continues to be the servant of Princess Katrina. Katrina is in love with Demetri, but another man is trying to have her heart. I'm glad that Anna got to go home for a while for her ill father. When her father fainted in the field, I was so worried that he was going to die, but he didn't. The wedding at the end of the book was beautiful."}, {"userName": "Melissa", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/42942170-melissa", "userReview": "[ This book did have some sweet parts between Misha and Anna. The reason I read this so quickly was that I had such hopes for those two. But finally, when I was almost finished with this book, I could take the suspense no longer and checked on the following books to see who Anna would choose. She chooses Sergei. Ruined! I skipped through several parts at the end, and I won’t read the next books. The fact that she could fall for Sergei, who was still such a weak character, (and the fact that their love story was just so underdeveloped!) really makes me dislike these authors. A love story with Misha would have had so much more depth, intrigue, and heartache. They don’t know how to create a truly beautiful love story, frankly. A prince falling for a servant should be one of the most romantic tales in the world, but somehow they butchered it. They made Misha so much cooler, and they didn’t even realize it. Some good parts, like when Anna came to Misha for help with Dmitri --- yet overall a disappointment, because she chose the uninteresting character over the great one.  (hide spoiler)]"}, {"userName": "Melissa", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/5557036-melissa", "userReview": "I thought this book was better than the first in the series. It was less political and more character and events driven. While there is still little mystery as to the events that will happen or how those events will occur, the book is compelling and keeps the reader invested in the character's lives. I greatly preferred the events surrounding Anna and Katrina to those involving Paul. His character is not developed enough to feel the conflict I should towards him and his associates are equally lacking in compelling characteristics. As a result, Paul's parts in the story were not nearly as interested has Anna's. Overall, I've enjoyed this series and look forward to its conclusion."}, {"userName": "Lindsey", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/3070362-lindsey", "userReview": "The plot moved between Anna and Katrina and what was happening in their lives. Anna's father getting sick and her brother Paul coming to the city. Katrina with the news that Dmitri was engaged, finding a \"boyfriend\" and her brother Sergei leaving the home to \"find himself.\" I would have liked to see more of Sergei...but there was a more concrete villain in this book then the last. Lots more political undercurrents and upheaval. Favorite quote: How lovely and vibrant it all looks, thought Sergei as he stood watching."}, {"userName": "Jeni Enjaian", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/4680796-jeni-enjaian", "userReview": "I read this book many years ago as either a middle schooler or underclassman in high school. I adored the book and entire series then. This remembered adoration helped me make the decision to skip these books when reading through my collection four years ago. I read many books by both of these authors since then and gradually became aware of the glaringly obvious shortcomings of their authorship. These shortcomings infected every book I read by them. I had no hope that these books would survive a second read. As I supposed, they did not."}, {"userName": "Adelein", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/44394825-adelein", "userReview": "Ehkä hieman parempi kuin ensimmäinen osa. Mielestäni Anna ja Katarina ovat mielenkiintoisimmat henkilöt, joten olisin halunnut lukea heistä enemmän kuin Pavelista. Toisaalta oli hieman haittaa siitä, että tuntee historiaa tarinan takana: arvasin nimittäin, että yritykset tsaarin murhaamiseksi epäonnistuvat."}, {"userName": "Sara", "userReviewDate": "Mar 02, 2009", "userURL": "http://www.goodreads.com/user/show/2071015-sara", "userReview": "I really enjoyed this book. Paul really comes into his own in this book and several issues in the first book are worked out. Katrina has grown up tremendously and is forced to make a hard decision of the heart. Anna must face more difficulty in her personal life but the book ends with hope for her future."}, {"userName": "Julie", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/2253571-julie", "userReview": "Simple fare, but entertaining. It got rather trite when the Prince goes to work in the peasant village and extoles how much he loves physical labor, and the the happiness of the peasant life. Somehow, I don't think peasant life was really very pleasant at all. Reminded me of the flower children of the 60's return to nature."}, {"userName": "Marie", "userReviewDate": "Feb 18, 2009", "userURL": "http://www.goodreads.com/user/show/623334-marie", "userReview": "This is the second book in the Russian series. I found it an enjoyable book. I love reading about Russian History. Prince Sergei returns to Anna after being in the army and at war. Anna and Sergei have to make many decisions that will affect both of them.This is one of my favorite series."}, {"userName": "Beth", "userReviewDate": "Nov 10, 2007", "userURL": "http://www.goodreads.com/user/show/612636-beth", "userReview": "This is a follow-up to The Crown and the Crucible by the same authors. As interested as I am in the characters and the story, I just can’t get past the writing style — flowery and wordy, in my opinion."}, {"userName": "Kristelle", "userReviewDate": "May 22, 2009", "userURL": "http://www.goodreads.com/user/show/831252-kristelle", "userReview": "At first I was afraid the book was going to move to far away from Katrina and Anna but while the author brought in Paul's story along with Sergi's a bit more the girls were still a big part of the story. I am feeling more and more connected with each book."}, {"userName": "Norma Todd", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/32103937-norma-todd", "userReview": "The saga continuesAs the political intrigues escalate, Anna and Katrina continue to grow together toward their futures. Who will Katrina marry? What will become of Anna? Must read!"}, {"userName": "Rachel", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/2868865-rachel", "userReview": "This was a well-written and truly interesting historical subtly Christian novel, which is part of a series set in Russia in the 1870s and 80s. All of the characters are well drawn, and most of them are also likeable. I really enjoyed the novel and am looking forward to reading more of the series."}, {"userName": "Ann", "userReviewDate": "Apr 26, 2008", "userURL": "http://www.goodreads.com/user/show/136571-ann", "userReview": "2nd in the historical fiction set in Russia. Read right through it quickly"}, {"userName": "Amanda", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/2832291-amanda", "userReview": "Great continuation of the series! Love the history."}, {"userName": "Dana", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/13822777-dana", "userReview": "I read this over 15 years ago. Michael Phillips was one of my top 3 authors of the time. Christian historical fiction - a wonderful genre!"}, {"userName": "Brenda Fronsee", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/21108084-brenda-fronsee", "userReview": "historical romantic"}, {"userName": "Michelle", "userReviewDate": "Dec 26, 2010", "userURL": "http://www.goodreads.com/user/show/4707303-michelle", "userReview": "GET SEQUEL neat plot, great history--character growth"}], "description": "The Russians book 2. The soldiers have returned, but the turmoil grows for the nation.", "title": "A House Divided\n      \n          (The Russians #2)", "url": "http://www.goodreads.com/book/show/65982.A_House_Divided", "average": 4.17, "cover": "https://images.gr-assets.com/books/1328016351l/65982.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/3521078.Michael_R_Phillips", "name": "Michael R. Phillips"}, {"url": "https://www.goodreads.com/author/show/31464.Judith_Pella", "name": "Judith Pella"}], "type": ["Historical", "Christian Fiction", "Christian", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/65982.A_House_Divided", "http://www.goodreads.com/book/show/26154730-a-house-divided", "http://www.goodreads.com/book/show/1043265.A_House_Divided", "http://www.goodreads.com/book/show/29494535-kahtia-jaettu-kansa", "http://www.goodreads.com/book/show/817379.Angels_Watching_Over_Me", "http://www.goodreads.com/book/show/66011.The_Crown_and_the_Crucible", "http://www.goodreads.com/book/show/807532.A_Day_to_Pick_Your_Own_Cotton", "http://www.goodreads.com/book/show/817380.The_Color_of_Your_Skin_Ain_t_the_Color_of_Your_Heart", "http://www.goodreads.com/book/show/65964.Travail_and_Triumph"]}