{"ratings": 3679, "userreviews": [{"userName": "Joseph", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/1281880-joseph", "userReview": "Aimless Love: New and Selected Poems by Billy Collins is a selection of poetry ranging from 2002 through 2011. Billy Collins was poet laureate of the United States from 2001 through 2003. He also served as poet laureate of the state of New York from 2004 through 2006. He is a distinguished fellow at the Winter Park Institute of Rollins College. Collins is also the editor of Poetry 180 and has published ten collections of poetry. For me poetry collections are a bit like short story collections, because I know early on when I do not like one. They also are like short story collections in that I know an excellent collection very early on. In this collection by the third poem I knew that it would be an outstanding collection. I ran across this in the third poem “More Than A Woman”:… I peered in at the lobsterslying on the bottom of an illuminatedtank which was filled to the brimwith their copious tears. Then moved by the poem “Absence,” I turned to “Royal Aristocrat” a poem about Collin's old and noisy typewriter. That typewriter made so much noise he had to keep the doors shut and set the machine on top of a pile of newspaper to help deaden the sound. Times change, and he writes:That was twenty years ago,yet as I write with this soft lead pencilI can still hear the distinctive sound,like small arms fire across the border. It's that ability to capture moments and memories that makes poetry great. “Today” is another poem that cries out to a moment or feeling we all have experienced. Simply amazing in the flow of the words and the capturing of the feeling. The poetry is divided into three sections from 2002 Nine Horses, which I have quoted from so far. The second section is called Ballistics from 2005, and lastly  Horoscopes for the Dead from 2011. The the last two sections, both of the title poems are amazing. There is a bit of humor in Ballistics, or what I took as being a bit humor. Horoscopes for the Dead is a bit haunting and anyone who has lost someone can easily relate to it. Poetry collections are also like short story collections because you do not need to like every poem, but the ones that you do like hold you in through the entire collection. Collins makes reference to a poet maybe writing three perfect poems in a lifetime. I do not know what constitutes a perfect poem, but I do know what I like. There were many more than three times that after reading the poem I put down the book and thought, “Wow!” After a few minutes, I would pick it up and read through it again, and once more, highlight sections, highlight the poem in the contents, and read it again. It is easy to see after reading this selection how Collins was a Poet Laureate. An amazing collection and a must read for fans of contemporary poetry."}, {"userName": "Diane S ☔", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Review to follow."}, {"userName": "Heather Fineisen", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/6482072-heather-fineisen", "userReview": "The only thing better than reading Billy Collins is listening to Billy Collins. His witty word placement is a sophisticated SNL (Saturday Night Live) skit that can make you laugh out loud at first glance, but mourn at the irony of our own ridiculousness. Litany stands as one of my all time favorites, and Collins, with his Kevin Spacey voice, is the bread and the knife and the wine in my book.book provided by publisher, audio bought with my husband's very hard earned money."}, {"userName": "Melanie", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/7574349-melanie", "userReview": "In turns somber and humorous, reverent and rebellious, Billy Collins' delightful collection of poems illuminates little corners of everyday life with precision, attentiveness and wit. In short, it does what great poems do best: they make us slow down and look at everything with renewed urgency and a deeper understanding.Whether describing the daily rituals of a poet or the gradations of emotions, whether looking at divorce through the lens of kitchen utensils or the different transition terms that are best avoided in a stanza, these clever poems constantly surprised me with their keen intelligence and particular take on people and objects.In the last lines of the superb poem \"The Names\", dedicated to the victims of September 11th and their survivors, Billy Collins' ability to conjure a sense of permanence out of the void is fantastic:Names etched on the head of a pin.One name spanning a bridge, another undergoing a tunnel.A blue name needled into the skin.Names of citizens, workers, mothers and fathers,The bright-eyed daughter, the quick son.Alphabet of names in green rows in a field.Names in the small tracks of birds.Names lifted from a hatOr balanced on the tip of the tongue.Names wheeled into the dim warehouse of memory.So many names, there is barely room on the walls of the heart.A collection to savor. Slowly."}, {"userName": "Teresa Proença", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "Amor Universal foi um caso de paixão à primeira página...que foi crescendo até à última...É uma poesia diferente; não se limita ao amor e à morte. Em tudo Billy Collins se inspira e cria Maravilha; até num candeeiro de mesa, num jantar de peixe…não me surpreenderia ver um poema intitulado “Uma casca de alho”…Deixo aqui dois poemas, que constam desta colectânea; o primeiro para ler; o segundo para ouvir na bonita voz do seu autor:1. A ASSOMBRAÇÃO \"Eu sou o cão que tu puseste a dormir,como gostas de chamar à agulha do esquecimento,e volto para te dizer esta coisa simples:nunca gostei de ti - nem por um momento. Quando lambia o teu rosto,pensava em morder-te o nariz.Quando via como te secavas com uma toalha,apetecia-me saltar e castrar-te num instante.Detestava a maneira como te movias,a tua falta de graça animal,a maneira como te sentavas numa cadeira para comer,com um guardanapo no colo e a faca na mão.Eu teria fugido,mas era muito fraco, um truque que me ensinastequando estava a aprender a sentar e a deitar,e - o maior dos insultos - a apertar a mão sem ter uma.Admito que a visão da trela me entusiasmavamas apenas porque significava que estava prestesa cheirar coisas que nunca tinhas tocado.Podes não querer acreditar nisso,mas não tenho nenhuma razão para mentir.Odiava o carro, os brinquedos de borracha,detestava os teus amigos e, pior, os teus familiares.O tilintar da minha chapa levava-me à loucura.Sempre me fizeste festas no sítio errado.Tudo o que sempre quis de tifoi comida e água fresca nas minhas tigelas de metal.Enquanto dormias, ficava a ver-te respirar à medida que a lua ia subindo no céu.Foi precisa toda a minha forçapara não levantar a cabeça e uivar.Agora estou livre da coleira,da gabardina amarela, da camisola com monograma,do absurdo do teu relvado,e isso é tudo que tu precisas de saber sobre este lugarexcepto o que já calculara antese te deixa feliz porque não aconteceu mais cedo - que todos aqui conseguem ler e escrever os cães em poesia, os gatos e os outros em prosa.\"2. THE COUNTRYhttps://m.youtube.com/watch?v=8xovLpi..."}, {"userName": "Sue", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "I've read and heard about Billy Collins for some time but never actually read him until now. First, I did find myself chuckling frequently at clever phrasing and word juxtapositions, particularly in the first half to 2/3rds of the book. Collins can be very clever at creating wonderful images. Some of these images came together for me into equally effective poems but many did not...they just sat and seemed to wait for me to find more meaning in them. Or this might be an aspect of what I seek in poetry.What did I enjoy or better, appreciate? \"Country\", \"Absence\", \"Writing in the Afterlife\", \"No Time\", \"Christmas Sparrow\", \"Flock\", \"Building with Its Face Blown Off\", \"The First Night\", and here is a section from \"January in Paris\" that I really enjoyed for its playfulness:And never mind the holding and the pressing It is enough to know that I moved my pen in such a way as to bring her to completion, a simple, final stanza, which ended, as this poem will, with the image of a gorgeous orphan lying on a rumpled bed, her large eyes closed, a painting of cows in a valley over her head, and off to the side, me in a window seat blowing smoke from a cigarette at dawn.Another short but effective poem:Divorce Once, two spoons in bed, now tined forks. across a granite table and the knives they have hired.There are more but I will leave it at these. Suffice it to say there were not enough for me to rate this book more highly. I think for me the issue is one of having an edge or issue. Too often I didn't find one.Rating 3 to 3.5An ecopy of this book was provided by the publisher through NetGalley in return for an unbiased review."}, {"userName": "Lauren ", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/1291915-lauren", "userReview": "This was an absolute delight. Collins has such witty observations and a cool, nonchalant style. I already want to read this one again, and everything else by him too."}, {"userName": "Philippe", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/4903281-philippe", "userReview": "Billy Collins does what all poets do: banging their heads against nothingness and celebrating the ephemeral pleasures of earthly existence. But unlike some his of bardic brethren Collins never loses his composure. Angst and euphoria are sublimated in an unerring feeling for balance and a droll sense of humor. His lyric disposition is suffused with childlike wonderment, ironic self-depreciation and an old-world brand of courtesy and compassion. Many will want their poetry shot to be more edgy but I find Collins to suit many moods. And I guess I won’t be reading Rilke on my death-bed but I may ask someone to read me another Collins. This generous collection picks up where Sailing Alone Around the Room - the earlier volume of ‘new and selected poems’ (2002) - left off. Here’s just one of my favorites of the ‘new poems’ section of the book: a Sunday Walk that unfolds as a sequence of discreet and endearing modulations and dissolves in a characteristic flourish of ambiguity. Not only colorful beds of flowersruffled today by a breeze of the lakebut the ruffled surface of the lake itself, and later a boathouse and an oak treeso old its heavy limbs rested on the ground. And I don’t want to leave outthe uniformed campus guard I saw studyinga map of the campus without a single student in sight. Closer to town, shops under awningsand several churches, one topped with a burnished cross, another announcing a sermon:“What You Can Take With You.”So many odd things to see but mostly it’s the sun at its apexinscribing little circles, little haloes at the top of the sky, and the freshening breeze, the nowhere it came fromand the nowhere it is headed, every leaf wavering, each branch bowed, and what can I do, I heard myself askingwith this evidence of something, me without a candle, wafer or a rug, not even a compass to tell me which way to face."}, {"userName": "Donna Merritt", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/1867689-donna-merritt", "userReview": "AIMLESS LOVE is a delight. The first poem hooked me, with the reader getting a “print-fix for the day.” Of course, I’ve been a Billy Collins fan since I stumbled upon his SAILING ALONE AROUND THE ROOM (one of my all-time favorite books of poetry). Collins has a way of connecting with people on a personal level. You’re tempted to think of it as poetry about ordinary things in plain language, but when you reread a poem, you’ll see that there are marvelous twists and ways of looking at things in an unusual way. There were some phrases that were poems all by themselves: “under the roof of a paragraph”; “the evening wedding of the knife and fork”; “the banging of the water hammer that will frighten the cold out of the room”; “sentinel thorns, whose employment it is to guard the rose”; “as the sun helps itself down the sky”… I could fill this review with his unique word play alone.And so many pieces spoke to my poet’s heart. Are poets able to ever just look around without feeling the need to write about what we see? Does someone else always have the next great topic in mind that he or she is sure we should turn into a poem? “Villanelle” (one of the NEW in NEW AND SELECTED here) made me laugh as that form (dating back to the late 1500s) seems to be hot again these days and I’ve been avoiding trying my hand at one.If you thumb through my copy of AIMLESS, you’ll see it splattered with underlined words and whole stanzas bracketed and highlighted lines and inked hearts on the ones I can’t get out of my head.From “The Trouble with Poetry” (originally from his book of the same title):\tthe trouble with poetry is\tthat it encourages the writing of more poetryI hope it does, Mr. Collins. I’m already looking forward to the next book."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I received a review copy of the audiobook version of this, and I'm so glad I got a chance to listen. Anyone who knows the work of Billy Collins knows that the words on the page are only half of it. Hearing or seeing him perform the poems completes the picture. I would describe his tone as half Deep Thoughts by Jack Handy, half a male version of Siri. In a recent TED talk that Billy Collins did, he showed some of the films made of his poems, featuring his voice. One of my favorites from this book, The Country, is definitely worth seeing. I will never forget the triumphant fire-wielding mouse. Other favorites include Litany, Adage, and Aimless Love. I have listened twice and think I'll keep going back. Discussed on Episode 4 of the Reading Envy podcast!"}, {"userName": "Julie", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "I read quite a bit of poetry, but I wasn't familiar with Billy Collins, who was our U.S. Poet Laureate for a couple of years, but clearly missed my radar.He's good, and it looks like he's had some success selling poetry, which always makes me stand up and cheer. It isn't easy to be a poet, and I know it.Collins is a strong imagist. This is a quick example from one of his rare short poems, Divorce:Once, two spoons in bed,now tined forksacross a granite tableand the knives they have hired.He takes you there, quickly, and gives you a good sense of time and place. His poems, though, are a bit lengthy for my preference, and, even though they contain well-chosen words and poetic language, they often lack rhythmic sense and rhyme. I know many poets now have moved away from rhyme, but it can be powerful to throw in some tidbits within a poem from time to time. All free verse and feelings here, and his poems, especially the \"romantic\" ones often took me to the opposite place that I wanted to go. I honestly couldn't secure a solid sense of his romantic life, but maybe that was the point? It's none of my business, but I kept wondering. . . does he love his partner, or want to kill her?I'm a girl who was heavily influenced by both EE Cummings and TS Eliot and I just gush over romanticism, fatalism and drop-dead language in poetry that slams you right in the throat or the gut. None of that happens here for me, but I did love his poems \"Genius,\" and \"Aimless Love,\" which is both a poem and the title of this collection. \"Aimless Love\" is a celebration of the daily love of the ordinary things happening around us. Yes. I feel that way, too. Thank you for this one.Aimless LoveThis morning as I walked along the lakeshore,I fell in love with a wrenand later in the day with a mousethe cat had dropped under the dining room table.In the shadows of an autumn evening,I fell for a seamstressstill at her machine in the tailor's window,and later for a bowl of broth,steam rising like smoke from a naval battle.This is the best kind of love, I thought,without recompense, without gifts,or unkind words, without suspicion,or silence on the telephone.The love of the chestnut,the jazz cap and one hand on the wheel.No lust, no slam of the door-the love of the miniature orange tree,the clean white shirt, the hot evening shower,the highway that cuts across Florida.No waiting, no huffiness, or rancor-just a twinge every now and thenfor the wren who had built her nest on a low branch overhanging the waterand for the dead mouse, still dressed in its light brown suit.But my heart is always propped upin a field on its tripod,ready for the next arrow.After I carried the mouse by the tailto a pile of leaves in the woods,I found myself standing at the bathroom sinkgazing down affectionately at the soap,so patient and soluble,so at home in its pale green soap dish.I could feel myself falling againas I felt its turning in my wet handsand caught the scent of lavender and stone."}, {"userName": "Nina", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/1246429-nina", "userReview": "In an NPR interview, Billy Collins states:\"I'm trying to write poems that involve beginning at a known place, and ending up at a slightly different place,\" he says. \"I'm trying to take a little journey from one place to another, and it's usually from a realistic place, to a place in the imagination.\"http://www.npr.org/2011/04/06/1351815...Collins accomplishes this handily in his newest collection. The poems in Aimless Love are collected from 4 previous books, as well as a sizeable section of new work. The new poems are actually the largest section of the book. Collins is clearly the people’s poet, in the sense that his poetry is about everyday events, images, and people. There is a fairly predictable format; Collins starts out with detailed description, and the turn usually comes in the final stanza, where he opens the seemingly ordinary scene into something deeper. His tone is light, familiar, and conversational. Collins uses clear, descriptive language. He is a master at capturing minute details. His trademark, whimsical humor, often turned gently toward himself, is evident throughout this collection.I received this ARC as part of Goodreads First Reads program, and with it came a request not to quote, as this is an uncorrected proof. One of my favorites is a new poem titled “To My Favorite 17-Year-Old High School Girl.”For devoted Collins fans, and readers who don’t want a poet to change his style, this book won’t disappoint. It is also a good collection for somebody who wishes to “try out” Billy Collins."}, {"userName": "Philip", "userReviewDate": "Oct 26, 2015", "userURL": "http://www.goodreads.com/user/show/71601-philip", "userReview": "Billy Collins Dining Aloneby Philip HabeckerIf ever I were to come acrossBilly Collins dining alone,or perhaps drinking alone after contemplating Li Po,the gold of the moment would turn me to living straw. An open door’s breeze dizzying me; unable to knock me over.Were he to look up, he would find me contemplative, too.Do I pull out Sailingand ask for an autograph?Aware that I may be ripping the conception of lifenot just from his mind, but from the world.“Here! Mr. Collins! -Billy!”He sets down his chamomile.Exasperation. Disgust? Perhaps just sadness.We’re old friends. Intimate, even.Just a signature, and a line or two?Something poetic?Something about friendship and duty;I’d love a casual observation on a random object.Or death. Or time.Look! I’ve done half the work for you!No. Perhaps I could just ask for a picture.The smile on my face darkenedby the shadow of the barista’s tray.*Caveat Emptor/Caveat Reader/...Caveat Listener, at least... If you get the audio-book, the cover states, \"Unabridged Selections.\" This is true. But it does not contain the full contents of the book.It's worth it to hear the poems read in Collins' cadence. It's also worth it to then go back and get the book and read what you've missed."}, {"userName": "Antonia", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/1575042-antonia", "userReview": "I’m always so conflicted about Collins. I often like individual poems, but when I consider his body of work as a whole . . . I find it disappointing. Yes, some of his poems are amusing, or at least cute. A few even clever. Many are too fanciful to be taken seriously. Too many just fall flat. And he’s always writing (more or less) the same poem over and over. The poems feel formulaic, “humorous without actually being funny” (David Orr*) and too often self-congratulatory. As I wrote in my review of Horoscopes for the Dead, “Collins always seems to be caught up in a daydream, as if he has no particular work to do, place to go. He can idly muse about taking dead people (whose names he glimpses on headstones) for a ride on his copper-colored bicycle or make a sort of duck out of his hand and talk nonsense to it. There's no one listening, after all. Except we are. And sometimes I wish he actually had something more to say.”See Orr’s review of Collins (not this collection) in The New York Times, January 2006. http://www.nytimes.com/2006/01/08/boo..."}, {"userName": "Megan Baxter", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "Reading this book was an object lesson how much of the experience is not only the words on the page, but all that the reader to them. How much can be changed when the reader has been changed, when experience puts things into new, starker relief.Note: The rest of this review has been withheld due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Betsy", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/11586997-betsy", "userReview": "Aimless Love by Billy CollinsCollins' poems illuminate the many small mysteries, pleasures, and dilemmas of our ordinary lives, as well as our occasional magical thinking and the power with which we imbue everyday objects. He's often at his best when describing those quotidian predicaments we find ourselves in and the silly stories we make up to help us move past those moments. One such example is the poem \"Quandary\" where Collins struggles over what to do with overripe apple that he really doesn't want to eat, but feels he should. Finally he decides to pitch it - \"hoping to hit on the head of a murderer or one of the filthy rich out on a stroll.\"Collins' poetic nature is nowhere more apparent than when he is writing about the pleasures of reading, writing, and the English language, as well as his own enjoyment and confidence in his ability to use words to describe his world. \"I think that what I'm really saying is that language is better than reality\" (\"Bathtub Familes\"). In another poem, Collins laments that \"the trouble with poetry is that it encourages the writing of more poetry.\" That he can't help himself is evident in \"Returning the Pencil to the Tray,\" in which Collins talks about not ever writing another poem, even as he does. While most of Collins poems are a page or more long, I also enjoyed his shorter pieces, including his haiku-like \"Divorce\" -Once, two spoons in bed,now tined forksacross a granite tableand the knives they have hired. Collins' poetry is both earnest and honest, without the self-importance (and often indulgences) sometimes found in other poets' works. Several poems point out his own fallacies and prejudices. His self-critique is not mean spirited, however. Rather, in \"Old Man Eating Alone in a Chinese Restaurant\" Collins describes his feelings of relief and gratitude for his luck in resisting the temptation of a young poet to ascribe despair and loneliness to man eating alone, now knowing for himself the pleasures of a solitary meal accompanied by a good book. Collins' work is deceptively light, almost transparent - appearing more like an angel food cake than a chocolate torte. There is a brevity of words in his poetry - as he straddles the line between telling too much and not enough. His poems are often funny - rarely does Collins take himself too seriously, and when he does, he makes fun of this, as well.His analogies are simple. You won't need a pick or a shovel to understand these poems. They aren't profound. I don't think that profoundness is what Collins is going for here. Rather his work reflects a simple, but certain engagement with life and its many delights and perplexities. This is a wonderful book for someone who has read little or none of Collin's work, as it includes poems from four previous works, as well as several new poems not previously published. I received a free copy of \"Aimless Love\" from Library Things Early Reviewers Program. This is no way affected my review."}, {"userName": "Rob the Obscure", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/1510500-rob-the-obscure", "userReview": "Not much left to say about Collins. He's brilliant, the way he baits us with this charming, and seemingly harmless, humor, and then right at the end we realize we've been shown the light of deep reflection on important things.The new poems are just great. I remember distinctly as an American kid, digging a hole in the back yard for some reason, and my dad telling me that if you dug a hole deep enough, you would dig all the way through to China. Maybe you have a similar memory? Here's how Collins riffs off that childhood experience:OrientYou are turning melike someone turning a globe in her hand,and yes, I have another sidelike a China no one, not even me, has ever seen.So describe to me what's there,say what you are looking atand I will close my eyesso I can see it too,the oxcarts and all the lively flags.I love the sound of your voicelike a little saxophonetelling me what I cold never knowunless I dug a hole all the way downthrough the core of myself.*Collins is never a waste of your time."}, {"userName": "Kim", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/579325-kim", "userReview": "I always enjoy some Billy Collins poetry, though I didn't love any in this book like those in Picnic, Lightning. Favorite poems: Velocity, No Time, The Lanyard, Tension (suddenly...), To My Favorite 17 Year Old Girl, The Suggestion Box, CheeriosFavorite lines: (Royal Aristocrat) \"Such deep silence on those nights-just the sound of my typing and a few stars singing a song their mother sang when they were mere babies in the sky.\""}, {"userName": "Ana Rînceanu", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/28781546-ana-r-nceanu", "userReview": "Th imagery and the humor make this collection emotionally moving and endlessly re-readable."}, {"userName": "Sharon  Landis", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/24454234-sharon-landis", "userReview": "Read a poem a day and it was total joy! Delightful in every way."}, {"userName": "Denny", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/38939715-denny", "userReview": "What can I say about Billy Collins that I haven't already said before? He is a rock star. He is the best living contemporary poet in the world. Listening to him read his poems is even better than reading them myself. No other writer can make me smile as much, laugh as hard, or cry as often as Collins does. Aimless Love is probably his best collection to date. Feel free to hop on over to my blog to see my thoughts there: https://theceaselessreaderwrites.word..."}, {"userName": "Simon Robs", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/50133154-simon-robs", "userReview": "Gosh golly goodness & Godness but these poems are for everyone - sleek, accessible, kindly incisive manna fallen like milky snowflakes to a thirsty world. Now I can pop this open sometime on a hunch that bibliomancy might just provide an answer or question as need be to fashion a way onwards ho.How's 'bout a selection shall we? You out there Fio, one's for you, all else too: Irish PoetryThat morning under a pale hood of skyI heard the unambiguous scrape of spacklingagainst the side of our wickered, penitential house.The day mirled and elabberedin the thick, stony light,and the rooks' feathered narlingastounded the salt waves, the plush arm of coast.I carried my bucket past the forkedcoercion of a tree, up towardthe pious and nictitating preeminence of a school,hunkered there in its gully of learning.But only later, as I stood before a wash-standand gaunt, phosphorescent heifersswam purposefully beyond these windowsdid the whorled and sparky gib of the indefinitemanage to whorl me into knowledge.Then, I heard the ghost-clink of milk bottleon the rough thresholdand understood the meadow-bellsthat trembled over a nimbus of ragwort-the whole afternoon lambent, corrugated, puddle-mad."}, {"userName": "Wuttipol", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/69712880-wuttipol", "userReview": "นอกจาก Billy Collins จะรวบรวมบทกวีจากสี่เล่มก่อนหน้านี้ ก็ยังมีบทกวีชุดใหม่ด้วย เริ่มต้นด้วยบทนี้The Sandhill Cranes of NebraskaToo bad you weren’t here six months ago,was a lament I heard on my visit to Nebraska.You could have seen the astonishing spectacleof the sandhill cranes, thousands of themfeeding and even dancing on the shores of the Platte River.There was no point in pointing outthe impossibility of my being there thenbecause I happened to be somewhere else,so I nodded and put on a look of mild disappointmentif only to be part of the commiseration.It was the same look I remember wearingabout six months ago in Georgiawhen I was told that I had just missedthe spectacular annual outburst of azaleas,brilliant against the green backdrop of springand the same in Vermont six months before thatwhen I arrived shortly afterthe magnificent foliage had gloriously peaked,Mother Nature, as she is called,having touched the hills with her many-colored brush,a phenomenon that occurs, like the others,around the same time every year when I am apparently offin another state, stuck in a motel lobbywith the local paper and a styrofoam cup of coffee,busily missing God knows what.นี่คือแนวถนัดของ Collins โคลงบทนี้ดูเหมือนจะไม่มีอะไรซับซ้อนใช้ภาษาเรียบง่าย ว่าด้วยเรื่องธรรมชาติอันงามงดที่กวีไม่มีโอกาสได้ชื่นชม ไม่ว่าจะใน Nebraska หรือ Georgia หรือกระทั่ง Vermont พอมาอ่านซ้ำจะรู้สึกว่าส่วนที่พูดถึง Nebraska จะจำง่ายกว่าส่วนที่พูดถึง Georgia หรือ Vermont เพราะมีการใช้จังหวะพยางค์ที่ชัดเจน และการผสานที่ลงตัวของสระและพยัญชนะโคลงบทนี้จะดูธรรมดาไปทันทีถ้าไม่มีวรรคนี้\"so I nodded and put on a look of mild disappointment\"น่าคิดว่าทำไมกวีต้องบอกว่า พยักหน้า (nodded) และ แกล้งทำเป็นผิดหวังนิด ๆ (put on a look of mild disappointment) นั่นเป็นเพราะว่ากวีไม่เพียวใคร่ครวญถึงประสบการณ์การ \"สูญเสีย\" หรือ \"พลาด\" อะไรบางอย่างในชีวิตไป แต่กวีกลับพูดถึวประสบการณ์นั้นด้วยน้ำเสียงแฝงนัยแย้งย้อนได้น่าคิดว่า เราควรจะโหยหาสิ่งที่เราสูญเสียหรือพลาดไปในอดีต หรือเลือกที่จะอยู่กับการยอมรับได้ว่าการสูญเสียหรือพลาดนั้นเป็นเรื่องธรรมดาของประสบการณ์ชีวิต บางทีการมานั่งเสียใจว่าทำไมเราถึงอดดูสิ่งที่สวยงามที่คนอื่นพร่ำบอกว่าห้ามพลาด เราควรชื่นชมสิ่งที่สวยงามอยู่ตรงหน้า (เช่นการอ่านหนังสือพิมพ์กับการนั่งจิบกาแฟ) ที่เป็นสารัตถะสำคัญในชีวิตที่เรามักจะมองข้ามไปรึเปล่า Collins ยังพูดถึงมิติของการรังสรรค์ศิลปะได้แยบคายว่าเพียงเพราะว่าศิลปินไม่ได้มีประสบการณ์ตรง ไม่ได้หมายความว่าศิลปินจะไม่สามารถสร้างศิลปะขึ้นมาได้ (กวีไม่ได้ไปดูอะไรสวย ๆ ใน Nebraska แต่กลับพรรณนาถึง Nebraska ได้ออกมาซะละเอียดขนาดนั้น) กวีเชื่อว่าขอเพียงศิลปินมี \"จินตนาการ\" เป็นจุดเริ่มต้นในการสร้างสรรค์ก็ใช้ได้แล้ว ดังนั้นจะเกิดประโยชน์อันใด หากเราเอาแต่นั่งเสียใจในสิ่งที่เราพลาดไปในชีวิตในโคลงอีกหลายบทในเล่มนี้ เราจะได้เห็น Collins เขียนงานที่โดดเด่นตรงที่ท้าทายสิ่งที่เราเห็น รับรู้ และเชื่อ ในชีวิตประจำวัน ด้วยการเชื้อชวนให้คนอ่านลองปรับมุมมองชีวิต แล้วจะรู้ว่า โลกไม่ได้มีทางเดินสายเดียว"}, {"userName": "Jsavett1", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/1289730-jsavett1", "userReview": "Let me begin by saying that I feel forever indebted to Collins for opening so many hearts and minds to poetry. His earlier collections contain some of my favorite poems. So it was hard to rate this collection because the \"Selected\" portion of the book is comprised of poems I've already read and mostly enjoyed. But the new poems in Aimless Love are, indeed, aimless. It pains me to say so.The impression I got while reading the new poems is that Collins has reached a level of fame and sales consistency in his writing career, one a SCARCE FEW poets come to, which allows him TOO MUCH freedom. I'm not sure if his editors have merely become \"yes\" men and women who know his fans will buy whatever he publishes, but someone needed to tell Collins, clearly and without reverence, that these poems are not up to par. They don't reach the simple profundity of his earlier work or even the surprise and linguistic dexterity I find when I read many young poets. This made me sad. The most egregious examples of these unfettered dips into pure cliche and sentimentality are \"To My Favorite 17-Year-Old High School Girl,\" and \"Looking for a Friend in a Crowd of Arriving Passengers: a Sonnet.\" The former is a lament about Collins's daughter's inability to complete her chores and includes the line, \"we think you are special by just being you.\" How does a line like that pass editorial pen slashing!? It's a perfectly nice sentiment--but it belongs in a birthday card, not in collection of poems by a former Poet Laureate. The latter poem contains just three words and is mildly clever. But that's just it: the poem exists only as a demonstration of a little linguistic trick. There's nothing beneath the surface to value.If you've never read Collins, this collection contains a fantastic sampling of his post-millenium poems and is worth a read. However, if you're already a fan, there is nothing actually new here, despite the book's subtitle."}, {"userName": "Cynthia ☮ ❤ ❀ ", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/3717966-cynthia", "userReview": "Review: Aimless Love by Billy CollinsFive out of Five StarsExpected publication: October 22, 2013I was introduced to Billy Collins back in the 90s, I gobbled up The Art of Drowning, Picnic, Lightning, Sailing Alone Around the Room, Nine Horses, and The Apple That Astonished Paris, each one a treasure in its own right. Ecstatic, doesn't describe how I felt when I heard that Collins was to release a new volume of poetry, his first since 2011, because in my opinion, Billy Collins is the Pied Piper for Poetry! His work is simply amazing, and this new volume of poetry proves it. He may be in his seventies, but he hasn't lost his poetry mojo. Yes, this volume is a mix of new and previously published work, but a gem of a poem is easily devoured over and over again. If you have always wanted to like poetry, but just never found the right poet, here is your chance to rectify all that has been missing in your quest to enter the genre of poetry. Give Aimless Love a shot and see if you haven't found just what you needed to fill your poetry gap. With poems like \"Cheerios\" your love of Billy Collins' poetic genius will start to grow. Lines like, \"I opened the Tribune only to discover that I was the same age as Cheerios,\" will keep you reading to discover where Collins is headed. I feel obligated to mention that in addition to his ten published collections of poetry, Mr. Collins was named Poet Laureate of the United States from 2001 through 2003, and he served as Poet Laureate of the state of New York from 2004 through 2006. Collins is also credited with starting Poetry 180 and is currently its editor.I'd like to thank Netgalley and Random House Publishing for allowing me access to an advance readers copy (ARC) of Aimless Love by Billy Collins.Blog: The Things You Can Readhttp://thethingsyoucanread.blogspot.com/"}, {"userName": "Kara", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/5838693-kara", "userReview": "I should start this review by saying that I have never been a fan of poetry until I started reading Billy Collins' work. Poetry always seemed so abstract and I always found myself searching for the \"story\" in the poem. Then I read Collins' poem, \"Introduction to Poetry\" and saw that I was looking at the poems all wrong. I started reading more of his work and found myself actually enjoying poetry. Needless to say, I was very happy to receive an advanced copy of this book from the First Reads program. Aimless Love is an essential book for any Billy Collins fan. This book is an organized mix of selections from his earlier poetry collections and a large section of new material. Collins has always been known as an \"accessible\" poet and this collection definitely lives up to that title. Collins' poetry is very beautifully written but also easy to relate to. Some of my favorites in this collection are \"Aimless Love\", \"Monday\", \"The Lanyard\", and \"Best Fall\". These poems depict so much emotion and clear imagery that it feels as if you are reading more than a just a short poem. Although I have read the entire book, it's a great book to keep out and read through from time to time. His poems pack so much \"story\" into such a small amount of space that only reading a few will make you feel like you've read an entire novel. Highly recommended!"}, {"userName": "Lesley", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/885128-lesley", "userReview": "I will always like Billy Collins's poetry -- he is comfortingly consistent, wryly funny, and so accessible. I only read the \"new\" poems (having read all the other books already) and mostly it was exactly what you would expect. Sometimes he tries to be too clever as in \"Looking for a Friend in a Crowd of Arriving Passengers: A Sonnet\" and \"Villanelle\" (though I had to give this one a little credit because of John-Michael Albert's villanelle about writing a villanelle - apparently it's a thing). I think I most liked his few forays into more fanciful territory like \"Promenade\" when we see the speaker leashing a robin. His titles are for the most part uninspired, though \"Osprey\" is perfect. \"Rome in June\" is lovely, and goes beyond his sometimes snarky observations that leave the reader to make of it what they will. It's at least his second mention of Keats (what's up with that?) but this one speaks more to Keats's poetry and gives us more to chew on. If you like Billy Collins you will probably like this book. If you've ever wanted to see him go a bit farther, try something new, push some boundaries... this isn't it."}, {"userName": "Ellen Campbell", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/6399099-ellen-campbell", "userReview": "I won this book in the Giveaways program and it arrived two days ago. Normally I place my winning books in the order I receive them and I try to review them in somewhat that order. With this one, I glanced through and opened to a poem called, \"The Lanyard\" and with tears running down my face I was hooked. I hardly ever read poetry and do not claim to be an expert in this genre, but I know what moves me, and this book did. It appears to be a compilation of other poetry the author has published along with new poems. I had never read any of them before so this was a treasure. The poems do not strain the brain trying to figure out what they are about. Each and every one was a joy for me to read. I have added this book to my \"favorites\" shelf. I really loved it as much if not more than anything I have read this year. Highly recommended!"}, {"userName": "Niki", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/6170447-niki", "userReview": "There's a full range of poetry to be digested, some weird stuff I was mostly ambivalent about and also some of the most beautiful mixes of words I've ever read. \"Velocity\" was my favorite - with incredible descriptions of how time moves swiftly even in the most mundane moments. \"Hangover\" and \"Horoscopes for the Dead\" were also gems, with rather self explanatory subject matter. Collins is a master of capturing snippets of life and gifting them to the reader in little delicious pieces. Bonus: The audiobook is read by the author who has a deep, gritty voice perfect for delivering these (often salty) verses."}, {"userName": "Wayne", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/15558119-wayne", "userReview": "Billy Collins is one of our greatest ambassadors of poetry. This collection of selected poems from four previously published books is a ton of reading fun. He pulls magic and majesty from the mundane, commonplace experiences and memories we all share. Like William Stafford, another favorite poet, he writes for all of us. No pretentious, snooty academic, Collins' gets it and gets us, all of us. His poems read like pieces of the best conversations, with the strange twists and turns and epiphanies that make those conversations memorable, profound, and even laughable. Even if you don't 'do poetry', you should do this."}], "description": "The first volume of New and Selected poetry in twelve years from the two-time Poet Laureate of the United States.Aimless Love gives the reader an opportunity to assess the rich scope of Collins' gifts. Containing more than fifty new poems and a generous gathering from his collections of the past decade-Horoscopes for the Dead, Ballistics, The Trouble with Poetry, and Nine Horses-Aimless Love showcases the best of his poetic maneuvers: the everyday ends in the infinite, playfulness is paired with empathy, irony gives way to wonder. Possessed of a unique voice that is at once plain and melodic, Billy Collins has managed to enrich American poetry while greatly widening the circle of its audience.", "title": "Aimless Love: New and Selected Poems", "url": "http://www.goodreads.com/book/show/15798111-aimless-love", "average": 4.18, "cover": "https://images.gr-assets.com/books/1366046336l/15798111.jpg", "reviews": 514, "authors": [{"url": "https://www.goodreads.com/author/show/438.Billy_Collins", "name": "Billy Collins"}], "type": ["Poetry", "Fiction", "Audiobook", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/15798111-aimless-love", "http://www.goodreads.com/book/show/23716207-amor-universal", "http://www.goodreads.com/book/show/18759562-aimless-love", "http://www.goodreads.com/book/show/15798237-aimless-love", "http://www.goodreads.com/book/show/676.Sailing_Alone_Around_the_Room", "http://www.goodreads.com/book/show/24400.The_Trouble_With_Poetry_And_Other_Poems", "http://www.goodreads.com/book/show/24403.Nine_Horses", "http://www.goodreads.com/book/show/137110.Picnic_Lightning", "http://www.goodreads.com/book/show/9315496-horoscopes-for-the-dead"]}