{"ratings": 4083, "userreviews": [{"userName": "Will", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/6018339-will", "userReview": "IT WAS AWESOME! Before I started this book I had read many mixed reviews of it. Many people were on the fence as to their opinions of it. After reading it I have to say to those reviewers,\"ARE YOU PEOPLE NUTS,DID YOU READ THE SAME BOOK I READ?\"  I loved the book and even found it incredibly frustrating at times. The story aroused many strong emotions with every turn of the page. I found myself cheering for the characters victories and filled with dismay at their defeats. Some of the characters aroused such feelings of anger and disdain they actually became my favorites. I say this because, for those unfamiliar with his writings, Mark Tufo has an incredible ability to bring his characters to life with unbelievable depth. Some readers made not so positive comments about the flashbacks throughout the book. I have to say I liked them. They explained so much about the motivations that drove the characters. They helped explain the bonds between some and the distance between others.  As for the plot of the story, all I can say is get ready for a roller coaster of the unexpected. I don't want to give anything away so that is all I will say. Just be ready for what you least expect. This one will have you cheering, cursing, and in complete and utter dismay. It is just what an apocalyptic horror story should be.  Just read the book! You will enjoy it! Hats of to you Mark Tufo you have delivered superbly, I can't wait for Zombie Fallout 6."}, {"userName": "Vix", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/7521915-vix", "userReview": "ok, have read all the other reviews and anyone who knows me will tell you I am a zombienut! plus I think Mark Tufo is fantastic!I can see the positives and negatives on all reviews.It is a fab book and a real fan pleaser as no constant refs or repeats of passed books, always fresh stuff! which is great for us constant fans.... not so good if you pick the book up from fresh, but hopefully the no.5 on the cover gives that away!!Yes it does have a lot of pre zombie flashbacks but I feel that just builds the emotion and tensions going on with the characters and delivers the intensity of the \"fall\" of MT.Cliff hanger or abrupt ending? I think more cliff hanger.... we know that Mr Tufo is working on no.6 (hopefully no.7 & 8 too).Very character focused on just a few ppl but that only intensifies the action (in my opinion) and allows you to love, and hate, deeper......I can empathise with the reviewer who was on his 5th redbull, only 4hrs til work and still page turning.... I allocated my day off and let the housework slide to read this book (having been caught out before!) I DID feed my cats tho!!as an avid cat lady myself I could relate on so many levels to that particular nightmare.... not sure about the cat stomping tho (grrr or should that be hiss!)This series is encompassing so many genres; comedy, horror, paranormal, thriller...."}, {"userName": "Megan", "userReviewDate": "Mar 03, 2012", "userURL": "http://www.goodreads.com/user/show/4117775-megan", "userReview": "I cannot believe I have not written a review of any of the Zombie Fallout books yet. These books are just fantastic and along with the White Flag of the Dead books I have lost plenty of sleep staying up late reading these books. Warning this review is a little spoilerish. Where do we even start the writing is superb why because Mike and company are not just characters they are real people well with the exception of Eliza and Tommy/Tomas that you could meet anywhere. Yet these people are unique but realistic. However Mark, I want to shake you and ask why and then beg you to publish the sixth book immediately. I can clearly see how Tufo took inspiration from his real life and made it into a book. Sadly I think this book was the hardest one to read in the series. Why do you ask because some serious *hit goes down in this book. From the get go Mike and company know a showdown with Eliza and her “flying monkeys” (my terms not Marks) is inevitable, the group is also being proactive. However their plan to literally cut Eliza off at the pass goes awry and the group all suffers as a consequence. There is also a sub-plot with the Sea Hag (Mrs. Devarux) which really left me with an uneasy feeling. The bulk of the book consists of Mike and company struggling to find each other after being split up and get the heck out of Dodge, but the zombies and a few humans will be having none of that. Sadly a character or two does not make it thanks to certain person’s murderous and deceitful actions. That is why this book is so hard to read because someone is manipulating the group to serve their own selfish needs. We also get a little bit more info on this person. Considering their actions I think this info may be more important later on and we have not seen the last of this person. As I stated a good portion of the book is the group trying to find one another. However Mike’s powers are starting to evolve and I think in some ways this further complicates an already precarious and tense situation. The last ¼ of the book is tragic because you become invested in a characters storyline, to find it does not end well. The actions that led to the resolution of said storyline also lead up to the most baffling cliffhanger ending. We also learn a little more about Mike and Paul BZ (before zombies) which was great but it also made what happens in the book just little harder to swallow. All I can say is I hope we get another book and soon. The last quarter of the book was just wickedly twisted and it would be cruel to leave the fans hanging for too long. This book as always is another excellent installment in the series. Read it."}, {"userName": "Todd Menesses", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/39659881-todd-menesses", "userReview": "Not the best in the series so far but still worthy of picking up and continuing. Too many flashbacks in this one for me. That seemed to make it feel a little disjointed. Narration as always was spot on by Sean."}, {"userName": "Nathan Tullis", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/18356135-nathan-tullis", "userReview": "*I received a free copy of this audio book for review from Audiobookreview.com*Having listened to the previous Zombie Fallout books, I’ve grown to really enjoy this series. There is dark humor, witty dialogue, zombie action, mind controlling vampires, and a fair share of heart. This was pretty much the same.Zombie Fallout 5 opens with Talbot & Co. looking for revenge. They plan to attack a caravan towing Eliza, Tommy, and a lot of zombies in hopes of crippling them enough to keep her off their backs. 3 survivors soon find themselves being taken in by a mother and her child, while another batch of the Talbot clan has difficulties of their own. It’s a race against time, and zombies, as Mike tries to find a lost friend and uncover a secret hanging over his head. Can Mike Talbot trust everyone in his group? Can he hold on to his sliver of sanity when he see the truth? I couldn’t tell you, the book ends with a brutal cliffhanger that is infuriating. Not only because the story doesn’t end, also because I want the rest of the story. Luckily, I already have the next installment available to me, otherwise it would have moved down on my list. I don’t typically mind cliffhangers in series, when they’re done well and the book tells a complete story. That’s not the case here. It’s just completely open ended, intriguing and exciting, but annoyingly unfinished.Sean Runnette yet again takes the role of Mike Talbot. I haven’t listened to anything else Runnette has done, but his voice fits in perfectly with Tufo’s writing. There was no background noise, static, or mumbling. He’s a solid narrator and I couldn’t think of anyone else who could play these characters.Mostly, I really enjoyed this story. There were a couple of long flashback scenes that kind of took you out of the story, but they were entertaining. If you like a zombie drama, you will probably like this book."}, {"userName": "Holly", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/5241263-holly", "userReview": "**SPOILER**First the bad. I really wanted to love this story. I really, really, really wanted to. But I couldn't. Not only was it shorter than the others, but it was severely lacking in action. It felt like a filler, or maybe just the first half of a good story. Kind of like Mr. Tufo just wanted to get something published while he's hot. Another problem I had was when he gave a shout out to himself, by mentioning Indian Hill (on a night stand, in an abandoned house). It bothers me. I'm not sure why, but it does. I'm also super creeped out by Paul's death... CATS!? Icky. As for Mike- I don't believe Mr. Tufo would just kill him off... the story is still unfinished. The editing is a bit rough, and I still don't like the \"journal\" aspect. Finally, I wish Mr. Tufo would have written The Blood Stone stories as one book, instead of in pieces attached to the others. Now the Good. I really liked how Deneaux is turning out. She went from a crotchety old bat... to a calculating, murdering, old bat. It's awesome. As always, Mike's sarcasm and speak-before-he-thinks outbursts lighten up a dark story. He reminds me of Home (Massachusetts). I also like how he's starting to explore his \"talents\". I like Tomas/ Tommy, and how we're still not sure what he's going to do in the end. The reason I did give this book a 3 is the people. I love them, even the secondary ones."}, {"userName": "Sakinah Jonas-mawji", "userReviewDate": "Oct 31, 2012", "userURL": "http://www.goodreads.com/user/show/14127419-sakinah-jonas-mawji", "userReview": "The Zombie Fallout series of books is right up there in my top favorite zombie horror fiction novels. I'm a totally devoted zombie horror reader, video-gamer and movie buff, and this particular series was impossible to put down. I hope there will be another book soon! It's hard to find a balance between humor, suspense, action and horror without crossing a line into unnecessary graphic morbidity that would have definitely put me off reading them, and I have read other books by authors that couldn't get the balance right. Mark Tufo has managed to maintain this unique balance with all of his Zombie Fallout books to perfection. Mr Tufo has developed his characters so well in this series that the reader feels completely drawn in, feeling specific emotions for specific characters, and willing them to survive! Or in some cases meet their just demise! It feels like a genuine loss when one of the good guys dies! Keep them coming Mark. I want to read more!"}, {"userName": "Claire Riley", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/4419930-claire-riley", "userReview": "This isn't your typical zombie book which is actually very fitting as Mark isn't your typical author- (or man for that matter, not that I've met him but seriously how can anyone be considered typical after writing such gross devastation??) My favourite thing about Mark Tufos books is he isn't afraid of his characters. In that sense i mean that, a lot of writers fall so much for their characters lead or non lead that they are afraid to harm them or kill them off. Mark isnt & i frequently found myself in this book & the others shouting \"what? But you cant!\" A great book with not just a cliff hanger but a dangling you head first over a cliff with snakes and lava below you by BT himself!Read it. If you dare!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "WELL IT JUST GETS BETTER AND BETTER. I WAS WORRIED ABOUT BT THERE FOR A LITTLE BIT BUT NOW I'M HOPING WHAT HAPPENED WILL TAKE CARE OF IT, TRYING NOT TO SPOIL ANYTHING. BUT WHY! WHY DID P HAVE TO GO THE WAY HE DID? OMG! THAT WAS HORRIFIC. ALL I KNOW IS I LOVE THESE BOOKS AND I HOPE NOTHING EVER HAPPENS TO BT OR HENRY! I LOVE MOST ALL OF THE CHARACTERS THOUGH. AND MIKE IS SO FREAKIN FUNNY! THERE IS SOMETHING ABOUT A GOOD ZOMBIE BOOK THAT YOU CAN LAUGH OUT LOUD AT SOME PARTS THAT MAKES ME ALL WARM INSIDE :) I HAVE ONE MORE AFTER THIS AND THEN I ALREADY BOUGHT THE LYCAN SERIES! I'M SO GLAD THERE IS MORE OF MIKE TO CARRY ON!"}, {"userName": "Albert Yates", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/14289020-albert-yates", "userReview": "The series keeps getting better and better with every book. While the series started off with a whimper for me, the first book was a little slow and monotonous most of the time, this book made up for it with violence, gore and unnecessary death.While on his way to find Eliza and she her reign of terror once and for all Mike naturally is able to find some enemies and ends up causing some trouble as he passes through town. Mark Tufo is capable of breathing life into some rather boring and under used characters that they've encountered in their journey. He's taken one of the old ladies they're taking with them and turning her into a heartless bitch."}, {"userName": "Annie", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "Even thought this is the least fave of the series..it was well worth my time and credit...I am continuing..on to book 6...I love this series so much and am happy I found it...and am sooooo curious to see what happens next...I really hope Mike and his family are going to be ok!! I recommend this series very much!! 2 thumbs up!!Lots of hard losses in this book...very sad....I enjoyed my listen again...and am moving on to book 6...which is my fave of this series!!!3rd time it was still great!!"}, {"userName": "Linda", "userReviewDate": "Apr 01, 2012", "userURL": "http://www.goodreads.com/user/show/6213718-linda", "userReview": "I just finished ZF4 & 5. I would not start it until I reread the series again. (That made 4 times for zf1-zf3) I loved it!!! The pacing, the horror, and the humor… it was all spot-on! Start this series from the beginning and get to know some really wonderful characters. Mark brings them to life for you! So much so, that even a dog named Henry, who I have fallen in love with, I worry about. I highly recommend Mr. Tufo’s Zombie Fallout series as one of the best Zombie apocalypse books around."}, {"userName": "Matthew", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/2171979-matthew", "userReview": "I enjoyed this book thoroughly, that being said it was a little disappointing. There was very little progression in this book. Lots of back story and flashbacks. It was all entertaining and like I said I enjoyed it but I got this book to read a zombie book and see what's going to happen next to my favorite characters that I'm invested in and what I got was funny stories of pranks and mushrooms and very little zombies. I just hope this wasn't a gimmick to make a little more money and squeeze another book out of it."}, {"userName": "Craig", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/6508739-craig", "userReview": "Sadly, Zombie Fallout 5 feels more like a connected series of short stories rather than a continuation of the series. Mark Tufo seems to be dragging this series out too much. Most of this book didn't even increase the storyline. I know he has stated it is because his main character is just too long winded...but this is just wrong. It has made me wonder if I really want to read any future books in the series."}, {"userName": "Cindysnitily", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/7100630-cindysnitily", "userReview": "Mark does it again in this nail biter. I think my only complaint I would have is that I got to the end of the book and thought \"what the...?\" It's going to be hard to wait for book 6 as this was cliff hanger. My gut instinct tells me that Mike survives this latest catastrophe that he's gotten himself into, but I find myself questioning even that. It's hard to be sure when the author throws in curve balls by killing off characters that you learn to love."}, {"userName": "Matt Disney", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/9192490-matt-disney", "userReview": "Due to the nature of this story (Zombie Apocalypse) it could go on forever. I have read other series of books that tend to get boring, playing out the same old things just slightly repackaged. HOWEVER, this series is always new with unexpected events. If you are a fan of anything apocalyptic, this series is for you. 10 out of 10 yet again."}, {"userName": "Badseedgirl", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "I was ready to give up on this series with this book. I was tired of the Eliza/Tommy storyline. But then I read the scene with the ferral cats and my faith in Mark Tufo has been restored. I will have nightmares for years over that scene."}, {"userName": "Shawn", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/7027982-shawn", "userReview": "Another great book in the series. This one is wonderful, Mark Tufo does go on alot of sidelines and tangents in this one more than the previous novels But it is part of the fun of the ride."}, {"userName": "A. Hunt", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/14150982-a-hunt", "userReview": "This series is one of the absolute BEST!Review to come."}, {"userName": "Gretchen Haraldson", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/43769388-gretchen-haraldson", "userReview": "Minor spoilers. This one didn’t get have the panache of the previous books in the series. Still good though. A few things that made it less wonderful:I miss Tommy!There were a lot of stories from earlier days in people’s lives. It does flesh them out as characters, but so often the stories were added in the midst of turmoil and I just wanted to know what happened next. Tufo does do a pretty darn good job of bringing those short stories to life though. Paul’s best friend status with Mike never sat well with me. It never really seemed like Mike cared for him that much. In the last book when Mike was looking for the Alex/Paul group Mike mostly talked about his need to get to Alex to help him out of a jam. Paul also never came close to being as competent as Mike which seemed odd in the sense that I couldn’t understand why Mike would choose a friend who wasn’t very capable. I do plan to read the Indian Hill series which I believe has both Paul and Mike in it exploring their earlier years and I’m curious to see if the author makes Paul a little stronger (not just physically) in those. Also, BT seemed like a much closer friend to Mike than Paul was even though Paul and Mike were friends for 30+ years and BT and Mike only new each other for some months. ...I didn’t care for Paul at all anyways. Even though this book wasn’t as great as the other ones, it seems like the stories were needed to advance the overall plot. I.e. It might be difficult in future books for Mike to have 2 best friends; it adds to the plot to have a “villain” within the group; and having Mike be lost to the group is going to make for some intense moments in the next book. On the plus side, Tracy wasn’t in most of the book and when she was, she wasn’t quite as witchy."}, {"userName": "Danielle", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/3960198-danielle", "userReview": "...Cats man. That scene with the cats I will never forget. I'm 100% a dog person and Tufo's scene completely cemented that hahaha:D. What to say about this book? I switched back and forth between Kindle and audio (while at work, while shopping, while working out). I busted out laughing over and over and earned a few \"is she crazy stares\". Tufo's characters are so great, BT is amazing, Gary reminds me of someone I know, and Mike Talbot, I wish I had that man in my life. I wish I had them all in my life, except Eliza of course. The thing that really makes this book different from so many other series is that family is the driving force. Tufo puts a lot of love into his characters. This is by far the best series I've stumbled upon. Can't wait to read all of his books!"}, {"userName": "Alissa Thorne", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/538517-alissa-thorne", "userReview": "[a beloved character is eaten by cats over the course of like, half the book. (hide spoiler)]"}, {"userName": "Deb O rah", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/17670280-deb-o-rah", "userReview": "book 5. the flashback \"in the day\" stories are amusing at first but with the accompaniment of a constant barrage of \"mancard\" commentary they quickly become tiresome, all the while the main story line sluggishly inches forward. I'm not sure if I will make it through the last 5 books in the series."}, {"userName": "Shirley Shaffer", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/55048255-shirley-shaffer", "userReview": "too Many Fillers This book actually ends at page 285. From that page to 342 it is all prologue and xxx-sodes. at $4.99 a book it is a rip off that 1/3 of the book is just fillers and fluff. This 10 book series could have easily been a 5 book series. That's why I marked it only 3 stars."}, {"userName": "Ruth Fabiano", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/6053115-ruth-fabiano", "userReview": "Eh. A lot of pointless stories. Yeah cause...the whole college RA thing had a lot to do with the zombie apocalypse. A pointless trip leaving sanctuary that got a lot of people killed. Also I wish there would stop being random expendables added to the story when clearly they are going to die."}, {"userName": "Jamie Jowers", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/18294752-jamie-jowers", "userReview": "Wonderful book!!!Hate that it ended like it did! Can't wait to get the next book now!!! I was hooked to Michael Talbot's story from book one! Great read!!!!"}, {"userName": "Rashie Claiborne", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/46648197-rashie-claiborne", "userReview": "I still enjoy the series but I think I've grown bored with the Eliza arc and am ready for the group to find new nemeses."}, {"userName": "w1ndsor", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/10101439-w1ndsor", "userReview": "This one went a little too far. Too gory. (What does this author have against cats anyways?!)"}, {"userName": "Sarah", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/10258995-sarah", "userReview": "Mark TufoZombie Fallout 5: Alive in a Dead WorldThis set of books has it all, the humour shines through to lighten the darker parts of the book, the psychological terror of the situation drags you into the story making you feel a part of the family, Mike Talbot is the hero of the piece protecting his family and loved ones to the best of his ability from the growing Zombie threat, the zombies are not all slow and lumbering as in the majority of Zombie films neither are they as fast as in 28 days later film, some Zombies show a modicum of intelligence and can learn new skills and group behaviour which pits them against the remaining human population, the bug causing the apocalypse mutates and speeds up evolution causing further issues, logical really as a bug which can survive death of the host would have a strong survival instinct which has never been covered in all previous Zombie books and films I have seen, the imagination of the writer to be able to think that scenario through when so many other have not just adds to the whole sotryline - these books are begging to make the transition to the silver screen. On a personal note, having received a kindle for Christmas I set about finding something to read, for many years I have stuck to the same authors and very rarely been willing to try anything new,I also saw the kindle merely as an avenue to get free books and had no intention of buying any. Having watched The Walking Dead on tv and enjoyed it I turned my attention to Zombie books just as an afterthought, I downloaded many free books and samples of books and worked my was through, each one leaving me un-enamoured and un-inspired. Reaching Mr Tufo's first Zombie Fallout book I read the sample and enjoyed it and then moved on to another book without further thought BUT over the course of the next week I could not get the storyline out of my head and genuinely wanted to know what happened next, I then did one thing I never thought I would do I purchased a book ! I read that book over the course of 2 days - I think \"devoured\" is an apt description I was reading morning, noon and night, life was lived one handed so I could have my kindle by my side, on finishing it I immediately purchased book 2 which I finished before payday! I then would have had to wait a week until I could read book 3, I managed 2 days of torture before begging my partner to pay for book 3, when pay day came bliss I bought the rest of the books available and have had a week of excitement, humour, terror and gore - wow what a journey - and it isnt over yet hurry up with book 6 please Mr Tufo ! - I have recommended these books to my colleagues at work and now three other people are undertaking the same journey - I can't recommend this series of books enough - and now I consider myself a Mark Tufo fan"}, {"userName": "Theodore", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/8621635-theodore", "userReview": "I like Mark Tufo and I really do like Zombie Fallout as a series, I really do! But... Zombie Fallout 5: Alive in a Dead World felt like a whole lot of stalling by Mark Tufo. There was some headway made in the general progress of the story of course but the headway that was made was very small where the general plot is concerned. I've said it before and I'll say it again one of the main reasons that the book series is as enjoyable as it is is of the little quirks that Mike Talbot have and the myriad of interesting characters in the book. Mike's quips with... well anyone and his incredibly short attention span makes it a trip when reading from his portions. Mike's best friend in the book seems downright hopeless to me... Mrs. Deno... She's an... interesting one... I can also add a couple others who I all find fascinating and who brings something to the book. I must say though that where this book is concerned the author drags his foot along a lot. A big portion of the book's plot are a series of seemingly useless flashbacks (I kid you not, they seem completely and utterly useless to me except for providing some fodder to maybe laugh at). There was also a huge emphasis on Mike growing into his new powers. In the grand scheme of things though, I would say that probably one or two really note worthy things happen in this book (both of which I found just plain gruesome even for a Zombie book... I mean.... I am shocked and not in a good way...). Both occurrences could have been fit in the other book prior to this. And to add insult to injury.... this book more than any other ends in a MASSIVE cliff hanger. I really don't understand how or why Mark Tufo would do that... I was quite disappointed."}], "description": "In the latest installment of Mark Tufo's zombie fallout series, Mike Talbot and his family continue their fight for survival as Eliza plots their demise.", "title": "Alive In A Dead World\n      \n          (Zombie Fallout #5)", "url": "http://www.goodreads.com/book/show/15884474-alive-in-a-dead-world", "average": 4.33, "cover": "https://images.gr-assets.com/books/1351372159l/15884474.jpg", "reviews": 156, "authors": [{"url": "https://www.goodreads.com/author/show/2990843.Mark_Tufo", "name": "Mark Tufo"}], "type": ["Horror", "Horror", "Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/15884474-alive-in-a-dead-world", "http://www.goodreads.com/book/show/13506310-alive-in-a-dead-world", "http://www.goodreads.com/book/show/17335411-alive-in-a-dead-world", "http://www.goodreads.com/book/show/8167001-zombie-fallout", "http://www.goodreads.com/book/show/15756383-a-plague-upon-your-family", "http://www.goodreads.com/book/show/10867262-the-end", "http://www.goodreads.com/book/show/12855784-the-end-has-come-and-gone", "http://www.goodreads.com/book/show/15742853-till-death-do-us-part"]}