{"ratings": 57, "userreviews": [{"userName": "Bonnie", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "Allergy-Friendly Food for Families was kindly provided to me by Netgalley for Andrews McMeel Publishing.Interested in more of my reviews? Visit my blog!I was extremely interested in taking a look at this cookbook as I’m plagued by several food allergies and it can be downright difficult for me to find a recipe I can follow to a T without having to replace this and that. When I read ‘120 Gluten-Free Dairy-Free, Nut-Free, Egg-Free, and Soy-Free Recipes Everyone Will Love’ I thought I had found the cookbook of all cookbooks; however, it ended up being just like any other cookbook I’ve picked up. My interpretation of the SubTitle was that ALL of their recipes were gluten-freen, dairy-free, etc, when in reality it was a gluten free recipe and then a dairy free recipe; there were few recipes that were actually free of all the common allergens. This brought nothing new and I still found myself replacing ingredients in order for me to be able to eat it.Another thing that I love from a good cookbook is the pictures that correspond with the recipes and I found pictures weren’t provided for all recipes. There were some interesting recipes that I did try and (after substituting) did actually enjoy, but as I said above this really didn’t bring anything new to the cookbooks I already own."}, {"userName": "Zen Nana", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/5421239-zen-nana", "userReview": "When I saw this title I was so excited! I was thrilled to finally find a cookbook I could use for my allergy-ridden family, each member on a different restricted diet. The promotional information for Allergy-Friendly Food for Families: 120 Gluten-Free, Dairy-Free, Nut-Free, Egg-Free, and Soy-Free Recipes Everyone Will Love by the editors of Kiwi Magazine claimed to finally bring together all the most common dietary restrictions in one book, offering a plethora of useful and tasty dishes for all. I have to say that when I read the book, I was quite disappointed. First of all, the dietary restrictions were separated, as usual, into soy-free, dairy-free, nut-free, gluten-free and egg-free recipes. I found very few that were free of all those ingredients. Plus my family doesn't use canola oil and some of us avoid grains like oatmeal and corn. So I would have to constantly adjust and replace ingredients as I always do to use this book. What's the point? I do that now. Gluten-free recipes with tofu (soy) in them are of no use to me; dairy-free dishes containing eggs can't be made in my kitchen; and almond milk may be a dairy-free alternative to cow's milk, but it's made from nuts. I have yet to find a cookbook I can use to avoid all the ingredients we have to avoid in one place. Maybe my family is extreme, but food allergies are becoming more and more common and more accurately diagnosed. I guess it's time to write a cookbook of my own."}, {"userName": "Punk", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/116652-punk", "userReview": "So, the answer to the question the library catalogue couldn't answer for me is this: These are recipes that MIGHT be gluten free, dairy free, nut free, egg free, soy free, or some combination thereof. Recipes are sorted by meal, and each has a series of colored blocks along the side that says what it's free of, but I tapped out at the gluten. I'm too old for that nonsense, and from a \"for families\" cookbook to boot. If that doesn't turn you off: There's no custom gluten-free flour blend, and there's an index for each of the *-free categories, but there's no way to cross-reference them if you're trying to avoid more than one thing, so I'm not sure who this cookbook is for."}, {"userName": "Darren", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/9039058-darren", "userReview": "For whatever reason, there are more people nowadays who have to avoid certain dishes and ingredients because of an allergy. Many opinions differ as to why there has been a growth in such allergies but many families now face the problem of how to cater for everyone and respect necessary dietary restrictions.The problem is even more exacerbated when it comes to making food for a friend or visitor who has a particular allergy as you can go quite blank as to what they could be offered. Particularly if you wish to give something interesting and different! This book can come to the rescue with its range of comprehensive, practical and child-friendly recipes. From snacks to full dinners, it is pleasing to note that the featured recipes are not only child-friendly but also suitable for adult company too. A nice balance that will be appreciated by the possibly stressed host as it is not a nice feeling for the \"affected guest\" to feel a burden, requiring \"special catering\". At home their family is used to working around it but when visiting it is often a different matter and the host will invariably be over-cautious and seek much reassurance.The five major allergy types - wheat, dairy, eggs, nut and soy - are covered in this book and each recipe is guaranteed to be free of at least three of these allergens and many are free of them all! If there is any doubt you can then reel the list of ingredients off in advance to double check there is no misunderstanding as to the nature of the allergy. Colour coding with each recipe lets you see at a glance if it is suitable or not - great for browsing.Everything is presented in a hassle-free, friendly style and this is quite uncommon for books of this nature. Invariably, despite their intentions, they become tongue-tied and confused if you scratch below the surface. They do many things well but there is always a weak point or two. This book rocks! Each recipe is simply and cleanly laid out, great inspiring introductions, prep time and cook time broken out (hurray!). Ingredients are separate to the extensive instructions. Even portion sizing and nutritional information is provided. The reviewer, who has no known food allergies (dislikes, on the other hand), found a wealth of interesting recipes that absolutely do not scream \"special requirements\" anywhere. For those who wish to learn more there are additional reference sections covering how to spot a possible food allergy, tips to buying allergy-free foodstuffs, how to read often complex food labels and much information that can demystify a mystifying subject. For those not based in the U.S. there might be some minor differences between labelling requirements, standard product formulations and the like, yet with this book you will still have a great understanding on the subject and more knowledge about how to check things out.This book has one of the best, most comprehensive indices yet seen. First there is an extensive recipe index by allergen, split into meal types. Then the very lengthy general index that even breaks things down by ingredient type so you can really dig deep and get inspiration. Hopefully the authors will consider using this book's format as a template for further more extensive recipe books for allergies. Just think, 500 starters, 500 mains and 500 desserts in this format. Sure, it hits a different market segment, but it really can be suitable for all.Even if you don't envisage catering for those with food allergies, this could be a great resource if not for the recipes alone. You never know, of course, when you might need this allergy-specific information too!Allergy-Friendly Food for Families, written by the Editors of Kiwi Magazine and published by Andrews McMeel Publishing. ISBN 9781449409760, 248 pages. Typical price: USD25. YYYY.// This review appeared in YUM.fi and is reproduced here in full with permission of YUM.fi. YUM.fi celebrates the worldwide diversity of food and drink, as presented through the humble book. Whether you call it a cookery book, cook book, recipe book or something else (in the language of your choice) YUM will provide you with news and reviews of the latest books on the marketplace. //"}, {"userName": "Cheeyee", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/5205724-cheeyee", "userReview": "Review At: Moments to ShareReview Date: 27 Feb 2012Review URL: http://littlemermy.blogspot.com/2012/02/allergy-friendly-food-for-families-120.htmlSummary:In the last several years, there has been increases in the rates of allergies amongst the children. When we first introduce solid foods to the babies, we will test if they are allergy to the food by giving the same food for three days consecutively. This is important as being a mom, you certainly want to make sure the food given to our children is safe for them. This book, Allergy Friendly Food for Families will become very handy for those parents that have children that are allergies to certain type of food at home. Or even if your children do not have any food allergies, but you may have different people in the family have preference to certain type of food, for example the boy maybe don't like eating nuts, while the mama does not like dairy products, so instead of cooking different food for different family members, you can also opt for a recipe that are both nut-free and dairy-free that everyone at home can eat. It's easier for the one who prepares the food, it's also make everyone happy that they won't feel left out or someone complains that he misses his favorite food because another person in the family can't eat it.The recipes available in this book are divided into 6 categories: Breakfast Lunch Dinner Dessert Snacks PartiesFor each recipe, it will show whether the recipe is gluten-freen, dairy-free, nut-free, egg-free and soy-free. The preparation time, cooking time, how many servings per recipe and the nutrition for each servings are clearly stated. There are also some recipes that allow your children to cook together with you. Some tips on food and info or facts about the type of food are included too. Total there are 120 recipes altogether. And most of them are easy to make. I would say the more challenging part is more on sourcing for the ingredients. Some food like rice milk we can make ourselves at home. But some food like, soy=free, nonhydrogenated margarine, we definitely have to learn to read the lables for the food we are buying. I also love the picture of the food show next to the recipe. Unfortunately not all recipes are showing the picture of the food.Note: I receive the digital ARC of this book from the publisher via Net Gallery. I was not required to write a positive review. The opinions I have expressed are my own."}, {"userName": "Sara Thompson", "userReviewDate": "Apr 13, 2012", "userURL": "http://www.goodreads.com/user/show/5242215-sara-thompson", "userReview": "This is a great book for families who have recently had a child diagnosed with a gluten, dairy, nut, soy or egg allergy or are learning to juggle multiple food allergies. The book starts off with tips for food safety and reducing cross contamination. It goes on to an FAQ section with experts before moving onto the recipes. The recipe section is coded with the 5 allergens – gluten, dairy, nut, soy, egg. Each has its own color square on the edge of each page so that locating recipes with that particular allergen gone is easy to do. The recipes are broken into meals – breakfast, lunch, dinner, desserts, snacks, and parties. There are some rather neat features with this book. The first thing I noticed is that most of the recipes omit the allergen instead of trying to come up with a substitute. There are substitutions in this cookbook but not as many as other cookbooks have offered. I know that when we were gluten free it was far easier to come up with recipes that didn’t use gluten foods than it was to replace the gluten foods. The next thing I noticed was these cool sections on cooking with your kids. So many forget to teach their children how to cook and when it comes to food allergies, learning early is best. I loved the party section because there are always parties from birthdays to class parties and it’s nice to have beautiful ideas that taste good. The book wraps up with Building an Allergy-free Pantry. This is a great tool. It helps the user create a list of staples and explains the reasons why these ingredients are so important (including tips for using the item). I would gladly recommend this book. My only complaint is that it didn’t come out when we needed it."}, {"userName": "Cyndi", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/4757468-cyndi", "userReview": "This would be a 3.5. My daughter is dairy-free and many nuts aren't good for her either. So I have been trying to get more creative with our meals because I was feeling a bit in a rut. I thought this book did a good job or recommending substitutions or options to make the recipes X-free. We did have a recipe that didn't turn out so good - instead of egg the corn-cakes called for warm water and flax, and it just didn't work out. (so -1 star) We're ok to eat eggs, so I put some in there, next time, I will make sure my cornmeal is finer ground and just use egg instead of flax. But the granola was very tasty as was the edamame, carrots, and shells. Also made some of the muffins - yum! The other 1/2 star subtraction was that my daughter is super picky and for being \"family friendly\" there were several recipes that I thought wouldn't be something she would want to try. All-in-all though, I'm glad that I own this book :-)"}, {"userName": "Chanpreet", "userReviewDate": "Feb 19, 2012", "userURL": "http://www.goodreads.com/user/show/5334800-chanpreet", "userReview": "I've been a vegetarian for most of my life, and find it difficult to find good recipes that I can use as is. This cook book abounds with recipes not only for those who have allergies, but for those who are trying to live conscientiously. The breakdown of recipes by meal times and the wide array of recipes makes this cook book a wonderful addition to your collection. Recipes are further marked by color according to which food allergen it is free of. That way you can make sure that it will be appropriate for consumption.I am a huge fan of almond milk. It was the recipe I made and enjoyed the most. Some other favorites were the tofu scramble with spinach, the egg free frittatas, no cream of broccoli soup, and the lentil burgers. I would definitely take a look at this cook book if you have food allergies or have chosen to be vegan. It's good for vegetarians as well, if you want to make substitutions with dairy products if there is no allergy, they also work out well."}, {"userName": "Deb", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/1090093-deb", "userReview": "Although I am not allergic to any of the five main allergens--gluten, dairy, nuts, eggs, or soy, I do have dairy sensitivities with my allergies and asthma, so I was happy to get sent a copy of this book to review. All of the recipes are free of at least two allergens and many are free of all five. Overall the recipes look good and seem easy to follow and the book contains nutritional information for each. The information it contains on food allergies, stocking an allergy-free kitchen, making nutritious food fun and getting kids involved with cooking make it a great resource for any individual or family living with food allergies. Many of the recipes are vegetarian and vegan-friendly, which I like. I would give it a solid 3.5 stars.My complete review is here along with pictures and the recipe for the Cool Zucchini Noodles with Mighty Marinara Sauce:http://kahakaikitchen.blogspot.com/20..."}, {"userName": "Mrs.soule", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/2591608-mrs-soule", "userReview": "Lots of vegetarian & vegan recipes - we expecially like the \"Polenta Mini Pizzas\", \"Greener Sloppy Joes\", and \"Coconut No-Cream Pie\". I also appreciate the sections for \"Party\" (with finger foods and cake & ice-cream substitutes) & \"Snack\" recipes. My favorite feature of this cookbook is the \"Cooking with Kids\" pages sprinkled throughout the book on how to get your smaller children involved in the cooking process."}, {"userName": "Virginia", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/6415097-virginia", "userReview": "Some simple but creative ideas for meals, especially lunches. It's easy enough to substitute an ingredient for most recipes if the particular recipe you're interested in isn't perfectly suited to your allergies. Sprinkled throughout the book are great tips on teaching kids how to help in the kitchen."}, {"userName": "Amanda Ripsam", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/6344425-amanda-ripsam", "userReview": "I am a moms meet ambassador and I love reading kiwi magazine I used my point to get it. The topics are great for family's mostly relatable to moms like myself. There is also giveaways to enter and recipes that is a nice bonus"}, {"userName": "Ames", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/3879697-ames", "userReview": "Great recipes and alternatives. Would not be the best book for severe or multiple food allergies, but plenty of basic recipe alternatives for the lactose, or gluten intolerant to name a few.(Finished in 2014, Changed Year to not affect my current reading challenge book count)"}, {"userName": "Natashya KitchenPuppies", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/2486245-natashya-kitchenpuppies", "userReview": "Colourful and well organized - this book from the editors of Kiwi Magazine provides delicious and nutritious recipes for families with multiple food sensitivities. See my full review here - http://livinginthekitchenwithpuppies...."}, {"userName": "Molly", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/242240-molly", "userReview": "I liked this- it met most of my needs and I like the format. But I can understand from some of the other comments that this might not work for people looking for comprehensive allergy-free recipes."}, {"userName": "Maggie", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/977512-maggie", "userReview": "I picked up this book to find food I might be able to make for my nephew who has food allergies. And I ended up with a big list for myself. There are options for everyone including meat eaters. I can't wait to try out some of the vegan recipes."}, {"userName": "Rebecca Tolley", "userReviewDate": "Apr 23, 2012", "userURL": "http://www.goodreads.com/user/show/969626-rebecca-tolley", "userReview": "read my review on my blog, here: http://www.potlikkery.com/2012/04/all..."}, {"userName": "Heather", "userReviewDate": "Apr 18, 2012", "userURL": "http://www.goodreads.com/user/show/1643138-heather", "userReview": "See my full review here: http://www.girlichef.com/2012/04/cris..."}, {"userName": "Stephanie", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/3850295-stephanie", "userReview": "This book is FILLED with delicious and fun recipes that help me stick to \"going without\" so many things. I'll be using many of these recipes for years to come, especially as my kids get older!"}, {"userName": "Nita", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/5416179-nita", "userReview": "borrowed this from the library but so am gonna have to buy it!"}], "description": "Feeding a family with food allergies doesn’t have to be boring or tasteless. Kiwi, the premier magazine about raising families the natural and organic way, presents 120 great recipes to keep your family happy, healthy and sane.Allergy-Friendly Food for Families is the most trustworthy, comprehensive, practical, and kid-friendly collection of recipes that exists for the important and growing audience of allergy-aware families. Unlike other allergy cookbooks, this book covers not one or two allergens, but the five most common allergens in kids: wheat, dairy, eggs, nuts, and soy. Each of the 120 recipes is free of at least three of these allergens; most are free of all five.When parents are desperate for ideas for what to make for dinner (or lunch, or snack time), they want recipes from someone they trust, for food that tastes good, that doesn't require a lot of fancy ingredients, and that the whole family can eat. Allergy-Friendly Food for Families is the ultimate resource. From the three crucial mealtimes (breakfast, lunch, dinner) to the \"fun\" foods families can't live without (desserts, snacks, parties), parents are completely covered. Perhaps most importantly, all of these recipes are simple for parents to make. Recipes such as Carrot Cake Breakfast Cookies, Pear Yogurt Dunkers, Good-for-you Nachos, Polenta Mini Pizzas, Giant Cookie Cake, Veggie Bite Soup, and Cool Zucchini Noodles will make kids forget they have allergies. Parents will love the additional informational sections on spotting food allergies, stocking an allergy-free pantry, deciphering labels, and other frequently asked questions.Food should be delicious; family time should be fun. This book reflects those values.", "title": "Allergy-Friendly Food for Families: 120 Gluten-Free, Dairy-Free, Nut-Free, Egg-Free, and Soy-Free Recipes Everyone Will Enjoy", "url": "http://www.goodreads.com/book/show/13007018-allergy-friendly-food-for-families", "average": 3.44, "cover": "https://images.gr-assets.com/books/1349067026l/13007018.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/5313435.Kiwi_Magazine", "name": "Kiwi Magazine"}], "type": ["Food and Drink", "Nonfiction", "Food and Drink", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/13007018-allergy-friendly-food-for-families"]}