{"ratings": 9017, "userreviews": [{"userName": "Ariel", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "I read this in a few hours on a train trip and thoroughly enjoyed it. The whimsy, the humour, the constant metaphor! I was a little unsure what I was walking into, but that ended up being fun. It's a story about a woman who has been hypnotized into thinking that her husband is invisible the night of their wedding. After a few months of not seeing her husband she gets on a plane to abandon the relationship, but she doesn't know that he has been beside her this entire time and has this last plane ride to convince her that he's there! It's cute and happy and I found it really clever. I would definitely read this again, or at least flip through the profiles of all the hilarious superheroes!"}, {"userName": "Nat", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "“What would make this perfect?”I read the description for this book and was instantly captivated by the premise of the magical blending in with the everyday:All Tom's friends really are superheroes.There's the Ear, the Spooner, the Impossible Man. Tom even married a superhero, the Perfectionist. But at their wedding, the Perfectionist was hypnotized (by ex-boyfriend Hypno, of course) to believe that Tom is invisible. Nothing he does can make her see him. Six months later, she's sure that Tom has abandoned her.So she's moving to Vancouver. She'll use her superpower to make Vancouver perfect and leave all the heartbreak in Toronto. With no idea Tom's beside her, she boards an airplane in Toronto. Tom has until the wheels touch the ground in Vancouver to convince her he's visible, or he loses her forever.Honestly, I’m amazed with the author’s brain for coming up with each of the peculiarities in here. Superheroes include: the Couch Surfer (“Empowered with the ability to sustain life and limb without a job, steady companion or permanent place of residence”), the Falling Girl, the Shadowless Man, the Inverse (“Shake the Inverse’s hand and the exact opposite of your life will flash before your eyes”), The Projectionist, Hypno… and with the addition of an anxiety monster appearing at the door when, you guessed it, you’re feeling anxious (“There are two ways to get rid of an anxiety monster, my friend – you either have a bath or a nap.”).This humorous love story between a normal man and a super-heroine, The Perfectionist, explores the power of ignoring someone and how it can drive them crazy or close to it... Which I found incredible because I had just recently talked about this exact premise and how nothing is quite as hurtful as ghosting someone out of the blue. All My Friends Are Superheroes is both silly and serious, which is quite a feat to concur in writing. Andrew Kaufman definitely succeeded, though, in my eyes.Bonus points for making this feel like a short story, since it was a lot of fun to read I never noticed the page numbers changing while reading, and also because the book itself is on the slimmer side.And the fact that there were stories inside of stories also enveloped me further into the book. I loved in particular this love story between two invisible people, who are painted in different colors (blue and orange) to remain visible to the outside world:(It's long but definitely worth the read.)“Then one day, a Wednesday, the Blue Outcast worked late at the call centre. He waited for the 6:04 streetcar. Normally he got the 5:15. This is where he saw her. She was hard to miss. She was orange.The Blue Outcast was in line for the front doors of the streetcar. The Orange Exile was exiting through the rear doors. They made brief eye contact, but nothing more.The Blue Outcast changed his routine. He took that streetcar, the 504, at 6:04 every day. The Blue Outcast and the Orange Exile noticed each other more and more. They made eye contact for longer periods of time. The Blue Outcast made sure to be at the end of the line for the front doors of the streetcar. The Orange Exile made sure to be first out the back doors. They began waving to each other as they passed on the street. They still hadn’t chatted or exchanged names. That didn’t seem to be the point.Six weeks after they’d become aware of each other, a thunderstorm rolled across the city. The rain backed up the storm drains. Lightning struck close to the Blue Outcast’s call centre. It was 7:30. He’d missed the 6:04. He was the only one in the office. The sound boomed through the room. He looked out the window to see if there was any damage.At that exact moment, the Orange Exile was looking out the window of her apartment. The call centre and the Orange Exile’s apartment were directly across from each other, on the second floors of three-storey buildings.The Blue Outcast looked at the Orange Exile. Lightning cracked again. She put her index finger in her mouth. She pulled it out. It wasn’t orange any more. It was invisible. She held it up for the Blue Outcast to see.The Blue Outcast cried. His tears cut streaks of invisibility down his face. He stepped back from the window. He undressed. Naked, he left the call centre. He walked to the ground floor, stepped into the rain and looked across the street where orange feet and orange legs were standing in an orange puddle.They stood in the rain. The Blue Outcast looked up at the sky and held out his arms. He let rain fall on his face. He looked down at his hands and didn’t see them. He looked back across the street and couldn’t see the Orange Exile.Neither of them has been seen since.”This was riveting.With plenty of heart and more than a little humor, All My Friends Are Superheroes has  me intrigued to check out other works by Kaufman in the near future.Oh, and I also listened to this next song on repeat while reading, thanks to the most recent Skam update.\nNote: I'm an Amazon Affiliate. If you're interested in buying\n All My Friends Are Superheroes, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "3 ½ stars.  It'll make you smile. The perfect mental gargle after a few heavy novels, creative and just plain fun. Fantasy with a judicious touch of magical realism, everyone in it's a superhero (except for the main character) but they’re subtle about it, we're not talking a bunch of flamboyant cape wearers. Instead each person’s strongest characteristic is what defines their super-power, bet you’ll find yourself wondering what yours would be... It can be silly, so prepare for a few eye rolling moments but there’s some depth to it as well. This is Kaufman’s bestselling debut, if you like him read The Tiny Wife. It’s darker and I thought quite a bit better, but that's more about my personal taste - I like dark.So if you're into stories that are strange and unusual, give this one a try. Cons:  I need more fleshed out characters. This one’s got about 40 which is seriously too many for a 120 page book:) Don’t worry though, they make brief appearances flowing in and out of the story - no need to try and keep track of them at all. \"Mr. Opportunity. He knocks on doors and stands there. You'd be surprised how few doors get answered.\""}, {"userName": "Barry Pierce", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "This is such a nice, short fairytale. Nothing more. You can read it in less than a half hour. Makes you feel happy and full of awe at Kaufman's wonderful story writing ability."}, {"userName": "Tfitoby", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "This book is totally adorable. It's not going to change your life, it's not Earth-shattering prose, it's just plain unadulterated pleasure to read.I wish I could've finished it in one sitting but it's difficult to finish 107 pages on the bus journey to work. But then again if I had finished it without pause I wouldn't have known what it was like to put it down and feel the need to pick it up again.There's not much I can tell you without spoiling it BUT it is a wonderful love story AND the superhero metaphors work really well 98% of the time.To list some comparitive adjectives may be the simplest way to review it: funny NOT hilarious, nice NOT brilliant, short and sweet NOT epic and overly descriptive, playful NOT absurd.My least favourite aspect are the short interludes where Kaufman introduces some other superheroes, most of which are trying too hard to be funny and fail completely and I do mean eye-rollingly bad attempts at jokes that might have been funny if i'd read this when it was first released in 1999 and I was 17.edit: I'm just floating this review in an immature contest to be the most liked versus Leah's review of the same book which is actually better than mine."}, {"userName": "Melki", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "Tom is just a regular guy, though all his friends are not. They are SUPERHEROES with SUPER POWERS! True, their powers may be somewhat odd. There's The Businessman who can calculate the net worth of passersby, The Couch Surfer, a man imbued with the ability to live off of his friends' generosity and Tom's new bride, The Perfectionist, whose source of power is her need for order. Alas, their love story goes pear shaped on their wedding day when a suggestion made by one of Perf's old beaus, Hypno, makes Tom invisible to his wife. Now Tom is floundering, attempting to solve a riddle that will get his love to see him again. . . before she walks out of his life for good.This is the perfect storm of quirky, romantic silliness and proved to be just the right book at just the right time. I loved, Loved, LOVED it. And now, it's confession time.I, too, am a superhero. I am The Rememberer. I am empowered with the ability to remember conversations (yes - only conversations, not impressive things like obscure historical facts or sports scores). I can remember what someone once told me over twenty years ago. Of course, when I bring up a tidbit that someone casually mentioned so long, long ago, the subject is so startled, they deny ever having said such a thing. Vehemently. I never said that, they say. Yes. You did, I say. This goes back and forth for a while, but always ends the same way. THEY think I'm THE CRAZY ONE!Whew. Being a superhero is exhausting. In fact, sometimes, it sucks."}, {"userName": "Leah", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/5456299-leah", "userReview": "A perfectly sweet little book. I read it in less than an hour, which I love. It has something of the romantic comedy about it, and something delightfully quirky that I have come to associate with Canadian creations - although admittedly I am mostly thinking of Scott Pilgrim here. A little off-centre, a little tongue-in-cheek, it's kind of like one perfect slice of cake: not too big, not too small, leaves you feeling all warm and gooey inside without feeling overindulged.The little vignettes of twentysomething life are charming and heart-tugging, from a first kiss after being painted into a corner, to realising you don't need so much stuff after your moving van with all your possessions inside is stolen. Now that I think about it, there was a lot of the slightly surreal sweetness of this book in the recent Australian film Griff the Invisible.As with many short stories and short novels, I can see this being a really lovely movie, done properly. But that's not the point. I think the quote on the back said it best, that this book would be replacing flowers and chocolates as romantic gifts in the future. I can't think of nicer praise to give."}, {"userName": "Sara", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/6132476-sara", "userReview": "Not sure where to start. Well, let's start from the cover: \"Buy it, borrow it, steal it but just make sure you read it\". Dear Mr. Scott Pack (whoever you are), if I ended up in jail for stealing this book I would be really, REALLY pissed off. I think the author wanted to be all deep and profound, trying to convey a message camouflaged under a weird story (is there a story? I just saw a collection of episodes and descriptions). Well, if there was a message, I thought it was VERY, VERY well camouflaged. All I see is a bunch of 'superheroes' who aren't real, aren't fictional and, most of all, aren't interesting. I kept waiting for a big revelation to finally understand the point of wasting my time reading about useless 'superpowers', but no revelation came. I really can't understand it - maybe it's just me, but how can you define this 'an adorable book' or an 'ode to love built to last'?! Again, maybe (probably) it's just me. I'm usually cheesy enough to understand this kind of thing, but maybe this book goes beyond my 'superpowers' - after all, I'm just a 'regular'."}, {"userName": "Wiebke (1book1review)", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/6315232-wiebke-1book1review", "userReview": "This was a very fast but cute read. The story is so imaginative. I liked the things that made people into superheroes and the way that affected their lives. And the story about Tom and The Perfectionist is just so cute. I couldn't put it down!Reread this February 2016 and just loved it like the first time. Go read it, if you haven't yet!"}, {"userName": "Bill", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "So one of my wife's friends recommended this book to me because she knows I love to read and we both read The Martian, so now, apparently we are book buddies. She likes anything Chick-Lit or Rom-Commie, (people who know me, know those are not my preferred genres), so I had more than a smidge of apprehension about actually reading this one. Honestly, I was intrigued by the cover and liked the title, so decided to give it a shot. Glad I did. It was really a very good story and after an initial \"Uh oh, what did I get myself into\" it really took off and clicked for me. There was more than enough strange character threads and weirdness keep me entertained and the ending was really \"sweet\". Very well done."}, {"userName": "Max Urai", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/17004114-max-urai", "userReview": "The title of this book is \"All my friends are Superheroes.\"Congratulations, you have now read the one good thing this book has to offer."}, {"userName": "erigibbi", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/66796812-erigibbi", "userReview": "Tom sta cercando di risolvere un problema serio: riuscire a tornare visibile agli occhi della donna che ama per la quale è appunto invisibile da 6 mesi. La donna in questione non è una donna qualunque ma sua moglie. Tom è ormai sconsolato e si sente anche un uomo mediocre perché da un anno è circondato da supereroi. Non supereroi classici, muscolosi e perfetti, tutt’altro. La stessa moglie di Tom è una supereroina: la Perfezionista. Purtroppo però Perf, nel giorno del suo matrimonio, ha subito un incantesimo da parte del suo ex, Ipno, che le impedisce di vedere Tom (ma lei ovviamente non ne è al corrente e infatti è convinta che Tom l’abbia lasciata). Quando sta per atterrare a Vancouver Perf cerca di utilizzare i suoi poteri per dimenticare questa triste vicenda che le sta logorando il cuore e Tom ha così pochissimo tempo per cercare di farsi vedere da lei ritornando visibile.Si tratta di una bellissima storia d’amore, molto originale e per quanto drammatica possa essere è stata anche una storia a tratti divertente. Un tributo all’amore molto toccante e che vi può riscaldare il cuore in una giornata grigia e deprimente.Trovo poi bellissima l’idea dell’autore di parlare in questo modo dei “supereroi” i cui superpoteri sono stati utilizzati come categorie per esplorare manie, fissazioni e debolezze dell’uomo. Ve ne cito alcuni: il Bradipo, la Presenzialista, l’Ospite, Una Notte E Via e infine il Consolatore; per non dimenticarci di Perfezione, la protagonista femminile del libro.Volevo comunque lasciarvi alcuni passaggi che mi sono piaciuti particolarmente nella speranza che capiate l’inglese (altrimenti scrivetemi nei commenti che vi darò una spiegazione): But because they all have a superpower, and everyone they know has a superpower, having a superpower is nothing special to them. What’s special to them is not having a superpower.[…] ‘I don’t remember a single monster before I met you,’ he’d told the Amphibian. ‘Now they seem to be all over the place.’ ‘You mean there wasn’t anything you were afraid of?’ the Amphibian had asked him. ‘Lots.’ ‘What did they look like?’ It was a funny question. ‘They didn’t look like anything. They were ideas’.[…] She was still feeling reckless. She took off his skin. She took off his nervous system. She lifted up his rib cage. His heart beat in her hand. And there, underneath it, she found a jewelled golden box. She opened it. Inside she found his hopes, his dreams and his fears. She stared at them. She was surprised to find them there and surprised at how beautiful they where. At the exact moment, the Perfectionist fell in love with Tom.[…] ‘We’re here,’ the Clock says. The Perfectionist open her eyes. She sees nothing. It’s white. All white. There’s no up. There’s no down. No horizon. Nothing. It’s just white. ‘Clock, what is it?’ asks the Perfectionist. Her voice is shaky. ‘This is the future.’ ‘This is the future?’ the Perfectionist asks. Her mouth is dry. She forces herself to swallow. ‘Why is the future like this?’ ‘Because it hasn’t happened yet,’ says the Clock.E con queste, a mio avviso, splendide citazioni, concludo dicendovi che spero veramente tanto che leggiate questo libro!"}, {"userName": "Hanne", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/9653496-hanne", "userReview": "If you’re ever nostalgic for bedtime stories, the ones that made you float to another world that was both sweet and sad but made you smile all the same, than this is the book for you. Reading this book felt like spending time with some of the best books of my childhood, but then the adult version.The story is about Tom, a regular non-superhero, who married a superhero (‘The Perfectionist’). On their wedding day however, a mean ex-lover of hers who has the power of Hypnotization made sure that he would no longer be visible to his wife. She thinks Tom has disappeared, and for six months Tom has been trying to undo the damage, but time is running out when she decides to move away and start life anew somewhere else. What makes this story so brilliant is that there are so many layers to it. You can chose to which depth you want to read the book. You can just read the story for what it is, and enjoy it. But given the way it’s written, it’s not very hard to go a level deeper and realize that being unique is just one small step away from being a superhero – it all depends on your definition. Although it’s interesting to note that we might look at others and realize they have some superhero-skills, we keep seeing ourselves as ‘a regular’.There are some special superpowers but most of them sound quite everyday. I had a good laugh though with many of them. I thought Andrew Kaufman got very creative and witty with these, being very imaginative but still describing them in such a way that they are utterly recognizable and so very, very human. ‘Mr.Late’ is always late, but something of great importance will happen to you while you’re waiting for him. It is however still extremely annoying.”‘The Jumper’ has jumped aboard, ahead and to conclusions. He’s jumped into love and out of the frying pan. ‘Someday’ has red hair, a compact frame and two superheroes: an amazing ability to think big and an unlimited capacity to procrastinate.Another theme is the Power of Love, and what it in the end can pull of, no matter what the odds and obstacles are. Or how perfect it is, because she’s called the Perfectionist, not so much because of her perfectionism (though she is that too, she even gets frustrated for not being able to organize snow), but because she has the uncanny ability to make things perfect for him (On cue: 3…2…1… Awwwww)."}, {"userName": "Portal in the Pages", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/26859021-portal-in-the-pages", "userReview": "Well I am late for work and might have cried."}, {"userName": "Jozef", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/17099831-jozef", "userReview": "Super citanie! Krasne. Vesele aj smutne. Uplne mi to sadlo. Cital som original v anglictine, ze by aj to prispelo k tomuto zazitku? Kazdopadne chcem od tohto autora citat viac :)"}, {"userName": "MJ Nicholls", "userReviewDate": "Oct 20, 2010", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "There are better ways to pass the time than reading 100 pages of saccharine whimsy. This book is so cute I want to punch its face in."}, {"userName": "Lúcia Collischonn", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/20696807-l-cia-collischonn", "userReview": "Such a creative take on superheroes. I loved their powers. The story is so adorable :) the perfect cure for a reading hangover. Loved it ❤️"}, {"userName": "Elly", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/27877374-elly", "userReview": "4.5/5 starsOver the years I have heard nothing but praise for this book from Carrie Hope Fletcher. Ever since I have been aching to pick it up. For Christmas last year I was given the book and couldn't be more excited. Flash forward to BookTubeAThon and I finally pick it up. First off, I really enjoyed the simplicity of the world and the magic that comes with it, but honestly, I couldn't stop thinking of Carrie! So far I have read two of her books and I couldn't help but see the similarities between this book and On the Other Side. I can clearly see where Carrie pulled from Kauffman's style! If I had read both of the books without knowing the authors I 100% would have thought they were written by the same person. If anything, I think that goes to show how much we are influenced by our favorite things. This is Carrie's favorite book, so obviously she would take her favorite stylistic things about this book and apply it to her own. Back to the book itself, I really did enjoy it. I read the 10th anniversary edition and apparently it features a lot more Superheroes. Personally, I enjoyed the story more than the Superheroes, but a lot of them really made me stop and think. Half the time I read about a Superhero and just think they are an exaggerated version of the worst/best traits in society. But then next I'd read about a girl who literally cries televisions and scrap my philosophical ideas of the Superheroes. Honestly, to some extent I think the Superheroes represent the average of society only turned to 100. It made me think that literally anyone can be a superhero for literally the smallest thing. But then I'd get confused as to why the main character isn't a superhero. Because surely at this point he could be classified as heartbroken man or something to that extent. Long story short, I highly recommend this book. It is short and light and vastly different from most other books out there. Despite dealing with Superheroes and magical realism, it still feels relatable in the most primal sense. If you are looking for light magic or an escape from the world, I'd check this book out. It is deep, but at the same time light enough to help you escape from your own troubles."}, {"userName": "James", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/3301814-james", "userReview": "A deeply charming story of a man invisible to his superhero wife, the perfectionist. In around a 100 pages Andrew Kaufman takes the wonderful idea of everyday features taken to superhero heights through a simple love story. The central conceit is that people have a single trait or characteristic, to paraphrase the author, that can be boiled down to a super hero name. As an aside the book also points out that the superheroes in some cases have a hard time coming to terms with their ability citing mr brutally honest, one night and the gambler as examples. Tom is in love with the Perfectionist, but at their wedding she is put under a spell by her ex the Hypno and Tom is now invisible to her. I found it very funny indeed and in the end touching. Magical realism, allegories and indeed love stories are responsible for some really shockingly dreadful books, so it's nice to see it done well and without the brain dead moralizing that usually accompanies especially the first two genres.A delightful way to spend an hour or two and you get the added bonus of being able to use meetings and conferences to develop your own cast of superheroes from your colleagues e.g. Captain tone deaf, or The droners. Andrew Kaufman does it very well with some of my favorites from him below.The SlothThe Sloth would sit on his couch, paralyzed by all the things he wasn't taking care of. Then one day, a Wednesday, he just said, 'Fuck it!' He threw his hands up into the air and said, 'Fuck it!' This was the day that the sloth discovered his superpower, an amazing ability to say 'Fuck it' and really, truly mean it.” The Stress BunnyIf you arrive at a party and suddenly find yourself completely relaxed, there's a good chance the Stress Bunny is there. Blessed either the ability to absorb the stress of anyone in a 50 foot radius, the stress bunny is invited to every party, every outing. Her power originates from her Strict Catholic upbringing."}, {"userName": "Evie", "userReviewDate": "Jun 10, 2008", "userURL": "http://www.goodreads.com/user/show/812952-evie", "userReview": "This book was a sweet surprise. I picked it up by chance at a yard sale knowing nothing about it. I started it before bed and when I forgot to take it to work with me the next day, all I could think about was when I could go home to finish it. Completely charming.EDIT: I have lent this book to three people since I've read it, and all loved it. Even those who are not prolific readers devoured it quickly and joyfully."}, {"userName": "Francesca", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/31502192-francesca", "userReview": "I absolutely loved the ideas in this book. The superheroes and their powers were fantastic and I loved how unique and strange they all were. I liked what the powers represented and I thought there were some lovely messages in here. The story is short and sweet and full of wonderfully strange moments which makes it definitely worth the read. Something about it didn't quite grab me the way it seems to have got to others, though. I really can't place my finger on what it is. Part of me thinks that maybe if it was slightly longer and some of the plot and the main two characters were slightly more developed then I may have enjoyed it even more but then I'm not sure because if the book was longer it might lose some of the fantasy and the mystery to it. As I said I'm a bit stuck on this one. Overall, I did very much enjoy this book and there were elements to it that I did love even though I didn't necessarily love the whole story itself."}, {"userName": "Rebecca (whymermaids)", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/4713345-rebecca-whymermaids", "userReview": "What a wonderful, beautiful, heartbreakingly romantic little book. I don’t want to say too much about this book, because knowing too much about it ahead of time would ruin a first time reading. What I will say is this book is simple and quick (120 pages) and something everyone should read. In it’s essence, it’s a love story; a perfect, wonderful little love story told in a unique way, which also praises individuality and personality quirks and fighting to hold on to those things which are real.Don’t be put off by the “S” word in the title if that’s not your thing; it’s moderate and creatively done, and these aren’t your cape-wearing crime fighters.Like ginger after sushi, this is a really great palate-cleanser, and is silly and quirky and fun, and will fit in between two larger reads with ease.It’s harder to find in the States, but well worth the scavenge."}, {"userName": "Joseph", "userReviewDate": "Jan 15, 2008", "userURL": "http://www.goodreads.com/user/show/375171-joseph", "userReview": "Despite what it says in the blurb on the back of the book, this is pretty far from being what anyone might call a \"novel.\" But as a lengthy short story, it's pretty charming.To be honest, though, a lot of it felt like a compilation of quirky ideas that would have benefited from a little fleshing out. The paragraph-long descriptions of superheroes, for example, would have been more interesting as actual characters with whom the protagonist was forced to interact, rather than merely a clever reappropriation of the mundane as extraordinary.Regardless, the story and main characters are interesting as is the author's ideas about what constitutes a superhero. Quirky, clever, charming ... just not long enough.Also, and this might seem a strange thing to say, but it's written on absolutely marvelous paper."}, {"userName": "Rosianna", "userReviewDate": "Jul 07, 2009", "userURL": "http://www.goodreads.com/user/show/731288-rosianna", "userReview": "A beautiful vignette into a world set slightly askew to our own in which all of Tom's friends really are superheroes while he is a Regular and - more tragically - invisible to his wife, The Perfectionist. Andrew Kaufman writes with perfect humour, the right balance of detail and a sense of Tom's longing to be seen present throughout. I loved it; if Kaufman were a superhero no doubt he'd be The One Full of Little Truths You Never Really Thought About."}, {"userName": "Pranta Ghosh Dastider", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/20310470-pranta-ghosh-dastider", "userReview": "An interesting concept wasn't properly used, that's how this book felt. There were information all over the places, which weren't relevant at all. Main story was tiny and rest of things felt like filler. Some places read nice, and if this was made a short story with only the main part then I would have rated it 4 stars at least. Either way, I guess this was not my cup of tea. Romance lovers can try this out if they may."}, {"userName": "Jim", "userReviewDate": "Feb 06, 2008", "userURL": "http://www.goodreads.com/user/show/281393-jim", "userReview": "This was a wonderful book. I loved it so much I went to the trouble of writing a full review on my website. You can check it out here: What kind of superhero are you?"}, {"userName": "Isabel", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/32575323-isabel", "userReview": "As much as I appreciated the concept and delightful way Kaufman executes it, the story failed to warm my heart the way I expected it to. Plenty of quirk, but overall I was rather bored by the narrative and didn't find it entirely cohesive. (2.5)"}, {"userName": "Kay", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/6920736-kay", "userReview": "Short, sweet book.Kaufam's take on superheroes and their \"powers\" is so original and thought provoking. The best, and most interesting take on a relationship story that I've ever read. It was't too long or drawn out either. Like a burst of citrus, it was refreshing and short."}, {"userName": "Matt", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/47664772-matt", "userReview": "This book was a pleasant surprise and such a unique story, I'm giving it 4.5 stars."}, {"userName": "connie", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/34065304-connie", "userReview": "cute concept & fun read"}], "description": "\"One of the saddest, funniest, strangest, and most romantic books. . . . Brilliant!\"--The Bookseller (UK)All Tom's friends really are superheroes. Tom even married a superhero, the Perfectionist. But at their wedding, Perf is hypnotized by her ex-boyfriend, Hypno, to believe Tom is invisible. Nothing he does can make her see him. Six months later, the Perfectionist is sure Tom has abandoned her, so she's moving away. With no idea Tom's beside her, she boards a plane. Tom has until they land to make her see him.This tenth anniversary edition adds short stories, illustrations, and a foreword to the cult classic that has been a bestseller in the United Kingdom, Germany, and Sweden.Andrew Kaufman is the author of The Waterproof Bible and The Tiny Wife.", "title": "All My Friends Are Superheroes", "url": "http://www.goodreads.com/book/show/16057372-all-my-friends-are-superheroes", "average": 3.83, "cover": "https://images.gr-assets.com/books/1364258700l/16057372.jpg", "reviews": 1146, "authors": [{"url": "https://www.goodreads.com/author/show/413783.Andrew_Kaufman", "name": "Andrew Kaufman"}], "type": ["Fiction", "Fantasy", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/16057372-all-my-friends-are-superheroes", "http://www.goodreads.com/book/show/944334.All_My_Friends_are_Superheroes", "http://www.goodreads.com/book/show/12407928-all-my-friends-are-superheroes", "http://www.goodreads.com/book/show/788572.All_My_Friends_Are_Superheroes", "http://www.goodreads.com/book/show/9699504-tutti-i-miei-amici-sono-supereroi", "http://www.goodreads.com/book/show/10146440-the-tiny-wife", "http://www.goodreads.com/book/show/13584334-born-weird", "http://www.goodreads.com/book/show/6978487-the-waterproof-bible", "http://www.goodreads.com/book/show/32762350-small-claims", "http://www.goodreads.com/book/show/36274893-geborene-freaks", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}