{"ratings": 22875, "userreviews": [{"userName": "Cheri", "userReviewDate": "Jun 24, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Rick Bragg draws the poor rural Southern upbringing so truthfully from his own past, and while it may be foreign from my own, it is a background I am very familiar with. Southern roots run deep, they ran deep in my grandparents, and in my father’s distant memories, that grew less a part of him as he flew all those miles trying to put it behind him. Poverty isn’t about location. It isn’t only found in Bragg’s hometown. Alcoholics are everywhere. Abusive husbands and fathers are rarely news. I can’t begin to imagine who I’d be with those same memories. You only have to read about the difference in how it affected him vs. his brothers to know no one has the same story to tell even when they’ve grown up in the same house. Much like that old “telephone” game played by so many so many years ago, the story changes as each person relays what they heard. But I don’t need to have had his experiences growing up; I’ve heard his story, have heard my father’s stories, my grandparents’ stories. I know enough to know to be grateful. As you might expect, being the rural South, religion figures in this memoir, but it’s gently weaved through his stories covered as a journalist, his personal stories of funerals attended, crosses born. It’s the people, the experiences, the feelings and emotions, his stories of home; his family overflow with nostalgic imagery. Sometimes painful to read, softened somewhat through the passage of time.It’s his profound love of his family, his mother, his brothers, aunts, uncles and cousins that is ever-constant this memoir speaks to me, the sense of family, the religion of place, the sense of belonging, this is what connects me to Bragg, the recognition of the holiness of family, be they biological or man-made."}, {"userName": "Diane Barnes", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I decided to re-read this one, as it was the July pick for the group On the Southern Literary Trail. I first read it when it was just published and since have read the other two family memoirs he's written, \"Ava's Man\", the story of his grandfather and his mother's family, and \"The Prince of Frogtown\" the story of his alcoholic father. Rick Bragg is a poet who just happens to put everything down in prose.He is a proud Southerner who has found a way to get past his young shame at being poor and uneducated, and has found the noble and courageous qualities in his family and \"his people\" as he calls his community of Piedmont, Alabama, where he was raised. His father was a drunk who abandoned the family when he was six, and his mother raised three small sons on welfare and family charity, along with picking cotton, doing rich people's laundry, and cleaning their houses. To say he has honored his mother in this book would be an understatement - he has darn near exalted her to Sainthood - but it is a status that seems to be deserved.This is not just the story of his childhood, but his journey as a newspaper reporter with 6 months of college who learned his craft on the fly. His bravado and talent earned him a job at the New York Times and a Pulitzer Prize along the way, but his proudest achievement in life was being able to buy his mother a house and get her out of the 2 room cabin she had lived in for 30 years.Rick Bragg's writing is a thing of beauty and comes from the heart. If you've never read him, do yourself a favor and put this book on your list."}, {"userName": "Ethan", "userReviewDate": "Sep 17, 2010", "userURL": "http://www.goodreads.com/user/show/1436646-ethan", "userReview": "This book was difficult to read. Not because of the descriptions of poverty, but because of the author. Bragg's bloated, melodramatic prose and the massive chip on his shoulder made reading this book a chore. What is the unholy attraction to one-line paragraphs? The godawful overwritten and pompous (humble beginnings, perhaps, but certainly not humble endings) narrative made me nauseous. The writing reminded me of Tuesdays With Morrie, another book that could have been decent if not for the melodrama. As I read passage after passage about his travels, it occurred to me that Bragg's brand of journalism is little more than ambulance chasing: he zips in, catalogs the hurts for his audience (composed of the very same people he insults for most of the book) and then zips out to collect his paycheck and journalistic accoladdes. Perhaps if he had spent less time talking about the great things he's done (and quoting himself, ugh) it might have been a better book. Perhaps if he'd actually toned down his obvious dislike of all things non-poor-southern. I don't know. This thing was fingernails on a blackboard for me.There are moments in this book that are nice, and passages that are beautiful, but they are smothered by the rest of the garbage. It's obvious from the ratings that a lot of folks really love this book, but I am wholly unimpressed. These stories have been told much, much better by others."}, {"userName": "Caley Rogers ", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/834022-caley-rogers", "userReview": "This book is FILLED with wonderful imagery and is the memior of New York Times write Rick Bragg. Here's a quotation: \"This is not an important book... Anyone could tell it, anyone who had a momma who went eighteen years without a new dress so that her sons could have school clothes, who picked cotton in other people's fields and ironed other people's clothes and cleaned the mess in other people's houses, so that her children didn't have to live on welfare alone, so that one of them could climb up her backbone and escape the poverty and hopelessness that ringed them, free and clean.\""}, {"userName": "Alison", "userReviewDate": "Jul 19, 2007", "userURL": "http://www.goodreads.com/user/show/198053-alison", "userReview": "I am a Yankee (although I now live in the South), and this book darn near killed me. It made me cry just about every time I picked it up. I still get weepy just thinking about how his momma came to New York, or when she stood up to his daddy after pouring out his moonshine and said, \"just don't hurt my teeth.\" Some may find Bragg's writing unbearably over-the-top in its aw-shucks Southernness, but if simple lines like that don't punch you in the gut, you could possibly be made of stone."}, {"userName": "Rachel", "userReviewDate": "May 11, 2010", "userURL": "http://www.goodreads.com/user/show/2499261-rachel", "userReview": "Literature of the American South has always been a favorite of mine. Flannery O'Connor, Robert Penn Warren, Tennessee Williams -- not only is their work spiritually and emotionally complex, it's heady with a feeling of place. In the first quarter of this book, Rick Bragg replicates that feeling almost better than the classics. While all of the authors mentioned above capture the South in a way that feels real, none of them have made me feel so truthfully how alien the rural, poor Southern upbringing is from my own middle class East Coast background. I had a distinct sense of \"you know, for as much as these books make me dream of the South, I will never fit in there.\" It's an excellent reminder of how deep everyone's roots run.Bragg's memoir is also excellent as concerns his momma, whom he writes about with such love and tenderness that it's hard not to see her from his adoring perspective. The middle through almost the end of the book, as Bragg discusses his adulthood and journalism career, were just OK for me. Many of the stories he told, from Florida to Haiti to New York City and back home, were fascinating, but I didn't feel he earned some of the connections he made between his own life and the lives of the criminals and victims he covered for the news. Claiming to understand Susan Smith's urge to make herself appealing to a rich man to escape her poor millworker family background is \"emotionally generous\" all right, given that she killed her children to do it. (I don't think it was truly factors of class that led her to that decision. I don't think Bragg is naive enough to think that either.)Upon finishing most books, my urge is more often to rate them a star higher than they probably deserve. My urge with this one was the opposite -- I initially wanted to say I just \"liked it.\" But the deep love for family that bookends this memoir really resonates with me. In fact, it affected me so much that in the middle of reading it, I went to visit my 100 year-old great grandmother in the nursing home for the first time in a couple of months. Her health has declined so much in the past year. She walked for herself and cooked for herself well into age 99, but then she got sick around Christmas and now she can barely understand words, push herself out of the chair, or stay awake during the day. There's almost none of her left and it's very, very difficult to see. But because of this book, I felt how important it was to try. I did what I feared I would and cried when she had trouble understanding a simple sentence repeated over and over, but she was happy for the visit."}, {"userName": "Larry Bassett", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "Rick Bragg would get five stars for telling a good story. The fact of the matter is he got the Pulitzer Prize for telling good stories. I even liked most of his stories, even the ones about alligators. But I actually give him three stars because I did often wish that he wouldn’t be such a good ole boy and would just get to the point. The sad thing is that his mother had a really hard life and there wasn’t really very much he did to make it better. Sure, he saved his money and bought her a house. Of her, he says, “Of course, she was still there, surrounded by those old sadnesses. Nothing seemed to change on her side, except the calendar.”” I didn’t get into this business to change the world. I just wanted to tell stories. But now and then, you can make people care, make people notice that something ain’t quite right, and nudge them gently, with the words, to get off their ass and fix it.” --Rick Bragg I am a latecomer to the writing of Rick Bragg who won a Pulitzer Prize for feature writing in 1996 for the NY Times. All Over But the Shoutin’ is the first book in the Rick Bragg trilogy published in 1997 that has gotten very good reviews from members of the GR group On the Southern Literary Trail. Bragg is a journalist, a fact that attracted me to his work and to look forward to reading what he writes.At least part of a memoir is memories. I know I had a third brother, an infant who died because we were left alone and with no money for her to see a doctor, that he did not live long enough to have a name. I know his gravestone just reads Baby Bragg and my momma never mentioned him to us, for thirty years, but carried his memory around deep inside her, like a piece of broken glass. Rick Bragg describes a world that I can hardly imagine. This was, remember, a world of pulpwooders and millworkers and farmers, of men who ripped all the skin off their knuckles working on junk cars and ignored the blood that ran down their arms. In that world, strength and toughness were everything, sometimes the only things. It was common, acceptable, not to be able to read, but a man who wouldn’t fight, couldn’t fight, was a pathetic thing. To be afraid was shameful. I am not saying I agree with it. It’s just the way it was. When I started at the beginning, the book was hard to read. The words were skillfully written and sometimes beautiful but the meaning made it rough going, slow moving. Hard to read about such a hard life. But somehow Bragg writes about a hard life like it was more than a mite interesting. He says that even when you are poor, the “one great meal of the day was breakfast, because breakfast is cheap.”  To this day I dream not of beautiful women and wealth and power as often as I dream of sausage gravy over biscuits with a sliced tomato on the side, and a small lake of real grits – not that bland, pale, watery restaurant stuff I would not serve on death row, but grits cooked with butter and plenty of salt and black pepper. Just so you know that Bragg did not just write about breakfast in poverty, there was plenty of this: That night, for no reason at all beyond the fact that he was drunk, he went mean again. Momma, as always, tried to fend him off even as she herded us out of harm’s way, back into the bedroom. We hid not in the bed but under it, and whispered to each other of how you reckon you can kill a grown man. …Daddy would return from God know where every now and then, but only to terrorize us, to drink and rage and, finally, sleep like he was dead. He would strike out at whoever was near, but again it always seemed that she was between him and us, absorbing his cruelty, accepting it. Then he would leave, without giving her a dime, without asking if we had food, without giving a damn.How could anyone enjoy reading a book written with these details, even though it was well written? The book has a good reputation in the reading group, people assured me that I would be glad I had read it. What could they mean? Well written brutality could not be that attractive, could it?Bragg experienced plenty of religion in his youth and his mother bought it a dollar at a time from the TV evangelists when they were destitute.Some of those TV preachers did good things with their millions, and some lied, cheated and stole, so it’s unfair to lump them all into one pile. But I wish those bad ones could have seen my momma with her hand on her thirty-five-dollar television, believing. Maybe they would have done better. Probably not. It just makes me angry. I am just mystified by this book. Serious thing are buried behind a laugh. …she extracted three promises from us before we went out to play.One: Don’t kill yourself.Two: Don’t kill each other.Three: Try hard not to kill nobody else, but if you have to, better if it ain’t fam’ly. “Life was sweet, often, and the crises were small.We were poor, but we were not dull.”Too many of the crises seemed more than small to my way of thinking. I just don’t have much of that kind of sense of humor, I guess. Maybe this is the place someone else might think bittersweet.The NY Times reviewer wrote when the book was published in 1997:  In a time when Bragg's family was at rock bottom, without food, a black boy from down the road brought them some corn his mother had sent over. ''In the few contacts we had with them as children, we had thrown rocks at them . . . I would like to say that we came together after the little boy brought us that food, that we learned about and from each other, but that would be a lie.'' In the brutal realities faced by those like Bragg who were not ''white,'' not really, poor whites chose not to band together with blacks but to instead live in ''two separate, distinct states.'' One would have liked to see even more commentary on this critical topic from so honest and thoughtful an observer.I can relate to that observation with the echo that this book is so much and yet still could have been so much more. Bragg brings us a real worldview from inside the life of white trash. He escaped that world and I want so much more from his award winning pen.Bragg learned early that you didn’t need to be black to be discriminated against.  The principal and teachers, when they recognized who we were, where we ranked, told Sam that he could sweep the narrow halls, clean the bathrooms and shovel coal into the school’s furnace, to earn his free lunch. He took out the trash and burned it and unclogged the toilet. They never bothered to teach him to read very well; he learned that on his own. They never bothered to tell him about the world outside his narrow, limited one. They forgot to show him maps of the universe or share the secrets of history, biology. As other students behind the classroom doors read about empires, wars and kings, he waxed the gymnasium floor. OK, so here I am forty percent of the way through the book and tired of reading about being white trash in the South. Then, the scene changes and before I know it I am in Times Square New York City. And then I am covering football and stock car racing. And loving it. But Bragg couldn’t stay in college or remain a sportswriter. He was just too good a writer and story teller.In the rest of the time in the book he alternates between telling about his family, a family that often had a problem with alcohol, and telling stories about being a journalist. He tells stories about being in terrifying situations that are somehow told as adventuresome events. Like the one about the alligators. I dropped like a sack of mud straight down into the black water of the eighteen-foot canal, and knew that I would surely die. I rose up to grasp the side of the boat, scared to death, waiting for one of those twelve-foot monsters to clamp down on my legs and drag me down. … I know that gators prefer a nice piece of rotted turtle to human beings. I had read National Geographic, too. I know they usually will not attack human beings if there is a poodle anywhere near, but none of that went through my head as I hung there, helpless. It was only for a few minutes, but time has a different meaning when half your body is submerged in black water aswarm with alligators, the same gators your hunting partners had been jabbing with cold steel most of the night. He tells story after story while smiling at danger with a completely straight face. This is what makes him a great storyteller.  I thought for just a second that I might die there. I am not trying to be melodramatic. Reporters live for war stories, except the ones who have been so genuinely frightened in so many terrible places that they do not need to scare themselves all over again with their own memories. But for just a second, on that sand road in the middle of the scrub, I knew I had risked my life for five or six paragraphs. Rick Bragg parted ways with the NY Times in 2003 with a disagreement over his methodology of writing. He took credit for an article that a freelancer had mostly written and then claimed that practice was common at the NY Times. When he left the Times, he reportedly had a million dollar advance from a publisher for his next book. So he wasn’t poor anymore. Now he writes for Southern Living magazine. Here is a short video that will give you a glimpse of what the man has become: http://www.southernliving.com/communi... . In this video he says, “Sweet tea might be a cliché, but it’s a delicious cliché.”Occasionally Rick Bragg does manage to get serious with his writing, to drop the folksy, Southern storyteller persona. But not often enough in this book as far as I am concerned. He is way too busy being a good ole boy most of the time, spinning the tales. Bragg considers himself to be a good talker. I can imagine him being a standup comedian talking about growing up poor in the South. He is a self-made man.I spent a lot of time looking for the “ring of authenticity” in his writing but not finding it except maybe when he was talking about covering sports from the press box early in his career and having trouble getting the numbers and names right. And his times in Haiti when he seemed to be a visitor to atrocities with a guide taking him to the stories and to the bodies for a price.I once worked closely with a man who talked by telling stories. He would never answer a question directly but instead would tell a story. You had to figure out what it meant. I was not that I never knew what the point was to his stories. I usually could figure it out. But it did make it hard to pin him down sometimes when he was especially indirect. Rick Bragg is like that for me. He is often interesting to listen to but sometimes you just want him to get to the point. To actually say something.One of the things that Bragg tells a lot of stories about is drunks. His father was a serious drunk. His younger brother is one. He is an incipient alcoholic himself, I would say. His Momma “has tolerated drunks all her life; she is good at it. She expects it.” I am curious about what has become of his life since this book was published over fifteen years ago. I have the next two books of the trilogy on my TBR shelf but my general disappointment with All Over but the Shoutin’ bumps them a little bit down on my list. Bragg described himself as “gothic, dark and personal” and I would like to see him show more of the man behind the screen."}, {"userName": "Mister Jones", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/688091-mister-jones", "userReview": "I read this one awhile back, and I loved it. I tend to like confessional autobiographies that don't shy away from flaws and shortcomings, and so I tend to be partial to works that are. Bragg's book is all that and then some--growing up poor in Alabama, small town with the those who have too much and those who have too little, and having to deal with it with the support of his mother. It's tough writing, gritty, and in your face with no apologies and lots of personal pain. GREAT!(yeah, I know this was a lame critique, but I didn't know where to begin with this one--so overwhelming and so moving)"}, {"userName": "Gary", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/37678060-gary", "userReview": "minimalist, naturalist, with indeterminate ending - the ending doesn't sit right, but it's a fine essay A young man comes to see his dad for the last time, and they can only communicate through the inanimate objects and old stories, so they can't talk about their feelings. Right, like the dad wanted to or the son could. But the son, many years later, says he is still a prisoner of that last meeting. I guess he should go out more often, but more likely, he was just trying for a good ending."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : All Over But the Shoutin' - Nevisande : Rick Bragg - ISBN : 679774025 - ISBN13 : 9780679774020 - Dar 329 Safhe - Saal e Chap : 1997"}, {"userName": "Bonnie", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/264570-bonnie", "userReview": "There are books you read that not only make you grateful for what you have, but especially for what you haven't, or more correctly what you never thankfully experienced.Rick Bragg, Pulitzer Prize Winner for news editorials, touches you to the bone and breaks your heart ever so silenty with his memoirs of growing up in poverty, alcoholism and abuse on account of the father, but love as you've never read on account of the mother.This is not a rags to riches story but one of rising from the ashes to reveal the truth of oneself and one's family from the hardest of times in the back country of the Appalacians.Beautiful story. Beautiful talent. Beautiful man, author, Rick Bragg."}, {"userName": "Lori Cooper", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/31993498-lori-cooper", "userReview": "As much as I love Southern literature, I hated this one. His mother strikes me as a lazy, nasty woman who did not discipline her rotten boys or teach them manners. The author seems to say, \"Hey, look at me, how much better I am than anyone!!! I'm SMARRRRTTTT!\" I got so bored with his writing that if I ever get a hold of this guy, I will choke him. . . I mean it. I actually thought about using the pages as toilet paper, but alas, I used it for kindling instead. Not really. No matter how bad a book is, I could never burn it. But I came close with this one!"}, {"userName": "Kirk Smith", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "This is the second book I have read by Rick Bragg, and I'm sure I would enjoy about anything he writes. Ava's Man was about his family. This book honors his Mother, but is more of a memoir, with examples of the articles from his career as a reporter. Rick acknowledges the motivations that took him from poverty to \"respectability\". AP awards and Pulitzer Prizes were one of his motivations, but the desire to \"make his Mother proud\" was primarily what drove him to excellence in his field. There will probably be at least 1-2 more of his books to be added to my future reading lists."}, {"userName": "Rachael", "userReviewDate": "Aug 17, 2007", "userURL": "http://www.goodreads.com/user/show/283064-rachael", "userReview": "I read this after looking at it sitting on my then boyfriend's bookshelf for years, and never considered it. In a desperate fit of needing something to read, I picked it up, and it instantly became my favorite book ever. I don't think it still is--it was more a function of what I wanted at the time. But for a long time I thought that if people wanted to understand how I felt about my mom they'd just have to read this book.His stories about working as a journalist are interesting too, but it was really his stories of his mom that did it for me."}, {"userName": "Kiwi Begs2Differ  ✎", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/12287031-kiwi-begs2differ", "userReview": "This is a fantastic memoir from a master storyteller who conjures up a deeply human portrait of a dirty poor white family in the US South. Bragg is a journalist and he sure has a gift with words. An eloquent writer, the stories he writes about are vivid and show raw and genuine emotions.I liked how the author recounted his less-than-idyllic childhood in Alabama without dwelling in sentimentality and somehow managed to put some humor in it. I liked that he did not shy away from his failures as a husband, brother and even as a son. Some passages were deeply moving, I felt for him and for his poor mother, what a sad life but what a strong woman she is. I know when I’ve met an author whose work I admire by the fact that I fall in love with their characters. This is one of those cases; Bragg makes me wish I knew his mother. I was less interested in the chapters when he recounts his early job-hopping as a sport reporter, but this would be nitpicking, really, this was an exceptional read for me.I don’t know how this book came to be on my TBR, but I’m grateful to the person I borrowed this title from. If you like memoirs, love stories from the South or simply enjoy skillfully crafted writing, this book is for you. 4.5 stars.Fav. Quotes:Of all the lessons my mother tried to teach me, the most important was that every life deserves a certain amount of dignity, no matter how poor or damaged the shell that carries it. The only time I ever made her truly ashamed of me was the day I made fun of a boy from a family that was even poorer than us. His daddy had shaved his head to cheat the lice, and I laughed at him, made fun of him, until I saw the look in my momma’s eyes.I thought he would be the man and monster of my childhood. But that man was as dead as a man could be, and this was what remained, like when a snake sheds its skin and leaves a dry and brittle husk of itself hanging in the Johnson grass.She kept going back, even after she realized he might never change, not because she loved him in that pitiful way some women love bad men, but because there were whole months at a time when he did pay the electric bill, when he did give her money for groceries. There were long months when he held his children with something very close to love, when he was sober, mostly, and kind. There were nights at the table when he sat with a baby on his lap and spoon-fed him, and laughed when one of us daubed food in his face. It never lasted. It was a dream sandwiched by pain.I know she does not hate me. I was only wasted time. You do not hate the time you waste; it evokes a much more passive emotion than that. You only wish you had it back, like a quarter in an unlucky slot machine.It is a common condition of being poor white trash: you are always afraid that the good things in your life are temporary, that someone can take them away, because you have no power beyond your own brute strength to stop them."}, {"userName": "Darlene", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/1809697-darlene", "userReview": "I have been reading a lot of memoirs over the past few months and All Over but the Shoutin' is by far, the best I have read (and I've read a lot of good ones, by the way!). Journalist Rick Bragg takes us from his difficult childhood in Alabama... characterized by poverty and the abandonment by his very troubled alcoholic father to his early adult life as a reporter and eventually to his work at the New York Times for which he won a Pulitzer Prize.It wasn't just Mr. Bragg's story or the way in which he so skillfully wrote it which really resonated with me; it was the way in which he seemed to be trying to make some sense of his life. He seemed to believe that the only way to understand HIS life was to try to understand the lives of the people in his family and his community. This made sense to me. I have always believed in the quote from Socrates....\" the unexamined life is not worth living.\" Mr. Bragg, in writing his memoir, was doing just that... engaging in what was often painful self-examination.... without whining and without making excuses. If you have ever heard a song or read a book which seemed to be speaking directly to you, then you'll understand how I feel about this book. Mr. Bragg told his incredibly difficult and moving story, not by shaking his fist at God or the world, as people often do but in a way which amazingly expressed his deep gratitude... for his family and most especially his mother. His mother was clearly the center of the story and fittingly the center of his life... his mother who picked cotton and took in ironing so that he and his brothers could have what they needed... the mother who wore shoes with her toes peaking out of the tops so that he and his brother could have decent shoes. This was the woman he was clearly so grateful to and wanted to share his achievement with her. But I think he, himself,expressed it more beautifully than I can when he was talking about how he felt when he won the coveted Pulitzer Prize. He wrote...\"This glorious thing, this prize, was validation of my mother's sacrifice. It was payment-not in full, but a payment nonetheless- for her sweat and her blood.\"If you are looking for some inspiration or just a reason to feel thankful for your life, I highly recommend this wonderful book!"}, {"userName": "Mary", "userReviewDate": "Jul 21, 2010", "userURL": "http://www.goodreads.com/user/show/2862333-mary", "userReview": "One of my favorite genres is the memoir and this one tops my list. You could say it is the Southern version of Angela's Ashes, written by a son in tribute to his mother.Bragg is a \"good ole boy\" whose narrative voice is as thick and Southern as sweet tea. He and his two brothers grew up dirt poor in Alabama with a long suffering mother and a ne'er do well father. Rick is the brother who made good, becoming a Pulitzer Prize winning journalist. But no matter where his stories took him - to major cities and far flung locales - his heart remained in the Deep South with his Momma.This is his Momma's story and it isn't a pretty one. His family didn't live in proud, genteel poverty, they lived in squalid, spirit crushing poverty. It is an old story in many ways with an alcoholic father battling his demons and a mother unable to see her way out of a hopeless situation. His mother never prevailed, she was barely able to raise her children. But what she lacked in vision, she made up for in determination to feed her sons no matter what. Rick watched her grow old before her time doing hard physical labor of the most menial kind in a world where that appeared to be the only option. In his adulthood he wanted nothing more than to share his success with his beloved mother, only to find that she could never relate to his world. She was a simple woman with simple needs whose past could never be mended by her son's well meaning gifts and adulation. She looked for no compensation for the years of hardship and she held no bitterness towards the people and the circumstances that kept her mired in a life of deprivation and heartache. The story is told with unflinching honesty. Bragg is forthcoming about his own failed relationships and the demons his father passed down to one of his brothers. He admits his ongoing struggle to forgive his father who lived and died a broken man, leaving a damaged family behind. He traces some of his family back a generation or two in order to explain his mother's world view which would otherwise seem nearly incomprehensible to an outsider. At the end of the book Bragg doesn't have a resolution to the grim reality of his childhood, but his memoir is a catharsis and a tribute to his mother's redeeming love."}, {"userName": "Snotchocheez", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "A few weeks ago, I wrote a review of Annie Proulx' \"memoir\" (er, whine session) \"Bird Cloud\", where I commented that after reading it, she'd be the very last person I'd care to meet in person. The very polar opposite of that book (and that author's life-of-privilege bitching and moaning) is the exuberantly triumphant, life-affirming \"All Over But the Shoutin'\". After reading \nthis\n memoir, not only do I want to meet Rick Bragg (its author), I want to spend hours picking his brain, shoot some hoops with him, go barhopping, play some Xbox, even (*cringe*) catch some NASCAR action at Talladega, meet his mom, eat grouper sandwiches on the gulf...In short, it's pretty hard not to admire this guy after reading this. With an almost-aw shucks humility, he recounts his life from growing up dirt poor in Possum Trot (Jacksonville), Alabama, raised along with two brothers by their mother (who had to pick cotton in the nearby fields because the father abandoned the family)...and somehow, imbued with his mother's love and hard work ethic, was able grow up with his pride and dignity intact, get out of rural Alabama, follow his muse and become (eventually) a (Pulitzer Prize-award winning) journalist for the New York Times.It's kinda hokey to say trite words like \"This book changed my life!\" However, I wish I had the opportunity to have read this memoir (written in 1997) before my own mother's passing; it's almost entirely an homage and a loving tribute to his mother, a lasting testament providing validation for the hard work and sacrifice his mother endured to give her boys a better life than she had. Which, essentially, is what my mom did for me (a sacrifice that I took for granted). Just read it, you won't be sorry. (Make sure to read its equally excellent companion piece: \"Ava's Man\", which goes into detail about Mr. Bragg's mother's side of the family.)"}, {"userName": "Patricia", "userReviewDate": "Feb 07, 2009", "userURL": "http://www.goodreads.com/user/show/966448-patricia", "userReview": "Bragg is a good writer and can conjure up a sentiment and atmosphere, no problem. But I almost didn't finish the first half of the book, which was written entirely in folksy dialect--as he later says, rustic witticisms. That may well be his natural way of speaking, but I wonder if his own family reads this and thinks, yes, that sounds just like Rick, or if they, like me, think it's distracting to pack QUITE so much down home flavor into EVERY sentence. Having recently read Mark Twain's autobiography, I couldn't help but compare. Twain surely had a southern way of talking and telling a story, but he limited the \"rustic witticisms\" and reserved the dialect for quoted dialogue. With better effect, I think.The second half of the book was interesting but sometimes had the effect of being just a collection of his New York Times clippings from that time in his life.Still, all in all, it's a touching portrait of Bragg's mother and a family with dynamics that are universally recognizable, and it succeeds as a sometimes painfully honest self-portrait.I acquired this book (free, via BookMooch!) because Bragg's memoirs will be Kalamazoo, Michigan's reading-together project this year."}, {"userName": "Jenny", "userReviewDate": "Jan 02, 2008", "userURL": "http://www.goodreads.com/user/show/630066-jenny", "userReview": "Published in 1998, I believe, this memoir describes the author's childhood growing up very poor in rural Alabama and his path towards becoming a Pulitzer Prize winning journalist at the New York Times. The final chapters are absolutely beautiful and it was nice to end the book on a high note, because parts of the story became very stale for me. I give the author a lot of credit for being honest about himself and his weaknesses (the chip on his shoulder about growing up poor and not having access to opportunities and resources; his bad temper; the way in which he pushed people who cared about him away and just focused on his work), but sometimes it got hard to read the memoir of someone who wasn't particularly nice and who kept talking about the ways in which he wasn't. Tangentially, I liked many of the descriptions of the stories he covered in the U.S. (New York and the South) and Haiti in the early-mid 1990s. In college at the time, I wasn't very tuned in to national and world news and these descriptions reminded me of some dark things that happened at the time. It helped fill in a news/history gap for me."}, {"userName": "Peggy Crawford", "userReviewDate": "Oct 27, 2007", "userURL": "http://www.goodreads.com/user/show/76251-peggy-crawford", "userReview": "I thought this was the best book that I had read in years. Rick Bragg simply tells the story of his life, his father, mother, and his brothers. It was not a happy life, but he's not complaining. It's more like a tribute to his mother, how she just kept going, through often horrible difficult times. Bragg is a journalist, and how he got into that field could have made a good book all by itself. While it's about a lot of difficult times, it's a beautifully written story that make your heart glad. Wish you could get to know the author and his family."}, {"userName": "Ned", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/21232850-ned", "userReview": "Written as a reporter, purely autobiographical yet authentic with self-censoring fairness. I will read the others in this series."}, {"userName": "Lisa", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/223374-lisa", "userReview": "A memoir written by journalist Rick Bragg of his life in northeastern rural Alabama. Poverty and an abusive alcoholic father are hard to overcome, but with the help of his dedicated, loving and hard working mother and her family, he is able to find a way to a job in journalism writing first for his school paper and then moving up through different papers to the New York Times and even a Pulitzer Prize. Bragg’s writing is superb and within the first few paragraphs I had a lump in my throat which only slightly dissipated as I neared the ending of this excellently told life. The South and racial relations come into play as do family and its responsibilities. Bragg’s intention seems to be to praise his mother for her cotton picking, laundress, house cleaning, welfare accepting days. This intention is well done and she is a well deserving woman for all she was put through and helped her son come out on top. He elevates her and he does it gracefully and lovingly. His lines are to be remembered:“Mama just stepped back on the treadmill of worry and hopeless, and kept walking.”“But I just stood there, trapped somewhere between my long-standing comfortable hatred, and what might have been forgiveness. I am trapped there still.” – in reference to his father\"...because hungry does not have a color\"I wish I had highlighted more but please take a chance on this and give it a read or a listen."}, {"userName": "Patrick Ross", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/19248744-patrick-ross", "userReview": "I wish I could give this book a higher rating. Many people swear by it, and it was a good read. But I fear I've been focused too heavily on the craft of memoir writing the last two years, because while reading I kept seeing so much more the author could have done with it.The opening is one of the best I've ever seen in a memoir. It sets just the right level of humility while making me curious about his poor upbringing, his saintly mother, and his demon father. And his story is a compelling one, and an uplifting one. I was happy for him when he got his first out-of-town newspaper job; when he won the Pulitzer; and when he was able to buy his mother a house. But the voice of the book is so thick with bitterness, resentment and, I'll venture, insecurity. He admits near the end of the book he has a big chip on his shoulder, but says it's getting smaller. It's still very big to tolerate for an entire book. I get that he has felt looked down upon because of his poor upbringing and initial lack of education (he later got to study at Harvard, so he's now ahead of most folks in that department), but I found his continued clubbing on these points uncomfortable. I say insecurity because often people who have to keep harping about how far they've made it still deep down don't believe they deserve to have made it. If he came out and confessed to deep-seated insecurity that would add some nuance to the read, but Bragg mostly, well, just brags.He has covered some interesting stories, and it's interesting to hear him retell them in the book. But at times he seems to fall in an easy trap for a journalist, a sense that because others experienced the story because of your writing that you are part of the story, or as big as the story. In my time in the world of journalism I've tended to surround myself with those who truly saw themselves as outside of the story, separate from it. I found myself wondering sometimes why so much of the book focused on his reporting career. At times he seemed to use those stories as a vehicle to look into his past to show the reader how far he had come. I would have liked more of that.What I really would have liked more of is actual scene. A memoirist naturally has to do a lot of telling, more so than a novelist. But a little show is nice as well. Bragg, like most feature reporters, is good at painting scenes. But usually he would write conditionally, as \"we used to do this\" or \"I remember Mama always doing that.\" I don't think it was the journalist in him afraid to do a scene from memory, because he does write some scenes. The scene where he visits his father for the last time before the man dies is really powerful. I fear he didn't have more because it's simply easier to write in summary, and what we learned of how his journalism career ended--relying on an intern's reporting and taking credit for it--suggests someone open to short cuts.My only concern with the otherwise brilliant opening was that he seemed to present such polar positions of the parents, the saintly mother and the demon father. I liked that the father was actually painted in a more nuanced way, with some back story on how his war experience may have affected him, and later with the author admitting he may have some of his father's flaws himself. (A memoir is always at its most powerful when the author looks hardest at him/herself.) But the mother doesn't come across as a saint. It's clear Bragg loves his mother and wants to honor her with the book. But the way he slants details suggests a certain condescension. I realized that there are a lot of times where he talks about her more like you would talk about your love for a really simple but loyal farm dog. He allows us to hear her poor grammar and almost mocks her resistance to the trappings of his success. I found myself cringing at times, while realizing Bragg himself likely did not intend that reaction in me.Bragg is a great writer, and he has a good story to tell. It could have been told so much better, and that is too bad. It is still worth a read if you keep in mind that you'll be spending a lot of time with someone who is still pretty bitter."}, {"userName": "Tiffany", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/11180043-tiffany", "userReview": "I too am Southern like Mr. Bragg. I love the cadence and melody of a southerner's storytelling. It fills my soul. I am proud if my heritage; the good, the bad, and the horrible. This kind of history creates amazing, visceral stories and truly strong, faithful humans...And of course it can beautiful, strong southern men who love their strong beautiful southern mamas."}, {"userName": "Nancy", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/8490681-nancy", "userReview": "This is actually my second time reading this excellent book. With his descriptions (i.e. \"...where the wallpaper hung like dead skin...\"), you get a wonderful visual of the heart-wrenching story he tells of growing up very poor in Alabama and his unlikely climb to a Pulitzer Prize winner. At the center of this story are the sacrifices of his mother, who was often mistreated by her often-drunk husband, and left for long periods of time with no way to support her children. There were times she would flee, with children in tow, to her family. (\"There would always come a night when she put our clothes in paper sacks and buttoned our coats, begging us not to cry, to shush, baby, we're goin' to see Grandma.\") This book, however, is not a pity party. It's a reflection for Bragg of what drove him, what he values, and the importance of family. This is a memoir that's open and honest and heartwarming. I thoroughly enjoyed it...both times."}, {"userName": "Kathy", "userReviewDate": "Oct 12, 2008", "userURL": "http://www.goodreads.com/user/show/884917-kathy", "userReview": "I had a love-hate relationship with this book, and I have now divorced it about halfway through. He's a lovely storyteller, but I found his stories did several bad things for me:- Reinforced all my negative stereotypes about southerners.- Made me feel helpless in the face of class barriers, which no one in his book really overcame. Even him.- Reminded me how much I dislike memoirs. He claims it is not a sob story, but the reality does not support his claim.Now I can get back to reading \"Edgar Sawtelle,\" which the library bought more copies of. Hurrah!"}, {"userName": "Jennifer", "userReviewDate": "Oct 29, 2007", "userURL": "http://www.goodreads.com/user/show/586018-jennifer", "userReview": "http://mulibiiidb.marshall.edu:80/rec...Self-described paid-storyteller and Pulitzer-Prize-winning-narrative-journalist, Rick Bragg has used the storytelling techniques he learned from his people to write two best-selling memoirs that redefine the boundaries of the genres of memoir and creative nonfiction. His speakerly texts combine the voices of the working class of the Alabama foothills of Appalachia, his own voice as a member of this culture, and his narrative journalistic voice. In his works, Bragg has managed not only to carve a place for the voice of the working class, but also to celebrate and preserve the oral culture, history, and beautiful language of his people, the working class."}, {"userName": "Alison", "userReviewDate": "Jun 10, 2007", "userURL": "http://www.goodreads.com/user/show/124482-alison", "userReview": "Jennifer leant this book to me. This is a wonderful memoir from a Pulitzer Prize winning journalist who grew up in poverty in Alabama in the 50's & 60's. It is a tale of how God-given talent and a fierce human spirit can triumph over circumstances and against the odds. And it's a love letter to good mamma's everywhere."}, {"userName": "Susan Albert", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/967151-susan-albert", "userReview": "Brash, strong Southern voice, compassionate picture of a mother doing her best to make do for her three boys and an alcoholic father who disrupted their lives."}], "description": "The story of a violent, war-haunted, alcoholic father and a strong-willed, loving mother who struggled to protect her three sons from the effects of poverty and ignorance that had tainted her own life.The extraordinary gifts for evocation and insight and the stunning talent for storytelling that earned Rick Bragg a Pulitzer Prize for feature writing in 1996 are here brought to bear on the wrenching story of his own family's life. It is the story of a violent, war-haunted, alcoholic father and a strong-willed, loving mother who struggled to protect her three sons from the effects of poverty and ignorance that had tainted her own life. It is the story of the life Bragg was able to carve out for himself on the strength of his mother's encouragement and belief.", "title": "All Over But the Shoutin'", "url": "https://www.goodreads.com/book/show/470495.All_Over_But_the_Shoutin_", "average": 4.09, "cover": "https://images.gr-assets.com/books/1327905477l/470495.jpg", "reviews": 1528, "authors": [{"url": "https://www.goodreads.com/author/show/31122.Rick_Bragg", "name": "Rick Bragg"}], "type": ["Autobiography", "Nonfiction", "Biography", "Biography Memoir"], "outlinks": ["http://www.goodreads.com/book/show/470495.All_Over_But_the_Shoutin_", "http://www.goodreads.com/book/show/9067502-all-over-but-the-shoutin", "http://www.goodreads.com/book/show/1755672.All_Over_but_the_Shoutin_", "http://www.goodreads.com/book/show/1030726.All_Over_but_the_Shoutin_", "http://www.goodreads.com/book/show/108067.Ava_s_Man", "http://www.goodreads.com/book/show/2060666.The_Prince_of_Frogtown", "http://www.goodreads.com/book/show/24396962-my-southern-journey", "http://www.goodreads.com/book/show/6502869-the-most-they-ever-had", "http://www.goodreads.com/book/show/18635022-jerry-lee-lewis", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}