{"ratings": 942, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "4.5 For over twenty years now I have had a few go to authors, authors whose books I looked forward to, never let me down. Pat Conroy was one of them and I would so have loved to meet him in person, envy those who have. I feel this loss of opportunity and the loss of this fabulous author even more so after having read this wonderful collection of blog entries, speeches and of course his eulogy. There is so much humor, his admiration for other authors and yes he names them, the state of publishing today, his history in the Citadel, basketball, his friends, his family, the editors he has had the privilege to work with and along side. So much, his wife the author Cassandra King. His wit, his intelligence, his humanity and his love for his home shines through. Regrets, sorrows, joys, one definitely gets the full range of characteristics that made him the special person he was.I have read all his books but two, one nonfiction on his writing life and his cookbook, which I didn't know about. Was intruded to new authors I now want to search out and read. I am so glad this has been published, a last glimpse of a great author and very human man.ARC from publisher."}, {"userName": "Diane", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "What I love about Pat Conroy is how he wore his heart on his sleeve. He seemed to love everybody, and he would tell you so. He loved the South, he loved his family and friends, he loved his readers, and he also loved books. A Lowcountry Heart is a posthumous collection of writings from Conroy, who died a year ago this month. The book includes speeches he's made, his \"letters\" that were posted online (Conroy didn't like the term blog), some magazine articles and interviews, and very touching tributes from his longtime friends and wife. Reading this was a lovely way to remember the author.I listened to this on audio, and I enjoyed most of the pieces. There were a few writings that were a bit confusing because I haven't read enough of Conroy's novels to fully appreciate the context. But overall, this was a charming collection, and I gathered that Conroy could really light up a room and was a great person to know. His wife described him as \"extremely outgoing,\" but Conroy preferred to say, \"I'm obnoxiously friendly.\" I never met Pat Conroy, but I wish I had. And he wrote so beautifully about South Carolina that I want to visit there. Meanwhile, I'll keep reading his books, and luckily he was so prolific that I will be entertained for a while. I'm glad I read this one. Recommended for fans of the bighearted Pat Conroy.P.S. I also highly recommend Conroy's memoir My Reading Life, which is a charming tribute to the writers and books he's loved, and other people who have influenced his reading.Favorite Quote[from the Introduction by his wife, Cassandra King]\"Pat was always happiest when he was writing, when he lost himself in the narrative that overtook him and flowed from his pen onto the pages of the yellow legal pads he used for his books. His musings, critiques, observations, and meditations he was more likely to write in his journals, which are also full of bits and pieces of stories he hoped to use one day. Pat collected stories like others might collect rare stamps, or a library of illustrious music. Hearing a good story filled him with great excitement. Afterward, he was apt to grab a pen and say to the teller, 'Consider that story stolen. If you plan to write it one day, you'd better do it first.'\""}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "4★ + 1 ★ (because it's dedicated to me and you)A final reading gift from The Great Conroy—The Prince of Tides.Composed of interviews, articles, speeches, letters, and tributes, this one is dedicated to us, his loyal readers. A final posthumous love letter to us devoted fans.When Pat started writing his blog he did not own an e-device and had never been on Twitter or Facebook. He still wrote longhand on yellow legal pads and owned over 8000 books. He began each offering with “Hey, out there” and ended with “Great love . . .”I enjoyed this immensely and recommend it highly to other readers who have had multiple book affairs with him.I did not know that: Pat was once invited by Margaret Mitchell's heirs to write a sequel to Gone with the Wind (negotiations and conditions proved too overwhelming and stringent).Too funny: “I found myself in the men’s room with the huge actor Mr. T. When I looked over as I stood beside him peeing, I said, 'Mine’s bigger', and Mr. T screamed with laughter and I’ve loved Mr. T since that moment.\"I wish I had written this but Mary Ellen Thompson gets the credit: “Reading a Pat Conroy novel is like being lashed to a mast, and sailing into a story that surrounds you like a blanket of fog. Your primary senses are dulled to anything but the rhetoric and where it will take you; yet in the vast distance you can still sense shrapnel shooting by as the stars of his language explode around you.\""}, {"userName": "Diane Barnes", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "A must read for any Pat Conroy fan. His own words and those of people who knew and loved him."}, {"userName": "Karen", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/3060349-karen", "userReview": "Editor Nan Talese received pages from Pat Conroy’s next novel, yet the author died prior to the book’s completion. Talese and her staff pay tribute to Conroy by providing his fans with a compilation of his blogs and letters within “A Lowcountry Heart”.This is a wonderful collection of essays, speeches and experiences reflecting Conroy’s life. I was blown away by the life of this compassionate and humorous man and how he touched so many.The bits and pieces of Conroy’s experiences, his reflections and tributes to others who impacted his own life have a lot of heart and made for a very compelling read. Thanks to the publisher and Conroy’s family for allowing his private journaling to be shared."}, {"userName": "Kathleen", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/39134508-kathleen", "userReview": "I enjoyed this book containing Pat Conroy 's blog entries, letters, photos, his thoughts on many subjects, books, authors and restaurants. He told of his life through his stories and claimed to feel badly about upsetting his sister with his writing. Mr. Conroy was an avid reader and praised the author's and their books, if he enjoyed them. He named many authors I am familiar with-Ann Patchett, Toni Morrison, Sue Monk, Margaret Atwood and many more who are new to me. He writes about highlights of the year he lived in Paris, France to write a book. Parts of this book made me smile, while other parts made me sad. I found this memoir interesting, informative and intriguing and am sad that I only discovered this author recently and was reading The Prince of Tides when he died. 4.5 stars rounded up to 5***** because he dedicated the book to his readers( I'm one of his readers as well as a fan. 5*****"}, {"userName": "Marialyce", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "My heart is sad that I will never be able to read any new books by Mr Conroy. They, and his writings, will always hold a very special place in my heart and mind."}, {"userName": "Elizabeth A", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/3123067-elizabeth-a", "userReview": "Book blurb: This volume of Pat Conroy's nonfiction brings together some of the most charming interviews, magazine articles, speeches, and letters from his long literary career, many of them addressed directly to his readers with his habitual greeting, \"Hey, out there.\" Ranging across diverse subjects, such as favorite recent reads, the challenge of staying motivated to exercise, and processing the loss of dear friends, Conroy's eminently memorable pieces offer a unique window into the life of a true titan of Southern writing.I listened to the audiobook which is superbly narrated by Scott Brick. At 25.0%: Been in tears twice already and my fellow walkers look concerned for me. Oh boy. At 58.0%: Enjoying some of these pieces more than others, but it's clear that the man had some wonderful long-term friendships.I'm a fan of this author and was one of those saddened when he passed away. Since I was heading to the Lowcountry this month decided it was the perfect opportunity to read this one. As you can see from the blurb, it's a collection of pieces, and I was in tears for the first several. This man's gift was his honestly and vulnerability in his writing, and there is a reason he is much beloved by his readers. In this collection, some from his blog, he pays homage to reader, writers, teachers, mentors, friends, and all who wear the ring. I preferred some of the earlier pieces to the latter ones, but this is required reading for his fan base."}, {"userName": "Donna", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "Pat Conroy is one of my favorite authors. There are deep layers to all of his stories. He masterfully describes what things feel like. This is a true skill that makes his characters leap off the page in colorful glory.This book was eloquently put together after his death. This is a collection of his own words, thoughts and feelings. I hope, one day, his wife will find someone to finish the last novel he was working on."}, {"userName": "Bam", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "I received this book today along with The Whistler from Doubleday through a Chatterbox giveaway, along with hot chocolate, peppermint sticks, marshmallows, mugs and a cozy afghan! What a great holiday surprise! Thank you, Doubleday and Chatterbox!!"}, {"userName": "Judy Collins", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Doubleday and NetGalley for an ARC in exchange for an honest review. A Lowcountry Heart: Reflections on a Writing Life, a collection of non-fiction writings by the beloved Southern author, we all loved,  Pat Conroy, as well as special remembrances from his friends. Throughout A LOWCOUNTRY HEART,  the indisputable power of Conroy’s work resonates, and his influence promises to endure. A sharing of stories. A moving tribute and a cherished keepsake for Conroy fans. To one of the best-loved writers of contemporary American letters.“A man who loved the written work beyond all measure, and who believed that each of us has at least one great story to tell.”From Conroy’s famous “hey, out there,” his first letter ever written for his website, his hated word “blog”, his special friends, and his love of the LowCountry—Charleston. From his special journals, letters, interviews, and essays, to his oldest friend, Bernie Schein's farewell letter to the beautiful introduction and acknowledgments by his beloved wife and writer, Cassandra King Conroy. Even includes a Conversation with Pat Conroy, from Beaufort Lifestyles, Oct 2015.A touching collection  of moments and treasures from the man we all admired. From an intimate letter to his grandson about sportsmanship and basketball, Citadel, Andie MacDowell, Beaufort, his books, his writing life, teachers, Vietnam, Charlie Gibson of Good Morning America, Paris Days, A Eulogy for a Southern Gentleman, South of Broad,  Penn Center, one of the first schools for freed slaves, (his final resting place-Memorial Garden), birthdays, travels, teachers, his first book, sermons and speeches, plus many more special tidbits from an extraordinary man.Each fan will have special fond memories of different segments of the memoir. I particularly enjoyed how he met Cassandra King , later in life, where they found in their fifties and sixties, a time of joy, productivity, and contentment. Their shared love of books, writing, and life. Their first meeting at a writer’s conference in Birmingham, Alabama. She fell upon his spell. Their twenty years together. People were Starstruck by him and his presence. “Pat could make the deaf hear and the mute speak. Sweeping you up in a conversation with those intense blue eyes focused like lasers on you and you alone, he had the ability to ferret out your secret self that had been undercover for a lifetime. “From his musings,  critiques, observations, and meditations, his journals, and stories. How a hearing a good story filled him with great excitement. His love of book signings. Stories were a way Pat connected with readers. It was amusing  to read about his resisting modern technology, emails, blogs, tweets, and twitters. However, most of the works in this collection come from the \"blog\" he began to write when he was between books; when his health began to fail since he was limited to travel.These were called blog posts or letters. He never learned to type. It was the way he collected the stories he would turn into the books his readers yearned for. He would take your story and make it large and glorious and unforgettable. From his great love of books, his first, The Boo,  plus some of his favorite authors and friends, John Grisham, John Irving, Richard Russo, Anne Rivers Siddons, Ron Rash, Fannie Flagg, and more– books that inspired him, and his family. Being a native Carolinian, enjoyed revisiting special places like the Highlands, NC, Atlanta, GA, Charleston and Beaufort, SC, among others. Pat was a great man, a talented author, possessing a rare gift, which is missed tremendously.A beautiful collection, a treasure, and tribute to his work and his life. His love of the South, food, friends, family, and mostly words and stories. \"Our own prince of tides.\"  JDCMustReadBooks"}, {"userName": "Tracy", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/25145-tracy", "userReview": "I received a review copy of this book in exchange for an honest review -- I'm completely drained. I read the first half before going to sleep last night and finished this morning as soon as I woke up. I feel like I've just spent several hours visiting with an old friend, and now his death has hit me all over again. It destroys me that we will never read another one of this stories again, so I'm going to have to go back and re-read his others (I may even go back and finish South of Broad, which was the only one I didn't love, but knowing more of the backstory might make it more appealing now.) If you are a fan of Pat Conroy, and have read all of his books (including The Death of Santini), then you will want to devour this one (you do need the background of his stories to appreciate it because the whole book refers back to them). It's a collection of his blog posts (he wasn't very computer-savvy, and started each post with \"Hey out there --\" which made me smile each time I started a new chapter.I haven't cried this much since I finished The Nightingale last summer, even though these are a different kind of tears. What a storyteller he was. What a loss. But I'm so thankful for this collection, which ends with the eulogy given at his funeral; this last part did me in:\"Some of us he entertained grandly. Others of us he outraged greatly. To all of us, he gave a rare gift. He came to us from afar, like Faulkner and like Wolfe. But I respectfully suggest, in ways more real and more loving than either of them, that he gave us the opportunity, in the phrase of Burns, 'to see ourselves as others see us.' For this alone, we should be forever grateful to Pat Conroy, our very own prince of tides. \" 'Good-night sweet prince. May flights of angels sing thee to thy rest.' Hamlet, Act V, Scene 2\""}, {"userName": "Michael", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/3680008-michael", "userReview": "Prior to reading the first chapter of this book, I was saddened to learn about the passing of Pat Conroy. Conroy will always be my favorite author, the way he develops stories is a gift from God, all are touching, vulnerable and unparalleled. I read hundreds of books from various of genres, but none of them have had the significant impact that Pat books has on me. Starting with the first book I read, South of Broad, the novels will always have a permanent place in my heart. Now unto the contents of this book, it is hard to even type out this review without getting emotional.Pat was loved by his readers, the lengths he took to make sure everyone feel welcome is amazing. I liked how it was described how he waited in long lines for his fans and always greeted them with warmth. I never met him in person, but I can tell how much he cared about the people that supported him. Told by his wife, she explained in great detail how lovable he was among his friends and peers. Grieved that he never learned to type, he wrote all of his notes down. I liked how he did not rely on Kindle or any other technological device, but wanted to be personal with his fans. Social media was not keen to him, that is what made me love him more. There were so many highlights in this book, but the pictures with the rich detail accompanied this masterpiece.Pat I love you, thank you for sharing your stories with the world. There is never going to be another author that will capture my heart like you. Rest in peace, to the most gifted storyteller."}, {"userName": "N.N. Light", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/23234551-n-n-light", "userReview": "I've been a fan of Conroy's books for years but in this one, he shares a part of his writerly soul. Every writer needs to read/listen to this one. Can't recommend it high enough!My Rating: 5+ stars"}, {"userName": "Jim", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/439937-jim", "userReview": "I was happily engaged in a very good novel when I found this Conroy book on my hold shelf at the library, and needless to say, I pretty much halted any reading of other material so I could devour this offering. For me the saddest day this year was the death of Conroy, and the thought of never having any more of his stories much depressed me. I still feel a loss. I am glad that I got to meet him once and shake his hand (I didn't ask for an autograph or bend his ear, but was just delighted to be near him for a few minutes). His books, especially LORDS OF DISCIPLINE and GREAT SANTINI, touched many deep emotions in me and may even have helped shape my view of the world. Much of what is included in this small collection (many pieces from his blog) I already had read, but that didn't matter. I read them again. And yes, there is some room for criticism, as the compilers chose essays that were often repetitive, as if there were certain things (like his basketball team, for instance) that he couldn't completely let go of. One only hopes there is a hidden treasure trove of unpublished material somewhere, even if it be mere scraps and fragments, for we hungry Conroy fans are feeling the withdrawals. I liked those entries written by friends, colleagues, and family in remembrance of Conroy. Although he had some negative personality traits and behaviors during his life (which it seems he always acknowledged), what he gave to his readers will far outreach those small blemishes, because this fan thinks he more often than not stood up on the right side of most issues, while continuing to love even those who opposed him (such as his classmates for a few decades). He was a nostalgic man. He paid a price for his stands, but he was often ahead of most people in his sympathies. Now, executors of his estate, please find some unpublished novels he may have squirreled away!"}, {"userName": "Cole", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/13464001-cole", "userReview": "What can you ever say about the lovely Pat Conroy... This is an author that I've turned to over the years in my happiest moments and my darkest days. A Lowcountry Heart is such a wonderful way to remember this amazing and brilliant author who gave so much of himself to his readers. This is a collection of stories, blog posts, backstories and love for a GREAT author - who will make you love, laugh and cry with his words. I cannot thank NetGalley and Penguin Random House enough for the honor of reading this for an honest review."}, {"userName": "Claire Fullerton", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/24890050-claire-fullerton", "userReview": "In my mind, there’s Pat Conroy and then there’s everybody else. What makes him an island unto himself is his intimate, confessional writing. I’ve been wrestling with trying to articulate exactly why his words speak to so many and have arrived at the conclusion that at the foundation of his God given gift to effortlessly arrange words is the bedrock of clear thinking. Too many people buckle under the weight of their own unwieldy emotional level, and as it is only human nature to duck and cover from pain and confusion, their unexamined emotional life takes on a crippling weight all its own and leads to a list of crimes against the human heart. The magic of Conroy is in his fearlessness to call anything by name and his cache of language to do so exactly. In so doing for himself, he does so for humanity. His is a dauntless, confident voice so surefooted, his readers know and trust him. Each of his novels sends the reader through the thicket of life itself then leaves them parked in front of a mirror to reflect. In A Lowcountry Heart, Conroy tells his legions of fans not only how he does this, but why. I’ve heard Conroy called a generous writer by many, and this book tells me how he earned the reputation. Behold, the man behind the curtain, who has a seat across from you and looks you in the eye as he explains what goes on in his passionate soul. Pick a subject, any subject, and Conroy pontificates in this treasure of a book. Thank you, Nan Talese and Doubleday. This, like all of Pat Conroy’s books, is a masterpiece from the man who keeps on giving."}, {"userName": "Katherine", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/4105926-katherine", "userReview": "This collection of Pat Conroy's blog posts and a few interviews/letters/etc is a reminder of how much the literary world lost when he passed away. Even just his accounts of friends and others authors that he had read and loved (or not) reminds you of what a wonderful writer he was and gives you an idea of what he was like as a man outside of his books. Definitely worth the read for fans of Conroy's novels and biographies."}, {"userName": "Jane", "userReviewDate": "Nov 23, 2016", "userURL": "http://www.goodreads.com/user/show/288945-jane", "userReview": "Sigh. I have read them all. Pat Conroy's fiction and memoirs and essays and tales of those who make you savor life in a new way. Oh how I wish he'd finished his last novel before he died this year. Thankfully every book is worth another read...or two...or three...RIP Pat"}, {"userName": "Kate", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/9126167-kate", "userReview": "In case you forgot for one second why you loved Pat Conroy, this book will remind you! Beautiful collection of his writings and musings and stories with an intro from his wife. All of which make your heart ache even more that this amazing person is no longer on earth with us."}, {"userName": "Karen Roettger", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/38442572-karen-roettger", "userReview": "This book is a farewell message to all of us from this wonderful story teller. His eloquent words in each of his books took his readers to magical & unique places. Pat Conroy was the ultimate prince of tides. I am truly sorry that I never met him at one of his book signings. He will be missed. The cover art by one of my favorite illustrators, Wendell Minor, fits perfectly with the books contents."}, {"userName": "Kathy McC", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/237166-kathy-mcc", "userReview": "It saddens me that this is probably the last of Pat Conroy’s writing. He has been one of my favorite contemporary authors since I read Prince of Tides (which remains one of my top ten favorite books). The book is filled with his musings about writing, about books, and about life. He highlights many books by a variety of authors. Some of these books I have read, and others I have now put at the top of my TBR list. I think I will also have to re-read some of my Conroy favorites in 2017.“I don’t own a Kindle or an iPad. I’ll remain a book guy because I own 8,000 of them and I love the way they make my house look.”“The teachers of my life saved my life and sent me out prepared for whatever life I was meant to lead. Teaching is an art form, pure and simple. I’ll trust a teacher over a bureaucrat every time- a teacher over an administrator.”“Teaching remains a heroic act to me, and teachers live a necessary and all-important life. We are killing their spirit with unnecessary pressure and expectations that seem forced and destructive to me.”“The reading of great books has been a life-altering activity to me.”“Down the road, I got Faulknered and Steinbecked, Hemingwayed and Fitzgeralded. I don’t know when reading books became the most essential thing about me, but it happened over the years and I found myself the most willing servant of what I considered a rich habit.”“My English teachers pushed me to be smart and inquisitive, and they taught me the great books of the world with passion and cunning and love. They taught because they were born to teach the prettiest language in the world.”“I listened to my fabulous English teachers and soaked up every single thing those magnificent men and women had to give. I cherish and praise them and thank them for finding me when I was a boy and presenting me with the precious gift of the English language.\""}, {"userName": "Susan Freeman", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/3314200-susan-freeman", "userReview": "I loved this compilation of memories and stories of Pat Conroy's rich and full life. I checked this book out from the library but will be purchasing my own copy to cherish."}, {"userName": "Fred Forbes", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/3440334-fred-forbes", "userReview": "Sitting on a wooden file cabinet in my office is my \"book altar\" holding my 10 favorite or most meaningful books. I prefer signed first editions if I can get them and happen to have one of the \"Prince of Tides\" whose author, as most of you know is Pat Conroy who also wrote such great material \"Lords of Discipline\" and \"The Great Santini\". I have always felt that though his characters tend to run to the depressing and dysfunctional, his ability as a wordsmith puts him in a class by himself.Pat died last March but in the months before he shook off his technophobia (he wrote his novels on a yellow legal pad ) he produced some blog like work which is reproduced here, along with some of his speeches, letters, etc. For those like me who are long time Conroy fans, this collection gives some great insight into his writing process and his dealings with the world. It is fun to track his biography along the timeline of his books.He felt he had 2 or 3 more novels in him as he moved toward the end and had a start of one that ran a couple of hundred pages. They may see if there is enough information in his journal to finish it up, but who knows? I know I will miss him as I loved getting lost in his stories. A great read for any fan of Pat's."}, {"userName": "Sue ", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/690922-sue", "userReview": "When Pat Conroy died last year, America, and especially the South, lost one of it's best authors. No one could tell a story like he could. He bared his soul to his readers and shared with us his difficult childhood and the joys and sorrows of his life. He is one of the few authors whose books I re-read every few years and always the author that I mention first when someone asks who my favorite is. I am extremely saddened that readers won't have any more of his books to devour. This little book, published posthumously, is a collection of some of his best blog posts as well as memorial articles from several friends, his wonderful editor Nan Talese and his wife, Cassandra King - also a fantastic author. I laughed and I cried while I was reading it and it's going to go on my shelf with his other books so that I can read it again and again."}, {"userName": "Judith", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/6019976-judith", "userReview": "A Lowcountry Heart honors Conroy's legacy. The collection turns into a journal of remembrances of Pat Conroy and ends with a eulogy. This is a heart-felt tribute and a lasting monument to one of the best loved writers of contemporary American Southern literature, a genius of the English language. I will miss the words he never wrote. Someone said, \"Reading Pat Conroy is like watching Michelangelo paint the Sistine Chapel.\" I met Pat Conroy soon after moving to Young Harris. He was a giant of a man and yet a little boy with a loving and complex personality full of joy and despair. He had a passion for music, words, teaching, the SC marshes, friends, people, beauty of language, books........As I read this book, I laughed and cried. Mr. Conroy, you left too soon."}, {"userName": "Gary Parkes", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/3567981-gary-parkes", "userReview": "A great tribute and gentle farewell to and from Pat Conroy. With most writings from Pat himself, I continue to learn from Pat. His wife, the fabulous Cassandra King, as well as Rick Bragg, add to the tenderness and insight of this iconic author. I had the pleasure of meeting Pat twice in the year before he passed away and I am glad I did. Posthumously, Pat added to my to-be-read pile with his recommendations of other authors and books. Great, gentle and easy read that will add to one's love of Pat Conroy."}, {"userName": "Jackie Rogers", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/33443462-jackie-rogers", "userReview": "This is a tribute to Pat Conroy, a late writer. He was also a southern gentleman and married to CassandraKing also a writer. Has snippets of his blog, news articles, and interviews. He speaks of friends from school, the neighborhood, and his travels. Is interesting to read of his life and the people in it. He passed away this year and will be missed by all."}, {"userName": "Shari", "userReviewDate": "Nov 05, 2016", "userURL": "http://www.goodreads.com/user/show/595409-shari", "userReview": "I never wanted to come to the end of Pat Conroy's writing and I am utterly bereft."}, {"userName": "Laurie Lomax", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/3097454-laurie-lomax", "userReview": "One of my favorite writers. Loved hearing the stories behind the novels and about the people he wrote about and why. Makes me want to read his books all over again."}], "description": "Final words and heartfelt remembrances from bestselling author Pat Conroy take center stage in this winning nonfiction collection, supplemented by touching pieces from Conroy's many friends.This new volume of Pat Conroy's nonfiction brings together some of the most charming interviews, magazine articles, speeches, and letters from his long literary career, many of them addressed directly to his readers with his habitual greeting, \"Hey, out there.\" Ranging across diverse subjects, such as favorite recent reads, the challenge of staying motivated to exercise, and processing the loss of dear friends, Conroy's eminently memorable pieces offer a unique window into the life of a true titan of Southern writing.With a beautiful introduction from his widow, novelist Cassandra King, A Lowcountry Heart also honors Conroy's legacy and the innumerable lives he touched. Finally, the collection turns to remembrances of \"The Great Conroy,\" as he is lovingly titled by friends, and concludes with a eulogy. The inarguable power of Conroy's work resonates throughout A Lowcountry Heart, and his influence promises to endure.This moving tribute is sure to be a cherished keepsake for any true Conroy fan and remain a lasting monument to one of the best-loved masters of contemporary American letters.Praise for A Lowcountry Heart\"A fascinating look into the mind of one of the South's greatest authors . . . something to remember him by and cherish for years to come.\"--The Clarion-Ledger\"Fans of Conroy . . . will relish the chance to spend more time with him in this glowing valedictory to his life and writing . . . Eloquent, folksy, and sometimes brutally honest.\"--Publishers Weekly\"A moving and proper tribute to a true Southern icon.\"--The Florida Times-Union \"Elegant essays [that] will not disappoint.\"\n--The Washington Post\n\"Resplendent . . . As always, his storytelling, word choice and rhythm are gorgeous, almost lyrical.\"--USA Today", "title": "A Lowcountry Heart: Reflections on a Writing Life", "url": "http://www.goodreads.com/book/show/30555485-a-lowcountry-heart", "average": 4.34, "cover": "https://images.gr-assets.com/books/1469410925l/30555485.jpg", "reviews": 229, "authors": [{"url": "https://www.goodreads.com/author/show/6942.Pat_Conroy", "name": "Pat Conroy"}], "type": ["Nonfiction", "Autobiography", "Language", "Writing", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/30555485-a-lowcountry-heart", "http://www.goodreads.com/book/show/30533129-a-lowcountry-heart", "http://www.goodreads.com/book/show/30613796-a-lowcountry-heart", "http://www.goodreads.com/book/show/16735.The_Prince_of_Tides", "http://www.goodreads.com/book/show/16729.Beach_Music", "http://www.goodreads.com/book/show/6135237-south-of-broad", "http://www.goodreads.com/book/show/85448.The_Great_Santini", "http://www.goodreads.com/book/show/85443.The_Lords_of_Discipline", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}