{"ratings": 310, "userreviews": [{"userName": "Benoit Lelièvre", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/3634428-benoit-leli-vre", "userReview": "One of the earliest and most famous works by Brian Evenson.Does it live up to its reputation of being so violent and depraved it got its authors kicked out of its religion. No, it doesn't. But it addresses one of Brian Evenson's thematic obsession in a unique and fascinating way: boundaries. In this case, the oldest and greatest boundaries of them all : death. Or, as Evenson puts it himself in the afterwords of his collection: the sacred and the profane. There is something so unsettling about how Brian Evenson writes, it's almost endearing. Whether it's characters who can't decipher messages that are clear as day (The Munich Window) or meaning that is constantly eluding a character's actions (Her Other Bodies). There's always something off-putting to the stories in ALTMANN'S TONGUE. Well worth reading, like all material by Brian Evenson."}, {"userName": "F.R.", "userReviewDate": "Aug 05, 2009", "userURL": "http://www.goodreads.com/user/show/1309606-f-r", "userReview": "I first heard about Brian Evenson years ago in an article in the London Times (well, I think it was the London Times. I’ve been hunting for it online with little luck). The piece detailed how Evenson was a Mormon who had published one collection, ‘Altmann’s’ Tongue, but unfortunately his fiction was deemed so extreme that the church had given him the choice to either leave the faith or stop writing. As his family were all Mormons, this was obviously one hell of a decision.If memory serves the article was written before he’d made his choice (and a look at his website shows me he’s still writing, so we can see which path he went for) but it was a tale that stayed with me and so I tracked down this volume. Until now I’d just dipped into it, but I thought it was time I read the whole thing.Evenson is undoubtedly a writer with a good literary sensibility and a strong stomach. It’s easy to see how these tales would offend those of a more delicate sensibility. Contained within are a number of tales of murderers and numerous instances where dead bodies are found. There is even more than one story where an aperture on a living person is sewn shut. If you’re a fan of horror then there is lot here that will appeal.Unfortunately there are also a lot of short pieces, sketches, which at no more than a page or two pages long just paint a quick picture. A scene is laid out and then nothing, it goes nowhere – almost as if he had an idea in mind and then couldn’t think of any way to incorporate it into a large whole. Having said that, the longest story in this collection – ‘The Sanza Affair’ – I also found irritating and not as clever or as witty as it thought it was.But the best stories – ‘The Father, Unblinking’; ‘Killing Cats; ‘The Munich Window: A Persecution’; ‘Stung’; ‘Hebe Kills Jerry’; ‘The Evanescence of Marion le Goff’; ‘Her Other Bodies: A Travelogue’ and ‘The Eye’ – I would recommend to all fans of darker fiction."}, {"userName": "Brent Legault", "userReviewDate": "Mar 12, 2008", "userURL": "http://www.goodreads.com/user/show/395634-brent-legault", "userReview": "Bit of a mixed bag. But what a bag! Imagine it: orange velvet exterior, lined with crushed glass, brimful with tasty treats and tender traps. There's a bee hive in there, for one thing. Not to mention Altmann's slippery tongue. And...other things. Best not to worry the details. The better stories in this collection are good enough to give you an exotic venereal disease. The lesser stories, and there aren't many, are like the late-night infomercial that you can't make yourself turn away from. Enjoy!"}, {"userName": "Rachel", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/896929-rachel", "userReview": "WRITER CRUSH ALERT WRITER CRUSH OH MY GOD I MEAN OH MY GOD!!!!Okay. So. I read a Brian Evenson story in the Library of America's \"Fantastic Tales\" anthology and sought him out immediately. Sadly, I couldn't get my hands on any of his work and so it was a while before I remembered his name and looked him up in the library. And Jesus. I mean, wow. Violent, disturbing, poetic, eerie, haunting. It's smart horror. Maybe the smartest horror of all time? The opening lines were works of art. It's the kind of book that I enjoyed so much I felt bad about how much I enjoyed it, given the content (like saying \"Seven\" is one of my favorite movies - it's disgusting and creepy but SO GOOD). The nameless wasteland and the crazed inhabitants of a lone fortress; the little boy who finds his step-father's mouth sewn shut, crammed with bees; the trucker who drives from CA to TX, accumulating bodies he carves along the way. Terrifying and stellar, and written with a lyricism and ear that just makes the stories that much more unsettling. Evenson himself I give all the possible stars, but this collection, his first, at times felt like he was literally fucking around. \"Job Eats them Raw, With the Dogs,\" threw me for a loop and not in a nice way - there's a fine line between surrealism (weird, moving) and absurdity (ridiculous, nonsense). Can't wait to read more of his stuff."}, {"userName": "David Peak", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/6407188-david-peak", "userReview": "A first-rate collection of short fiction, published when Evenson was only twenty-eight (how?), and edited and published by Gordon Lish. Many of the stories here--most memorably \"Killing Cats,\" and \"What Boly Seed\"--were also published in Lish's famed journal The Quarterly and bear a strong editorial influence. Though it's the stories that declare Evenson's dark originality that make this book something special. \"Her Other Bodies: A Travelogue\" channels McCarthy's Child of God in its crazed brutality, but Evenson never relies on violence for the sake of violence. There is a deeply embedded sense of morality in these stories that amplifies the powerfully clipped imagery and throaty sentences. The same can be said for the novella included here, \"The Sanza Affair,\" which offers a totally fresh take on the police procedural by playing with branching perspectives afforded by the \"detective\" narrative, all slathered in the shifting lights of noir atmospherics. A great, great book--as good as anything Evenson would go on to publish throughout his long, rewarding career."}, {"userName": "Adam", "userReviewDate": "Oct 14, 2010", "userURL": "http://www.goodreads.com/user/show/214053-adam", "userReview": "Savage and disturbing little collection of stories. Most read like European translations others like Cormac McCarthy. Fans of Bernhard, Dino Buzzati, Beckett, Kafka, David Lynch, and Paul Auster will find a chilling feast inside this book."}, {"userName": "Andrew Torres", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/26691394-andrew-torres", "userReview": "Horror. I love the genre. It can take you on so many paths that lead to different scenarios. Gothic, sci-fi, campy, realistic, brutal, paranormal, you name it. I read a brief interview that author Brian Evenson had with one of his colleagues, in regards to his defense of the dark subject matter that entail these pages. It's not that he wrote these stories to scare us or to vent violence. No, he wrote these stories to bring different types of horror to the table. To test our own point of view on how we perceive the brutality of the world.Sounds awesome; until you start reading the stories.There were \nway\n too many \"What just happened?!\" moments in these short stories. It started off so great, but after about 2 or 3 stories, the quality fluxuated way too much for my taste. Most of these stories seemed to have no point or train of thought. Most of his 5-6 page stories were good, but the longer the story (including the one and only novella at the end) the worse they became. The one exception to that was the story \"Her Other Bodies: A Travelogue\"; this story takes us into the mind of a serial killer whom aimlessly kills while he drives his semi truck across Utah all the way to Texas.Another story that lingers with me, a month after finishing the book, is \n\"Stung\"\n, a story about a boy and his parents and the peculiar events that follows, which includes bees. Why the rest of the stories couldn't be more like this... who knows.I'll most likely give Evenson another chance with his novels, but this just didn't do it for me."}, {"userName": "Amy", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/214508-amy", "userReview": "Evenson is an interesting writer - a Mormon (at least at the time many of the stories in this collection were written) that tells stories full of darkness, violence, and depravity. I've read some of Evenson's other work, and while still very much in the same vein, I think I prefer my previous engagements. I think I keep coming back to his work because I also have a lingering interest in the \"sacred vs. profane\" argument, namely that I don't think you can often make much of a distinction...something that is expanded upon in the afterword to this collection."}, {"userName": "Nan", "userReviewDate": "Jun 10, 2009", "userURL": "http://www.goodreads.com/user/show/1130578-nan", "userReview": "Here's one more book I'd rather not rate. My reactions to it are complicated at best. Evenson's influences seem to be Kafka, Beckett, and the Christian bible. The violence is sinister, restless, part of his American landscape. He uses it to explore who we are as a culture. His images are horrifying and unforgettable. They are the stuff of nightmares -- the stepfather's genuflected body, Job and his bones, the killer of Altmann fleeing the scene and \"fluttering into the blank sky.\"I'll probably read more Evenson, but I'm going to take a long break first."}, {"userName": "William", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/6790392-william", "userReview": "I confess that I did not finish this book. I really tried. I like short stories, but I tend to have a few requirements for my stories: (1) a beginning, a middle and an end, or at least two of the three of those would be nice, (2) some meaning and (3) some sense. Many of Brian Evenson's stories in Altmann's Tongue had none of those characteristics. The result feels like an attempt by Evenson to be strange for strange sake, as opposed to being strange because it brings value to a story or a reader."}, {"userName": "Jérémy Demeure", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/49840640-j-r-my-demeure", "userReview": "Un recueil inégal d'après moi. Certaines nouvelles sont excellentes (\"Le père, impassible\", \"Une mort lente\", \"Job les mange crus, avec les chiens\"), d'autres carrément incompréhensibles et/ou sans intérêts (Par exemple \"Une conversation avec Brenner\" qui met en scène Ersnt Junger et à laquelle je n'ai absolument rien compris). C'est glauque et malsain à souhait, rapide et facile à lire. Préférez toutefois \"La confrérie des Mutilés\" si vous voulez découvrir l'oeuvre d'Evenson."}, {"userName": "Ron Christiansen", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/2540960-ron-christiansen", "userReview": "My wife gave this to me for my birthday--actually pulled a sneaky and had the author sign it. I had taken a class from him at BYU. Unfortunately this book was the end of his BYU career; or maybe fortunately for him as I think he's done quite well. His stories here are quite compelling, but also extremely violent. You know when the least violent story is called \"Killing cats\" you have a fairly violent book though certainly a profound exploration of evil."}, {"userName": "Haengbok92", "userReviewDate": "Nov 14, 2007", "userURL": "http://www.goodreads.com/user/show/279880-haengbok92", "userReview": "I had the good fortune to hear Evenson read the cover story of this collection, as well as selections from some of his other works, at a reading this past month. As a result, I have to read this book. As a writer, he's the full package: prose, character, plot and the ever important niftyness factor that turns solid writing to great writing."}, {"userName": "Scott", "userReviewDate": "Feb 13, 2008", "userURL": "http://www.goodreads.com/user/show/906691-scott", "userReview": "The novella at the back of the collection, \"The Sanza Affair,\" has to go on my list of best detective stories. However, the rest of the stories in this book, by and large, are as disturbing as they are well-written. Evenson's deliberate choice of violence and darkness as an aesthetic seems a debatable use of his talent."}, {"userName": "Spencer", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/956877-spencer", "userReview": "my favorite short stories. unreal. his characters experience violence in the extreme. but not much fear or pain. he is clinical about violence in a way that strips violence down to its aesthetics. maybe thats silly to say. But no one writes like this guy. Totally original."}, {"userName": "Kevin", "userReviewDate": "Aug 27, 2007", "userURL": "http://www.goodreads.com/user/show/314238-kevin", "userReview": "Horribly, gruesomely violent and dark, but also insanely compelling. Many stories defy plot, and yet what happens next feels crucial and revealing. Definitely not for most people, but if it gets you it'll get you good."}, {"userName": "Twila Warner", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/27271235-twila-warner", "userReview": "Brutal stories. He knows how to do the crazy character who talks as though his actions are perfectly rational. He must have grown up in Utah, like me."}, {"userName": "Doug Martin", "userReviewDate": "Nov 28, 2008", "userURL": "http://www.goodreads.com/user/show/1756720-doug-martin", "userReview": "One of my favorites by BE! And by anyone else, for that matter."}, {"userName": "Andy", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/5281617-andy", "userReview": "Already more terrifying than Last Days. Loving it!"}, {"userName": "Dan S", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/21936737-dan-s", "userReview": "The stories at the beginning kept me turning pages, and the novella at the end made the slog through some almost-unreadable surrealism in the middle very much worth it."}, {"userName": "Elizabeth Frankie Rollins", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/1145640-elizabeth-frankie-rollins", "userReview": "Scary like Angela Carter scary"}, {"userName": "Nick Jones", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/5102480-nick-jones", "userReview": "meh."}, {"userName": "A.", "userReviewDate": "Mar 30, 2008", "userURL": "http://www.goodreads.com/user/show/676686-a", "userReview": "Almost, but ... not ... quite."}, {"userName": "Andrew", "userReviewDate": "Jan 31, 2009", "userURL": "http://www.goodreads.com/user/show/1979531-andrew", "userReview": "Some good, weird stories here. Also some bad stories."}, {"userName": "Don", "userReviewDate": "May 26, 2009", "userURL": "http://www.goodreads.com/user/show/2354453-don", "userReview": "My favorite book of all time."}, {"userName": "Don", "userReviewDate": "Jul 25, 2007", "userURL": "http://www.goodreads.com/user/show/214200-don", "userReview": "Written by the son of a professor I work with. A very interesting and dark set of tales. I've read a few, but want to begin again and read the whole thing."}], "description": "Twenty-five short stories and a detective novella, The Sanza Affair, present a chilling collection of tales in which social institutions and human relationships dissolve without warning and with mayhem. A first collection.Brian Evenson has added an O. Henry Award–winning short story, \"Two Brothers,\" to this controversial book and a new afterword, in which he describes the troubling aftermath of the book's publication in 1994.", "title": "Altmann's Tongue: Stories and a Novella", "url": "https://www.goodreads.com/book/show/146772.Altmann_s_Tongue", "average": 4.19, "cover": "https://images.gr-assets.com/books/1328819204l/146772.jpg", "reviews": 30, "authors": [{"url": "https://www.goodreads.com/author/show/48355.Brian_Evenson", "name": "Brian Evenson"}, {"url": "https://www.goodreads.com/author/show/241343.Alphonso_Lingis", "name": "Alphonso Lingis"}], "type": ["Short Stories", "Horror", "Fiction", "Surreal"], "outlinks": ["http://www.goodreads.com/book/show/146772.Altmann_s_Tongue", "http://www.goodreads.com/book/show/1233058.Altmann_s_Tongue", "http://www.goodreads.com/book/show/22677909-la-langue-d-altmann", "http://www.goodreads.com/book/show/1233057.Altmann_s_Tongue", "http://www.goodreads.com/book/show/4309446-last-days", "http://www.goodreads.com/book/show/12139894-immobility", "http://www.goodreads.com/book/show/25330189-a-collapse-of-horses", "http://www.goodreads.com/book/show/6005193-fugue-state", "http://www.goodreads.com/book/show/146770.The_Open_Curtain"]}