{"ratings": 62, "userreviews": [{"userName": "Michael Cuthbertson", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/19502272-michael-cuthbertson", "userReview": "A Masque of Infamy is not your ordinary coming-of-age story, and yet it is definitely a classic of that particular genre. Dessaint's writing style is refreshing in numerous ways. Uniquely, his characters' language is natural and colloquial and yet, somehow, Dessaint's dialogue always seems to be more engrossing than the commonplace conversations we usually hear each day in our own lives. Dessaint is an expert at sifting through the everyday conversations of teenagers and finding the magic and profound insight that often exists under the surface of seemingly unenlightened adolescent interactions.In particular the novel's main protagonist, Louis Baudrey, is a character whose words and actions exude charisma throughout the book. There were many, many moments where I laughed out loud or chuckled under my breath at the smart-ass comments of this rascally character. Baudrey is a precocious teenager in a way that readers should find quite charming. Louis is cunning but good-spirited and he has a knack for making tough social situations work to his favor as much as possible.Also, as a devout anti-establishment metalhead, Baudrey is a character that rock, punk and metal fans themselves may find particularly relatable. I for one thoroughly appreciated getting such an intimate and earnest look at a teenager's passion for loud guitar music in the late-Eighties, a time period that some may argue was a high point for punk and metal music.What's also impressive is Dessaint's special ability to deal with the heavy subject matter of child abuse in a way that is honest and revealing, without leaving the reader in despair. Dessaint, like his character Baudrey, understands that what happened happened, and that the truly interesting story is not the abusive episodes the children faced, but rather how those children might manage to navigate their way out of that messy environment and seek for themselves a better future. Indeed, watching as Louis and Joey Baudrey attempt to do just this will have the reader engaged from cover to cover.And, apart from the fact that it is an entertaining and eye-opening read, A Masque of Infamy is also a decidedly clever book. It is dense: not in the sense that it contains obscure symbolic content for English departments to drool over, but moreso in that it delivers a steady stream of those magical little human moments that a person, without digging deeper like Dessaint does, might mistake as dull. Thus, A Masque of Infamy is clever and unique largely because it offers insight into a world that much more resembles the real world people live in that it does resemble the sort of dramatized, literary world that some writers spend their time writing about.After reading his debut novel, it is already manifestly clear that Dessaint is the sort of voice that has been sorely lacking from the literary landscape in recent years."}, {"userName": "Sage Adderley-Knox", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/131808-sage-adderley-knox", "userReview": "Louis Baudrey is a teen from California that makes a move cross-country to Alabama with his family, which consists of his younger brother, father, and Rick. From the beginning, I wanted to know exactly who Rick was and what role he played in the household. Soon enough, readers find out about what a creep Rick is and the abuse the boys have been dealing with. In their new small town, Louis rebels by being the misfit. He is punk and proud roaming the halls of high school and annoying those that fear the different.Numerous times throughout the story I couldn’t help but laugh out loud. Despite the dysfunction that was prominent in Louis’ life, he maintained this great sense of humor. He could take on the constantly revolving situations – moving to Alabama, living in a foster home, being transferred to a mental institution, and then back on the road to be placed elsewhere.\"You have 'death is the ultimate high' written on the side of your shoes... Are you suicidal?\"\"No, that's from Miami Vice.\"Louis kept his composure and rarely showed a soft side, but when he did, it completely changed the mood of the book. It was a firm reminder that this story is real. This isn’t fiction, and that Louis and his brother endured horrible things. Louis juggled way more than any teenager should. His cravings for cigarettes and music helped pass the time, but the darkness never gave him a break.\"I wanted so badly to tell her about the nightmares and the Beast that lived under my mother's house, in the crawlspace, where, as kids, we were always afraid to go. I remembered the earth beneath me, in my face, my nose in the dirt and the pipes over my head...\"I would give this book 5 stars all day long. It’s well written and captures your attention from the very beginning until the bitter end."}, {"userName": "Htiek Murdnal", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/19561800-htiek-murdnal", "userReview": "A Masque of Infamy is as beautiful as it is shocking. Kelly Dessaint masterfully guides us through the horror of teen-hood with remarkable insight and clarity. This is one beast of book, ladies and gentlemen. This needs to be on your bookshelf!"}, {"userName": "Monika", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/3970914-monika", "userReview": "A Masque of Infamy is an autobiographical novel, a coming of age story out of the horrors of child abuse. The dialogue is raw and rough, the characters are very real.Kelly Dessaint has crafted his story so the reader keenly feels Louis and Joey's confusion, frustration, fear, and anger as they experience it. I was trying to figure out what the system was doing as the boys were being processed and moved around. And the real story, the one Louis doesn't allow himself to tell for so long, is slowly revealed through his time in the hospital. It explains his feelings and behavior, and makes his story less about teenage rebellion and more about a desperate search for some, any, semblance of stability.I was far more disgusted and horrified at the boys' family situation than they were, and found their somewhat casual feelings toward the adults in their lives horrifying. Whenever a novel contains a child abuse theme, you know it isn't going to be an easy read. But seeing just how easily children can be manipulated by their abusers was so difficult.I was surprised and even a little angry that the story ended when it did. I felt invested in these characters, and didn't want the novel to end before I could find out whether or not they were really okay. Louis develops into a confident, capable young man, but I was still worried about Joey and wanted to know how he fared.The trepidation I'm left with speaks to how well Dessaint connects readers with his characters' intensely desperate situation. And despite the fact that there wasn't a neat and tidy ending, I was left with a good deal of hope.I received a copy of this book from Amazon (free special for Kindle) and agreed to participate in its virtual book tour by providing my honest review. I did not receive any compensation for this review."}, {"userName": "Elizabeth (Stuffed Shelves)", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/8381908-elizabeth-stuffed-shelves", "userReview": "First of all, let me just say this is an amazing book if it were a piece of fiction, but knowing that it's an autobiographical novel, makes it that much more awesome! The book is a bout a young boy who moves to the south. Kelly's life is anything but boring, the coming of age story will have you hooked by page one. The dialogue between characters seems casual and out of the ordinary to most. I could hear the voices and imagine them all so clearly in my mind, I felt I knew them myself. Louis seems like a guy I would want to get to know better, and it was a pleasure to do so after reading this book. He seems like the punk rocker kids I used to have as friends. He's charismatic and really quite a smart ass, which made me laugh out loud at many different parts of the book. That in itself makes for a great book. No matter the situation, he always seems to make things work out in his best interest.I too am from Southern California, and moved to the south recently, so I enjoyed taking the trip with Louis from Los Angeles to Alabama. The colorful language reminds me of my own family and friends so the dialogue reminded me of some of my own memories. When it comes to situations that may be difficult for some to write, or even read, he does not play the victim card, he simply tells it how it is, and how he escaped it all. I enjoyed being taken through every emotion and situation that Louis went through, and could relate a great portion of his life to my own. I can't stress enough how much I enjoyed this book, it was a such a quick read too because I just couldn't put it down. I know once you pick this book up, you won't want to put it down either. Just because it's a coming of age story, doesn't mean it's a juvenile book, I would say everyone of all ages can relate and be entertained by the end of this book. It deserves a 5/5 rating."}, {"userName": "Maya Archer-doyle", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/11039358-maya-archer-doyle", "userReview": "Gritty, funny, painful, poignant. I enjoyed this trip back in time and recognized those teenage years full confusion and excitement, boredom and curiosity and the search for people from the same tribe, so to speak. Plus, I like the author--he's a lovely, friendly, funny, human being."}, {"userName": "Joey", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/16132226-joey", "userReview": "A Masque of Infamy by Kelly DessaintNEW SPOILER FREE REVIEW!At the age of fifteen Louis moves from LA to Alabama with his dad, younger brother, and a friend of the family named Rick. Louis, with his punk/new-age-rocker style and his patchwork family sticks out like a sore thumb in his new deeply religious community. At home he fights a battle with Rick, who tries to wield a high level of control and authority over him and his brother. When he stumbles upon a set of photographs not meant for his eyes Louis has a decision to make that will change the course of his and his family’s lives forever. This book had a lot of potential. Do not believe the description on the front that says the author \"twists the horrors of growing up in a highly dysfunctional American family into a hilarious tale of survival.\" First of all this book is not funny. Not because it is about such serious subject matter. It just flat out was not funny. Louis, who narrates the story, is not really unique in anyway other than he dresses like a punk. He is not very smart, he is not funny, and he is not particularly heroic in anyway. The description goes on to call the book \"a story about stubbornly overcoming the odds to live long enough to tell the truth\". I will avoid spoilers here, but I will say that he doesn’t overcome anything. He is a very passive self-centered character who just sort of let’s things happen to him and to others.Basically Louis has no arch. He experiences zero personal growth. He is not around any one character long enough to form any kind of meaningful relationship (as far as the story is concerned) and there is pretty much no resolution. At the end of the book it said that there are more stories about Louis, but I have zero interest in reading them. The author failed to make me care about this kid.The writing in this book is not very good either. There are more plot holes and inconsistencies than a Fox News report. In the beginning of the book when he is in school it is made clear that he is not a very good student (gets straight D's and F's). Sure the author could have set it up to make him smart, but unable to perform well in school, but the author didn't do that. There is ONE reference to Louis reading in the beginning of the book and he was only reading magazines because he had nothing else to do. However, in the end of the book someone says to him \"Oh you’re so smart and you read all the time anyway!\" The voice was really inconsistent in this book as well (and not in a good way like in Push). When Louis is narrating he uses big words that a teen would pretty much never use, like erstwhile, chortle, and miasma. Perhaps this was the authors attempt to make him seem smart. However, he never said these words or sounded smart at all when he was talking to other characters. At one point someone says a word to him (that is way less obscure than erstwhile, but I forget what it actually was) and he responds with \"I have no idea what that means.\" The use of \"big words\" in the narration looked like the author was just randomly inserting SAT words into the story to make the writing seem more sophisticated. It was like his narration voice and speaking voice were two different characters. Not like Renee from The Elegance of the Hedgehog who actively hides her intelligence from others. It was just bad writing.Ultimately it seemed like this book rested heavily on the use of shocking themes and events to make it seem deep. It is loosely based on the author’s life, but when he adapted it to fiction he failed to deliver the elements that make a compelling story."}, {"userName": "Jourdaine", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/20850365-jourdaine", "userReview": "\"A Masque of Infamy\" follows young teenager, fifteen-year old Louis Baudrey, a young misfit who is a small voice trying to get noticed for his individuality. He listens to metal and punk music, makes homemade anarchy shirts, pierces his ears, and hangs out with other like-minded kids. In the beginning Louis and his young, eleven-year old brother, Joey, are shown being taken to a temporary home. It isn't made entirely clear why they are there, just that something about their home life is unsafe. After the brief chapter on the home, we re-meet Louis and Joey in the backseat of a car on the way to Alabama. In the front seat is the \"old man,\" their father, and Rick, a young man unrelated to the family. In the beginning there will be some confusion as to why Rick is around in the first place, but it will be explained further into the novel. It's made clear at the start that Rick has a desire to rule over the small family of three with an iron fist. Louis hates him for obvious reasons. Without going into any real detail to avoid spoilers, Rick will later be revealed as deeply disturbed. Unfortunately, Rick isn't the only one with deep-seated issues as well. This only causes the young Baudrey boys to suffer more than we expected.In the start, Louis Baudrey isn't the most likable character. He lies, he steals, mindlessly bullies his brother, and is obsessed with aesthetics and materialism. Of course, he's only fifteen years old, so that makes it easier to cut the kid a break. With the story being told from Louis's first person perspective, Kelly Dessaint really captures the through process of the average, young teenage boy. He hates school, looks at pretty girls, and wants to cause trouble for the sake of causing trouble.Everything shifts when Louis makes a discovery about Rick and the old man after scrounging the house for cigarette money. Having been taught at a young age that giving in to people can earn him rewards, he's quick to rat them out. He just didn't know it would throw him and his brother into a mental hospital. And even though it might seem that Louis is selfish and has no heart toward the situation, there are small bits and pieces that crack the mold.This novel will throw you into a mixture of emotions. Some portions have to be read with a thick skin because there will be parts that disturb you. Other parts will just make you smile. Overall, I think \"A Masque of Infamy\" is brilliant. The story is well thought out from beginning to end. We see Louis maturing more and more throughout the story with the subtle changes he makes, but there are aspects of his personality that will remain. It's still the same old Louis we meet in the beginning. The damage done throughout the novel just gives him a different mental approach to his hardships.Some people argue that the novel doesn't fully conclude in the end. I don't think it's meant to have a complete ending. Consider this book a fictional memoir, although I just read online that Masque highlights a lot of Dessaint's own childhood. Still, the novel reads like a memoir. It's open ended, yes, but with Louis's great character development throughout the novel, I'm left with a glimmer of hope that Louis's newly found wisdom will help him make some better judgments in the future. It could have had a happy conclusion, yes, but not everything can end on a perfect note. I couldn't have imagined a different ending to the novel. I loved this book. Even though it was a tough ride, it was worth the purchase."}, {"userName": "Tim Lowe", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/4514196-tim-lowe", "userReview": "When I was asked to participate in the book tour for this novel, my inclination was to politely decline. I explained to the delightful lady who asked for my participation that I primarily read nonfiction and didn't normally make time for fiction.The few times I do dip my foot into the fiction pool is when the plot is unique or in some way appealing to me by piquing my curiosity. I re-read the synopsis of A Masque of Infamy and, for whatever reason, the curiosity factor kicked in.Based to some degree on the writer's own story, A Masque of Infamy is a compelling and well-written coming of age story with a lot of fish out of water plot thrown in for good measure. Our protagonist, Louis Baudrey, is forced to move to rural Alabama from the suburbs of Hollywood, California.Louis is an endearing character, we forgive him his faults and pull for him to find peace and happiness as he navigates a world created by the less than savory adults around him.One of the things that stands out about this book is Dessaint's gift of writing dialogue. It would have been easy to make the words of the characters sound overly juvenile, but this is not the case. I believe the words and wouldn't be surprised if they were very, very close to actual conversations.A shocking plot twist propels Louis and his little brother into an even more chaotic life. You can't help but pull for this profane, confused, yet proud high schooler to find a way out of the Hell of this life into a life of his own creation.If you like coming of age stories and don't mind some \"real\" language you should support this small press book and give it your time. You can pride yourself in finding a real diamond in the rough."}, {"userName": "Ryan Mishap", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/1058994-ryan-mishap", "userReview": "Knowing a fictional narrative is partially based on the author's real life can hinder a review. Too often--and this is almost the case here--the fictionalized account can read like reportage: this happened and then this and then this. This tendency can override any of the qualities we associate with novels as an art form. The narrative can get too straightforward, not expand on characters, and not provide relevant subplots or similar devices. In cases like that, I wish they would have just written a memoir.The other difficulty--one that is shared when reviewing memoirs--is that the reviewer is tempted to review the character instead of the story. That would be a mistake, here, as our protagonist Louis isn't very likable, lacks empathy, and is selfish. Ouch, you say, but there are reasons for this.And this is where Dessaint takes a novelist's approach to the narrative, slowly revealing the past experiences that have led Louis to who he is; showing us how looking out for himself is necessary for survival. We also see a kid on the cusp of getting a clue not just about how the system works but how to understand others. Oh, and about punk rock as more than just music.The glimpse of the 1980s here is valuable. Weird is in for kids today, but, back then, being a misfit, a punk, gay, or rebellious could land you in an institution. Challenging the mainstream wasn't seen as normal or finding your own style but as disrespect, rebellion against authority, and a sign of being a troubled youth."}, {"userName": "Bradley Knox", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/26650736-bradley-knox", "userReview": "I had the opportunity to meet Kelly some months back in a central SoCal locale that we were both well acquainted with. We shot the shit about ‘back in the old days’ and other dusty punk rock lamentations. It’s what old punks do. All the while I was unaware that he had written this stark, bleak, brilliant and funny novel loosely (or maybe tightly) based on his distressed upbringing. I just finished this powerhouse of a book, and want to shamelessly plug it while its still fresh in my damaged brainpan. Instantly, I felt a kinship with Kelly because this opus begins in a city that we share a mutual history in. It then moved far beyond my just identifying with common experiences, because his experiences in his childhood and my experiences in my childhood were vastly different. What I found so captivating about Kelly’s’ viewpoints was his ability to capture emotional detachment, alienation, and confusion absolutely. And then to convey it to the reader. Goddamn, thank you for saying it for me. 'I don’t know how I fucking feel’ & ‘I don’t really give a shit what you think.’ Needless to say, I dig this book. I can see myself re-reading it many more times. This book has taken a permanent place in the bookcase."}, {"userName": "Grw", "userReviewDate": "Apr 22, 2014", "userURL": "http://www.goodreads.com/user/show/30087781-grw", "userReview": "This is a great coming of age book, that on the surface may appear to be just another troubled teenager book, but as it develops you come across the reasons why young Louis is the way he is, which leads to an understanding of where he is coming from, and why he is the way he is.The plot moves along at a nice pace, with needed jumps back and forth not just to explain what is happening but in line with how and when Louis deals with and confronts his past.The tale is all told from Louis' point of view, which works for the most part, although perhaps more being said about what was happening to his younger brother, at the same time, may of been better. That said, we get to live and breath the teenager's life, his thoughts, his nicotine addiction, and even his musical progression from metal to punk.In fact, probably the only flaw I could find with this book was the description of Def Leppard's \"Hysteria\" release as heavy metal. That aside, it's very nicely written without dwelling on the dark sides of the plot, as some novels of this ilk have a tendency to do."}, {"userName": "Celia", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/4642711-celia", "userReview": "I haven't reviewed many autobiographical works, so I was very interested in starting with A Masque of Infamy! The story is about Louis, a young boy who moves cross country to Alabama. From there, we are given an inside look to what becomes Louis's coming-of-age story. From bouts with abuse to living the punk rock life - it's all about this young boy becoming someone, despite his circumstances. The humor in this book can make one forget that it is, after all, based on a true story. Regardless, the humor is enjoyable and the story is harrowing. Anyone who is interested in autobiographies and coming-of-age stories will surely enjoy this read. I know I did."}, {"userName": "Annette", "userReviewDate": "Oct 26, 2013", "userURL": "http://www.goodreads.com/user/show/22914924-annette", "userReview": "I got A Masque of Infamy by Kelly Dessaint as part of goodreads.com first read program.A Masque of Infamy is a coming of age story of fifteen year old Louis Baudrey a transplant for LA to a small town Alabama. I love this book. The characters are well develop, the language is straight if some what graphic but expected from a fifteen year old or someone experiencing life such of Louis and his brother Joey. I love that Dessaint dealt with the issue of sexual abuse honestly. I find myself laughing and crying while reading Masque of infamy and cheering for Louis. A great read."}, {"userName": "Solita", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/20113703-solita", "userReview": "I didn't know what to expect, really. Difficulties, sure. Challenges. Rebellion. But never did it occur to me that it would be so heartbreaking. The story breaks my heart. It's amazing that children can feel protective or defensive of the worst parents. But I know it happens. I admire Dessaint immensely. He triumphs."}, {"userName": "Patricia Kaniasty", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/12926238-patricia-kaniasty", "userReview": "I liked it but what happened to the ending? It just.........stopped. Made no sense. Left too many unanswered questions. The story did have many good points..........was funny, sick, sad, and frustrating. Those are just a few. Would have been a 3 star but the ending.......or lack of one, brought it down to a 2. Oh well."}, {"userName": "Frau Sorge (Yuki)", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/7712794-frau-sorge-yuki", "userReview": "I can't read books dealing with.. Let's say - I can't read books like that.A Masque of Infamy left me literary gasping for air.I'd kill every single one character. With pleasure.You really want to join me."}, {"userName": "ShanLandis", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/51529317-shanlandis", "userReview": "Check out my review at:http://www.shannonsbookbag.blogspot.c..."}, {"userName": "Tiffany starling", "userReviewDate": "Oct 26, 2013", "userURL": "http://www.goodreads.com/user/show/23299778-tiffany-starling", "userReview": "Easy to ready and funny at times. Told a great story, just wanted to know more at the end."}], "description": "A Masque of Infamy is a ribald story of teenage rebellion, punk rock and survival. After moving from Los Angeles to small town Alabama in 1987, Louis Baudrey tries to fit in at the local high school, but the Bible-thumpers and the rednecks don't take too kindly to his outlandish wardrobe and punk attitude. At home, he defies the sadistic intentions of Rick, his father's friend, who tries to rule the household with an iron fist. As Louis is about to be shipped off to military school, he stumbles upon indisputable proof that will free him and his younger brother from Rick's tyranny. But just when he thinks their troubles are over, they're locked up in the adolescent ward of a mental hospital, where Louis must fight the red tape of the system to save himself, his brother and maybe even his dream of being a punk rocker.", "title": "A Masque of Infamy", "url": "https://www.goodreads.com/book/show/17793886-a-masque-of-infamy", "average": 4.11, "cover": "https://images.gr-assets.com/books/1365789219l/17793886.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/7046353.Kelly_Dessaint", "name": "Kelly Dessaint"}], "type": ["Relationships", "Health"], "outlinks": ["http://www.goodreads.com/book/show/17793886-a-masque-of-infamy", "http://www.goodreads.com/book/show/19246540-a-masque-of-infamy", "http://www.goodreads.com/book/show/22642938-behind-the-wheel", "http://www.goodreads.com/book/show/22614379-the-olympic-spirit-and-other-stories", "http://www.goodreads.com/book/show/24059790-behind-the-wheel-2", "http://www.goodreads.com/book/show/23242300-institutionalized", "http://www.goodreads.com/book/show/28957211-no-fun"]}