{"ratings": 56344, "userreviews": [{"userName": "Zoë", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "Read for my young adult literature class.A unique message and vivid writing - I loved how he was able to weave together three stories in such a short story!"}, {"userName": "karen", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this book is the perfect antidote to the \"graphic novels aren't real books\" crowd's poison. it takes full advantage of the medium (lgm with the local boy scout troops), and just runs with it. this story could not have been told as well or as broadly using a more traditional narrative structure. and at the end, there is a perfect collapse - the three storylines streamline so perfectly into one message about cultural acclimatization and race-shame. and why it is bad. but not in a preachy way. it is not rah-rah asia, it is just quietly, \"don't be an asshole; this is who you are.\" so it doesn't exclude roundeye from appreciating the message, like me at chinese new year at my ex's. I KNOW WHAT YOU ARE SAYING ABOUT ME, GRANDMA TSUI!so the stories include the traditional tale of the monkey king:a very tasteful depiction of a chinese gentleman come to america:and this cute young chinese-american boy with a perm:that's what the art looks like. and if i didn't have to read this for class, i would have missed out on it, because it is not the kind of art i am immediately drawn to. me and art, we don't understand each other. museums leave me cold, and with graphic novels, i am always drawn to certain ones and repulsed by others with not one whit of rhyme nor reason nor consistency. i am the worst at art-appreciation. but i am the queen of making thanksgiving dinner. and writing drunken book reviews. and white trash fixing of silverware drawers:recognize!!!but yeah, a totally charming book. i have no personal immigrant experience from which to draw as a way of relating to ths story, but it works on any level of \"appreciate thyself and don't wear shoes just because the humans are doing it\" kind of thing.where did that wine go?"}, {"userName": "Nat", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "I started reading this in the middle of the night because when you can’t fall asleep after a certain hour, you surrender and pick up a book.And for once in my life I was pretty happy about being awake in the early morning hours because I realized rather quickly that American Born Chinese is one of the best graphic novels I've read so far.\nThis review contains *spoilers*.All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...The writer captured the feelings of having a crush so damn perfectly. It was like someone was reading my mind.\nIt perfectly captured the essence of it.And along the way, we smoothly follow the story of the Monkey King:\nBorn to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...\nChin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...I kept thinking throughout my reading experience how Danny was going to be relevant in any way. I didn't know if we’re supposed to feel sorry for him… because I certainly didn't. He kept acting like an entitled white boy with little to no problems. \nEntitled white boy or what??But then.Then the three stories get connected and it completely knocked my socks off. Because it seemingly follows three unrelated tales until it all comes together for an epic - truly epic - twist that I didn't see coming from a mile off.It was pure brilliance.\nI was all, NOW WAIT JUST A DAMN MINUTE.....\nLiterally applauding Gene Luen Yang for this reveal that I did not see coming at all!!And here's a pretty accurate visual of me when the reveal came:\nI was shaking.And praising the writer even more for that ending and how intricate and well-plotted everything was thought out to the last detail. I seriously cannot stop thinking about everything that went down. There's so much to discuss: from white privilege to stereotypes to what it means to accept yourself... And everything was handled with brilliance.P.S. Wei-Chen is one of the best!!!\n\n\nIt's really been such a long time since a graphic novel has captured my heart like this. I read American Born Chinese in one breath and now I cannot stop raving about it. *Note: I'm an Amazon Affiliate. If you're interested in buying American Born Chinese, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Michael", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/1036930-michael", "userReview": "[image error]"}, {"userName": "Dolly Ou", "userReviewDate": "Dec 08, 2007", "userURL": "http://www.goodreads.com/user/show/399511-dolly-ou", "userReview": "Gene Luen Yang does a good job telling his story about his life (or not his own maybe) as a Chinese American. I was very excited to read this book becasue first it was a graphic novel and second his story sort of connects with me since I am a Chinese American myself. Yang chooses an interesting title, \"American Born Chinese\". Its not one of those clever, thought provoking titles, but it is a rare one that you don't come across often. I sort of anticipated on what this story will be about, but what I didn't expect was the form of the story. Basically there are three story lines: a story about an American Born Chinese who moves to a new area and goes to a school as the only asian kid, a popular chinese myth called \"Monkey King\", and a story about a chinese kid who has all these negative chinese stereotypes and ruins Danny's life. There is no chronological order to these stories. Yang goes back and forth with all three stories, but in the end eveything ties together.  One thing that I really like about this book is that everything is in color, unlike the other graphic novels that are black and white. The color adds more life into the stories which constantly reminds me that I am reading a biography (or autobiography). The writing is easy to understand but the main point of the book is the meaning it is trying to convey. It is always hard to live in two cultures at the same time, something like living two lives. In this book Yang mainly focused on the struggles of being a Chinese American, but I believe all minority groups experience the same thing. People who refuse to accept others and differences always make it harder for immigrants and maybe this book can change some minds.  I especially like this book because I went through the same stuggles Yang did. Identity checks, negative chinese stereotypes, isolation, things like that I felt before for being in the skin I am in, but that tells me more about the world and gets me into the real world faster. I appreciate that finally there is a chinese voice out there that feels and thinks like me. We need more of these kind of books to share the pain and tell others they're not alone, especially in the chinese community.  This book has won the Michael L. Printz Award and is a national book award finalist."}, {"userName": "Jan Philipzig", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/32295170-jan-philipzig", "userReview": "I liked Gene Luen Yang's The Shadow Hero a lot, so I had to finally check out the author's most well-known graphic novel, American Born Chinese. Both books are about the immigrant experience, a topic difficult to write about in ways that are (more or less) politically correct but not too obvious and predictable. In both cases I had my doubts early on as to whether Yang would be able to pull it off, but both times he eventually won me over with surprising plot twists and a flood of well-observed details.Yang's willingness to take the risk of boring or disconcerting the reader during the early stages of the reading experience is testament to his confidence and maturity as a storyteller, as it allows him to ultimately undermine the reader's expectations and preconceptions--often to astonishing effect. In the case of American Born Chinese, story elements that initially seemed offensive miraculously fall into place when Yang finally weaves the book's three narratives into one. The results feel unique, down-to-earth yet highly imaginative--wonderful stuff!"}, {"userName": "Thomas", "userReviewDate": "Nov 19, 2013", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "A graphic novel with a wonderful overarching message about identity and a solid representation of Asian-American characters. In American Born Chinese, Gene Luen Yang details the story of Jin Wang, the only Chinese-American at his new school. Yang intertwines Jin's struggle with the tale of Chin-Kee (say this name aloud), the ultimate negative Chinese stereotype, as well as the legend of the Monkey King, one of the most famous Chinese fables. These three plots come together in an unexpected way to conclude the novel with a bang.Yang does a great job of deconstructing stereotypes about Asian-Americans by tackling them head on. He delves into Wang's emotions and his vulnerability as an insecure outsider when compared to his peers. He highlights the pressures to assimilate to the predominate culture, even at the cost of one's individuality. Though I found the twist at the end of the book abrupt and a bit too absurd, I appreciated how Yang kept the focus on the intricacies of Asian-American identity in a humorous, accessible way.Recommended to those interested in graphic novels or stories featuring diverse characters. A three star read I would still encourage others to check out, in particular to those searching for something different and fun."}, {"userName": "Jessica Abarquez", "userReviewDate": "Apr 14, 2008", "userURL": "http://www.goodreads.com/user/show/852534-jessica-abarquez", "userReview": "Reference information: Title: American Born ChineseAuthor: Gene Luen YangPublisher: First Second\tYear: 2006# of pages: 233\tGenre: Graphic NovelReading level: 6th grade\tInterest level: 15 yrs oldPotential hot lava: some racist language, some violenceGeneral response/reaction:I was surprised at how quickly I finished this graphic novel. This book was so easy to read (probably because it was a graphic novel). When I read the inside flap for the plot of the book, I was surprised to read that there were three different stories going on. Then the flap said that all three of those stories would converge and I was even more interested. I enjoyed the stories because it definitely showed the identity crisis that many minorities feel in the United States. While many people would like to think that those minority stereotypes disappeared a long time ago, this book was published in 2006 and absolutely shows that those stereotypes still exist. Subjects, Themes, and Big Ideas:•\tIdentity•\tRacism•\tFriendship•\tAcceptanceCharacters:•\tThe Monkey King: He is a king, born in an unorthodox manner, and he wants to be hailed as a deity. He practices kung fu and the different ways to become immortal, but in the process, he loses his identity. As his punishment, the Monkey King is buried under a rock mountain.•\tJin Wang: He was born in American and barely had any friends when he moved from Chinatown in San Francisco to another part of California. He soon made friends with a boy from Taiwan and falls for an American girl. Eventually, things go bad for Jin and he wishes to be someone else.•\tWei-Chen Sun: A boy who moved from Taiwan. He becomes best friends with Jin Wang and dates the only other Asian in the class, Suzy Nakamura.•\tDanny: A boy who has transferred to his third high school. He finally finds his niche in school by making the basketball team and talking to girls. Unfortunately, his crazy cousin, Chin-Kee comes to visit and ruins everything. However, Danny turns out to be someone else.•\tChin-Kee: Danny’s cousin who comes to visit once a year. He draws such attention to himself and embarrasses Danny so much that Danny has to transfer schools. Chin-Kee turns out to be more than just Danny’s cousin.Plot summary:The Monkey King wants to be hailed as a deity but the gods will not allow it. He then practices different ways to become immortal and when he achieves it, he challenges the Creator himself. However, the Creator is not happy with the Monkey King’s disrespect and buries the Monkey King under a mountain of rocks for 500 years.Jin Wang is a Chinese-American kid who doesn’t feel like he fits in anywhere. He thinks school is boring until he falls in love with an American girl. That relationship doesn’t work out and he takes his frustrations out on his other two Asian friends. Jin Wang wants to become someone else and he soon gets his wish and transforms into another person.Danny is an American boy who has transferred to three different schools in the past few years. The reason for the transfers is because his cousin Chin-Kee visits every year and the embarrassment from those visits follow him everywhere. Danny finally has enough of the antics and confronts Chin-Kee.Although these three stories seem to have nothing in common, they flow together in the end. The Monkey King is taken on a quest with a monk to help mankind. The Monkey King’s son wanted to live among the humans and became best friends with Jin Wang. When Jin hurt Wei-Chen’s feelings, Wei-Chen turns his back on serving the humans and decides to live as a human for his own gain. Jin transforms into Danny and lives his life in another form. When Danny confronts Chin-Kee, his cousin fights back and then reveals himself to be the Monkey King. Since the Monkey King learned to accept his true form, he tells Danny to accept his true from as Jin Wang. The Monkey King explains everything to Jin. Then he explains that his son did not want to see him anymore, so the Monkey King started visiting Jin to always remind him of where he came from and what his culture is.Strengths (including reviews and awards):•\tIt is a different kind of book (graphic novel)•\tIt shows a minority’s perspective•\tWinner of the Michael L. Printz Award•\tNational Book Award finalist•\tPublisher’s Weekly Best Book of the Year•\tBooklist Editors’ Choice BookDrawbacks or other cautions:•\tSome people might not know how to read a graphic novel carefullyTeaching ideas:Pre-reading:•\tJournals: Identityo\tHow would you describe yourself?o\tHow would others describe you?o\tWhat are the traits that make up your personality?o\tWhere are you from?o\tThese questions will help the student understand their whole self.•\tHow to read a graphic novel.o\tI would want to help them understand that reading a graphic novel is quite different from reading a normal book or even a comic book. Some authors are very picky about having their work be called a “graphic novel” rather than a comic book.o\tWe would discuss the differences between a comic book and a graphic novel.o\tJust like other works of literature, graphic novels have become movies. We could possibly watch and compare movies to the graphic novel.During Reading:•\tJournals:o\tMyths:\tWhat are some myths that you have heard?\tIs this myth (monkey king) like any other one you’ve heard or read about?o\tStereotypes:\tWhat are the stereotypes depicted in this book?\tDo you feel that they are accurate?\tHow can one fight stereotypes and ridicule?o\tCrazy family members:\tDo you have a crazy family member?\tWhat makes them embarrass you?o\tIdentity:\tDid you ever want to be somebody else?\tWho? Why?\tWhat was the outcome?•\tWe would discuss all these topics as well if they were comfortable doing so.•\tCompare stories with other well known stories:o\tJin Wang/Danny: sort of like Peter Parker/Spider-Mano\tMonkey King: Beowulf (?—I’ve never read Beowulf so I’m not 100% sure there’s a relation here, but maybe there is from the small bit that I’ve heard)o\tMonkey King: OdysseyPost-Reading:•\tCreate your own graphic novelo\tOr at least a few pages of a graphic novelo\tThe students can either make their own story or use a well known story and illustrate it•\tSwitch dayo\tHave students switch identities for a day\tSort of like “Principal for a day” only differento\tSee if the students really liked being someone else or if they prefer their old life•\tFamily tieso\tGet to know your crazy family member, maybe there is more to them than just crazy."}, {"userName": "Seth T.", "userReviewDate": "Nov 21, 2007", "userURL": "http://www.goodreads.com/user/show/160319-seth-t", "userReview": "It's funny that the most notable thing I can tell you about this book is that it's in colour.That might not strike you as odd, but really, for the type of story Yang tells, the comics industry has almost universally awarded such stories a black and white printing. If not autobiographical, American Born Chinese is the kind of story that might very well be.Examining the difficulty with which a child born in one country from parents of another country, the author explores the kind of dissatisfaction common to many in similar circumstances. The desire to blend in, the need to eliminate traces of heritage. I've never felt these things in my life, but through Yang's story, I could begin to understand in a manner other than pure academic assent.Yang weaves three narratives together in a masterful way and each sings of a different life's lesson. There is the story of the Monkey King (the classic Chinese figure), the story of Jin and his difficulty fitting into a school in which he is the only student of Chinese descent, and the story of Danny, who is plagued by his ridiculous cousin Chin-Kee (who is appears as a stereotyped caricature complete with affected speech - Ls for Rs and vice versa). Strangely, the Chin-Kee episodes actually carry a laugh track.It should be notable that the only bad thing I have to say about the book was that I didn't find it as good as its hype. Yang's book picked up a fistful of worthy awards last year. Not just Best Graphic Novel awards but several Best Book Awards.* As good as it was, I'd read better and while I would recommend it to anyone, I can't see myself reading it more than a couple more times if I live to seventy.*note: Best Book Awards from Publisher's Weekly, School Library Journal, and San Francisco Chronicle. Plus piles of other awards from elsewhere."}, {"userName": "Xueting", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/4691420-xueting", "userReview": "One thing that stood out most is that the author focused on exploring the inner self-conscious shame of the immigrant or non-Western, instead of making his main characters perfect, full of mature pride for his identity. In fact, the students around Jin Wang and Wei Chen were portrayed pretty realistically too - some of them were disgusting bullies seeing only one stereotypical image of the Asian, some were more subtly bigoted, and some others don't treat them any different. Although I'm Asian, not an Asian-American, I believe this kind of more complex identities are the real thing everywhere, so I really like how the author told his story this way.Oh, and the twist in how the three stories connect? WOW THAT WAS COOL."}, {"userName": "Brierly", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/25485458-brierly", "userReview": "[Chin-Kee exists as a foil to Danny/Jin (hide spoiler)]"}, {"userName": "Ariel", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "SO FLIPPING GOOD! Quite a quirky book, but it benefits from it. It does it's own thing and completely does it well. The themes were powerful and well delivered: I loved seeing the three different stories comment on racism, but more than that, self acceptance.The art wasn't /necessarily/ outstanding, in the terms that I didn't find myself ogling over the illustrations. BUT, it was perfect for this story. It was wonderful! I liked it! Don't get me wrong! The monkey pictures were so cute!I'll definitely be reading more by this author!"}, {"userName": "alexandra", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/6784858-alexandra", "userReview": "this book was WAITING for me the give it a five-star review, until the ending left me thinking, \"wait, what? THAT'S IT???\" it's a contemporary-type ending where the end is implied but i wasn't expecting that and i wanted a cohesive conclusion!but other than the last page, this book was... really inspirational and lovely. i've never ~actually~ read a graphic novel and i wasn't expecting it to make such a huge mark on my perspective of life. i think it's mostly because my personal experience in elementary school was similar to jin's, one of our main characters. he talks about moving to a new city where the majority is white and we see the teasing he gets for being chinese (or just, asian in general). this sort of thing happened when i moved to a new city, a new school, but i wasn't entirely conscious of the racist remarks. jin, however, begins to feel like he needs to BECOME white and blonde and blue-eyed. the whole experience and story follows that and it made me a bit sad at how relatable and true the story is.i felt this novel on a personal level, and that doesn't happen very often anymore. because of that, i'll always cherish this tiny book of wonder. i think i'll be reading more graphic novels in the future, as this one was a quick, but long lasting read. (also, i think the art is lovely, so graphic novels!! yay!!!)"}, {"userName": "Terry", "userReviewDate": "Feb 23, 2008", "userURL": "http://www.goodreads.com/user/show/252020-terry", "userReview": "This took all of about an hour to read and was totally worth it. Three stories of quiet power unfurl--the Monkey King, who undertakes a quest for dominance after a slight by the gods; Jin Wang, the title character and one of a handful of Asian students at his elementary school, trying to maneuver through bullies, love, and American culture; and Danny, a white teenager, and his Chinese cousin, Chin-kee, the embodiment of the racist Chinese stereotype. All three stories intersect in the climax, with one twist that is predictable (but powerful) and another that is completely unexpected. This graphic novel is a page turner, with three stories of identity that are brilliantly plotted, paced, drawn, and scripted. There is no weak link--instead all flow seamlessly together to make a point that is both specific and that any reader can relate to. If I had to choose the best of the three, however, the half-dream, half-reality story of Danny and Chin-kee is masterful. The presentation and deconstruction of the stereotype is pitch-perfect. The whole time I knew what the author was up to, but his point has an amazing visual power with the way it is presented. (Deliberately vague here so as not to ruin anything.) From the intimate story that allies the reader with the protagonists, but never makes the reader awkwardly uncomfortable (there are uncomfortable scenes, but in a good way; this is no Napoleon Dynamite) to the fantastical but real characters, this graphic novel is a great exploration of identity told through three exciting, and, more importantly, non-didactic, stories. Only quibble--the climax happens too fast; this is saved, however, by the quiet beauty of the ending--this is a novel that ends not in fireworks but in the importance of culture and a friendship."}, {"userName": "David Yoon", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/4934590-david-yoon", "userReview": "Man this hit me in the feels. This would have been a momentous book for me as a pre-teen. I totally identified with Jin Wang and in him recognized the need to fit in as a second generation Asian surrounded by a majority of white peers and the undercurrent of Asian stereotypes that still bubbled to the surface from Long Duk Dong to William Hung. It is a coming of age story that explores this overwhelming need to fit in while wresting with a larger cultural identity. It works absolutely perfectly as a graphic novel and manages to say so much in such a short and simple way. Loved it."}, {"userName": "Leanna", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/335117-leanna", "userReview": "I’ve been hearing about Gene Luen Yang’s graphic novel American Born Chinese for months. The book won the Printz Award, was a National Book Award finalist, and was chosen the best book of the year by Publishers Weekly, School Library Journal, San Francisco Chronicle, etcetera, etcetera. This book has amazing credentials.Considering all the buzz, all the acclaim, my expectations were so high that perhaps I could not help but be disappointed. The book is good, but is really great?This is only the fourth graphic novel I’ve read this year, so I am far from an expert on the genre. However, I find both Deogratias and Persepolis far superior in both story and content.In American Born Chinese, Yang interweaves three seemingly unconnected stories: the main plot about a young Chinese-American boy, Jin Wang; a subplot about an exaggeratedly-Anglo teenager, Danny, and his extra-exaggeratedly-Chinese cousin, Chin-Kee; and the legend of the Monkey King.The graphic novel is ambitious, addressing identity struggles, racism, and learning to accept one’s heritage. All the topics are important and worth discussing. However, the book lacks subtlety and the ending feels flat. Those two flaws keep a good novel from being a great one."}, {"userName": "Kevin Xu", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/2310290-kevin-xu", "userReview": "This book mixes three different stories to combine as one overall book about how it is like being the An Chinese American boy. All story are mixed together so all one sees is the bites and parts until the end. The first story is the famous Chinese Fable, Journey to the West, but just with the Monkey King trying to teach morals. Then the second story, where the main character Jin Wang is introduced at age 9 as his family moves. It details his life from childhood until the end of middle school with his best friend Wei-Chein. Then the third story of Danny who is finally gets a visit from his cousin, Chin-Kee who he tries to avoid by changing schools every year before his visit. Overall a fun and interesting book and ride."}, {"userName": "Ferdy", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "SpoilersThe artwork was great, the three stories were good too (well, until the end when they all bizarrely came together). Loved the Monkey King fable, and Jin Wang's story of struggling to fit into middle school as the only Chinese American student, thought they were both quite insightful and interesting (before it went weird at the end). I wasn't as impressed with the Danny/Chin-Kee negative stereotype storyline - it didn't feel like it fit in with the other two stories even though the themes were similar in a way and even when it turned out that Danny was Jin Wang all along and Chin-Kee was the Monkey King and Jin's best friend was the Monkey King's son. I know it was meant to be symbolic of Jin struggling with his identity/race, and that the moral of the story was for Jin to accept and love who he was but the execution of it didn't work for me."}, {"userName": "Rebecca (whymermaids)", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/4713345-rebecca-whymermaids", "userReview": "American Born Chinese is a standalone graphic novel that tells three narratives: When Jin Wang’s family moves, he’s the only Chinese-American there, and he wants so desperately to fit in; the Monkey King wants nothing more than to be the most powerful being, and hide his monkey nature; Chin-Kee is how the Chinese are portrayed in the media, and even has a running “laugh track” along the bottom.All three stories are about what it means to want to be someone or something that you’re not, what it means to identify with something that you’re not, and why it’s important to accept who you are. I may not be Chinese or from a different heritage, but I was still able to relate to the themes. Everyone wants to be someone else sometimes. But the small moments of stereotypical racism immigrants and children of immigrants face on a daily basis were so wonderfully added and important for everyone to read and understand so as to prevent this kind of thing in the future.I love how the stories came together in the end. It’s a little messy, but it works.American Born Chinese is a wonderful story. It’s funny, poignant, and its message is strong."}, {"userName": "Liz Janet", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/5114433-liz-janet", "userReview": "“It’s easy to become anything you wish . . . so long as you’re willing to forfeit your soul.”\nWhen I first read this graphic novel, I was not impressed. Later I realized, it was because I had not understood it fully. So I went online, learned who the Monkey King was, and reread the entire thing. I am glad I did that, otherwise the morals of the story would have evaded me.This follows three stories, one follows the legend of Monkey King, the other is about a second-generation Chinese-American, and the other of a white American kid whose stereotypical Chinese cousin comes to visit. Although unrelated at first, we later learn they are all connected in ways we could not have suspected. It might take two reads for people to truly see what happened.The book is a deep exploration of the immigrant experience in America, following the struggles of recent immigrants all the way to various native born generations. Everything from learning the language and assimilating in order to fit in, and ignoring their roots, to the daily racial struggles of people.I am an immigrant, and I had to assimilate. However, due to my ethnicity, after I was fully capable of speaking the language, I stopped experienced the issues that my POC counterparts still face everyday. This book took my back to that time, as to remind me to never forget that even though I stopped struggling, there are many more, in increasing numbers, out there that need to feel welcome, not outsiders."}, {"userName": "da AL", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/50966750-da-al", "userReview": "Intimate, engaging story that anyone can relate to. Well done."}, {"userName": "Calista", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "I love it when you hear a book is good and then you read it and experience it and it's so much more. When a book is great it opens you to a new place and transports you. I feel I have lived a new experience of some kind. This was one of those books. Anyone who has ached to fit in and doesn't can relate to this book, or let me say, I can relate to this book. The book tells the story Of Jin Wang and his time at an American school. He wants to fit in and doesn't want to be different. He is the only Chinese boy until Wei Chin moves to school and Jin is embarrassed by him at first and they become friends, well, not easy friends. It is also telling us the myth of Monkey and how he wanted to fit in as a master of Kung Fu among the gods. It's a brilliant end I didn't see coming. Just an amazing story. You laugh, you cry, you're amazed, you're wowed and shocked. There is a reason this book shows up on all the lists. Give it a try."}, {"userName": "C.G. Drews", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "I'm not terribly knowledgable about Graphic Novels but I definitely enjoyed this one! It reminded me of In the Year of the Boar and Jackie Robinson (which I read like a million years ago for school). It's kind of an exaggerated truth about learning to be who you really are and accept yourself. There's a lot in it about racism too and how hard it is for culture's to accept other cultures. SO YUS. It was a fantastic read. It was a fair bit nonsensical, which I usually loved...but I did find myself feeling a bit twitchy because it was 98% unrealistic in terms of...um, realism and logicality. BUT THAT'S NOT THE POINT OF THE STORY! The point is the message. So I don't mind the unrealism, but it's just something that doesn't grab me hugely. For someone who's totally uneducated in graphic novels until, like, 2 weeks ago....I LIKED THIS."}, {"userName": "Adira", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/17890950-adira", "userReview": "I gave this graphic novel 3.5 starsI've been wanting to read this graphic novel ever since I saw it on FrenchieDee's YouTube channel. I found it at my college's library and read it in one sitting. I really enjoyed the storyline for the most part, but was left iunsatisfied by the end. To me, it seemed as if Yang ran out of steam before he had finished all the characters' stories. In short, the story was going good until it abruptly ended.Nevertheless, the artwork in the book was really eye catching. The pictures were drawn in a manner that sort of reminded me of the cartoon character, Astroboy. They weren't too extravagant in look however, they were befitting of the story that Yang was trying to tell. All in all, I'd recommend this graphic novel for anyone who wants a good read that's quick and comical. But be warned, one of the characters do display exaggerated stereotypical characteristics."}, {"userName": "Sam Quixote", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "\"American Born Chinese\" has three stories combined into one: the story of the Monkey King and his fight for acceptance among the pantheon of Gods; a lewd Western caricature of Chinese people called Chin-Kee; and at its heart the coming of age story of Jin, a young Chinese boy growing up in America. The story is drawn in a cartoony/Manga type style and coloured by Lark Pien. The overall effect is a very attractive comic. The story though is brilliant. There were moments in Jin's story where his life mirrored my own (the girl at the cinema part) and despite the pervading message - accept who you are and be happy - it's neither patronising or overbearing. The three stories become one by the end and it all becomes a bit magical-realism-y but its such a good story told and drawn so well you won't mind. A fantastic read and a great book."}, {"userName": "Roxanyeli", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/20178778-roxanyeli", "userReview": "3.5*Nice story about being yourself and accepting the way you are."}, {"userName": "Jimmy", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/1325473-jimmy", "userReview": "I'm not an ABC; but I was born in Hong Kong, and came over here when I was 4, so I can relate to a lot of these feelings. (Also, my parents told me the same stories about the monkey king). I find it especially sad when the biggest bullies on the playground are the ones with the same skin color as me. In order to belong, we oppress each other. In middle school, I was one of two Asian Americans, and though the white boys were pretty big bullies, the worst bully of them all was the other Asian. He was Vietnamese, and because I was still so naive, I couldn't figure out why he would be so mean to me.One thing that I didn't relate to was wanting to be white. Though I was bullied, though I felt the weight of being ethnically different, I never wanted to be white. But at the same time, I didn't want to be Chinese either. I felt isolated and alienated from both worlds. And maybe that was my solace. Only in recent years have I started to come out of that, accepting and wanting to be both American and Chinese, in that they are not mutually exclusive.As for this book, it's pretty entertaining and touches on some important themes. Although I still think it's a bit too simplistic. And perhaps a bit too neat of a structure/ending for me. I understand though; it has to be a little streamlined to get across its point and I applaud it for that."}, {"userName": "Misty", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "Gene Luen Yang blends three stories (that of the famous chinese Monkey god from Journey to the West; the story of Jin Wang, an American boy born of Chinese immigrants; and Chin-Kee, a walking stereotype) into one humorous and thought-provoking story told in graphic novel form that reads like a self-effacing diary. His characters are funny and charming, and the three separate threads combine at the end to make them something greater than the sum of their parts.American Born Chinese is easily a one-sitting read, though much more time may be spent poring over the illustrations (which have a Bazooka Joe lightness to them), which capture the moods perfectly.Despite mild and rare cursing, this book can easily be shared with younger readers. Yang manages to deal with serious subjects with a light hand, respecting them without getting bogged down in didacticism or the pointing of fingers. His writing is fun, witty and playful, and his book charming."}, {"userName": "Jeremy", "userReviewDate": "Jun 26, 2007", "userURL": "http://www.goodreads.com/user/show/106700-jeremy", "userReview": "Separately, the three stories that make up this book are all immediately engaging and quite funny. Unfortunately, Yang tries to get fancy at the end, laboriously converging stories that were much better off on their own. The result is ultimately unsatisfying, a hasty wrap-up posing as innovative narrative. A shame, since until the overreaching conclusion I was feeling very four-star, even slightly five-star, about what I'd been reading. Three awesome graphic novels are better than one decent one anyday. Nonetheless, I thoroughly enjoyed the journey, if not the destination. It's a quick, lively read, and I laughed out loud several times. And, hey, maybe the ending'll work for you. I wish it had worked for me."}, {"userName": "Elyse", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Charming!!!! A a delicate balance of light & dark! Bursts with artful details (3 stories --which tie together in the end)!I'm starting to love these colorful graphics ---(its amazing the amount of 'feelings' which come through with words & pictures 'together')."}], "description": "All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...Born to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...Chin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...These three apparently unrelated tales come together with an unexpected twist, in a modern fable that is hilarious, poignant and action-packed. American Born Chinese is an amazing rise, all the way up to the astonishing climax--and confirms what a growing number of readers already know: Gene Yang is a major talent.", "title": "American Born Chinese", "url": "http://www.goodreads.com/book/show/118944.American_Born_Chinese", "average": 3.88, "cover": "https://images.gr-assets.com/books/1317066615l/118944.jpg", "reviews": 6503, "authors": [{"url": "https://www.goodreads.com/author/show/68959.Gene_Luen_Yang", "name": "Gene Luen Yang"}], "type": ["Sequential Art", "Young Adult", "Sequential Art", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/118944.American_Born_Chinese", "http://www.goodreads.com/book/show/3354905-american-born-chinese", "http://www.goodreads.com/book/show/16277248-avatar", "http://www.goodreads.com/book/show/12413836-avatar", "http://www.goodreads.com/book/show/13096848-avatar", "http://www.goodreads.com/book/show/17210470-boxers", "http://www.goodreads.com/book/show/18687079-avatar"]}