{"ratings": 138551, "userreviews": [{"userName": "Steph Sinclair", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "This is my favorite book of 2011! This review may contain extreme amounts of gushing!I...I...I...\n-----The above was my immediate reaction after finishing this book. There simply were no words to describe how much I loved it, how it horrified me, shocked me, tore at my heart again and again. Brilliant.2011 turned out to be a great year for Angel books for me. I know that might seem strange when you think of the more popular horrible ones **cough* Hush, Hush*cough*Halo*cough*Fallen*cough**. But there is indeed hope for this paranormal genre. I thought this genre couldn't get any better than Unearthly, Angel, or Daughter of Smoke and Bone. Then, I read Angelfall. Are the literary gods playing a joke on me? How ironic for me to find my favorite book of 2011 in the last week of the year. I'm going to do this review a little differently. I'm not going to go in some extreme in-depth talk about how awesome this book is because there are a few other reviews that do that and I don't think I could do the book any justice even if I tried. Instead, I'm going to give you ten reasons why you should go purchase this book RIGHT NOW.1. Angelfall kicks off right from the start with plenty of action and never settles down. Expect little to no sleep until you've finished.2. Penryn is my pick for strongest heroine of 2011. In fact, I created a new shelf just for her: \"Ass-kickin' heroine.\" Between how she sticks up for herself and her awesomely cool, Kung Fu Panda-type skills, she's a fuckin' boss. Bet on it.3. Witty Dialogue. There are so many quotes I could paste into my review, but I can't because I'd end up just pasting the entire book. But I will paste my absolute favorite: \n“My friends call me Wrath,” says Raffe. “My enemies call me Please Have Mercy. What’s your name, soldier boy?”\n Yeah, he's a badass 'G.' Susan, how do you come up with this stuff? I was thoroughly entertained!4. The post-apocalyptic world. It's shocking, horrifying, and any other adjective you can possibly use to describe the emotion you feel while reading this book. It's a world I could never live in. I'd pretty much put my head between my legs and kiss my ass goodbye. 5. Susan did her research. Angel books run the risk of not being true to their mythological \"rules.\" I think you know what I'm talking about here. Halo: Only eight angels fell from Heaven? Let's get real. The Mortal Instruments: Nephilim are the good guys? You've got to be kidding me. The Succubus series: Angels hanging out with Demons playing cards? Really? Really, dude? Susan created a realistic world of angels while somehow managing to not sound preachy and staying true to their original mythical cannon. 6. Because I said so.7. The plot twists will leave you twisted. You will never see the climax or the ending coming. It blows you away.8. Angelfall is like a weird mix between Planet of the Apes, Resident Evil and Frankenstein. Yes, it is possible for a book to be that awesome. This is that book.9. Did I mention the dialogue? I did? Oh, well...it was so amazeballs that it deserves another separate reason. Annnddddd...I quote: \nI never kid about my warrior demigod status.\"Oh. My. God.\" I lower my voice, having forgotten to whisper. \"You are nothing but a bird with an attitude. Okay, so you have a few muscles, I'll grant you that. But you know, a bird is nothing but a barely evolved lizard. That's what you are.“You're like a little girl demanding answers to questions during a covert operation. Why is the sky blue, daddy? Can I ask that man with the machine gun where the bathroom is? If you don't stay quiet, I'm going to have to dump you.” “Leaking sacks of mutated maggots?\" He raises his perfectly arched eyebrow as though I'd just failed my verbal insult exam.”“Oh, please. Your giant head is getting too big for this forest. Pretty soon, you're going to get stuck trying to walk between two tress. And then, I'll have to rescue you.\" I give him a weary look. \"Again.”“Those pigeons couldn't take us out if they send their entire chirping flock.”\n Must.Stop.Quoting.10. Let us not forget the most important reason of all: NO INSTA-LOVE FOUND HERE! I like my romance slow burning and taking a backseat to the plot and action. Angelfall did just that. I likey. I likey a lot.It is only $.99! You have no reason NOT to buy this book! Go do it now!And I know I say reviews are not for authors but for readers. However, Susan, if you happen to read this review I just have two things to say to you:More reviews and more at Cuddlebuggery Book Blog."}, {"userName": "Emily May", "userReviewDate": "Dec 18, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Oh my goodness, I think this book might have just ruined the entire urban fantasy - and possibly dystopian too - genre for me. Because, where can I go from here? Does it ever get better than this? Please be warned right now that this review is going to be nothing less than gushing. I loved everything about this book, so much so that I may need to keep writing in italics. I can't believe I nearly didn't read this book. I've looked at the other rave reviews for it so many times and I kept coming back and re-reading the goodreads description, trying to talk myself into a book with angels. Because, well, I think angels are actually rather lame. I also can't help but discriminate against books that are only published as ebooks, especially when it's becoming more and more apparent that anyone can stick their books on kindle and sell them at a ridiculously cheap price. I find myself thinking: \"if books like Tempest and Article 5 can make it into bookstores, this must be really bad\". This theory has been metaphorically kicked, flattened and destroyed by Angelfall.Let's start with the key ingredient: an addictive quality. I was utterly captivated by the story from the very beginning, it pulled me in and didn't let go until the very last page. So many books don't have this, that special something that makes it absolutely necessary that you read on, no matter what time it is and whether or not you need to get up early in the morning. The story isn't the most unique idea I've ever heard - a future world that has been torn apart by angels. The kind that are cold, cruel and merciless, that see humans has little more than ants, no Halo-type storylines here. Penryn is a seventeen-year-old girl who must look after both her disabled sister and her mentally unstable mother who talks to \"demons\". In one eventful day, Penryn rescues an angel who is being attacked by five others, which results in her sister getting captured by one of the five. With only the angel - an enemy - who can help, Penryn sets out to rescue her sister.Now Penryn may actually be my new favourite heroine of all time. In every way. She kicks ass, but at the same time she is a normal teenage girl who just wants to keep her family safe. There's a hint, or perhaps I should say a suggestion of romance, but Penryn has much more important things to worry about and she knows where her priorities lie (thank you! thank you! thank you!). The dialogue between Penryn and Raffe (the angel) is fantastic, it's so witty, funny and sometimes touching. Good grief, I love this book!The pace never slows, the excitement never runs dry, and the ending is the perfect mixture of closure and a temptation for more. The second installment simply cannot come fast enough."}, {"userName": "Wendy Darling", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[hah hah, tastefully! (hide spoiler)]"}, {"userName": "Cait", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/5254851-cait", "userReview": "Warning, warning: this review has a lot of expletives because this book makes me so damn happy. I also get a bit of an attitude when a book makes me overjoyed, so be forewarned. I'm a little sassy. This book just makes me feel so incredibly happy inside that I just can't help expressing myself. When I finished this book I basically did this:Yes, I fainted from sheer happiness and then got up and danced. Ya got a problem with that?I think that you all know that  one  book that you always wish for, especially after you read a total shit-fest  like Twilight, Halo, Hush Hush, Unleashed, basically many mainstream novels  that just have  everything.  And I mean the  works,  dammit. A badass girl who can take care of herself, a hot ( I know we all say that looks aren't everything, but, come on, there's always a small part of us that wants a guy who looks like sex on a stick) guy who not only has the looks, but the personality and smarts to back it up, action, a plot that makes you beg for more every single page, and a relationship that you can actually look at and go, \"God dammit that's  real  love!\"This. Is. That. Fucking. Book. This is a great book to read whether you just came off of a streak of bad books, this is a great book to read if you were reading a lot of good books, this is just a great book to read  whenever the fuck you want to.  And how much does this book of amazingness cost on amazon kindle?  ONLY .99 FUCKING CENTS! That's right; so I don't want to hear any excuses about how expensive it would be; and even if you don't have a kindle as long as you have a computer/laptop you can download the app (which is free, by the way) and read it there. Am I telling you that you  want  to read this? NO. I'm telling you that you  need  to read this, and here's why: Our main female character, Penryn. Angelfall is set in a post apocalyptic world where, six weeks ago, angels have come and delivered the, \"day of reckoning.\" As an added aside, I like that she only put it six weeks after the angels have gone and destroyed everything, because Ee does a great job in giving us extra insight into how some things in are world are still the same, but also how our world has become drastically changed from how it used to be. It's a very interesting dichotomy that really highlights Penryn as a whole; because she's kind of like that herself. She still has some of the same dreams and values as before, but other things have changed so drastically that she can't help but be forever changed by all this; acquire some of that ugly, more savage, side of human nature. Let me tell you more about this badass chick: Penryn, our main character, who is a seventeen year-old girl just trying to survive with a crippled seven year-old sister (which her mother may or may not have caused), and a paranoid sociopath of a mother. Now you would think that she would be incredibly sad and mope in the novel about how much her life sucks, but she doesn't. She just wants to survive to see the next sunrise. She's blunt about her mom and her problems; really she's pretty blunt about everything that's happening in her life. She tells it like it is and even has a kind of dry humor about how upside-down her whole life is. And I must say that it's kind of really badass of her when she says stuff like this:“Penryn? Who are you talking to?” My mother sounds almost frantic now. “Just my own personal demon, Mom. Don’t worry. He’s just a little weakling.” Weak or not, we both know [Raffe] could have killed me if that’s what he wanted. I won’t give him the satisfaction of knowing I was scared, though. “Oh.” She sounds calm suddenly, as if that explained everything. “Okay. Don’t underestimate them. And don’t make them promises you can’t keep.” I can tell by her fading voice as she says this that she’s reassured and walking away. The baffled look the angel shoots at the door makes me chuckle. He glances my way, giving me a you’re-weirder-than-your-mom look. Here's some more of that dry humor of hers that I love so much: That calls for a witty comeback. “Whatever,” I say. Okay, so I won’t be getting the Witty Woman of the Year Award. “Do you want me to show you how to use this or not?” I sound surly. It’s the best I can do right now. I’m tempted to make a quip about requiring dinner and a movie before getting so kinky, but I don’t. The last thing I need is to start making sex jokes while I’m being held prisoner in a camp full of armed men in a world where there are no laws. Penryn also embraces the insanity of how her world has become, because she knows that if she doesn't accept this new world where down is up and up is down she  will  go insane. There's a scene where she finds a man whom her mom had stuck seven knives into his chest and had \" purposely missed his heart, and he will slowly bleed to death.\" dressed him up in a provocative, womanly, pose, and put make-up on his face (yes, people, she is that fucking insane). This is what Penryn says after:If we had been back in the old world, in the World Before, I would have called an ambulance despite the fact that he had attacked my mother. The doctors would have fixed him up, and he would have had all the time he needed to recover in jail. But unfortunately for all of us, this is the World After. I step around him and leave him to his slow death. Although that's horribly gruesome (which is think is kind of awesome; this is quite the dark and creepy book and for good reason), I'm going to borrow the saying, \"that's just how it is\" and Penryn knows and acknowledges that. I also liked that she didn't totally despise her mother, although she had every single reason to hate her. She still cares for her and hopes she's safe when they're separated. Towards the end, she even begins to empathize with her mom when she's put in a similar situation; in fact, this story has a lot of growth where, at the beginning, Penryn looks at things through different eyes than she does at the end. Ee does a  fantastic amazing  great job with her character growth. She definitely isn't the same person she once was, but I say that in the best way possible. Her journey changed her and that's a sad rarity these days in YA.Oh, and did I also mention that Penryn is fucking badass? Because she is. First off, she has  an angel sword.  And if that isn't enough her mom, after Penryn and her father showed up at home one day with her standing dazed in the middle of the room with Paige, who was two at that time and laying in a crumpled heap on the floor signed her up for basically every form of martial arts (what we believe is a lucid moment from her so Penryn can know how to protect herself if she attacks her). Basically, Penryn knows how to kick ass, and kick ass  hard.  Again, thanks to Ee's great descriptive writing, we get many scenes where Penryn takes on many assailants and kicks ass with actual  ways  to kick ass. Let me explain: we always read stories with \"action\" scenes in them where they say things like, \"he jumped up and kicked,\" or, \"he hit\" or even phrases that make no sense that the human body cannot possibly do. The authors themselves can't visualize the fighting because they probably haven't fought a day in their life, at least not expertly, so they use the most basic verbs to give the reader just enough. We  know  that they're fighting, but we can  see  it or  feel  it. But, boy, does Ee make us feel it. I've taken several self-defense classes so I know what works and what doesn't, and I think Ee took some as well because she describes and shows the same things my instructor taught us. Even if you haven't taken any classes and know how to defend/fight, Ee provides the information (using gravity, weight, etc.) needed so that you can understand it. And when you can understand it, you can visualize it, and if you can visualize it then the author has done the right thing. Here's one scene from her, and tell me that you can't at least visualize it and get your blood pumping:The trick with fighting multiple assailants is to avoid fighting them all at the same time. Unlike in the movies, attackers don’t wait in line to kick your ass, they want to pounce all at once like a pack of wolves. I dance in a semicircle around them until the guy closest to me is in the way of the other two. It only takes a second for them to run around their buddy, but that’s enough time for me to snap a solid kick to his groin. He doubles over, and though I’m dying to accept the invitation to knee him in the face, his buddies take precedence. I dance around to the other side of the doubled-over guy, making the others fall back into a line to get around him. I sweep the injured guy’s feet, and he comes crashing down on wife-beater number two. The remaining guy pounces on me and we roll on the ground in a grapple for the top position. I end up on the bottom. He outweighs me by a hundred pounds, but this is a position I’ve practiced fighting from over and over. Men tend to fight differently with a woman than they do with men. The overwhelming majority of fights between men and women start with the men attacking from behind, and almost instantly end on the ground with the woman on the bottom. So a good female fighter needs to know how to fight on her back. As we struggle, I wriggle my leg out from under him for leverage. Brace. Then tip him over to one side with a twist of my hip. He flips onto his back. Before he can get his bearings again, I slam my heel down on his groin. I’m up in a flash and kicking his head before he recovers. I kick him so hard his head whiplashes back and forth. You don't want to mess with Penryn, or else she'll fuck you up. And Ee knows what she's talking about.And the last thing I want to talk about with her is her overall personality. From what I've told you you probably thinks she's some had-ass with no emotions (besides some dry humor), but she really is a kind person. Okay, maybe \"kind\" isn't the right word, but she's compassionate, loyal, stubborn, and she still believes that positive things can happen. Of course she's a bit more hard and tough than she used to be, but she still has those base beliefs and also her pride in humans as a society. Even with all the shit she's seen she still believes that we, as a race, can rise above and be the people she believes that they can be. She still feels grief, sadness, and rage about how things once were and that the angels had no right, but she knows she can't change the past, and moves on.I love this chick. She has a mind of her own and knows how to use it. The consummate dream-boy, Raffe.  “I’m coming.” I call out but only a croaked whisper comes out of my mouth. I try to swim toward her but my muscles are so cold that all I can do is flail. Flail and shiver in the path of my mother’s boat. “Hush. Shhh.” A soothing voice whispers in my ear. I feel the sofa cushions being pulled out from against my back. Then warmth envelopes me. Firm muscles embrace me from the space where the cushions used to be. I’m groggily aware of masculine arms wrapping themselves around me, their skin soft as a feather, their muscles steel velvet. Chasing away the ice in my veins and the nightmare “Shhh.” A husky whisper in my ear. I relax into the cocoon of warmth and let the sound of the rain on the roof lull me back to sleep. *melts a little bit*First things first, these angels are not some fluffily, singing, little cherub-like wusses. They are badass killers.Some of them are even *gasp* evil!  And I love it.  Oh, and, sadly, I can't tell you  too  much about him because what he is and what he does is a major plot point in the story, and I  really  don't want to ruin this for you all that's how good Raffe and this book is.Like I said before, Raffe is fucking sexy. Like so damn hot that I if I touched him I think my skin would sizzle  damn you, Ee, for describing him so well  and his royal hotness has invaded my dreams the last two nights since I've finished this book. But that is not all that he's about; in fact, if I had to put a list of his qualities that would be on the bottom. He, unlike *cough cough* Daniel from Fallen or Bethany *cough cough* shows his age as an angel and all that he's done has an affect on him. We never really know his physical age ( which I would range anywhere from 18 to even 21 or 22 based on the book), but all that he's done has an affect on his life and it shows. Even knowing that he's actually mature and not a purple, immature, Daniel had me going like this: But that's not even close to his full character. He's sarcastic, witty, clever, and also blunt like Penryn:“Here, I’ll show you how to use it. Let me see your foot.” “That’s a pretty intimate demand in the angel world. It usually takes dinner, some wine, and sparkling conversation for me to give up my feet.”  We walk for about an hour before Raffe whispers, “Does moping actually help humans feel better?” We’ve been whispering since we saw the victims on the road. “I’m not moping,” I whisper back. “Of course you’re not. A girl like you, spending time with a warrior demigod like me. What’s to mope about? Leaving a wheelchair behind couldn’t possibly show up on the radar compared to that.” I nearly stumble over a fallen branch. “You have got to be kidding me.” “I never kid about my warrior demigod status.” “Oh. My. God.” I lower my voice, having forgotten to whisper. “You are nothing but a bird with an attitude. Okay, so you have a few muscles, I’ll grant you that. But you know, a bird is nothing but a barely evolved lizard. That’s what you are.” He chuckles. “Evolution.” He leans over as if telling me a secret. “I’ll have you know that I’ve been this perfect since the beginning of time.” He is so close that his breath caresses my ear.“Oh, please. Your giant head is getting too big for this forest. Pretty soon, you’re going to get stuck trying to walk between two trees. And then, I’ll have to rescue you.” I give him a weary look. “Again.” I pick up my pace, trying to discourage the smart comeback that I’m sure will come. But it doesn’t. Could he be letting me have the last say? When I look back, Raffe has a smug grin on his face. That’s when I realize I’ve been manipulated into feeling better. I stubbornly try to resist but it’s already too late. I do feel a little better.  He snorts. “Aside from being beaned with a rock, I’ll live.” “Sorry.” I feel pretty god-awful about that, but there’s no point in groveling over it. “The next time you have a quarrel with me, I’d appreciate it if you could just talk to me first before resorting to pelting me with rocks.” And you can in the beginning see how much he does  not  want to fall in love with Penryn. For his whole life he's hunted the nephilim monsters that come from a woman and an angel consummating their love, but I guess that's the thing about love; when it happens you can't get away from it. Saying that, though, one of the best things is that although the love is there it's not the driving force of this book at all. It does what a book should do. It's not  the  driving force, but helps continue the plot. If anything, she does too little of it so the scenes you do get where she shows it you gobble up greedily  I even have them all bookmarked.  And the love is............fantastic. Their relationship grows from hate to amusement to caring to feeling to loving through the whole book. It's not too rushed and it's not too slow it's just.......perfect. You can really tell that he loves her; even the one time he tries pushing her away is heartbreaking, and you feel the same amount of confusion and hurt that Penryn does, but you have the added benefit of knowing why he's doing it  unlike finger-flipping Daniel . He really does care for her and wants the best for her. Most importantly, though, he doesn't try to control her; he knows she will do what she thinks is best and will try to stop her but lets her, in the end, make her  own choices.  There's one scene at the very end that will break your heart, but he does the same thing there and I  loved it.  This is a real, adult, loving, and so incredibly emotional relationship. They work together as a  team  with respect for one another. Ee is basically the first author that I've seen who has effectively created this kind of relationship, and I give her all kind of praise and admiration for it.Oh, and I find it horribly hilarious and awesome that Raffe is agnostic. Just so ya know.All in all, this book has a fantastic plot. It chugs along at a fantastic pace and always leaves you  needing  wanting more. The action, like I showed above, is badass and the overall theme and character development of Penryn is superb. It's a very dark book and there are some really gory and scary scenes that are, again, written superbly by Ee. She has a great sense of mixing something whimsical with something totally disgusting to make it that much more horrifying: It’s not long before we see the little girls. They hang from a tree. Not by their necks, but by ropes tied under their arms and around their chests. One girl looks to be about Paige’s age and the other a couple of years older. That would make them seven and nine. The older girl’s hand still grips the younger girl’s dress like she had tried to hold the little girl up out of harm’s way. They wear what look like matching striped dresses. It’s hard to tell now that the print is stained in blood. Most of the material has been ripped and shredded. Whatever gnawed on their legs and torso got full before it reached their chests. Or it was too low to the ground to reach them. The worst by far are their tortured expressions. They were alive when they were eaten.  This is a book that you will still be thinking about  days  after, and when you think about it, isn't that what counts? Sure, horrible books have the same affect, and those middle-of-the-road books you forget almost instantly, but those books; the simply fantastic ones that leave you shocked, dragged from one emotion to another, and wanting the next book so badly by the end that it hurts?This is that book. Ee brings back angels to the badass level that was so horribly decimated by authors like Kate, Adornetto, and Fitzpatrick. And that, in my opinion, is awesome. Sorry, I still had some extra freak-out left. But, seriously, pick up this book! It's only 99 cents and probably should be worth twenty dollars. Honestly, I want to support this author and have as many people buying this book as I can, because after that ending I  need  another one. What have you got to lose? Nothing, that's what. Angelfall is honestly one of mine, maybe even my favorite book of 2011, and I do not give out that compliment lightly."}, {"userName": "Lola  Reviewer", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "HELL TO THE YES.When I was a little younger, I used to be obsessed with angels. I used to wish to become one, the day of my death, (how morbid) and often absurdly made the said wish when blowing candles, on my birthdays.Therefore, everyone in my vicinity would see carry an angel story around. I was smitten with them. This peculiar obsession lasted for years and so my pile of angel books read became real impressive. Kissed by an Angel, Hush, Hush, Unearthly, Fallen, Daughter of Smoke & Bone, Once Dead, Twice Shy are some of the books/series that I would dive into.But hear me out: of all the stories featuring winged humans that I have had the pleasure to read, none was so… Obscure. Nasty. Raw. Gut-wrenching. Relentlessly dark.And more.I can’t say that it renewed my love toward angels… because obviously this book wouldn’t be what it is if those creatures were the ‘‘good guys,’’ but I sure as hell feel like reading further. I have no clue on how this will end. The world is already dead, what could happen more? I’m curious, so curious. I feel like snooping around Goodreads reviews and catch bits and hints on what will happen next with Penryn and Raffe, but will try to control myself.As for Penryn and Raffe… Raffe is not my type. I don’t sense a connection to him, even if I do enjoy his quick-witted lines full of smugness. Thing is, I've long now accepted the fact that not every book boyfriend can become our book boyfriend and Penryn and himself make such a perfect team, that I’m not going to try and steal him away from her. How’s that for unselfishness? *wink* *wink*If you haven’t implicitly gotten the message already, READ THIS BOOK."}, {"userName": "Marie Lu", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/4306637-marie-lu", "userReview": "This book rocked my socks. Penryn. Raffe. The dialogue. Awesome."}, {"userName": "Navessa", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "This main character...This world...This story...I’ve read this twice three times now, and I don’t know how to do it justice in a review.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Kat Kennedy", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "The morning beckons and when I turn over, the book I finished in the midnight hours is beside me. The fantasy world is slipping away, unable to follow me into the light. Reality creeps in with the rising dawn, but I'm reluctant to meet it. I want that world, those characters, that emotion back - but it's over. Time to find a new one in a new book and so the hunt is on but the sadness at leaving a good friend remains.Ee has done something amazing here and not just because she's written probably one of the best post-apocalypse fantasies of the year. But that would be a big part of it, yes.And you too can experience the goodness for just 99 cents on Amazon's kindle!Angelfall is a remarkable book, because if I were to tell you the synopsis, it would be so unspectacular, so typical of the genre, so... ordinary! But this book is anything but ordinary. Penryn's sister is captured by angels who've brought war and apocalypse to the human world. She finds an angel to help her retrieve her sister and they embark on a journey to get his wings back and rescue the young girl.Simple, right? That's what I thought too. I thought I was just embarking on a ridiculous bandwagon that was being indulgent of an unusually good indie fic.There are one or two issues I have with the novel but they are completely eclipsed by the brilliant story telling, characters and writing.I loved Penryn so completely; believed in her and championed her. This book is a brilliant journey of great character and spirit. Full of the weird and wonderful. Ee has a great imagination and a gift for story telling.I know after I finish writing this review I will go and hunt down my next read. Yet I will get increasingly aggravated and depressed because nothing I see is what I want. Because what I want is Angelfall #2 and none of those books will be that.Go ahead. Jump on the bandwagon. After all, you too could be waking up tomorrow wishing desperately that reality would just give you a little more time in this world, and with these characters, that Ee has created.This review also appears on my blog:"}, {"userName": "Keertana", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "Susan Ee, I salute you. Please do mankind a favor and send a copy of your book to every author who has ever written a book about angels - maybe they'll finally understand that they're not going about it right.  You  are.  This  is how you write a book about angels.  This  is how you write a post-apocalyptic book. This  is how you write a kick-ass heroine.  This  is how you write a gut-wrenching romance.  This  is how you write a torn family.  This  is how every book deserves to be written. Angelfall begins in a post-apocalyptic realm where angels have taken over the Earth and are ravaging and destroying everything. Penryn, caught up in a raging battle for survival, must take care of her crippled seven-year-old sister and her mother who is bordering on the verge of complete lunacy. When Penryn witnesses the cruel ripping apart of an angel's wings, in what she can only guess to be violent angel politics, she is thrust under the spotlight of these inhumane beings. Now, her sister has been kidnapped and her only hope of finding her is Raffe, the angel whose wings she just witnessed being brutally cut off. The two strike an unlikely compromise, but the world where Penryn lives is teeming with danger and finding her sister may put more on the line than Penryn originally believed...From the moment you crack open the spine of Angelfall, Susan Ee doesn't give you a moment to breathe. This is a story that completely sucks you in, keeping you frantically flipping the pages for more. Ee's writing is beautiful, flowing with such talent that it is surprising this is a self-published novel. Furthermore, Penryn's voice is refreshing, strong, and driven. She has quickly become one of my favorite female protagonists of all time and I found myself warming up to her stubborn will, dedication to her family, loyalty to her friends, and vulnerability all at once. Penryn, like so many characters before her, must hold the weight of her family on her shoulders, but she does it in a way that makes you immediately sympathize and admire her. Her mother, who is single-handedly responsible for putting her seven-year-old sister in a wheelchair, is far from stable and my heart broke over just how quickly Penryn must have had to grow up and assume the role of adult. Their relationship is a rocky one at best, but it is original, unique, and I find myself hoping against hope that it improves.Although Penryn was a completely kick-ass and self-reliant protagonist, she was no match for Raffe, the warrior angel. Raffe is self-assured, witty, and gorgeous - everything you can expect from a typical male protagonist right? Wrong. Raffe is a much deeper character than any usually featured in Young Adult novels and I fell for him - hard. Raffe has a long and mysterious past, which I am yearning to find out more about, but he is also compassionate, loyal, caring, trustworthy, and sweet beyond measure. His relationship with Penryn progresses slowly, steadily building up in a way that simply increased the passion between them. The romance in no way detracted from the pounding pace of the plot and took a glorious backseat, but it was present and subtle and beautiful all the same. It's the type of romance that leaves so much more imagination, for interpretation, and for growth that I couldn't  not  envy Ee's easy way of incorporating it into the tale. Susan Ee honestly makes writing look flawless. I couldn't find a single complaint, a single plot hole, a single something I didn't like about this book - and I'm a picky reader. This is hands down one of the best books I've read this year. It has everything you could possibly want in it: an indomitable heroine, heart-pounding action, a swoon-worthy and slow romance that leaves you yearning for more, a well-fleshed out plot, and most importantly, a post-apocalyptic universe that keeps it real. Ee doesn't gloss over the ugly aspects of human nature and the desperate means people resort to live by - if anything, her descriptions of these events only add to increase my respect for her and my love for this story. If you haven't picked up Angelfall yet, then stop everything you're doing and go pick it up now. I surprised myself by finishing this in a matter of hours and I am more than tempted to order this online and read it again once it arrives at my doorstep. In fact, I probably will. I need more Raffe in my life ;) Either way, I will be amongst the first people to get my hands on this sequel when it comes...this was just so bloody brilliant I have no words to express its perfection. So what are you still doing reading this? Go! Go buy this book now and revel in its beauty :) You can find this review and more on my blog Ivy Book Bindings"}, {"userName": "Etnik", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/34369915-etnik", "userReview": "4.5 freaking stars!It was a great story.I haven't read much angel books before and this one was quite good.Also the characters fit with the story quite right.There were some funny moments which I really enjoyed.\nThe story:\nThe book is about a girl named Penryn who lives in a world taken by angels.She has a sick mother and a younger sister on a wheelchair.While they try to escape , her sister gets caught by an angel , and he takes her away.Now Penryn is desperate to find someone who can help her find her sister so she makes a deal with an angel.An enemy of hers!\nMain Characters\nPenryn One of the coolest badass female characters I have ever read about.Penryn has been through some rough times in her life with her mother and her sister and she always take the responsibility for taking care of thing.She is smart , caring strong (actually she is trained) and loyal to her family and friends.RaffeWhat I liked about this character is his sense of humor.He comes up some funny jokes even in the most thrilled moments.He is also a man of his word , caring , pretty strong and quite smart.\nMe while reading the book ( favorite sentences ) :\n“Here, I’ll show you how to use it. Let me see your foot.”“That’s a pretty intimate demand in the angel world. It usually takes dinner, some wine, and sparkling conversation for me to give up my feet.” “I knew from the start that your loyalty would get you killed. I just never thought it would be your loyalty to me that would do it.”“I never thought about it before, but I'm proud to be human. We're ever so flawed. We're frail, confused, violent, and we struggle with so many issues. But all in all, I'm proud to be a Daughter of Man.” “A little weird? That was freakin' Bizarroville.\"He pauses and looks back at me. \"Are you speaking English?” I enjoyed this book a lot and I can't wait to get my heads on the second one! I highly recommend you to read this if you are into paranormal angel/alien books, it's a good read!Also heard rumors about the movie!"}, {"userName": "karen", "userReviewDate": "Jan 04, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[image error]"}, {"userName": "Tatiana", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As seen on The ReadventurerWell, I guess I got schooled again. Clearly I can't hold on to this particular reading prejudice against self-published books any more, because here it is, a self-pub that is not equal in quality to similar books released by major publishers, but, in fact, better than probably 75% of those books. Angelfall is a competently-written and competently-edited novel.If you are a fan of UF and post-apocalyptic adventure stories like Blood Red Road and Under the Never Sky, there is hardly any doubt you will enjoy Angelfall. It is a dynamic, practically unputdownable, even though very familiar, story. A pair of beings - a human girl and a wingless angel in this case - ally to achieve their separate goals. They are reluctant and unnatural partners in Angelfall's world almost completely destroyed by angels. But, of course, they learn to respect and trust each other. I am not going to elaborate any further. You get the idea, I am sure.Everything I am fond of in novels of this sort is there: self-reliant, courageous heroine who loves her family and is ready to sacrifice everything for them - check; romance secondary to survival - check; action, gore and moderate violence - check; a unique, fresh and twisty mythology (Ee does something rather interesting with the angel lore here) - check. Some compare Angelfall to Daughter of Smoke and Bone, but I personally wouldn't go that far. These two books are completely different beasts that only have a word \"angel\" connecting them. Daughter of Smoke and Bone is a more literary, more complex and better written work, whereas Angelfall is a more commercial, easier to digest story, and I see nothing wrong with that. Give me more good genre fiction!There is only a couple of things that bothered me in this novel. First, I feel there had to be a tad more information about the angel-orchestrated apocalypse. You see, the attack happened about 2 months prior to the book's beginning, but the description of it is very murky, as if it happened centuries, not weeks before and nobody remembers the details anymore. I have only the vaguest idea of what exactly happened and how it unfolded. I wish this was addressed better in the novel. Actually, some info-dumping about the apocalypse in the beginning of the book, in the barest and slowest part of it, would have been quite appropriate.And again, connected to the same 2-months post-apocalypse timeline, the human civilization seems to have digressed too severely over this rather short time. Surely, considering that a huge percentage of human population has been wiped out, there is still enough canned food in ruined Wal-Marts to prevent people from doing some very atrocious things they do in this story for food. Plus, the main character's survival skills appear to have developed too quickly as well. Other than that, there is nothing to complain about, really. Angelfall is certainly a page-turner and it gets better and better as the story progresses. I am not surprised everyone who's read this novel is so excited about it and its sequel. Angelfall is a stellar entertainment. Now I only wish I had an opportunity to hold a hardcover of it in my hands. How and why this book was never published the traditional way is a mystery to me."}, {"userName": "Maria✦❋Steamy Reads Blog❋✦", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/44673856-maria-steamy-reads-blog", "userReview": "HOLY CRAP, BATMAN! :O➦An apocalypse - check! ✔➦A human heroine who can kick some serious ass - check ✔➦A brooding hot as fuck alien angel - check ✔➦A kidnapped little girl in need of saving - check ✔➦Forbidden love - check ✔Ok, so... angels are wrecking havoc on Earth and nobody fucking knows WHY. In fact I don't think the angels themselves know WHY.And then it dawns on me - they all are just hawt for some human pussy. Yep. At least that's my conclusion so far, because as of yet a lot of details are unclear. I need the sequel now! This was so packed with action that I couldn't stop reading. Men with wings, crazy flesh eating things, scorpion angels (dafuq?). Pass me that WEED, this shit is great!"}, {"userName": "shady boots | #20gayteen", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/4972138-shady-boots-20gayteen", "userReview": "A review of this is now posted on my blog as well. Feel free to check it out!_______AAAAAAAAAAARRRGHHH!!!!!!THIS. BOOK. IS. INCREDIBLE.OH MY GOD.I'm, like, shaking from the utter epicness and badassery that is this gem of a book. I mean, HOLY CRAP. A PERSON CAN ONLY TAKE SO MUCH AWESOMENESS. THIS IS OVERKILL.I'M SHAKING. LITERALLY. THE BOOK IS THAT GOOD.OH. MY. GOD.Okay. Whew.I need to lie down. ._.Several minutes/hours/whatevers later...Woo. Okay. *deep breath* So. Most of you people are probably like:But I just can't help it. Dx I mean, oh my God, you guys. This book masterpiece is...EVERYTHING I ever wanted in a YA book, all rolled into one. It pains me that there are a lot of books out there that are getting more hype than Angelfall, when this book would 110% beat them to a pulp with its epicness.Like, literally, this is the best PNR YA book I've ever read. I can honestly say that.For those of you who haven't gotten this book, please get it. For those of you who do have this book yet still hold off on reading it...READ IT!!!!!!!Okay. I'm done. ._."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "*buddy re-read 11/11/13 and it was just as good the second time around!*11/14/12 Soon to be a major motion picture! I think I can safely recommend this book to anyone who likes any of these genres or categories :Sci-Fi (post-apocalyptic world in ruin)Paranormal (angels and demons)Romance (okay, so there wasn't actually one yet, but there is the hint of something forbidden to come)Survival & Adventure storiesHorror, Gore and Macabre twistsYA books that DON'T read like a YA (no angst, no teen drama, age is irrelevant)Basically, Angelfall was all kinds of success. Well done, Ms. Ee.Right off the bat, this book had me when the action started immediately. I'm so sick of dystopia/post-apocalyptic books that are filled with wordy sentiments. It's the end of the world people, shit should be hitting the fan.It was awesome enough when Penryn and the angel were on the run out in the wilderness, fending for themselves...but then they ended up in San Francisco at a 1920's themed club? It's as if this author ransacked my brain to know what I'd want to read about. The last portion of the book lost me for a moment by taking a trip into the bizarre. Don't get me wrong, I was still hooked. Not once did this book become boring. I think I wish that I had been warned a bit first that the book was going to go from an action/paranormal/post-apocalyptic/budding romance (can I somehow combine these to make an entire new genre?) to a horror story taking place in a sexually charged nightclub. Because that's what we were dancing with in the last part. I'm not even complaining! There just might have been a moment where my brain started doing a brief reaction of Does Not Compute! Then I recovered and continued with the awesomeness of this book.If you're looking for something different from the standard YAPNR fare, and like a bit of grit and darkness as well, then do get yourself a copy of Angelfall."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "If you haven't read these books run to Netgalley. They have the first two up for grabs. 3-2-15I can not believe this book hasn't received more press. It is flipping amazing. One of the few books that I've read that creates a whole new approach to the end of the world scenario. Angel driven apocalypse- Who woulda thunk it? Angel books have never impressed me until I started this series. You have a strong female MC.A male MC that you well..you want to hump him. No shame.Supporting characters that aren't just lumps on the side. I sometimes feel like an old woman reading these young adult books but this one made me not give a crapola. Go read this! Then you will be begging (like me) for more."}, {"userName": "Angela", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/30035966-angela", "userReview": "Where other books like this have lacked *cough* Hush Hush *cough* Angefall prevailed. I knew this book was going to be good, but I kept putting it off until the series was complete and now that it is I can finally dive in. And oh did I dive, I read this whole book in one sitting.I loved what Susan did with this book. Angelfall is one of the best balanced books I’ve ever read. No one thing outweighs the other. The action, the romance, characters, and the underlying story all are evenly balanced. The biggest plus of this book was that it was different. I loved the idea of Angels being the bad guys. We all know it's one thing to have an amazing book idea like this, but it's a whole different thing when it comes to having it play out well on paper... Susan nailed it.Angelfall takes place six weeks after Angels have come to earth and started raining hell down on everything. Penryn is our leading lady and right away we get to see that she is what is holding her family together. Her, her sister, and mother are hiding out when they start to run out of supplies and realize their building will soon be raided by gangs and that they need to move. Only issue is that Penryn’s sister Paige is in a wheelchair and her mother is suffering from schizophrenia and insist on pushing around an old shopping cart. They decide to leave at night to avoid being seen by both the Angels and the street gangs. While running they stumble upon an Angel fight where Paige ends up kidnapped and Penryn takes in/hold hostage Raffe who is now a fallen Angel.As far as characters go both Raffe and Pen are super strong. Both are fighters with such strong personalities. Both of them are very determined characters for very different reasons. Both Pen and Raffe have moved up to my list of my favorite leads. Pen is so unbelievable real and Raffe has built a category all his own. Even the moments when things are so far from being a real life situations Pen's character makes them feel real. Raffe our leading male and fallen angel is so spot on. He was witty, sarcastic, and had perfect timing.Personally he was my favorite character, and it didn't hurt that he sounded like a total panty dropper.\n\"... But the truth is that we're all stumbling around in the dark. Sometimes we hit something terrible...\"\n\"...Sometimes, as we're stumbling along in the dark, we hit something good.\" \nSince this is written only from Pen's POV we get a lot more out of her character, but I was never not satisfied with Raffe. I liked how their stories come together, I liked how they interact with one another, and I love their forbidden love. I found myself getting really caught up in their relationship, more so than I normally would. As far as sub characters go we have her mother, her sister Paige, and the Twins. All were perfect. I loved how insane-o her mother is... Like the women is next lever crazy. Besides our two main characters she was probably my favorite,and the person I'm most looking forward to reading about in the next book. The other sub characters I liked were the twins, Tweedle Dee and Dum. They were the perfect sprinkled in characters. For characters that could have easily became too convenient I never felt their presence was forced. There are a few other subs I wanted to mention but decided to leave out for certain spoily reasons. The plot of this book is what sets this book apart from others in its genre and what made it a five star read. As I said above not one aspect overshadows another one. The setting is described to perfection. This new worlds details aren't ones you'll have to question. The action is so steady and perfectly spaced out. The romance isn’t so cheesy that you become lactos. The twist are ones you don’t seem coming, and are never pointless. The ending of this book had twist after twist and one after another I didn't see them coming... But that one twist that I really really didn't see coming, had my jaw dropping!!!!!! Susan Ee comes out of nowhere and punched me in the face!!!\n\n\nI wish I could really put into words how much this series has won me over. This is a book that had it all and then some. I've fallen and I don't wanna get up from the world Susan has built. Bring on World After. READ THIS REVIEW AND OTHER OVER ON OUR BLOG:http://southernbredsouthernread.blogs...http://southernbredsouthernread.blogs...http://southernbredsouthernread.blogs...http://southernbredsouthernread.blogs..."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Dec 14, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[This kind of reminds me of the Red Rising debacle *shudders* (hide spoiler)]"}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "“I am not afraid of you, your kind, or your god.”\n\nI actually really enjoyed this more than I expected to. I'm not a fan at all of books that have to do with Angels and/or Demons. In fact, the only other book I read that had to do with Angels was \nDaughter of Smoke and Bone by Laini Taylor\n and contrary to popular opinion, I didn't like it too much. Therefore, I was a bit wary about reading another book that involved Angels. But I had high hopes that Angelfall would change my opinion and I'm glad it \ndidn't disappoint.\nOne thing that really surprised me about Angelfall was how DARK and GRAPHIC some of these scenes got. I did not expect the gore and horrific imagery at all in that extent in a young adult novel. Even some scenes made me think, \n\"Woah. This is WAY too much.\"\n Susan Ee did a great job at providing excellent details because I was definitely left cringing and creeped out after some of these scenes.On the other hand though, I loved the characters! Penryn was such a badass heroine. I loved the fact that she's literally trained in various forms of martial arts and self-defense. She's tough and isn't afraid to get down and \nkick ass,\n boy or girl!And my baby RAFFE. <3 My precious cupcake. He's officially on my list of book boyfriends. That is all. And the tension between Penryn and Raffe... OMG. I was literally visualizing myself nudging these two together. I can't wait to see how their relationship develops in the later books.I can already tell that this is definitely one of those series that gets better with each book! World After, here I come!"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "Sale Alert January Book Deal for $0.99 on Amazon. I've read this book 3 times and loved it. Books 2 (totally awesome) and 3 (okay ending) are also $1.99 and $0.99 this month. So excited to read this AGAIN on April 13, 2015!!!Buddy Reading with SO Many people oOSarahOo, Cathryn, Danae, Ashley, Angela, Tanya, Catherine, Sarah, Navessa, Brigid, Shandra, Ya, Andrea, Mindy, Maria, Annette, Kristen, Lea, Sara, Athena (Shardbearer), Brandi, Nicholas, Carole, Michelle, Tandie, Jenny, Liz, Arie, Allison, Amanda, Jessica, Jennavier, Shelly, Cathy, Gavin, Armina, Maya, and Jamie I think I got everyone.We will be meeting at \nBuddies Books and Baubles\n send me a PM if you need an invite to the group.Okay so on my 3rd time through I saw a few small issues but I still love the dark originality of the story and Penryn so even though it is probably only really a 4 star read I'll keep the 5 stars up there.I'm Finished and another 5 star read for me.\n“Asleep, he looks like a bleeding Prince Charming chained in the dungeon. When I was little, I always thought I’d be Cinderella, but I guess this makes me the wicked witch.But then again, Cinderella didn’t live in a post-apocalyptic world invaded by avenging angels.”\nAfter reading this again I can honestly say it was my favorite YA read of 2013. If you haven’t read this yet please grab yourself a copy and get to it, last time I checked it was like $3.99 on Kindle and well worth it. There is really something for everyone.•\tPost Apoplectic World•\tAngels and Demons•\tCrazy Mom ,like literally crazy (or is she?)•\tUnlikely Alliance•\tForbidden Romance•\tQuest to recover a kidnapped sister•\tFlashback to the 1920s club scene Gatsby style•\tFrankenstein Monsters of creepiness•\tA rebellion to fight back •\tPolitical IntrigueHonestly this is Fantasy, Sci-Fi, Romance, Dystopia, Mystery and just plain fun. It is so fast paced there is no time to get bored and I struggled to limit myself to just 25% a day this time around to savor the story before World After comes out. I really wanted to devour it in one day again.\n“We now play a permanent game of I-am-crazier-and-scarier-than-you. And in that game, my mother is our secret weapon.”\nI forgot how much I really enjoyed the craziness that was Penryn’s mother. It still amazes me how well that character is written and I can’t wait to find out how much she has been involved with the war between Heaven and Hell. Penryn’s mom is most interesting mother character I’ve ever read about.I adored the slow burn and build of subtle romance between Penryn and Raffe. Both are so focused on other events that the main concern isn’t how hot the other is and an instant spark. There is a gradual respect and kinship that forms that could become more than that later. But there is definitely some heat there even if both of them have other things to worry about at the time.All I can say is READ THIS READ THIS READ THISOriginal review May, 2013A great surprise!!! Penryn has some interesting people in her life; an agnostic Angel, a crippled sister, schizophrenic mother, rebellion leader Obi (as in Obi Wan) and Tweedledee and Tweedledum. Let’s just say that she is living in interesting times.Angels have waged war on the humans taking out most major cities. Humans are on the brink of extinction violence and horrors around every corner. Penryn tries to provide for her mother and sister by scavenging food and hiding in abandoned homes. They have to be careful of the other humans that are doing the same and the gangs that roam the streets. Penryn, all odds against her, has not lost her humanity and tries to help Raffe, an angel under attack by his own kind. She is able to help him but at the loss of her sister Paige who is taken by the attacking angels. She helps Raffe recover from the loss of his wings and hopes that he will help her find her sister.I couldn’t put this down once I started. Some authors use a lot of extra words to get the imagery and the plot across but this was so streamlined that there were no lulls in the story. I found that the plot was leaping and bounding along and I was running along with it to see where we would end up. The concept of the Angels and their culture was so interesting I actually giggled when the term Angel Politics was used since it seemed so foreign to me. Penryn was such an interesting character growing up with a crazy mother has made her more able to deal with the craziness and destruction around her. The way her mom popped in and out of the story was so fascinating; nothing says love like a pentagram on a dead body. So many things in this story were eerie and sinister but there is always a sense of hope as well. I grew to absolutely love the dynamic between Penryn and Raffe along with the forbidden romance that might be forming there.I was wrapped up in this book the entire time, if you like a good adventure and are not faint of heart because some of the horrors in this book were devastatingly cruel it is a great read. I cannot wait to see where the author takes us in the next installment of Penryn & the End of Days"}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Jul 08, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "A Badass Hidden Gem...http://badassbookreviews.com/badass-h...\nThe. Perfect. Escape!\nA dark, gritty, gory, post-apocalyptic world is so beautifully represented by the author in Angelfall. Beautiful you say? Yes, beautiful! When you read a book, and in your head you can see the world as vivid as if you were looking outside your window, that is beautiful. I wanted to take the world building in this book and yell to some of the YA authors out there and say, “See, this is how you do it”. Nevertheless, who am I to judge? I suck at writing.So, I’m sitting in this post-apocalyptic world and it is has been overtaken by angels. WTF? Angels? Yes, really, angels. Not the sweet, cute boy angels we know from other YA books but serious, sword wielding, destroy the human race, type angels. And these angels, they aren’t even fallen!Ok, so to survive in this world, you need to have some serious skills. You can’t just have the world you know blow up in front of you and know how to survive. Which humans survive in this world? Maybe those with military skills? Maybe those with karate skills? Maybe a young girl of 17 having a homicidal schizophrenic mother; who in an episode of sanity, tells you to do whatever it takes to protect yourself from her moments of paranoia. That’s Penryn.Penryn is prepared for this new world because she’s been protecting her paralyzed sister and herself from their mom’s dangerous episodes of paranoia.The author did not trivialize the mom’s mental illness in any way, shape or form. It was heartbreaking and was portrayed so realistically. So, angels come along and destroy Penryn’s world so she takes her learned survival skills and transfers them to this post-apocalyptic world she now knows.The problem is Penryn can’t do it all. An angel kidnaps Paige in a moment of nasty revenge. To save Paige, Penryn saves another angel in hopes he will guide her to where the angels are keeping Paige.Raffe is the injured angel that Penryn saves. What Penryn doesn’t know is she didn’t just save a “normal” angel. There is so much more to Raffe besides his severed wings, and his cocky attitude. The journey Penryn takes with Raffe to save his sister was action packed, heart wrenching, sad, and even humorous at times. The growth of the relationship between Penryn and Raffe was slow, but perfectly paced and believable.Some of the dialogue between Raffe and Penryn killed me. I’m not a romantic at heart but when Raffe is trying to push Penryn away, I felt like my heart was breaking. I was wondering if somehow, I turned into a 13 year old with my first crush. There is hardly any romance in this book, in fact, I’d say the only romance is the possibility of romance, and how two characters learn to not only live with each other, but live for each other.Here is the thing; I go from not writing a review, to not shutting up. Therefore, to wrap up this review, I’m going to tell you what I didn’t like…Towards the end of the book, some of the characters seemed a bit science-fiction-ey (totally made up word). If the story wasn’t so strong, I’d even cringe a bit. However, I didn’t even give it a 2nd thought until I sat here and wrote the review. I’m just trying to anticipate what others might think when reading the book.I believe this book is still 2.99! 2.99 you all! I spent 2.99 on one of those fancy Starbuck drinks this morning (and I don’t even touch coffee). Go buy this book! Please, because I really want the author to write more and to do this, we need to give her our support!"}, {"userName": "Ariana", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/3564852-ariana", "userReview": "Dear publishers,Why do you publish so many bad books (I won't even bother to mention them, you know there are plenty), while wonderful stories like this one have to be self-published for us to be able to enjoy them?All I have to say is that this book puts some of you at shame.I wonder if this book would have been better if edited, or if it would have been turned into a boring commercial story as many others out there.I usually don't pick up many angel-books to read, as I find then not quite original, mostly repetitive and usually plain boring with the good vs. bad battle where, how could it be any different, the good shinny angels usually get to easily win. (This is not the case)Of course, if you search through my reviews you will also find a few interesting (or at least entertaining) angel-books too.Now, back to Angelfall I'll start with this statement/quote:\n“Angels are violent creatures.”“So I noticed. I used to think they were all sweet and kind.”“Why would you think that? Even in your Bible, we’re harbingers of doom, willing and able to destroy entire cities. Just because we sometimes warned one or two of you beforehand doesn’t make us altruistic.”\nSo maybe it is just that we (as in 'me and probably the author') think on some aspects somehow alike, maybe it is because I always thought that religion is the most manipulative weapon of them all and I finally stumbled upon a book that showed it right. Maybe it is because I was sick of all the fluffy reads with the good shinny angels and I needed something  different, or realistic, or creepy in a complete awesome way; or maybe it is just the fact that the story was so full of surprises that made me like it even more.The fact is that I really loved every bit of it, and I have to give a big thanks to all my GoodReads book friends, because without them I probably wouldn't have found about it. So thanks you all, you are the best!There were so many things I liked about this story and the characters, that made it hard for me to point to it and say: \"hey, this is the reason I liked it this much!\"The dynamic between the main characters was so damn good (in my opinion). There is no love at first sight, there are lots of action moments, so many verbal fights, and so much mystery to add up to beauty of it all.I liked how Penryn was constantly helping Raffe saving his skin, or wings, or his life for a matter of fact, and I liked how he was at first grateful, and by the ending he started to care for her (keep in mind that i didn't use the word 'love'). In a world as cruel as that one, it felt right not to have a big romance in the middle of it all. Their relationship was more than that - it was about gaining each-other's trust, and helping out each other, and fighting together but for very different reasons. It was more about survival and less about emotions, but what can I say, in this way their story got strait to my heart.Reading this book felt more like tasting a drink. It made my head spin, and left me wanting for more.It didn't give all away; and there are so many questions about Penryn's mother (who didn't seem so crazy in my opinion, and I am sure she will have a lot to do with what comes next), about Penryn's ability to use an angle sword, about her sister and Raffe that seem to share a bit of the same destiny, about the war between the angels and the humans - it's only the beginning, and I have so many scenarios in my head, I can't wait to see which one is THE ONE.All in one, a great book and an amazing way to start the reading year.I only have one thing to tell you: pick it up and read it. I bet you will like it a lot!And, BTW, I hate how every book in the world is compared to The Hunger Games.. get a grip people, there are nothing alike - and as a proof, there's no guy waiting for Penryn at home, LOL :p\nThis review can also be found at ReadingAfterMidnight.com____________________________________________Blog (EN) | Facebook | Twitter | Tumblr | Bloglovin' | Blog (RO)____________________________________________"}, {"userName": "Sara➽ (Ink Is My Sword)", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/28146945-sara-ink-is-my-sword", "userReview": "[okay maybe at the end, it was pretty obvious their feelings for each other, but hey nobody needs to know that until they read it (hide spoiler)]"}, {"userName": "Helen 2.0", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/39575951-helen-2-0", "userReview": "5 snowy white-winged stars!Big reasons why I loved Angelfall:Penryn is a real teenager. She grieves her loss of hygiene, she misses her throws, she gets into catfights with other girls, she sucks at seduction, she does what needs to be done to stay safe with her family (morality be damned). Penryn's character was realistic, relatable, and well-built. There was not a single point in the book where I was frustrated with her or confused about her motivations.The mystery. Susan Ee thought up a whole post-apocalyptic world involving heaven and hell, characters with complicated pasts, threats previously unheard of, and so much more. Then she sat back and gave us readers only little glimpses of her creation. Angelfall didn't need a cliffhanger to have me panting for the second book as soon as I put down the first. I just have to know more about everything the author left unsaid.Raffe. He's an agnostic angel. What more could I possibly ask for?Slow-burning romance, for once! Raffe is stoic and Penryn is a healthy mix of pride and wariness. Both parties take time to reconcile themselves with growing feelings for the other. Then there's the barrier of species and that whole thing where Raffe's race is trying to drive Penryn's race to extinction. Whatever. I have faith that Raffe and Penryn can overcome the obstacles in time. Yet another reasons I must have book 2 now!Little Reasons why I loved Angelfall:Winged Man Candy. Lots of it. Enough said.Dee and Dum. Creepy yet brilliant identical twins, who are woke enough to allude to Lewis Carroll. Just perfect.The realism. There is no sugarcoating in this dystopia. Be prepared for corpses, child mutilation, human desperation, the works.Evil angels! I love the evil angels trope, can't get enough of it. Angelfall reminded me of the tv shows Dominion and Supernatural, as well as Nalini Singh's Guild Hunter Series (Angels' Blood).Thanks to the people who recommended this to me, Mikaela, Nicole, probably others. Great choice."}, {"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "I'm hemming and hawing to myself in regards to how I want to rate this thing.On one hand, it was super entertaining and I really liked the main character, Penryn. I also really liked this new take on the whole dystopian/apocalyptic craze - angels taking over the world? Nice.On the other hand, however, I felt like the world building could have been, well, better. I never really felt like I had a true feel for the state of the world and how the Angels figured into all of that. Also, I typically prefer a little more romance in my EVERYTHING; however, this book wasn't about that and I didn't expect it, so that didn't factor into my rating. Regardless, I could have gone for some. Extra points for crazy, gory what the fuckery, though. Things that make you go ewwwwww. Always a good time in my book. Long story short, If I had to pay the required $4.35 for the next book in this series, I would probably call it quits here; but being that I get it \"free\" via KU, imma put it on the back burner. Find me at:"}, {"userName": "V. PARENTAL GUIDANCE ALERT:  A Court of Wings and Ruin is NEW ADULT/EROTICA but Goodreads editors won't tell you", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/31006810-v-parental-guidance-alert-a-court-of-wings-and-ruin-is-new-adult-erot", "userReview": "[ there's a mention of married women so desperate to get food that they try to get work as prostitutes for the angels. Nothing too graphic, but it's there. The crazyness of the mother seems to imply some child abuse. (hide spoiler)]"}, {"userName": "Christine Riccio", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "Loved this book! So excited for the sequel! Here's my booktalk with my full review: http://youtu.be/8yfCvwn2m0M"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Apr 27, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "It's an interesting twist to the angel genre. Angelfall isn't the best book about angels that I've read, but it has restored my faith (har har) in the genre. The first half of the book probably garners a 4-4.5 stars, the second half a 2, so my rating is an average. In some ways, it's frustrating, because I enjoyed the first part of the book so much, the ending, as action-packed as it was, felt out of place and contrived.I've got to give props to this book for:1. Creativity. Evil, destructive angels out to destroy the earth? Sign me up. Wait a minute, shouldn't they be called demons then? What's the difference between evil angels and demons anyway? I'll let the author have her prerogative on that one.2. Kick-ass heroine. Penryn ranks up there on my list of favorite YA heroine with Julie Kagawa's Alison Sekemoto. Both heroines can and do take care of themselves and their loved ones. Both can literally kick some serious ass, Alison through her experience living on her own, Penryn through her self-defense classes, and a lifetime of dealing with a paranoid schizophrenic mom has left her a little more prepped than most when expecting the unexpected. Did I cheer when she kicked Boden's ass? You bet I did.3. Raphael. An angel who's neither an asshole nor a stalker? Get out of here. And with an actual angel name? (Patch? *cough cough*, Patch Adams, more like). Yes, please.I can't help but think that the book could have had so much more potential had it gone off a different direction. I really did not enjoy the second half nor the ending at all. I wish they had stuck to the plot of rescuing Paige, but without the whole angels-keeping-a-harem-in-a-club and human centipede children part. The book totally lost me when it devolved into horror-movie-cum-science-fiction."}, {"userName": "Catie", "userReviewDate": "Dec 26, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "[And what was up with that whole fighting/betting system? How does that even work? If that’s the main entertainment, it seems like it would encourage even more fights. And why did no one recognize Raffe in the aerie when he first arrived, with his own wings no less, but then suddenly everyone was recognizing him when he left, wearing bat wings? And Penryn…seriously…you do know that your mom isn’t really schizophrenic, right? How can you see at least three examples of real demons with your own eyes but still continue to insist that your mom is crazy? Come on. (hide spoiler)]"}, {"userName": "Regan", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "I liked this book WAY more then I thought I would.Action packed from page one, with an extremely dark feel. Plus Raffie."}], "description": "It's been six weeks since angels of the apocalypse descended to demolish the modern world. Street gangs rule the day while fear and superstition rule the night. When warrior angels fly away with a helpless little girl, her seventeen-year-old sister Penryn will do anything to get her back.Anything, including making a deal with an enemy angel.Raffe is a warrior who lies broken and wingless on the street. After eons of fighting his own battles, he finds himself being rescued from a desperate situation by a half-starved teenage girl.Traveling through a dark and twisted Northern California, they have only each other to rely on for survival. Together, they journey toward the angels' stronghold in San Francisco where she'll risk everything to rescue her sister and he'll put himself at the mercy of his greatest enemies for the chance to be made whole again.", "title": "Angelfall\n      \n          (Penryn & the End of Days #1)", "url": "https://www.goodreads.com/book/show/15863832-angelfall", "average": 4.18, "cover": "https://images.gr-assets.com/books/1464206558l/15863832.jpg", "reviews": 14453, "authors": [{"url": "https://www.goodreads.com/author/show/4890182.Susan_Ee", "name": "Susan Ee"}], "type": ["Fantasy", "Young Adult", "Paranormal", "Science Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/15863832-angelfall", "http://www.goodreads.com/book/show/11500217-angelfall", "http://www.goodreads.com/book/show/17789310-angelfall", "http://www.goodreads.com/book/show/11768487-angelfall", "http://www.goodreads.com/book/show/13226194-angelfall", "http://www.goodreads.com/book/show/17849112-world-after", "http://www.goodreads.com/book/show/18500665-end-of-days", "http://www.goodreads.com/book/show/27274908-the-angelfall-trilogy", "http://www.goodreads.com/book/show/21761740-one-hundred-steps", "http://www.goodreads.com/book/show/40039506-mundo-del-ma-ana-el-ngeles-ca-dos-2", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}