{"ratings": 489, "userreviews": [{"userName": "Bobbi", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/1379214-bobbi", "userReview": "A bit slow going at first, but the author more than made up for that, with finely drawn characters and an interesting plot."}, {"userName": "S. Lynham", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/10573357-s-lynham", "userReview": "I liked this book but sometimes it felt like there was just too much \"filler\"...parts of the story that meandered off to nowhere and just never really returned; portions of the story that were veiled until it really didn't matter anymore as you had already figured out what had really happened and the character was no longer important to the story line. Perhaps this was intended as the story was written from the point of view of an 11 year old boy but I have read other books with a young storyteller that didn't seem so jerky and/or unexplainable. At times, you feel like a waterbug, skittering over the best part of the story that, in places, seems deeply submerged. Perhaps I wanted more background on why this area seemed to be such a backwater when it came to race relations. Perhaps I needed a better sense of the years when the story happened or even how the major characters ended up linked to each other before the book was almost over. Given that this was a story of realisation, perhaps the author intended to make the nuts and bolts hazy and to make you wonder where this was all going.I liked the actual \"story\" I was being told once I could see clearly (and this happened long before the storyteller realised the events) and it was obvious that the setting could have been anywhere as the race relations card was of no real importance whatsoever, it just contributed to the \"filler\".This is a first novel which may explain some of the rough edges but I note he has written nothing else since this was published in 2006."}, {"userName": "Sandy", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/5913149-sandy", "userReview": "Nice read. I liked the way Charles added lots of dimension to this book. We had the main story in the book which dealt with Charlie and his parents situation and then we had another deep issue of Lacy and the racial situation for Charlie and then we had Hollis which played a sinister role for Charlie. Charlie perfect little word was totally turned upside down for an eleven-year old for which he does not remember parts of which adds the drama- great story line. There were parts in the story that I was crying for Charlie, parts that had me cheering for him and later I was thinking \"what in the world are you doing Charlie!\" He sure did a lot of growing up and learned a lot about the world and himself and what he was capable (or anyone) is capable of doing. Not so sure about what they did to help Charlie was the best approach but they probably did the best they thought they could under their situation. Very touching read and a fast read"}, {"userName": "Maria V. Snyder", "userReviewDate": "May 07, 2010", "userURL": "http://www.goodreads.com/user/show/1629797-maria-v-snyder", "userReview": "My latest audio book so this will take a while to listen to as I only listen on long car drives :)I really liked this book - it's set in the mid-1960s in West Virginia and gives you a good idea of what it was like back then, living in a small rural town. There's a killing and a trail, but the narrator is 11 years old so you don't see the whole picture which really helps add to the suspense. This isn't a kids book even with the young protagonist. The reader did an excellent job with all the voices."}, {"userName": "John Agostino", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/6860359-john-agostino", "userReview": "This debut novel by Charles Davis caught me off guard at first. As an author, I found myself cringing at the misuse of grammar until I realized that Mr. Davis was utilizing the voice and dialect of the region of West Virginia where the story was set.Once I relaxed and just went with the story flow, I really enjoyed this book. It even brought a tear to my eyes near the end for the unlikeliest of reasons. See if it happens to you!"}, {"userName": "Alfredo Jara", "userReviewDate": "Apr 22, 2011", "userURL": "http://www.goodreads.com/user/show/5304497-alfredo-jara", "userReview": "I believe this book is a real good book. I recomend people to read this book. This book is about a kid who grew up in a very confused life after the death of his father. They put his mom on trial because they believe she killed him. But the truth is he was the one who killed his father but he doesn't remember because his dad hit him so hard in the head that caused him to forget about everything that day."}, {"userName": "Connie", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/36362539-connie", "userReview": "This was a pretty good book about a little boy having to make sense of things going on around him while he has all the people he knows pulling at him from all sides. All of his friends have left him alone except for one very unlikely one."}, {"userName": "Barb", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/2222134-barb", "userReview": "Really enjoyed this one even though I figured out a major plot point very early on. Told from the perspective of the boy, he is so endearing. Recommended."}, {"userName": "Putu Juniawan", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/70237480-putu-juniawan", "userReview": "I love this kind of book the story just flowing and the plot is good too, i can guess what have in the end."}, {"userName": "Pamela", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Like a match struck in a cold dark room, this southern-noir coming of age story instantly captured my attention: “People said [Hollis] was crazy. He’d come down from Angel’s Rest a couple times a week and folks cleared the sidewalks when he past.” And it was soon made clear Hollis wasn't the only person in the little Virginia mountain town of questionable character with deathly secrets. Charlie’s father had been murdered, his mother spiraling in depression, and it’s 1967, so color and good-old-boy ‘economics’ divides the town. Then ever so subtly as the mystery unfolds and the suspense heightens, the match flame turns into a raging fire of fear, hate, and injustice. Only truth seekers and those willing to forgive can find hope and peace in the ashes and learn to start anew – which is a tall order for an adolescent boy. “Angel’s Rest,” despite the heaviness of topic(s), it's a heartfelt enjoyable novel. Being narrated by Charlie, prose and dialogue are atmospheric authentic to that of an eleven-year-old boy, and the delivery follows suit in simplicity. The epilogue was a bit too explicitly tidy per my tastes, but some people like their loose ends tied up with a perfunctory bow. All in all, a wonderful story. Recommended reading for fans of southern dramas or mysteries with a slightly edgy noir faire."}, {"userName": "Beverly", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/10196629-beverly", "userReview": "For some reason I love stories that take place in small towns up in the mountains. This story, which starts in Virginia's Allegheny Mountains is no exception. Charlie York is an 11 year old boy who loves the outdoors. He and his friends form a small scout troop and spend lots of time exploring Angel's Peak, which rises above their small town. The one barrier is the scary Korean War veteran, Hollis Thrasher, who lives on Angel's Peak. He is reclusive and despite their trying to steer clear of him, the boys encounter him more than once. One day, his mother is arrested for killing his father and Charlie is left in the care of Lacy Albert Coe, who is an old black man who not only cares for him but tells Charlie stories that he hopes will help the boy figure out who to be and how to live his life--to sing his own song. As the story continues, we learn just exactly what happened in the town's past that bound all of these characters together. This is a beautifully written book and thank you to the Shelfari member who recommended it!"}, {"userName": "Anne", "userReviewDate": "Oct 25, 2007", "userURL": "http://www.goodreads.com/user/show/546484-anne", "userReview": "This debut novel contains themes of loss, grief, racial prejudice and powerful love. Set in the late 60s in Virginia, USA - the story revolves around 11 year old Charlie York. His life has fallen apart after the death of his father. His father was shot dead in the family home. Charlie was present at the time but cannot remember the details - his mother is arrested for the murder.This is a convincing picture of Charlie's love for both of his parents and how he struggles to make sense of what is happening to his family. When Charlie's mother is arrested and held in the local jail, he is cared for by Lacy - a black man who was a friend of Charlie's father, yet has been the victim of racial hate in the town.The author is very convincing in showing the rollercoaster of emotions that Charlie has to deal with. Charlie loves both of his parents and his grandparents - yet his grandfather is a racist and a bigot and this confuses the young Charlie.A really good story with strong and likeable characters."}, {"userName": "Alex", "userReviewDate": "Mar 15, 2008", "userURL": "http://www.goodreads.com/user/show/49732-alex", "userReview": "This book is an easy read in every sense of the word. The prose is simple, the accents are easy (when they aren't flat-out wrong), and I'd figured out the entire plot by the third paragraph (no surprises at all). Despite all these short-comings I almost gave this book five stars and recommended it anyway. Despite knowing where I was going- for the most part I enjoyed the ride. What dragged me back down to three stars (which is 'on the fence' in my rating system) - was the very annoying repetition of description throughout the book. Simple is fine, but the author crossed a line and began to treat the reader like a simpleton in places. I guess the editors know their readers though, and even with the glaring flaws this strikes me as a happy surprise pick-up in a truckstop swap or backpackers' book exchange box... or even an impulse buy at Walmart. This reads like a poor man's John Irving - and that isn't meant as an insult."}, {"userName": "Sally Whitehead", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/5874718-sally-whitehead", "userReview": "What a wonderful book. For sure, it's not the most brilliantly written book ever, and elements of the plot are somewhat predictable, but it is still wholeheartedly enjoyable and incredibly readable. Comparisons to \"To Kill a Mockingbird\" are rather over generous, but many of the themes are similar.The characterisation of the wise old black man, Lacy, is simply yet beautifully crafted and his relationship with our narrator, the troubled and lonely eleven year old Charlie, is really quite moving.There is a slight jolt for the reader around the 200 page mark when the setting and focal characters rather abruptly take a different direction and as a result the pace, style and \"feel\" of the novel alter. However, in conclusion this actually adds to the reader's empathy with young Charlie as he too begins to adjust and \"start over\".Fantastic small town American setting with lovely characters, a simple yet engaging plot and timeless themes. A \"Good Read\" indeed!"}, {"userName": "Robin", "userReviewDate": "Apr 04, 2008", "userURL": "http://www.goodreads.com/user/show/258668-robin", "userReview": "This was a goodread. It wasn't so much that it was gripping, but it had many twists and turns in it. The father (town mayor, loved by all) was killed at home. After investigation, the mother was arrested. It was in the south in the 60's. The mother had a older black friend take care of their 11 year old bay until her trial. The grandfather tries to get custody of Charlie. This was at a time of much social unrest. Charlie's mother was tried, and found guilty. Her friend from high-school (a recluse) breaks her out of jail before they can take her to prison. From here, there are MANY twists and turns. Though this is a rather quickread, it is not at all pridictable, nor to believeable in our modern day life. Life has changed so much in just 45 years or so..."}, {"userName": "Alicia", "userReviewDate": "Sep 09, 2007", "userURL": "http://www.goodreads.com/user/show/255516-alicia", "userReview": "This is the story of a young man trying to make sense of the murder of his father, supposedly by his mother. Up until that point life had been more or less idyllic for Charlie York. A loving mother, a respected father who adores him and although not popular, Charlie has a few good friends he can count on. All that changes after his mother is arrested. Left in the care of an elderly black man in a racist white town, he is tormented by classmates and hounded by adults. After Mr. Lacy is taken out, stripped down and forced to walk back to their house in freezing weather things go from bad to worse. This was a beautifully written saga of small town Southern life and the coming of age of a boy facing difficult choices."}, {"userName": "Jenny", "userReviewDate": "Oct 31, 2012", "userURL": "http://www.goodreads.com/user/show/859860-jenny", "userReview": "I absolutely loved this book. I think an author has to be really careful in their choice to use incorrect grammar in their writing even if they are trying to convey a certain tone and setting. In this book, it worked and didn't feel forced or contrived. The author's writing style was simple, easy, and enjoyable.I loved the story of an 11-year-old boy who is confused and goes through many difficult experiences while his mother is on trial for his father's death. I absolutely loved Lacy; he was such an example of humility, bravery, love, and patience. Hollis was also a really interesting character to me. Though the story was fairly predictable, it was well told and addressed themes of love, grief, racial prejudice, and truth."}, {"userName": "Mary", "userReviewDate": "Feb 16, 2009", "userURL": "http://www.goodreads.com/user/show/1164850-mary", "userReview": "Eleven year old Charlie lives in the mountains of Virginia in the late sixties and his life has changed dramatically since his father was killed and his mother has been put on trial for murder. Charlie was there when his father was shot, but he simply cannot remember what happened. While his mother awaits her trial in jail, Charlie lives with an old black man whom his father had befriended when Charlie was just a baby. As one might expect, this living arrangement causes some consternation for the folks in this small southern town (since Charlie's family is white). This story is at its best when Charlie and Lacy (the old man) are interacting. It becomes somewhat unrealistic and romanticized towards the end. A quick, OK read."}, {"userName": "Dimitra", "userReviewDate": "Oct 19, 2010", "userURL": "http://www.goodreads.com/user/show/2527068-dimitra", "userReview": "This is a story about life, death, prejudice, friendship and love told through the eyes of eleven-year-old Charlie. His mother is on trial for the murder of his father, and Charlie is left in the care of a wise old black man who knows more than he cares to tell about the incident. It is about families and the secrets that exist within every family...it is a moving story as this child tries to comprehend his small world and the changes that are occurring ... I figured out the \"secret\" before the author let Charlie in on it but that did not detract from the beauty of this book...I found that I cared about these characters...they felt real and I was brought to tears at times!"}, {"userName": "JoAnne Pulcino", "userReviewDate": "Apr 05, 2011", "userURL": "http://www.goodreads.com/user/show/5096613-joanne-pulcino", "userReview": "In his debut novel, Charles Davis weaves a beautiful tale of life, death, prejudice, friendship and love told through the eyes of eleven-year-old Charlie. His mother is on trial for the murder of his father, and Charlie is left in the care of a wise old black man who knows more than he cares to tell about the incident. As Charlie tries to cope with his life tumbling down around him, rumors begin about the reclusive war veteran who may be involved, and racial incidents occur against Charlie's caretaker. It is up to Charlie to try and figure out what happened that day and why he can't remember."}, {"userName": "Mindy Miller", "userReviewDate": "Oct 26, 2013", "userURL": "http://www.goodreads.com/user/show/5607439-mindy-miller", "userReview": "4.5 stars. Great writing. Good at getting into kids' heads. The main character, a little boy, was probably a little too astute for his age, but this was a heart-wrenching and, I think, fairly realistic portrayal of a damaged family because of a marriage for poor reasons and lack of fidelity. Sickening, at times, but very honest. Nothing graphic, which I appreciated. I do wish the ending hadn't hinted at the idea that the infidelity hadn't been wrong, despite the pain it caused. Other than that,I loved this book. It was beautiful yet tragic."}, {"userName": "Stacey", "userReviewDate": "Nov 16, 2010", "userURL": "http://www.goodreads.com/user/show/4549378-stacey", "userReview": "This book was very gripping, and although I could figure out the direction the story was going before too long, it was still a very good book. Mr. Davis wrote in such a realistic fashion that I had to go back to the acknowledgments at the beginning to verify that the family members mentioned in the book (especially at the end) really did not exist and that the story truly was fictional.Some may say the storyline is a common one, but as a writer myself, I find there are only so many storylines out there, but it's how you tell the story that sets you apart."}, {"userName": "Maggie", "userReviewDate": "Nov 12, 2008", "userURL": "http://www.goodreads.com/user/show/1702135-maggie", "userReview": "This book is wonderful! It is for teens/pre-teens, so it is a very quick read. It is a tear jerker.I finished this book on the way back to Austin from houston, while Jim was driving. I was crying so hard that he finally said, \"I think you should quit reading that book.\" I personally like books that evoke a lot of emotion. It's not completely depressing. It is very uplifting while it brings up some tough issues."}, {"userName": "SouthWestZippy", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/39124031-southwestzippy", "userReview": "I could not put this book down. Set in the late 1960's in the Virginia's Allegheny Mountains at the foot of an endless peak called Angel's Rest. Charlie York age eleven lives with his Mom and Dad until one day his life takes a ugly turn by the death of his Father. His Mother is put on trial and he is put into the care of Lacy Coe. Charles Davis pulls you in on the first page and does not let you go until the last page. Story telling is simple and story captivating. Highly recommend."}, {"userName": "Susan", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/3767267-susan", "userReview": "This story takes place in the moutains of Virginia and is told through the eyes of 11 year old Charlie who is traumatized by his fathers death and the mystery surrounding it. The year is 1967 and while his mother is on trial for murder, Charlie stays with Lacy, a kind and wise old man. As the story unfolds, secrets and past history unfold. I did manage to figure out the twofold mystery early on, but still a great read!"}, {"userName": "Emily", "userReviewDate": "Sep 04, 2007", "userURL": "http://www.goodreads.com/user/show/320591-emily", "userReview": "I absolutely loved this book. Not only was it a mystery but it was a coming of age story. Charlie York is an endearing character whose personal growth and inner conflict are developed wonderfully. Usually I can figure out the \"twist\" in a mystery but this one I most certainly did not, and as a mother i am a little embarassed to admit that. This book won't let you put it down until the very end and when that time comes you won't want to."}, {"userName": "Victoria Berkey", "userReviewDate": "Feb 14, 2008", "userURL": "http://www.goodreads.com/user/show/847106-victoria-berkey", "userReview": "I just finished it last night. Easy read, about a young boy in a small southern town back in the 60's. His father was \"accidentally\" shot and killed and it's the story of this young boys struggle to deal with the death of his father, the trial of his mother and racism of the old black man left to care for him."}, {"userName": "Calina Benassa", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/52974236-calina-benassa", "userReview": "There were definitely a lot of loose ends throughout the book. The initial idea of Charlie's story was a good one, but the ending was just too abstract and made no sense. Reading from a child's perspective was interesting, but there were too many unimportant patches of rambling by the author to keep me invested in the original story. Honestly, I didn't really like this book."}, {"userName": "Audrey Montague", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/15093747-audrey-montague", "userReview": "excellent read. I could really relate to the characers and their lives. this story has so many underlying themes...grief,loss, maturity, racism, and much more. the ending is such as leaves you thinking of those you met within the pages, and missing them when you read the last sentence. thoroughly enjoyed this emotional, thought provoking book."}, {"userName": "Karla ", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/1884221-karla", "userReview": "Read this for book group, probably would not have picked it up otherwise. At book group we decided it could very well have been a young adult novel. It's about a boy whose mother is arrested for murdering his father, an event the boy apparently witnessed but cannot remember clearly. There is also a big dose of small town evil thrown in."}], "description": "Growing up in Virginia's Allegheny Mountains, eleven-year-oldCharlie York lives at the foot of an endless peak called Angel's Rest, a place his momma told him angels rested before coming downto help folks. In 1967 his town was a poor boy's paradise...untila shotgun blast killed Charlie's father and put his mother on trialfor murder. For mysterious reasons, his mother entrusts his care to an oldblack man named Lacy Albert Coe. Lacy tells simple stories aboutthe good and the bad that compose life's sweetest music. But whena reclusive Korean War veteran is linked to his father's death andLacy is victimized by hate crimes, Charlie hears only silence. It'snot until Charlie embarks on a dangerous midnight journey pittinghim against his darkest fears that he finally hears his own songplaying out.", "title": "Angel's Rest", "url": "http://www.goodreads.com/book/show/1598040.Angel_s_Rest", "average": 3.88, "cover": "https://images.gr-assets.com/books/1185673092l/1598040.jpg", "reviews": 93, "authors": [{"url": "https://www.goodreads.com/author/show/8341637.Charles_Davis", "name": "Charles   Davis"}], "type": ["Fiction", "Contemporary", "American", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/1598040.Angel_s_Rest", "http://www.goodreads.com/book/show/2077478.Angels_Rest", "http://www.goodreads.com/book/show/1316792.Angel_s_Rest", "http://www.goodreads.com/book/show/5322614-drifting-south", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}