{"ratings": 4825, "userreviews": [{"userName": "Cindy", "userReviewDate": "Mar 13, 2009", "userURL": "http://www.goodreads.com/user/show/1250042-cindy", "userReview": "An interesting and thought-provoking book by an autistic scientist, a Ph.D. in animal science, who is a professor at Colorado State University. This book was written in collaboration with another scientist, also a Ph.D., who specializes in neuropsychiatry and who is also the mother of two of three sons with autism. It is clear throughout the book that autism has provided Grandin with extraordinary insights into animals and (perhaps) extraordinary patience with animals. In one example, she takes a week to condition a group of prey animals (llamas or gazelles) in a zoo to the presence of a new door or a differently colored sign. I couldn't wait 24 hrs to introduce a new pd to my resident pet pds. In another example, Grandin easily identifies why cattle are suddenly spooked by an entryway by slowly following the path of the cattle through the entryway and absorbing perceptions so detailed they would be almost imperceptible to the average person.It appears her autism provides her with the ability to tap into different modes of perception, nonspecific (human) and specific (autistic and animal). Her treatment with modern antidepressants has provided her with the ability to cope with an overwhelming anxiety disorder and the opportunity to achieve, among other things, a Ph.D. She works primarily with feed animals--consulting with private corporations on humane policies and practices for raising and killing animals for food. She also consults with zoos on habitat, behavior, and quality of life issues. She has a philosophical acceptance of certain practices, i.e., hunting, as a byproduct of the ability to maintain wild populations. The subtitle of the book is \"Creating the best life for animals,\" which was of particular interest to me as a pet owner of domestic mice (two \"colonies\" of many mice) and six wild prairie dogs (pds).Grandin actually mentions research on pds that attempts to decode their fairly sophisticated language. They have specific calls for different predators and the complexity to communicate the location and immediacy of threats. I acknowledge my emotional and often irrational sentiments regarding animals and wild animal populations. I grew up with Bambi. I care about polar bears. I acknowledge I am also a carnivore. I love rare steaks. I can accept black-footed ferrets eating pds, but I don't want to see them in action. I respect hunters. But I also think people who shoot pds for sport using rifles with long-range telescopic sights are not hunters, per se. I would like to read more of Grandin's work."}, {"userName": "Todd", "userReviewDate": "Jan 22, 2009", "userURL": "http://www.goodreads.com/user/show/614430-todd", "userReview": "Animals deserve the best life, and Temple Grandin's interesting take on our relationship with animals is always a pleasure to read. Particularly of interest was the way she pursued her thesis that animals make us human. This 21st century mental model of identifying -- and revising -- humans' long-standing problematic dominion over the rest of the animal kingdom was very enlightening."}, {"userName": "Jolanta Da", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/58351222-jolanta-da", "userReview": "Informatyvi knyga, parasyta mokslininkes turincios autizmo sindroma. Butent sis sutrikimas padejo jai pazvelgti i gyvunu pasauli kitu kampu ir isspresti daugeli ju problemu. Knyga turetu perskaityti visi, ypac tie, kas turi salyti su gyvunais. Augina juos namuose, priziuri juos ukyje, taip pat dirbantiems su laukiniaias gyvunais. ...ir dar. Ilgas valandas laikantiems savo augintini viena namuose... bukim zmones, paimkim is prieglaudos jam drauga...ir zaiskime zaiskime su jais..."}, {"userName": "Gloria", "userReviewDate": "Jun 10, 2009", "userURL": "http://www.goodreads.com/user/show/1069582-gloria", "userReview": "The many fantastic reviews of this book seem to be based more on the person (autistic woman overcoming her disability to achieve a successful career advising the livestock industry on how to treat animals on the way to be nicer to their animals) than the book itself, which is awkwardly written and not that great of a read, to be honest. In Britain it's called \"Making Animals Happy,\" and that would be a more appropriate title than \"Animals Make Us Human,\" which is an interesting thesis but one that Grandin sheds no light on throughout the course of her book. Grandin ends the book by talking about why she never became a vegetarian and instead advised the industry: she met some cattle farmers in the '70s who were very dedicated to their animals, and she thought that they could all be that way. She's since learned differently, especially in the case of chickens, but doesn't address why she didn't become a vegetarian later when she found this all out.... perhaps because she is only well-known because she works for the livestock companies? Anyway, Temple Grandin is like the Barack Obama of animal rights: she makes people feel like \"change\" is happening and like she really is on the animals' side, when she's clearly not (she designed a better fence to lead cattle to slaughter, which most slaughterhouses now use-- she cried when she first saw the cows going to their death in it but then was able to change her mind that this was a good thing). The same way that people feel good supporting Obama because of his background or characteristics, Grandin makes people feel good that anyone can overcome a disability and that McDonald's really, really cares about the animals."}, {"userName": "Tamara", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/41724-tamara", "userReview": "I love that the focus of this book is about how to make animals in captivity (pets, zoo animals, livestock, etc.) happy. It's so hard to know what it means for an animal to be happy and Temple Grandin uses careful analysis and science to help unravel the mystery. Knowing that animals need the freedom to express normal behavior and freedom from fear and distress to be happy, Grandin begins to define these things in layman's terms. I mostly focused on the chapter about cats, because, um, you know. The best insight that she described is something called SEEKING behavior. Animals (and humans) are happy when they are pursuing a goal, such as food or shelter. When providing hamsters with a cage with pre-built tunnels but no place to dig, they are unhappy because it is their instinct to build them. So you can give them tunnels, but they still want to dig the tunnels themselves. Very similar to \"Life's a journey, not a destination.\" Animals need the journey to be happy. There's also some great fodder in here for the cats versus dogs debate. Grandin makes a clear case that neither is better or worse, just different.Favorite Quotes/Facts/Sections: All animals and people have the same core emotion systems in the brain. [C]ats are not solitary, self-sufficient loners the way a lot of people think. Cats have social needs...[C]ats and humans had a mutualistic relationship instead of the more symbiotic relationship humans and dogs had during domestication...With people and cats, it was more of a relationship of convenience. Cats killed mice and rats, and humans provided lots of mice and rats to kill...Cats seem autistic because they don't come across as being sociable or eager to please like dogs, and also because their faces are kind of blank. Cats knead people with their paws to leave their scent. All animals intensely dislike slippery or unsure footing. Any unstable flooring will frighten an animal. Cats are hard to read\" section (Beginning on p72) Preventing Fear at the Vet's Office (p78-79)Elimination Disorders (p80-81)"}, {"userName": "Ali", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/2570049-ali", "userReview": "It started out very good, and then developed into a book of random information about animals. I love animals and I love information about them, but that was not expected from this book. The title is misleading. I didn't even finish it actually, because it was repetitive and her random flow if info was agitating me."}, {"userName": "Christina", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/6008505-christina", "userReview": "Ah, it has been a while since I read Grandin's other books, Animals in Translation and Thinking in Pictures. In that time I have also read a lot of other animal behavior books and books on factory farming, so most of the info within this book was not new to me. For that reason, I personally found it a little dull.Another reviewer said that an alternate title in the UK is \"Making Animals Happy,\" and that is a far more accurate title than \"Animals Make Us Human.\" The latter is an intriguing statement but is not explained in the book at all.Although it starts out neatly enough, the information presented starts to get random and disorganized. While reading a chapter that is supposed to be about a certain type of animal you find yourself suddenly reading about management practices in the food-animal industry or dissemination of scientific findings. These topics are interesting enough, they just are tossed in the book kind of carelessly.Grandin makes good points about the importance of good fieldwork and the need to learn how to satisfy animals' core (\"blue ribbon\") emotions. Some of the information on animal behavior is good, although I think her other books and books by other authors present it much better. Once the book moved from pets (dogs, cats, horses) to animals used in the food industry, it seemed like there was a lot less information on the animals' behavior and a lot more on the workings of factory farms: their horrors, a brief history of changes that have taken place, and a bit about what Grandin has done to try and improve animal welfare there. I do appreciate her work to make factory farms less horrific for animals (cattle mostly) because factory farms exist and we can't just pass a law and get rid of them and have a happy ending. But I personally hate their existence, and was just . . . bothered by what seems like the idea that they can just all be made better. The positive changes are great, but they seem very slow, and maybe I'm the naive one and I definitely haven't done \"fieldwork\" and actually visited plants, but it seems like Grandin is awful accepting of the current situation. And zoos, too. Some animals may be fine in captivity, and she has examples of how zoos have improved the emotional welfare of animals, but how far can they really go? How necessary are zoos anyway? No, you can't just turn captive bred and/or raised animals out into the wild, but should captive breeding programs continue? I don't know. The book makes me think, a lot, and I guess anything that prompts us to really think and consider our beliefs and what side we're on is good."}, {"userName": "Mom", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/7813734-mom", "userReview": "Another awesome read by Temple Grandin. This book was much easier to read, the font was more pleasing to the eye and the text was much more reader friendly. In the future, I will read all of her books again, she is such a fascinating person. I like her outlook on life and her ideals."}, {"userName": "Stephanie *Very Stable Genius*", "userReviewDate": "May 04, 2009", "userURL": "http://www.goodreads.com/user/show/1085121-stephanie-very-stable-genius", "userReview": "This book is excellent and should be read by anyone who works with animals! Or by those who just love them. Really interesting. I liked the suggestions for handling cats in veterinary situations. Good book!"}, {"userName": "Elaine", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/27213617-elaine", "userReview": "I really enjoyed this book. I loved the animal-by-animal breakdown of what is know about how we can make their lives better physically and emotionally. I love how she works to improve animal welfare both academically and within the meat industries. A very practical viewpoint. Although she can be at times repetitive and a little dry, Temple Grandin is a treasure and a boon to animal lovers and owners everywhere. Although not exhaustive, this book gives a thorough introduction into an animal's mind and forces the owner to look through their animal's eyes and consider, truly, what's best for the animal. This should be required reading for all animal owners!My only 2 problems were that the title doesn't match the subject matter and that the whole book is very \"America-centric\" and therefore less interesting for someone like me who doesn't live in the USA."}, {"userName": "David", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/12369745-david", "userReview": "Well, I've been quite lucky with my selections of late. I really appreciate the authors approach. Certainly, I learned more about both my dog, and my cat. But, even reading about chickens was quite interesting. I also notice that some of these approaches are important in managing people. I think looking for the core driver, and trying to understand what things like safety mean for each species, for each individual can so helpful in making our relationship more fruitful, and satisfying for all of us."}, {"userName": "Lisa", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/793094-lisa", "userReview": "To really appreciate this book, you need to know something about the author, Temple Grandin. She has autism, she has a PhD, she has been able to make many discoveries about animal behavior, and she has been able to design many humane efficiencies in animal industries. She is something of a systems engineer for anything to do with animals.If you have never seen the movie \"Temple Grandin\", take a look at this preview:http://www.youtube.com/watch?v=bnI_Y8...You can find the movie at the Henrico Public Library.In this book Temple Grandin teaches us about animals and why they behave the way they do. Some of it seems so common sense after she explains her reasoning, but I would have never have thought of it on my own.\nSome quotes I like from the book:“The big companies are like steel and activists are like heat. Activists soften the steel, and then I can bend it into pretty grillwork and make reforms.” “I believe that the best way to create good living conditions for any animal, whether it's a captive animal living in a zoo, a farm animal or a pet, is to base animal welfare programs on the core emotion systems in the brain. My theory is that the environment animals live in should activate their positive emotions as much as possible, and not activate their negative emotions any more than necessary. If we get the animal's emotions rights, we will have fewer problem behaviors... All animals and people have the same core emotion systems in the brain.”"}, {"userName": "Lynn G.", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/7757273-lynn-g", "userReview": "Like the other books by Temple Grandin, Animals Make Us Human: Creating the Best Life for Animals was interesting and accessible. I enjoyed reading about the gradual evolution of attitudes of large-scale animal raising operations towards the cattle, pigs, and chickens that were being raised for market. Originally, most farmers/ranchers operated under the concept that animals were non-sentient dumb beasts that didn't need to be treated humanely, whose welfare wasn't considered at all. With Grandin's guidance, along with others, corporations such as McDonald's, Burger King, and Wendy's have caused a major shift in how animals are treated at the growing, breeding, and slaughtering facilities with whom these corporations buy their meat, etc.Additionally, the reader learns that Grandin posits that all animals have a standard set of emotions that are activated depending on the situation in which an animal finds itself. She looks at animals both in the wild as well as those at large agriculture facilities. She makes a lot of sense and backs up much of what she says with studies and observations by others.What I found off-putting in this book is Grandin's more colloquial and casual style of writing. While there is still plenty of science involved, which is a good thing, Grandin's manner of conveying the science verges on the unscientific. Still I was engrossed while reading it and would recommend it to those with an interest in animal welfare, large agricultural facilities, and an anecdotal look at these areas."}, {"userName": "Miss Poppy", "userReviewDate": "May 31, 2009", "userURL": "http://www.goodreads.com/user/show/2370105-miss-poppy", "userReview": "Temple Grandin writes about the four emotions of animals - fear, panic, rage, and seeking. It was like she read my diary! (just kidding)There's really only one positive emotion for animals - seeking, and that's the one you want to work with. There are a couple of chapters on domestic animals - cats and dogs, and others on farm animals - chickens, pigs, cows, and horses, another on birds. The farm animal chapters are somewhat depressing in the sense of how the food industry has treated them, and that might put you off your feed. Grandin has done a lot of work to improve the situation of cows and chickens. (She's a national treasure.)I was happy to read that we're doing all the right things with our cats.The section about wildlife blew my mind. Here's an excerpt:\"Jane Goodall eventually did get a PhD in ethology, but not until after she made two major discoveries about chimpanzees: She discovered that they ate meat and used tools, at a time when scientists believed that the fundamental distinction between humans and animals was that humans used tools and animals didn't. When Jane Goodall reported that she had seen chimpanzees using twigs to fish for termites in termite nests, Dr. Leakey sent her a cable that said, 'Now we must redefine \"tool,\" redefine \"man\" or accept chimpanzees as humans.'\"I'd never considered that the category of human might contain another living species. Amazing.Temple Grandin is autistic and seeing the world through a perspective so wildly different from my own was a gift."}, {"userName": "Kaethe", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/1072582-kaethe", "userReview": "In this book, Grandin offers up the latest research into animal behavior, giving advice on home to make pets happier and less troubled.So, there I am, reading the section on cats in my bed, waving the cat-fishing pole about, and Mao takes some sort of crazy course-correcting jump and scratches my nose and chin. This morning I look as if I attended Heidelberg. And I didn't make the cat happy, either, because he didn't like the smell of the antibiotic ointment or the band-aids.It's a good book.***Happily, I managed to conclude my reading without anymore disfiguring incidents. I worry that the kids are more traumatized than I'll realize until I pay their therapists' bills, but both seemed in fine playing-with-cats form last night.Good book. I think Grandin takes a very clear-eyed view of how humans interact with animals, ie., we feel like we deserve something from them, whether it's affection, or meat, or tourist dollars. I laugh at the Ducks Unlimited people saving wetlands so they can slog through and shoot ducks, but hey, they're saving more ducks than they're killing. Highly recommended to anyone who interacts with animals, at home or at work. there's a lot of absorb."}, {"userName": "Brittany", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/92397-brittany", "userReview": "A very clear-eyed look at the emotional and mental well-being of animals, and how it ties in with this physical well-being. Temple Grandin is an autistic woman who uses her ability to \"see\" like an animal to improve the lives of animals, particularly those involved in farming. Her book includes chapters on dogs, cats, horses, cattle, pigs, chickens, zoos, and wildlife. Each reads as a rational how-to to give each animal the best lives possible. Even if you're not currently running a farm or slaughterhouse, if you eat meat or consume animal products, I think this is a useful and interesting book.Her writing style and tone in particular were very interesting. She writes very plainly and clearly. It comes across as if she is talking to you, and I enjoyed it, though others many not enjoy the simplicity of the style. She also (in the \"Dog\" chapter) has one of the most lucid analyses of the Dog Whisperer phenomenon I've ever read."}, {"userName": "Anita", "userReviewDate": "Dec 24, 2011", "userURL": "http://www.goodreads.com/user/show/1668393-anita", "userReview": "A very interesting read. Temple explores the emotional needs of a wide variety of animals - the chapters are devoted to dogs, cats, horses, cows, pigs, chickens, wildlife, and zoos - and what humans can do to improve these animals' lives. I found it more and more interesting as the chapters progressed; as curious as I am about the emotional needs of housecats, Temples' expertise lies in the world of big animals on farms and in zoos, and she has lots of opinions regarding the treatment (or mistreatment) of these creatures by their handlers. She's extremely matter-of-fact about it all, and very persuasive. I recommend this book to anyone interested in animal welfare - whether or not you are a meat eater, it's good to know what's going on behind the scenes in slaughterhouses, and you may also gain some insight into what the hell your cat is thinking."}, {"userName": "Mela", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/41757430-mela", "userReview": "I have read two books of Temple Grandin about animals (a couple years ago). Thanks to them I understand animals, especially my dogs and cat much better. And to tell the truth, I understand human nature better too. The perspective of Grandin is priceless.If you love animals you should read this book and/or Animals in Translation: Using the Mysteries of Autism to Decode Animal Behavior."}, {"userName": "David Smith", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/5643555-david-smith", "userReview": "This fascinating book has a lot of insights into the higher picture of how behavior works in animals, and into the devilish details of dogs, cats, horses, cows, pigs, and chickens. It also covers zoos and wildlife more generally though with specific anecdotes. The most mind blowing moments happen when you realize, or Temple Grandin points out, that understanding humanity has an awful lot in common with animal husbandry. This is easily in my list of top 5 nonfiction books ever read.The theory of behavior boils down to emotions, and how they drive behavior. Neuroscience has helped narrow down a few fundamental emotions. SEEKING is curiosity. Humans, pigs, and big predators need it stimulated in spades. RAGE, similar to frustration, is theorized to stem from being held by a predator. It may provide the shock of energy you need to get loose. FEAR explains itself. PANIC has to do with social attachment. It's what babies feel when they get separated from their parents. When you cause an animal pain, they make separation noises. Maybe that's why we say it \"hurts\" to lose someone we love. LUST doesn't get much play in the book. Read Sex At Dawn for that. Finally, PLAY is roughhousing play in young animals and humans.Long story short, stimulate the SEEKING and PLAY while avoiding FEAR and PANIC.Here are some of the passages I particularly liked.If we get the animal's emotions right, we will have fewer problem behaviors. That might sound like a radical statement, but some of the research in neuroscience has been showing that emotions drive behavior.(This is the thesis of the book) Everyone who is responsible for animals (note by me: the human great ape very much included) - farmers, ranchers, zookeepers, and pet owners - needs a set of simple, reliable guidelines for creating good mental welfare that can be applied to any animal in any situation, and the best guidelines we have are the core emotion systems in the brain. The rule is simple: Don't stimulate RAGE, FEAR, and PANIC if you can help it, and do stimulate SEEKING and also PLAY. Provide environments that will keep the animal occupied and prevent the development of stereotypies (note by me: repetitive, pointless behavior that the animal engages in for hours every day). In the rest of the book I'm going to tell you what I know about how you can do that.To train a cat, you have to give it food treats, but a dog is happy when you're happy.A young cub, like a young child, can get away with more aggression than adults can because a wolf cub or a child can't do that much damage. The aggressive behaviors come in first, so young wolves (or young children) have some way to defend themselves if they have to. the submissive behaviors come in second, so an older, bigger wolf or human has ways to stay out of fights with other juveniles or adults. We definitely see that in normal humans. A normal two-year-old child may hit his mom; a normal twenty-year-old would never do such a thing - at least, no normal human who's been well brought up.A lot of parents feel that they yell at their kids more than they want to, but it's hard to stop. A behaviorist would say that's because parents keep getting negatively reinforced for yelling. Every time a parent ;yells at a child for doing something bad and the child stops doing whatever he's doing, that is negative reinforcement. The kid's behavior is painful for the parent and ;yelling makes the painful thing stop, which makes yelling more likely to happen in the future because it got results. Yelling has been reinforced by the kid stopping what he's doing. But then, because the parent yells so much, the kid starts to habituate to yelling. He gets used to it. The kid stops responding to being yelled at, so the parent yells louder, and then the kid does respond. That reinforces the parent for yelling louder, and the kid habituates to louder yelling, and so on.Negative reinforcement used to the way a lot of people use it - not just animal trainers but parents, teachers, and bosses - has bad side effects. Karen Pryor says negative reinforcement \"puts you at risk for all the unpredictable fallout of punishment: avoidance, secrecy, fear, confusion, resistance, passivity, and reduced initiative, as well as spillover associations, in which anything that happens to be around, including the training environment and the trainer, becomes distasteful or disliked, something to be avoided or even fled from.\"It's easier for a horse to be brave when he's feeling happy than when he's feeling nervous or afraid.KAren Pryor says animals that have learned to learn start to feel like they're training the person, not vice versa. They know they can figure out a way to make the trainer give them treats. She could be right, based on what behaviorists know about humans. I read a very interesting article by three research psychologists on positive versus aversive control of people. Aversive control is what they usually have in a public school. The students have to do theri work and behave well in class or they'll get bad grades or a detention. Positive control might be used in a preschool, where the teachers \"catch them being good\" and then reinforce the good behavior. Instead of making the children do good behaviors by threatening to punish them if they don't, the teachers watch the children until they spontaneously do a good thing and give them rewards to reinforce the behavior and make them more likely to do that behavior again in the future.The psychologists said that people feel different under these two systems. When a person is under aversive control, he feels like he's being controlled. The authors write, \"The person reports that his or her autonomy was undermined because avoidance or escape behaviors are verbally understood as things that he or she 'had' to do.\" POsitivie control is the opposite. Even though the teacher or psychologist has created an environment that \"controls\" the person's behavior through positive reinforcement, the person doesn't feel like he's being controlled, probably because he is getting reinforced for behaviors he didn't \"have\" to do. The authors say: \"The behavior is likely to be reported as having been the product of an autonomous decision to act. Subjectively, behaviors that are followed by pleasing consequences are likely to be verbally described as those that we 'like' to or 'chose' to engage in.\"Animials trained using positive reinforcement learn faster, too. If you put a horse in a maze and let him find ghis way out through trial and error, he'll finish faster than a horse who gets a shock when he makes a wrong turn. Paul McGreevy says, \"Punishment can stifle creativeity and impede a horse's innate problem-solving skills.\"The proof of this is that Bud's methods don't work with completely tame cattle. When I walked back and forth behind a herd of completely tame cattle, they just looked at me like I was stupid. Tame cattle can't be herded. They can be led, but they can't be herded, because there is no fear.Last, very often people find positive handling methods harder to use than negative methods. The blue-ribbon emotions help us to understand why. Handling untamed, untrained cattle is frustrating because they don't do what you want them to do, and frustration is a mild form of RAGE. So, unless a person is an expert in quiet handling of cattle, the environment at a ranch, a dairy farm, or a slaughterhouse will naturally activate the RAGE system in his brain. That's why it's easy for people to blow up at farm animals (or at small children). Getting angry at frustrating situations is natural.Confident people have more positive emotions than depressed and insecure people, which might mean that their SEEKING system is activated. Since SEEKING inhibits RAGE, maybe confident stockpeople have a higher frustration tolerance. The reason why the first study found that introverted handlers had the most productive cattle is probably that introverted people are naturally quieter than extroverts. Cattle prefer quiet handling.The pigs quickly learned that they could move the cursor on a computer screen with the joystick. At first, the game was very easy. The cursor was in the middle of the computer screen and the pigs got a treat if they mnoved the cursor far enough in any direction to touch a line that formed a square around the cursor... When the treat feeder broke, the pigs kept playing. Pigs have a very strong SEEKING system.The building contractors were running the show, and they built what was good for building contractors, not animals. That happens with cows and chicken, too. No company or organization should allow a contractor to dictate design.Touch helps the eye to perceive accurately. Oliver Sacks describes a person who was blind and regained vision as an adult. To understand the meaning of things he saw with his eyes, he had to touch the objects he was looking at. I believe that there is something fundamental about the nervous system that prevents the computer mouse from being connected to the brain the same way touch is. Touching and feeling objects are essential for accurate perception. (note by me: This may explain why Odin feels compelled to touch everything)In the 1980s, the Humane Society of the United STates donated money to fund the development of my center-track restrainer system for meat plants. They would never do that today. Few animal welfare groups would fund something to help reform and improve the livestock industry. As people have become more abstractified they've become more radical, and today the relationship between animal advocacy groups and the livestock industry is totally adversarial.You see this at every level. Recently I went to a college that has a program on animals and public policy. The only publications they had in the library were animal advocacy magazines. I said, \"look, I think you need to subscribe to Feedstuffs, Beef, Meat and Poultry, and National Hog Farmer. You need to get the magazines read by the industry.\" To make policy that will work you need information on every side of the issue.Dave Fraser, a respected animal welfare scientist at the University of British Columbia, says that to understand an issue you need to read literature that is not from the most extremist people. I believe he is right. Both animal advocacy organizations and livestock groups often respond to complex issues with simplistic and contradictory information. Throughout my career I have observed that on most issues, the best way to solve animal problems is to take an approach that is somewhat in the middle between extremist positions.Look at the situation with horse slaughter in the United STates. The Humane Society managed to get all the horse slaughter plants shut down in America. Now the old Amish carriage horses and other unfortunate equines are getting transported down to Mexico, where they're worked and starved until they drop dead from lack of nutrition and overwork. If I were a retired Amish carriage horse, would I rather get hitched up to an old pickup truck and get sores and go hungry, or go to a U.S. slaughter plant? I got into a discussion with some of the people trying to shut down the plants once, and I said, \"You want to make sure, if you do this, the horses don't have a worse fate.\" My worst nightmares came true. Thousands of horses have traveled to Mexico, where they were killed by the barbaric process of stabbing them in the back of the neck. Yes, in an ideal world all retired and unridable horses would go to sanctuaries, but we don't live in an ideal world.Activists need to find out what is actually happening in the field so that true reform will occur instead of the tragic mess of unintended consequences that hurt animals.Mike Norton-Griffiths, a conservationist living in Kenya, says that since 1977 Kenya has lost between 60 and 70 percent of its big wild animals in the areas outside the national parks. It was in 1977 that Kenya passed laws making it illegal to hunt wild animals or raise them on ranches to sell for profit. That isn't a coincidence. It was the law that caused the animals to disappear. It made things worse. The large animal advocacy groups are still defending their law.The law hurts the animals by making their habitat disappear. Before 1977 wild animals lived in two places: government preserves and privately owned open-range grasslands owned by wildlife ranchers. Once wildlife ranching was made illegal, ranchers couldn't afford to maintain their grasslands. They had to plow up the rangelands and plant crops to support themselves. That law does exactly the opposite of what we need to do to protect the animals. Laws need to be passed that create an incentive for people to take care of the animals. The 1977 law created an economic incentive to destroy the grasslands and deprived the animals of habitat.African landowners make some of their biggest money selling big-game-hunting safaris. I found lots of websites advertising them. A typical price for a ten-day trip to shoot antelopes and warthogs costs $9,500... Sacrificing some warthogs, antelopes, or wildebeests that are held on private land may be necessary to motivate landowners to preserve their land as wildlife habitat.You can't pass laws against human nature. If you do, the animals will suffer.A measure that produces good effects in one situation may do damage in another, and ... there are few general rules (rules that remain valid regardlesss of conditions surrounding them) that we can use to guide our actions. Every situation has to be considered afresh.\" In my work I call that animals will throw you a curve ball.There's a fire-breathing dragon in the foothills, I tell them, and your job is to bring him back alive without having him burn up Fort Collins and our university. Or there's a ten-foot-high daddy longlegs out in a field. Your job is to bring him back to the lab alive without breaking his legs.However, you have to be careful not to force new things on animals (or on people). Animals like novelty if they can choose to investigate it; they fear novelty if you shove it in their faces.People have a lot of control when they do their laundry, but you wouldn't want someone to put you in a zoo exhibit and give you piles of dirty laundry and a washer and dryer to keep you busy. That wouldn't be a very stimulating environment.Dr. Orosz chose an excellent, enriched environment for the parrot. The greenhouse reduced FEAR because the parrot could perch on trees under the foliage, which kept his instinctual fears of aerial predators from being turned on, and the students became his human flock so his PANIC system would not get turned on."}, {"userName": "Abby", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/51392689-abby", "userReview": "I chose Animals Make Us Human because I love animals and Temple Grandin is an inspiration to me. Temple Grandin is inspiring because she accomplished a lot even though she has autism and she changed slaughterhouses with her inventions. I thought the book was just like I hoped it was going to be, Temple explained in every chapter what animals need and how they should be treated. Temple wrote in her book how she went to the slaughterhouses and trained the people to handle the animals better with her inventions. She also wrote about what she went through to get the people to listen to her and let her install her inventions in their slaughterhouses. I really enjoyed the book because is was good and I liked how Temple wrote about the tests she did with the animals to prove to people that she was right. I think Temple Grandin is an amazing women and that her inventions should be used for a lot of years to come, she’s a hero to me.Even though I loved the book I will say there was some parts I didn’t lie so much. I liked the way Temple wrote the book but I wish there was pictures in the book. If she put pictures in the book it would let people see what she saw and what she did to help animals at slaughter. When she writes in her book about how dirty the slaughterhouses were, she could have put in some pictures so people could see just how dirty they were. The book was still interesting without the pictures but I think it would have helped people see what slaughterhouses were really like before Temple changed them. The way she wrote the book made it so you could picture what was going on, so she really didn’t need to put pictures in. Even though she didn’t add pictures I still liked the way she ended the book by concluding her information about animals and how she changed how people treat animals.All throughout the book I thought that it was written quite well, she made it so if you closed your eyes you could picture what she is seeing. Temple had really good detail about what she went through when she wanted to install her inventions. In her book she talks about how she proved a lot of people wrong, especially with her pig experiments. I also liked how she talked about how she had to teach the people to handle the animals and what she had to do to get them to handle they better. When she added detail about her pig I think it made it better because it had more detail and it was more relatable. When she had to teach people how to handle animals better she had to threaten people sometimes because they didn’t believe that her methods worked. These parts made the book better because it added more detail to the book and it was more relatable because you could picture what she was seeing.Besides there being no pictures in the book I thought it was a very well written book and Temple did a very good job on writing the book. I like how she included information about her autism, how it affects her everyday and she struggles. I also thought how she explained how she taught the people at the slaughterhouses was good, she taught them how to treat and handle animals better. When she had trouble with people not listing she would threaten them sometimes and they would listen. I thought the pace of the book was awesome, it wasn’t too slow or too fast, it was just the right pace for me. I also liked hw in each chapter she talked about different animals, what their needs are, and how them should be treated. The pace made the book better because it was not fast or slow, it was the way I like a book to be. The chapters also made the book better because they were all about different animals so it changed from chapter to chapter. As a whole I thought these 2 parts made the book a whole lot better and I enjoyed it a lot.I think that a lot of people would enjoy this book if they like animals and Temple Grandin. I would recommend this book to 10 years old and up because any younger and the book would be inappropriate for them. This book talks about animals getting killed for slaughter so it wouldn’t be good for young kids to read. If people liked this book they would also like the following movies and books; War Horse, Marley and Me, The Dog Who Saved Christmas, Life of Pi, Black Beauty, and more. Another reason someone would want to read this book is if they want to know more about Temple Grandin and what she did to change slaughterhouses."}, {"userName": "k.wing", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/74350-k-wing", "userReview": "This is a must-read for every human. While I didn’t find much of the information surprising when it came to dogs and cats, I found Temple’s experiences and observations fascinating when it came to farm animals. Especially in her final thoughts section. I wondered why she helped design slaughter houses when she believes in such care and ethical treatment of animals. She says it’s because if we believe in the ethical treatment of animals, we must care about their inevitable deaths, and those, too, must be ethical. Because the meat industry isn’t going anywhere anytime soon, Temple is using her time and energy in doing what she can in this time period - making sure both life and death of animals is humane and even good."}, {"userName": "Lisa", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/7007786-lisa", "userReview": "This was a very hard book for me to rate. Please note that 3 stars on good reads means, I liked it. This book focused on core emotions in the brain: SEEKING, PLAYING, RAGE, PANIC and FEAR. It was about how to keep animals feeling the positive emotions and not the negative ones and each chapter went through a species or group such as dogs, cats, cattle, zoo animals. What you might find difficult to believe is that I DO RECOMMEND READING this book.In Temple Grandin's favor: she knows cattle and pigs well and these sections of the book were very well done. This is her expertise, it is what she has worked on for most of her life. They are great. It is also really interesting to read her last little epilogue, why she stays in the business of fixing slaughterhouses and such when she loves animals so much. Update: I took my dog to the vet today and used her advice to try training her at the vet to turn on her SEEKING area and keep her from feeling FEAR. It totally worked! Usually she is trempling and sitting in my lap. Today she was watching intently, trying to figure out how to get the treat. She had the happy dog mouth open smile and wasn't trembling at all.What I didn't like: I never understood how the title fit the book. The whole book was about how using these core emotions found in the lower brain could be used to make animals lives better. Nothing really about how that connected to us as humans or why that would make us \"human\". Temple Grandin does not know dogs. She states (in the cat section) that dogs are too neotonized to have passive aggressive urinating behaviors where when they are mad at you, they pee on your pillow on your bed when you leave the room. My dog does that. I know that is not scientific, but her evidence that cats do is her cat bee tee. Throughout the dog section, she makes statements I would have liked more evidence for. For example, she states some very large number of years (I think it is hundreds of thousands of years) for when dogs were domesticated without a citation. There is huge amounts of research on when dogs are domesticated based on archeological evidence and DNA evidence. She could have found something. Especially because other books I have read focused solely on dogs have a smaller number. If you want information on dogs, read the Dog Sense: How the New Science of Dog Behavior Can Make You A Better Friend to Your Pet or The Genius of Dogs. There are also parts of the animal training in the zoo section I would debate. Right after a section stating that animals want to work for their food and noting machines that were made to do this, such as an auditory bird call that was used to get a tiger to run around her cage before getting her dinner, Grandin has a whole section stating that you have to have special treats to train the zoo animals. That the treats have to be better than normal food. There are no references for this section. Really, whatever the animals normally eat works perfectly fine. Maybe you want to have a mix of their normal dinner and some special treats for when they do something particularly well while you are training them. But you don't need special treats to get them to do behaviors for training. I helped train harbor seals and penguins at an aquarium. They worked for their normal meals. One seal was so happy to train, if he was full he would spit his food out and keep participating. He didn't even need food.  *Thinking back on this, she only appears to have experience with highly fearful prey animals in zoo environments like nyala (a kind of antelope). They may need much greater rewards than the less fearful predator species. But she doesn't say this in that section. She says they all need special treats.In general, there are a couple sections of this book that are great. And the whole core emotions things is a great way of assessing whether an animal is happy or not, I totally agree (although it got repetitive going through every species). It was something I didn't know about and a very interesting read. There were great tidbits throughout. But I came across many sections I didn't agree with completely and so could not give it a high rating."}, {"userName": "El", "userReviewDate": "Jun 15, 2010", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "Read for my in-person book club.I'm usually pretty wary of books like this, the kind with animals on the cover. Which is really sort of funny since I'm such a whore for animals in real life. But this is the book that was decided upon for my in-person book club, and since I missed the previous two books I figured I should suck it up and read this, especially considering it was my boyfriend's recommendation.Temple Grandin is an animal scientist with a \"twist\" as I like to say. Her personal experience with having autism allowed her to be able to really enter the minds of animals and see life through their minds and eyes. This book (from what it sounds like, her other books as well) discusses how to make the lives of animals better. She starts with domestic animals as pets (dogs, cats) before moving on to farm animals (horses, cows, pigs, chickens) and finishing with wildlife and zoos. In all environments animals' lives can be improved upon. She focuses mostly on the emotions of animals and how to bring out the best through SEEKING and PLAY, and how to bring out the worst through RAGE, FEAR, and PANIC.As an animal lover myself I found that I didn't find I was learning anything new, per se. Animals do have emotions and little changes in their lives can be dramatic and/or traumatic if not handled carefully. Her final chapter about zoo-life was the most interesting to me since I have long had a love-hate relationship with zoos. The Pittsburgh zoo is pretty cool in my opinion (and they have a deer habitat!!) and we try to go at least once each summer. I always enjoy the time we spend there but do find myself feeling sad at the same time. Are the animals there getting the right amount of SEEKING and PLAY that they need to maintain a healthy lifestyle? I can think of a few situations there where things could be improved now that I've read Grandin's suggestions. I'd like for her to come to Pittsburgh and visit the zoo and aquarium to see what she thinks. Along the same lines, I'd also like to know her opinions on sea life as well. Fishies and penguins and manta rays are bad ass too. I'd be interested to hear her opinion of them as animals as well.I'm also excited to see what people think of this in our book club. This is the first book that has been chosen that was not some hardcore philosophical or sociological study, so the discussion should be pretty interesting."}, {"userName": "Meredith", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/5070983-meredith", "userReview": "The big thing with Grandin's books (NF) is that she's autistic, and also a specialist in humane treatment of \"food animals\": cows, chicken, pigs. She was particularly famous because she headed up the McDonald's audit of feed lots and slaughter houses. Apparently her autism gives her a unique perspective on this--and her prior book, Animals in Translation, was very interesting. It talked about how small changes in the animal's environment meant both cost savings for the companies involved in managing these farms/slaughterhouses and also made the treatment of the animals more humane. Well, as humane as any slaughterhouse could be. I would recommend Animals in Translation and I have a keeper copy at home, which means I must have really liked it. This is the boring version of that book. The disappointing thing was that there is a picture of a dog on the cover but the chapter on dogs is very short and not very helpful. The biggest problem with the book for me, though, was that she never actually addresses how animals make us human. This is really a book about the things that drive animals and each chapter deals with a different animal. But god, is it boring! I gave up during the chapter on poultry. The one thing I did take from this book was that animals see very differently than we do. Grandin talks about how certain things that look innocuous and obvious to us can look very different to animals. This was useful to me because my oldest dog Sullivan is rapidly losing his sight. In the last few months he's become very fearful of the entry way to our house. I had always figured that it was because the baby gate often sat near the door (we use the baby gate to block the kitchen off from the entry way while we are at work--the dogs stay in the kitchen during the day. Don't worry, it's a big kitchen and they're tiny dogs.). I moved the baby gate, he was still freaked, and the other day I realized that it might be the console table that is actually setting him off. I wouldn't have thought about that before reading this book. So we're going to move the table this weekend and see what happens. Anyway, if you really want to read this, read the Dog/Cat chapters and the Horse chapter, and then skip everything else."}, {"userName": "Deanna Dailey", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/6844641-deanna-dailey", "userReview": "It makes me a little sad to rate this book with only two stars. I really like Temple Grandin's work, and I loved Animals in Translation: Using the Mysteries of Autism to Decode Animal Behavior. I've gleaned a lot of interesting information from this book, and I think there was a lot of really interesting and valid research and experience that went into writing it. It's just that it's not very well written. It's like at the end of each chapter she starts to get tired of explaining everything and she starts just saying that doing things any way other than hers is \"just wrong.\" I happen to mostly agree with her, but from Grandin as a scientist, I expect her to more fully explain why doing things in a way different than she recommends is wrong. She's not approaching things from a moral/ethical (or even really an emotional) place. She is heavily involved in mass production of cattle, pigs, and chickens, and it's not her intention to change everything to small locally-owned permaculture farms. She's talking about how to make mega-ag more humane, while maintaining its ability to produce all the meat our American hearts desire. So when she says that breeding chickens with weak bones is \"just wrong\" it doesn't fit with the rest of her logical framework. I happen to agree with her; it is wrong. But then, I also think the whole mega-ag complex is just wrong, and any conversation about ethics is bound to decline into an argument about where it's okay to draw the line. Is it okay to keep chickens in cages too small to turn around in, as long as they have strong bones? It's a silly question. And that's what I love about most of what Grandin writes; she doesn't address the questions of right/wrong at all, but looks at the actual science. How are animals affected on a neurological level by their surroundings? How does that affect the final product, both in terms of profit and in terms of meat quality? Those are more effective arguments, and I think Grandin has that information in spades. I wish she had focused on sharing that information."}, {"userName": "Glenda", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/294631-glenda", "userReview": "I'll put this on the \"must read if you have a pet\" list, as there's a lot of good/useful insight into why the animals we live with every day do what they do, what works in training, and what makes up a \"good life\" for the animal. I particularly loved the chapters on dogs, cats, and zoos, and thought these few interesting points about dogs are worth sharing -In the wild, wolves don’t live in wolf packs, and they don’t have an alpha male who fights the other wolves to maintain his dominance. Our whole image of wolf packs and alphas is completely wrong.I think Dr. Mech’s research gives us a possible biological reason why it’s a very good idea not to own any more than two dogs unless you know what you’re doing. But outlawing a particular breed is never the answer because it’s so easy to breed dogs for aggression. If you make pit bulls illegal, unethical breeders will just breed other dogs for aggression, and it won’t take them long to come.I also have a lot of respect for Temple Grandin, with her deep affinity and respect for animals, who works to improve the lives and situations of animals in feed lots, zoos, etc. because quite frankly, someone has to do it and who better than someone who seems to care so much about the emotional state of an animal, and if they suffer (or not). And also I thought this was a particularly noteworthy mention since we don't live in an ideal world, we live in this one, which means, \"If you’re going to preserve wild animals, you have to make the animals economically valuable to the people in the countries where the animals live. You can’t just order people to leave the animals alone if the animals aren’t leaving the people alone. If I’m a local tribesman or a farmer and elephants eat all my family’s food, I’m not going to feel very charitable toward elephants. Wild animals are going to have to be managed or they’re going to die, so incentives have to be in place for local people to want to keep them around. One way to make the animals valuable to the local people is ecotourism. The locals will protect the animals if they can make a living from the tourists.\""}, {"userName": "Sammy", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/103544-sammy", "userReview": "Animals Make Us Human is kind of another version of Animals in Translation. Many facts and topics that were brought up in her first book are addressed and referred to again in this book. Therefore I feel that this book needs to be reviewed as a companion book to Animals in Translation rather than a completely new and different book.The book is divided into sections focusing on specific species and then analyzes their behavior in order to allow us as humans to better understand them, thus better their welfare. Again, Grandin does her best to simplify the super-scientific stuff, but at times I felt it almost about to go over my head. Even still, the majority of the book was fascinating and informative. She doesn't anthropomorphize the animals at all, but she does make very clear that animals have feelings, though processes, anxieties, pretty much everything humans go through, they just go about it a different way. We need to stop thinking about animals as just dumb things out there to serve us, Animals Make Us Human gives us valid reasons why.For all you pet owners out there, this book is a must-read, if not a must-own. It's better than a training manual because it will help you understand your pet on a completely different level. When you understand your pet and why they do the things they do, training them will become so much easier. Also, understanding what will get them to do certain things is what can turn an hour of training into a minute. Plus, better understanding will lead to a better and happier life for you and your beloved pet."}, {"userName": "Kurtbg", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/174365-kurtbg", "userReview": "The title is a little misrepresentative of the book. It's not a treaty on how animals make us human. Instead I would characterize the content of showing how the classification of animal \"Blue ribbon\" responses (or emotions) are similar to humans. If animals can be shown to have feelings then they're not so different from humans.Most animals have a seeking and fear switch. When a novel experience is provided either one gets switched on. Too far in one direction the animal bolts, or explores. Generally seeking is positive and fear negative. Fear can lead to anger and violence.She covers how different animals can be led to more seeking activities for a more content state of mind. Laboratory, zoo, and food farms activities and behaviors are touched on to provide examples of the difference between animal behavior in the \"wild\" versus controlled.I've read other books which seek to illustrate the symbiotic relationships of animals and humans and how that working relationship contributed to the development of both. This can be seen on the human-dog/wolve relationship.If you've read other books by the author you'll realize that she usually slides back into areas of expertise which is designing slaughterhouses and how to efficiently and humanly slaughter animals. A better title would have been \"the emotional live of Animals\" or\"how to keep an animal occupied and content.\"I would still recommend this book for anyone interested in learning more about how animal minds work."}, {"userName": "Colleen", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/115196-colleen", "userReview": "I'm giving this 4 stars because I think this would be a great book if you're not already familiar with issues in animal welfare and emotions. I've read/seen a lot about them so this was pretty redundant for me; I'd advise skipping it if you've also had a lot of exposure to these issues. I couldn't read the pig, chicken, or zoo chapters because I already know how badly animals are treated in the meat industry and how bad welfare is for captive animals in zoos. But: she's trying hard to improve things and I really appreciated her reasonable perspective. For example, her section on \"why am I in the meat industry if I care about animals?\" was a great 'change from the inside' argument, and her argument for observational research of animals in the wild is also really well made. Her ideas about animal emotion (and therefore welfare) are based on sound research and her classification of emotions in animals is really interesting. Overall her drive to give animals a \"good life and a painless death\", particularly in the meat growing industry, is really important work.A good quote about how her design for a squeeze chute used for handling cattle substantially reduces stress:\"I can prove that fear is reduced because cattle poop less in the squeeze chute when they are handled quietly. If there's less poop, there's less fear. I tell ranchers that the cattle poop less because they are no longer scaring the s*** out of them.\""}, {"userName": "Editrix (Amy Lewis)", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/317546-editrix-amy-lewis", "userReview": "Grandin (and co-athor Johnson) present a thesis that pyschologist Jaak Panksepp's \"blue-ribbon emotions\" -- SEEKING, FEAR, RAGE, and PANIC -- are common to all animals and help explain the behaviors of pets, livestock, and animals in the wild and zoos. By closely observing animal behavior and changing the environment and management in sometimes minor but positive ways, we can reduce stereotypic behavior (such as pacing or self-mutilating) and improve the emotional and physical welfare of our fellow creatures.The author shallengea popular theories of animal behavior and training, including Cesar Millan's approach for dog owners to dominate their pets and prove their alpha status. By focusing on how wolves and wild dogs behave in the wild (i.e., living in cooperative small family groups without one clear \"alpha\" leader), Grandin provides a strong argument for clicker and other reward-based training and positive reinforcement, which activate the animals' SEEKING emotion of pleasant anticipation.Grandin supports her ideas by citing both lab and field research, with a strong emphasis on observational methods to gather better data about animal behavior. Like Michael Pollan, she neither grandstands nor self-promotes, instead providing concrete examples of how humans can improve the quality of life for domesticated and wild animals. The book is thought-provoking for those who live or work with animals, as well as anyone who consumes meat, dairy, or eggs."}], "description": "The best-selling animal advocate Temple Grandin offers the most exciting exploration of how animals feel since The Hidden Life of Dogs.In her groundbreaking and best-selling book Animals in Translation, Temple Grandin drew on her own experience with autism as well as her distinguished career as an animal scientist to deliver extraordinary insights into how animals think, act, and feel. Now she builds on those insights to show us how to give our animals the best and happiest life—on their terms, not ours.It’s usually easy to pinpoint the cause of physical pain in animals, but to know what is causing them emotional distress is much harder. rawing on the latest research and her own work,Grandin identifies the core emotional needs of animals. Then she explains how to fulfill them for dogs and cats, horses, farm animals, and zoo animals.Whether it’s how to make the healthiest environment for the dog you must leave alone most of the day, how to keep pigs from being bored, or how to know if the lion pacing in the zoo is miserable or just exercising, Grandin teaches us to challenge our assumptions about animal contentment and honor our bond with our fellow creatures.Animals Make Us Human is the culmination of almost thirty years of research, experimentation, and experience.This is essential reading for anyone who’s ever owned, cared for, or simply cared about an animal.", "title": "Animals Make Us Human: Creating the Best Life for Animals", "url": "https://www.goodreads.com/book/show/4386485.Animals_Make_Us_Human_Creating_the_Best_Life_for_Animals", "average": 3.99, "cover": "https://images.gr-assets.com/books/1348264535l/4386485.jpg", "reviews": 732, "authors": [{"url": "https://www.goodreads.com/author/show/1567.Temple_Grandin", "name": "Temple Grandin"}, {"url": "https://www.goodreads.com/author/show/1431310.Catherine_Johnson", "name": "Catherine  Johnson"}], "type": ["Nonfiction", "Animals", "Science", "Animals", "Psychology"], "outlinks": ["http://www.goodreads.com/book/show/4386485-animals-make-us-human", "http://www.goodreads.com/book/show/6358621-animals-make-us-human", "http://www.goodreads.com/book/show/18865901-animals-make-us-human", "http://www.goodreads.com/book/show/103408.Thinking_in_Pictures", "http://www.goodreads.com/book/show/7366.Animals_in_Translation", "http://www.goodreads.com/book/show/16056498-the-autistic-brain", "http://www.goodreads.com/book/show/3394503-the-way-i-see-it", "http://www.goodreads.com/book/show/2299.Emergence"]}