{"ratings": 514728, "userreviews": [{"userName": "Nataliya", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "As a daughter of a Russian literature teacher, it seems I have always known the story of Anna Karenina: the love, the affair, the train - the whole shebang. I must have ingested the knowledge with my mother's milk, as Russians would say.............My grandpa had an old print of a painting hanging in his garage. A young beautiful mysterious woman sitting in a carriage in wintry Moscow and looking at the viewer through her heavy-lidded eyes with a stare that combines allure and deep sadness. \"Who's that?\" I asked my grandpa when I was five, and without missing a beat he answered, \"Anna Karenina\". Actually, it was \"A Stranger\" by Ivan Kramskoy (1883) - but for me it has always remained the mysterious and beautiful Anna Karenina, the femme fatale of Russian literature. (Imagine my childish glee when I saw this portrait used for the cover of this book in the edition I chose!) **Yet, \"Anna Karenina\" is a misleading title for this hefty tome as Anna's story is just the tip of an iceberg, as half of the story is devoted to Konstantin Levin, Tolstoy's alter ego (Count Leo's Russian name was Lev. Lev --> Levin), preoccupied with Russian peasantry and its relationship to land, as well as torn over faith and his lack of it, Levin whose story continues for chapters after Anna meets her train. But Anna gives the book its name, and her plight spoke more to me than the philosophical dealings of an insecure and soul-searching Russian landowner, and so her story comes first. Sorry, Leo Levin.Anna's chapters tell a story of a beautiful married woman who had a passionate affair with an officer and then somehow, in her quest for love, began a downward spiral fueled by jealousy and guilt and societal prejudices and stifling attitudes. \"But I'm glad you will see me as I am. The chief thing I shouldn't like would be for people to imagine I want to prove anything. I don't want to prove anything; I merely want to live, to do no one harm but myself. I have the right to do that, haven't I?\"On one hand, there's little new about the story of a forbidden, passionate, overwhelming affair resulting in societal scorn and the double standards towards a man and a woman involved in the same act. Few readers will be surprised that it is Anna who gets the blame for the affair, that it is Anna who is considered \"fallen\" and undesirable in the society, that it is Anna who is dependent on men in whichever relationship she is in because by societal norms of that time a woman was little else but a companion to her man. There is nothing new about the sad contrasts between the opportunities available to men and to women of that time - and the strong sense of superiority that men feel in this patriarchial world. No, there is nothing else in that, tragic as it may be.\"Anything, only not divorce!\" answered Darya Alexandrovna.\"But what is anything?\"\"No, it is awful! She will be no one's wife, she will be lost!\"*No, where Lev Tolstoy excels is the portrayal of Anna's breakdown, Anna's downward spiral, the unraveling of her character under the ingrained guilt, crippling insecurity and the pressure the others - and she herself - place on her. Anna, a lovely, energetic, captivating woman, full of life and beauty, simply crumbles, sinks into despair, fueled by desperation and irrationality and misdirected passion. \"And he tried to think of her as she was when he met her the first time, at a railway station too, mysterious, exquisite, loving, seeking and giving happiness, and not cruelly revengeful as he remembered her on that last moment.\"A calm and poised lady slowly and terrifyingly descends into fickle moods and depression and almost maniacal liveliness in between, tormented by her feeling of (imagined) abandonment and little self-worth and false passions which are little else but futile attempts to fill the void, the never-ending emptiness... This is what Tolstoy is a master at describing, and this is what was grabbing my heart and squeezing the joy out of it in anticipation of inevitable tragedy to come.\"In her eyes the whole of him, with all his habits, ideas, desires, with all his spiritual and physical temperament, was one thing—love for women, and that love, she felt, ought to be entirely concentrated on her alone. That love was less; consequently, as she reasoned, he must have transferred part of his love to other women or to another woman—and she was jealous. She was jealous not of any particular woman but of the decrease of his love. Not having got an object for her jealousy, she was on the lookout for it. At the slightest hint she transferred her jealousy from one object to another.\"Yes, it's the little evils, the multitude of little faces of unhappiness that Count Tolstoy knows how to portray with such sense of reality that it's quite unsettling - be it the blind jealousy of Anna or Levin, be it the shameless cheating and spending of Stiva Oblonsky, be it the moral stuffiness and limits of Arkady Karenin, the parental neglects of both Karenins to their children, the lies, the little societal snipes, the disappointments, the failures, the pervasive selfishness... All of it is so unsettlingly well-captured on page that you do realize Tolstoy must have believed in the famous phrase that he penned for this book's opening line: \"Happy families are all alike; every unhappy family is unhappy in its own way.\"Tolstoy is excellent at showing that, despite what we tend to believe, getting what you wanted does not bring happiness. \"Vronsky, meanwhile, in spite of the complete realization of what he had so long desired, was not perfectly happy. He soon felt that the realization of his desires gave him no more than a grain of sand out of the mountain of happiness he had expected. It showed him the mistake men make in picturing to themselves happiness as the realization of their desires. \"*And yet, just like in real life, there are no real villains, no real unsympathetic characters that cause obstacles for our heroes, the villains whom it feels good to hate. No, everyone, in addition to their pathetic little ugly traits also has redeeming qualities. Anna's husband, despite appearing as a monster to Anna after her passionate affair, still is initially willing to give her the freedom of the divorce that she needs. Stiva Oblonsky, repulsive in his carelessness and cheating, wins us over with his gregarious and genuinely friendly personality; Anna herself, despite her outbursts, is a devoted mother to her son (at least initially). Levin may appear to be monstrous in his jealousy, but the next moment he is so overwhelmingly in love that it's hard not to forgive him. And I love this greyness of each character, so lifelike and full.And, of course, the politics - so easily forgettable by readers of this book that carries the name of the heroine of a passionate forbidden affair. The dreaded politics that bored me to tears when I was fifteen. And yet these are the politics and the questions that were so much on the mind of Count Tolstoy, famous to his compatriots for his love and devotion to peasants, that he devoted almost half of this thick tome to it, discussed through the thoughts of Konstantin Levin. *Levin, a landowner with a strong capacity for compassion, self-reflection and curiosity about Russian love for land, as well as a striking political apathy, is Tolstoy's avatar in trying to make sense of a puzzling Russian peasantry culture, which failed to be understood by many of his compatriots educated on the ideas and beliefs of industrialized Europe. \"He considered a revolution in economic conditions nonsense. But he always felt the injustice of his own abundance in comparison with the poverty of the peasants, and now he determined that so as to feel quite in the right, though he had worked hard and lived by no means luxuriously before, he would now work still harder, and would allow himself even less luxury.\"I have to say - I understood his ideas more this time, but I could not really feel for the efforts of the devoted and kind landowner striving to understand the soul of Russian peasants. Maybe it's because I mentally kept fast-forwarding mere 50 years, to the Socialist Revolution of 1917 that would leave most definitely Levin and Kitty and their children dead, or less likely, in exile; the revolution which, as Tolstoy almost predicted, focused on the workers and despised the loved by Count Leo peasants, the revolution that despised the love for owning land and working it that Tolstoy felt was at the center of the Russian soul. But it is still incredibly interesting to think about and to analyze because even a century and a half later there's still enough truth and foresight in Tolstoy's musings, after all. Even if I disagree with so many of his views, they are still thought-provoking, no doubts about it.\"If he had been asked whether he liked or didn't like the peasants, Konstantin Levin would have been absolutely at a loss what to reply. He liked and did not like the peasants, just as he liked and did not like men in general. Of course, being a good-hearted man, he liked men rather than he disliked them, and so too with the peasants. But like or dislike \"the people\" as something apart he could not, not only because he lived with \"the people,\" and all his interests were bound up with theirs, but also because he regarded himself as a part of \"the people,\" did not see any special qualities or failings distinguishing himself and \"the people,\" and could not contrast himself with them.\"========================It's a 3.5 star book for me. Why? Well, because of Tolstoy's prose, of course - because of its wordiness and repetitiveness. Yes, Tolstoy is the undisputed king of creating page-long sentences (which I love, by the way - love that is owed in full to my literature-teacher mother admiring them and making me punctuate these never-ending sentences correctly for grammar exercises). But he is also a master of restating the obvious, repeating the same thought over and over and over again in the same sentence, in the same paragraph, until the reader is ready to cry for some respite. This, as well as Levin's at times obnoxious preachiness and the author's frequently very patriarchial views, was what made this book substantially less enjoyable than it could have been. --------By the way, there is an excellent 1967 Soviet film based on this book that captures the spirit of the book quite well (and, if you so like, has a handy function to turn on English subtitles): first part is here, and the second part is here. I highly recommend this film.And even better version of this classic is the British TV adaptation (2000) with stunning Helen McCrory as perfect Anna and lovely Paloma Baeza as perfect Kitty."}, {"userName": "Terry", "userReviewDate": "Apr 27, 2008", "userURL": "http://www.goodreads.com/user/show/306725-terry", "userReview": "In the beginning, reading Anna Karenin can feel a little like visiting Paris for the first time. You’ve heard a lot about the place before you go. Much of what you see from the bus you recognize from pictures and movies and books. You can’t help but think of the great writers and artists who have been here before you. You expect to like it. You want to like it. But you don’t want to feel like you have to like it. You worry a little that you won’t. But after a few days, you settle in, and you feel the immensity of the place opening up all around you. You keep having this experience of turning a corner and finding something beautiful that you hadn’t been told to expect or catching sight of something familiar from a surprising angle. You start to trust the abundance of the place, and your anxieties that someone else will have eaten everything up before your arrival relax. (Maybe that simile reveals more about me than I’d like.)My favorite discovery was the three or four chapters (out of the book’s 239) devoted to, of all things, scythe mowing—chapters that become a celebratory meditation on physical labor. When I read those chapters, I felt temporarily cured of the need to have something “happen” and became as absorbed in the reading as the mowers are absorbed in their work. Of course, the book is about Anna and Vronsky and Levin and Kitty and Dolly and poor, stupid Stepan Arkadyich. It’s about their love and courtship and friendship and pride and shame and jealousy and betrayal and forgiveness and about the instable variety of happiness and unhappiness. But it’s also about mowing the grass and arguing politics and hunting and working as a bureaucrat and raising children and dealing politely with tedious company. To put it more accurately, it’s about the way that the human mind—or, as Tolstoy sometimes says, the human soul—engages each of these experiences and tries to understand itself, the world around it, and the other souls that inhabit that world. This book is not afraid to take up any part of human life because it believes that human beings are infinitely interesting and infinitely worthy of compassion. And, what I found stirring, the book’s fearlessness extends to matters of religion. Tolstoy takes his characters seriously enough to acknowledge that they have spiritual lives that are as nuanced and mysterious as their intellectual lives and their romantic lives. I knew to expect this dimension of the book, but I could not have known how encouraging it would be to dwell in it for so long.In the end, this is a book about life, written by a man who is profoundly in love with life. Reading it makes me want to live."}, {"userName": "Navessa", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Brad", "userReviewDate": "Mar 25, 2008", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "WARNING: This is not a strict book review, but rather a meta-review of what reading this book led to in my life. Please avoid reading this if you're looking for an in depth analysis of Anna Karenina. Thanks. I should also mention that there is a big spoiler in here, in case you've remained untouched by cultural osmosis, but you should read my review anyway to save yourself the trouble.I grew up believing, like most of us, that burning books was something Nazis did (though, of course, burning Disco records at Shea stadium was perfectly fine). I believed that burning books was only a couple of steps down from burning people in ovens, or that it was, at least, a step towards holocaust.If I heard the words \"burning books\" or \"book burning,\" I saw Gestapo, SS and SA marching around a mountainous bonfire of books in a menacingly lit square. It's a scary image: an image of censorship, of fear mongering, of mind control -- an image of evil. So I never imagined that I would become a book burner. That all changed the day Anna Karenina, that insufferable, whiny, pathetic, pain in the ass, finally jumped off the platform and killed herself. That summer I was performing in Shakespeare in the Mountains, and I knew I'd have plenty of down time, so it was a perfect summer to read another 1,000 page+ novel. I'd read Count of Monte Cristo one summer when I was working day camps, Les Miserable one summer when I was working at a residential camp, and Shogun in one of my final summers of zero responsibility. A summer shifting back and forth between Marc Antony in Julius Caesar and Pinch, Antonio and the Nun (which I played with great gusto, impersonating Terry Jones in drag) in Comedy of Errors, or sitting at a pub in the mountains while I waited for the matinee to give way to the evening show, seemed an ideal time to blaze through a big meaty classic. I narrowed the field to two by Tolstoy: War and Peace and Anna Karenina. I chose the latter and was very quickly sorry I did.I have never met such an unlikable bunch of bunsholes in my life (m'kay...I admit it...I am applying Mr. Mackey's lesson. You should see how much money I've put in the vulgarity jar this past week). Seriously. I loathed them all and couldn't give a damn about their problems. By the end of the first part I was longing for Anna to kill herself (I'd known the ending since I was a kid, and if you didn't and I spoiled it for you, sorry. But how could you not know before now?). I wanted horrible things to happen to everyone. I wanted Vronsky to die when his horse breaks its back. I wanted everyone else to die of consumption like Nikolai. And then I started thinking of how much fun it would be to rewrite this book with a mad Stalin cleansing the whole bunch of them and sending them to a Gulag (in fact, this book is the ultimate excuse for the October Revolution (though I am not comparing Stalinism to Bolshevism). If I'd lived as a serf amongst this pack of idiots I'd have supported the Bolshies without a second thought).I found the book excruciating, but I was locked in my life long need to finish ANY book I started. It was a compulsion I had never been able to break, and I had the time for it that summer. I spent three months in the presence of powerful and/or fun Shakespeare plays and contrasted those with a soul suckingly unenjoyable Tolstoy novel, and then I couldn't escape because of my own head. I told myself many things to get through it all: \"I am missing the point,\" \"Something's missing in translation,\" \"I'm in the wrong head space,\" \"I shouldn't have read it while I was living and breathing Shakespeare,\" \"It will get better.\" It never did. Not for me. I hated every m'kaying page. Then near the end of the summer, while I was sitting in the tent a couple of hours from the matinee (I remember it was Comedy of Errors because I was there early to set up the puppet theatre), I finally had the momentary joy of Anna's suicide. Ecstasy! She was gone. And I was almost free. But then I wasn't free because I still had the final part of the novel to read, and I needed to get ready for the show, then after the show I was heading out to claim a campsite for an overnight before coming back for an evening show of Caesar. I was worried I wouldn't have time to finish that day, but I read pages whenever I found a free moment and it was looking good. Come twilight, I was through with the shows and back at camp with Erika and my little cousin Shaina. The fire was innocently crackling, Erika was making hot dogs with Shaina, so I retreated to the tent and pushed through the rest of the book. When it was over, I emerged full of anger and bile and tossed the book onto the picnic table with disgust. I sat in front of the fire, eating my hot dogs and drinking beer, and that's when the fire stopped being innocent. I knew I needed to burn this book. I couldn't do it at first. I had to talk myself into it, and I don't think I could have done it at all if Erika hadn't supported the decision. She'd lived through all of my complaining, though, and knew how much I hated the book (and I am pretty sure she hated listening to my complaints almost as much). So I looked at the book and the fire. I ate marshmallows and spewed my disdain. I sang Beatles songs, then went back to my rage, and finally I just stood up and said \"M'kay it!\"I tossed it into the flames and watched that brick of a book slowly twist and char and begin to float into the night sky. The fire around the book blazed high for a good ten minutes, the first minute of which was colored by the inks of the cover, then it tumbled off its prop log and into the heart of the coals, disappearing forever. I cheered and danced and exorcised that book from my system. I felt better. I was cleansed of my communion with those whiny Russians. And I vowed in that moment to never again allow myself to get locked into a book I couldn't stand; it's still hard, but I have put a few aside.Since the burning of Anna Karenina there have been a few books that have followed it into the flames. Some because I loved them and wanted to give them an appropriate pyre, some because I loathed them and wanted to condemn them to the fire. I don't see Nazis marching around the flames anymore either. I see a clear mountain night, I taste bad wine and hot dogs, I hear wind forty feet up in the tops of the trees, I smell the chemical pong of toxic ink, and I feel the relief of never having to see Anna Karenina on my bookshelf again. Whew. I feel much better now."}, {"userName": "Christopher", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/5745485-christopher", "userReview": "In lieu of a proper review of my favorite book, and in addition to the remark that it would be more aptly named Konstantin Levin, I present to you the characters of Anna Karenina in a series of portraits painted by dead white men.Anna Karenina (Lady Agnew of Lochnaw by John Singer Sargent)Alexei Karenin (Portrait of Edouard Manet by Henri Fantin-Latour)Alexei Vronsky (Study of a Young Man by John Singer Sargent)Konstantin Levin (Robert Louis Stevenson and His Wife by John Singer SargentKitty Scherbatsky (Portrait of Julie Manet by Pierre-Auguste Renoir)Stepan Arkadyick Oblonsky (Monsieur Charpentier by Pierre-Auguste Renoir)Dolly Oblonsky (The Marchioness of Downshire by John William Waterhouse)An old muzhik (Tolstoy Plowing by Ilya Yefimovich Repin; yes, that is really a painting of Tolstoy himself, and he looks like what I imagine an old muzhik to look like.)"}, {"userName": "Sammy", "userReviewDate": "May 29, 2007", "userURL": "http://www.goodreads.com/user/show/103544-sammy", "userReview": "People are going to have to remember that this is the part of the review that is entirely of my own opinion and what I thought of the book, because what follows isn't entirely positive, but I hope it doesn't throw you off the book entirely and you still give it a chance. Now... my thoughts:I picked up this book upon the advice of Oprah (and her book club) and my friend Kit. They owe me hardcore now. As does Mr. Tolstoy. This book was an extremely long read, not because of it's size and length necessarily, but because of it's content. More often than not I found myself suddenly third a way down the page after my mind wandered off to other thoughts but I kept on reading... am I the only one with the ability to do that? You know, totally zoning out but continuing to read? The subject I passed over though was so thoroughly boring that I didn't bother going back to re-read it... and it didn't affect my understanding of future events taking place later on in the book.Leo Tolstoy really enjoys tangents. Constantly drifting away from the point of the book to go off on three page rants on farming methods, political policies and elections, or philosophical discussion on God. Even the dialogue drifted off in that sort of manner. Tolstoy constantly made detail of trifling matters, while important subjects that added to what little plot line this story had were just passed over. Here is a small passage that is a wonderful example of what constantly takes place throughout the book:\"Kostia, look out! There's a bee! Won't he sting?\" cried Dolly, defending herself from a wasp.\"That's not a bee; that's a wasp!\" said Levin.\"Come, now! Give us your theory,\" demanded Katavasof, evidently provoking Levin to a discussion. \"Why shouldn't private persons have that right?\"No mention of the wasp is made again. Just a small example of how Tolstoy focuses much more on philosophical thought, and thought in general, more than any sort of action that will progress the story further. That's part of the reason the story took so long to get through.The editing and translation of the version I got also wasn't very good. Kit reckons that that's part of the reason I didn't enjoy it as much, and I am apt to agree with her. If you do decide to read this book, your better choice is to go with the Oprah's Book Club edition of Anna Karenina.The characters weren't too great either and I felt only slightly sympathetic for them at certain moments. The women most often were whiny and weak while the men seemed cruel and judgemental more often than not. Even Anna, who was supposedly strong-willed and intelligent would go off on these irrational rants. The women were constantly jealous and the men were always suspicious.There's not much else to say that I haven't already said. There were only certain spots in the book which I enjoyed in the littlest, and even then I can't remember them. All in all I did not enjoy this book, and it earned the names Anna Crapenina and Anna Kareniblah.But remember this is just one girl's opinion, if it sounded like a book you might enjoy I highly advise going out to read it. Just try and get the Oprah edition."}, {"userName": "Trevor", "userReviewDate": "Jul 28, 2007", "userURL": "http://www.goodreads.com/user/show/124789-trevor", "userReview": "Not since I read The Brothers Karamazov have I felt as directly involved in characters' worlds and minds. Fascinating.I was hooked on Anna Karenina from the opening section when I realized that Tolstoy was brilliantly portraying characters' thoughts and motivations in all of their contradictory, complex truth. However, Tolstoy's skill is not just in characterization--though he is the master of that art. His prose invokes such passion. There were parts of the book that took my breath because I realized that what I was reading was pure feeling: when we realize that Anna is no longer pushing Vronsky away, when Levin proposes to Kitty, and later when Levin thinks about death. The book effectively threw a shroud over me and sucked me in--I almost missed my train stop a couple of times.That being said, there were some parts that were difficult to get through. I felt myself slowing down in Part VI. I was back in through the remainder of the book once I hit Part VII, but I understand how the deep dive into politics and farming can be off-putting. Still, in those chapters Tolstoy's characters are interacting, and it's incredible to see them speak and respond to one another. It's not only worth the trouble, but deep down, it's no trouble at all. It's to be savored, and sometimes we must be forced to slow down and think about the characters' daily life as they navigate around in their relationships.A word about this translation. When I was in college I attempted to read the Constance Garnett translation. I didn't stop because it was awful (I think finals came up, then the holidays, then more classes, etc.). However, I never really felt like the words were as powerful as they should have been. Years later, the only image that stuck in my mind was of Levin meeting Kitty at the ice skating rink. I just never really entered the world of Anna Karenina, perhaps my fault more than anything. However, the diction and sentence construction in Pevear and Volokhonsky's translation is poetic and justifies the title \"masterpiece.\" Through this translation I grew to appreciate Tolstoy not just because he told good, philosophical stories, but because he could do so with utmost subtletly and compactness--yes, I think Tolstoy is concise. Each word has its place.Understandably, many are unwilling to give themselves to this book. Many expect it to do all of the work. But it's an even better read because if the reader works, the experience of reading this book is incredible."}, {"userName": "Brina", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "A few months ago I read Anna in the Tropics, a Pulitzer winning drama by Nilo Cruz. Set in 1920s Florida, a lector arrives at a cigar factory to read daily installments of Anna Karenina to the workers there. Although the play takes place in summer, the characters enjoyed their journey to Russia as they were captivated by the story. Even though it is approaching summer where I live as well, I decided to embark on my own journey through Leo Tolstoy's classic nineteenth century classic novel. Although titled Anna Karenina after one of the novel's principle characters, this long classic is considered Tolstoy's first 'real' novel and his take on a modernizing country and on people's lives within it. The novel begins as Anna Karenina arrives in Moscow from Petersburg to help her brother and sister-in-law settle a domestic dispute. Members of Russia's privileged class, Darya \"Dolly\" Alexandrovna discovers that her husband Stepan Arkadyich \"Stiva\" Oblonsky has engaged in an affair with one of their maids. Affairs being a long unspoken of part of upper class life, Dolly desires to leave her husband along with their five children. Anna pleads with Dolly to reconcile, and the couple live a long, if not tenuous, marriage, overlooking each other's glaring faults. While settling her brother's marriage, Anna is reminded of her own unhappy marriage, setting the stage for a drama that lasts the duration of the novel. Tolstoy sets the novel in eight parts and short chapters with three main story lines, allowing for his readers to move quickly through the plot. In addition to Stiva and Dolly, Tolstoy introduces in part one Dolly's sister Kitty Shcherbatsky, a young woman of marriageable age who is forced to choose between Count Vronsky and Konstantin Dmitrich Levin. At a ball in Kitty's honor, Vronsky is smitten with Anna, temporarily breaking Kitty's heart. Even though Levin loves Kitty with his whole heart, Kitty refuses his offer in favor of Vronsky, and falls into a deep depression. Levin, seeing the one love of his life reject him, vows to never marry. Anna becomes a fallen woman and rejects her husband in favor of Vronsky, fathering his child, leaving behind the son she loves. Even those closest to her, including family members, are appalled. A G-D fearing woman in a religious society is supposed to view marriage as sacred. Yet, Anna does not value her loved ones' advice and chooses to live with Vronsky. Despite a comfortable, upper class life, Anna is in constant internal turmoil. Spurned by a society that clings to its institutions as marriage and the church, Anna chooses love yet isolation from all but Vronsky and their daughter. Her ex-husband is viewed as a strict adherent to the law, cold, and unsympathetic, and will not grant a divorce. Even though Anna is clearly in the wrong, Tolstoy has his readers sympathizing with her situation, rooting for a positive outcome. He brings to light the plight of lack of women's rights, especially in regard to divorce, and has one hoping that Russia changes her ways as she modernizes. If Anna's situation sheds light on the worst of Russian society and Dolly's reveals its stagnation, then Kitty, who later marries Levin, shows how the country begins to modernize. Kostya and Kitty marry for love, rather than gains in society. Believed by many to be Tolstoy's alter ego, Levin is an estate farmer who is well aware of the rights of his tenant farmers called muzhiks. Along with his brother Sergei Ivanovich, Levin works toward agrarian reform. Both men, Sergei Ivanovich especially, is swept up in the communist ideals that are beginning to form, in rejection of the tsarist governing of the country. Tolstoy diverges pages at a time to farming reforms and one can see in these pages his own beliefs for the future of Russia in the late 19th century. Through the three principle couples: Stiva and Dolly, Vronsky and Anna, and Levin and Kitty, Tolstoy presents the old, changing, and new Russia. Having Levin introduce farming mechanisms from the west and Vronsky participate in a Slavic war, Tolstoy presents a Russia that is no longer completely isolated. He reveals how communism begins to shape up as farmers are no longer happy as tenants and many privileged classes adhere to newer values. Meanwhile, through Dolly, Anna, and Kitty, Tolstoy also presents how a woman's role in this society changes, including schooling and her place in a marriage. As the twentieth century nears, Russian life is no longer set in antiquated ways. Had I not read a drama set in the tropics, I most likely would not have journeyed to 19th century Russia. I enjoyed learning about Leo Tolstoy's views on life there and how he saw late 19th century Russia as a changing society. I found the plight his title character depressing while reading about Levin and Kitty to be uplifting as Russia moves toward the future. Tolstoy's words are accessible in spite of the novel's length, a testament to the stellar translation done by Richard Pevear and Larissa Volokhonsky. A true classic, I enjoyed my time with the characters in Anna Karenina, and rate Tolstoy's premier novel 5 shining stars."}, {"userName": "Nayra.Hassan", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "ساجعلكم تتعاطفون مع أسوأ نموذج بشريبل ستبكون💧من أجلها ايضا..هتف تولستوى لتولد رواية أشبه بالدولاب المزدحم المكدس بالاغراض . ..ما ان تفتحه فجأة حتى تقفز شخصيات كثيرة و غنية في وجهك ..بجانب الثلاثي الشهير انا و أليكسي و اليكسي ..يوجد اربع أبطال اخرين ..الفصول تبدا بالخيانة و لكنها خيانة رجل!!ثم تلطمك الاحداث الحافلة بالنقد الاجتماعي و السياسي..و الاستطرادات الذكيةتحدى تولستوى أصدقاؤه عندما سالهم عن البطلة الأسوأ و الاقل تعاطفا..فاكدوا انها المرأة الخائنة بالطبع..فبدأ ملحمته الكبرى الثانية.. .التي حملت بين طياتها بذرة الخلودكل العائلات السعيدة تتشابه..و لكن كل عائلة تعيسة ..هي تعيسة بطريقتها الخاصةتلك الافتتاحية الصادقة ستظل الأكثر شهرة على الاطلاق..تمت كتابة انا كارنينا على 8اجزاء في عامين..تاخرت البطلة عن الظهور لاكثر من 150 صفحة بدأ ظهورها في القطار و انتهت قصتها معه ايضا في رمزية بارعةهنا لا توجد اقتباسات لا تنسى ..و لا احداث حافلة ..بل حياة حقيقية بمشاغلها و اعرافها.. برتباتها و مللها..مليئة بالمشاعر و الأراء ..دموع.. و ندم ..صدرت بعد سنوات من مدام بوفاري و لكن شتان..شتان..قد يكون اسلوب فلوبير أكثر عبقرية و لكن ستتعاطف مع \"انا \" و تلعن بوفاريتولستوي حكم اخلاقيا على انا..مع انه منحها اسبابا عدة للسقوط..الا انه لم يتركها تستمريء الخيانة و هي متنعمة بخير زوجها..بل سرعان ما رحلت لتخسر كل شيء ..لتعي بطلتنا جيدا كيف يتسامح المجتمع مع الرجل..بينما هي..هي ؟؟الرواية تصلح كدرس مضاد للرومانسية..قاسيا لأبعد الحدودقراءة الف صفحة قرار ليس بهين..قدتتعاطف مع الأبطال او تكرههمو لكن تأكد انك ستمنحهم فرصة للحياة في ذاكرتك للابد"}, {"userName": "Brett", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/1121514-brett", "userReview": "Alright, I'm going to do my best not to put any spoilers out here, but it will be kind of tough with this book. I should probably start by saying that this book was possibly the best thing I have ever read.It was my first Tolstoy to read, and the defining thing that separated what he wrote from anything else that I've read is his characters. His characters are unbelievably complex. The edition of this book that I read was over 900 pages, so he has some time to do it. His characters aren't static, but neither are they in some kind of transition from A to B throughout the book. They are each inconsistent in strikingly real ways. They think things and then change their minds. They believe something and then lose faith in it. Their opinions of each other are always swirling. They attempt to act in ways that align with something they want, but they must revert back to who they are. But who a character is is a function of many things, some innate and some external and some whimsical and moody.So all the characters seem too complex to be characters in a book. It's as if no one could write a character that could be so contradictory and incoherent and still make them believable, so no one would try to write a character like Anna Karenina. But people are that complex, and they are incoherent and that's what makes Tolstoy's characters so real. Their understandings of each other and themselves are as incoherent as mine of those around me and myself.One of the ways that Tolstoy achieves this is through incredible detail to non-verbal communication. He is always describing the characters movements, expressions, or postures in such a way that you subtly learn their thoughts. He does an amazing job in the internal monologues the characters experience. You frequently hear a character reason with himself and reveal his thoughts or who he is to you in some way, and all the while you feel like you already knew that they felt that or were that. Even as the characters are inconsistent. There are times when he can describe actions that have major implications on the plot with blunt and simple words and it still felt rich because the characters are so full. The book takes on love, marriage, adultery, faith, selfishness, death, desire/attraction, happiness. It also speaks interestingly on social classes or classism. He also addresses the clash between the pursuit of individual desires and social obligations/restraints. There is just so much to wrestle with here.And you go through a myriad set of emotions and impressions of the characters as you read. At times you can love or hate or adore a character. You can be ashamed of or ashamed for or reviled by or anxious with or surprised by a character. And you feel this way about each of them at points. But it isn't at all a roller coaster ride of emotion. It's fluid and natural and makes sense. One of the many points that the book seemed to reach to me was the strength and power of love. Tolstoy displays it in all its power and all its inability. In the end love is not sufficient enough to sustain. He writes tremendous triumphs for it, and then he writes the months after when the reality of human failings set in. But love is good, and there is hope. Life can be better with love in it. Should I have kids one day I think I'll make reading this book a precondition for them to start dating (that and turning 25).I was also surprised by a section towards the end of the book where Tolstoy through Levin, my favorite character and the one that I identified with the most, makes a case for Christianity that was so simple but at the same time really impacted me. I guess I'll leave that alone here.Basically, I don't have high enough praise for this book. I hope everyone reads it. It is very long, and I found the third quarter or so slow. But I could definitely read it again. Not soon but it could become a must read every 15 years or so for me. Between he nature of the content and the quality of the words, I would say that this is the greatest masterpiece in words that I've ever found."}, {"userName": "İntellecta", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/67897611-ntellecta", "userReview": "Tolstoy draws a portrait of three marriages or relationships that could not be more different. Anna Karenina is rightly called a masterpiece. Moreover Tolstoy does not spare on social socialism and describes the beginnings of communism, deals with such existential themes as birth and death and the meaning of life.Tolstoy’s narrative art and his narrative charm are at the highest level. He also seems like a close observer of human passions, feelings and emotions. All in all I was touched by his book because it was one of the most impressive books I have ever read.\"Kendi yüceliğinin yüksekliğinden bana bakmasına bayılıyorum\". Sayf 55\"Belki de sahip Olduğum şeylere sevindiğim, sahip olmadıklarıma da üzülmediğim için mutluyum.\"Sayf 167\"Kadın dediğin öyle bir yaratık ki istediğin kadar incele, gene de hiç bilmediğin yanlarıyla karşılaşıyorsun...\"Sayf 168\"Insana akıl, onu huzursuz eden şeylerden kurtulması için verilmiştir.\"Sayf. 758"}, {"userName": "Kevin Ansbro", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/43579369-kevin-ansbro", "userReview": "\"Leo Tolstoy would meet hatred expressed in violence by love expressed in self-suffering.\"\n—Mahatma GandhiThrough reading this praiseworthy classic, I have been forced to recalibrate my previously unreliable view of this celebrated author.You see, I was force-fed Tolstoy at college (his writing, not his flesh, silly! Mine wasn't a college for cannibals!) and at the time only carried War and Peace under one arm so I might appear cleverer than I actually was.So, how amazed was I that Anna K has shown me the fun side to Leo T? He is slyly hilarious. How did I not know this?Please note that I haven't read this novel in Russian Cyrillic. I acknowledge that my perception owes a great deal to the amazing interpretive work of the translators, but let's imagine that we in the West have enjoyed his work as the great man intended.The title is something of a misnomer and doesn't do justice to an endearing love story that also captures the disparity between city and country life in 19th-century Russia.For a start, Anna K isn't the star of the show. That billing falls to our anti-hero, Konstantin Dmitrich Levin, a socially awkward, highly-intelligent loner who considers himself to be an ugly fellow with no redeemable qualities. Despite being weighed down by all this existential angst, he worships Kitty Shcherbatskaya, an attractive young princess whom he believes to be out of his league.Kitty is described as being \"as easy to find in a crowd as a rose among nettles.\"Tolstoy goes to great lengths to make us understand the inner workings of Levin's mind (For Tolstoy, read Levin: they are one and the same). Levin's love rival, raffishly handsome Count Vronsky, couldn't be more dissimilar. He is socially adept and careful not to offend, whereas Levin could probably start an argument with a goldfish.What a fabulous read this is.Tolstoy's levity and perspicacity shines from every page and the badinage between the main characters is exquisitely observed.He does though have an idiosyncratic way of writing: adjectives are thickly laid on with a trowel and he loves to use repetition to emphasise a point.Anna herself is fascinating, and to affirm just how fascinating she is, Tolstoy employs the word fascinating seven times in one paragraph! Look! I've even started doing it myself! How fascinating!When not beating you about the head with repetition, the Russian master can do majestic descriptive imagery as good as anyone. One simple scene, where Kitty collapses into a low chair, her ball gown rising about her like a cloud, was just perfectly captured.This is a wonderful story of fated love and aristocratic hypocrisy.Tolstoy uses Levin as his political mouthpiece to rail against the ills of late 19th-century Russia, and the author's philosophy of non-violent pacifism also had a direct influence on none other than Mahatma Gandi.Anna Karenina is often cited as 'one of the best books ever written'.So who am I to disagree?"}, {"userName": "Emily May", "userReviewDate": "Dec 09, 2010", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "This is a book that I was actually dreading reading for quite some time. It was on a list of books that I'd been working my way through and, after seeing the size of it and the fact that 'War And Peace' was voted #1 book to avoid reading, I was reluctant to ever get started. But am I glad that I did.This is a surprisingly fast-moving, interesting and easy to read novel. The last of which I'd of never believed could be true before reading it, but you find yourself instantly engrossed in this kind of Russian soap opera, filled with weird and intriguing characters. The most notable theme is the way society overlooked mens' affairs but frowned on womens', this immediately created a bond between myself and Anna, who is an extremely likeable character. I thought it had an amazing balance of important meaning and light-heartedness. Let's just say, it's given me some courage to maybe one day try out the dreaded 'War And Peace'."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "840. Анна Каренина = Anna Karenina, Leo TolstoyAnna Karenina (Russian: Анна Каренина) is a novel by the Russian writer Leo Tolstoy, published in serial installments from 1873 to 1877 in the periodical The Russian Messenger. Tolstoy clashed with editor Mikhail Katkov over political issues that arose in the final installment (Tolstoy's negative views of Russian volunteers going to fight in Serbia); therefore, the novel's first complete appearance was in book form in 1878.Characters:  Princess Ekaterina \"Kitty\" Aleksandrovna Shcherbatskaya, Anna Arkadyevna Karenina, Count Aleksei Kirillovich Vronsky, Konstantin \"Kostya\" Dmitrievitch Levin, Prince Stepan \"Stiva\" Arkadyevitch Oblonskyعنوان: آنا کارنینا نویسنده: لئو ن. تولستوی (نیلوفر) ادبیات روسیه؛ انتشاراتیها: ساحل، نیلوفر، کلبه سفید، سمیر، گوتنبرگ؛ تاریخ نخستین خوانش: روز بیست و چهارم ماه فوریه سال 1985 میلادیعنوان: آنا کارنینا؛ نویسنده: لئو ن. تولستوی؛ مترجم: محمدعلی شیرازی؛ تهران، ساحل، 1348، در 346 صعنوان: آنا کارنینا؛ نویسنده: تولستوی؛ مترجم: سروش حبیبی؛ تهران، نیلوفر، 1378، در 1024 ص، در 2 جلد، شابک: 9644481127؛عنوان: آنا کارنینا؛ نویسنده: تولستوی؛ مترجم: فرناز آشتیانی؛ تهران، کلبه سفید، 1383، در 496 ص، شابک: 9649360166؛عنوان: آنا کارنینا؛ نویسنده: تولستوی؛ مترجم: قازار سیمونیان؛ تهران، سمیر، گوتنبرگ، چاپ چهارم 1388، در 864 ص، شابک: 9789646552364؛بیش از نیمی از داستان درباره ی آنا کارنینا ست. باقی درباره ی فردی به نام «لوین» است، البته که این دو شخصیت در داستان رابطه ی دورادوری با هم دارند. به‌ عبارتی، آنا کارِنینا خواهرِ دوستِ لوین است. در طولِ داستان، این دو شخصیت تنها یک بار و آنهم در اواخرِ داستان با هم رودررو می‌شوند. پس، رمان تنها به زندگی آنا کارِنینا اشاره ندارد، و در آن به زندگی و افکار شخصیت‌های دیگرِ داستان نیز توجه شده‌ است. آنا نام این زن است و کارِنین نام شوهرِ ایشانست، و او به‌ مناسبت نام شوهرش آنا کارِنینا (مؤنثِ «کارِنین») نامیده می‌شود. تولستوی در نوشتن این داستان سعی داشته، برخی افکار خود را در قالب دیالوگ‌های متن، به خوانشگر بباوراند تا او را به فکر وادارد. در قسمت‌هایی از داستان، تولستوی درباره ی شیوه‌ های بهبود کشاورزی، یا آموزش نیز سخن گفته؛ که نشان‌ دهنده ی اطلاعات ژرف نویسنده در این زمینه‌ نیز هست. البته بیان این اطلاعات و افکار، گاهی باعت شده داستان از موضوع اصلی دور و برای خوانشگر خسته‌ کننده شود؛ داستان از آنجا آغاز می‌شود که: زن و شوهری به نام‌های: استپان آرکادیچ، و داریا الکساندرونا؛ با هم اختلافی خانوادگی دارند. آنا کارِنینا، خواهر استپان آرکادیچ است، و از سن‌ پترزبورگ به خانه ی برادرش ــ که در مسکو است ــ می‌آید؛ و اختلاف زن و شوهر را به سامان می‌کند. حضور آنا در مسکو، باعث به وجود آمدن ماجراهای اصلیِ داستان می‌شود... فضای اشرافیِ آن روزگار در داستان حاکم است؛ زمانی که پرنس‌ها و کنت‌ها دارای مقامی والا در جامعه بودند. در کل، داستان روندی نرم و دلنشین دارد؛ و به باور دیگران فضای خشک داستان جنگ و صلح، بر آنا کارنینا حاکم نیست. این داستان، که درون‌مایه‌ ای عاشقانه ـ اجتماعی دارد، پس از جنگ و صلح، بزرگ‌ترین اثر تولستوی بزرگ، به شمار است. ا. شربیانی"}, {"userName": "Kelly", "userReviewDate": "May 24, 2007", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "[ find each other sympathetic. It makes sense that they would. Why must Anna become the witch who ensorcelled him in order to keep pure Levin’s hands clean? It’s insultingly dishonest in a book that otherwise makes a point of truth telling. I know why, actually. It’s about the two things that came above. But I'm still not a fan. (hide spoiler)]"}, {"userName": "Florencia", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/21575078-florencia", "userReview": "[Turn the volume up;open me in new tab]There is a well-known belief that, brimming with the romanticism of bygone days to which reason acquiesces in silence, attempts to explain the elusive nature of human relations. According to this myth, the gods get involved in our existence by using a red cord. In Japanese culture, such cord is tied around the little finger; in China, around the ankle. Be it as it may, that string binds one person to the other; people who were always destined to meet, regardless the place, time or circumstances. The character of this connection varies, since it is not restricted to lovers: the two people whose paths are meant to converge at some point, will make history in some way or another, in any given situation. It is said that the red string might get tangled or stretched but it can never break. If it breaks, then only one person was truly holding that red string. One person and a sensation.Amid all the plausible and unrealistic explanations that might be conceived in order to unravel the true nature of all the encounters we experienced and the ones still awaiting for us, this myth is one of the most poetic ways to try to elucidate their puzzling essence while conveying a lack of randomness in human relations (this certainly goes beyond any rationalization that I could manage to elaborate and that would ultimately be rather pointless). For you could find the person to whom you were always meant to share your life with when you least expect it, no matter your marital status, undoubtedly. And a story that could epitomize this legend took place in 19th-century Russia.Anna Karenina is not merely a story about an ill-fated relationship that begins with one of the most famous lines in classic literature. Admittedly it was prejudice what prevented me from picking up this book for years. I thought it was going to be another mawkish love story that, alongside its many comings and goings, dealt with—and probably romanticized—the theme of adultery. As much as I spent my entire life questioning the dogmas that my surroundings may have tried to impose upon my own fragile set of principles in youth (that slowly became more grounded through the years), a certain vestige may have survived, but I'm not trying to compete with Tolstoy over who has the most moralizing tone, for I judge no one but myself. To sum up, in literature, the idea of infidelity bores me, so if I have to put up with over nine hundred pages of passion, deception, lustful gazes, thrilling rendezvous and any other similar situation... I'd better stick to short stories.So imagine my surprise when I found this substantially complex universe populated by people coming from different backgrounds, following different principles, imbued with many noble qualities and ordinary flaws; all captives of something, be it a required sense of dignity, an observance of decorum, stifling social conventions, the game of honesty and feigned emotions or a religion that ruled over most aspects of their lives. A universe defined by the sacrifice of one's wishes, the rejection of one's true feelings in order to do what is proper. A self-denial attitude to demonstrate compliance with the social rules of the world. Actions intended to safeguard a reputation that might get tarnished by truth or falsehood.I must confess that my lips sarcastically twitched every time I read Tolstoy's effusive meditations on the magnanimous nature of religion and its elevated consequences upon people's behaviour. Oh, 'I want to turn the other cheek, I want to give my shirt when my caftan is taken, and I only pray to God that He not take from me the happiness of forgiveness!' and excerpts as such. At times, I was unable to shake off the impression of a preachy tone that perhaps it was not so, but that my skeptical disposition perceived it anyway. Thankfully, he didn't gush about that too often.Thus, I gave in. I surrendered to the magnificence of his words, unconditionally.Every character has been meticulously developed. They were given strong opinions and even the ones I found slightly weak at first, astonished me later when I read their poignant musings, especially when it came to women and their role in both family and society. The idea of (preferably) attractive women whose main job is to give birth, bear with husbands of libertine inclinations and accept their inability to form any opinion worth hearing because nature (un)fortunately has not endowed them with men's brilliance, has clearly survived the 19th century and still resides in some minds that surely scream progress and common sense.A third-person omniscient narrator takes the lead and introduces us to the world of Anna Arkadyevna Karenina, Karenin's wife, who falls in love with Count Alexei Vronsky, a single, wealthy man. My feelings toward Vronsky gradually changed; I found him rather obnoxious at first—though not as much as Anna’s brother, Stepan Oblonsky, a charming and utterly selfish womanizer married to Darya (‘Dolly’).This narrator (who acquires a suitable tone for each character and even gives voice to the thoughts of their pets) also follows the story of Konstantin Levin and Ekaterina “Kitty” Shcherbatskaya. Needless to say, Levin has become a favorite of mine. Through his actions and way of thinking, some fascinating factors came into play. His riveting conversations—that he maintained while trying to overcome a heart-rending awkwardness, especially when he found himself cornered due to his inability to disentangle his innovative thoughts when discussing philosophical and political issues—and internal monologues are for me the most memorable parts of the entire novel.Anna's story is a faithful account of the pressure caused by social norms and the influence of the Russian Church which combined with other elements eventually brought about a relentless state of blinding jealousy, another theme deeply explored by Tolstoy, along with hypocrisy and the need to resort to appearances to be at least theoretically happy. On the contrary, Levin embodies the simplicity of the countryside life, far away from any display of unnecessary opulence; also the bewilderment regarding bureaucracy and the efforts to grasp the concept behind politics, the difficulties present in his relationship with peasants and, in a global scale, the whole agrarian system in contrast to the perception of progress seen in the city. In addition, we witness his struggles concerning faith, an aspect that immediately drew me in, as I also feel frustrated every time I ponder the essence of our existence, our identity, the acknowledgement of death—mortality salience or a persistent state of fear and anxiety—and how everything is supposed to fit an intricate system based on faith; swinging back and forth between reality and a need to believe in something. This absolutely compelling book showed me another side of Tolstoy. He opened the doors to a world I may recognize since it is not my first Russian novel but that I have barely seen through his eyes for I stubbornly shunned his look for so long. His gifted mind, the uniqueness of his style, the now unmistakable sound of his words thanks to this wonderful translation, the beauty of his language and the sincere nature of his thoughts that were conveyed so eloquently, left an indelible impression on me. Through the characters he has skillfully brought to life, Tolstoy not only shared his views on society and politics, but also his unswerving commitment to do everything in his power to attain a meaningful life. That strenuous search we are always returning to; one that cannot be limited to any time or place since it is intrinsic to human condition. That purpose to which existence might aspire. Something to stimulate our slow, measured pace, often against the flow.Many things lead to that much desired meaning. Many ways that by themselves are insufficient as life, in constant motion as it is, is a complement of them all. Countless roads branching out while we contemplate, with fearful eyes and wavering avidity for they have ramified in so many directions, the one we should choose.There is one clear path that this novel illustrates with unflinchingly compassionate brushstrokes of reality. It is understandable that, seeing how love might deteriorate over time, how a kiss becomes an endless reproach and a word, a way to punish and inflict pain on others in the midst of an atmosphere of self-destruction, might make you realize of how that possibility, that unremitting sense of an ending has been injecting fear into your being through the years and all of the efforts you have made to keep a reassuring distance from everything; echoing infantile attempts at self-preservation. A child stepping into society for the first time, again; learning how to speak and behave accordingly, again. Anna, her ghosts, they all demanded, energetically; others, while yearning for different scenarios, return to the shadows, quietly. Giving too much; receiving halves, too late. Doors are always on the verge of closing; serenely becoming accustomed to nothingness.Even so, amid a myriad of red threads that belong to the vastness of a timeless tapestry, love still constitutes one of the paths that may render a fulfilling life possible.A bedroom adorned with poppy tears is now shrouded in silence. A red string dwelt there once. It connected two people destined to meet; people who lived a thousand lives in the eternity of a second. According to the myth, such string stretched, tangled and stretched again. Until she seized hold of it, hoping for a season of forgiveness.April 01, 16* Also on my blog."}, {"userName": "K.D. Absolutely", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "Summer of 1985. My very manly brother, who rarely read classics, holding and reading a very thick book entitled Anna Karenina. “What is that thick book? Why is he interested on that?” I thought to myself. On the wall by his bed, was a big close up photograph of Sophie Marceau. Around that time, most teenage males in the Philippines were fans of this ever-smiling young lady and her poster was in their bedrooms. Our house was not an exemption. This was before my brother joined the US Navy. A decade after, Marceau played the title role in the most recent movie adaptation of this book. \"Did my brother have a prior knowledge about it?\" I again asked myself.A couple of months back, my other brother gave me the link to The Top Ten: Writers Pick Their Favorite Books. In its list of The Top Ten Books of All Time, Anna Karenina topped it over the other great works: Madame Bovary by Gustave Flaubert; War and Peace by Leo Tolstoy; Lolita by Vladimir Nabokov; Adventures of Huckleberry Finn by Mark Twain; Hamlet by William Shakespeare; The Great Gatsby by F. Scott Fitzgerald; In Search of Lost Time by Marcel Proust; The Stories of Anton Chekhov by Anton Chekhov; and Middlemarch by George Eliot.In random order: Anna Karenina is Norman Mailer’s #1, Tom Wolfe’s #4, David Lodge’s #7, Chris Bohjalian’s #4, Peter Carey’s #6, Alexander McCall Smith’s #1, Francine Prose’s #1, Reynolds Price’s #1. Tom Perrotta’s #2, Susan Minot’s #1 and Claire Messud’s #5. As you can see, many of those are men. For me, this is an indication that this book, even if the title bears a woman’s name and with flowers on its cover (at least this wonderful edition of mine), is not really a woman’s book.Did my brother’s unusual interest on this book intrigue me during that time? Yes. Did The Top Ten list make me finally pick this up? Yes. Considering its length and the one full week of reading (aside from working), was reading this a waste of time that I could have spent reading shorter easier-to-read 2-4 books? Definitely, not. This unputdownable book is worth every minute that I spent on it. So far, in that Top 10 list, I have only read 3 (Lolita, War and Peace and The Great Gatsby) but I can say that Anna Karenina has all the right reasons to be there. However, this book is not for those readers who have no patience in reading thick books. Although for me the vast scope of 19th century Russia is interesting not only for the lifestyle of the people (in the same reason why Austen fans love her books) but also for its historical significance. The book’s milieu (1882-1886) was Russia on its crossroad: few decades later the country became Soviet (Communist) Russia from being Imperial Russia.On its superficial level, the story is about Anna Karenina, a young wife of a Russian government official, Count Alexie who is 15 years her senior. Probably due to their age difference and the fact that theirs was an arranged marriage, they are not happy. This despite the fact that they already have a son. Enter a young handsome military man, Vronsky, who fell in love at first sight with Anna when his mother and she came to St. Petersburg together in a train. Vronsky courts her and the two become lovers and Anna gets pregnant. However, Count Alexie does not want to divorce Anna and asks her to still live with him as a punishment. At that time in Russia, the offending party has the option to grant the divorce and this party takes the possession of the child. Anna cannot part with her son even if she becomes pregnant and later has child with Vronsky. The Imperial Russia at that time has this extreme double standard on morality and the society condemns Anna for sleeping with another man. This reminded me of Diana, Princess of Wales who, when she died in 1997, generated an unbelievable outpouring of public sympathy despite having lovers while still married to Prince Charles. Of course, there were lots of differences between the two but I just wondered what if Princess Diana were in Russia in 1882-1886, would she have generated the same level of public sympathy, let’s say she herself threw her body in front of the speeding train? Parallel to Anna’s life in the book, is Levin’s. Konstantin Dimitrich Levin is a socially awkward but generous-hearted landowner who was first ditched by the woman she loves, Kitty but later wins her heart back. He witnesses the death of his brother, Nicolai Levin and that scene, for me, is the most poignant of all. Well, except the train incident where Anna killed herself. Levin’s life in the book is said to be based on the life of the author, Leo Tolstoy, including the way Tolstoy proposed to his wife in real life. The denouement chapter of the book where Levin realizes that Christianity is the same as the other beliefs in terms of salvation is like having the author Tolstoy sharing his own thoughts about religion and faith. It is the most stirring being philosophical part of the book. Another interesting chapter is the second to the last part with Anna’s stream-of-consciousness prior to committing suicide. This part is said to have inspired the next generation of writers (Virginia Woolf, William Faulkner, and James Joyce who are all my favorites) in the use of this literary technique.For me, the main theme of the book is: \nwe cannot be happy at the expense of other people\n. Happiness comes from within. We should not be happy because of other people’s unhappiness. In the story, Anna and Vronsky thought that they would be happy if they could live together. This did not make them thoroughly happy. Levin thought that having Kitty as his wife would make him happy. He was for awhile happy and yet later he still felt there was something still missing.For the vast Russian panorama. For the strong interesting plot. For the way, Tolstoy developed his characters. For showing us the bits and details of Russian life in the 19th century. For the skillful handling of conflicts and providing stark contrasts. For timeless message on what life, happiness, marriage are all about, be it during his time or even now... I have no doubt that this novel deserves all those stars that Goodreads allows us readers to give. I should have read this right away after my manly brother finished reading his copy a couple of decades ago."}, {"userName": "Dia", "userReviewDate": "Apr 15, 2008", "userURL": "http://www.goodreads.com/user/show/1086452-dia", "userReview": "What turned out to be the most interesting to me as I devoured this lush book was Tolstoy's amazing ability to show how we change our minds, or how our minds just do change -- how enamored we become of a person, a place, a whole population, an idea, an ideal -- and then how that great love, which seemed so utterly meaningful and complete, sours or evaporates just days, hours, or even minutes later -- in short, how truly fickle we are. And at the same time, each of the characters was in some way stable -- they had their particular drives, their needs, their anxieties, which gave their changing passions some kind of coherence and thus gave themselves their \"selves.\" Tolstoy's ability to capture the tiny thoughts that the characters themselves were perhaps unaware of -- preconscious material consisting largely of rationalizations and fears, but also sometimes of genuine compassion -- and to present these thoughts with precision, subtle irony, and tenderness -- was a great delight. (He deals in this preconscious material rather than in unconscious material -- there is nothing symbolic or metaphorical in his writing -- he writes quite naturally of \"things as they are.\" My partner and I enjoyed contrasting him with Kafka.) I also am very glad that I read an unabridged version. Some of my favorite parts of the book didn't involve the title character -- I loved the mowing and hunting sections -- these were the parts where true joy (and meaning, as Levin finds) were found. And I think these are the parts not included in abridged versions."}, {"userName": "Jenn(ifer)", "userReviewDate": "Mar 24, 2012", "userURL": "http://www.goodreads.com/user/show/780933-jenn-ifer", "userReview": "Read the end of Anna Karenina and listen to this song: http://www.youtube.com/watch?v=4mUmdR...It’ll break your heart.When I first completed this book, I sat down at my computer and attempted to review it, and all I could come up with was, “F*ck you, Tolstoy!!” I know that sounds juvenile, but I still have that feeling. I’m so ANGRY with him for what he did to Anna. I’m so angry that we were barely given a chance to know her. (Yes, I'm aware that she's a fictional character who never actually existed. So? She was real to me!) We learn that she’s beautiful and at the same time very insecure. We learn that she is married, but not happily so. We learn that she is a devoted mother to her son, but not to her daughter. We never really get to learn about the depths of Anna. It’s always Anna in relation to a man. Anna and her husband. Anna and Vronsky. Anna and her son. I guess that speaks to the position of women in society during that time period. Women had no identity of their own.What I enjoyed most about this book was Tolstoy's ability to allow the reader to get inside the heads of the characters. We learn so much about them through their thoughts -- their fears, their insecurities, their secrets. By enabling us to connect to the internal dialog of the characters, we are introduced to their humanity. As a reader on the outside looking in, I got so annoyed when a character would put so much emphasis on a look or the tone of voice or a gesture of another. But don't we all do that? Isn't that how we experience the world? Unfortunately, often our assumptions about what a look means or a tone of voice means is inaccurate at best. When we ascribe meaning to these little behavioral nuances (which we all do based on our own baggage, right?) we're saying very little about the other person and everything about ourselves. Tolstoy takes his message to the extreme, sure, but it certainly made me sit back and really think about what I assume about others verses the reality of that person.This book also got me thinking long and hard about what one prioritizes in life. Is it enough to be comfortable and stable, if that comfort and stability mean you are also lonely and dissatisfied? Should we follow our desires and damned be the consequences, no matter what dark rabbit hole they might lead us down? I have to ask myself, am I an Anna or a Kitty? Comfort and contentment or drama and romance: neither of which leaves a person completely satisfied. I don't have any answers. Just many many more questions.The days are short and the nights are cold and stretch out for an eternity. It's the perfect time to pick up this novel, snuggle in and enjoy the world Tolstoy created for you.Five bright, gleaming stars...*** A note about this edition: Luckily I was forewarned NOT to read the introduction before reading the book. The introduction will give away key elements of the plot and thus ruin any surprises the book may have in store for you if you are fortunate, as I was, to not have the ending spoiled for you already."}, {"userName": "Roy Lotz", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "“Anna Karenina,” my friend told me, “is one of the few books that have influenced how I live my life from day to day.”This statement touches on a question I often wonder about: Can reading great fiction make you a better person? I don’t mean to ask whether it can improve your mental agility or your knowledge of the world, for it undoubtedly does. But can these books make you kinder, wiser, more moral, more content? The answer to this question is far from self-evident. And maybe we should be doubtful, when we consider how many disagreeable Shakespeare fans have probably existed. Nevertheless, I suspect that most of us are inclined to say yes, these books do improve us. But how?Here are my answers. First, many great works of fiction tackle the moral question directly: What does it mean to be good? How do you live a good life? What is the point of it all? Dostoyevsky is the exemplary author in this respect, who was intensely, almost morbidly, preoccupied with these questions. Second, great fiction often involves a social critique; many well-known authors have been penetrating guides into the hypocrisies, immoralities, and stupidities of their societies. Dickens, for example, is famous for spreading awareness of the plights of the poor; and Jane Austen performed a similar task in her novels, though much more quietly, by satirizing the narrow, pinched social rules the landed gentry had to abide by. Finally, we come to great literature’s ability to help us empathize. By imagining the actions, thoughts, feelings, desires, and hopes of another person—a person perhaps from a different time, with different values—we learn to see the world from multiple points of view. This not only helps us to understand others, but also helps us to understand ourselves. And this is important, since a big part of wise living (in my experience at least) involves the ability to see ourselves from a distance, as only one person among many, and to treat ourselves with the same good-natured respect as we treat our good friends. And the master of empathy is undoubtedly Leo Tolstoy.Leo Tolstoy was a contradictory man. He idolized the peasants and their simple life, and he preached a renunciation of worldly riches; and yet he maintained his aristocratic privileges till the end of his life. He considered marriage to be of enormous importance in living a moral life, and yet his relationship with his wife was bitterly unhappy and he ended up fleeing his house to escape. And as Isaiah Berlin pointed out in his essay on Tolstoy’s view of history, he yearned for unity and yet saw only multiplicity in the world. I can’t help attributing this contradictoriness to his nearly supernatural ability to sympathize with other points of view, which caused him to constantly be pulled in different directions.This is on full display in Anna Karenina, but I can’t discuss this or anything else about the book without copious spoilers. So if you are among the handful of people who don’t know the plot already, here is your warning.Like so many authors, Tolstoy here writes about a “fallen” woman who ends up in a bad situation. But unlike anyone else, Tolstoy presents this story without taking any clear moral stance on Anna, her society, her betrayed husband, or her lover. It is, for example, close to impossible to read this simply as a parable of the immoral woman getting her just desserts. What was Anna supposed to do? She would have condemned herself to a life of unhappiness had she stayed with Karenin. And it can hardly be said that she was responsible for her unhappy marriage, since marriages in those days were contracted when women were very young, for reasons of power and wealth, not love. Tolstoy makes this very clear, and as a result this book can be read, in part, as a feminist critique of a society that severely limits the freedom of women and condemns them to live at the mercy of their fathers and husbands.But this is not the whole story. If it is impossible to read this book as a parable of an immoral wife, it is equally impossible to read it as the heroic struggle of a wronged women against an immoral society. Anna is neither wholly right nor wrong in her decision. For in choosing to abandon her husband, she also chooses to abandon her son. Admittedly, it was only the social rules that forced her to make this choice, but the fact remains that she knowingly chose it. What’s more, unlike in Madame Bovary, where the deceived husband is not a sympathetic character, Tolstoy brings Karenin to life, showing us an imperfect and limited man, but a real man nonetheless, a man who was deeply hurt by Anna’s actions.A similar ambiguity can be seen in the relationship between Anna and Vronsky. Tolstoy never makes us doubt that they do truly love one another. This is not the story of vanity or lust, but of tender, affectionate love—a love that was denied Anna for her whole life before her affair. For his part, Vronsky is also neither wholly bad nor good. He wrongs Karenin without any moral scruples; but his love for Anna is so deep—at least at first—that he gives up his respectability, his position in the military, and even his good relationship with his family to be with her. I cannot admire Vronsky, but it is impossible for me to condemn him, just like it is impossible for me to condemn Anna or Karenin, for they were all making the choices that seemed best to them.The final effect of these conflicts is not a critique of society nor a parable of vice, but a portrayal of the tragedy of life, of the unhappiness that inevitably arises when desires are not in harmony with values and when personalities are not in harmony with societies.The other thread of this book—that of Levin and Kitty—is where Tolstoy tells us how to be happy. For Tolstoy, this involves a return to tradition; specifically, this means a return to rural Russian tradition and a concomitant shunning of urban European influence. Levin and Kitty’s happy life in the countryside is repeatedly contrasted with Vronsky and Anna’s unhappy life in the city. Levin is connected with the earth; he knows the peasants and he works with them, while Vronsky only associates with aristocrats. Levin is earnest, provincial, and clumsy, while Vronsky is urbane, cosmopolitan, and suave. Kitty is simple, unreflecting, and pure-hearted, while Anna is well-read, sophisticated, and passionate.The most obvious symbol of Europeanization is the fateful railway. Anna and Vronsky meet in a train station; Vronsky confesses his love to Anna in another train station; and it is of course a train that ends Anna’s life. Levin, by contrast, catches sight of Kitty as he sits in the grass in his farm, while Kitty goes by in a horse-drawn carriage. Anna and Vronsky travel to Italy to see the sights, while for Levin even Moscow is painfully confusing and shallow. This contrast of urban Europe with rural Russia is mirrored in the contrast of atheism with belief. Like Dostoyevsky, Tolstoy attributed the growing disbelief in Christianity to the nefarious influence of the freethinking West. In Tolstoy’s view—and in this respect he’s remarkably close to Dostoyevsky—Russians were mistaken to gleefully import European technologies and modes of thought without paying attention to how appropriate these new arrivals were to Russia. Both Tolstoy and Dostoevsky wanted Russia to develop its own path into the future, a path that relied on an embrace of the Christian ethic, not an attempt to fill the vacuum left by religion with socialism and science. The final scene of this novel—where Levin renounces his old free-thinking ways and embraces Christianity—is the ultimate triumph of Russia over Europe in Levin’s soul. But this is where the book rings the most hollow for me. For here Tolstoy is attempting to put up one mode of life as ideal, while his prodigious ability to see the world from so many points of view makes us doubt whether there is such a thing as an ideal life or one right way of viewing the world. At least for me, Tolstoy's magnificent empathy is the real moral lesson I have taken away from this book. His insights into the minds and personalities of different people is staggering, and I can only hope to emulate this, in my own small way, as I fight the lifelong battle with my own ego."}, {"userName": "Shine Sebastian", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/56189373-shine-sebastian", "userReview": "GREAT, in the highest sense of the word.Characters as deep and alive as the ocean, themes as diverse and as innumerable as grains of sand, a writing as powerful as a thunderstorm, as beautiful as a serene dawn, and as incomprehensible at times and yet all the more fascinating as this mysterious and neverending universe itself, and we have, in my opinion, the greatest work on life, freedom, faith, fate, love, suffering, and the human HEART ... - Anna Karenina!"}, {"userName": "Perry", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Passing Through the Human Passions\"...Let him first cast a stone at her\"I read this Tolstoy masterpiece for the first time five years ago, coming to it with a cynicism formed by my mistaken impression that it was simply about Anna Karenina's terminal adulterous affair and her despicable selfishness toward her son. I thought the novel would, no doubt, effectively demonstrate the tragic consequences of self-centeredness and the absence of a moral compass. Beyond that, I was a cynic.My skepticism was misguided. While Anna K's affair with Count Vlonsky is the primary tale being told, this must be viewed within the context of the novel's three other relationships to appreciate the purified beauty of this masterwork.Both of the Russian Giants (Tolstoy and Dostoevsky) sculpt consistently around themes of the relationship between a husband and a wife;a human's relationship to and with God;the mortal struggles  --of faith versus doubt, and  --of monogamy and morality versus free will and the pleasures of the flesh; and,below the firmament, the ongoing and infinite war between the forces of good and evil.These themes are arguably nowhere more breathtakingly composed for study, contemplation and interpretation for all time, by scholars, thinkers, students and lovers of literature, than in this transcendent tragedy.Anna Karenina's illicit romance with the younger, adonic Count Vronsky is mainscreen. I recall seeing an article shortly after reading this novel revealing that Tolstoy began with the idea of making a fallen married woman, condemned for her actions, sympathetic to readers for her human weaknesses and her lot in life (or something to this effect). He wanted to test Jesus' admonition in the Bible to those about to stone to death a woman caught having sexual relations outside her marriage: \"He that is without sin among you, let him first cast a stone at her.\" John 8:7, KJV. In addition to the eponymous affair, the novel also follows: ^ The verecund, thinking farmer Levin and his courtship of and marriage to the gorgeous, shallow and vestal Kitty (who was once infatuated with Vronsky);^ The mired uxorial partnership between Anna's brother, the unsteady, unfaithful social-hound Stiva Oblonsky and his loyal wife Dolly (Kitty's sister), who is the exemplary, unappreciated mother of his children, and who finds herself having muliebral daydreams of a scorching affair of body and soul with another man; as well as,^ Anna's relationships with her controlling, cuckolded husband Karenin and with her poor, innocent son.Tolstoy created this stunningly gorgeous mindtrip over a terrain he drew in a way that would emotionally drain the reader* and provoke her thoughts and feelings such that she might find an obscure piece of her soul revealed.In my opinion, this is the best novel ever written.*Given my harsh criticism of the novel, a little life by Hanya Yanagihara, as...let's just say...Emotionally Sadistic (by Author Admission), and lengthy discussions I've had about that novel, I should say here that there is a HUGE difference between writing a novel/story with the express intent of inflicting emotional pain on the reader (as the author of a little life has repeatedly admitted and as is evident in the way it's written) and composing a novel that is truthful to the human condition and shows a character in a fallen married woman who Tolstoy wanted to portray in a light sympathetic to readers, testing the Christian admonition about casting the first stone. Let me explain further. Anna Karenina is sad. A suicide seemed the most likely outcome under the circumstances, as it did in a little life. The difference is in the verisimilitude in the former and the lack thereof in the latter. For example, the events leading up to the suicide were not beaten into you over and over and over and over and over. In Anna Karenina, by comparison, the delineation of the terrible circumstances never became gratuitous, grating, annoying, patently manipulative as quickly happened in a little life. I don't believe one can overemphasize the author's statement that when she began writing a little life, she set out to write a novel that would inflict as much emotional pain as she could manage upon the book's readers.. \nI invite, with honorable intentions, Goodreads friends (and readers) to give me examples of acclaimed novels for which the author said something to the effect that when he/she began writing the novel with the idea and purpose of tormenting its readers."}, {"userName": "Arah-Lynda", "userReviewDate": "Apr 20, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "[ Anna’s trajectory is a downward spiral whereas Levin is lifted up to the gates of domestic bliss and contentedness and as a reader my views on each of them mirrored that reversal in trajectory. (hide spoiler)]"}, {"userName": "David Schaafsma", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "Levin (which is what the title should be, since he is the main character, the real hero and the focus of the book!) (But who would read the book with that title, I know!)If you don't want to know the ending, don't read this review, though I won't actually talk about what happens to Anna specifically, something I knew 40 years ago without even reading the book. I didn't read the book to find out what happens to her. I knew that. Probably many of you know or knew the ending before reading the book. And this isn't so much a review as a personal reflection. I was tempted, finally, after decades of NOT reading it, to now, approaching my 60th birthday, finish it, all 818 pages, tempted to just simply write: Pretty good! :) But I resist that impulse, sorry (because now, if you so choose to read on, you will have to read many more than those two words. . .).This is as millions of people have observed over the past 140 years, a really great book, and those of you who are skeptical of reading \"Great Books\" or \"classics\" may still not be convinced, but this has in my opinion a deserved reputation of one of the great works of all time, and one of the reasons it IS so good is because it speaks humbly and eloquently against pomposity and perceived or received notions of \"greatness.\" Why do I care about its place in the canon? I guess I really don't. I just think some books deserve the rep they get from the literary establishment, and some deserve the rep they get from the wider reading public. This one is a great literary accomplishment AND a great read, in my opinion, and deserves to be read and read widely by more than just the English major club. And I say this as one who prefers Dostoevsky to Tolstoy; I prefer stories of anguish and doubt to stories of affirmation and faith, and the atheist/agnostic literary establishment I belong to is maybe always going to favor doubt and anguish over faith and hope and happiness. And this (spoiler alert) surely is a book of faith, of family, of affirmation, of belief in the land, nature, goodness, and simple human joys over the life of \"society\" with all of its pretension. Yes, all that is affirmation is true of the book in spite of what happens to Anna.I write this in particular contexts, as we all do when we read and write. If I had read this book in my more cynical early twenties, when I actually started it once (and again a few times over my life time and never finished), when I had no kids, I might not have liked it much. If I had read this right after Crime and Punishment and The Brothers Karamazov, or in the years I was reading Under the Volcano, Kafka, Camus, what I think of as my existentialist years, I might have found it too. . . life-affirming. But today I have little kids, and as seemed to have happened with Chris Ware, as evidenced by his more positive Building Stories, having kids changed everything for me, and in a good way. In harsh times, you need stories of hope and goodness, and Levin's story is a timeless story of hope and goodness.Another context: I am particularly shaken as I write this by the 20 kids dead in a Connecticut elementary school in Sandy Hook yesterday, with, too, a good teacher, principal, and school psychologist and others who have given their lives to doing good for children, senselessly slaughtered. This is a murderous country, the most murderous in the world, killings devastating my Chicago on a daily basis maybe especially this year, but every damned year. Maybe it is time for a bit of reordering priorities toward goodness, and finishing this book as my news feeds gave me updates on the tragedy provided an interesting contrast in experiences, rendering different but altogether persuasive truths about the nature of the world.Tolstoy was himself, the translator Richard Pevear writes in his fine, brief introduction, in some sense writing a response to the nihilists who were as he saw it in fashion in late nineteenth century Russia, in Moscow, in Europe, in the world. Tolstoy was himself searching for meaning in life and struggling with faith and beliefs in a way he didn't ever struggle about again (or as much) after this book, and the struggle makes for the greatness, in my opinion. His late book Resurrection, by contrast, has none of the struggle about faith that this book has in it. It's mostly a binary world, all Good and Evil, a didactic allegory. Pevear says one of the two main characters, Levin, the country farmer struggling to also write his ideas about farming, is the most fully realized self-portrait that Tolstoy created, and he is on the main pretty delightful. Grumpy at times, stubborn, moody and not witty, a kind of no-nonsense traditionalist I certainly would have been annoyed at regularly if I knew him, Levin is often a kind of comical character, self-deprecatingly clueless as he approaches the Big Events of his life: His brother's death, his proposal to Kitty, the birth of his first child. These are also moments of real angst/anguish and passion and comedy/tragedy, written with great flourish and amazing detail, great sections of the book, pretty thrilling to read, in my opinion. These are, Tolstoy tells us, in the main what life (and literature) is and should be mainly about, love and death, and they deserve loving attention for us, as are also the striving for goodness and faith. The current art scene of the time, in especially Moscow's theater and art and literature scenes, the world of fashion, the culture of massive-debt-incurring spending on a lavish lifestyle, all this Tolstoy skewers through the comical eyes of the simple farmer Levin, who at his best is so attached to the land, to family, to love, to good talk, and good friendship. But he is not a stereotype, he is a great character, fully realized. And what can we say of Anna, the other main character, his sort of opposite? If you want to look for what is in some sense a \"moral\" of the book, it is surely there--if you want to be happy you will want to make choices that Levin makes instead of Anna's tragic choices--but Anna, in having been originally intended by Tolstoy (thanks to Pevear here for his introduction) as an immoral woman, a woman corrupted by city values, is never really just that, any more than Levin can be seen as a holy man. Tolstoy is creating literature here, not a didactic tract, and we see all along that Tolstoy falls in love with Anna as she emerges through his creation of her in his novel, and she is thus for him and us real and fascinating, a human being, and a wondrous one in many ways, one of the great women of literature, without question. You don't have to agree with her choices or like her, but she will come to life for you as few characters ever will.There's one time Tolstoy has his two main characters meet, and this is a great evening, where the simple Levin actually is obviously attracted to Anna in so many ways, and not just the physical attraction all men and women seem to have for her. Levin, like Tolstoy, sees that Anna is vital, viscerally alive, she's fascinating, interesting; okay, she IS a romantic heroine, but she is a romantic heroine that anyone reading romances should read. The women of Wuthering Heights, Jane Eyre, Anna Karenina, Madame Bovary, these are \"romances\" but they are all so much more, that sweep you into the world in richer and deeper ways. Anna Karenina is, like War and Peace, like The Brothers Karamazov, a rich cultural forum, a series of linked meditations on farming and politics and religion and family and relationships and war and the meaning of life, not just about sex and romance. You get so much out of it, as it is all about reflecting on and teaching you how the mundane aspects of our lives are worth paying attention to (I know the bulk of readers absolutely hate the farming and politics sections of the book, but I would contend it is all relevant to Tolstoy's webbed narrative reflection on the meaning of life). And Anna, in the very center of this tale, as a kind of twin contrast to Levin, but not a simple one (they are both suicidal at times; they both are moody and struggle and are essentially lonely for much of the book) is one shimmering, tragic character we can't simply dismiss for submitting to and crushing her life through lust for Vronsky. Though this is true, but she's so much more, too. We come to understand her well, we come to understand why she does what she does and why we must pity her and even support her, love her. I know a lot of people have not come to this position about her, they dismiss her as a shallow twit who throws her life away for an also shallow, callous dashing fellow, but in the end we even come to like Vronsky and pity him, and admire his resilience. He IS also an attractive character, in many ways, in spite of those shallow aspects. And maybe we are sympathetic for them in this forbidden, unwise love. I know I am. We care for them.Of the other main characters, I liked Kitty, Levin's wife (who deals with the dying of her husband's brother so deftly as opposed to her clueless husband) a lot, and who becomes attracted to Vronsky in a way as so may women do. Levin's two brothers are both great, and provide the basis for rich conversations. The Dolly/Oblonsky pair are yet another view of a married relationship. I even like the portrait of the sad, stiff Karenin, the diplomat we can see is a good man, certainly not a great lover for Anna, but we see his struggles and come to feel sorry for him, I think. He's not an ideal match for the passionate Anna, maybe, but he's a good and essentially blameless man. I like all the minor characters we get to meet, too, the people Tolstoy finds more genuine than all the upper crust he mocks and derides and, you know, also cares about. This is a great book, my friends, with some great characters and great scenes. And now to the movie? I read one blurb that said without Tolstoy's gorgeous writing, any movie version of Anna Karenina will only be a soap opera, and that is what I feared. . . and that is what I found in seeing it. The movie couldn't begin to capture Tolstoy's reflections on life and love and birth and death. It was a melodrama, a good one but not great or rich as the novel. And what do English readers miss, as my friends who read Russian and have grown up reading his prose IN Russia say? That his use of the Russian language is unparalleled, gorgeous, breathtaking. Well, I don't know the language in which Tolstoy wrote, but this translation of his tale is pretty amazing, I think. PS I have also recently read Madame Bovary, which I also liked in spite of the main character's (also) bad choices. I liked Anna K even more, though."}, {"userName": "AMEERA ", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "OMG 👏🏼👏🏼👏🏼’"}, {"userName": "jessica", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/10171516-jessica", "userReview": "i am actually only on page 425, but i have decided to take an indefinite hiatus from this book. as i have every intention to continue this, but am unsure when that will be, here are my thoughts on the book so far (just as a note for future me): tolstoy is a master character creator. and although he is very skilled at conveying pre-revolution life and society, i have found much more enjoyment in his characters than the plot. that being said, there is a certain complexity in tolstoys method of storytelling. so far, there hasnt been a clear resolution in sight, which has left me eager to see how the story plays out. overall, this has been beyond enjoyable and, because of that, i feel quite comfortable rating this as such and look forward to when i can resume the story. also, as a side note, i am of the strong opinion that leo was absolutely crazy when he chose the title for this. \n4.5 stars"}, {"userName": "Maria Espadinha", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "Amor, Felicidade, PaixãoA Felicidade é um estado de Amor permanente.Ama-se o sol, o mar, o céu, as nuvens, respirar, caminhar, as flores, o canto dos pássaros...Ama-se, Ama-se, Ama-se!... Simplesmente Ama-se! Contudo, não é por geração espontânea que esse estado de amor iluminado acontece.É sim, um processo gradual.E é aí que o Amor pelo Outro entra em palco!Quando se ama desmedidamente alguém, esse amor transborda - extravasa tocando tudo à nossa volta. Transita por osmose para o Todo que nos rodeia.Sorrimos! Celebramos! Flutuamos!...Parece que tudo à nossa volta mudou, quando afinal quem mudou fomos nós! Sentimo-nos Exuberantes! Eufóricos! Alcançámos o Maior Bem - a Felicidade!Porém, quem - como Karenina e Vronsky - enveredar pelo caminho da pura atracção, da paixão, perde-se sem nunca lá chegar!Mas aqueles que - como Kitty e Levin - optarem pelo caminho do conhecimento mútuo, da compreensão, do respeito... esses sim, têm fortes probabilidades de a alcançar!Paixão é Fogo que se extingue! Amor é Semente que cresce!Paixão é Ansiedade Inquietante! Amor é Paz Radiante!Paixão é sempre a descer! Amor é sempre a subir!...NOTA: Não posso deixar de louvar aqui, a brilhante tradução do casal Guerra, que foi elaborada directamente a partir do russo, conferindo uma maior autenticidade à obra."}, {"userName": "Sidharth Vardhan", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/58296635-sidharth-vardhan", "userReview": "Look it seems to be a favorite novel among so many great novelists - Nabokov, Faulkner, Kundra, Joyce even Dostoevsky but I happen to be more in agreement with Rebecca West when she says, \"And plainly Anna kareinna was written simply to convince Tolstoy that there was nothing in this expensive and troublesome business of adultery\"If you read novels to be at somewhere and sometime else (and don't mind that place to be boring) this will work for you. It is a perfect chronicle of its times. The trouble is I happened to be a very sensual reader. You see I am a book-izer and date a lot of books at same time, and take different books to dinner and bed on same day. Whenever I see a book anywhere I start imagining myself in bed with it and can't help running my hand on its body. And above all, there must be very good reasons if the relationship is to last more than a few days. Unfortunately this one happens to feel like a long, stale marriage.Marriage! I guess that is the real theme of the book rather than adultery. The subject has occupied minds of people for so long that there aren't too many new jokes I can make about it, I mean the best ones like how in case of a murder, the victim's spouse is the foremost suspect are already taken. Moreover, I don't fully understand the concept of marriage - this once I was about to congratulate this newly wed couple but I was just trying to imagine their life after marriage before the chance to do so occurred and ended up saying \"condolences\". That because \"May your souls rest in peace\" seemed like hoping for too much. The reason being that I think of 'being alive' to mean to let your feel all sort of things. Now once a person gets married, (S)he is expected not to feel attracted, fall in love etc outside marriage. And so to that extent the person is dead. And of course, there are all the sacrifces you are supposed to make for your children etc (a lot of people are into that too!) which won't let a person enjoy his/her life fully.Now, it is just the kind of thing that if it wasn't for sake of habit, people would have given up long ago. I still think they will do so someday. If you trust a person, you don't need to bound them, right? With love, my understanding is far worse - I mean if someone loves his/her spouse and want the later to be happy, shouldn't they be more like \"Go on, darling, have some fun!\" instead of jealously guarding them? That, by the way, is Levin's (Anna's antagonist) method - to ask his wife not to meet men with whom she happened to laugh. \n\"Love one another, but make not a bond of love: Let it rather be a moving sea between the shores of your souls...Sing and dance together and be joyous, but let each one of you be alone, Even as the strings of a lute are alone though they quiver with the same music.\"- Kahlil Gibran. \nStill, because of some sort of barbaric instinct the heart wants to hold on to the person, it is invested in, to possess them like objects so as to be sure of their presence in one's life. It seeks promises, unbreakable oaths, until-death-or-divorce-do-us-aparts, more and more bounds - anything to save one from the fear of losing beloved. And where this need for security over each-other's possession is mutual, a marriage takes place. Except, of course, all such promises are useless, no one can control his/her feelings by choice, and so no should ask the other or promise such a thing. In fact, everything people do to gain security (or whatever form) only feeds the feeling of insecurity. Only insecure and untrusting people seem promises and\"We will bankrupt ourselves in the vain search for absolute security.\" - Dwight D. EisenhowerWhere you presume on security is where you set yourself to fail. All things given in love are gifts and no prices should be asked in return. Karein, Anna's husband realizes this at some point in the story and is able to fight back the famous agony of a cheated husband at least for a while. (If only I was to have a cookie for each book with adultery and jealous spouses un iit I have read, I would have .... you know, diabetes. There should be some kind of restriction on each, like no-mention-of-Hitler-in-debates rule, like a book with an adultery in it doesn't win nobel prizes or something .... but then Marcuez wouldn't have won his prize, you know what, scratch that.)Anyways, Tolstoy's argument against infidelity doesn't seem true to me. Anna didn't suffer because she cheated on her husband. She suffered because of three different reasons at different points. First because she had a conscience which is always a burden. How can feeling guilty about anything can ever serve a purpose is beyond me. Guilt is a monster that like that Greek vulture which constantly fed on heart (of promethus) without ever improving the victim's lot, and conscince is nothing except a set up to create a feeling of guilt among people. And to think there are people who feed this concept to their children! Terrorist never felt guilty of their actions, pregnant teenagers often do. A better world could be created if people teach compassion to their children.Secondly, people she is surrounded with. Many would say those were times times 0 wrong, times are not wrong, people are. Vronsky wants hier, other people think of her as fallen women, the stupid divorce law.Thirdly, in last parts, she feels jealous over Vronsky. It is not a self-induced fear of being cheated as often seen in people who chheat themselves - like Macbeth's fear who being usurper himself constantly fears being usurped, but rather same old insecurity we just talked about. She has given away her son for him. We tax our loved ones for sacrfices we make them for them. It was too great a sacrifice for Vronsky to redeem in anyway except by becoming a homely for her which he couldn't.The novel has a misnomer. It should have been better named Levin, the author stand -in gets more attention than Anna Karreina. We read several boring chapters in which he gives his theories for agriculture, peasant education etc which, though it might make the book more realistic, also makes it much larger and boring than it need be (something similar to what deviations and jokes do to this review). There are several beautiful moments in this novel but they are lost in sea of monotonous realism, a combination which doesn't work with a sensual reader like me. The third star is almost entirely due to last chapters of Anna's life. If it wasn't for that, I would have thought that it is Stockholm syndrome associated with large books that make people love this one."}, {"userName": "Roya", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/12222982-roya", "userReview": "From the Introduction:\n'I am writing a novel,' Tolstoy informed his friend the critic Nikolai Strakhov on 11 May 1873, referring to the book that was to become Anna Karenina. 'I've been at it for more than a month now and the main lines are traced out. This novel is truly a novel, the first in my life...'\nEarlier this year, I came across a quote so attractive, that I thought whatever book it was from was automatically good. In other words, I had to read it.\"I've always loved you, and when you love someone, you love the whole person, as they are, and not as you'd like them to be.\"I was shocked when I found out it was this book. To be fair, I knew next to nothing about it. I had heard about it briefly in The Elegance of the Hedgehog (and its poor adaptation, The Hedgehog) and also from my dad, who's a movie buff. He deemed it as immoral and in other words a \"cheating book\", despite having seen only the film, and said I wouldn't like it. Being human, I looked more and more forward to reading it. Thanks to a friend, I got a very good translation, which made a huge difference. There's nothing quite like disobeying just for the fun of it.I expected an unbearable and dull writing style, but was pleasantly surprised. The only times this book bored me was when it would ramble on too much about trivial details. I'm not conflicted about its length. I don't mind large books, but it can go both ways. Upon finishing a huge book, I can either feel as if it was the perfect length, or as if it could have easily been shortened. With this book, I felt both. The length, though much of it unnecessary, made it all the more beautiful. Despite my ever-persistent impatience, there's a certain charm to it that I've never seen in another book. This undefinable pace that if I could put into words, would be phrased as, \"the pace of life\". I don't even know how to describe something so abstract, but there's something so idyllic about it.The book is noticeably filled to the brim with inner monologues and dialogues. The characters are all very realistic. Some are mean and some are stupid, and if you're lucky, you get both. There were a couple here and there that I liked, but most I didn't. I usually have a problem with this, but here I felt like it didn't matter too much.I'm not keen on romance in the least, but this novel, as Tolstoy put it, is truly a novel. At times it was too philosophical for my liking, but in the end, all loose ends were tied off. It concluded in a surprisingly hopeful and satisfying note. A good way to end the year."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "Leo Tolstoy, Anna Karenina:\"Happy families are all alike; every unhappy family is unhappy in its own way.\"Tolstoy draws us into the tragedy by looking down in disdain at boring, happy families (the Brady family always comes to my mind) and sells his book by deciding that unhappy families provide more variety and thus entertainment, however tragic. From the start, we know that things will end badly, so later when we are introduced to Anna and Vronsky, we are more fascinated by the details on how things will unravel than being surprised at the outcome. The phrase itself is perfectly balanced and stands alone in a separate paragraph - as if he was giving us the moral from the outset. A perfect start to one of the most technically perfect novels of all time - as a matter of fact, Tolstoy considered this to be his true first novel (he considered War and Peace (also an extraordinary read) to be more than just a novel)."}], "description": "'Everything is finished. I have nothing but you now. Remember that'Anna Karenina seems to have everything - beauty, wealth, popularity and an adored son. But she feels that her life is empty until the moment she encounters the impetuous officer Count Vronsky. Their subsequent affair scandalizes society and family alike and soon brings jealously and bitterness in its wake. Contrasting with this tale of love and self-destruction is the vividly observed story of Levin, a man striving to find contentment and a meaning to his life - and also a self-portrait of Tolstoy himself.", "title": "Anna Karenina", "url": "http://www.goodreads.com/book/show/153.Anna_Karenina", "average": 4.03, "cover": "https://images.gr-assets.com/books/1426930853l/153.jpg", "reviews": 19375, "authors": [{"url": "https://www.goodreads.com/author/show/128382.Leo_Tolstoy", "name": "Leo Tolstoy"}, {"url": "https://www.goodreads.com/author/show/3357.Richard_Pevear", "name": "Richard Pevear"}, {"url": "https://www.goodreads.com/author/show/3358.Larissa_Volokhonsky", "name": "Larissa Volokhonsky"}, {"url": "https://www.goodreads.com/author/show/21660.John_Bayley", "name": "John Bayley"}], "type": ["Classics", "Fiction", "Cultural", "Romance", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/153.Anna_Karenina", "http://www.goodreads.com/book/show/155.Anna_Karenina", "http://www.goodreads.com/book/show/5685.Anna_Karenina", "http://www.goodreads.com/book/show/15823480-anna-karenina", "http://www.goodreads.com/book/show/820787.Anna_Karenina", "http://www.goodreads.com/book/show/152.Anna_Karenina", "http://www.goodreads.com/book/show/151.Anna_Karenina", "http://www.goodreads.com/book/show/10134686-anna-karenina", "http://www.goodreads.com/book/show/18306723-anna-karenina", "http://www.goodreads.com/book/show/1778827._", "http://www.goodreads.com/book/show/2487342.Anna_Karenina", "http://www.goodreads.com/book/show/22459966-anna-kar-nina", "http://www.goodreads.com/book/show/6193393-anna-karenina", "http://www.goodreads.com/book/show/656.War_and_Peace", "http://www.goodreads.com/book/show/18386.The_Death_of_Ivan_Ilych", "http://www.goodreads.com/book/show/141077.The_Kreutzer_Sonata", "http://www.goodreads.com/book/show/42641.Resurrection", "http://www.goodreads.com/book/show/655.The_Death_of_Ivan_Ilych_And_Other_Stories", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}