{"ratings": 1049, "userreviews": [{"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "A contemporary retelling of the romance between King Henry the VIII and Anne Boleyn, in which Henry is a wealthy, popular teen destined for political greatness, and Anne is the manic pixie dream girl who ensnares him and threatens to destroy the life he's worked so hard to build.Anne Boleyn.manic pixie dream girlmanic pixie dream girlmanic pixie dream girlI have a bad feeling about this."}, {"userName": "Steph Sinclair", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "Actual rating: 1.5 starsLike most people, I have a strange and unexplainable fascination with all things Tudor, especially Anne Boleyn. Frankly, she was a badass in her own right and impacted English history so much even though this wasn't fully appreciated until many years after her unjust sentencing and beheading. Plus, I happen to love the Showtime TV series \nThe Tudors\n for three very delicious reasons: Jonathan Rhys Meyers, Henry Cavil and Natalie Dormer. Meyers in particular was a spectacular Henry and it made my heart so happy. (Then I saw him in City of Bones earlier this year and had a sad.)So when I happened to see this modern day, teenage retelling of Henry VIII and Anne Boleyn, I was all over that thing like white on rice. I had some questions and reservations as a lot of peeps did, I'm sure, but I held out hope for something awesome. I shouldn't have.Mild spoilers ahead.This is going to sound really harsh, but I'm not sure how else to put it: Anne & Henry is a cheap, watered-down, trivialized, cliché-filled re-imagining of one of the most epic tragedies in English history and I wipe my hands of it.The really sad part? Anne & Henry started off great for me. I really felt like Anne's character captured Anne Boleyn's cunning and confidence perfectly. She was bold, in your face, unapologetic and had sass for days. I loved her character, even until the end. Her slow decent into despair over losing Henry's favor was the strongest point of this novel and the only saving grace, to be frank. Everything else kinda pissed me off like noting else.The biggest issue I had was that Anne & Henry's story just doesn't seem to translate well into a modern day, teenage-angst-filled contemporary. Let me set the scene for you: Henry is the president of his school's student council, an aspiring politician and belongs to one of the most influential families in that community. Anne, on the other hand, is from poorer beginnings, her mother marries into wealth and moves to Henry's community before the start of the novel. No one accepts Anne and her mother, naturally, but of course, Henry notices Anne immediately and can't seem to shake her from his head because she's not like the girls he's used to. >insert dramatic side-eye here< Oh wait... Meyers has a gif for that.If you're familiar with what happened to the real Anne Boleyn, then you already know the bare bones of the plot. Henry's closest friends and confidants don't care for Anne and feel she poses a threat to him. So they conspire to set her up. This part of the book is true to history. But, as I said before, this is much smaller scale. In real life, many people disliked Anne because of her Protestant beliefs and because her relationship with Henry led to him annulling his marriage to Catherine of Aragon, his excommunication from Catholic Church and, eventually, the English Reformation.So how do you do this on a high school scale? Simple answer: you don't because you can't.In Anne & Henry, people dislike Anne because she simply \"doesn't fit in\" and isn't \"the right girl\" for Henry. She also is painted as a bad influence (she rides a motorcycle, drinks, is comfortable in her body [read: slut] and distracts Henry from his future goals of eventually becoming president) and gold digger. Anne doesn't dramatically change Henry's views or the school or the community. She registers as nothing more than a blip on a radar. There's no evidence to suggest ANYONE thought of her after the events in the book. (The only real similarity I could pick out is that favor of the people remained with Catherine throughout the book.) So it's in this way that I wonder what the point was of writing a re-telling? Take out all the historical names and I probably would have pegged this as a random YA contemporary with casual slut-shaming.In many ways, the novel trivialized the real Anne's story because she had bigger problems other than just losing her teenaged boyfriend. I'm not usually a fan of YA novels that rely on the whole \"even though I'm 16 years old, I plan to be with this teen boy forever and ever because I'm in love\" trope. I get that those feelings exist, I do. But those stories fail more often than they succeed for me because I don't connect well with those relationships. And that's pretty much exactly what happens in Anne & Henry. The passion is fast and strong, which, unfortunately, didn't work well with the pacing and made it bodyrock onto the insta-love dance floor. And at one point, I was starting to get frustrated by the lack of sexy times because of all the sexual tension I was getting pounded with (hahah, puns). Thankfully, there is exactly ONE and it's your standard issued fade-to-black scene, and thusly, very anticlimactic.Actually everything about this novel was pretty anticlimactic and after the 50% mark and I struggled to stay interested. Even after the motorcycle accident, which was supposed to be the climax, zero fucks could be conjured. Meyers and I were extremely disappointed.Then the last 75% descended into ultimate frustration because of Henry. Anne & Henry is told in duel point-of-view and we have the unfortunate calamity to be in Henry's head when he's at his worst and being a colossal dick. He blames Anne for their drunken motorcycle accident (because it made him look bad, not because he could have gotten hurt!); blames Anne when his best friend, who he knows she hates, is found in a picture kissing her; blames Anne for the entire Party from Hell even though he knows his friends purposefully got her drunk, set her up and took advantage of her. Then he held a mock trial to expel her from school, her charges ranging from cursing on school grounds to accidentally damaging school property. Such a catch, this one.I know the biggest question here is this: Does Anne lose her head? And to that I answer: yes and no. It's metaphoric and I think the only persons to really grasp the metaphor is Anne and the reader. So by the end, I was angry for Anne's sake because like history, Anne's trial was unjust and a heaping pile of dog shit, but as a modern day retelling, it doesn't conjure up the same amount feelings. Historians can look back at the real Anne's trial and see the holes, but I'd like to think with advancements in science, thinking and hindsight, that helped contribute to the finding of those holes. But Anne & Henry has the benefit of modern technology and hard evidence, most of which Henry had available to him and chose not to use just because and it completely conflicted with the kind of person Ius developed from the beginning.Perhaps the most frustrating part is that I was secretly hoping that Ius would break the mold and give Anne some sort of justice. But maybe the peace of mind comes from the fact that she did not, in fact, literally die in this retelling. Still, it would have been nice to see heads roll...Should you read Anne & Henry? I don't know. It's not a book I can put my seal of approval on, but I won't smack your hand if you were picking it up in a bookstore. I'd definitely say this is one feels like a library rental more than anything else due to the reduction of history's most iconic figures to high school stereotypes. But on the plus side, it's a fairly short read, so there's that. As for me, I'm going to do the same thing I did when I saw Jonathan Rhys Meyer's performance in City of Bones......and pretend it never happened.ARC was provided by the publisher via Edelweiss.More reviews and other fantastical things at Cuddlebuggery."}, {"userName": "Gillian Berry", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/13535966-gillian-berry", "userReview": "A... a contemporary version of Henry VIII and Anne Boleyn's courtship? I am... excited? Confused?Does it end with him chopping her head off?!"}, {"userName": "Jillian (bookishandnerdy)", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/3101094-jillian-bookishandnerdy", "userReview": "THIS WAS AWFUL SO FREAKING AWFUL. I get that this is a modern day retelling of henry tudor and anne boleyn's disastrous relationship but OMG I HATE THIS BOOK SO MUCH.no redeeming characters. i mean if you're going to do a retelling try to put a twist on it. so much slut shaming. I HATE THIS BOOK"}, {"userName": "Isa Cantos (Crónicas de una Merodeadora)", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/20954985-isa-cantos-cr-nicas-de-una-merodeadora", "userReview": "\"A veces son las personas más cercanas quienes más daño nos hacen\".Cuando vi este libro y me enteré de que era un retelling en la actualidad de la tormentosa relación que tuvieron Anne Boleyn y Henry Tudor en el S. XVI estaba emocionadísima porque, después de ver The Tudors y obsesionarme con toda la vida de Henry VIII, sencillamente quería ver qué salía de este experimento. Y vaya fracaso. Ni siquiera pude tomarme el libro como uno de esos que me saca de un parón lector o uno muy sencillo que leo para respirar entre dos libros más densos. No, no, no y no. Desde el principio la historia de Anne & Henry se me hizo demasiado forzada, superficial y con diálogos malos y melosos. Creo que una parte de la culpa la tiene la traducción, que se notaba pésima. Lo que rescato del libro es que sí transmite esa chispa peligrosa que se formó entre Anne y Henry desde el primer momento. La tensión, el fuego que brillaba demasiado y el carácter explosivo y de desconfianza de ambos están presentes a lo largo de toda la historia. Pero por lo demás fue imposible para mí no poner los ojos en blanco cada que leía una de las líneas que se decían los unos a los otros. Y, vaya, si a medida que avanzaba perdía las esperanzas que tenía, cuando llegó el momento de la decapitación de Anne Boleyn me dieron ganas de tirar el libro contra la pared. ¿Cómo un hecho histórico de tal trascendencia y carga política y emocional lo pudieron convertir en algo tan frívolo? Me sentí muy decepcionada con el final que, si bien es predecible por los hechos reales, no le hizo justicia en absoluto."}, {"userName": "Meli", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/5087694-meli", "userReview": "Un retelling sobre la relación de Henry Tudor y Anne Boleyn. Mi lado nerd estaba que se moría de curiosidad por ver cómo adaptaban a la vida moderna varias cosas, sobre todo la decapitación, #MorbosaModeOn, y estuvo todo muy, muy bien elaborado y pensado. Me gustó.Quien no conozca la historia por ahí lo revolea por la ventana, pero quienes sí... EL regocijo.Edito y voy a pecar de traga insoportable: me da risa y me deprime la cantidad de reviews negativos por el final \"inesperado\". Chicos, no es culpa de la autora que ustedes no prestaran atención en historia :P"}, {"userName": "Lucia", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/8837962-lucia", "userReview": "I have always been fascinated by Tudors' history, Henry VIII's and Anne Boleyn's story especially. When I found out about this modern re-telling, I knew I would be all over it as soon as I got my hands on it. Unfortunately, my big expectations were not met (as it happens quite often with titles by Simon Pulse). In this case, great blurb and premise does not guarantee a good read. So what exactly did go wrong? Here are main points discussing what did not work for me in Anne & Henry:1. There were almost none politics.I wished there was bigger focus on politics in this novel. Anne's and Henry's story provides perfect playground for all kinds of intrigues and fights for power. I was looking forward to such parts but I was fairly disappointed with what author presented. Whole political aspect of this novel lacked attention to details as well as deeper world-building. It all felt as child games to me and nothing more. 2. No genuine feelings.\n\"Henry raises his eyebrows - twice. Holy shit, he's hot.\"\n\"She's hard, rebellious, and - hot. Christ, she's hot.\"\nI'm tired of all those romances which start based only on physical attraction. I'm tired of hero constantly thinking about how sexy/good-looking heroine is and vice versa. When it comes to romance, I want real connection, something more stable and palpable and based on real life situations and honest feelings. I didn't get any of that in Anne & Henry. 3. Not as forbidden as blurb suggested.Forbidden romance aspect wasn't as intense as I hoped it would be. It was all about what two main protagonists should or shouldn't do, instead of can or can't. Whole romance thing in this book missed this exciting drive that I always connect with forbidden romances. Teenagers often confuse love with lust. But I couldn't feel either in this novel.4. Who is this Anne?\n\"This girl's like a ticking bomb with a missing kill switch.\"\nWhile real Anne Boleyn was always presented as cunning and daring woman of her period and aware of her worth, this modern version presented in this retelling was reckless, rude and hiding her insecurities behind the mask of false boldness. She stupidly caused all her own misfortunes and I simply couldn't feel sorry for her. I wasn't sold on her character which resulted in me no enjoying this story at all.5. Lame hero.Henry was naive and weak character. There was nothing admirable about him. What a let down. He wasn't even an anti-hero who would excite me or a tortured hero whom I would root for. He was just a lame person who happened to be a narrator.Overall, whole plot of this book turned out to be quite weak and it definitely didn't live up to the potential that synopsis suggested. My verdict: not recommended.*ARC provided by publisher as an exchange for honest review*MORE REVIEWS ON MY BLOG \nReading Is My Breathing"}, {"userName": "Heather", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/3829373-heather", "userReview": "First I must admit as soon as I heard about this book I basically harassed and/or stalked the author Dawn Ius to get a copy. I believe she felt so sorry for me and my pathetic attempts that she sent me a copy to basically shut me up. ~ Seriously, though... Dawn I appreciate everything you've done and I loved every word... Secondly, the cover. PERFECTION. It's everything I expect of a modern day Anne & Henry.I have always had a fascination with the Tudors and Anne Boleyn. When I found out this was a modern version of the love between Henry and Anne I literally couldn't wait to read it! I realized quickly to do a retelling about this couple could be really good or really bad. Well, I was not disappointed. Every important player was there. Henry is thrown into a position he doesn't even want. Anne the beautiful free spirit that will never be accepted. Henry's first \"girlfriend\" Catherine is a mean girl you love to hate. Anne literally has no one as she desperately tries to be the type of girl Henry's family and friends would accept. BUT we all know what happens to poor Anne Boleyn and I wanted to know is high school Anne going to lose her head too?!?!Dawn Ius writes her characters so wonderfully you literally feel like you know them. I didn't have one moment where I felt bored with the storyline. In fact, I would've finished within a day if I wasn't doing a chapter to chapter buddy read. I did NOT want it to be over. I STILL get so freaking angry at Henry for believing rumors rather than Anne! I loved, loved, loved this book! I recommend it to everyone. I will read anything Mrs. Ius writes in the future simply because I know it'll be amazing! Jane Seymour = Classic"}, {"userName": "Max Baker", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/15359686-max-baker", "userReview": "Thank you Edelweiss for providing me a DRC in exchange for an honest reviewThe blurb is a lie. This is not a contemporary retelling of the love story between Henry VIII and Anne Boleyn where Anne is the manic pixie dream girl and Henry is the king who falls for her charm. No, this book is where Henry is manic pixie dream boy who breezes into Anne's life AND COMPLETELY SCREWS HER OVER.I know people were worried about the manic pixie dream girl portrayal of Anne in this book, and let me tell you right now, she's not. She's hurt and loved and so many other things. This is not Henry's story, not by a long shot. It's Anne's story and how everyone was against her for just being herself.Now, I've been mad before. I've been pissed off before. But, I have never never felt the unimaginable rage I have for Henry at this moment. Never in my entire life have I loathed a character this much before, but I'll get to him later. Right now, I'm going to talk about Anne.Anne is the best character in this book. Period. She's a bad girl who drives a motorcycle, has a pierced tongue, and doesn't fit in with the rich assholes. And you know what? Anne Boleyn don't giva fuck. She's perfectly happy giving everyone who hates her the finger and saying \"suck my dick\" right to their face. I didn't know what to expect from her when I started reading, but my god, her voice, her character, everything was perfect.I'm not a history buff, so I don't know how Anne Boleyn is remembered in history, but I'm assuming since she was a woman it's probably not very flattering. The Anne in this book isn't well regarded either. Everyone hated her because she wasn't snotty or rich and Anne honestly dealt with it pretty well. She always had a sarcastic quip or way of shutting the other person down. She knew how to own her sexuality and use against every asshole she encountered.But that doesn't mean she's not vulnerable. My god, I almost cried reading this book because Anne deserved none of what she got. She deserves love and kindness and trust that no one, not even her mother, gave that to her. And if Anne didn't deserve it, why did she get it? Well, I'll tell you why. Because she wasn't what everyone wanted her to be and that just pissed them off.Bottom line: Anne Boleyn, perfect human.Now Henry. Oh do I have some shit to say about him. If anyone in this book is a manic pixie it's this asshole. For god's sake, he shows up on a friggin' white horse at one point. He meets Anne at a party and is instantly infatuated with her, breaks up with his current girlfriend to be with her, says some nice crap before going totally out of character and turning against her.Henry has no motivation, no character, no story. Half the book is told from his point of view and I can't tell you a single thing about this guy. Writers know to focus on what a character is, not what a character isn't. We know Henry isn't as charismatic as his brother; we know he doesn't have the same aspirations as his father did; we know he doesn't like going along with his mother's plans to jump start his political career.So, what the fuck is he?He has no defining character outside of not being what everyone wants him to be. In addition to that, he has no backbone. He can't decide anything for himself nor can he stand up to anyone in this book. He says he cares about Anne, but he's so quick to turn on her after one conversation with people he knows are out to get her. Henry has no defining character, because he was only meant to screw Anne over. That's it. Sure, Ius tried to give him depth by having him live in the shadow of a very successful father and brother, who are both conveniently dead, but the two of them are used as framing devices to tell the reader how much Henry isn't like them.The side characters weren't that much better. They were all spoiled self-centered rich kids or spoiled self-centered rich adults. All they cared about was status. That's all. For example, Henry's mother goes to great length to get Henry into the Oval Office, but never once asks if that's what he wanted. All she cared about was making her son into what she wanted him to be. Of course, Henry wasn't anything in the first place.And while I'm on it, does this actually happen? Do parents really try to groom their children for presidency in high school? Henry's mom, along with every other adult in the book, kept mentioning how Catherine, Henry's ex, would make a lovely First Lady, but when he breaks up with her, she says that Henry's still in high school and he should wait before doing anything rash.Bitch, he's eighteen. He's got to wait 17 years before he's even considered for presidency, and I doubt he's going to run the minute he's able too. Did every character in this book expect Henry and Catherine last 17 years, when they had nothing in common and the small fact that SHE WAS HIS DEAD BROTHER'S EX-GIRLFRIEND between them? And what pisses me off the most? I. COULDN'T. PUT. THIS. BOOK. DOWN. Not once. It's addicting and thrilling and heartbreaking all at once. No matter how much I loathed the characters, I needed to know what happens. NO matter how disgusted I was, I needed more. Even if I hated every single character in this book, except one, I needed to know how Ius would end it.It's 4 a.m and I have to get this off my chest. The writing in this book is spectacular and Anne's character is one of the most sympathetic, if not the pinnacle of sympathy, ever. Every page from her point of view was a joyride. And I honesty enjoyed most of Henry's chapters until I got tried of his constant blathering about how hot Anne was and how atrocious he was as just a human being in general. This review has turned into an angry rant, and I honesty wasn't expecting it too. Bit whatever, the bottom line is that Anne is perfect and should have probably stabbed Henry in an act of justified vengeance. I would have supported it."}, {"userName": "Katherine", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/13311251-katherine", "userReview": "”’You don’t want to do this, Henry. She will ruin you.’”\nHenry Tudor has his whole life planned for him; after graduating Medina High School as valedictorian, he’s expected to go to Harvard University, major in political science, and become a hot shot senator like his father was. Like his brother Arthur was supposed to be. But Arthur is dead, and Henry is left to follow in his footsteps. Problem is, it’s not what he wants. He’s always been Arthur’s follower, trying to be like him but never quite succeeding. He wants to be an artist, not a politician. But with his family’s reputation at stake, he must do as he’s told. Even going so far as to date Arthur’s girlfriend, Catherine Aragon. But all of this changes when the new girl shows up at one of his mother’s parties. Anne Boleyn. And once they lock eyes, Anne and Henry know that something big is about to happen. Anne is everything Catherine is not, which is what makes her so irresistible. Soon, Henry is bewitched, and nothing will stop them from being together, even at the cost of destroying everything they’ve worked so hard for.You’ve all heard of authors taking a fairy tale and retelling it from a new perspective. Or taking famous pieces of literature and retelling it from a new angle. But in all the books I’ve read, I’ve never read a book where the author actually took a historical event and transplanted it to the present.So I’ve got to give the author credit in trying to make a concept as unique as this work. The only bad part is.... it didn’t work. Not even in the slightest. And I think I know exactly why. Henry VIII and Anne Boleyn’s story is a story that never fails to fascinate. Henry VIII is King of England, married to Catherine of Aragon, who just happens to be his dead older brother’s first wife. They’re happy enough, except that one big bugaboo of not having a legitimate male heir. And then one day, a raven haired beauty arrives at a party... named Anne Boleyn.Anne Boleyn was (and still is), a complicated woman to figure out. Most of the rumors about her are untrue, written after her death by people who thought less-than-highly of her. Anne’s true motivations and actions are a complete mystery, and one I don’t think anyone will be able to solve. What is a well-known and universally accepted fact is that Henry fell completely, undeniably, passionately in love with her. Henry VIII was so in love (or lust. Or obsessed. However you decide to interpret it) with Anne that he almost destroyed the British Empire. He cheated on his wife and flaunted his affair right in front of the British court, which created quite the scandal. He begged Catherine for a divorce, which she refused. He broke from the Catholic Church AND CREATED HIS OWN FUCKING CHURCH because he was so infatuated with her, thinking she could be the one to give him what he wanted: a son. He exiled Catherine to a god awful palace that reeked of mold, disease, and who knows what; it was later rumored that he had her poisoned. He disowned his own daughter and proclaimed her a bastard. He made Anne his queen despite the fact that the British people hated her guts more than present day Americans hate Donald Trump. But when she couldn’t deliver, her downfall was quick, swift, and unforgiving. Accused of being unfaithful with at least half a dozen men (including her own brother!), she was tried and beheaded. Back in Tudor society, one wrong move and you were toast. Your head would no longer be attached to your body. Dead. Gone. It was a high stakes world, and not a very kind one either. Now imagine you were to take the story of Anne and Henry, make them teenagers, and have them act out their romance in a high school setting.... It doesn’t work AT ALL. High school society can be brutal, but in comparison to Tudor England, it looks like Disneyland. Instead, what you get is a bunch of hormonal, rich, spoiled teenagers who have no idea what the hell they’re doing to begin with worry about their precious social statuses and ambitions. All the danger is gone. All the excitement is nonexistent. What made the story of Anne and Henry so enticingly irresistible is the fact that there was an entire KINGDOM at stake because of their love. Here, it’s all a bunch of teenage nonsense about whether or not Anne is in the “clique” club, and the worse things the other students can say about her is the fact that she rides a motorcycle (GASP! THE HORROR!). \n”’She drives a motorcycle,’ Catherine says, as though this fact alone isn’t fearless and sexy, but further reason to send her out with the trash.”\nThe worse thing that happens to her is that she gets expelled from the school. That’s \nnothing\n compared to getting your head chopped off. The danger, the suspense, is all gone. An event in the past like that just doesn’t translate well to the future, simply because all the things that made it so deliciously fascinating can’t be done anymore.The author does manage to keep some of the key characteristics of the historical characters and bring them to modern times, with lukewarm results.\n”I’m a follower. Picking up where my brother left off. Living another man’s life. Maybe not by choice, but it doesn’t make it any less true.”\nPoor Henry can’t seem to get out of his older brother’s shadow. This Henry (no word yet on whether he’s the eighth Henry in his family), is the poor little rich boy who’s bound by family expectations and “duty”, so to speak. The real Henry VIII did somewhat live in his brother’s shadow, but whether he was burdened by that or not hasn’t been determined. I actually found this Henry to be somewhat likable, even with all the whining that he does. \n”Fuck her... Screw all of them and their pretentious judgment. I won’t let these people, my past, my guilt control me.”\nAnne Boleyn just doesn’t give any fucks what people think (much like the real Anne), and I think that part was really refreshing. I was interested to see how the author would portray this Anne Boleyn, since her real life counterpart’s portrayal has been debated over hundreds of years. Was she the conniving seductress, or an innocent girl who was caught up in the royal intrigues of the court? Here, Anne is portrayed as kind of both. She’s certainly no angel, but she’s also a very sympathetic character at the same time. She’s not into Henry for the money, power of fame; she’s in it because she loves him. While some of her actions here may be questionable, motive is not one of them\n”Catherine. Smart, popular, and she gets me, or at least the ‘me’ everyone thinks they know.”\n Usually, dating a sibling’s significant other is a major no-no, at least in today’s world. This is another one of those ‘it worked well back in the 16th century, but it sure as hell wouldn’t fly today’ concepts. The author’s portrayal of Catherine Aragon is very interesting indeed. The real life Catherine didn’t go quietly, but she didn’t show any overt signs of jealousy the way this Catherine does. And she certainly didn’t go around slut shaming people like this one. I actually hate to admit it, but I was more on Anne’s side this time around. Catherine was a class A, number one beeyotch. There was literally nothing about her that I liked (and we’re supposed to feel sorry for Catherine, for cripes sake).While I commend the author for taking such a risky move by retelling a historical event, it simply fell flat. All the excitement and intrigue is gone, and all you have left is a bunch of rich, spoiled, immature teenagers. There are no high stakes, no lives lost; just high school hierarchy and slut shaming. For those of you hoping for an exciting, refreshing retelling of the story of Henry VIII and Anne Boleyn, you’ll be sorely disappointed."}, {"userName": "nick ", "userReviewDate": "Aug 24, 2014", "userURL": "http://www.goodreads.com/user/show/2993271-nick", "userReview": "Anne & Henry is a modern retelling of Anne Boleyn and Henry Tudor's tragic relationship. I was looking forward to reading the book because I enjoy retellings and even though I knew exactly how the book would probably end. That being said, Anne & Henry was an incredibly frustrating read for me. First things first, the writing in Anne & Henry was excellent. Dawn Ius has a fantastic writing style, especially for a debut book and I can tell that she is one talented writer. To be honest, the only reason I continued on with this book was because of her writing.What frustrated me however were all the characters. Aside from Anne, none of the characters were remotely likeable. Henry Tudor especially. I was okay with his character in the beginning. He wasn't anything remarkable, but I tolerated him, but towards the end of the book, I became sick and tired of what a spineless character he was. He was the sort of person who relied on other people's opinions to make judgements. He was frankly, excuse my language, an ass. I understood that he had a lot of pressure on his shoulders, but I still wish he had grown up throughout the book to stand up to the people around him who kept pushing him on a path he was clearly unhappy with.I really disliked how every secondary character was also rude, catty and downright mean to the protagonist, Anne. They hated her for being an outsider and they treated her like crap. I would have liked for Anne to have made some good friends in the book, but that never really happened. While Anne herself was an engaging character in the beginning with her being bold, sassy and witty, I was let down by how she never really confronted any of her haters and let them walk all over her in the end. Also, I'm not really sure what Anne saw beyond the physical in Henry because he was boring and really flat as a character. To me, there was nothing remotely appealing about him.Because of that, I was never convinced in their relationship beyond the lust phase. I guess my main problem with Anne & Henry was just how it was too close to the original story for me, which I know sounds ridiculous because it is a retelling, but I was hoping because this was a modern take to the story, Anne would have had a better fate (without Henry because he didn't  deserve her at all!).I probably wasn't the right audience for Anne & Henry which is why it didn't work for me because I was hoping for something entirely different. I still think if you're looking for a fun modern replica of an Anne Boleyn and Henry Tudor relationship, that this might be worth the shot. I may not have enjoyed the book, but I'm looking forward to reading more from the author in the future because her writing was very promising.*****************************************************************Man, this book.*simmers in rage*Please excuse my language, but Henry was a fucking idiot who relied on others to make judgements and only thought with his penis. What Anne even saw in this douche, I will never understand. Every character in this book was an asshole that believed the world revolved around them. I would have rated the book a 4 if they had all fallen off a cliff. I realize that this is a retelling of a tragic and unhealthy relationship but this book made me so angry. Ugh."}, {"userName": "Aleri ", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/36087597-aleri", "userReview": "Probablemente una de mis peores lecturas de este año."}, {"userName": "Kyle Kerr", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/4310784-kyle-kerr", "userReview": "Things you need to know right off the bat:1) This books is extremely addicting. I read it in one sitting and couldn’t be bothered to stop for basic human functions such as eating, using the bathroom, or breathing (during certain scenes).2) This story stays true to the essence of the real Anne Boleyn and Henry Tudor, but it is NOT a strict retelling. EXPECT CHANGES. And be openminded and allow yourself to get lost in the story.What I love most about this book is how intimate it is. Not in the sense of romance (though there is that—and some steaminess too!), but in how deep and how quickly we get immersed into Anne and Henry’s psyche. From the opening lines of the book, you’re drawn into the complicated mind of Henry, who is struggling to juggle family and community expectations while trying not to lose himself in the process. And then he meets Anne and—if you’re familiar with Tudor history at all—we all know what happens next. Anne is full of fire, but also a strong need to be loved and accepted by the new people in her life. Until it’s clear they aren’t playing nice, and then she doesn’t hesitate to take a stand against them.Henry falls hard and fast—a young guy ruled by his passions, just like his real-life counterpart. He lets his new infatuation consume him, almost to his very destruction… or at least, the destruction of the Henry his mother and close friends THINK he should be. None of his choices are easy, and you get to see the internal struggle between what he wants and what is expected of him.Anne should’ve known better. She’s had issues with guys in the past, so she’s hesitant to get caught up with Henry, whose mother and friends are almost violent in their distain for her, but whose smile and kind nature are hard to resist. She fights an uphill battle the entire way, taking the hard way with each turn… until the very end.The writing is compelling and incredibly delectable. Once you take your first bite, you’re going to have a hard time not devouring the whole cake. But then why not indulge? A quick, absorbing read that’ll leave you tears—but whether they’re happy, angry, or sad will depend on whose side of the story you’re on.A really incredible debut by a fantastic writer. Can’t wait to see what Ius comes out with next!"}, {"userName": "Danielle", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/4234605-danielle", "userReview": "[In a moment of vulnerability, Anne describes how her sister's boyfriend spread false rumors that they slept together, causing her bad reputation and ultimately forcing her to switch schools. In addition, Mary attempted suicide and had to be institutionalized after Jesse \"told her I took advantage of him that night.\" Henry's only reply to this horrible accusation? \"Because he was so fucking weak?\" That's right, Jesse could only have been raped if he was weak. Since he was strong, Mary should have known he was lying. (hide spoiler)]"}, {"userName": "isabelle", "userReviewDate": "Jul 26, 2014", "userURL": "http://www.goodreads.com/user/show/23930288-isabelle", "userReview": "Shut the front door.Is she biting his cheek?"}, {"userName": "Jen Ryland", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/6497049-jen-ryland", "userReview": "[ sad but fitting. Given the real Anne's fate, I was actually expecting worse. And she's much better without snoozefest Henry imo. (hide spoiler)]"}, {"userName": "Stacee", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "3.5 starsI've always loved the story of Anne Boleyn, so I was instantly intrigued by a modern retelling. I loved the duel POV we got. Anne and Henry are both interesting characters and being in their heads was like a car crash I couldn't look away from. There were a few sweet moments, but the attraction and intensity is the main event. The group of friends, led by Catherine and John, were a perfect substitution for court. Obviously, I knew there wasn't going to be a HEA, but I could have never expected Anne's downfall to be orchestrated in the manner that it was. And the very last sentence could be the most perfect ending I've ever read in context to a story. Overall, I did like it, but it still felt like something was missing. The pacing of the story seemed a bit off. In some parts, I wasn't sure how much time had passed between scenes. However, it was a quick read with an interesting take on a famous relationship. **Huge thanks to Simon Pulse and Edelweiss for providing the arc in exchange for an honest review**"}, {"userName": "Katerina", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/17261852-katerina", "userReview": "In tutta onestà non è facile recensire questo libro: una recensione negativa è ovvia, ma sapevo che sarebbe stato brutto. Enrico VIII e Anna Bolena in un retelling YA ambientato in un liceo americano?Sapevo che probabilmente sarebbe stato offensivo e che sicuramente avrebbe massacrato la storia, quindi ha senso che mi lamenti perchè è come mi aspettavo?Ma sono un'insopportabile pignola quindi comincio con un elenco di cose che immaginavo non sarebbero apparse nel libro, o almeno non come sono successe: - il corteggiamento durato otto anni - il coinvolgimento del Vaticano per separarsi da Caterina d'Aragona - la questione religiosa - il dramma per il mancato erede maschio - Maria ed Elisabetta - Anna decapitataOra, già a questo punto è legittimo chiedersi perchè scrivere il retelling: cosa rimane di Anna Bolena ed Enrico VIII se togli il contesto, le implicazioni politiche, il tragico finale e abbassi l'età di tutti a diciassette anni?Fondamentalmente rimane quello che è il libro: la storia di due adolescenti che si piacciono e poi si lasciano male. Anne & Henry non si può nemmeno definire un retelling perchè se si fosse intitolato Amy & Luke non sarebbe cambiato assolutamente niente: Dawn Ius non ha deciso di raccontare una storia in un contesto diverso, come può essere il Romeo + Giulietta del 1996, né trae ispirazione come Sons of Anarchy con Amleto. La Ius ha deciso di scrivere un mediocre YA, nè bello nè particolarmente brutto, e di mettere in mezzo i Tudor per attirare l'attenzione (oppure è semplicemente una scrittrice mediocre): non ha usato aspetti della storia che avrebbero potuto funzionare, e quando ha ripreso gli eventi \"veri\" non ha neanche usato i nomi corretti.Mi spiego: siccome negli YA serve che l'eroe abbia un tragico passato, ha deciso di darne uno ad Henry. E uso il verbo \"darne\" per un motivo: Enrico VIII arriva con un bagaglio emotivo importante. Madre morta di parto, padre che non si è mai ripreso del tutto, fratello maggiore morto di malattia e due o tre fratellini morti durante l'infanzia.Ora, volendo tagliare fuori i fratellini perchè mortalità infantile + setting moderno non vanno d'accordo, come autrice hai almeno un genitore morto, uno depresso, e un fratello maggiore morto pure lui. Mi sembra che come tragedia ci siamo.Ma non è abbastanza, per la Ius: inverte Elizabeth con Henry VII, quindi babbo morto e mamma viva, e il fratello morto di malattia? Troppo banale. Facciamo che Arthur è morto cadendo da un burrone ad un evento a cui Henry ha dato buca (true story), così Henry può sentirsi in colpa.E facciamo finta che le sorelle non siano mai esistite.Ad Anna le cose non vanno meglio: papà Bolena se n'è andato, la signora Bolena si è sposata con un'architetto ricchissimo, Mary è una pazza ricoverata e George non esiste. Ad Anna, poi, tocca essere la protagonista YA diversa da tutte le altre quindi è La Ribelle™. Sappiamo che lo è perchè lo dicono tutti, ha un piercing alla lingua, si trucca facendo gli smokey eyes, indossa stivali e - udite udite - guida una moto. Secondo me ha anche un tatuaggio e ascolta metal.Si fa costante riferimento ad un oscuro passato che consiste nell'essersi fatta il ragazzo di sua sorella (tale Jesse), gesto che ha fatto crollare Mary.Ora, io mi chiedo perchè inventarsi queste patacche quando Anne aveva nel suo passato un fidanzamento importante e segreto (con Henry Percy), e Mary... beh, tanto per cominciare i suoi mariti si chiamavano William, quindi Jesse non so da dove arrivi, e fu amante di Enrico quindi c'era potenziale dramma.Immagino che fosse troppo iniziare con Henry che sta con Catherine, si fa Mary e poi le molla entrambe per mettersi con Anne.La questione dei personaggi secondari secondo me è degna di nota: c'è qualche nome di gente vera, ma la maggior parte dei personaggi è inventata di sana pianta, come pure la lista dei ragazzi con cui Anne avrebbe tradito Henry (che ci voleva a mettere almeno i nomi, se proprio non se la sentiva di inserire dinamiche complesse come l'amicizia con più di un essere umano alla volta per dare peso alle accuse?).E quelli che ci sono... beh, la povera Elizabeth è scampata alla morte di parto ma in compenso si è trasformata in una snob con la puzza sotto il naso intenta ad organizzare la vita al figlio fregandosene dei suoi desideri.KatherineCatherine? È la classica Stronza del Liceo™: una bulletta creata e scritta per essere odiata dalla prima all'ultima pagina. Non è previsto che si provi simpatia per nessuno se non per Anne.Charles viene nominato di sfuggita e gente come Wolsey o Cromwell non c'è proprio.La storia tra Anne ed Henry, senza tutto il contorno che l'ha resa grande, non rende minimamente: tanto per cominciare l'unico motivo per cui il loro amore è contrastato è che lei non è quella giusta. Tutto qui. Dicono che ha un cattiva influenza su di lui perchè - quando sono insieme - lui si toglie la scopa che ha saldamente piantata nel deretano (sì, Enrico VIII), ma di base non c'è nessun motivo per cui tutti debbano odiarla se non che sono dei bulli. Che ci puoi anche scrivere un libro, ma non è proprio in tema se si parla di Anna Bolena e della corte Tudor.Henry è carismatico, con la capacità di trascinare le folle, più o meno come una ciabatta (ma non due), ligio al dovere ed ingessatissimo.Anna è super-innamorata ed è finita lì per caso: non voleva stare con Henry, non voleva che lui lasciasse Catherine, non gliel'ha chiesto lei. Non le importa dei soldi, non le importa della posizione sociale. Non è ambiziosa, né lo è la sua famiglia... o meglio, in famiglia le dicono \"Grande! Ora attaccati come la cozza allo scoglio così possiamo sfruttare il tutto!\" a cosa fatta, senza che però seguano mai fatti alle parole.Non sono i Bolena, nessuno di loro.Altra cosa: è vero, non mi aspettavo gli otto anni di relazione clandestina, però nemmeno otto giorni. Sul serio, succede tutto velocissimo: Henry lascia Catherine dopo aver visto Anne tre volte, e senza particolari drammi se non che gli amici non approvano la nuova relazione.Con Anne la storia dura pochissimo: si conteranno sulle dita di una mano le volte che sono usciti insieme, e non c'è alcuna conseguenza a lungo termine dal loro amore.Insomma, più che il retelling di una passione travolgente, è l'appiattirla e il banalizzarla.Se si mette da parte il fattore Tudor e lo si guarda solo come YA, posso dire è che c'è un'inversione di ruoli, con il bravo ragazzo che si perde dietro la cattiva ragazza che però ha un cuore d'oro, e che il finale non è scontato. Il problema è che la scrittura è piattissima, e rende la storia di una noia infinita: nanche il pov alternato tra Henry e Anne riesce a rendere le cose interessanti perchè sono due adolescenti che si lamentano costantemente del mondo che non li capisce. Manca una caratterizzazione accattivante di tutti i personaggi e, soprattutto, il coraggio di osare e rielaborare davvero gli eventi.Un libro completamente evitabile, prevedibile fin dalla copertina, che non si capisce nemmeno cosa volesse fare l'autrice o quale fosse la sua idea."}, {"userName": "Giselle (Book Nerd Canada)", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/5789353-giselle-book-nerd-canada", "userReview": "I wanted this one to be a goodie, but as soon as I finished it... Errrr nooo it went downhill. It actually started incredibly well and having to do a modern retelling of Anne Boleyn and King Henry VIII is a hard thing to do. I just didn't understand how easily Henry was persuaded by his friends and family. And that trial? What was that?! He just said it wouldn't have to come to that and then it happened? I don't even know if I believe Anne's story but you can't help but admire her attitude about not giving two cahoots what others think. Pushing her out because she didn't belong in their world.. Gah and the amount of slut shaming was just uggh. I despised John.. *shudders* I've only really watched The Tudors to compare this to, and hands down the show gets my vote. I wished there could have been more. It was too quick. There was no constant high of Anne being his girlfriend, she was shut out too quickly for me."}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "This retelling of Anne Boleyn and Henry VIII isn't working for me. It reads more like Gossip Girl than it does a contemporary retelling. Katherine of Aragon casted as a \"Barbie\" blonde? For real? She is more like a goodie-two-shoe Catholic school girl than a devious cheerleader....just my opinion. I read the first fifty pages, but I had to put it down. I just didn't care about Anne. DNF."}, {"userName": "Jay G", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/30890847-jay-g", "userReview": "Want to see more bookish things from me? Check out my Youtube Channel: https://www.youtube.com/channel/UCfer...3.5 Stars This book is a loose retelling of King Henry VIII and Anne Boleyn set in the modern day. I really liked Anne as a character. She was spunky and sassy with an attitude you didn't want to mess with. But she was also sensitive and caring. I liked Henry for the most part, but I think he was too easily swayed by others opinions, which pissed me off. I really enjoyed how the story was told in dual point of view between Henry and Anne. I hated all the slut shaming in the book though...."}, {"userName": "Kyra", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/31172066-kyra", "userReview": "Review will also be posted at https://deardariamorgendorffer.wordpr...  E-copy provided by Edelweiss in exchange for an honest review. This does not, in any way, affect my opinions or emotions about this book. RATING : Ranging from 2.5 to 4 stars.WARNING: There are may be some spoilers ahead. I will try my best to hide these spoilers. meh /me/(informal) (exclamation)expressing a lack of interest or enthusiasm.Me after reading this:Well no, not entirely. This gif just sums up my feeling about the entire book. But I have to say, I was rather shocked by its ending. My eyes kind of welled up (which is very rare very rare very very rare.) WHAT I DIDN'T LIKE ABOUT THIS BOOK  1. The story. The flow of events. The story was okay and didn't really make sense until the last 75%. At first, I was all excited and jumpy and like, \"OOH OOH I'M GOING TO LIKE THIS CHARACTER\" and \"OOOH OOOOOH SHIP SHIP OTP HEHEHEHEZ\".But then as I read on, I realized that this was just going to be your ordinary teen romance, your ordinary plot which is something like this: Weird, not famous girl arrives on new school,She is treated like shite by the kool kidz,But then she sees this rich, popular, smart guy And she gets all excited and likes himAnd she expects him to not like her backBut then he likes her back (yay) But parents disapproveSo... sadlyf :((( I am very, very tired of clichés. I am very very tired of promises such as 'this gal would be as badass as katniss everdeen!!11' because in the end, they're all just dopey love-sick teenagers that mope around just because their crush doesn't like them :(((Basically, during the first third of the book, all I read about was Anne and Henry's constant flirting and their constant denial (ugh) ti admitting that they liked one another. 2. The charactersAs I said, reeaaaally cliché.LIST OF VERY CLICHÉ CHARACTERSWeird, purportedly badass girl = AnnePurportedly unattainable guy (but attainable) = HenryJealous GF = CatherineJealous GF'S b*tch clique = Liz, Marie, and that other cheerleader girlaluJerk Best Friend = JohnBest Friend who won't support you in the end = SamImpulsive mother = Mrs. TudorDa traitor = CharlesLet us start off with Anne. Anne Boleyn  is a pretty decent main character. During the first few parts, she managed to live up to the standards of the real Anne Boleyn's personality: wild, fierce, you get it. But apparently nothing lasts forever. So after a few chapters, this badassery slowly evolves into something mopey and dopey and voila: not badass.  Anne's Badassery level by First Few Chapters: Anne's Badassery level by Remaining Chapters: Shia LaBeouf/10  Henry  (p.s.: I can't seem to find an appropriate gif to accentuate Henry's personality)Henry... really seems to be the kind of guy the whole girl percentage of the school population would have a crush on. Seriously. Because, why not? This guy sounds perfect: rich af, smart af, nice af, hot af, sporty af. He's so hot-sounding that I kind of feel the need to create a fanfiction about him and his best friend (I wish he was gay)I cannot resist. Sorry.But I'm really really infuriated because he can't stand up for what he wants. Why can't he just  explain  to his mother why he will never, ever be like his brother or father, never be the son she expects him to be. Why can't he just fight for  anything ? For  anyone ? Have some spine, Henry. Solve this like a man. WHAT I LIKED ABOUT THIS BOOK 1. The humourOh my potatoes, I actually laughed. Out loud. In public. Miss Ius's writing style will make you keep reading this book, I swear.It's just so funny and it gives a light mood to the story to ease things up a bit.But this opinion is kind of conflicting given my other past statement, which will all make sense if you read this.  OVERALL VERDICT  This book isn't that bad nor isn't that good. But it definitely had its good moments. It's an interesting, realistic (but cliché) love story, Read it."}, {"userName": "Sherry Ficklin", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/2227088-sherry-ficklin", "userReview": "This book was perfection from start to finish. I love the real history of Anne and Henry and I was a little nervous going in. How would it stand up to a modern retelling? Answer, it's amazing. Henry is spot on as a spare who suddenly finds himself the heir. After the death of his older brother, all his family's political and social expectations fall firmly on his shoulders. The problem is, he's unsure who he really is and what he really wants. Enter Anne Boelyn. So often she's portrayed as a conniving, ambitious seductress. I was relieved to see Ius present her as a strong, capable, head strong, fierce young woman with a gentle vulnerability that she really only shows to Henry. She's everything I want in a heroine and I wonder from the beginning if Henry will ever be strong enough to deserve to stand beside her. Their chemistry is instant, their passion undeniable. I challenge you not to root for them. But, of course, it's not that simple. Teen readers will find this book a good cautionary tale about the power of rumors and lies and the impact they can have on our lives. Bottom line, if you loved Leo Dicaprio's rendition of Romeo and Juliet, this is right up your alley, and on that note this would make a KILLER MOVIE! I'm looking at you, Hollywood! This is one book you are not going to want to miss!"}, {"userName": "Gisbelle", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/2149405-gisbelle", "userReview": "My thanks to \nSimon Pulse\n--------------------------------------------------------------Point of View: Dual (Henry & Anne)Writing: First Person | Present TenseSetting: Genre: Young Adult | Contemporary Romance --------------------------------------------------------------It started out pretty interesting. I did like it at first and thought the whole thing was quite refreshing. However, I lost interest in the story after having read about half of it. To me, it was numbingly boring.I couldn't care less for the characters. Frankly, I didn't like any of them. Not Anne, Not Catherine, and especially NOT Henry."}, {"userName": "Kelly (Belle of the Literati)", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/5361057-kelly-belle-of-the-literati", "userReview": "So I say to myself at 9 o'clock PM, 'I'll just start this one and see how it is because you've been anticipating this book for close to 10 months, just read a few chapters to get the feel for it.'....I'm not really sure why I lied to myself knowing full well I would not stop until I finished. I have...so many feelings right now and all of them good. I mean...no, I hate everyone right now but only because this book was so amazingly done. Can't wait to write my review :) #AnneBoleynIsForeverMyHomegirl Full Review at Belle of the Literati"}, {"userName": "Sophie", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/5556618-sophie", "userReview": "I am both intrigued and skeptical! Not too confident about Anne Boleyn's portrayal."}, {"userName": "Alex", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/10042648-alex", "userReview": "I received an ARC copy of this book, thanks to Edelweiss.**slight spoilers for the ending of the book below**I've never read a book by Dawn Ius, and I actually think this might be her debut young adult novel. I saw some previous reviews for this book on goodreads, and more then half of the reviews I saw were three or less stars, which had me a little nervous. I thought I was going to hate the book. I actually ended up enjoying it a lot more then I thought I would.Wait, I'm getting ahead of myself-the synopsis of the story is Henry Tudor and Anne Boleyn. Except, it is set in modern day time. Henry has his life set up for him by his family and has high expectations from them. He is to grow up to be a senator, and marry the perfect girl, Catherine. When he meets explosive and impulsive Anne he is instantly intrigued. Anne is a firecracker, a ticking time bomb that everyone is expecting to explode. She is rebellious, which has to do with her family life. Both come from different families and find solace is one another.Henry Tudor was a believable character, especially in his fall for Anne. He fell quickly and didn't think into it as much as he probably should have. He was in the twelfth grade. There were a few things I was sceptical about, like him bringing his HORSE onto the beach, but I can overlook it for the setting of the story. Henry wasn't a typical rebellious teenager. He was basically the most popular man at school, which I found a little surprising because of the fact that he was so good. However, it's another thing I learned to overlook due to the setting of the story. Henry had feelings for Catherine, and he mentioned it in the book a couple times, but it was nothing compared to what he felt with Anne.Anne Boleyn was fun to read. I always enjoyed her point of view, but there was one thing that still bothers me. She drives a motorcycle, and seems to be a fully licensed driver, but she's in grade eleven. She also had multiple piercings, which wasn't a shock. Shows also believable but there was multiple times that everyone at the school thought of her \"as a rebel\" but she really didn't do bad things (except for spray painting once).I enjoyed the story, however, I'll admit I got a little bored around the 30% mark, but I quickly picked up interest around 45%. The ending was as expected due to the real-life story of Anne and Henry, but I was still a little disappointed. Couldn't there be an exception, just this one time? However, it was what had to be done, and I'll admit the author did a great job of creating the atmosphere for the final scene and what would have been \"Anne's beheading\". The only thing I don't agree with is students dealing with the expulsion of other students. I understand that that's how the author would get the most effective ending, but there's no way in a real world situation where students would deal with that kind of problem.Even though the story is a young adult novel, I was surprised by the language. Quickly I got used to it and was glad to see the author wasn't trying to childproof the story. Unfortunately I couldn't relate myself to a lot of the story, but I did relate to Anne's alone-ness. Growing up I always only ever had one or two friends and not many others. I never really fit in and I enjoyed reading about a character going through the same struggle.There was multiple occasions in the book where I got frustrated with the authors writing because I couldn't figure out if Dawn Ius was going for poetic or not.Example: I just-can't.I didn't really understand what it was effective for, and if it was effective at all, it stopped being effective and turned to annoying after the third or fourth time it was used. I'd expect teens to be buying this story and hopefully enjoying it as I did. It released on September 1st. Also, if you're a fan of \"The Tudors\" tv show, comment below letting me know if it's good, because this book has got me interested in Henry Tudors life."}, {"userName": "TheSnowBook", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/50182447-thesnowbook", "userReview": "Anne y Henry es una historia bastante sencilla, facil de leer, atrapa mucho y la recomiendo como para salir de un reading slump.Para ser un retelling quizas esperaba mas, pero tmb esperab que me gustara muyyyy poco al ser una historia llena de cliches.Aun asi me divirtio leerla y la recomiendo por ser agil y entretenida.El final me gusto, al menos eso fue diferente y tiene sentido que termine como lo hace, ya que la historia original de amor, no es tan perfecta.Reseña completa: http://thesnowbook.blogspot.com.ar/20..."}, {"userName": "Cait", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/6595239-cait", "userReview": "[cait: JESUS CHRIST WHY DOES THIS EXIST WHY CAN'T I STOP READINGcait: HENRY IS GOING TO GO TO HARVARD BUSINESS SCHOOL AND BE A SENATIO JESUS CHRISTcait: CATHERINE IS THE HEAD CHEERLEADER imagine how hard i'm laughing because it's actually 10 times as hard as thatcait: ANNE DRIVES A MOTORCYCLEcait: HER ~ADULTERY~ IS HIS FUCK BOY FRIENDS GETTING HER WASTED THEN SEXUALLY ASSUALTING HER TO PROVE TO HENRY SHE'S A WHORE I FUCKING CAN'T WITH THIS BOOK. cait: JANE SEYMOUR IS A FUCKING WAITRESS AT A DINER I GIVE UP. (hide spoiler)]"}, {"userName": "Maxi", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/23970291-maxi", "userReview": "Qué librazo.Me gustó muchísimo. Me pareció un contemporáneo muy original, divertido y completamente diferente de lo que estamos acostumbrados. Cae un un par de clichés, sí, pero por ejemplo en lugar del chico malo tenemos al chico rico e inteligente y en lugar de la chica correcta y educada tenemos a la chica fuerte y atrevida que no se hace la pobrecita ni por asomo. Conocía la historia real muy poco y por eso me esperaba cosas diferentes de los últimos capítulos del libro pero eso no hizo más que sorprenderme. Amé."}], "description": "In this wonderfully creative retelling of the infamous—and torrid—love affair between Anne Boleyn and King Henry VIII, history collides with the present when a sizzling romance ignites in a modern-day high school.Henry Tudor’s life has been mapped out since the day he was born: student body president, valedictorian, Harvard Law School, and a stunning political career just like his father’s. But ever since the death of his brother, the pressure for Henry to be perfect has doubled. And now he’s trapped: forbidden from pursuing a life as an artist or dating any girl who isn’t Tudor-approved.Then Anne Boleyn crashes into his life.Wild, brash, and outspoken, Anne is everything Henry isn’t allowed to be—or want. But soon Anne is all he can think about. His mother, his friends, and even his girlfriend warn him away, but his desire for Anne consumes him.Henry is willing to do anything to be with her, but once they’re together, will their romance destroy them both?Inspired by the true story of Anne Boleyn and King Henry VIII, Anne & Henry beautifully reimagines the intensity, love, and betrayal between one of the most infamous couples of all time.", "title": "Anne & Henry", "url": "http://www.goodreads.com/book/show/24885809-anne-henry", "average": 3.05, "cover": "https://images.gr-assets.com/books/1440993244l/24885809.jpg", "reviews": 309, "authors": [{"url": "https://www.goodreads.com/author/show/3090049.Dawn_Ius", "name": "Dawn Ius"}], "type": ["Romance", "Retellings", "Young Adult", "Historical", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/24885809-anne-henry", "http://www.goodreads.com/book/show/33790646-anne-henry", "http://www.goodreads.com/book/show/25756773-anne-henry", "http://www.goodreads.com/book/show/28226318-overdrive", "http://www.goodreads.com/book/show/29543148-lizzie", "http://www.goodreads.com/book/show/25018222-transpiration", "http://www.goodreads.com/book/show/24642181-5-7-5-errand-boy", "http://www.goodreads.com/book/show/24642225-beneath-the-soil", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}