{"ratings": 200, "userreviews": [{"userName": "Katrina Burchett", "userReviewDate": "Jan 07, 2016", "userURL": "http://www.goodreads.com/user/show/1393133-katrina-burchett", "userReview": "Danae Brooks wants to be a mommy more than anything. For three years she and her husband, Dallas, have tried. Her sisters have no problems conceiving. So why has it been so difficult for her?I remember feeling for Danae after reading Two Roads Home, the second Chicory Inn novel. I was happy to see that this story would focus on her issue. I understood her frustration. I understood how she felt towards her sisters and how she felt towards God at times. And I understood Dallas' point of view. These are two believable characters dealing with their feelings and their situation in a realistic way.Raney tackles domestic violence with this one. I found some moments heartbreaking, but there were scenes that could have been more intense, considering what happened. She also includes bits and pieces from the two previous works in her Chicory Inn series, so this could be a stand alone book. Still, the better choice would be to start from the beginning and enjoy all three novels. Grant and Audrey Whitman and their children are a close-knit family, always willing to support each other in times of trouble. I love that. And even though they may struggle with God's way of doing things, they care about His will.As I read this story, I thought of Isaiah 55:8-9. It's great when an author writes in a way that brings Scripture to remembrance, because then I'm not just enjoying a story but I'm getting my mind on Jesus. I've read quite a bit of Christian Fiction and that doesn't always happen. I thank Deborah Raney for allowing God to use her to be a blessing to others.Another Way Home is an inspiring, thought-provoking read and the best Chicory Inn novel. So far. Close to Home will be the fourth and the first two chapters are in the back of this book."}, {"userName": "Nayuleska", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/2272587-nayuleska", "userReview": "You'll need lots of tissue for this story about a couple wanting children and getting them in an unexpected way. Don't panic if you aren't religious, God is important to Danae & Dallas (which is nice to see) but it's not in your face, as it were. Although it is part of a series I had no issues jumping in at this story either.I suspected I'd cry a bit, but what happens to Danae and Dallas is truly heartwrenching. Danae follows her heart even when her husband is a bit against her ideas. For health reasons I can't volunteer at places so was delighted when she got trained to help at a women's shelter, since I learnt a bit more about how they run and what happens when situations get a bit scary. I was gobsmacked by the plot twists, which really goes to show that if you don't get something you want in the 'conventional' way, there are other ways out there (not just for getting children). It's the end result which matters, not how Danae and Dallas ended up with children in their lives, although that is a rollercoaster in itself. Their love for each other and the children is immense; infertility is a hard life obstacle to tackle, especially when it goes on for years; although I haven't experienced it the emotions from Danae are palpable.. The way Danae had to cope with her sisters when they got pregnant/when she saw their children made me want to give her a hug. This is definitely a book for keeps. I received a copy of this via NetGalley in exchange for an honest review on my blog Nayu's Readng Corner http://nayusreadingcorner.blogspot.co..."}, {"userName": "Tonya", "userReviewDate": "Nov 24, 2015", "userURL": "http://www.goodreads.com/user/show/878615-tonya", "userReview": "Grant and Audrey are adding grandchildren to their family left and right, but middle daughte, Danae, and her husband, Dallas Brooks, have been trying for years with no baby in sight.Though Danae is ready to consider adoption, Dallas will not even discuss it. Despairing of ever having a family of her own, Danae decides to pour her passion and energies into volunteer work with a newly opened women’s shelter in town. Looking for a good cause to fill her lonely days, she never expects to give her heart to the hurting women she meets there. She’s finally learning to live her life with gratitude, but then heart-wrenching events on Thanksgiving weekend threaten to pull the entire Whitman clan into turmoil—and leave them all forever changed.--My thoughts. This is like going home to family. I am really beginning to love this group of people. It is like visiting and catching up! Why didn't Dallas want them really to adopt? You find out the answer to this question and so much more in this book. Raney really hits some excellent subjects in books. Subjects that mean a lot in the world -- but what does God say about them? And the thing is, it isn't what we would expect! Sometimes that is the best thing in the world. Amen! Corrinne is in this one, and she is becoming one of my favorites, from Two Roads Home, which I adored! Enjoy the Whitman clan once again and happy reading!"}, {"userName": "Karen", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/845229-karen", "userReview": "good story, starting to tie up some loose ends..."}, {"userName": "Beth", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/11255379-beth", "userReview": "I received this book from Litfuse Publicity for no charge in exchange for my honest review of this book. The opinions expressed here are my own.Book Description: Grandchildren are not in short supply for Grant and Audrey Whitman, although their middle daughter, Danae, and her husband, Dallas Brooks, after trying for years, have not been able to contribute to the growing family. Danae is open to adoption, but Dallas will not even discuss it. Her despair over never having a family of her own is so deep, it even causes her to question God’s plan for her life. Knowing she must find something to do to fill her lonely days and energize her life, Danae volunteers to work at a newly opened women’s shelter in town. She was only looking for a way to spend her time, but getting to know the hurting women at the shelter fills her heart and she learns to live a life of gratitude once again. But heart-wrenching events on Thanksgiving weekend threaten to pull the entire Whitman clan into turmoil— and leave them all forever changedMy Thoughts: Another Way Home is the third book in Deborah Raney's Chickory Inn series and it is the best one so far. I have had the honor of reading and reviewing the first two books in this series and each one is better than the last. Another Way Home focuses on Danae and Dallas Brooks. They have been trying for many years to have a family, had many fertility treatments, and haven't been able to get pregnant. Danae's sisters have 5 between them and one on the way and each time it kills Danae to not be a part of it and it affects the relationships Danae has with other people especially her sisters and question God's plans. Danae has been open to adoption but Dallas won't do it or talk about it. Danae decides she needs to find something to fill her days so she volunteers at a women's shelter even though Dallas and her Dad have some major reservations. Danae finds being at the shelter helping these women and children brings her joy she hasn't had in a long time. Danae finds herself filled with purpose and really connecting with one woman and her son especially. Even Dallas comes to the shelter to help and he finds himself connecting with the little boy. When Dallas and Danae help her out over Thanksgiving and the events that unfold from there throws their lives up in the air and changes them forever.Another Way Home is FANTASTIC. I am a huge fan of Deborah Raney having read quite a few of her books since I started reading Christian Fiction. Those who read my reviews know that I don't read much in the category of Christian Contemporary fiction but I have a few authors of Christian Contemporary Fiction that I read and Deborah Raney is at the top of that list. I really feel that Another Way Home is the best book I have read by Deborah Raney. This is one of those books that after I read it I had to take time to process before I could review it because it is that kind of book. I really had a hard time putting it down at night, this book grabbed me from the start and held on to me until the end, keeping me guessing how it would all work out until the end. I don't know that I will be able to do this book justice in this review because it is just deep and well written but I am doing to try. In this book, Deborah Raney deals with some big topics and she writes with authority on them including adoption, infertility, the effects of infertility on the family, domestic violence, and the effects domestic violence has on adults and children. Another Way Home really deals with these topics honestly and tastefully. As I read this book, the emotion and levity of this story really hit me. Deborah Raney wrote with such passion that you can feel the emotions in her writing. I really love that she is able to write about these topics cleanly, without having to be graphic. As a reader, I felt the full effects of these things without it having to be vulgar or violent. This book really brought out a range of emotions from laughing out loud to heartbroken and sobbing for the characters. The characters in this book and this series are well written and relatable to everyone, things don't just work out in the end but how the characters handle them is key. As someone who has dealt with some of these issues including infertility and domestic violence Deborah Raney captured not just the topics but the heart of these issues and all the emotions that surround them for everyone, not just the main characters but all of those around them and in the situation with them. This book really touched me and it is one of those that will stay with me for awhile. I cannot wait to read the next book in this series, especially after the sneak peek at the end of this book. I HIGHLY recommend this book to anyone who reads Contemporary Fiction, it will not disappoint. I give this book 5+ STARS."}, {"userName": "Loraine Nunley", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/17052068-loraine-nunley", "userReview": "Absolutely my favorite book in this series so far. What a wonderful story of gratefulness and love. It was also a reminder to me about how easy it is to look at what others have that we don’t, when we need to be focusing on what we do have. My heart sank with Danae and Dallas as they face frustration and sorrow. It soared when God blessed them. Wow. It was a roller coaster that I did not want to get off of. Full review at my website."}, {"userName": "Lisa Johnson", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: Another Way Home (Chicory Inn #3)Author: Deborah RaneyPages: 304Year: 2015Publisher: Abingdon PressMy rating is 5+ stars.We met the Whitman family in the first book of the series, Home to Chicory Lane, followed by Two Roads Home. In each story, we are given a bird’s-eye view into the various issues some of the grown Whitman children have faced along with how they interact and the running of the inn. Here, in the third book, the author tackles a couple of hard issues such as domestic abuse, infertility, adoption, marriage and faith. I was really grabbed by the heart when Danea continued to be disappointed about not getting pregnant even when spending so much money.As God opens her eyes, she decides to volunteer at a home for domestically fractured families, meeting a woman named Misty. When Danea and her husband Dallas willingly take Misty’s son into their home over Thanksgiving, there comes a point when it becomes evident that Misty is in trouble. She doesn’t return as agreed and no one is able to contact her. The couple is facing challenging decisions as their hearts love Misty’s 3-year-old son, but she is now in legal trouble and facing a long separation from her son. However, there is also a secret Misty has kept from this couple that will require more wrestling with God and lots of prayer.The Whitman characters are close to one another and stand with each other through the various seasons of life. I love how the grandparents are there as sounding boards or for counsel and most importantly as prayer warriors for the children’s families. The patriarch, Grant, wants to make sure that the family doesn’t lose its closeness so he has them over every Tuesday night for family nights. Rightly portrayed is how sometimes the families aren’t thrilled about coming over; yet, they learn the cost of coming over and being together is well worth the sacrifice each makes to be there every week.I look forward to the fourth book coming out in 2016 and if it is the last one that will be hard as I have enjoyed the Whitman family a whole lot!Disclosure of Material Connection: I received one or more of the products or services mentioned above for free in the hope that I would mention it on my blog. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255. “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Victor Gentile", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Deborah Raney in her new book, “Another Way Home” Book Three in the Chicory Inn series published by Abingdon Press brings us into the lives of Danae and Dallas Brooks.From the back cover: Sometimes God’s Ways are not at all what we expect…but exactly what we need.Grant and Audrey are adding grandchildren to their family left and right, but middle daughter, Danae, and her husband, Dallas Brooks, have been trying for years with no baby in sight.Though Danae is ready to consider adoption, Dallas will not even discuss it. Despairing of ever having a family of her own, Danae decides to pour her passion and energies into volunteer work with a newly opened women’s shelter in town. Looking for a good cause to fill her lonely days, she never expects to give her heart to the hurting women she meets there. She’s finally learning to live her life with gratitude, but then heart-wrenching events on Thanksgiving weekend threaten to pull the entire Whitman clan into turmoil—and leave them all forever changed.Welcome back to The Chicory Inn my favorite Bed and Breakfast. If you are going to stay somewhere this is the Bed and Breakfast to stay in. Grant and Audrey’s five children still live close by their parents and every Tuesday night boasts family night at the Inn for the family to get together and simply enjoy being a family. This time the focus is on Danae and Dallas. The issue is infertility. Danae wants to talk adoption but Dallas will not hear of it due to his own issues. So Danae starts volunteering at a nearby domestic shelter where she meets Misty and her son, Austin. Ms. Raney knows about family, the good and the bad, and she knows how to explore all the little details that make this book so much fun to read like how important is the last name and how do we get over the feeling that mother abandoned us? Danae and Dallas are very likable and we feel that we are living the moments with them. We root for them to win. Ms. Raney has delivered another winner. And I am looking forward to the next book in this series.Disclosure of Material Connection: I received this book free from Litfuse Publicity Group. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Itsy Bitsy Book Bits", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/43603114-itsy-bitsy-book-bits", "userReview": "This is book three in The Chicory Inn series. I have not read books 1&2. When I first started the book I could tell that I was probably going to like it. The authors writing style sucks you in and you find yourself totally engrossed in the story. Danae Brooks wants to have a baby more than anything. For three years her and her husband Dallas have been seeking fertility treatments and every month has meant more heart ache and longing. Her sisters don't have issues getting pregnant so why does she? After some soul searching Danae decides to take a break from trying. While at church she hears about a volunteering opportunity at a woman's shelter. These women have been abused and flee from their abusers and get put in a safe house. Danae does the training and starts her volunteering. Her first night there Misty and her son Austin come to stay. Austin is bruised and bloody. Danae takes a liking to The little boy. But she doesn't want to get too attached. Volunteering ends up being really good for Danae and she starts basically letting God choose her path and accepting it. So she's happier and in better spirits. After Misty's husband comes to the shelter and beats her up she asks Danae and Dallas to take Austin for Thanksgiving because she doesn't want him around her crazy family. Danae and Dallas take him to Thanksgiving. Misty goes home to St. Louis and is trying to figure out what she wants to do next. After the holidays they can't get ahold of Misty and start really worrying about her only to find out she's been arrested. After lots of legal stuff concerning Austin Misty wants Danae and Dallas to keep him. They also get another surprise and it ends up being really great for their little family. I found this book to be well written and it was so easy to become completely invested in this family. I found myself crying happy tears with them. I have already added books 1&2 to my to be read list and plan to read them when I have time. Good book"}, {"userName": "Susan Snodgrass", "userReviewDate": "Nov 05, 2015", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "I just this minute closed the book on Deborah Raney's third book in her Chicory Inn series, 'Another Way Home'. So far, it's my favorite in the series, too. I spent a goodly amount of time crying and then grinning from ear to ear.This book tells Danae and Dallas's story. They have wanted a baby for so long, endured years of treatment, all to no avail. Dallas will not even discuss adoption and Danae's heart seems to break nearly every day. She decides to do some volunteer work, hoping to keep her mind off her infertility. Deborah Raney never, ever disappoints with her books. Not even one little tiny bit. When I begin to read her books, I feel as if I've settled down into a comfy chair and I'm just home somehow. They just feel good. She writes with such strength and courage, creating characters that stick with you long after you close the last page of the book. She brings us into her characters' struggles and heartbreak and we find ourselves just about to pray for them ourselves! Deborah creates stories that are so real in today's world and grabs the reader right into that make believe world that, somehow, doesn't really seem like make believe. Her words are rich, her situations real and her strong faith shines through her books like a beacon. I love how she brings her characters through with their faith in God. It's amazing to watch these folks grow in the Lord and trust Him for all their life situations. With this family, Audrey and Grant Whitman and their children, Raney has created an enduring legacy of love, courage and a strong depth of faith. I wish I had the next book already! I highly recommend this series and anything Deborah Raney writes! *I was given a copy of this book by the publisher in exchange for an honest review, which I have given. My opinions are my own."}, {"userName": "Kav", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/6025638-kav", "userReview": "Another addition to the stunning Chicory Inn series. Definitely reads fine as a standalone, though I think you'll get the most out of the story if you've read the first two books, Home to Chicory Lane and Two Roads Home. Another Way Home is a multigenerational tale told from the viewpoints of Audrey and Grant Whitman and their daughter Danae and son-in-law Dallas. Love the complexities in this family's life and the special relationship that bridges four generations. Audrey and Grant are the anchor, their steadfast faith standing in the gap whenever it is called for.  And this time it is Danae and Dallas who need help navigating the complexities of married life. I am a huge fan of reading a married couple's love story. Too often romance readers are left hanging at the 'and they lived happily ever after' end of a book. No mention of the gnarly bits and life messes that make up our everyday reality. Raney invites us into the imperfect world of Danae and Dallas. There's no question that these two love each other but their struggles with infertility have brought division into their marriage. Rife with stress, full of heartache and indecision, their story touched me deeply. I was at odds, championing them both, wishing I could wave a magic wand and fix it all for them. Raney does better than that. She sets them on an incredible journey of discovery. There's plenty of twists and turns and gasp-out-loud moments. But then, there it is, the 'aha' moment that gave my goosebumps goosebumps. Because Dallas and Danae's story proclaims that God always has a plan, even in the midst of our darkest hour. And that plan far exceeds even our most outrageous imaginings.  Thanks to Litfuse Publicity Group and Abingdon Press for providing me with a copy of this book."}, {"userName": "Jeanie", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/5130755-jeanie", "userReview": "Sometimes life's greatest adventures and greatest blessings were found by taking another way home. A prose on the longings of the a heart, the pain of love that is lost, and parenthood. Dallas and Danae have been trying to start a family of their own and have felt the frustration and pain of being denied a good thing. When Danae's younger sister is pregnant again with their 4th, she can't help but feel angry, hurt, and lost. Dallas feels the loss as well and together they agree to take a break from the fertility fiasco. To direct her pain from herself, Danae starts to volunteer at a safe home for abused woman and their children. It is there that she discovers what she is made of and the faithfulness of God.I loved the rawness of Danae and Dallas emotions and how they together came to terms of the hurt and pain of not being able to conceive. Dallas himself was adopted and suffered from identity crisis and could not see past his pain to adopt himself with Danae. Dallas's journey in this process was a spiritual one that required faith and seeing with different eyes. It was a great perspective. I found myself emotional at times and very encouraged that God does lead a different way home. A home where we find acceptance, stability, and love.A Special Thank You to Abingdon Press and Netgalley for the ARC and the opportunity to post an honest review."}, {"userName": "Alyssa", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/5168580-alyssa", "userReview": "So far, we've had just a glimpse of Danae and her husband Dallas' struggle to conceive a child. Now finally in book three 'Another Way Home' we are getting the full story. Danae does quickly come to realize that she has been laser focused on having a baby and thus decides to volunteer at a local women's shelter home. This is where she meets Misty, a woman who has finally run from her abusive husband after he hit her son. Through a series of events, Danae and Dallas are soon on the rollercoaster that is adoption, something Dallas experienced as a kid and never wanted to do as a married couple. There are some twists and turns that aren't completely unexpected if you are familiar with adoption in anyway. However, it is still stressful and heart wrenching to read. Overall, I liked this one more than book two, 'Two Roads Home', but can't decide if it is my overall favorite or not. A struggling marriage, high stakes, tough decisions, and trying to determine God's will over our own feelings, 'Another Way Home' is easily worth 4 stars. This is a series you should check out if you enjoy family sagas, miracles, and families who come together.I received a copy of this book from the publisher via Litfuse Publicity in exchange for an honest review. All opinions are my own.See more of this review and others like it at Sunrise Avenue"}, {"userName": "Tia", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/4923882-tia", "userReview": "This is the third book in the Chicory Inn Series. Come join Dallas and Danae Brooks as they tread the waters of infertility and face the question of adoption. Danae begins a journey of trying to find purpose in her life when she volunteers through her church at a shelter for battered women through her church. The women that she comes to know through the shelter starts giving her purpose.Will Dallas still be stubborn or will he bend to the idea of adoption? What will happen to him and Danae?My feelings about Danae .... yes, she seems a little distant and at times even short with her sisters who do not seem to have any problems conceiving. How would you respond when everyone around you seems to have no problems having children? How do you tread the waters of infertility, adoption and even foster parenting?Join Danae and Dallas as they find their way in the book Another Way Home.***This book deals with foster parenting, adoption and includes Domestic Violence too***I received this book free from Litfuse Publicity Group for review. I did not receive any monetary compensation for a favorable or non-favorable review of this read."}, {"userName": "Rhonda", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/6337144-rhonda", "userReview": "Deborah Raney has gotten right to the heart of the painful emotions of infertility for Dallas and Danae, and their extended family, who is hurting right along with them. Dallas has special reasons for being opposed to adoption but he does not feel comfortable sharing them with his wife or family at first. Will volunteering at the women's shelter bring it all to a head for them and break the dam open for Dallas? Danae has feelings of resentment and envy towards her sisters and feels guilty about that. They all feel they must walk on eggshells around Danae so they don't cause her further hurt feelings.  This is a beautiful, heart-wrenchging story of pain and raw emotion. The women at the shelter are escaping abusive situations and that brings its own level of pain for them and all those who volunteer with them. I love the setting of this series as well. The Bed and Breakfast that Grant and Audrey have established is absolutely beautiful and the perfect setting for the family gatherings.  I rated this book 5 stars and highly recommend it.  I received a free ebook from netgalley in exchange for my honest review."}, {"userName": "Laura", "userReviewDate": "Oct 29, 2015", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "ANOTHER WAY HOME is the third book in the ongoing Chicory Inn family saga. Readers will want to read this book in order as the series really doesn't stand alone. I am looking forward to the fourth book in this series coming in 2016. I didn't think at first I cared for Danae. She is whiny, crying all the time, and her husband is almost ready to flee for the hills. I understand why she is that way, I'm sure any woman who doesn't have a family and so desperately wants one would be the same. (I was blessed with children) But then she listened to Dallas, found a job to take her mind off it (even if the job wasn't one he exactly approved of, but God was in it.) A beautiful, heartwarming tale of family, of sisters, of husband and wife relationship, and of God's hand working quietly behind the scenes to answer prayers in a way no one imagined. The first two books are Home to Chicory Inn and Two Roads Home"}, {"userName": "Cheryl Baranski", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/7741612-cheryl-baranski", "userReview": "Emotionally captivating! Another Way Home, By: Deborah RaneyAnother Way Home is book number three of the series A Chicory Inn. I was captivated right from the start with this most wonderful book. I so enjoyed reading this new story of Dallas and Danae Brooks. When life throws them a big curve ball they are soon faced with unexpected decisions. A book with so much faith, love, trust, heartache and pain. A story that will pull on your heartstrings like no other. I loved the strong faith in this story. Be prepared for an emotional roller coaster of a ride when you read this wonderful story. Be sure to order you copy of Another Way Home today! 5 stars!"}, {"userName": "Amber", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/1406283-amber", "userReview": "This was a good book. I really liked reading it."}, {"userName": "Sandra de koning-vd pol", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/22995557-sandra-de-koning-vd-pol", "userReview": "Vertrouwen...weer een heerlijk weg lezen. *op zoek gaat naar deel IV*"}, {"userName": "Barbara", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/2480339-barbara", "userReview": "Another Way Home by Deborah Raney is the third in her Chicory Inn series involving the family of empty nesters Grant and Audrey Whitman, who have turned their family home into a bed and breakfast. (The first was Home to Chicory Lane; the second, Two Roads Home.) Though the whole family of their adult children, sons- and daughter-in-law, and grandchildren are in every book, each book in the series focuses on one particular child and his or her family.This time the spotlight shines on middle daughter Danae and her husband Dallas. They have been trying to conceive for years with no results except tension in their marriage and resentment and hurt on Danae’s part. She’s particularly stung when sister Corrinne becomes pregnant – again – unexpectedly without even trying. Danae can’t keep her resentment from showing, and Corrinne feels guilty and unsure when to even announce her news to the family. Though the family empathizes and tries to be sensitive, Danae resents their well-meaning questions and concerns and sympathy. Dallas especially feels he has to constantly walk on eggshells around Danae. Dallas won’t even discuss the possibility of adoption, for reasons which he won’t share, even though he himself was adopted and raised by a loving family.Danae decides they should stop fertility treatments and the quest to have a baby for a while. To try to occupy herself, she responds to an announcement at church asking for volunteers at a women’s shelter. There she becomes friends with another older volunteer, Bertha, and gets involved in the lives of one of the women there and her son.I don’t want to say any more than that so as not to give the story away.I love how Deborah doesn’t sugarcoat any of the facets of the story. All of the characters’ struggles are gritty and realistic while they seek for God’s direction, provision, and grace."}, {"userName": "Pam", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/5016413-pam", "userReview": "Though all the Whitman family appears in this book, this is Danae and Dallas' story. After trying for several years to get pregnant, including fertility treatments, they are both a bit of a mess and their marriage is suffering. Deciding she didn't like the person she'd become, Danae resolves to take a break from all the trying and find something better to devote her time to. After hearing at church about a safe haven for women, Danae decides to volunteer. This is a life changing decision. Besides infertility, the book touches on the plight of battered women and their children, adoption, and ultimately, waiting on God for his perfect timing. I am really enjoying this family saga and like the way the author includes all of the family in each book, though focusing on one couple."}, {"userName": "Staci", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "This is my favorite of the Chicory Inn Series so far.Danae is the second oldest in her family. She and Dallas have watched for years as her other siblings had planned and unplanned children. All the while, they have been praying and going through fertility treatments to have a child of their own.This novel was a great example of how we have our plans and God has His. Another Way Home was an engaging read and one that just might bring a tear to your eye.I look forward to the next in the series."}, {"userName": "Marbaer", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/21879265-marbaer", "userReview": "I read this book because it was the last book my friend Joan read before passing away on Tuesday. This book was not even a blimp on my radar of future books to read, however I am glad I did. The title alone was symbolic to her passing. The correlations to her life and the main character were similar. But what I was reminded of the most was to be grateful for what I do have and know that I don't always get my prayers answered in the way I think they should be, but they are answered all the same."}, {"userName": "Suzy", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/715855-suzy", "userReview": "It was a good read about a couple going through infertility issues while their own families were having children. Although I sometimes thought the wife at the beginning of the story wasn't being fair to her husband, but I don't want to give too much away!"}, {"userName": "Caryl", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/20665226-caryl", "userReview": "I adore the Whitman family! I enjoyed watching as they worked through hard issues while relying on a faithful God. This book is hard to put down."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "I have to say, Deborah Raney, you had me! By the time I reached the end of this novel I could not see the way you guided the reader through what God's plans had been all along for the Brooks family. By the time I reached the end, it all made perfect sense and that is the way life is. It may not make sense for us while we are struggling with trials and adversity in our life, until we get much further down the road and can look back and clearly see the fingerprints of God unmistakably on what we just went through without knowing why. Another Way Home from Deborah Raney is the third book in the Chicory Inn series, involving Grant and Audrey, who have decided in their golden years to turn their much beloved home of raising 5 children who have now grown and moved on, into an inn for guests. The family still lives in close proximity to their parents and every Tuesday night boasts family night at the Inn for the family to get together and simply enjoy being a family over a well planned and prepared pot luck meal. Now that fall is approaching along with the holidays, Dallas and Danae have been attempting to start their family for quite some time. While the older sisters are well on their way, it makes each month difficult with they remain childless. The couple have now resolved to look at more options such as infertility and even that seems to be working against their best laid prayers to God from both them and their family and friends. It has also placed a huge strain on the couple marriage as each new treatment offers initial hope, but ultimately another month of still no child in their future. Dallas is opposed to adoption being the by-product of such an adoption and he doesn't want the same thing he dealt with to happen to their future child. His own mother rejected him as unwanted when he attempted to contact her at 18. As that appears to be the only option left for them to start a family, the Brooks decided to take some time off from trying and instead pursue other passions. Dallas returns to work and Danae takes up volunteering at a nearby domestic shelter for mothers and women in abusive relationships looking for an out. What neither of them say coming would tragically change their lives forever. I received Another Way Home by Deborah Raney compliments of Abingdon Press and Litfuse Publicity for my honest review. I did not receive any monetary compensation, aside from a free copy of the book to review, for my honest opinion. This is such a perfect title to sum up the entire scenario that Dallas and Danae have to walk through in their married life, and it was one that captivated this reader's attention from the time I picked up the novel until the very end. I am happy that this is not the conclusion of this amazing series and family and readers get a sneak peek at the upcoming novel, Close to Home, at the conclusion of this one along with a reader's discussion guide that is just perfect for book clubs. I had never considered how difficult it would be for a couple to try for a child only to not be able to get pregnant while everyone else in their family is able to do so without really trying. I love the way this one turned out in the end, not the happy ever after ending you would expect, but than again real life never goes according to our plans. I easily give this one a 4.5 out of 5 stars."}, {"userName": "Carole Jarvis", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/2054668-carole-jarvis", "userReview": "Reviewed at The Power of Words: http://bit.ly/1MYaDZ5Another Way Home is a moving story, book #3 in a series that is quite excellent. It’s a story about family – a big extended, multigenerational family that shares in each other’s joys and heartbreaks. Returning to Grant and Audrey’s B&B in the Cape Girardeau, Missouri area near the Mississippi River is a delight. Well written and highly entertaining, this story is also relevant for two reasons . . . One, because so many people deal with the agonizing disappointment of infertility today, and two, the importance of having an attitude of gratitude in our hearts every single day.I love romance novels as much as anyone, but it’s the stories of a marriage that are my favorite – and Deborah’s Chicory Inn series is a gem. Danae and Dallas are struggling in Another Way Home, yet there’s never any doubt that they love each other deeply. But Danae has what is called “unexplained infertility” and Dallas has personal reasons for not wanting to adopt. These characters are very real and it was easy to feel for both of them.Danae had become self-absorbed, totally focused on having a baby, to the extent that her family walked on eggshells around her. And her focus became a spiritual matter, for Danae felt that if they didn’t have a baby, “she wasn’t sure she could go on believing in a loving, caring, fair God.” Although I never went as far as Danae’s extremes, I can relate to her longing because it took several years before we were blessed with children. The same frustrations, the monthly disappointment, the remarks of well-intentioned friends as to when we were going to start a family were all there. The best part is seeing Danae’s gradual transformation as her eyes are opened to the plight of women in the shelter where she volunteers, and she reaches the place we all have to arrive at sooner or later – the point where God’s will matters more than our own. And Danae’s attitude of gratitude especially strikes a chord during this Thanksgiving season.I think the title of this story will always stay with me, for it gently reminds me that God always has a plan, the results of which will be beyond anything we could ever have imagined.There are some emotional, heart wrenching moments in this story, as well as moments of sublime joy that will thrill readers. I greatly enjoy women’s fiction and wish there was more of this genre in Christian fiction. Dallas’s brother, Drew, was a part of this story, often serving as a sounding board and providing accountability. I liked him very much and felt the stage was being set for his story, so I hope we see more of him. I’m so glad there’s more to come in this series and eagerly anticipate book #4, Close to Home. Recommended.Thank you to Litfuse Publicity and Abingdon Press for providing a copy of this book in exchange for my honest review."}, {"userName": "Deb Haggerty", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/60508881-deb-haggerty", "userReview": "Deb’s Dozen: God answers our prayers in the most unexpected ways—always have faith!Another Way Home, the third book in Deb Raney’s Chicory Inn Novels, brings us deeper into the lives of Grant and Audrey’s daughter, Danae, and her husband, Dallas Brooks. Danae has suffered for years over not being able to get pregnant—especially since her sisters seem to pop kids out on demand. Danae is willing to consider adoption, but Dallas won’t hear of adoption and worse, won’t talk about why not.In an attempt to find meaning in her life, Danae begins working at a safe house for abused women and children. Dallas, although uneasy about the situation, accedes to her desire to do so. Danae gives her heart to these women and children all the while wondering why she cannot become a mother.Finally, just before Thanksgiving, Danae finds peace in her heart and can welcome the thought of the new baby her sister is going to bear. Thanksgiving weekend, however, brings chaos and a situation that could change all of their lives forever.I’m liking the Chicory Inn series. Deb Raney has the ability to bring tough topics that occur in many families to the surface and to deal with them gently and with hope. I could identify with Danae—I was unable to have children of my body myself. I know the anguish of fertility drugs and schedules and the total depression that follows yet another failure to conceive. Deb portrays this struggle with realism and grace. The characters of Dallas and Danae are realistic and we can accompany them on their ups and downs all the while rooting for a successful outcome to their problems.If you like true to life and realistic stories, with romance and trials and twists and turns strewn throughout, you’ll like Another Way Home: A Chicory Inn Novel – Book 3. And you’ll smile at the lovingkindness our Lord often displays to us when we have faith. Four stars.Deborah Raney’s books have won numerous awards, including the RITA, National Readers’ Choice Award, HOLT Medallion, and the Carol Award, and have twice been Christy Award finalists. She and her husband, Ken, recently traded small-town life in Kansas—the setting of many of Deborah’s novels—for life in the (relatively) big city of Wichita, where they enjoy gardening, antiquing, movies, and traveling to visit four children and a growing brood of grandchildren who all live much too far away. Find out more about Deb at DeborahRaney.com.Abingdon Press gave me this book in exchange for my unbiased review."}, {"userName": "Beckie Burnham", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/2952739-beckie-burnham", "userReview": "A recent commenter on a FB page stated they were tired of reading books that were only about the chase — romances focused on the action leading up to happily-ever-after. She wanted to know were there any books featuring the rest of the story — doing life together. If you are like that commentator, someone who wants real life stories featuring couples facing life’s struggles and doing it God’s way, then be sure to check out Deborah Raney’s latest book in her Chicory Inn series, Another Way Home. This touching novel is a recommended read.Danae and Dallas Brooks want children, but their quest is just not working out for them. It seems like everyone is having babies but them. As Danae faces frustrating and discouraging fertility treatments and Dallas buries the hurt from his own adoption story, they see their marriage deteriorating from stress. When God seems to be saying no, they face the task of remaining faithful and grateful.Another Way Home again features the Whitman family — a large, close-knit and multi-generational family. This time the Whitman’s second daughter and husband are the focus of a story that is relevant for so many families today. Infertility is pain-filled, and no matter how supportive friends and family are, it is an incredibly lonely journey. Raney creates real and relatable characters in Danae and Dallas. She feels inadequate and empty; he worries he is not enough for her. Added to the infertility, is Dallas’ deeply buried scars from the rejection of his birth mother. But as Danae seeks to live a life marked with more gratitude than petitions (p 105), the Brooks marriage changes and strengthens. Danae realizes that God seemed to be assigning her exercises in generosity in an effort to teach her an attitude of gratitude (p 106). In a process that often is centered on the end results, Raney’s message is the gift of children. I loved that. There are lots of twists, turns and emotional highs and lows in Dallas and Danae’s story, but God proves Himself ever faithful. You are going to love the scene when Danae discovers the timing of God’s answer to her prayers.Another Way Home is a wonderful book. I laughed and cried along with Danae and Dallas. And when the last page was turned, I was extremely satisfied. This one is another winner from Raney. I can’t wait for more from the Whitman family.Recommended.Audience: adults.(Thanks to LitFuse and Abingdon for a review copy. All opinions expressed are mine alone.)"}, {"userName": "Julie D.", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/15394532-julie-d", "userReview": "This book is part of the Chicory Inn series. If you haven't read any of the books before this one, don't worry, you won't be lost. The author does a very good job of keeping this story complete and the characters are fully explained so you won't feel as though you're missing something. This story focuses on Danae and her husband, Dallas. Danae is the daughter of Grant and Audrey, who own the Chicory Inn bed and breakfast. Danae has been trying desperately to get pregnant for years and her whole focus and world is wrapped up in the fact that she hasn't been able to conceive yet. She and Dallas have spent a lot of money on fertility treatments to no avail and now it's starting to put a strain on their marriage. The greatest strain is Danae's attitude because she feels like there's something wrong with her and she's getting very selfish in her attitudes.  Adoption has been brought up to them but this is something Dallas won't even consider, even though he was adopted himself. It's not exactly clear at first why he's so against it since he had a very happy childhood with loving parents. As you follow along in the story, this is finally revealed why he's so apprehensive about it. Finally, Danae realizes that she needs to put her focus somewhere else when her sister gets pregnant, again, and she is jealous and less than kind or happy for her sister. Her church has a ministry that helps a women's shelter for abused women and she feels led to get involved with this. This opens up a whole new world to her and gives her an outlet for giving of herself. This opens new doors for her and her husband that will change their lives forever. I absolutely love this family. I have read all the books in this series and feel like I know these people. They are so real in their faith and in their lives and you really feel as though you're reading about real people instead of a novel. You'll laugh and cry along with them because you'll grow to love them so much. I just couldn't put this book down, which is how I felt about all the others I've read, too. That's why I'm going to recommend you read all the books in this series because you'll love them. I highly recommend this book - the story and the characters will stay with you! I give this book 5 out of 5 stars. *This book was provided to me for my honest review by LitFuse Publicity Group"}], "description": "Grant and Audrey are adding grandchildren to their family left and right, but middle daughte, Danae, and her husband, Dallas Brooks, have been trying for years with no baby in sight.Though Danae is ready to consider adoption, Dallas will not even discuss it. Despairing of ever having a family of her own, Danae decides to pour her passion and energies into volunteer work with a newly opened women’s shelter in town. Looking for a good cause to fill her lonely days, she never expects to give her heart to the hurting women she meets there. She’s finally learning to live her life with gratitude, but then heart-wrenching events on Thanksgiving weekend threaten to pull the entire Whitman clan into turmoil—and leave them all forever changed.", "title": "Another Way Home\n      \n          (Chicory Inn #3)", "url": "https://www.goodreads.com/book/show/27237692-another-way-home", "average": 4.26, "cover": "https://images.gr-assets.com/books/1445298268l/27237692.jpg", "reviews": 85, "authors": [{"url": "https://www.goodreads.com/author/show/59414.Deborah_Raney", "name": "Deborah Raney"}], "type": ["Christian Fiction", "Contemporary", "Fiction", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/27237692-another-way-home", "http://www.goodreads.com/book/show/26034049-another-way-home", "http://www.goodreads.com/book/show/30526622-droomwens", "http://www.goodreads.com/book/show/6362059-above-all-things", "http://www.goodreads.com/book/show/20981415-because-of-the-rain", "http://www.goodreads.com/book/show/18168267-a-january-bride", "http://www.goodreads.com/book/show/417811.A_Nest_of_Sparrows", "http://www.goodreads.com/book/show/417807.Beneath_a_Southern_Sky"]}