{"ratings": 30, "userreviews": [{"userName": "Debra", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "A quiet weekend in the country, far away from the stress of the outside world sounds like a dream getaway! Mitchell Inn is a warm and inviting Inn which is nestled deep in the forest. Snow is covering the ground adding to the Inn's beauty and charm. It's a place for lovers to enjoy time together, a place where an Author can work on her book, a man can enjoy some alone time, friends can re-connect, and for a couple in an unhappy marriage can take a look at their marriage in a beautiful setting. But the storm is unrelenting - the snow has not stopped falling and soon the roads are not drive-able. The guests and the owner and his son are trapped at the Inn for the weekend! Everyone remains in good spirits. They will make the most of it! They enjoy some drinks and make small talk in the lobby. Everyone goes to bed with hopes of still enjoying their weekend until the next morning when a body is found! It appears their relaxing weekend will not be so relaxing after all.This was a really fun book! Not fun in the funny-I-laughed-out-loud-way but it was a fun and devilishly clever whodunit. This book is an example of a whodunit done right! Shari Lapena has created the perfect setting for this book- a beautiful inn in the middle of the woods. Such atmosphere! This book consists of interesting characters with even more interesting back stories. This is a book I want to tell everyone about but at the same time I also want to tell people to go in knowing as little as possible. I loved watching the characters try and figure out what was happening. They are trapped (by the storm), frightened and tensions are rising. There is obviously a killer in their midst, but who????I thought every single page in this book was wonderful. I have read this Author before and enjoyed her work, but this book knocks it out of the ball park! This is a very clever and well thought out mystery. Women's fiction my foot - this is a mystery book at its best! There is nothing graphic or gory in this book. It won’t scare or titillate but it will keep the reader guessing. Those that follow my reviews, know I like to put on my super sleuth hat and try to figure out whodunit. I did not figure it out, in case you were wondering. If there were clues, I did not see any! I couldn't help but think of Agatha Christie while reading this book. I almost feel as if this book were an homage to Christie - that's my thought- the Author does not say. Nevertheless, I was glued to my seat, turning the pages, and wondering what would happen next.The sheer genius of this book is that not a lot of action takes place, the characters are trapped in the Inn, no one can get to them and they cannot get out. So, the strength of this book lies not only in the carefully thought out plot but in the characters themselves, in their dialogue, their inner thoughts and interactions with others. Each time I had to put this book down, I was disappointed. If I could have sat and read this book in one sitting, I would have. The pacing in this book was spot on! Nothing in this book is rushed, nor is it slow. I was captivated from page one and highly recommend this book! Thank you to Penguin Publishing Group and Edelweiss who provided me with a copy of this book in exchange for an honest review. The thoughts and opinions expressed in this review are my own.Read more of my reviews at www.openbookpost.com"}, {"userName": "Liz Barnsley", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "Excellent. Loved this twisty \"locked room\" Christie type thriller with a remote hotel, a killer on the loose and a storm raging outside so there IS NO ESCAPE. I didn't call the killer either which I LOVE when that happens.Full review for the blog tour in July."}, {"userName": "Yusuf", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/18727194-yusuf", "userReview": "And Then There Were None meets modern day psychological horror? Can we say “dream come true?” Waiting (im)patiently."}, {"userName": "Elaine Tomasso", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/49861138-elaine-tomasso", "userReview": "I would like to thank Netgalley and Random House UK, Transworld Publishers for an advance copy of An Unwanted Guest, a standalone novel set in a remote hotel in the Catskill Mountains.When the remote Mitchell Inn gets snowed in the guests are at a loose end with nothing to do but drink and spend time together. This changes the next morning with a power cut and one of the guests found dead, especially as defence lawyer, David Paley suspects murder. It soon dawns on the guests that with the hotel cut off one of them is a murderer.I thoroughly enjoyed An Unwanted Guest. It is not a long novel and the premise is not particularly realistic or believable but the suspense and intrigue of who and why trump everything else and make the novel compelling and addictive. All the guests seem normal, with one exception, and relatively pleasant but as the novel progresses most of them have dark secrets which are slowly revealed. This too, a chance gathering of so many people with secrets, is not overly plausible to my logical mind but again, it adds to the suspense and makes for a compelling read. I also enjoyed the format of the novel. I'm not normally a fan of multiple points of view but it works extremely well here as the narrative switches from one character to another. The reader gets multiple perspectives on the same events which gives much food for thought and makes the truth even harder to work out but it also fleshes out the characters and really brings them to life. I also felt a warmth to the novel that the circumstances don't suggest, probably because it is so intimate in its portrayal of these characters.An Unwanted Guest is a good read with an unexpected ending which I have no hesitation in recommending."}, {"userName": "Amanda", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/20971541-amanda", "userReview": "Couldn’t wait to start this book after loving her other two books as I knew I would be in for a treat and yes the world could have ended whilst reading this and I wouldn’t have noticed!! The story is about people staying in a country inn they are snowed in without phone coverage and Wi-fi, it is disturbing and thrilling at the same time, lots of secrets to be revealed, kept me guessing who the perpetrator was until the end.  Have a feeling I will read this book again to look for the hidden clues I missed. Definitely my favourite author of 2018 so far , thank you to netgalley for my copy in exchange for my review."}, {"userName": "Thebooktrail", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/25264586-thebooktrail", "userReview": "ooh it's all very 'And then there were none' and whilst not exactly The Shining, there's some strange people in this hotel! A stay in the Catskills, NY, sounds nice doesn't it?There's only a few guests, even fewer staff, the wifi is down and the story is approaching...But the snow-covered landscape is like a dream isn't it?Cut off from everywhere, the chance to relaxOr a nightmare and miles from any chance of escape...THAT was good"}, {"userName": "Stephanie ", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/1007476-stephanie", "userReview": "I’m still not sure what “women’s fiction” actually means…but I am a fan of psychological thrillers, so when I read that Shari Lapena, author of The Couple Next Door (which I enjoyed), had a new book entitles An Unwanted Guest that was labeled under “women’s fiction” and mysteries/thrillers,” I was eager to accept a copy from Penguin Group / Viking and NetGalley in exchange for my honest review.Without revealing too much, just think Ten Little Indians goes to the Catskills…in an entertaining, quick read. The cast of suspects, guests and proprietors of a snowbound inn over a winter weekend includes an attorney who had previously been arrested on suspicion of murdering his wife, a middle-aged husband and wife who are on the verge of separating (unbeknownst to one of them), a war correspondent with PTSD and the friend who brought her on a getaway to help her recover, a rich heir and his gorgeous fiancee…you get the idea. On the first night, one of them turns up dead…possibly an accident? But then the body count increases before the power comes back on and access to civilization is restored on Monday.Along the way, we see what happens when people with lots of secrets are thrown together and trapped by circumstance, then put under stress with plenty of alcohol. Fans of psychological thrillers will appreciate, and although it was a bit over the top with red herrings galore, it is a fun read. Four stars."}, {"userName": "Stacey Camp", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/20435448-stacey-camp", "userReview": "Review to follow!"}, {"userName": "Cindy Bokma", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/363411-cindy-bokma", "userReview": "Excellent novel! I didn't want it to end. I was hooked from page one and was so sad to see it end. I don't rate many books five stars but this one earned it. Well paced, heart pounding, page-turning suspense. What a fantastic author Shari is!"}, {"userName": "Brenda", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/8729871-brenda", "userReview": "This is the book I've been trying to find! Snowstorm, stranded at a hotel, strangers, and murder! The plot was fast paced and didn't linger on unimportant details. I guessed several different murderers and was completely wrong. I just loved everything about this book!"}, {"userName": "Elaine's Reviews", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/34699356-elaine-s-reviews", "userReview": "A bunch of unrelated guests arrive at a remote hotel in the middle of a very bad snowstorm. They are stranded with no electricity or connection to the outside world. Murders are committed. Is there a murderer amongst them or a stranger lurking in the small hotel that they are not aware of bumping them off one by one???This book had me on the edge of my seat from the first chapter, in fact by the middle of the book it's safe to say that my nerves were shot. I was well and truly hooked and guessing right until the very last page. It's a creepy whodunnit that'll have you screaming at the character \"no...don't go...\". The characters are very well drawn out, in fact you start to feel like you know each of them as the book goes on, and each of them has their own secrets. It was terrifying as they turned on each other out of fear, accusing all and any amongst them of murder. It was really a great diversion from the real culprit. A fast paced, suspenseful, tension filled thriller. I loved everything about this book. One of my favourite reads this year. 5*+++"}, {"userName": "Jenn", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/1758041-jenn", "userReview": "I received a digital ARC of this title from Edelweiss for an honest review.Several guests arrive for a stay at a small upstate hotel in New York for a relaxing weekend. There's a massive storm just behind their arrival and they soon find themselves locked in with limited hotel staff and no power with a murder among their number.This book is VERY reminiscent of Agatha Christie. I'm not sure it totally worked for me, but it was very interesting and a very quick read."}, {"userName": "Mayleen", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/2649220-mayleen", "userReview": "A really fun modern day whodunit. Recommending it for readers of Agatha Christie."}], "description": "A remote lodge in upstate New York is the perfect getaway . . . until the bodies start piling up.It's winter in the Catskills and the weather outside is frightful, but Mitchell's Inn is so delightful! The cozy lodge nestled deep in the woods is perfect for a relaxing--maybe even romantic--weekend away. The Inn boasts spacious old rooms with huge wood-burning fireplaces, a well-stocked wine cellar, and opportunities for cross-country skiing, snowshoeing, or just curling up with a book and someone you love. So when the weather takes a turn for the worse, and a blizzard cuts off the electricity--and all contact with the outside world--the guests settle in for the long haul. The power's down but they've got candles, blankets, and wood--a genuine rustic experience! Soon, though, a body turns up--surely an accident. When a second body appears, they start to panic. Then they find a third body. Within the snowed-in paradise, something--or someone--is picking off the guests one by one. They can't leave, and with no cell service, there's no prospect of getting the police in until the weather loosens its icy grip. The weekend getaway has turned deadly. For some couples, it's their first time away. For others, it will be their last. And there's nothing they can do about it but huddle down and hope they can survive the storm.", "title": "An Unwanted Guest", "url": "http://www.goodreads.com/book/show/38533893-an-unwanted-guest", "average": 4.2, "cover": "https://images.gr-assets.com/books/1526389442l/38533893.jpg", "reviews": 14, "authors": [{"url": "https://www.goodreads.com/author/show/1278320.Shari_Lapena", "name": "Shari Lapena"}], "type": ["Thriller", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/38533893-an-unwanted-guest", "http://www.goodreads.com/book/show/37920735-an-unwanted-guest", "http://www.goodreads.com/book/show/37920740-an-unwanted-guest", "http://www.goodreads.com/book/show/28815474-the-couple-next-door", "http://www.goodreads.com/book/show/33984056-a-stranger-in-the-house", "http://www.goodreads.com/book/show/34100136-xxl-leseprobe", "http://www.goodreads.com/book/show/2962909-things-go-flying", "http://www.goodreads.com/book/show/11534238-happiness-economics"]}