{"ratings": 2711, "userreviews": [{"userName": "Rissi", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/16024231-rissi", "userReview": "The beautiful prose that is Jody Hedlund’s style has previously only been found in her adult, inspirational fiction. She had readers swoony over a certain Noble Groom (and a kiss to go with it!) and has taken readers back to many a fascinating era in history. In 2015, Jody took on an unfamiliar genre: Young Adult. Though the novel is still set in historical times, this book is certainly a step back from her usual normal and yet it rises, and in many instances surpasses the expectations readers will have had for the book. The story itself is like a Cinderella-esque fairytale with its own vision of the story. There’s a deadline approaching that unless altered will forever change Rosemarie’s future, and though there is no glass slipper or pumpkin carriage, there is plenty of romance and intrigue as well as a “Prince Charming.” Or as is the case here, three potential heroes – and what dashing young men they are! Each of the heroes is special in their own right.Jody began this saga in her novella The Vow, which I would encourage you to read prior to picking up An Uncertain Choice. It offers some insight and background into Rosemarie’s life and the heartbreak she endures four years later during the events of this novel. Normally I am not any fan of love triangles, which this novel does have a propensity towards, however thanks to its wholesome, innocent heroine, this isn’t the traditional kind of love triangle. Many love triangles introduce us to a wishy-washy heroine who flip-flops between the men vying for her attentions; this novel doesn’t put Rosemarie in that situation. Rosemarie’s emotions are more about realizing what the meaning of love is – what you’re meant to feel, how you know what true love is – versus being undecided about the men she’s faced with. She lived a sheltered life and as a result of the vow, her entire eighteen year life span was in preparation to live a life of solitude. A knowledge she had from the age of fourteen. Don’t misunderstand, Rosemarie isn’t some wilting flower, but she is a young woman coming of age in an era when chivalry and romance was at its best.I have to confess, medieval stories are a hard sell in my reading habits. But having known Jody Hedlund’s previous books, I had little doubt this novel was going to live up to the hype. The first person (we switch off between two perspectives though mainly stay with Rosemarie) prose is beautifully and simplistically perfect. I loved that the details of the time period didn’t overwhelm the fictional story, yet there is still enough to satisfy avid historians. Rosemarie’s courtship is the primary of this novel along with the danger which threatens her happy ending. Balancing the historical aspects with these characters seems to be an asset to the books likability. Some novels get lost in the history, which is all well and good, but when one is reading a fictional tale, I expect more than a textbook read. The book is both interesting with its details and doesn’t shirk on its promise of being an adventurous medieval adventure.Aside from the atmosphere and breath-catching sword fights, this is a perfect easy read for anyone wanting a period read. It sets up what I am sure will be a rewarding series and of course ends with a new threat that might throw Rosemarie into more danger or at the very least mean she’ll have to rise to the occasion of becoming an even better ruler. I love Rosemarie as a heroine. She’s kind (she’s vehemently opposed to torture as means of punishment) and yet desires to become the ruler that her parent’s would be proud of. Given what we learn of Rosemarie and her moral upbringing, she’s well on her way to doing just that.I can honestly say, this is easily one of my favorite YA reads. It officially releases March 3rd, so be sure to add it to your to-be-read.This review originally appeared on Silver Petticoat Review.Sincere thanks to the author and publisher (NetGalley) for a complimentary review copy of this novel."}, {"userName": "Alyssa", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/1586516-alyssa", "userReview": "Wow! That was fantastic!! An Uncertain Choice by Jody Hedlund is a Young Adult Medieval fiction. It is Jody's first foray into Young Adult fiction, as she normally writes Adult Historical fiction. (I highly recommend all of Jody's other novels.) An Uncertain Choice was the perfect Historical YA read. It had everything I was hoping for: Knights, Princesses, sword fights, and swoon-worthy romance. Everybody should read this book. It's the perfect book for Historical fiction fans of ALL ages. Suffice to say I am excited beyond words for Jody's next book which releases October 2015!"}, {"userName": "Erin", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "I have long been a fan of Jody Hedlund's Christian historical romances and was interested in her YA ventures. An Uncertain Choice reminded me of my mother's Kathleen E Woodiwiss books, but much purer. You know the type, where the mere sight of the heroine's love interest sets her \"cheeks aflame and her insides quiver\" Something that I giggle at, but also deliciously enjoy. In this medieval romance, Lady Rosemarie must choose between three handsome knights vying for her affections or commit herself to the convent. But with the sheriff causing problems and her people stricken by a strange illness, will Lady Rosemarie be able to break an ancient oath before her eighteenth birthday? Okay, it's all a bit sugary sweet but I couldn't help but like the book. The chapters are short and it was nice to just read a nice clean story. The only quibble I had was the p.o.v changed many times even within chapters and sometimes it took me a moment to sort out who was talking. All in all, a great tale that I would recommend to the young and young at heart."}, {"userName": "Jaye Knight", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/22751054-jaye-knight", "userReview": "I was a little leery starting An Uncertain Choice. I’d seen several not so great reviews before I started it, so I went in with rather low expectations. I think that might be one reason I enjoyed it. I almost always find myself surprised when I go in with low expectations whether it be books or movies. While the book may have been predictable in areas and perhaps a little silly and unrealistic at times, I liked it quite a bit. I enjoyed the characters, particularly Derrick and the duke. I just loved their nobility. I even liked Rosemarie, which is quite a surprise knowing my usual dislike for female protagonists. Yes, her naiveté and indecisiveness was a bit frustrating at times, she still grew on me. Aside from a few darker moments involving torture and such, this was a light, very fairytale-ish read, especially in the romance department. And who says fairy tale stories can’t be a little silly and unrealistic? Once in a while, you just need fun stories like that to unwind and relax. There was definitely adventure to it as well. I devoured the last quarter of the book, almost skimming because I was so anxious to see what would happen (even if I could predict the ending). So if you’re looking for a (mostly) light and fun fairytale princess-like story, then I recommend checking it out.I received a copy of this book free from BookLook Bloggers in exchange for my honest review."}, {"userName": "Melody", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/43413-melody", "userReview": "Thank you to net galley and Zonderkidz-Books for providing a digital ARC of this novel in exchange for my honest opinion.Everything in this novel is very blunt and surface level. There is no opportunity for discovery, because characters reveal exactly what is on their mind, their motivations, ect. This is not a world that feels thought out to me, or particularly real. I'm fine with it being not necessarily historically accurate. But I don't really get a sense of the larger world in this. Even when talking about the people who the book claims Rosemarie loves so much. What is life like here? What does it look like? Feel like? The poor villagers function more as bad props, and a way to make Rosemarie look better. Which is kind of insulting.Additionally, the world just doesn't seem believable, by any rules established or created. This girl has been living basically on her own since her parents died? And she was given any even pretend semblance of power? In the middle ages? She hasn't been fully taken into the convent she was meant to join? Or shipped off to other family? There was absolutely no explanation about any of this given. Rosemarie mentioned her parents were dead, and we were expected to move on from there. I don't buy it. I wanted to read this novel because of the historical setting, and it's just not what I was hoping.These are not necessarily three dimensional characters. I get no sense of emotional investment from them.Because I felt no connection to the characters, the romance was lackluster. And the competition aspect of it always felt like a thrown reality show. At times I felt like I was reading about the medieval Bachelorette. Watch as contestant number 1 plans an elaborate dinner and a show. The romance has the potential to be a good, subtle slow burn. But again, everything always feels surface level. The stakes are laid out, but I'm not sure why I should care for them. They often don't feel deeply invested in their own journey. A lot of my personal objections to the novel come down to stylistically it wasn't engaging for me. The blunt prose didn't work. The shift between POV seems unnecessary. This, of course, like almost everything, is a matter of taste."}, {"userName": "Kathy", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/1143268-kathy", "userReview": "Loved this beautiful, gentle romance. Odd ending... is there a sequel. Just skip the last couple pages for a perfect ending. Content: Clean"}, {"userName": "Agbbreaze", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/40176438-agbbreaze", "userReview": "I received a free advance reader's copy of this book at the ALA Midwinter conference.Having never read anything by Jody Hedlund before, I wasn't particularly familiar with her writing style or subject matter. Unfortunately, I still found this book seriously disappointing and almost boring enough to give up on half way through.Our protagonist, Lady Rosemarie, is bound by a vow made by her parents to join a convent by her 18th birthday. BUT - there is an escape clause, provided she finds True Love and gets married first. We are, of course, supposed to ignore how utterly unimportant love was in marriages in the middle ages. She gets to spend a month being wooed by three highly eligible knights, because of course she does. There was nothing about this book that was unexpected - clearly she is going to fall for the brave but stoic knight who pays her the least attention (she is, of course, beautiful and kind and totally amazing, and the other two have plenty of things to compliment her on). The villain is the least poorly disguised villain outside of superhero movies, which is frustrating since we're supposed to be like Rosemarie and not know who it is until the last moment. Really, how does she not pick up on this?Anything unexpected that actually did happen felt like an out of place manufactured plot point. The main character trait of Rosemarie, that she is VERY CONCERNED about the well being of her subjects, especially the poor ones, was overplayed so much that it made her almost unlikable. The entire premise, dialog, and actions seemed so out of place from the time period in which it was set that it's hard to properly envision anything.The saving grace was that it was a quick, light read, making it easy to finish."}, {"userName": "Haley S", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/30268420-haley-s", "userReview": "Oh, wow, this book is just so amazing. And, no, this isn't the first time I have read this book. I have read this book at least...hmm...three times, maybe more.Anyway, I love this book. An Uncertain Choice was my first Jody Hedlund book, and it got me hooked. To be honest, I haven't read all of Hedlund's books yet, but I am working on it! So, the whole 'game' between the three knights at Rosemarie left me hanging on the edge of my seat. It was kind of obvious of who she would fall in love with, but that didn't stop me from reading on to make sure my hypothesis was correct. So, I read on...and on...and on. I may not be correct on saying this, but I believe that I finished this book in one night. Yeah, I was excited and intrigued! mean, the first scene is a man being boiled to death. NO! Don't runaway from me now!!! It isn't as creepy as it sounds. There are no details. Believe me, if there were details, I would have dropped the book and ran. And, just so you know, the man does live because...a knight in shining armor comes riding in...(I squealed at that part, by the way.)I totally believe that this book deserves five bright stars--brighter than Sirius, the second brightest star. Title: Uncertain ChoiceAuthor: Jody HedlundAuthor's Website: http://jodyhedlund.com/This review is written in my own opinions and words."}, {"userName": "Melanie Kilsby", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/32298286-melanie-kilsby", "userReview": "A unique coming-of-age historical tale in attempt to find true love. I'm not one for love triangles or love quadruples for that matter. But, I liked how the circumstances forced our heiress into making a tough decision. It was indeed an interesting plot and I loved her sweet nature. Also, I admired her stance against torture! However, after some thought, I would have loved to know more about each suitor; the wonderful Duke who cared so much for her, back stories, etc... The book is small and could have given us more. The ending came as a shock. I'm not sure yet if I liked what all happened, or think it was at all believable, but that is besides the point. Overall I still liked this book very much!"}, {"userName": "Tito", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/21907583-tito", "userReview": "For me this book was just ok. I felt that there wasn't enough depth to the characters, and the romance between Lady Rosemarie and her love interest felt rushed and didn't seem very genuine. However I loved how in the end, Rosemarie discovers that she's a lot braver than she gives herself credit for, and I'm glad that things work out for her.One thing that bothers me however, is the fact that this novel was written in such a juvenile manner. I mean, I've ready one other book by Jody Hedlund that was adult fiction, and it was written perfectly fine. Just because the book is ya, why does that mean the writing quality has to be so unsatisfying? Teenagers are perfectly capable of understanding complex language and ideas, so I don't know why many authors feel the need to dumb ideas and their writing down so much."}, {"userName": "Rebecca", "userReviewDate": "Mar 15, 2015", "userURL": "http://www.goodreads.com/user/show/37192837-rebecca", "userReview": "I am not going to even give this book the dignity of one star, so no stars it is which, I know I don't have on my rating system but no stars basically means it's not worth the paper it's printed on.Four things sum this dull, un-interesting, boring story up:1. Lame plot2. Lame characters3. Lame writing4. Super lame endingThere you have it folks. Basically this book is a complete waste of the precious little time we have on this earth and I wish I hadn't wasted mine reading it. I'm still not sure why I finished it; I guess because I still have a little of my 'hating to not finish a book' syndrome. I need to work on that."}, {"userName": "Sarah", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/5887927-sarah", "userReview": "Age Appropriate For: 12 and up for romance and violenceBest for Ages: 12 and 18This review is full of spoilers. If you want to read this book without knowing the ending, don’t read this.So, I was going to wait until I was in a better mood to do this review, and then I decided that while I was feeling sarcastic and a bit grumpy and a bit silly (I don’t understand how those two go together either, but sometimes they go together with me) I would go ahead and write the review. Perhaps it will come off sounding funny instead of irritated. Before I get started, let me first say that both the main characters show two qualities that I admire. The first is that they both have faith in God. Second, the both not only strive to, but do treat each other in honor and purity even though they are very attracted to each other. I also would like to say that the author did keep me turning pages even when I didn’t particularly care for the book, which is why it got three stars.Now, let me begin on what I thought of MOST of the book. The beginning was the worst part. Could it have been anymore cheesy? One girl is about to be forced by her parents’ vow to enter a life of celibacy (which, obviously is the worst fate that could befall any girl, right?). But then *gasp of surprise* someone discovers that there is a way out: if she finds true love and marries before midnight of heir eighteenth birthday (seriously, I am not joking.)So, three men compete for her hand. You will be shocked at who they are. A rich guy that flatters and gives rich gifts, a poet that brings flowers, and a tough guy who just plays hero sometimes, remains silent most of the time (what? You aren’t surprised?).The middle part of the book was rather interesting, when mysterious accidents happened, but that part didn’t last long. Guess which guy she went for? (How did you know it was the hero guy? Whoever sees that coming?)My biggest complaint really was who the bad guy turned out to be. Yes, she did succeed in horrifying me. Seriously, what is with Christian authors and making the priest into the evil guy? I wanted to throw the book away at that point.Although this book wasn’t terrible, it wasn’t great either. It was far too predictable and cheesy.I received this book from Zondervan in exchange for my honest review. I was under no obligation to write a positive review. The opinions in this review are entirely my own"}, {"userName": "Leah", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/663928-leah", "userReview": "DNF on pg. 119Trying to go through old netgalley novels and this one sounded cute and fun. Unfortunately, Rosemarie is Queen of the Mary Sues and is descended from a long line of Mary Sues: her parents died during the Plague because they insisted on being out in the kingdom to help the sick. Rosemarie has been on her own since then (?! the big, strong manly men were okay with a teenage girl running the realm??) and now she has a month to go until her 18th birthday when she'll enter into a convent. HOWEVER, a loophole was discovered which states that she's able to avoid life as a nun if she finds her true love and marries.What follows is essentially a medieval version of a reality dating show. The neighboring duke brings three knights to woo Rosemarie and my eyes were rolling with each sentence. It reached the point where I couldn't stand hearing again about Rosemarie's beauty, how kind and caring she is, how the townsfolk love her. At one point Rosemarie pouts because two knights showered her with elaborate gifts (jewels, gowns, etc) and the third didn't. Boo hoo.Multiple times Rosemarie muses on selling off possessions in the castle in order to give more to the poor villagers. Her subjects basically were a way to show just how selfless she was and it came across as cheesy. Numerous times Rosemarie delivers leftovers to people, bans all use of torture/punishment. There are better, more believable ways to show a compassionate character and An Uncertain Choice failed miserable in that sense.As for the title, there's nothing uncertain about it - there are two narrators, Rosemarie and the knight she ultimately chooses, so there's no surprise whatsoever. I ended up skimming the final few chapters and things ended exactly as I had assumed (baby and all.) I really wanted to enjoy this one, but it was a disappointment."}, {"userName": "Jamie", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/8586696-jamie", "userReview": "After reading Jody Hedlund’s first YA novel, An Uncertain Choice, I can say without a doubt she has sealed the deal as an all-time favorite author. Whether it’s historical fiction or young adult, you’re in for a treat with one of her novels. With dashing knights, dances, mysteries and romance, this book was not only entertaining for me, but one I’d happily give and recommend to young adults. It’s enjoyable and refreshing, as well as a voice and story that’s needed in the YA genre. Not only did the story keep your attention from the first page, Hedlund effortlessly weaved important lessons throughout the pages. Lessons about discovering who you are and what courage you might not know you have. Plus lessons in love (which teens need today so desperately no?), like not settling, but being with someone who brings out their gifts, passions and desires in life. Have I mentioned that's especially important for the YA audience today? If you can't be yourself, than trust that God has something far better.\"He was kind, but didn't treat me like I was fragile or breakable. Rather he seemed to push me to be better, to do more, and to rise higher.\"Sometimes you just need a touch of fairytale and this one fits the bill perfectly. Plus after the final page, I look forward to what is next!What's one of your favorite fairy tales?(With thanks to Zondervan for a copy of the book in exchange for my honest opinion)Originally posted at http://booksandbeverages.org/2015/02/..."}, {"userName": "Ari Reavis", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/41289617-ari-reavis", "userReview": "This book had romance, mystery, and some action. I liked it a lot. Rosemarie has to fall in love with one of 3 knights within a month... luckily for me, she fell for the guy I was routing for.. I absolutely did not want to see a love triangle develop, so I was relieved she liked one over the others pretty early on. But then someone starts trying to off the suitors and you're trying to figure out who along with the main characters. The one thing that made it drop from 5 stars for me was the indecisiveness and flip flopping of Rosemarie. She changed her opinions and mind soooooo much. All someone had to do was suggest a different outcome or answer and her whole outlook would change. There is a book 2, but this book didn't end on a cliffhanger."}, {"userName": "Shantelle", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/5482096-shantelle", "userReview": "[I really liked how he had picked the one knight for Rosemarie, and he was the one she choose! So sweet and meaningful. (hide spoiler)]"}, {"userName": "Rachelle Cobb", "userReviewDate": "Jan 29, 2015", "userURL": "http://www.goodreads.com/user/show/7116789-rachelle-cobb", "userReview": "Jody Hedlund's historicals usually center around an interesting time in history, so when I heard that she was writing a YA, I was thrilled.When I heard that YA was medieval (my favorite time period), I knew I had to read this story.Lady Rosemarie is determined to honor an ancient vow to be a nun, the particulars of which are a bit tricky. At first this scenario seemed a bit contrived to me, but I soon didn't care about the vow as much as I cared about the test it leads Rosemarie to.Merely a month before her eighteenth birthday, Rosemarie is told there is one--and only one--way out of the vow that will send her to a convent.Fall in love.And she has a month! From that page on, I was swept away, unsure how it would end but sure I did not want to miss the adventure.It is indeed an adventure, although it didn't take me longer than a few pages to recognize who the hero was. Chivalrous and kind but also hesitant about pursuing Rosemarie because her other two suitors are his friends, the hero in this story seems to be the one winning the test...However, there is someone who does not want Rosemarie to fall in love and escape the vow. Who that person turns out to be I won't spoil (although it didn't take me long to figure out his identity, either). While I would have appreciated a bit more depth and mystery to this one, I applaud Jody's first YA medieval. I will be reading the next!"}, {"userName": "Gabrielle", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/14161910-gabrielle", "userReview": "Characters: I thought the main character Rosemarie was naive and gullible. Instead of acting like a strong ruler she constantly let everyone step all over her and make the decisions for her. She made so many stupid decisions ad constantly had to be saved. I cant believe she dd not see anything coming. As for the knights i liked the friendship between them as well as the dynamics between them. I thought none of them were swoon worthy and we never properly got to know them all the characters just felt 2 dimensional.Plot: The plot had a nice pace and it was very entertaining. But the plot was EXTREMELY predictable i saw everything coming from a mile away therefore there was no suspense and i did not care i was just rolling my eyes at the \"twists\" i either saw them coming or i just did not care.Writing Style: The writing was my favorite part it was very whimsical and fluid and flowed nicely. But there was nothing amazing or breathtaking about it eitherSetting: the Medieval Europe setting blended nicely with the characters and i really enjoyed the bright cheery setting as well as the traditional customs of that time period. I really ike that setting in books its definitely one of my favorites if done right. All in all it was entertaining enough but i was underwhelmed and disappointed because it had a great start."}, {"userName": "Zelma", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/16500056-zelma", "userReview": "What a beautiful Young Adult story. Rosemarie is a beautiful young girl just about to turn 18. When her parents died of the plague 4 years prior she found out about the Vow that states when she turns 18 she must become a nun. But 1 month before her 18th birthday she receives the news that if she finds love and marries by midnight on her 18th birthday she can get out of becoming a nun. She was surprised with 3 honorable and brave Knights. First we have Sir Collin a rich suitor with a crooked and endearing smile and quick wit. Then we have Sir Bennet with raven black hair and features of chiseled perfection. Then we have Sir Derrick who has a heart of gold who loves to help the poor but he is very standoffish when it comes to courting Rosemarie. The knights have 1 month to win her favor. Will Rosemarie find her true love in this short time or will she become a nun? Jody Hedlund puts many twists and turns, with fight scenes, mystery, and of course romance. I didn't want the story to end. I recommend to adults and young adults alike."}, {"userName": "Tricia Mingerink", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/36134494-tricia-mingerink", "userReview": "An Uncertain Choice is a delightful romance, but with enough action and mystery to keep it from being sappy or boring. Rosemarie is a wonderful heroine. She is weak and vulnerable, but she has a strong core that keeps her from being helpless. While she needs to be rescued, she also rescues herself at times. Her strength comes from her faith in God, and she has a compassionate heart. A good example of how a young Christian lady should be. The three knights are also well-rounded characters. The book could easily have turned awkward, but it is handled well. The other knights beside the one meant for Rosemarie could have turned into flat characters, but I liked each of them. While I had a favorite for Rosemarie, I loved all three of them and can't wait to read about their happy endings in the rest of the series. Once again, a great book by Jody Hedlund and one I'll be sure to read over and over again!"}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "{Welcome to Teen Week! Every quarter we're going to try and do a Teen Week! A week where every weekday has a new review of a Christian book written just for teens! You’re reading the fourth one of this quarter's! :) }About this book:“Due to her parents' promise at her birth, Lady Rosemarie has been prepared to become a nun on the day she turns eighteen. Then, a month before her birthday, a friend of her father's enters the kingdom and proclaims her parents' will left a second choice. If Rosemarie can marry before the eve of her eighteenth year, she will be exempt from the ancient vow.  Before long, Rosemarie is presented with the three most handsome and brave knights in the land. But when the competition for her heart seemingly results in a knight playing foul, she begins to wonder if the cloister is the best place after all. If only one of the knights the one who appears the most guilty had not already captured her heart.”Series: Book #1 in the “An Uncertain Choice” series. {There is am e-book prologue, “The Vow”, but I have not read it.}Spiritual Content- Mentions of those in the Bible; Talks about God & God’s will (though the ‘H’s are not capital when referring to God); The Catholic faith and a monk/abbot; Prayers & going to the chapel to pray; The Lord’s Prayer is mentioned and a couple lines are written out; Lady Rosemarie is almost a nun.*Note: a Mention of a Greek god; Mentions of the devil.Negative Content- Minor cussing including: a ‘wretches’; Mentions of torturing, beheading, cutting out organs, and boiling criminals alive (semi-detailed); Blood & Fighting (semi-detailed); Nightmares (semi-detailed); Mentions of murder & poison. Sexual Content- a not-detailed kiss and Three semi-detailed kisses; Two almost kisses; Hand kisses; Thinking about kissing & kisses; The knights stare at Lady Rosemarie’s lips; Staring & Noticing; Touches & Warmth (barely-above-not-detailed to semi-detailed); It’s said that Lady Rosemarie is destined for celibacy; a mention of “the pleasure of a woman”; The abbot is worried that the knights will tempt the “pure and undefiled” Lady Rosemarie; a mention that God “designed the basic attraction between men and women.”; The jerk-of-a-sheriff says “You wouldn’t dare disobey Lady Rosemarie, would you? Not when you hope to win her into your bed.”; Love, falling in love & the emotions. -Lady Rosemarie-Sir Derrick 1st person P.O.V. switches between Lady Rosemarie and Derrick Set in 1390 {Medieval} 254 pages ~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Pre Teens- One StarNew Teens- One StarEarly High School Teens- Two Stars Older High School Teens- Three StarsMy personal Rating- Two Stars (and a half) {Sensitive girls will want to stay away of this book because of all the torture.}This definitely wasn’t the best Medieval book I’ve read, it was a lot harsher than any of Melanie Dickerson or Lisa T. Bergren ones. “An Uncertain Choice” was very blunt and kind of, well, fluffy in the actually storyline but harsh in the torture. Lady Rosemarie was just a little too perfect; I’m not sure how to explain it. I was already hesitant to read another Jody Hedlund book after her book released last year. Whether or not I’ll read another by her, I’m not sure. Link to review:http://booksforchristiangirls.blogspo...*BFCG may (Read the review to see) recommend this book by this author. It does not mean I recommend all the books by this author.*I received this book for free from the Publisher (Zondervan) for this review."}, {"userName": "Kara", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/6137018-kara", "userReview": "*i won this book, wow!! feeling blessed* oh my, simply loving this book! Rosemarie is such a wonderful character, so grateful to Hedlund for writing such an honorable and enjoyable YA Christian book that catches your attention from the first page :) This book is worth so much more than 5 stars to me, simply one of the best YA books I've ever read and definitely a favorite for 2015 <3 Simply loved the story from the first page! Rosemarie puts God and her people first and is ready to move to the convent on her 18th birthday as her parents requested before they died. She's even considering how to be an honorable ruler from the convent. Then the Duke, her father's best friend, comes around and proposes a challenge for Rosemarie to consider. She only wants to do God's will and lead her people in a worthy manner, her own desires were a distant third consideration to all of that.I REALLY wanted to know which knight presented himself in the beginning helping the torture ritual to stop. Couldn't relax until he was revealed and loved the scene which Rosemarie figured him out :) MINOR SPOILER.....................................................................................................................................................I also realized he had no money early on, but he had so much more to offer than riches.I won this book from Hedlund's giveaway and so thrilled to get a copy!! I also loved the ending and CAN'T WAIT for more YA books from Hedlund (hopefully Book 2 is on the way)!!!! Highly, highly recommend this for anyone looking for a cute and adventurous story with honor, family, and true love. My favorite knight was Derrick, but all three enhanced the plot greatly, big time thumbs up :)"}, {"userName": "Karleigh.Reads", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/17554541-karleigh-reads", "userReview": "This was kindly sent my way from the publishers via Netgalley for an honest review.This is your typical find your true love before this date at midnight or be forever alone. Rosemary was promised as a baby to convent on her 18th birthday. Her godfather finds a loophole in the arrangement, if Rosemary can find her one true love before midnight of her 18th birthday then she doesn't have to live her life as a nun. Although I knew who was going to be her pick right off the bat, it was a very enjoyable book. It was a quick read, beautifully written, and just all around a solid book. There is action, mystery, twists and turns, but comes together in a very beautiful ending. I picked this book out because of the cover, I love this time era - of kinds and queens, courts and castles. I can't get enough of it. I loved the flirting and the courting in this book between Rosemary and the three men. It was fun to go through her journey of falling in love with one of the knights. Don't think this is just a sappy romance novel though, there is death, there is mystery, and most of what always happens in court - backstabbing. I enjoyed this book very much.4 out of 5 stars!! My Blog"}, {"userName": "Zoë", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/22178864-zo", "userReview": "This book was very good! I really loved it and enjoyed it so much! The love story was da bomb <3!!!! Sir Derrick is my dream husband written down into a book.However, despite this amazing love story, and the amazing rating I gave the book, I must warn a few things. This book is placed as youth fiction, but there are quite a few torture scenes in it that are surprisingly graphic and nearly made me gag a few times- and I'm an older teen, so I'm sure it would be quite disturbing for younger, more genteel teens and tweens.Also, the entire reason for there being a vow--which is the very basis for this book-- is extremely cultic and not at all a representation of true faith and Christianity.And third, there were a few minor details that I noticed were historically inaccurate to this time. But unless you are a historian and very picky and knowledgeable about these things, I am sure that you won't notice or be bothered by these things.But despite these three things, this book was very enjoyable and created an exciting story that I'm sure you'll love :)"}, {"userName": "Jo", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/3721054-jo", "userReview": "I spent most of the book being so frustrated by the main character. She was the most indecisive protagonist I have ever seen. And don't even get me started on how much she needed a man to correct her faults and make her stronger. It seems Christian fiction has let me down again."}, {"userName": "Kerry Johnson", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/5282590-kerry-johnson", "userReview": "There's only one bad thing about a Jody Hedlund book. They always end. What's a loyal reader to do? Keep reading, of course! Jody's latest is a little different than her usual historical romance fare, but a lot enjoyable. She's an author who never, ever disappoints. An Uncertain Choice is exciting, romantic, mysterious, and a tad gruesome. Medieval torture was, well, torturous.An Uncertain Choice combines all the expected elements of a Jody Hedlund story: strong, likeable characters; crackling romantic tension; fascinating historical detail; seemingly-insurmountable conflict; and a satisfying ending that elicits a sigh from the reader. Maybe two. About the story:\"Due to her parents' promise at her birth, Lady Rosemarie has been prepared to become a nun on the day she turns eighteen. Then, a month before her birthday, a friend of her father's enters the kingdom and proclaims her parents' will left a second choice--if Rosemarie can marry before the eve of her eighteenth year, she will be exempt from the ancient vow.Before long, Rosemarie is presented with the three most handsome and brave knights in the land. But when the competition for her heart seemingly results in a knight playing foul, she begins to wonder if the convent is the best place after all. If only one of the knights--the one who appears the most guilty--had not already captured her heart.\"Main character Lady Rosemarie is compassionate and strong-willed, and still learning how to lead her people. The three knights she meets in the competition for her heart and hand are likeable and honorable, with one in particular standing out among them. No spoilers, but sigh. He's a keeper. And in light of the furor over a particular book (and now, movie) that's out, I appreciate that Jody's latest story is all shades of appropriate for teenagers up through adults. Jody Hedlund is a superlative storyteller, and this young adult story proves Hedlund an author with no writing boundaries. I highly recommend An Uncertain Choice, and eagerly await Jody's next story."}, {"userName": "Katie (ReadiculousGirl)", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/10577582-katie-readiculousgirl", "userReview": "Thank you Zondervan Publishing for the ARC copy. In no way has this affected my review.“An Uncertain Choice” was a well written story for the crowd it was aiming for, and I would’ve really liked to have read this book back when I was in middle school. It is a cute story for young readers and fans of Melanie Dickerson’s fairytale series. Although it was not necessarily my \"cup of tea,\" I think that the author accomplished her goal of creating a medieval fantasy story that a lot of teenagers would enjoy.My only real issue is that I feel like most Christian books base the majority of their stories off of the romance (at least that's how it comes across to me) rather than the main characters’ individual worth and calling in life. Some try to combine romance with personal calling, but a lot of times it feels like a second thought or a last minute edit. I have found this to be quite widespread in the Christian genre, so I’ve gotten used to it whenever I get an ARC, but I do wish that authors would try to break free of that mold more often. Because of the general predictability of these kinds of books, I can usually peg what's going to happen (who's bad and who ends up with who). Jody Hedlund did a good job of writing , but I am just not a huge fan of these kind of books due to that fact. Despite this, though, I can see a lot of young and adult readers enjoying this books, so don't write it off because of my review. \"An Uncertain Choice\" was a cute , clean read that could be fun for new and experienced readers alike."}, {"userName": "Kara", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/7102344-kara", "userReview": "My very first foray into Ms. Hedlund's writing! So many blogging friends have raved over her books which made me wish to read one. And when I heard that she had a YA book coming out, I just knew that would be the perfect one to start. I was right, this story is delightful! A heroine who learns how much strength she really has, three handsome knights to vie for her hand (and let me just say that a certain someone is very swoonworthy! ;), a villain who must be defeated, sword fighting, chivalry, a vow to contend with, and romantic adventures all combine to make for a wonderful story. I loved it! A quick easy read that made me smile at one moment, giggle at another, and shout hurrah when the good guys win. It is fairly short, which does mean that the romance moves rather rapidly. But they are both so sweetly earnest and cute that it doesn't matter in the least. And there's hints to the next story in the series, which has me anxious for it's publishing date! You should read this one. I'm positive that it'll make you grin. :)"}, {"userName": "Dina Sleiman", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/2643813-dina-sleiman", "userReview": "I thoroughly enjoyed this medieval story with its Bachelorette twist. Very fun and more suspenseful than I expected. I didn't love the amount of torture and dark, gritty subject matter, but it served the plot well. And I'm a big fan of Jody's lovely writing style."}, {"userName": "Hannah Schuck", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/75350434-hannah-schuck", "userReview": "Great book! I liked the knights in shining armor twist to it. It is one of my favorite books."}], "description": "Due to her parents' promise at her birth, Lady Rosemarie has been prepared to become a nun on the day she turns eighteen. Then, a month before her birthday, a friend of her father's enters the kingdom and proclaims her parents' will left a second choice. If Rosemarie can marry before the eve of her eighteenth year, she will be exempt from the ancient vow. Before long, Rosemarie is presented with the three most handsome and brave knights in the land. But when the competition for her heart seemingly results in a knight playing foul, she begins to wonder if the cloister is the best place after all. If only one of the knights the one who appears the most guilty had not already captured her heart.", "title": "An Uncertain Choice\n      \n          (An Uncertain Choice #1)", "url": "http://www.goodreads.com/book/show/22900446-an-uncertain-choice", "average": 3.81, "cover": "https://images.gr-assets.com/books/1424718995l/22900446.jpg", "reviews": 499, "authors": [{"url": "https://www.goodreads.com/author/show/3358829.Jody_Hedlund", "name": "Jody Hedlund"}], "type": ["Historical", "Romance", "Young Adult", "Christian Fiction", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/22900446-an-uncertain-choice", "http://www.goodreads.com/book/show/23121816-an-uncertain-choice", "http://www.goodreads.com/book/show/7685228-the-preacher-s-bride", "http://www.goodreads.com/book/show/10329470-the-doctor-s-lady", "http://www.goodreads.com/book/show/12928117-unending-devotion", "http://www.goodreads.com/book/show/15726461-a-noble-groom", "http://www.goodreads.com/book/show/20665078-love-unexpected"]}