{"ratings": 57486, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "“Adventures do occur, but not punctually. Life rarely gives us what we want at the moment we consider appropriate.”\nIllustrations from the Folio Edition by Ian Ribbons.Adela Quested and Mrs. Moore have journeyed to India with the intention of arranging a marriage between Adela and Mrs. Moore’s son Ronny Heaslop. He is the British magistrate of the city of Chandrapore. He is imperial, much more so than when Adela knew him in England. ”India had developed sides of his character that she had never admired. His self-complacency, his censoriousness, his lack of subtlety, all grew vivid beneath a tropic sky; he seemed more indifferent than of old to what was passing in the minds of his fellows, more certain that he was right about them or that if he was wrong it didn’t matter.” My impression is that Heaslop may have been elevated rather quickly and had no time to develop his own ideas of the way things were in India, but simply borrowed the established views of the more senior British officials in India. In this new role he was required to play he is a very different person than the young lad that Adela knew in England. She had decided to break off the engagement and then fate intercedes with a near death experience that allows her to see Heaslop in a different light. The engagement is back on. “Sometimes I think too much fuss is made about marriage. Century after century of carnal embracement and we're still no nearer to understanding one another.” It is always interesting to listen to people talk about marriage. Sometimes people can be too cerebral and talk themselves out of a perfectly acceptable relationship. Others give the commitment of marriage the same amount of thought as they do to deciding what they want for lunch. Arranged marriages used to work perfectly well simply because they were an alliance usually involving money and future offspring. We decided, at some point, that romance was the elixir that we must desire the most in a relationship. Divorce rates have skyrocketed and most people are not any happier than when marriages were arranged for them by their relatives, but free will has given people the idea that happiness can be achieved if they can just find that right person. It is always better to own your unhappiness or happiness instead of having it decided for you. Adela is not very pretty, but she does have some money. Heaslop seems rather indifferent about the whole arrangement. Yes, he wants the marriage, but more for fulfilling a necessary obligation. The sooner it is settled the sooner he can move on to other things of more importance. Adela is trying to decide whether to accept this situation or wait to see if their is a better one on the horizon. \n\n\nDr. Aziz meets Mrs. Moore by chance in a mosque and though their meeting is rocky in the beginning a friendship quickly blossoms. Adela wants to see the real India, by, well, interacting with real Indians. A meeting is arranged with Dr. Aziz and in the course of their conversations with one another Aziz extends an invitation to take them on a journey to see the Marabar Caves. This is one of those invitations that are extended as a courtesy during a party that are never expected to be fulfilled. To his horror, he discovers, a few days later through an intermediary that the women fully expect him to take them to the caves. At great expense to himself he arranges this outing. Aziz has always been a friend of the British, in fact, one of his best friends is a British teacher named Cyril Fielding. He had arranged for Fielding and another friend to go with them on this journey to provide the much needed cultural bridge between him and the ladies. His friends miss the train. Disaster looms. Aziz is accused of physically assaulting Adela in one of the caves. Ridiculous Fielding says. Of course he attacked her the British community insists. All these brutes desire our women. As events unfold it becomes more and more unclear as to what really happened, but even as doubt is raised the Colonialists continue to believe that Aziz is guilty. He must be guilty.This is considered E. M. Forster’s masterpiece and lands on most top 100 books of all time lists. I personally did not enjoy this book as much as I have some of his other books, but because of the subject matter of this book and when it was published, I fully understand why people look on this novel as his most significant book. He was poking a finger in the eye of his own government and their insistence on continuing to try to rule the world with brutality laced with blatant racism. I can see the men, who returned triumphantly from their postings abroad, sitting around their clubs back in London angrily discussing this book. \nI won’t tell you what happened to Adela or what happened to Aziz, but tragically there was a realignment of thought for both of them. Adela never wanted to see India again. Aziz never wanted to see an Englishman/woman again. In fact, for the first time he feels at peace with who he is…”I am an Indian at last.”If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"userName": "Samadrita", "userReviewDate": "Jan 18, 2014", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "Make no mistake. This, to me, will always be Forster's magnum opus even though I am yet to even acquaint myself with the synopses of either Howards End or Maurice. Maybe it is the handicap of my Indian sentimentality that I cannot remedy on whim to fine-tune my capacity for objective assessment. But strip away a colonial India from this layered narrative. Peel away the British Raj too and the concomitant censure that its historical injustices invite. And you will find this to be Forster's unambiguous, lucid vision of humanity languishing in a zone of resentful sociocultural synthesis, his unhesitant condemnation not merely of racism, casteism, religion-ism and what other noxious, vindictive 'ism's we have had throughout the history of our collective existence but of the fatalistic human tendency of rejecting a simple truth in favour of self-justifying contrivances.Yes there's the much hyped 'crime' analyzed in the broader context of presupposed guilt and innocence . There's the issue of race, class and privilege factoring into the ensuing judicial process. The ripples of the eventual fallout of this mishap disrupt the frail status quo that all parties on either side of the race divide were tacitly maintaining so far and pose crucial existential questions before people of all communities. Then there are hypocritical Englishmen who cannot choose between preserving the sanctity of the Empire's administrative machinery and upholding their own prejudices. And hypocritical Indians who righteously accuse the Englishmen of institutionalized hatred while stringently maintaining their own brand of intolerance. But greater than the sum of all these thematic veins is the connecting thread of Forster's sure-footed, measured prose which explores not only the inner lives of the central characters but tries to penetrate the heart of a nation-state in the making.The India depicted here is a foreign country to me - a time and a place yet to be demarcated irreversibly along lines of communal identities that are presently dominating our political rhetoric. It is of little appeal to the newly arrived umpteenth Englishman but, nonetheless, presents itself as an amalgamation of unrealized possibilities. Not once did my brows knit together in frustration on the discovery of any passage or line even casting a whiff of Forster's bias against the people or the land. My senses were stretched taut all the time in an effort to detect any. Sure, Dr. Aziz is a little infantilized and his importance is sometimes reduced to that of a plot device used for manufacturing the central conflict while Adela Quested, Mrs Moore and Mr Fielding appear before a reader as upright individuals who stand for the truth. The other Indian characters seem to be defined by their general pettiness. But these imperfect characterizations can be more than forgiven in the light of what Forster does accomplish.\nThe song of the future must transcend creed.\nThere are times when the narrator's voice dissects the drama unfolding against unfamiliar Indian landscapes with a kind of fond exasperation and times when it dissolves into a withering regret for the way the engines of civilization continue to trundle along towards some catastrophic destiny without ever pausing for the purpose of self-assessment. And it is the profound clarity of Forster's worldviews and his sensitivity and forthrightness in deconstructing the enigma of the 'Orient' that elevates his writing even further.\nPerhaps life is a mystery, not a muddle; they could not tell. Perhaps the hundred Indias which fuss and squabble so tiresomely are one, and the universe they mirror is one.\nIt's not the 'handicap of my Indian sentimentality' after all. Forster sought to extract the kernel of truth buried underneath layers of artifice and his craft could successfully flesh out the blank spaces between that which can be expressed with ease. Those are always worthy enough literary achievements in my eyes."}, {"userName": "William1", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "A Passage to India seems a bolder statement on Colonialism and racism than ever. The Indians are thoughtful and droll, speaking about the trouble making friends with Englishmen, who become less personable the longer they are in India. The British seem to a man all about keeping the Indian down, of holding the colony by force. The writing is beautiful. I just finished E.L. Doctorow's The March, which errs on the purplish side at times. There's no such overwriting here. Even when one reads more slowly the prose constantly surprises. And this is my second or third reading, too. Few books I have found can sustain such interest over the years. Lolita, Madame Bovary, Germinal, they are rare. This time through I find myself astonished by Forster's skill at under-describing his characters. This technique adds to the fleeting, lighter than air aspect of the writing. He'd much rather talk about a gesture, say, or the layout of a house. But the characters are left very flat, if not without description altogether. We must go by their voices. Under-description of this sort was highly recommended by Elmore Leonard, too, in his day. He was another master of it. Part Two opens with the story of the developing geology the India. Venturing into the Marabar Caves, whose substance is hundreds of millions of years old, is to enter the primordial. It is to be shown something ancient, far outside the mental and emotional scope of homo sapiens, who are no older than 100,000 years, and probably closer to 50,000. Forster's fascination here is with the numinous. Adela and Mrs Moore have since their arrival talked of nothing more than seeing the \"real India.\" In her quest for this passage to India, Adela enters the caves with little knowledge of their history, and there finds herself face to face with the numinous. But in its most primitive essence, which of course includes the erotic, and just like that her heretofore admirable open mindedness is overwhelmed by the true otherness of India. Overwhelmed by fear, she makes an egregious category mistake—a reductio ad absurdum—that upends the lives of all the main characters. An unwarranted charge of attempted rape is lodged against Dr Aziz.Aziz's arrest reminded of the U.S.'s current epidemic of frightened white cops shooting unarmed black men. These events are equitable only to the extent that both are examples of raw racism run amok. Aziz, however, will get a trial and be acquitted. Our shooting victims will never get that, even posthumously, as we have seen. The novel is a big nail in the coffin of the Old India Hands. My God, how Forster must have been hated for writing it. How dare he besmirch their generations of \"service\" in keeping the Indian down. It's a very brave book. Forster indicts his nation in 1924, twenty-three years before Partition. All the insipid reasons for being in India are trotted out and shown to be lies. Britain was not in India to pass down a legacy of democratic administration, that was an unexpected and lucky outcome. It doesn't matter what Niall Ferguson says about the benevolence of the so-called Raj in Empire: The Rise and Demise of the British World Order. This was commercial exploitation at its basest. That the British left slightly fewer corpses in their wake than King Leopold of Belgium did in the Congo is not an argument in their favor.One final note on this Folio Society edition. It's a beautiful book on acid-free paper with sewn signatures, wonderful to handle. Even turning the pages is a joy. But the illustrations by Glynn Boyd Harte are wretched and annoying. The book is best unadorned."}, {"userName": "Henry Avila", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "Adela Quested, a plain looking, young , affable, and naive English school teacher, travels to distant India in the early 1920's, accompanied by the elderly , kind, Mrs. Moore, (maybe her future mother-in-law) a widow twice, and see the real country, more important, to decide if she will marry Mrs. Moore's son, the magistrate, of the unimportant city of Chandrapore, disillusioned Ronny Heaslop ( he dislikes Indians now)...Conditions are very uneasy in India, the natives hate the British rulers, and seek independence, and in turn the conquerors, despise what they perceive as an inferior, local race, besides the Hindu and Muslim populations are always ready to riot against their enemies, foreign and domestic, the tense, volatile situation needs the strong hand of the British army to keep peace, but for how long ? Mrs. Moore, like her female companion, Adela, wants to see and feel India, experience its atmosphere, no matter how alien, breathe in the romantic flavors, customs and particularly, the strange, exotic, mysterious and nevertheless engaging people, of this dangerous but fascinating nation. Warned not to go alone , the old lady, does, visits a mosque, and hears a voice in the dark, telling her to take off her shoes, she had, by Dr. Aziz, a young Indian, Muslim physician, ignorant foreigners, in the past, had shown disrespect, unexpectedly, they later become great friends, the two so completely different... Cyril Fielding, the head of the modest local college, is the only British man to show any sympathy for the poor, native people, he hates how they are treated, the Indians, especially the English women, who do not hide their contempt . Yet can friendships develop and last, between the Indian and the British, in the colonial era, such as the emotional Dr. Aziz and the calm Mr.Fielding ? There is not much to see in the unattractive, dirty city, no spectacular monuments, or building, nothing, the Ganges River flows leisurely by, not causing any impact, mostly ignored by the population, it isn't sacred here, occasionally a dead body is spotted, not devoured by the crocodiles, as it floats down to the ocean...In the local British Club, no Indian members of course, they gossip, drink, play cards and the highlight, tennis, when the notorious weather permits, scorching heat waves that crush the spirit, and monsoon rains pouring ceaselessly down, causing widespread, devastating flooding. Still twenty miles away , in the Marabar Hills, are countless caves to explore, nobody knows what makes them exciting though, the areas only attraction, a tour is organized and led by Dr.Aziz, composed also of Mrs.Moore, Miss Quested, Mr.Fielding, and prominent Indians, both Hindu and Muslims, but plans are not facts, they do not go accordingly, a disaster ensues which will effect many people, lives are changed...A very interesting exploration of India, during an unique period in its history, that even today is still relevant, to her destination as a rising superpower, both economically and militarily...Yes things change..."}, {"userName": "Warwick", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "‘The past! the infinite greatness of the past!’ thrilled Walt Whitman in ‘A Passage to India’. A quarter of a century later, Forster borrowed Whitman's title, but with a very different mood in mind. In place of the American's wild-eyed certainties, Forster gives us echoes and confusion; instead of epic quests of the soul, there is only an eternal impasse of personal and cultural misunderstanding.Animals and birds are half-seen, unidentified; the landscape is a featureless blur; motives are illogical and rest on miscommunication. All human language, in the final analysis, amounts to nothing more than the dull ou-boum thrown back from the Malabar caves during the fateful expedition at the heart of the novel. ‘If one had spoken vileness in that place, or quoted lofty poetry, the comment would have been the same – “ou-boum”.’Will Self once recommend as an exercise reducing a novel to a single word (he suggested in the case of The Naked Lunch, for instance, that it would be ‘insect’). For A Passage to India, that keyword would be ‘muddle’ – a term that recurs, gradually shedding its cosiness and accreting a sense of existential indistinctness, a kind of cosmic flou that renders good intentions, indeed all human endeavour, futile. ‘I like mysteries,’ says Mrs Moore, the novel's moral core, ‘but I rather dislike muddles.’ Elsewhere, Forster talks with something like dread of a ‘spiritual muddledom’ for which ‘no high-sounding words can be found’.The plot of this book is, at times, heart-poundingly dramatic, but Forster is careful to make sure that even this is founded on doubt and indecision. In fact, what one thinks of as ‘the plot’ of A Passage to India is a storyline that arises, reaches its climax, and is resolved entirely within the second of the book's three acts. What then, you might ask, is the point of parts one and three? Well, among other things they prevent the plot from seeming too tidy – there is always something before the beginning, something after the end, to frustrate neat conclusions. ‘Adventures do occur,’ he says, ‘but not punctually.’ Life isn't tidy – it's a muddle.British India is a perfect setting for this kind of exploration: not only does it play host to numerous individual confusions, it is itself, as it were, the political embodiment of such a confusion. One of the wonderful things about this book is that the obvious hypocrisy and conflict between the English and the Indians is not left to stand alone, as a heavy-handed message, but is echoed by similar divisions between Muslim and Hindu, man and woman, young and old, devotee and atheist. Still, it is the gulf of understanding between the British rulers and their Indian subjects that provides the most interesting material for Forster's bitter social comedy. Most of the Brits are deliciously dislikable, couching their racism in patriotic slogans, droning through the national anthem every evening at the Club, and – like one of the wives – learning only enough of the language to speak to the servants (‘so she knew none of the politer forms, and of the verbs only the imperative mood’).The heroes of this book are those that try to reach across this divide, or to challenge the assumptions of their own side.‘Your sentiments are those of a god,’ she said quietly, but it was his manner rather than his sentiments that annoyed her.Trying to recover his temper, he said, ‘India likes gods.’‘And Englishmen like posing as gods.’These attempts don't work, and the reason they don't work is that cultural or racial divides are – the book suggests – only a special case of that ‘spiritual muddledom’ that is a universal constant. Still, the worldview isn't as bleak as it might seem. That famous ‘not yet’ in the book's closing lines is a lot more hopeful than a ‘no’, and if we're prevented from coming together by our tangled and violent past, that also raises the possibility that a better future can be laid down by the present we choose to enact now, every day, with each other. ‘For what is the present, after all,’ as Walt Whitman asked, ‘but a growth out of the past?’"}, {"userName": "Jan-Maat", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "[ as in, good grief, impossible to contemplate, everybody: ”’India shall be a nation! No foreigners of any sort! Hindu and Moslem and Sikh and all shall be one! Hurrah!’” (p315) so we see Dr Aziz shift from a pan-Muslim and frequently Mughal past to a very different future. Such feats fiction can accomplish. (hide spoiler)]"}, {"userName": "Fionnuala", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "So easy going - and then wham!Quentin Tarantino could learn a lot from E M Forster. He'd learn that there's no need to pile on the menace in the early stages. The shock, when it comes is much more effective if the reader/viewer has been led into thinking all is ordinary and relatively safe. Forster is a master story teller, and a true philosopher as well."}, {"userName": "Chrissie", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "This is so far my favorite book by E.M. Forster. I tried A Room with a View first and gave that three stars. This one, set in India probably about a decade or two before independence, mirrors British colonialism and the multicultural diversity of the land. This one has much more meat on its bones. Religion, multi-ethnicity, colonialism, imperialism, the dogged belief in the superiority of the rulers over the ruled and most specifically how very difficult it is to communicate over cultural barriers. These are the topics we look at in this book. And friendship. How does it begin? How is it kept alive? Dr. Aziz says one is an Oriental if when meeting a stranger you know if he is or is not a friend. It says in the book, “friend” is the Persian expression for God. Another character says to Dr. Aziz, “Your hands are unkind….There is no pain, but there is cruelty.” He is an Oriental (in spirit), but he isn’t since he is British. Am I confusing? Does this interest you? Well read the book. In both books readers see how well Forster draws the feel of a place, of an era and of the people. What distinguishes Forster’s writing from others is his ability to create an atmosphere that feels utterly tangible. Wherever the scene is set you see, feel, hear and sense a distinguishable tone, mood or ambience. I did feel this in both books. This seems to be a common denominator for Forster’s writing style. It is worth reading one of Forster’s books just to experience this. Having experienced it you will not forget it. Secondly, Forster’s lines not only draw a memorable atmosphere, but they also give the reader food for thought. Here follow a few very short quotes: -Until his heart was involved he heard nothing. -The original sound may be harmless but the echo was evil. -We may hate one another, but we hate you most (the British).-Nothing is private in India. -No one here matters. Those who matter don’t come. -The moon caught in the shawl of night with its stars…..For me the last line is utterly beautiful. I should have jotted down more of the beautiful lines, not just the ones that got me thinking. I do not believe this book will satisfy everyone. It is not for those who are looking for action. It is instead the kind of book you put down and then go on thinking about. Who the characters are can best be judged on completion of the book, when you have properly seen and thought carefully about all that has occurred. I loved how diverse cultures are shown, primarily Hindu and Muslim and British expatriates. I didn’t understand, but did appreciate the different religious traditions and celebrations depicted.The audiobook narration by Sam Dastor was OK, so that I have given two stars. In the beginning I had trouble with the speed and pronunciation of foreign names. The voice he uses for women could certainly be improved, particularly the younger ones. They are all too squeaky and shrill. He dramatizes too much for my liking. When he just plain reads what is happening without added dramatics, it is good.I liked the book a lot. I really appreciate the writing, how India is drawn and how the book makes you think."}, {"userName": "Shovelmonkey1", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/3926982-shovelmonkey1", "userReview": "Written in 1924 this so called literary classic and 1001 book is set against the backdrop of the British Raj and the slow move towards Independence. This book has been showered with awards - I gave my copy of a good shake just to see if any of the awards had got stuck between the pages - although personally the only award I would be inclined to hand out for E.M Forster's most famous novel would be the highly coveted shovelmonkey1 pillow award for producing an epic snooze fest. I read this book while I was commuting back and forward to office HQ and even the act of opening the pages of this beautifully covered Penguin volume was enough to send my eyeballs rolling to the back of my skull. I suspect on the whole that perhaps I am being a tad harsh, and maybe this can be attributed to the fact that I have read too many novels detailing the colonial dumb-wittedness of the British abroad, particularly swooning laydees. Poor Dr Aziz, despite running around attending to the whims and mores of the ex-pat populace and doing everything with the very best of intentions ends up in a spot of bother after Adela Quested unjustly accuses him of trying to \"cop a feel\" while they're out on a day trip to the Malabar caves. Aziz had previously mused on the premise of whether Indian gentlemen might ever truly manage to be friends with an Englishman and this episode surely gives him a fairly definite answer. As the trial unfolds Adela is forced to confront the fact that everything which happened the in the caves was a product of her delicate and overwrought laydee-mind, thus presumably giving the men in the courtroom further excuse to argue, over brandy and cigars, that the colonies are no place for the \"wimmin folk\".I can see the point of this book, the message it was trying to convey and I can even understand why it is regarded to be literary significance but even the memory of reading it make me prone to... ZZZZZz zzzz."}, {"userName": "Carol", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "[ Adela withdrew her acceptance to marriage, then changed her mind again (after a hand-holding auto accident).....Mrs. Moore left before the trial against Dr. Aziz bc she was fond of him refusing testimony.....then became ill and died at sea.....next, while on the stand, Adela withdraws her accusation against Dr. A bc she was (delusional?) and just wasn't sure who came into the cave behind her. (not sure what this person actually did anyway?).....Dr. A decides to sue for damages, but ends up not doing so.....this time, Ronny calls off the marriage out of embarrassment to his official position......Adela really doesn't care (ditto Ronny) returning to her people in England.....and.....Dr. A moves his practice away from the scandalous rumors. (hide spoiler)]"}, {"userName": "Megan Baxter", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "Can there ever be friendship between the colonizer and colonized? Individuals from each group? Can that trust last? Can it flourish? What happens when events put it under stress?Forster has no easy answers in this book, as he dissects British colonial rule in India, and its impact on Indians and the British who have come there expressly to rule over India. Note: The rest of this review has been withdrawn due to the recent changes in Goodreads policy and enforcement. You can read why I came to this decision here. In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Bookdragon Sean ", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "This is my first time reading something by Forster. I'm not sure what to expect. Wish me luck, I could do with a really good book after an influx of poor ones lately!"}, {"userName": "Kim", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "In some ways it's hard to believe that this was published in 1924, given the prescience Forster demonstrates in relation to the future of the British Raj. Towards the end of the novel, one of the central characters, Dr Aziz, effectively predicts that Indians will throw out the British when England is is involved in another war in Europe and articulates - albeit not in so many words - the need for Indians to identify as Indians rather than as members of their individual religious communities in order for that happen. This is a story of the distrust and misunderstanding inherent in the relationship between colonisers and the colonised and poses the question of whether cultural differences can be overcome to find real friendship and understanding. It centres on the consequences of an incident in which a young English woman, Adela Quested, accuses the Indian Dr Aziz of assaulting her during an excursion to the Marabar Caves. Forster's portrayal of the British colonial rulers is trenchantly critical. He exposes their hypocrisy, their fundamental fear of Indians and their desperation to retain control. While Forster's portrayal of Indian characters is largely - although not completely - sympathetic, he was a still a man of his time and there are some aspects of his portrayal of Indian characters which a contemporary reader is likely to find patronising. Forster evokes a sense of time and place in beautiful prose and he provides plenty of food for thought. That said, there were times when the narrative seemed to meander and I wasn't always sure where Forster was going with it. This is one of those books I'm glad I listened to rather than read, because it allowed me to complete productive tasks while listening to those few parts of the novel which I might otherwise have skimmed. I knew that Sam Dastor's voices for both the English and the Indian characters would be excellent, having listened to his narration of Kipling's Kim. However, the downside of listening to Dastor is that he does not do female voices well. This wasn't an issue with Kim, because it contains no female characters to speak of, but Miss Quested is a central character in this novel and Dastor's voice for her is simply awful. I enjoyed listening much more when Miss Quested wasn't around. The only other of Forster's novels I've read is A Room with a View, which I love. This one I like a little less. But I'm very glad that I finally tackled it and I don't know why it took me so long to do so."}, {"userName": "Chari", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/60819348-chari", "userReview": "Es Forster. Es un cinco estrellas."}, {"userName": "Gabrielle", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/6753400-gabrielle", "userReview": "The more I explore E.M. Forster’s books, the more I come to realize that he was a man who held very unconventional views for his days. In “A Room with a View”, he discussed the independence of spirit of women, in “Howards’ End”, the subtle ways the class division separates people and in “A Passage to India”, he expresses very anti-colonialist views about what was once the jewel of the crown: British-occupied India.Racial tensions and prejudices turn a misunderstanding into quite a drama. The portrait Forster paints of the British occupants is very far from flattering: they consider the natives to be inferior in every way, often can’t be bothered to be civil to them and easily blame them for anything not going as smoothly as they wished, even when they are very obviously the ones at fault. The Indians in turn view the English as untrustworthy – except of course for those who seek to emulate them in every way. These combined attitudes reinforce many levels of animosity between races, religions and castes. Loyalty and justice are not easily defined for those living in this strange setting, and this further muddles the water.After just a few pages, I knew that Aziz would get himself in trouble: he is just too candid and honest to play the hypocritical social game required to stay on the good side of the British. No one directly accuses him of anything, but people assume right off the bat that he has done something wrong, that like all members of his race, he is deviant and has a natural inclination towards criminal activities. A strange series of event makes him look guiltier and brings to the surface a lot of anger and resentment that proper social behavior had simply concealed under the surface. And the end result of that is the amplification of the negative prejudices both sides have towards each other. It is so easy to say – out of innocent ignorance – something that will be interpreted as appalling to the other side, but if there is no sensible and open dialogue, there is no resolution.Forster went to India twice, and wrote this book soon after returning to England. Obviously, the experience had not been a positive one, and the racist attitudes of his compatriots disgusted him. But the novel is not didactic: the complexity of the situation is described in great details, to really convey to the reader that no easy solution can reconcile the politics of colonialism and personal relationship between diverse groups. Tensions are unavoidable, as are disagreement, but without openness and compassion, the conflict will remain irreconcilable.The cultural differences in this book feel impossible to overcome because of power dynamics, but it is interesting to note that the different groups of Indians are just as virulent in their opposition to each other as the British are towards them. I was worried at first that this would be a Rousseauist story about noble savages and big bad white dudes, but Forster does not idealize the Indians and demonize the British; he simply shows that all humans are flawed despite their best intentions. He also makes clear that some of his characters’ attitude do not come from ingrained prejudices, but from parroting the hateful nonsense spewed by their superiors. By simply emulating senior officers, Mr. Heaslop doesn’t have to think too much about his direct experience of India, but he unwittingly propagates the disdainful attitudes of the racists at the top.I’m from a corner of the world where there is a linguistic divide: English-speakers and French-speakers have been (metaphorically and literally) at each other’s throat for about 300 years and despite the historical rearview mirror, people still feed each other’s prejudices by generalizing intolerant attitudes and accusing each other of cultural colonialism with the only result of driving a wedge between perfectly decent people who just can’t give up this idea of colonial oppression. “A Passage to India” echoed this strange contemporary dynamic, and also made me think of the racial profiling police forces can’t seem to help in the United-States. Some things are very hard to overcome, and institutionalized hatred is certainly one of them.Forster’s humanist views are expressed with great sensibility and intelligence in all of his books. His prose is beautiful and takes you right to this exotic setting that you discover along with Miss Quested and Mrs. Moore. You will turn the last page and think about it for a long time. I gave it four stars simply because as interesting and well-written a book as it is, I did not enjoy it as much as “Howards End” or “A Room with a View”: maybe because the subject matter, while important, is a lot less pleasant, or maybe because I couldn’t get attached to any characters the way I did to Lucy or Margaret. In other words, this is a wonderful book that touched me less personally than Mr. Forster’s other works."}, {"userName": "Madeline", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"The sky settles everything - not only climates and seasons but when the earth shall be beautiful. By herself she can do little - only feeble outbursts of flowers. But when the sky chooses, glory can rain into the Chandrapore bazaars or a benediction pass from horizon to horizon. The sky can do this because it is so strong and so enormous. Strength comes from the sun, infused in it daily; size from the prostrate earth. No mountains infringe on the curve. League after league the earth lies flat, heaves a little, is flat again. Only in the south, where a group of fists and fingers are thrust up through the soil, is the endless expanse interrupted. These fists and fingers are the Marabar Hills, containing the extraordinary caves.\"Taking place in the waning years of British rule in India (although Forster, writing the book in 1924, could not have know that India would become independent in less than twenty-five years), A Passage to India is, at the surface, the story of a misunderstanding and its long-ranging consequences. But that's only the barest plot description. The book is an exploration of the relationship between oppressor and oppressed, human imperfections and mistakes, and whether friendship can ever exist between the colonizer and the colonized. It's also a thoughtful and powerful critique of the British presence in India, which Forster shows us by shrinking the conflict to a handful of people. Our main characters are Dr. Aziz, a native Muslim; Mr. Fielding, a British teacher who has not yet become one of the \"Anglo-Indians\"; and Mrs. Moore and Miss Quested, fresh off the boat from England. Miss Quested is in India to marry Mrs. Moore's son, and both women express an interest in seeing \"the real India.\" Mrs. Moore befriends Dr. Aziz when she meets him in a mosque, and this leads to a friendship between her, Aziz, Miss Quested, and Fielding. After the women express an interest in seeing the Marabar caves, Dr. Aziz offers to be their guide. (The trip doesn't occur until halfway through the book, but the caves are a constant presence in the story, always looming somewhat menacingly in the background) While Aziz is at the caves with the women, an incident occurs, and due to a misunderstanding, Aziz finds himself accused by Miss Quested. An unfortunate series of events makes him seem guiltier than he is, and he is arrested. Miss Quested's accusation, and the sides the characters take in the ensuing trial, bring long-standing resentments and issues bubbling to the surface, and no one gets out unscathed. This was the second Forster book I've read, and I enjoyed it more than A Room With A View. The latter didn't really grab me until about a hundred pages in, but this had me enthralled from the beginning. I loved Forster's beautiful descriptions of India, his look into people's minds, and the fact that a British author could write such a blistering portrayal of colonization. Better yet, he doesn't simply villify the English and idealize the Indians - everyone is flawed here, but no one is outwardly evil. Characters are all well-intentioned, but not always sympathetic. And once Aziz is arrested, Forster's description of the panic that grips the British is evocative and sadly familiar to 21st-century readers:\"They had started speaking of 'women and children' - that phrase that exempts the male from sanity when it has been repeated a few times. Each felt that all he loved best in the world was at stake, demanded revenge, and was filled with a not-unpleasing glow, in which the chilly and half-known features of Miss Quested vanished, and were replaced by all that is sweetest and warmest in the private life.\""}, {"userName": "Veronique", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/12371602-veronique", "userReview": "4.5\"India likes gods.\"\"And Englishmen like posing as gods.” I first read this classic back when I was 18 and remember liking it. The main plot had remained in my memory but not much else. Re-reading it now in my 40s, I’m amazed how this text is so relevant to today’s sociological and indeed political landscape. Forster’s novel, published in 1924, dealt with imperialism, showing the interactions between British and Indians in the fictional city of Chandrapore. As you expect, most of the English behave in the most atrocious manner, full of conceit, bigotry, racism, and indeed ignorance.That in itself is not groundbreaking. No, the shock came from the author portraying both sides in his narration, giving voice to the natives too, and thus challenging the very essence of colonialism. Forster also showed the tension between the Muslim and Hindu characters, who often were just ‘bundled’ together in the eyes of the British.Reading this, I could see the inherent incomprehension between the two sides, their wild and ungrounded assumptions in both race and religion, making the ‘explosion’ only too natural. Sounds familiar? The other thing that I noticed from my early 21st century viewpoint is the role of women, some behaving even worse than their spouses, others trying to do the right thing, all used as pawns. I do wonder what made Forster write this and if his own circumstances (especially his personal ones making him feel outside the social norm) gave him the impetus to analyse further. The novel doesn't really give a 'solution' but, by bringing these issues to the fore, make us more aware of them and hopefully teach us too."}, {"userName": "Kinga", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/110812-kinga", "userReview": "“A Passage to India” is most of all a story of a fragile friendship which carefully treads the cultural differences. It’s a story of tiny misunderstandings and silly errors and their dramatic consequences. Adela Quested who arrives in colonial India with the best and purest intentions ends up causing irreparable damage to the reputation of an Indian doctor Dr Aziz, and in consequence ruins his friendship with Cyril Fielding, an English teacher. Adela is not so much a heroine but a catalyst of the events which due to unspoken feelings and wounded pride derail a friendship that almost succeed at bridging the gap between the two cultures but the structure is so delicate that the smallest things send massive ripples – a pause in the wrong place, intonation, a meaningless clichéd phrase misunderstood, and the whole conversation is doomed. In the end Forster’s conclusion is that redemption and any future friendship is only possible after the end of colonialism because the power imbalance would always get in the way of the noblest sentiments. The optimistic point Forster is trying to make (I think, although I might be wrong) is that it is not cultural incompatibility that’s ruining it for everyone, it’s only the tension between the oppressors and the oppressed. Yes, people may misunderstand each other’s social cues if they are not culturally aware but without the colonial baggage and resentment this could be easily resolved.“Clear out, you fellows, double quick, I say. We may hate one another, but we hate you most. If I don't make you go, Ahmed will, Karim will, if it's fifty-five hundred years we shall get rid of you, yes, we shall drive every blasted Englishman into the sea, and then \"—he rode against him furiously— \"and then,\" he concluded, half kissing him, \"you and I shall be friends.\"”It’s one of the better books that speak against racism, but of course it’s not entirely free of racism itself. But I can’t imagine how it could possibly be, especially considered when and by whom it was written. Even now it’s almost impossible to completely rid our thoughts of the concept of the Other. And accepting it and being aware of it is probably going to produce better results than the adorably naïve attitude like that of Mrs Moore who arrived in India, accompanying Adela, and thinking she could undo the damage of the entire socio-political structure of colonial India by simply being a nice human being. The same way she thought she could survive Indian heat but in the end it killed her., because the nature in ‘A Passage to India’ is mostly oppressive and even hostile – it puts up a fight against the British. I particularly liked the comedy of horrors that was the description of the absurd trial and how things spiralled out of control on both sides and Mrs Moore became a kind of pre-Internet meme as ‘Esmis Esmoor’, while Dr Aziz lost all his personal characteristics, even to the people that knew him well, and became the embodiment of the ‘dark-skinned monster’. Those stereotypes are never buried deep and can be excavated very quickly if need be. Immediately men in the novel start talking about ‘women and children’ and once ‘protect our women and children’ enters the stage all reason will be abandoned. That’s how these men mask their own fear and vulnerability. ‘We’re not afraid, of course, for we are strong men, but our women and children… must protect women and children, most protect women and children.’ Some atavistic auto-pilot gets turned on and you can go on any senseless war, as long as you’re ‘protecting women and children’.As expected, ‘A Passage to India’ is beautifully written. I read it many months ago but I still remember the opening paragraph and the mixture of striking descriptions and gentle irony, so characteristic of Forster’s style. On the first page you will find the phrase ‘the temples ineffective’ in the description of Chandrapore and its lack of charm. Even these two words could be interpreted in different ways. Are the temples ineffective as a place of worship, because they have been of no help against the invasion of the British, or are they ineffective as landmarks from the British tourist-visitor point of view. Or this little sentence on the landscape of India:“[…] The boulders said, ‘I am alive,’ the small stones answered, ‘I am almost alive.’”Forster tries to be fair in his descriptions of the characters, both Indian and English – and even if he ridicules them, he does so with some affection – but it’s always clear that it’s the British who start off from the position that’s simply morally wrong and that’s refreshing for a book from that era. It’s hard to write fair about ‘the Other’, some even question whether anyone should, whether we should leave those stories to ‘the Others’ themselves to tell. And of course we should, but at the same time I think it is a brave thing to do to try to write from that different perspective and a great exercise in empathy – as long as you accept you will never be absolutely 100% fair. Mrs Moore’s son, Ronny, who is a colonial official, like many before him, found a way to deal with the cognitive dissonance by completely redefining the reality of colonialism; in his narrative the British arrived in India to help people there, bring peace and order (and not to steal all the country’s riches). He seems to truly believe it. Forster doesn’t portray him as evil, just lazy and conformist.Even the ‘good’ Englishman, Cyril Fielding, is not free of the imperialistic mindset and he seems conform more and more as the book goes on. Was conformism the true villain of this novel?It’s open to many readings and interpretations – a whole PhD could be written on gender in ‘A Passage to India’. Race, imperialism, and all of it with the undertones of repressed sexuality, especially in the fantastic scene in the caves (that really should make anyone hot and bothered and filled with a mixture of fear and excitement – if they know how to read all the symbols, that is). It looks on things from the personal point of view that’s nonetheless immersed in the political. And that’s my favourite kind of writing, when the personal is political and the political is personal. Zadie Smith, Forster’s devoted fan, wrote lovingly about him in the New York review of books. You can read it here: http://novelssince1900.blogspot.co.uk... (or on the actual NYbooks website if you are a subscriber). I didn’t love this novel when I read it. But now, months later, I think I do. And unlike boyfriends, it’s never too late to love a novel."}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، این کتاب که از سه بخش کلی و 37 فصل تشکیل شده است، یکی از پرفروشترین کتبِ انگلستان میباشد و به گونه ای نشان دهندهٔ قدرت و روابط استعماری غرب و نژاد پرستی میباشد که <فورستر> مسائل استعماری را در قالبِ داستان بیان نموده است‎داستان از آنجایی جان میگیرد که پیرزنی به نامِ <مور> به همراه عروسِ آینده اش یعنی <عادلا> به هندوستان سفر کرده اند تا مراسمِ ازدواج <عادلا> و <رونی هزلپ> پسرِ <خانم مور> را که ساکنِ هندوستان است را در آنجا برگذار کنند... زمانیکه برای گردش به بیرون میروند در غارهای مارابار، <عادلا>، شخصیت اصلی داستان یعنی یک دکتر هندی و مسلمان به نامِ <عزیز> که همسرش را نیز از دست داده است را محکوم میکند که در تاریکی غار، قصدِ تجاوز به او را داشته است و داستان حولِ محور دادگاهی <عزیز> به علت تجاوز به <عادلا> میچرخد‎به نظرم اصلی ترین پیامِ داستان زمانی بازگو میشود که <رونی> جوانی انگلیسی که برای هنر و کرامت و آزادی انسانی ارزشِ زیادی قائل بوده است، در هندوستان افکارش تغییر کرده و گفتگویی با مادرش در موردِ استعمار انگلستان در هند انجام داده و حتی مادرش خانم <مور> را به تعجب وا میدارد‎مادرش که متعجب شده است، به او میگوید: تو هرگز در انگلستان دربارهٔ مردم چنین قضاوتی نداشتی‎امّا <رونی> میگوید: ولی هندوستان که انگلستان نیست... هند خدایان را دوست دارد و انگلیسی ها نیز دوست دارند که قیافهٔ خدایان را به خود بگیرند‎یعنی <رونی> اعتقادش به اینگونه تغییر کرده بود که دیگر آزادی مردمِ هندوستان اهمیت ندارد، انگلیسی ها میتوانند با بازی کردنِ نقشِ خدایان، بر مردمِ هندوستان حکومت کنند‎لذا <رونی> در پایان به مادرش اینگونه پاسخ میدهد که : این حرف ها بی مورد است.. ما اینجا هستیم و اینجا خواهیم ماند، خواه قیافهٔ خدایان را بگیریم و خواه نگیریم.. باید این مملکت با ما بسازد**********************‎البته عزیزانم، لازم است بگویم که بخش هایی از این داستان به جنگ و دعواهای هندوها و مسلمانهای ساکن در هند میپردازد، که متأسفانه امروزه نیز شاهد این جدال ها میباشیم و هندیانی که به اسلام روی آورده اند نمیتوانند خود را با آیین های انسان دوستانه و مهربانانهٔ مردم سرزمینِ هند، وفق دهند... دوست دارم دربارهٔ این موضوع بیشتر بنویسم، متأسفانه در این ریویو مجالی برای این موضوع نمیباشد، تنها میتوانم آرزو کنم که آرامش به سرزمین زیبایِ هندوستان و مردمِ آریایی و انسان دوست و آرامِ آن، بازگردد و انسانها در سازش و امنیت کامل زندگی شادی را سپری کنند---------------------------------------------‎امیدوارم از خواندنِ این کتاب لذت ببرید‎<پیروز باشید و ایرانی>"}, {"userName": "Mohammed", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/6823144-mohammed", "userReview": "الهند بلد برائحة البخور وطعم التوابل. بلد اﻹنسجام والمتناقضات. أكثر من مليار شخص يتحدثون بأكثر من عشرين لغة ويعتنقون مايربو عن 6 أديان.يجمعون بين التسامح والتعصب، المسالمة والمقاومة، السذاجة والنباهة.لا يمكن أن أذكر هذه الرواية دون أن تعرج ذاكرتي على أيام دراستها في الكلية على يد طيب الذكر د.بلعيد طه شمسان، وهو يجول في القاعة كالجواد الجامح مرددا السؤال اﻷزلي عن الرواية: مالمغزى من الفصل اﻷخير وقد انتهت اﻷحداث الرئيسية ولاقى الكل مصيره؟ حماسه الفائض لا يباريه سوى لامبالاة الطلاب الذين لا يكترثون للدكتور عزيز أو الآنسة أديلا. وينتهي العام على هذا الحال، فلا صبره الحميد ينفد ولا عزمهم الواهن يشتد.نعود إلى الرواية التي تدور حول رحلة السيدة مور وخطيبة ابنها إلى الهند حيث يشغل ابنها منصبا مهما. يصلون فيخلب لبهم سحر البلد، وتصدمهم الممارسات الاستعمارية. كما يواجهون مواقفا عسيرة تمتحن إيمانهم وإنسانيتهم.(رحلة إلى الهند) ليست بنزهة سياحية، بل تشريح للمجتمع الهندي في عهد الاستعمار الإنجليزي، بمصالحه وعداواته. مفارقات عدة تجدها بين الشخصيات: بين الليبرالي والمحافظ، العاطفي والنفعي، الهندوسي والمسلم، المستعمر وصاحب البلد. وفي اﻷساس، المفارقة بين الشرقي والغربي. تكشف اﻷحداث والنقاشات طريقة تفكير كل إنسان حسب معتقده أو ثقافته. يعرب د.عزيز عن ارتياحه للسيد فيلدنج بإطلاعه على صورة لزوجته المتوفية. بالنسبة للهندي المسلم، تلك وسيلة سامية للتعبير عن الحميمية، بينما الليبرالي الأوروبي لا يرى اﻷمر من نغس الزاوية. ويالرغم من التباينات، إلا أن فورستر يطرح فلسفته الخاصة عن القواسم المشتركة التي تجميع بين أفراد ينتمون إلى ثقافات مختلفة كالنزعة الصوفية بين السيدة مور وعزيز ، وحب التعليم بين هذا اﻷخير والسيد فيلدنج.الرواية ثقيلة ولا شك، ستمر عليك صفحات تود لو أن باستطاعتك تسريع المشاهد. لكنها حبلى بالتفاصيل الثقافية والحوارات الفكرية. هي ذلك النوع من الروايات الذي يثقف أكثر مما يسلي. بالنسبة لي ليس هناك مقارنة بينها وبين قرينتها (في قلب الظلام) لجوزف كونراد التي يفترض أنها تنتقد الاستعمار البريطاني لافريقيا، غير أني وجدتها عسيرة رغم قصرها، بليدة رغم شهرتها."}, {"userName": "Steven Walle", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/37850168-steven-walle", "userReview": "This book is a classic peace of literature. It describes the differences in the western mindset and the eastern way of thought. It shows how there are similarities in the two cultures of England and India. There are marked differences in the religeons of Hindoism, Budism, Islam, Christianity and intellectualism. I recommend this book highly to all.Enjoy and Be Blessed.Diamond"}, {"userName": "Jason", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/17326212-jason", "userReview": "The India of Forster’s imagination is a vast, incoherent land of hostile earth and oppressive air; the weather, inhospitable to human life; the sun, a burning, penetrating force that crushes the soul; in the distance, sand, fields, bushes, more sand, more bushes, all indecipherable, all impenetrable to human reason. The mind boggles at the immensity and confusion of India, at the distant mountains, at the strange religions, at the endless tracts of land blending with the gray and threatening sky. This is a landscape of dreams and terrors. It is unreal, but not romantic - a land of deceit, irrationality, vague but persistent danger. Tempted here by mirages, the British have built their colony on a foundation of sand and it must soon crumble. But behind these fragments of visions, shimmering in the background as if through a hazy gauze at a glimpse at the true, permanent world, lie the Marabar Caves. They are present, but shadowy, just out of reach. What is inside those caves? The answer? The soul of India itself? Or something else? Why do the caves remain in the mind like an echo, as they do to poor Adela? I am haunted by the Marabar Caves, as Adela was haunted by them, as Mrs. Moore was haunted by them. They expand in my imagination, they beckon and seem to explain, and yet I cannot enter. The cavern dims and darkens as it curves away into the mountain, beyond my ken. The Marabar Caves are the key to the meaning of this novel, just as their counterpart in our collective unconscious is the key to understanding human existence, but that key, like the rest of India, is beyond my understanding. What Forster has achieved here is a brilliant evocation of India as conjured by the hopes and fears of the British imagination. It is one of the most striking environments I have ever encountered in a novel. It seems to embody everything that Britain opposes - emotion, chaos, incomprehensibility - in contrast to Britain's self-perception of orderliness, control, reason, and duty. It is a canvas on which the English mind can display its deepest anxieties. Forster captures those anxieties with uncommon force. And, to play on that wondrous stage, Forster has supplied an equally stellar cast of characters, to enact the greater drama of the British Raj's influence on the people of both England and India. Dr. Aziz is amiable and proud, and deeply invested in ingratiating himself to his British masters, but he is also self-conscious and anxious. He reaches heights of happiness and expectation and then plunges into anger and resentment, all within a matter of moments, a product of having assimilated the slave mentality, which affects his every move and thought. Fielding is the Principal of a British school in India, benevolent, rational, without family ties, and desirous to befriend Aziz to separate himself from what he perceives to be the racism and ignorance of his fellow countrymen. He wants to prove he can be friends with an Indian. Dr. Aziz wants to prove he can be friends with a Brit. The relationship they form is remarkable for its subtlety and its truthfulness, and remains surprising right to the end of the novel. Then there’s Adela, who accuses Aziz of attacking her in the Marabar cave, but we know this isn't true. Something else happened. But what? And Ronny, her fiancee, is the casually pompous British Magistrate of the city of Chandrapore who would like nothing better than to have all these Indians whipped. And then there’s Mrs. Moore, Adela’s traveling companion, who is utterly destroyed by her own experience in the Caves. I loved Mrs. Moore. Her transformation after the caves is devastating. And I felt for Adela. On the stand, at the trial, she does a selfless and honourable thing, and it made me so glad. Dr. Aziz's transformation after the trial is unspeakably sad, but absolutely realistic. I despised Ronny, but ultimately pitied him, for how can he be expected to escape the social and political forces that forged him? See? These people were real to me. They are fascinating, believable, unforgettable. The prose of this novel is scintillating. It is intensely ironic in tone, and satirical, but it also has a strangely suggestive side, enigmatic, mysterious, hinting at things unsaid that stick into the mind like an icicle, or opening vistas of possibility one can only see as through a haze. It weaves in and out of these modes with an astounding level of finesse and control, from satirical to funny to poetic and back again, insinuating secrets, dancing impishly, but never allowing us to forget, not for long, the mystery at the center of all things, the Marabar Caves. The question is not merely, what happened in those caves? But rather, what are the caves? And what is India? And what is human existence? Is there hope, and meaning, and purpose? Is there a purpose to the British Empire? Is there a purpose to human connection? Is there a purpose to empathy and understanding? Or is it all merely an endless echo in a dark cave, BOUM? All these questions, it seems to me, are the same question, the question that drives the engine of this novel, and indeed all examinations of why greater powers have always seen fit to oppress, manipulate, and exploit the weaker. Don’t be turned off by the false sense, because it is a \"classic,\" that this is some slow, dreary work. It isn’t. It’s alive, extremely entertaining. And mysterious. That was the biggest surprise - the uncanny, amazing feeling running through the entire text that there are deeper forces at work, that there are answers to the human conundrum just out of our line of sight, just around the bend of the cave. It’s about the British Raj and human beings and the (im)possibility of human connections, and it is one of the best novels I have ever read. Highly recommended."}, {"userName": "Amanda", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "3.5 stars rounded up because I recognize the importance of this work as part of the literary canon I just didn't love it. This is my 3rd book by E.M. Forster and my least favorite. I had a hard time getting into this. To be honest I found the beginning to be a bit of a slog and if I hadn't been reading this as part of a challenge I may not have finished it. BUT, I'm really glad I did because it all comes together nicely in the end. I listened to the audio which was a good choice for me. It pulled me through the more (to me) tedious parts. At the start there are many many characters to keep track of and I found it hard to form any relationships with them. I really liked the way the author showed both sides of the conflict. I also really enjoyed the absolutely gorgeous depictions of India. I'm looking forward to reading more by this author."}, {"userName": "Roy Lotz", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "Most of life is so dull that there is nothing to be said about it, and the books and talk that would describe it as interesting are obliged to exaggerate, in the hope of justifying their own existence.\n I’ve spent a lot of time thinking about what the novel is, exactly. It’s an exceedingly flexible and fluid form. The novel can accommodate historical behemoths like War and Peace, philosophical exercises like The Brothers Karamazov, wacky experiments like Ulysses, and mythical adventures like The Lord of the Rings. Or can it? Many works of fiction we call novels for lack of a better term; but can the term encompass both Pale Fire and In Search of Lost Time, The Trial and Huckleberry Finn, The Shining and On the Road? Really, what characteristics do all these multifarious works share? That they’re fiction?The more I read, the more I think that there are novels, and there are various novelish things that perhaps we ought not to name. Names are only useful if they reliably tell us something about what they’re naming. So what is the novel, pure and simple, devoid of any hesitations or qualifications? Well, in lieu of any simple definition, I’d like to offer this gem of a book as a prime example of what I mean. A Passage to India is a paragon of the novel form.Forster is a delicate craftsman. Without any plodding descriptions or obvious inner monologues, he manages to convey the personalities of his characters. They don’t spill out their philosophy of life; rather, they have commonplace conversations with one another. And out of the cadences of speech and the turns of thought in these banal interactions, we come to know the characters intimately—which is a pleasure, as Forster’s characters are wonderful works of art. They are, all of them, ordinary but interesting; impressive but imperfect; likable but limited. In short, they are real people; but, like all great fictional characters, they are also more than real people—they are whole types of people. A novelist does not simply capture people he knows; rather, he takes a characteristic here, a quality there, and fits them together like puzzle-pieces. The result is a person strikingly familiar, yet strikingly new. We feel like we've met before, but we’re happy to meet again.In a great novel such as this, the drama does not feel manufactured or contrived; unlike some cheap thriller, the excitement is not the result of improbable coincidences or extraordinary events. Forster, instead, brings out the drama hidden in everyday situations; he brings to light tiny tensions, daily anxieties. The result is a penetrating exploration of human society and psychology. Forster shows how people both shape and are shaped by their circumstances; and this continuous interplay of social environment and personality unearths things never buried. Like a great still-life, Forster’s novel doesn’t so much reveal, as remind. A great work of science or of philosophy may make us cry out “How interesting and insightful!” But a great novel, such as this, makes us cry out “How true! How perfectly true!”Forster’s novel does all of these things. It’s both a work of art, and a superlative example of the craft of the novel. And, like any good novel, I can’t say any more without spoiling the plot! You’ll just have to see for yourself."}, {"userName": "Barbara", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "This book is a classic, but its motifs of culture clash and racialism strike an unfortunate chord in current times. *****The plot revolves around an Englishwoman who wrongly accuses a Muslim Indian doctor of attempting to assault her while they're visiting mystical Indian caves. Set in a time when the British controlled India, the book has several sub-themes. One is the condescending attitude and behavior of the Brits toward the Indian people and the consequent mistrust and dislike the Indians felt toward the Brits. Another is the vast cultural divide that made friendship almost impossible between the Indians and Brits at that time. My problem with the book is that many of the thoughts, emotions, and behaviors that E.M. Forster attributed to the Indian people don't ring true to me. It feels like the author's personal attitudes about India were foisted onto the native characters.....and not in a favorable way. Nevertheless, it's an interesting story, lyrically told, and gives little glimpses into the Hindu and Muslim customs of old India.You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"userName": "Komal", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/17030658-komal", "userReview": "When I first picked up this book, I was 13, and expecting to be insulted by some white guys going on about how barbaric my culture and history were and how the magnanimous British civilized us all. I was, thankfully, wrong.It follows Mr Fielding, Miss Adela, and Mrs Moor as they come to tour India. They are shown about by Dr Aziz, a poor Muslim, and Adela's fiance Mr Moor. The basic storyline is one of Adela and Mrs Moor touring India, but then Adela eventually convicts Dr Aziz of sexual harassment which he denies.However, the book has much more heart. It delicately shows the impossibility of the British and Indians reconciling through the fading friendship between this group of people. It explores beliefs and meaningfulness. It explains how impossible it is for the white men to fully understand India and its people. It just seems to involve every possible perspective on colonial India in rich, resonant detail. Forster writes with an almost native understanding of the Indian subcontinent. It is a very very sensitive and poignant portrayal of India and is written with an unbiased honesty. While the British are shown as the more cultured, they are also haughty, foolish and greedy. While the Indians are shown as warm, family-loving and hospitable beings their tendencies to be crude, quarrelsome and religiously divisive are highlighted as well. Through this setting traverse three characters new to India- and their fresh perspective adds a new and naive point of view to the book. I highly recommend it for anyone."}, {"userName": "K.D. Absolutely", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "Chandrapore, India during the British Raj in the 1920s. This is about a British young woman, Adela Quested falsely accusing an Indian doctor, Dr. Aziz of attempted rape. During the trial, Adela withdrew her lawsuit and admitted her mistake. The false accusation, the trial and the retraction further divided the nation between the white colonizers and the dark-skinned natives. \"Oh, East is East, and West is West, and never the twain shall meet\"\" wrote Rudyard Kipling in his 1889-first published poem, \"The Ballad of East and West\". This 1924 novel of Edward Morgan Forster clearly illustrated this belief. England being the colonizer and India as the colonized country have two totally different cultures and beliefs. They have different religions, traditions, superstitions and obviously the most members of the fair-skinned race always thinks that they are better than their colonized country that happens to have a darker color of skin (in the novel, some English even called Indians 'niggers'). Since Indian independence from British Raj in 1947, does this 1924 novel still have significance to the young people of the world? I was in my late 30's (2000-2004) when I traveled thrice to Mumbai, India. I toured the whole of Mumbai and its neighboring provinces. During one of my trips, I was waiting in the Singapore airport for my plane to India. There was a young female doctor who looked smart and friendly. After some introductions, I learned that she was a medical doctor and she was practicing in London. With my little knowledge of Indian history and being not too culture-sensitive yet, I said out: \"Philippines has a lot of English-speaking people and it was because we were under American rule for 40 years. I think India must also feel indebted to British people for bringing good education system in India during their rule\". To my surprise, she got upset and replied back: \"Please do not credit the British for our educational system. Where do you think the golds of the Royal family came from? Blah blah blah\"In 1985, I saw the film adaptation of this novel that was nominated in the Best Picture category in the Oscars. It ended up winning two awards. It did not leave a big impression to me. I think I was too young (fresh from college) then and I had no idea about India's fight for independence in the 20's. Due to my trips to India, I bought the VCD copy of that movie and saw it again. The reason was that I wanted to see Mumbai on the screen again as I saw those tourist attractions featured in the film such as The Gateway to India, Taj Mahal Hotel, etc. Still, the movie did not give much impact to me.Now that I am 45 years old, I read the book where that film was based on. The mesmerizing prose of E. M. Forster not only gave me a deeper insights on the struggle of Indians to gain their independence but it reinforced my personal belief that there is nothing to gain from a country being under the rule of any other (more powerful) country. The reason is that each country has its own culture and beliefs and those being deeply-rooted, cannot be easily shaken off by introducing another culture especially in a short period of time. My only difficulty in reading this book is the lengthy painful-to-read narratives towards the middle trying to develop some of the minor characters. I thought that those secondary characters could be removed from the story without compromising its message. Otherwise, it is a perfect novel with well-developed characters, exotic backdrop, poetic narratives and a resounding message. The fact that E. M. Forster is British made me wonder how could a writer belonging to the oppressor race be able to write as if he was part of the oppressed race?"}, {"userName": "Paula W", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/13286533-paula-w", "userReview": "With everything going on this week, I can't help but think that this novel is still timely and relevant after all these years. The book had a bit of a slow start for me. However, it was important for the author to fully describe exactly what life was like in British-controlled India, from where they lived to how they lived to who they interacted with and under what circumstances they were allowed to do so. Rampant racism and religious intolerance didn't only occur between the British and the Indians; they also divided Indians themselves. In situations like that, when a crime occurs, the lower classes are subject to profiling according to stereotypical untruths. Kinda sounds like something that happened yesterday. It did pick up later on, and I thoroughly enjoyed the book as a whole. Maybe one day we as a global society will be able to see and appreciate each other's differences. Maybe one day we will realize that different colors, religions, backgrounds, cultures, and beliefs help to paint a broader and more inclusive picture of humanity rather than insisting that only one color, one religion, one background, one culture, and one belief can be correct. Maybe one day people will stop saying, \"I don't see color\" and instead say \"I see color, I appreciate the differences, we can learn from each other, and diversity is good.\" Until then, thank whatever god you worship (or don't worship, because that's okay, too) for novels like this."}, {"userName": "Joshua Rigsby", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/12022033-joshua-rigsby", "userReview": "I almost gave up on A Passage to India early on. Forster takes a long time to build his characters, their worldviews, and the interrelationships among them before he touches a match to the story's inciting incident. By the time the plot finally begins to move it does so somewhat slowly, and the denouement takes a good while to come to a satisfactory conclusion. That said, there are two things Forster does exceptionally well. The first is his depiction of the complexities Western attitudes toward the East and vice versa during the British Raj. He takes care to show men and women on both sides of the divide as agitators and ignorant, too quick to stereotype and call in the cavalry to defend one of their own. The second is the inspired believability of each character's views. Ignorant though he may be, the reader can't help but feel that the unapologetically eugenicist Major is completely justified in his own mind for his thoughts and actions. The same is true for the other characters as well, particularly the two main characters who swirl around in agitation and confusion as they try to protect themselves and each other from all sides. Also worth noting is how well Forster treats India, particularly considering the time this was written (published 1924). He doesn't look down his nose at its religious complexity, as so many of his characters do. Instead, he acknowledges, rather prophetically, that the days of the British Raj are numbered, and that sooner or later India would pull up her own seat to the table of nations. It's the British Imperialists (whom Forester lampoons) that have the difficult time accepting this fact. Yet, at the same time he does not pretend that India is flawless or that it's independence would not inevitably lead to some degree of chaos. He spends a great deal of time swimming in the deep end of his Eastern characters' psyches. While there are places where Forster can't quite shake off his own cultural biases when painting his Indian characters, he still does so uncommonly well. He portrays them as being just as self-contradictory and awkward as everyone else on earth. All told this book's best points are in its portrayals of culture, and how different cultures can both intermingle and repel one another simultaneously. What it lacks in plot it more than makes up in personality. http://joshuarigsby.com"}, {"userName": "Inderjit Sanghera", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/900800-inderjit-sanghera", "userReview": "‘A Passage to India’ is E.M Forster’s magnum opus, the novel which combined his febrile artistic vision and fascination with India. Some of Forster’s depictions of India are wonderful and he is able to capture the humidity, the maleficent mugginess of the Indian atmosphere to outsiders;“She watched the moon, whose radiance stained with primrose the purple of the surrounding sky. In England the moon had seemed dead and alien; here she was caught in the shawl of the night together with the earth and all the other surrounding stars.”Just as the shawl of the night envelops the Indian skyline, coalescing the shimmering stars and incandescent moon into a scene of baleful beauty, so the shawl of India, with its myriad of strange customs, languages, religions, people, buildings, attitudes and wildlife enveloped the heart of Forster, who was endlessly fascinated with the seemingly boundless beauty of India. Indeed few non-Indian writers have ever dealt with India so sensitively and sympathetically, have ever painted India in the opalescent colours which Forster broad brushstrokes are able to achieve. The blush of the moon and the blue tint of a cloud form a central part of Forster’s homage to India, to its phosphorescence and its vastness and to the indescribable potency which lay at the heart of India, slumbering beneath the behemoth of the British Raj;“The heat had drawn back a little before its next advance, the journey was not unpleasant. As she left Chandrapore, the moon, full again, shone over the Ganges and touched the shrinking channels into threads of silver, then veered and looked into her window. The swift and comfortable mail-train slid with her through the night, and all the next day she was rushing through Central India, through landscapes that were baked and bleached but had not the hopeless melancholy of the plain.”The crux of the plot, an incidental sexual liaison within a network of eternally echoing caves, is not the major theme of the novel, which explores the relationship and gulfs between the British and their Indian subjects. Forster brilliantly captures the arrogance and priggishness of the colonialists, their ignorance and racism and the ignoble position of the native Indians in a society which was so keen to deny them their humanity, instead burdening them with the insurmountable weight of colonialism. Most of the Indian characters are reduced to the bumbling caricatures which the British had turned them into, lickspittles licking the mud-filled boots of ignorant bores, yet there is something lacking in Forster’s characterisations, which too often descent into caricturisations; the bellicose general, the frigid English lady, the sensitive poet and the sensitive sympathiser, many of the characters revert to type, and although types do exist, having them form the majority of a novel’s cast is inartistic. The two main protagonists, the doctor Aziz and the sensitive lecturer Fielding are both well fleshed out, as is Mrs Moore, who is probably the most “positive” character in the novel, yet even then Forster is unable to coax either of the main characters from the cocoon of clichés which engulf them; Aziz with his naiveté and juvenile emotional capacities and Fielding with his sensitive yet condescending love of Indian culture and people, the characters perhaps lack the half a dimension which allows them to become fully fleshes out human beings, which is made worse by the fact that Forster was a writer who aimed for psychological and social realism. But perhaps that is Forster’s point, that in a country with as many social imbalances as British India, it is impossible for us the British to view their subjects as human beings and vice versa as people are unable to overcome the barriers of empire.One of the main preoccupations of Forster’s novel is whether Indians and the British can ever achieve true friendship, and the answer is ambiguous as the only way Indians are able to ingratiate themselves with the British is to speak their language and echo and parrot their customs and culture and disregard their own. Perhaps Forster’s point is that the differences in power and culture between the two people made the possibility of true friendship nearly impossible, as even the closest friendship in the novel, between Aziz and Fielding, is fraught with a myriad of misunderstandings which are a product of their cultural differences“he grappled beneath the shifting tides of emotion which alone can bear the voyager to the anchorage, but may also carry him to the rocks. He was safe really-as safe as the shore dweller who can only understand stability and supposes that every ship must be wrecked, and had sensations the shore-dweller cannot know. Indeed, he was sensitive rather than responsive. In every remark he found a meaning, but not always the true meaning, and his life, though vivid, was largely a dream.”Although the novel sometimes reeks of the fetid smell of Forster’s fetishisation of India, it still serves as a landmarks in exploring colonial India in a way that sympathised more with Indian culture and its people than was normal at the time is wonderfully written, with some passages of great beauty and profundity."}], "description": "When Adela Quested and her elderly companion Mrs Moore arrive in the Indian town of Chandrapore, they quickly feel trapped by its insular and prejudiced 'Anglo-Indian' community. Determined to escape the parochial English enclave and explore the 'real India', they seek the guidance of the charming and mercurial Dr Aziz, a cultivated Indian Muslim. But a mysterious incident occurs while they are exploring the Marabar caves with Aziz, and the well-respected doctor soon finds himself at the centre of a scandal that rouses violent passions among both the British and their Indian subjects. A masterly portrait of a society in the grip of imperialism, A Passage to India compellingly depicts the fate of individuals caught between the great political and cultural conflicts of the modern world. In his introduction, Pankaj Mishra outlines Forster's complex engagement with Indian society and culture. This edition reproduces the Abinger text and notes, and also includes four of Forster's essays on India, a chronology and further reading.", "title": "A Passage to India", "url": "http://www.goodreads.com/book/show/15749651-a-passage-to-india", "average": 3.67, "cover": "https://images.gr-assets.com/books/1342183775l/15749651.jpg", "reviews": 2647, "authors": [{"url": "https://www.goodreads.com/author/show/86404.E_M_Forster", "name": "E.M. Forster"}], "type": ["Fiction", "Cultural", "Historical", "Classics", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/15749651-a-passage-to-india", "http://www.goodreads.com/book/show/4606248-a-passage-to-india", "http://www.goodreads.com/book/show/6603748-a-passage-to-india", "http://www.goodreads.com/book/show/11025146-a-passage-to-india", "http://www.goodreads.com/book/show/589058.A_Passage_to_India", "http://www.goodreads.com/book/show/45195.A_Passage_to_India", "http://www.goodreads.com/book/show/374443.A_Passage_to_India", "http://www.goodreads.com/book/show/45201.A_Passage_to_India", "http://www.goodreads.com/book/show/10165191-a-passage-to-india", "http://www.goodreads.com/book/show/29368761-pasaje-a-la-india", "http://www.goodreads.com/book/show/18619297", "http://www.goodreads.com/book/show/1163370.A_Passage_to_India", "http://www.goodreads.com/book/show/3087.A_Room_with_a_View", "http://www.goodreads.com/book/show/38374795-howards-end", "http://www.goodreads.com/book/show/3103.Maurice", "http://www.goodreads.com/book/show/3677.Where_Angels_Fear_to_Tread", "http://www.goodreads.com/book/show/4711854-the-machine-stops"]}