{"ratings": 143, "userreviews": [{"userName": "David Schaafsma", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "The only reason I decided to pick this off the pile of books from the library is because none of my kid readers would get the reference to the title of the Coppola movie, and they wouldn't (don't, upon notification) care. I picked it up and thought ha, clever. A bit. The reason you are still reading this review is because of the title, right? A groaner, but you know, Coppola!This I learn is a sequel to Apocalypse Bow Bow (what follows, Cow Cow? Sow Sow?), which I am not going to go out of my way to read. Since it is a story that takes place after the apocalypse, it is kind of poking fun at all the dystopian fiction out there, a thing I like. It'a all animal characters: Silly Dog, Angry Dog, The Cop, The Kitty Cat. It's pretty funny, actually. Clever, a bit. But the story is just okay. On the other hand you can read it in like 90 seconds, so there's that."}, {"userName": "Heena Rathore P.", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/19253213-heena-rathore-p", "userReview": "Note: I received a copy of this book via NetGalley in exchange for an honest review.I had a good laugh reading this comic and would definitely read the other books in the same series.The book started brilliantly and I adored all the dogs and the cat (meow.) I really enjoyed the quirkiness and the cuteness of the plot and the characters. I absolutely loved the whole thing about the \"Twonkies\" (with a capital T) and the nude dude. It's a funny book and that's what I was expecting from it, so it delivered what it promised and considering that it's a children's book, I can't expect anything more from it. Having said that, i did feel that the end could have been a little different or a page sooner.Originally I wanted to give this one a 5-star rating, but before I did I found out that the other books in this comic-series are far funnier than this one, so I thought of giving it a 4-star for now. If later, after reading the other books, I'll feel that it deserves an added star or half, then I'll definitely update my review. But for now I think 4-star rating is perfect.Aww... isin't he adorable <3"}, {"userName": "Rebecca Ann", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/4811272-rebecca-ann", "userReview": "My what a bizarre book. To me it really just felt like a weird dream that someone wrote down and had illustrated. While it was cute in a quirky way, it just didn't feel unique or insightful, or even hilarious. Although there is a naked dude in it, he is pictured in such a way that everything is hidden and it is just used for incongruity. The storyline follows a bunch of pets who have been separated from their owners because of the naked man's 'time machine\" and sent to an alternate dimension. They are simply trying to survive and find food, and accidentally challenge a lion to a duel over 'townies' (Twinkies). You can sum it all up with \"random and pointless\".This would work for the same audience as captain underpants"}, {"userName": "Etienne", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/11486904-etienne", "userReview": "Strange, but funny. There is some cultural references in it that make me laugh and the story is simple, doesn't always makes a lot of senses. But just an easy, funny absurd humor read! An be honest... what else did you expect for a book with that title and that cover..."}, {"userName": "Audrey Crompton", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/7457220-audrey-crompton", "userReview": "Even for a children's/YA graphic novel, that was bizarre."}, {"userName": "James", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/80532226-james", "userReview": "OMG SO GOOD"}, {"userName": "Briana", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/6263261-briana", "userReview": "Apocalypse Meow Meow is a ridiculous, fun-filled adventure–that takes place after the apocalypse. All humans have disappeared from Earth and only the pets are left, which means they’re just waiting to get into wild adventures. And although they do have apocalyptic problems–such as missing their people and running out of food–the authors make sure things stay silly. As the pets go on a quest to eat all the Twonkies they could possibly want from the abandoned Twonkie factory, it is easy to imagine the owners are just at work or about to come back. Not to mention there are a few hints that someone might be trying to undo the apocalypse.I have to admit that this book is not really my style. Though I did find it amusing at times, it does not really align with my sense of humor. I am also not a huge fan of the loose, cartoony art style. However, the story is entertaining and the characters are pretty endearing. I have not read the prequel to the book, but had no trouble following the plot, understanding the characters, or otherwise comprehending what was going on in this world. The authors make enough allusions to past actions that it is possible to fill in the gaps of why some characters are distrustful of each other or make certain alliances with one another.Overall, then, Apocalypse Meow Meow is pretty entertaining. I can easily imagine this appealing to middle schoolers, particularly boys. There are only a few words on each page (and oftentimes they’re words like “meow” or “grr”), so it’s a pretty quick read, which may also make it a good choice for reluctant readers.Source: ARC from ALAAC15"}, {"userName": "Trisha Perry", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/18046858-trisha-perry", "userReview": "This was a very cute graphic novel and a the second of the series. Even though it is cute and just a story about some animals trying to survive after a apocalypse there is more to the story if you look for it. In this book the dogs need to beat the large kitty to win the twonkies all for themselves and their friends. Can the dogs do it by themselves or will they need some help from their friends? This really is a good book and all the animals have such great personalities, the way some of them have banded together to survive this dreaded circumstance, especially for house pets. But I suggest you first read book one Apocalypse Bow Wow as some of the things in this book where a little confusing since I had not read the first one, but you can get the main story ok without the first book, there are just a few things that pop up that are strange without the first book. Still loved the book and thing you all will too."}, {"userName": "Emily", "userReviewDate": "Jun 20, 2016", "userURL": "http://www.goodreads.com/user/show/7607436-emily", "userReview": "Written in scenes rather than chapters, this graphic novel by a father and son duo continues the Apocalypse series involving Angry Dog, Silly Dog, Cop, Tough Dog, and Kitty Cat. Angry Dog sees that a guy has appeared, even though it isn’t “our guy” as Silly dog calls him. On their search to find the guy, they find Rat who leads them to a Twonkies Factory with enough food to quench their hungry selves. But--something is in their way in the Factory. Will Angry Dog be successful? Will they come up with a valid Plan B that will thwart the Lion lurking there? This graphic novel is perfect for either primary readers, or a great high interest, low level title for older students. Great for classroom and school libraries that just need some updating."}, {"userName": "Kristina Aziz", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/3141653-kristina-aziz", "userReview": "I got this book as an e-arc through NetGalley, so any formatting opinions are self-redacted.First, the drawings: they were cute without being too childish, and fit the tone of the story well.The story: was really adorable and I can see grade school readers loving this series. The ending felt a little cut off though, like this originally was a longer piece that got chopped in half. Although, for the second in a series, you'd never know it. It reads like the first of a series and there's a thing that is introduced but never explored or resolved that felt off.Buyability: not for me. My daughter's too young yet for me to know if she would like it.Overall: This is a great book to have in a school library, but the cliffhanger at the end means you'll probably want to get the series."}, {"userName": "Jennifer", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/1500112-jennifer", "userReview": "I am not a cat person and thought I would hate this sequel to Apocalypse Bow Wow. Yet, it was just as funny as the first, offered a clever continuation of the story, and is a nice companion to Bow Wow. I would read them together. The lack of color in these books I feel hurts the design and the overall enjoyment as while entertaining, they are a bit bland."}, {"userName": "Beth", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/9550934-beth", "userReview": "A big thank you to NetGalley for an e-copy of this book!!!Once again, James Proimos III has written a cute, funny graphic novel. I laughed out loud! When there is a \"Boom\", I laughed every time. The kids are going to love this! I cannot wait to read the next in the series...I wonder what the title will be???"}, {"userName": "Nancy Kotkin", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/10163038-nancy-kotkin", "userReview": "Funny graphic novel with a terrific ending. Models perseverance and creative problem-solving. Quick read. Good for animal lovers and comics enthusiasts. Even the most reluctant readers will enjoy this book, and feel a sense of accomplishment because they can complete it. Sequel to Apocalypse Bow Wow."}, {"userName": "Ariel Cummins", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/1636432-ariel-cummins", "userReview": "Silly and cute graphic novel about a group of pets out to save the world (and eat some snack cakes). Apparently the second book in a series, although I understood what was going on just fine without even knowing there was a first book! For kids who like captain underpants and the like."}, {"userName": "Jean Rapp-Lykins", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/40821915-jean-rapp-lykins", "userReview": "I won this book in a giveaway....really cute little book! hoping my grandkids will enjoy it as much as I did!"}, {"userName": "Elizabeth", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/36160401-elizabeth", "userReview": "Another cute tale of a group of dogs, a cat, and a rat surviving an apocalypse. I just hope there is another book. I felt the end left the reader wanting more."}, {"userName": "Mary", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/46123946-mary", "userReview": "great book"}, {"userName": "Theresa Grissom", "userReviewDate": "Apr 12, 2016", "userURL": "http://www.goodreads.com/user/show/13095635-theresa-grissom", "userReview": "Too funny!"}, {"userName": "TJ Burns", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/23826579-tj-burns", "userReview": "I received a copy of this book from Bloomsbury USA Children's Books via NetGalley in exchange for an honest review."}, {"userName": "Scott Robins", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/1420326-scott-robins", "userReview": "Disappointing. Doesn't really build on the previous book, laughs are few and far between, features a lame Terminator reference that's never explored and has a completely abrupt ending."}, {"userName": "Kacy", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/8553839-kacy", "userReview": "the first one was much better"}, {"userName": "Richard", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/7691361-richard", "userReview": "for once a sequel holds up!"}, {"userName": "Wing", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/28124140-wing", "userReview": "https://www.goodreads.com/#"}, {"userName": "Casandria", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/746715-casandria", "userReview": "Just as awesome as book 1!"}, {"userName": "wildct2003", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/1280369-wildct2003", "userReview": "Very quick read; though the pages might catch fire with how fast it went."}], "description": "Brownie, Apollo, and their ragtag group of strays have raided the grocery store and defeated some very mean mutts--but now they've run out of food. So when the crew discovers a nearby Twonkies factory, and all the Twonkies they could ever eat, they think they've got it made.The only catch is the cat guarding the factory--and this \"cat\" is MUCH bigger, and far more sophisticated, than any feline they've ever met. Can the dogs and their friends defeat their foe and claim the Twonkies for themselves?The Proimos father-son team returns with another irreverent, dog-filled take on the apocalypse, told in a graphic novel paper-over-board format. The instantly accessible artwork and laughs on each page will charm everyone from the most reluctant reader to the coolest of cats (humans and animals alike)!", "title": "Apocalypse Meow Meow", "url": "http://www.goodreads.com/book/show/23848079-apocalypse-meow-meow", "average": 3.28, "cover": "https://images.gr-assets.com/books/1443804870l/23848079.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/13988774.James_Proimos_Jr_", "name": "James Proimos Jr."}], "type": ["Sequential Art", "Animals", "Childrens", "Sequential Art", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/23848079-apocalypse-meow-meow", "http://www.goodreads.com/book/show/22313644-apocalypse-bow-wow", "http://www.goodreads.com/book/show/27414368-mac-cheese", "http://www.goodreads.com/book/show/25544979-knuckle-and-potty-destroy-happy-world"]}