{"ratings": 4240, "userreviews": [{"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "In A Question of Honor, we start the story in India, 1908, where Bess as a child learns that Lieutenant Wade, a man in her father's regime has killed both his parents in India and three people in England, but he disappears before they catch him. And, he is presumed dead after a while when no traces of him are found. A decade later Bess learns from a dying man in France that Lieutenant Wade could be still alive...The previous book, An Unmarked Grave, was the first book in this series that I didn't find as excellent as the rest so I was hopeful that the next one would be better. And it was. The story in this book is more interesting and I found it hard to put the book down.The book is really intriguing to read. Bess is trying to find out if Lieutenant Wade still alive, and if he is what is he doing fighting in the front and was he really guilty of the crimes in India and England? Bess and Simon Brandon (he works for her father) are working together trying to find out the truth without involving Bess father, Colonel Crawford because the killing is still a stain on the Colonels regiment's reputation and Bess doesn't want to involve her father if it turns out that Wade isn't alive. So, she travels to the village where the killing of a family took place and tries to find out more about the murdered family and the connection to Lieutenant Wade. But, that's not that easy, some people there are even quite hostile towards her. But, Bess won't give up.What I love about this book is that it's like a puzzle, you have to be patient, piece after piece is revealed during the progress of the story until the truth is revealed in the end. I also loved that my favorite Aussie, Sergeant Larimore made a cameo, although I wish he had a bigger part in the book. But still I love every mention of him in the books, like this one where she met him in France as she tends to wounded soldiers:\nI was always happy to see this cheeky Australian. He had helped me once when I needed help desperately and I was fond of him. Dangerous to care about anyone in wartime, but still…\nLooks like Bess is quite fond of Larimore as well! I must admit that I hope they will end up together. I just love every scene with them together.I recommend this series to anyone that likes to read historical mysteries, especially books that take place during WW1. I enjoy these books very much and every book can be read as a stand-alone.Read this review and others on A Bookaholic Swede"}, {"userName": "Barbara", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "In the early 1900's, young teen Bess Crawford lives in India where her father, Colonel Crawford, is in charge of a British regiment. The school-age children of the regiment's soldiers are usually sent to England to be educated, where they live with foster families. When Lieutenant Standish and his wife get word that their youngest daughter died of typhoid in England, Mrs. Standish returns home escorted by the much respected Lieutenant Wade. But when Lt. Wade returns to India he's accused of murdering a family while in England and of killing his parents upon his return to India. The regiment is shocked, unable to devine a motive for these horrendous crimes. Rather than face the charges Lt. Wade makes a run for it. The military police are unable to capture him and there are reports that Wade died while trying to escape through Afghanistan. This leaves a blot on the honor of the regiment. Ten years later, during WWI, Bess Crawford is an army nurse. While working at a field clinic in France Bess comes across a dying Indian soldier who tells her that he's seen Lt. Wade. Bess is soon off and running, determined to find Lt. Wade and bring him to justice, thus restoring the honor of her father's regiment. During her investigations Bess discovers that some foster homes were terrible places, giving her a hint of a possible motive for the murders. The usual characters are on hand in this story, including Beth's parents and her good friend Simon. The book provides an authentic feel for the horrors of combat; the pain and plight of wounded soldiers; and the difficult conditions in field hospitals. The story's resolution seems a little out of left field but believable enough. A good book for fans of historical mysteries.You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Allison Tebo", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/60149806-allison-tebo", "userReview": "That was . . . odd. I have to admit, it’s been a while since I’ve read a book quite like this. I’m afraid the only way to describe it is that it is utterly devoid of soul. To my recollection, I can’t remember a book as soulless and “stripped” as this one. It was rather like trying to dehydrated, vacuum- packed food. All tone, all personality, all voice, all style was completely distilled from it to reach an end result that read much more like an official report than a book. Usually I find the first person narratives inject more personality into their narrator, I’ve seen quite a few first person narratives “save” a bad story or bad writer – but in this case the attempt not only failed, it felt worse. I literally had difficulty even recognizing that the narrator was female. It was difficult to tell how any of characters felt or how they related to each other. The official report style worked for the prologue – which was supposed to sound like someone relating a long ago crime – but it ruined the rest of the book and I ended up skimming a lot. The author tried at various points to insert emotion, but somehow, in a way I can’t quite articulate, the attempt failed utterly. They also tried to insert something extra into the driest of dry narratives and it became quite awkward. In the middle of this official report, suddenly a character would say: “Looks like rain—see those clouds?” or “Look there’s a woman selling kittens.” Not quite like that, but very similar, and the result was somehow worsened. I will admit, I’m not a mystery person – but the story line and especially the settings (beginning in India during the time of the British Raj and fast forwarding to when our MC is a nurse on the front lines of WW2) would have been wonderful. Unfortunately, nothing ever seemed to worked for me. The setting began to feel more like an inconvenience then an enhancement in the hands of this particular writing approach. The mystery – or what I saw of it as I began skimming – seemed interesting enough, but perhaps a little dark (as well as head-scratching at points) but perhaps it only felt dark because no one seemed to react to it with the proper amount of emotion, but it’s difficult to tell. I picked this one up for a dollar at a library sale and I'm putting it in my giveaway pile."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "Some series need to die a graceful end, this is not one of them.Whenever I want a good book, there are certain authors I reach for, certain authors I know will never let me down. The mother/son duo of Charles Todd numbers among those authors. They have written over 20 books, and I have adored every single one. What can I say? There's a reason why I've read everything Charles Todd has ever written, and will continue to do so for as long as they continue to write.An interesting, compelling mystery. A lot of wartime action, particularly in the nursing stations, caring for the wounded, the dying, the ill. The trauma and urgency is there. The mystery is intriguing, and constantly manages to surprise me in the twists and turns it took.That's the thing about Charles Todd's books. The direction of the mystery never turns out the way you would expect. It is no Agatha Christie. You can never see where a clue will lead you. It is so much more complex than that, such is human nature, and human nature is so eloquently described here.Bess Crawford is an amazing heroine; she always has been. She is smart, strong, brave, not afraid of getting dirty, despite her social status. Her family is similarly lovable, particularly her strong-willed, iron butterfly mother and loving Colonel Sahib of a father. I can completely understand Bess's need to clear her family's name and maintain their honor and pride.I love the fact that there is no forced romance, and there has never been any in Charles Todd's series...any of them, be it the Ian Rutledge series or this one. The romance is nonexistent, which is as it should be, given the war time and the gravity of the situation. Ain't nobody got time for romance, and that's the way it should be.Still, I can't help but hope that one day, the irreplaceable, wonderful, stalwart Simon Brandon would end up with Bess. There is no more fitting match in my eyes.It's a short review, it's a poor review, in terms of the ones I've written, but I love this series so much that I simply lack the appropriate words.It's not perfect, people meet happenstance far too many times in the midst of war, but overall, this book is so well-written and the characters so brilliantly portrayed, that I will happily overlook any minor flaws."}, {"userName": "Mark Flowers", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/2628102-mark-flowers", "userReview": "Some interesting characters and one intriguing piece of backstory, but the plot is a train wreck. Shall we count the coincidences? In chronological order(spoilers ahead):1) The mystery surrounds the murder of a family in Hampshire. On the day in question, Lt. Wade, stationed in India, a former foster child of the family, just happens to be in England, near enough to the family to come to confront them about their abuse of him as a child. He arrives *at the precise moment* that another of the family's foster children is leaving the house, having just murdered the family (the real murderer is given the slimmest of motives and none at all for the murder to have occurred on this particular day). Naturally suspicion falls on Wade.2) When the Wade returns to India, he just happens to stay with his parents the same night that an entirely unrelated person decides to kill them. Naturally, suspicion falls on Wade.After having escaped arrest and been on the run for years, Wade enlists in the British army under a phony name to serve in World War I.3) The brother of the man who actually killed Wade's parents is serving in WWI as well and:a) sees Wade and recognizes him, 10 years laterb) is able to communicate his discovery to our heroine, Bess (an army nurse), who:i. speaks his native language of Hindiii. is the daughter of Wade's Colonel, and therefore is in a unique situation to confirm the sighting.4-7) At least 4 separate times through the last year of the war, Bess manages to see Wade, and eventually talk to him, despite the (roughly) 4 million British soldiers who served in 1918.8) Uncounted number of coincidences as Bess manages to investigate the murder 10 years later, just using her perfectly timed leaves from the army.Bess begins to realize that she needs to investigate the other foster children of the murdered family.9) She just happens to runs into one of them at a battlefield hospital - again, among the 4 million British troops there.10) *Another* of the foster children is a man she already knew, her regular ambulance driver11) Another foster child (the murderer)is a sort of handmaid to Princess Mary, who just happens to visit the hospital in England where Bess has sent Wade (under his assumed name), allowing Bess to confront the murderer, using Wade as bait.I probably missed a few."}, {"userName": "Aerykah", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "I think this may be my favorite Bess Crawford book so far. :)"}, {"userName": "Cynthia", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/1802440-cynthia", "userReview": "Immensely EntertainingI couldn’t get enough of this book. The odd thing is I didn’t find the writing especially fine, there were multiple repetitions and improbabilities in the plot, and since I hadn’t read the other books in the series I found the references to other cases baffling however I couldn’t stop reading because I was having so much fun. In fact I found another book in this series on sale in the kindle version and bought it right after finishing “A Question of Honor”. What I did like was the realistic portrayal of WWI and the nursing of that era, the fascinating parts about India and the military personal that served there as well as the conditions in England at the time. Bess, the main character, and her family and friends were likeable and I couldn’t help rooting for them. I’ve read several books in this author’s Ian Rutledge series and liked them a lot. Looks like I need to add this series to my reading agenda too.This review is based on an advance reader’s copy provided by the publisher.(Disclaimer given as required by the FTC.)"}, {"userName": "Lauren", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/4731410-lauren", "userReview": "A Question of Honor4 StarsWWI nurse, Bess Crawford, becomes involved in a decade old murder investigation when, moments before his death, an Indian Subedar informs her that he has seen a killer from the past. During her childhood in India, an officer from her father's regiment was accused of murdering five people, but disappeared before he could be brought to trial. This incident left a profound mark on the Colonel and his men for whom honor and duty are paramount. Now Bess has an opportunity to look into the case and discovers that all is not as it seems and perhaps the officer is innocent after all. Despite the numerous coincidences that move the plot forward and enable Bess to solve the case, this is still a significant improvement on the previous book. The mystery is interesting with well-fleshed out suspects, a logical motive and an appropriate perpetrator. The information on the fostering of English children born in India is very compelling and demonstrates that little about human nature has changed over time. Moreover, the descriptions of the conditions in the trenches and the injuries sustained by the soldiers add an excellent sense of realism to the narrative and immerse the reader into the wartime situation. The one minor issue with the book is that the romance between Bess and Simon is taking too long to get going. It is time to shape up or ship out!"}, {"userName": "Bonnie", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/1602827-bonnie", "userReview": "A Question of Honor is a Bess Crawford mystery set 1908 during World War I. Bess is a nurse serving during the war in France and has seen terribly wounded men and tries to keep up with patents coming in while war rages just behind the lines. Bess had been raised in India where her father was posted as an officer and Bess's mother refused to let him go alone. She insisted the family stay together. This sets up a contrast with a family widely scattered. Bess was on leave in London when she saw a small shop that had old pictures in the window. She went in and bought some items that had been donated to charity. One was a silver frame with a picture inside, another was a baby's rattle also appearing to be silver, and an old doll. Simon his her friend and plays an important role as an instigator who tries to solve a question about a soldier who goes missing from the Colonel's ranks. He was suspected of killing his mother, father, and brother in a shooting incident. So. there is a desperation to catch the killer. And it is thought to be a man named Wade. Much of the story is taken up with the wounds being treated and the ambulances traveling to pick up the injured and taking them along rutted roads where tanks had churned up the roads. Bess becomes obsessed with the question of what had happened to a good man who had supposedly left his posted position and run away. Wonderful descriptions of London are given while Bess is on leave. Her parents support her and her mother and Bess make trips to visit friends in the area. On one such trip, they discover a house for sale that is surrounded by beautiful flowers and walk around the property where they are accosted by an angry man who thinks they are trying to see the house where the son had killed his family. Now, Bess is determined to find out what happened to the officer Wade who had apparently in the same house. The owners had enjoyed wealth, but the father had played the stock market and lost their money. They take in homeless children to make money and horrible crimes are committed to the helpless children. When Simon and Bess discover what has taken place, they talk to the woman who was hired to take care of them. And, now, the hunt is on to discover what had happened to those children and if the man Wade had been one of them. The book is 500 pages and some of it is repetitive. But, I enjoyed reading about India, the war, and trying to solve the mystery."}, {"userName": "Shorty", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/3347032-shorty", "userReview": "Much better than the last couple novels in the series."}, {"userName": "LJ", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "First Sentence: The letter came for Lieutenant and Mrs. Standish on an afternoon when the heat was at its height, and we had already retired indoors to rest until the evening.As a child, Bess Crawford lived with her family in India where her father served as a regimental colonel. A sense of dishonor was borne by the regiment when one of his officers, Lieutenant Wade, was accused of murdering his parents and three others while on leave in England. He escaped back to India, disappeared, and was believed dead, before he could be brought to trial. Ten years later, Bess is serving as a nurse on the frontlines, a dying Indian ambulance driver recognized her and said he had seen Lt. Wade. Knowing how painful the incident had been for her father at the time, Bess starts doing a bit of investigation; first to see whether Wade really is alive, and then to find out what really happened as her findings about him conflict with the supposed events.Normally, prologues seem disconnected and a bit annoying. Not the case here. This prologue was interesting, well-written and critical to the subsequent story. It not only presents the characters and establishes their history, but it is a wonderful contrast in setting to that which follows.The Todds’ have a wonderful way of introducing their characters. Bess is capable, smart, understanding and independent. However, she is also true to her period as she knows her actions could reflect on her parents, who are well known within her circle. Simon, a regimental sergeant-major and aide to Beth’s father, is someone she’s known all of her life. He is there to help her and protect her; not because she is weak and needful, but because it is appropriate in her position. He is an intriguing character, about whose history we learn a bit as the story progresses, as is the Aussie Sergeant Larrimar, introduced in a previous book but makes a cameo appearance here. Larrimar is someone you’d definitely want as a best friend or big brother. I also very much appreciate that when actual historical figures are included, it is done in a realistic way.The level of research done by the Todds’ is very apparent. To say they create a strong sense of time and place would be an understatement. We experience the numerous trips Bess makes between the front lines, field hospitals, taking patients back to England, and having break time in London and at home. You feel her exhaustion and wonder at the sense of contrast between being in the trenches and being in a lovely English village. What is interesting in their writing style is that, perhaps due to the voice being first person, it is not florid or emotional, but realistic and informative. They neither sugar coat nor make the scenes horrendously brutal, yet all the emotion is there. “…I dealt every day with life and death. I’d watched men die who would have given everything they owned to live one more week, one more month, one more year. … It was heartbreaking, it was real, it was impossible sometimes to forget.”Odd as it sounds, the Todds’ have, in Bess, created a character I respect. She doesn’t make assumptions or fly blindly off, but takes time, requests help when needed, and searches out answers carefully and intelligently. Better yet, she, and they, take you along, step-by-step through the investigation. It makes the journey very satisfying, but not at all without suspense along the way.“A Question of Honor” is a very good book; possibly my favorite in the series, so far. That’s saying a lot for a series I’ve liked better with each new book.A QUESTION OF HONOR (Hist Mys-Bess Crawford-France/England-1918) – VGTodd, Charles – 5th in seriesWm. Morrow, 2013"}, {"userName": "Mellena", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/13029892-mellena", "userReview": "The story line has already been described so I won't repeat it. I've been reading this series since its inception, and this is much the same as the previous ones. Always an interesting read, well-written but seemingly hastily edited in a few places. Though obviously formulaic, which I get, the author this time has expanded the involvement of Bess's mother, the \"colonel's lady\", in the investigation process, which I think added to the story. Funnily enough, her mother sounds like a much livelier and more charming character than Bess, and I found myself wanting to hear more from her than Bess. Bess is spending too much time ironing uniforms, and lo, after all these years, really needs a serious boyfriend. Simon, her long-time \"friend\" and regimental whatever, needs to step up or move aside. While I'm allergic to the romance genre and fully appreciate the type of novel which this is, I was hoping for more character and relationship development. With WWI winding down at the end of this story, maybe the author or Bess is moving on. This was not an ARC, I actually, gasp, PAID for it. I was in between books and desperate and far down the list at the library for this one. I owe reviews on many others I've been reading lately, but this was an easy review as it was likeable, and sometimes easy and likeable is sorely needed. More a 3.5 than less. Maybe. I wish there were more gradient options. Course then folks like me would still equivocate."}, {"userName": "Tina", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/5975648-tina", "userReview": "I enjoyed this book - Bess Crawford is, as always, a pleasure. I found some of the coincidences completely unbelievable, however; while Bess is serving in hospitals near French battlefields, somehow people connected to the incidents in question in England continue to appear in Bess's orbit. I see how the author was using these narrative devices to push the plot along, but I found it rather jarring. (I'd stop to ask myself: what's the probability of her running into him HERE?) Nonetheless, I adore Bess Crawford and deliberately decided to ignore it - suspension of disbelief! On the whole, recommended."}, {"userName": "Cathy Cole", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/5086649-cathy-cole", "userReview": "I first became acquainted with the mother-son writing team known as Charles Todd through their series featuring World War I veteran (and victim of shell shock), Inspector Ian Rutledge. Although that series is excellent, after awhile Rutledge's depression and angst became wearing. In the Bess Crawford series we get to see the horrors of World War I through the eyes of a nurse at the front lines-- someone risking her own life daily in an attempt to save men like Ian Rutledge. This series has continued to get better with each book, and A Question of Honor is the best one yet.In previous books we've learned bits and pieces about Bess's childhood in India where her father was stationed. Now we get to learn even more with this unsolved murder case from 1908 when she was a teenager. I'm fairly well versed in the topic of nurses at the front during World War I (one book I can't recommend highly enough is Lyn Macdonald's The Roses of No Man's Land), and sometimes I have to forcibly keep my disbelief under tight wraps when reading about this character's travels during war time. I don't think any other nurse throughout the history of mankind could rack up more frequent flier miles than Bess. She always seems to be getting leave or hopping aboard a hospital ship to transport the wounded across the Channel to various hospitals in England. All the other nurses must be green with envy!That said and out of my system, the mystery in A Question of Honor is the best yet-- and there's the added bonus of Bess's mother having a role in solving it. This series is populated with several secondary characters that I'd love to learn more about. Since Mrs. Crawford steps up to the plate in this book, I'm hoping this paves the way in future books for more to be divulged about Colonel Crawford and Simon.The plot is a complicated one that must unfold slowly, due in part to so many people denying knowledge of certain events and places because of their traumatic childhoods. In Jacqueline Winspear's Leaving Everything Most Loved, the reader learns about Indian nannies and governesses who were taken to England and then abandoned when the children they were caring for grew up and went to school. In A Question of Honor, we learn what could happen to children whose parents, stationed in India, sent them to England for schooling and to shield them from tropical diseases. Once again, secrets prove deadly, and this latest Bess Crawford mystery proves to be an engrossing read."}, {"userName": "Maggie Boyd", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/3730838-maggie-boyd", "userReview": "A completely engrossing read. The story starts in India, where a young Bess Crawford is home with her parents when she hears the news of a young girls death. The little lass had been sent to England for schooling and died of typhoid. The devastated mother goes back to Britain, wanting to comfort her eldest daughter (also at the same home for schooling). Since there are constant skirmishes at this moment on the subcontinent and the father can't leave, the lady is accompanied by another soldier, a Lt. Wade everyone holds in high regard.The grieving mum stays in England but Wade returns to India. Within weeks it is learned that he killed three people while in England and then murdered his parents while visiting them at another point in India. Before he can be brought to justice he escapes into a dangerous portion of the country.Ten years later Bess is at a field hospital when an Indian soldier tells her he has spotted Lt. Wade. She is unable to farther question him since he quickly expires from his wounds. With the war on Bess sets the issue aside and continues with her nursing duties until she is called out to help a man in a trench, where she sees a glimpse of Lt. Wade for herself. Sent home on leave shortly thereafter Bess begins to look into the background of her hero turned killer and opens a horrible hornets nest of surprises.Excellent history and an intriguing mystery make this one of the best Crawford mysteries to date. While I was a bit disappointed with the ending (a touch far fetched) I had enjoyed the book enough that by the time I got there I didn't care. Fans of the series won't be disappointed by this latest episode."}, {"userName": "Sheri South", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/9458891-sheri-south", "userReview": "There's a lot to like about this book: an old house with a dark secret in its past, a look at British Colonial India, and of course the World War I setting. I've read every book in this series, and while I've enjoyed them, there's something that keeps them out of five-star territory for me, something I could never quite put my finger on. Never, that is, until I read the back matter at the end of the book. In it, the author(s) talk about how they enjoyed being able to visit Bess's childhood, and explore a different aspect of a character they've come to know so well. That was the \"aha!\" moment for me. For in spite of having read all the books, I don't really feel I \"know\" Bess at all. She seems curiously detached from her war experiences, seemingly unmoved by them even as she describes them to the reader in detail. And while I wait for some hint of a romance to develop between Bess and Simon, she doesn't give the reader any hint as to her feelings toward him, either. Those hoping for their relationship to deepen in this book will be disappointed. I enjoyed the book's somewhat gothic mystery, as well as a vivid glimpse of a world quickly fading from living memory, but I do wish I could connect on a more personal level with its undeniably resourceful heroine."}, {"userName": "Jeanette", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Barely made the 3 stars. Bess, despite her valiant service and investigative nature, somehow- to me- she just echoes a flat affect. It's not just Simon who lacks moves. They seem so paper cut stereotypes of the heroic WWI figures on a monument- frozen. The plots for Bess Crawford are contrived to the point of close to ridiculous motives for murder, as well, IMHO. Not unreal, but just so highly unlikely- most of it. I enjoyed the part in India, but doubt if I will read any more Crawford. The Ian Rutledge series by Charles Todd are a bit more plodding, but deeper in locale and in plot and especially in characterizations. This is good if you want a predictable, rather cozy for the era, mystery read. Easy, easy read level."}, {"userName": "Lisa", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/3181581-lisa", "userReview": "A terrific entry in the Bess Crawford mystery series, which seems to get increasingly better with each book--may they continue indefinitely! The story includes much interesting information about India during the British Raj and about nursing on and near the front lines in World War I, as well as continuing to develop the main characters and having a fine plot."}, {"userName": "Susan Ash hanson", "userReviewDate": "Mar 08, 2014", "userURL": "http://www.goodreads.com/user/show/18038146-susan-ash-hanson", "userReview": "Good, I'm about ready for that war to be over"}, {"userName": "David", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/7175349-david", "userReview": "Thanks to my friend Carol for passing this along to me! Now I want to read everything by this author (actually a mother-and-son team), the two books I've read so far are so absorbing and engaging. Still, I did notice the perfect plotting required a few convenient coincidences. But that's true of many mysteries, and doesn't really bother me. One thing I appreciate about the Bess Crawford mysteries is that she's a battlefield nurse in World War One, so there's a lot of description of the awful carnage and the pointlessness of lives lost gaining a little ground only to be pushed back, or just lobbing artillery fire back and forth across the front in efforts to keep the enemy in their trenches. You really get a sense of how awful war is in general and that war in particular, and it adds something, somehow. Makes it more 'real'? Makes me like Bess more? Maybe a bit of both."}, {"userName": "Richard", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/63519083-richard", "userReview": "A truly great read. It is amazing how the author can take a seemingly innocent situation and turn it into an amazing mystery. I have read six Bess Crawford novels and each one truly a great read. Each of the characters are very believable. The plot and sub plots are amazing. What seems like a simple coincidence turns into a major mystery with twist and turns and unexpected revelations. Of the six Bess Crawford mysteries I have read, I have not managed to figure out the killer before it was reveales. I can only hope that the last one will be my saving grace."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "For some honor means everything. For a soldier especially. Men have killed to keep the honor of their family or their duty as an officer intact. That's why it comes as a complete surprise and utter shock when Lieutenant Wade has been accused of murder. Not only the murder of his parents, but also the murder of a random family that he seemed to have close ties with. For nurse Bess Crawford, this comes at such a loss for words for a man that she thought she knew to have committed these murders. It seems as if Bess really didn't know this man at all. Now ten years later she is still haunted by the notion that Lieutenant Wade may not be dead like most presume. She wants to follow all the clues to see where they might lead and hopefully give her some insight into the reasons why a man would murder six people and then completely live a different life in the army. \" We've all asked ourselves the same question.\"\"And yet no one pursued it.\"\"We pursued him. And were told he was dead. There was no need for your father to travel to England to go into the matter. He was needed there at the time.\"\"Yes, I expect you're right.\" I fell silent, thinking it through. \"I was shocked when the Subedar told me who he'd seen. I would probably have left it there, if I hadn't seen the man for myself. Or believed I did. We could have both been wrong, you know. Still, I remember my father's face when he got the news. I remember how everyone felt, even though I didn't know about the other murders. If we did see the Lieutenant in France, then I want to get to the bottom of it for the Colonel Sahib's sake. I think what bothers me most is that we assumed, the entire regiment, that Lieutenant Wade was dead. If he's escaped justice, then my father will feel responsible. He called off the search, you see.\" I smoothed the fingers of my driving gloves, not looking at Simon. It was the first time I'd really put my feelings into words. Even to myself. \"I don't want him blamed. I don't want him to feel he should have done more. Because I don't think he could have done.\"\"Then you're going the wrong way about it. You're bringing it all back again. For all of us.\"\"No, I'm trying to lay the Subedar's words to rest. There must be someone out there in France who bears a resemblance to Wade. If it isn't Wade - then he's dead, his bones already dust in the Khyber Pass. Where they ought to be.\"And so the search continues for answers as the reader follows Nurse Bess Crawford in another mystery by Charles Todd in his latest novel, A Question for Honor due out in bookstores in August of 2013. I've been a huge fan of the Bess Crawford Mystery's simply due to the fact I love mystery and historical fiction. Charles Todd weaves them together so masterfully to give the reader so much more than they ever expected. Plus the added bonus of having a woman character offer the duality of roles, first as a nurse and then during her free time or on leave, following the clues that may in fact restore an honor due to her father, the Colonel Sahib. I received A Question of Honor by Charles Todd compliments of William Morrow, a division of Harper Collins Publishers for my honest review and received no monetary compensation for a favorable review. This one does truly deserve a full 5 out of 5 stars in my personal opinion. The best part I love about Charles Todd's Bess Crawford Series is his attention to detail, and his ability to tell such a compelling story you honestly believe it just might have happened. He does all this without going into gory details or using inappropriate language that some authors chose to in writing their novels. This is why I LOVE his novels and this entire series. I plan of coming back for more and more because I love Bess! She's a woman who I could see myself as becoming had I lived in that time period. This is like Downton Abbey meets Sherlock Holmes."}, {"userName": "Luffy", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "At one stage reading the book, it was threatening to be one of the worst ones I've come across. It was veering between one and two stars. I said to myself, give me a reason and I'll do it. Well, I did rate it 1 star, and as a result, I'm swearing off books by Charles Todd. The warning signs were there when at every step of the inquiry conducted by the heroine, Bess Crawford, there was a plethora of deaths set in the past. Now, untimely deaths that haunt the present from their grave is a device that the authors have used to good effect in previous books. But here it was literally overkill. I couldn't shake off the reaction how maudlin and manipulative the entire business was. Matters weren't helped when the voices narrating the details of the deaths weren't individualistic and sharply personal and intimately unique. These witnesses had no voice of their own. Then there's the betrayed promise of the plot itself. To resume, an army officer is accused of two series of murders. One set, three people in England, then, having sailed to India, there was the murder case of the officer's own parents. The latter tragedy occurred just after the said officer had alighted in India. Long story short, the two sets of murders were unrelated, and the second double murders had nothing to do with the other, was perpetuated for obscure reasons, WAS a coincidence of unbelievable proportions, and was solved within the confines of a postscript tagged on at the end of the book. It is dangerous to think too much of what to read and what not to. Poorly rated books can be a success with any reader. But then you think of authors who have written poor books and have disappointed you twice or thrice. While I won't automatically go for every flavor of the month, I have reached the stage where I can accept that my past go to authors cannot guarantee a good read. That renders a sizable chunk of my books redundant. But this selection problem is a pleasant headache. And I'm going to keep trying to use my judgment and experience to find the next gem. Hopefully sooner."}, {"userName": "Ariel", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/5079976-ariel", "userReview": "I have read every entry in this series and I do love them all but this one took a little more time for me to get through it. In this novel an incident from the past resurfaces and leads to a mystery Bess is determined to solve. As some other reviewers correctly pointed out, this novel perhaps relies a bit too much on coincidences to propel the story along. For instance Bess is in the middle of a battle in France and yet she keeps running into people integral to the story. A certain person in fact who managed to elude the entire English army in India but not our heroine. While we are on the topic of things I would like to fix, I would also like to see Bess develop a love interest, in particular Simon Brandon. A war is going on. It is not believable that they would not have hooked up by now, unless he is gay. If he is please just say so and I will move on. People are dying all around them, it is not realistic that people are not hooking up in the face of death. To illustrate my point I offer up two other series that remind me of this one, Maggie Hope and Maisie Dobbs. Both women are just as smart and sleuth minded as Bess Crawford but their authors develop their personal sides as well as provide an intriguing mystery. Maise in particular has changed so much from the first novel. I don't always like her choices but at least she's making them. I can't really say what Bess is like personally outside of being nosy and a good nurse. It may seem like I am being highly critical but it's just because I really do like the series so much. It's very well written and the stories the authors put forth are intriguing. I am not ready to give up yet but the series would benefit from some personal progression in the next book."}, {"userName": "Kathleen", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/30469326-kathleen", "userReview": "The main character, Bess Crawford, recognizes a man from her father’s regiment back in India when she was young. The officer had disgraced the regiment by running away from charges of committing murders both in India and in England but now appears to be a British soldier fighting in Europe. Bess and her family become involved in finding the truth about the murders and how the man has survived in the intervening years. Except for some implausibility regarding the young man’s ability to survive so much (a cat should have so many lives!), the search for the truth is an enthralling story that ranges from the quiet countryside of England to the ravages of war and back again. Charles Todd, as always, does a magnificent job recreating the war scenes for the reader, so you feel like you are there beside Bess. You can almost hear the cannon fire and feel the exhaustion of trying to care for so many men. At the same time, the plot is convoluted and intriguing, coming to a surprising reveal at the end."}, {"userName": "Claire", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/5011274-claire", "userReview": "I received A Question of Honor as part of a Goodreads giveaway.In 1908 India, five horrific murders are committed within the regiment of Bess Crawford's father and the chief suspect, Lt. Thomas Wade, escapes without a trace, seemingly confirming his guilt. Ten years later, serving as a nurse in WWI, Bess treats a mysterious patient who she is convinced is Wade, living under an assumed name. Is it? And if so, can she bring him to justice? Or is there more to this case than meets the eye? Bess takes on these questions as she seeks the solution to the crime that haunted her childhood.A really great read. Bess is a wonderful protagonist and the mystery, though dark, is engaging and moving. Todd does an excellent job of bringing imperial India and WWI Europe to life as we learn Wade's tragic backstory and the events that lead to the commission of such bloody acts. Hopefully he writes more in this line of mysteries; I'll be happy to read them."}, {"userName": "Margaret Chind", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "----------------The (covers) editions I have:"}, {"userName": "Linda", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/3485057-linda", "userReview": "This installment of the Bess Crawford series begins with a flashback of ten years when she was a young teen in India. As always, the mystery revolves around military men connected with the Colonel Sahib and Simon. We are given a bit more insight into those families who lived in India and sacrifices they made. Rudyard Kipling even makes a cameo appearance as a friend of Melinda Crawford and helps with solving the mystery. An officer accused of several murders disappears from the Colonel's command in India. He reappears as an enlisted man fighting in France after ten years, or at least that is how it seems. Bess sets out to solve the mystery and uncovers unexpected horrors not related to battlefield action. Charles Todd, again, provides an interesting look at the early 1900s using characters who are well-developed and always a pleasure to meet again. Armistice appears reachable as this book ends and I look forward to seeing where Todd takes Bess and her fellow characters next."}, {"userName": "Larraine", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/6092728-larraine", "userReview": "Charles Todd's latest Bess Crawford brings the reader to just before the end of World War I. Bess is a nurse in France. One of the men she tries to help is an Indian soldier who claims that he saw an AWOL British Lieutenant from 10 yrs before when Bess and her parents were in India where her father, a Colonel commanded a regiment there. Bess is shocked because the man was accused of murder his parents who lived in India but also was accused of killing a family of three in cold blood in England. She enlists the help of her father's aid and former Seargent-Major Simon Brandon to find out more. There were a LOT of twists and turns in this one. It really was, for me, something of a surprise although I started suspecting the murderer after a while. These are such well-written books. The atmosphere is perfect. The war is coming to an end. There are rumors of an armistice. What next for Bess?"}, {"userName": "Kate", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/572977-kate", "userReview": "Barely finishable. Bess's continual lies in an attempt to solve a long ago murder which she only wants to solve because the loss of the alleged murderer reflects badly on her father, her complete inability to be logical in her suspicions, the crazy level of coincidence, Simon as all knowing Mr Knightley again (not deserving Mr Knightley any more, let us say all knowing Edward Cullen), the general confused plot, A nurse who spends more time on leave or shunted from hospital to hospital on an impossible time frame (surely the war must be over! She has been each of these places long enough to be trusted and valued before she is moved and this must've happened four times in this book alone!)...it is all a mosh-mash with temporary good writing or interesting bits. I give up on this unintentionally unpleasant character."}], "description": "In this emotionally powerful new entry in the \"vivid period mystery series\" (New York Times Book Review), nurse Bess Crawford investigates an old murder that occurred during her childhood in India, a search for the truth that will transform her and leave her pondering a troubling question: How can facts lie?Bess Crawford enjoyed a wondrous childhood in India, where her father, a colonel in the British army, was stationed on the Northwest Frontier. But an unforgettable incident darkened that happy time. In 1908, Colonel Crawford's regiment discovered it had a murderer in its ranks, an officer who killed five people in India and England yet was never brought to trial. In the eyes of many of these soldiers, men defined by honor and duty, the crime was a stain on the regiment'sreputation, and on the good name of Bess's father, the Colonel Sahib, who had trained the killer.A decade later, tending to the wounded on the battlefields of France during World War I, Bess learns from a dying Indian sergeant that the supposed murderer, Lieutenant Wade, is alive-and serving at the Front. Bess cannot believe the shocking news. According to reliable reports, Wade's body had been seen deep in the Khyber Pass, where he died trying to reach Afghanistan. Soon, though, her mind is racing. How did he escape from India? What drove a good man to murder in cold blood?Curious to find answers, she uses her leave to investigate. In the village where the first three killings took place, she discovers that locals are certain that the British soldier was innocent. Yet the present owner of the house that was the scene of the crime believes otherwise, and is convinced that Bess's father helped Wade flee. To settle the matter once and for all, Bess sets out to find Wade and let the courts decide.But when she stumbles on the horrific truth, something that even the famous writer Rudyard Kipling had kept secret all his life, she is shaken to her very core. The facts will damn Wade even as they reveal a brutal reality, a reality that could have been her own fate.", "title": "A Question of Honor\n      \n          (Bess Crawford #5)", "url": "http://www.goodreads.com/book/show/17703231-a-question-of-honor", "average": 3.95, "cover": "https://images.gr-assets.com/books/1384940310l/17703231.jpg", "reviews": 415, "authors": [{"url": "https://www.goodreads.com/author/show/131.Charles_Todd", "name": "Charles Todd"}], "type": ["Mystery", "Historical", "Historical", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/17703231-a-question-of-honor", "http://www.goodreads.com/book/show/17349296-a-question-of-honor", "http://www.goodreads.com/book/show/17331392-a-question-of-honor", "http://www.goodreads.com/book/show/17349225-a-question-of-honor", "http://www.goodreads.com/book/show/18635070-a-question-of-honor", "http://www.goodreads.com/book/show/6093438-a-duty-to-the-dead", "http://www.goodreads.com/book/show/129561.A_Test_of_Wills", "http://www.goodreads.com/book/show/7882231-an-impartial-witness", "http://www.goodreads.com/book/show/10650911-a-bitter-truth", "http://www.goodreads.com/book/show/20234.Wings_of_Fire"]}