{"ratings": 2052, "userreviews": [{"userName": "Charis", "userReviewDate": "May 31, 2008", "userURL": "http://www.goodreads.com/user/show/716617-charis", "userReview": "To the person who recommended this book to me, first of all, I would like to say, \"Mother, that was one weird bus stop!\" What do you get when you combine a western novel with a sci-fi and a romance and Pilgrim's Progress? You get a cowboy shooting blue laser light at demons to save his true love. That's what. And then you stay up late into the night trying to find out what happens, and you come away with the same sort of impression you have after eating sushi or kimchee for the first time--weird, but strangely good and even inspiring.I totally agreed with the message the author was trying to convey, and I thought it was a good reminder. There were some plot holes and redundant battles, but overall, the story was intriguing and insightful at the same time. And definitely different.The only thing that really bothered me, and this is trivial, was the characters' diets: hot dogs, eggs, bacon, and once before going into battle, macaroni and cheese with a slab of beef. GROSS! If the enemy don't getcha, your diet will!"}, {"userName": "Dina Sleiman", "userReviewDate": "Aug 29, 2009", "userURL": "http://www.goodreads.com/user/show/2643813-dina-sleiman", "userReview": "I wish I could give this book a sixth star. Take a dash of Pilgrim’s Progress, toss in a good helping of The Matrix, and you get Arena by Karen Hancock. Talk about a book I couldn’t put down. My teenaged daughter highly recommended Arena to me, and it turned out to be one of the most fascinating and unique novels I have ever read. Sci-fi fans will go especially crazy for this book, but everyone will appreciate the finely crafted allegory of the Christian experience. Callie Hayes thinks she is signing up for a psychology experiment, but finds herself whisked away to…well, she isn’t quite sure. Is it a holographic fantasy, an alien world, or an alternate reality? All she knows for sure is that she, like everyone else lost in this strange place, is desperate to get back home safely. Along the way she will meet a host of strange creatures, incredible challenges, and bizarre mysteries. This book offers more than just adventure, however. Callie forges many deep relationships with the other victims of this experiment, and learns much about her own desires, about life, and about what is truly important. She also discovers a unique connection with a special man, but can it survive the Arena?The Arena serves as a backdrop for some of life’s most pressing questions and realities. As Callie and her friends move through different levels and phases of this unusual realm, the relationship to our own spiritual growth and development becomes clear. I particularly liked the concept of “the link,” a way to touch and communicate with “Elhanu” who served as God within the story. The armor given to those who passed through “the Gate” was quickly deactivated by fear and could only be reactivated by reaching within and finding “the link” again. This is so true in our own lives. The parallels to spiritual warfare in this book were exquisite, and clearly demonstrated the power and responsibility of the Christian believer in battling and gaining victory over the enemy. No less stunning was Hancock’s presentation of how one must first come to God and salvation and the varying struggles people go through in order to find Him. The powerful spiritual messages in this book are too many to enumerate in one review.If you read one Christian novel this year, let me recommend Arena. No matter where you are in your walk with God, you will find something within its pages that will minister to you, enlighten you, and draw you closer to Him.Review by Dina L. Sleiman"}, {"userName": "Celeste", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/11170045-celeste", "userReview": "This has to be my favorite book of all time. I have read this book several years ago and it has withstood the test of time. Brilliantly wriiten. I loved the concept of this story. Makes christian fiction fun and interesting like never before."}, {"userName": "Lora", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/3401229-lora", "userReview": "One of my favorite books, re-read it again, have already read it a couple of times. It is a very different kind of book, blending sci-fi and Christian allegory, but it also is a great adventure and quite a ride, one of those books you can't put down. A bit on the edgy side, so not for everyone, but very clear allegory. On the back of the book it is described as a modern blending of elements of the Matrix and Pilgrim's Progress, and I would add: and more! If you want something different, check it out!"}, {"userName": "Chris G", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/15732714-chris-g", "userReview": "This is my favorite book. I didn't know what to expect when I picked this one up, but two days later I still couldn't put it down for more than a few minutes. I read it years ago and I still reread it. It's got great plot, characters, pacing, and is a fabulous allegory of the Christian walk from before salvation til God takes u home. I can't say enough good things about it. It's a must read."}, {"userName": "E. Melure", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/31903159-e-melure", "userReview": "I typically have a hard time with Christian Fiction, because, to agree with a few of the reviews, that genre tends to be too \"in-your-face\" or too \"Christian-cliché.\" I happen to be someone who knows God to be much more than cute quotes and easy street, so I get slightly repulsed by those types of books because they do not accurately portray the difficulty of life -- with and without God.While granting my limited knowledge of this category, I found Arena to be an incredible example of the walk of a Christian. No two Christians have the same testimony as to how they found God, and this book introduces a lot of different angles (while focusing on Callie's story of course). Also granted, is that no book is perfect or will be able to cover all of the intricacies included in finding and following God, so of course this book can not cover them all either.Where a lot of Hancock's allegory can be seen as \"obvious\" to those comfortable in the genre and the Christian walk in general, others may be able to glean new insight from her presentation. She begins where all begin: dropped into a world unknown unsure as to what the next step is. Each character will either find their way to the \"God\" representative character, or they won't. Hancock intertwines the problems we fact today in easy to relate to situations, effectively showing how different people will react differently. Temptation, fear, anger, lust, depression, all of these (and more) topics we face today -- Christians and non-Christians alike -- are all introduced to Callie or Pierce, oftentimes with a contrasting minor character who handles a similar situation differently. Each section of the book promotes the characters to the next level of their journey (or faith, to follow the allegory). Some characters make it, some don't, which also is seen in today's world with Christianity. The characters must mature in their understanding and abilities as they fight to reach truth and return home, and it was creative and enrapturing to me how Hancock was able to convey the relevance to people today. I recommend this book to all because Christians and non-Christians alike do, and will, face the same emotional and spiritual torments these characters go through, and only our choices and reactions will determine where we go next. However, I do recommend reading it with full knowledge of the sub-novel story being one of the Christian walk. Approaching it this way may help avoid being broadsided when it pops out. It is Christian fiction after all.I read this first about 6 or so years ago and it still remains my favorite Christian fiction."}, {"userName": "Amy", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/1612382-amy", "userReview": "Callie Hayes grudgingly agrees to participate in a psychology study as moral support for a friend. However, frightened by the examiners' secrecy and evasiveness (one vanishes before her eyes), she tries to escape but finds herself cast into the Arena, a testing ground for participants of the study. Armed with only a guidebook and minimal supplies, she is soon forced to trust the enigmatic Pierce, a man who claims to have spent the past five years in the Arena. As Callie journeys toward the Gate, supposedly her ticket out, she learns more about the mysterious Benefactor conducting the test and uses her developing faith in him to find the way home. However, this path is laid with false trails, traps, and false messiahs eager to destroy Callie and the friends she makes along the way. Hancock's first novel is an allegorical blend of fantasy and sf depicting the tests a soul faces that strengthen or destroy belief in God. Hints of the post-apocalyptic world of Mad Max surface, along with the sense of climbing through the wardrobe into C.S. Lewis's allegorical Narnia. A classic in the making for the modern era, with appeal for fans of Lewis and Kathy Tyers (\"Firebird Trilogy\"), this is required for all collections."}, {"userName": "Heather G Gentle", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/1255785-heather-g-gentle", "userReview": "I absolutely loved the first 3/4 of this book. Great adventure, mysterious and interesting characters and a good visual of the alien world. The only thing I would have liked is for the ending to have a little more to it....although I did like the very end where they meet up again years later...not the most original..but still cute and hopeful.I had no idea this was \"Christian fiction\" until afterward- there was no \"religion pushing\" in this book-- just a lot of \"faith\" basis which was done in a way that didn't feel like preaching in the slightest-- it could apply to anyone, anywhere at anytime."}, {"userName": "Beth", "userReviewDate": "Oct 21, 2009", "userURL": "http://www.goodreads.com/user/show/784209-beth", "userReview": "I enjoyed this book and didn't find that it was preachy in the Christian sense, despite the fact that is is listed as inspirational fiction. I can certainly see the parallels and allegory, but I do not believe that it would be a turn off to someone who was not a deeply religious person. I thought the message transcended Christianity as a moral tale of life, asserting ourselves and the choices we make. I enjoyed the little bit of an added happy ending as well. Sucker for the guy getting the girl."}, {"userName": "Callie Hornbuckle", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/15024736-callie-hornbuckle", "userReview": "Solidly written. I was surprised halfway through to discover it was an allegory for Christianity, but she manages to walk the line (barely) and keep it from being heavy handed. Recommended if you enjoy CS Lewis’s Space Trilogy."}, {"userName": "Kibbenza", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/8861987-kibbenza", "userReview": "I'm kind of torn with this book. On the one hand, I did kind of enjoy it. The writing wasn't anything spectacular, and the story was kind of strange, but it was interesting in a way that kept me reading (although more slowly than I would with a book that really captured me).Callie, at first, is a bit of a boring character. She seemed pretty stuffy for someone that young. I can understand serious, or reserved, but she came across as way older than she was supposed to be. So, it was kind of hard to relate to her at first. I was easily interested in her journey though, once it got into the Arena world itself. Sometimes I felt she spent too much time thinking. It seems like a bad idea to get that lost in thought when the environment is as hostile as hers was! She changed a great deal throughout the book, which was fun to see.At any rate, I did get somewhat invested in the story, which got better. I really did enjoy that, though there was romance, that wasn't the whole focus of the book. It was there, but the book was full of much more than that. I think the thing that really didn't go over well with me was the God/faith allegory. It felt too forced and overly obvious, and it just... didn't really belong. It went from a sci-fi type feeling to \"this is an overt metaphor for God, have faith and all things are possible\". Which is fine, but doesn't really fit with what the story was shaping up to be. It was a strange shift, and I felt like the rest of the book focused too much, and gave too much credit to that. It kind of overshadowed what the characters were going through and accomplishing. I guess my biggest complaint aside from the overt allegory was that the book changed pace and tone so much. Things were skimmed over, which I felt took away from how awful the Arena was supposed to be. And then it went from terrible, to a luxury resort, to terrible again. That kind of back and forth was strange! So... yeah, I'm just really torn with this one.I guess all I can say is that I didn't hate it, and I don't regret reading it. Which isn't the best compliment you can give a book..."}, {"userName": "Austin Hobbs", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/21525678-austin-hobbs", "userReview": "Arena by Karen Hancock.1/5 StarsI like to start my reviews with the best parts, themes, characters or whatever I think makes the book standout. This book has already been a heavy discussion piece in my \"book club.\" However, not for the reasons a book should be. The only things about this book that I can muster in a positive aspect are the following: the message and the overall idea.Unfortunately, the execution of the idea was atrocious. The writing was bland, repetitive and overall boring. There is virtually no character development. Of the few characters that were developed, they would go through a personality change instantly, remain that way for a few pages then revert back or change all together again. There were a few phrases that were used multiple times over. Most of all, the story never meshed together. To me, it was just bad story telling."}, {"userName": "Katelin", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/6150801-katelin", "userReview": "I love this book! I have read it several times, it never gets old."}, {"userName": "Maci Dierking", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/5950386-maci-dierking", "userReview": "Hmmm. This one was thought provoking for sure. Enjoyable overall. Although it was hard to keep with, with all the different names and terms etc."}, {"userName": "Sarah", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/5283506-sarah", "userReview": "What a terrible excuse for a book. Lost meets Hunger Games meets aliens (so far so good...) meets a terribly disguised \"The Lord Jesus Christ is my personal savor, and if you don't believe, hell is in store\" morality metaphor. First of all, I should have guessed, after reading the effusive \"Gratitude\" section at the beginning. \"[Thanks] to my Lord and Savior, Jesus Christ, in whom we live and move and for all things have been created\" ... And \"to all [those] God provided before He saw fit to grant me the social validation of publication\" etc. etc. Social validation of publication? Jeeeesus... The pretentiousness! I should have known.Vapid, shallow characters, boring stretches of deliberation and moralization, and over explanation. I knew I was really in trouble when I got 20% into a potentially interesting plot, and was treated by an overlong explanation of why they were in the arena. SPOILER: The head alien, an infinitely good being, put them in there in a kind of Biblical Job - like test. Through faith, reading the \"manuel\" (which has all the answers), and connecting your mind to the \"head alien\" and following his instructions by faith alone, you can get out. This book had a kind of horrid fascination to it, which is why I finished it to the end. And a bit of self defense : I have nothing against some good Christian- metaphorical literature (I've read the Narnia series at least twice) but this book was kitch, poorly written, and cheapens the scope of the Christian god. One star, compadres."}, {"userName": "Joeschmoe", "userReviewDate": "Jan 08, 2008", "userURL": "http://www.goodreads.com/user/show/760110-joeschmoe", "userReview": "I'm not sure where to start. Though I enjoy this book from a purely sci-fi standpoint, its undertone is simply unbearable. Every time I manage to forget the fact that this book was written as a (rather shitty) allegory, something will come up that practically flaunts it. The best way to put it is your friend is telling a mildly amusing story. He means it to be humorous, but you find it interesting nonetheless. Yet every time you manage to forget how stupid the point of your friend's story is, he'll over emphasize a terrible pun, nudge you painfully in the ribs and wink profusely (and not even the good subtle winking, the kind of winking where the whole damn side of his face scrunches up and his other eye squints).Don't even get me started on the main character. Stupid and blind to the point of making me seriously wonder if she was an allegory for the mentally handicapped, whoseit (I don't even remember her name, and it was only a few weeks ago that I stopped caring about this book) embodied poorly written main characters everywhere. This woman's conceit eclipses the average galaxy in size and mass. I would rather violate myself with a rake than deal with another page of this vapid crap.And yet, the 'allegory' story is extremely interesting, enough so to brutally force me to raise my rating from an impossible negative three, to a two star rating. If the author would focus on actually writing sci-fi than writing pointless crap that's been done to death, she might actually produce a tolerable book.I suppose I'll go get that rake now."}, {"userName": "Bethany", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/4263640-bethany", "userReview": "I didn't expect to enjoy this one, but I ended up really liking it. It was sometimes hard so see past the heavy-handed, rather corny fundamentalist Christian metaphors, though. Once I finished rolling my eyes, however, I was completely sucked into the wonderfully crafted, full, lush world that she created. Like every good book I have read, I was left wanting to stay in that world a little longer."}, {"userName": "Faye", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/9905578-faye", "userReview": "I detested this book. Although I don't mind an allegorical novel (The Witch, the Lion and the Wardrobe comes to mind), I prefer them to be more subtle. This one basically took a sledgehammer to your head over and over again. Without the \"finding Jesus\" allegory, this book became just a routine fantasy novel. So, the question is: why did I waste my time finishing this?"}, {"userName": "Bill Tillman", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/3188476-bill-tillman", "userReview": "A very unique book, speculative in nature. When Meg and Callie sign up for an experiment at the Univ. of Arizona they have no idea where it will take them. They separately end up in a place called the \"Arena\", on another world and are confronted with life and death struggles in dealing with the environment."}, {"userName": "Kailey", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/41885703-kailey", "userReview": "I ABSOLUTELY LOVED THIS BOOK!! MY ABSOLUTE ALL TIME FAVOURITE BOOK!! I NEED SOMEONE TO RECOMMEND A BOOK TO ME THAT WOULD BE SIMILAR TO KARENS BOOKS!! I love the characters, the plot, the allegory and the cute little character romance!! :)"}, {"userName": "Thomas", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/25504301-thomas", "userReview": "I gave it a valiant effort - a solid 50% completion.This pretty much sums it up..."}, {"userName": "Milana", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/38647164-milana", "userReview": "Slow at the beginning, but very interesting at the end!"}, {"userName": "Sheri Swift", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/8033993-sheri-swift", "userReview": "So unusual and different ;)"}, {"userName": "Michaela Selway", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/80169322-michaela-selway", "userReview": "What a book. I literally have no other words for it. I have read this book about 5 times and never fail to see something new.I'm just writing a brief overview as I HATE reading reviews and seeing accidental spoilers :D hope it helps to give a crazy short overview :)So it opens with Callie and her best friend, Meg, signing up for some experiment that is supposed to change their lives. The only problem is that Callie is SUPER dubious because this is not the first experiment Meg has dragged her too, and this one is solely because Meg is interested in the guy. How many times have we all been in a situation like this?? In this situation I didn't know who I related too actually. Callie, the ever-questioning critic, or Meg, the one who blindly follows. I guess both. Whoops :PLong story short, Callie doesn't end up listening to the instructions of the game as she ends up being freaked out by some weird dude sitting in reception. Now that sounds like me!! She gets thrown into this 'other' world and for the first however long, instead of taking in her surroundings and figuring out where she is, she tries to figure out what happened in a literal sense. Did they teleport her? Is she drugged? We can already see from the get-go that our gal is taking the path of MOST resistance.As she begins to make her way through this strange world with strange creatures, Callie takes on a motto that she has carried for most of her life: you can't trust anyone. Though this may not seem apparent at the beginning, Callie has had serious family problems and whether she tries to or not, she can't trust anyone for fear that they will leave her, disappoint her or hurt her. Not only this but she is also plagued with her childhood fear that never left her.As always, the mighty man - or in this case super cynical grumpy man - enters the scene and tries to at least warn Callie about the dangers she is about to face. Of course, knowing what we now know about her, Callie doesn't listen and ends up putting herself in harms way, only to be saved by this mysterious man - Pierce. This is where the God figure enters in. Elhanu. I cannot even try to pronounce this name out loud as everyone I know says it differently. But he comes to be a character that you begin to love and trust, even though you yourself aren't the one living out this crazy existence. Elhanu provides a guide, and a connection to himself. He says that he will go forth with these people to protect them, that if they only trust in him, he will show them the way.Until this point in the book I had not seen any Christian references. And I think that is the beauty of Karen's writing. It is so captivating, it draws you in with the disappointment, the heartbreak, the tension and the joy when they succeed at a challenge. And it shows you God, reveals Him to you in a new way that I had never encountered before. In this book, God is portrayed as a friend that the group meet along the way and it isn't until later that they find out who Elhanu was all along. He was a companion, a brother, a father, and a guide. Someone who knew what you were thinking but were too afraid to admit. Who knew the depths of your heart and still loved you. He gave soft encouragement where needed, but knew when to just sit beside you and comfort you.The rest of this book centres around this idea. As Pierce and Callie face their fears, they learn to turn it over to God.If you want to go read the rest of my review click the following link:https://michaelajaneruth.wixsite.com/..."}, {"userName": "Amy", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/37314705-amy", "userReview": "Hancock has a way with world-building, and she manages in this book to craft a thoroughly alien, yet eerily familiar world with a likable and believable main character. The story is all about Callie growing into a strong, grounded woman. It's primarily a spiritual journey, but unlike any allegory I've ever read, and there's a lot of action (no preaching). The romance, while present, doesn't detract from the adventure (although it does make the climax gut-wrenching). It's grittier than Hancock's series, Legends of the Guardian King, but ultimately hopeful and thought-provoking.I admit, I only read this book because I loved Legends of the Guardian King. I wasn't expecting to like it, as this is definitely more sci-if than fantasy. The first couple chapters were interesting, but not terribly gripping, and I only kept reading because I was at the beach (literally thirty feet from the ocean) and didn't have any other fiction with me (and didn't feel like trekking back to the house to get something else). But it just. Kept. Building. Before I knew it, I was so deep into it I had gone back to the house and hidden in my room so I could read uninterrupted. What I loved most was how the story continued to resonate with me even a year after reading it."}, {"userName": "Tedi", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/47676300-tedi", "userReview": "Typically, I don't get into books like this. I like staying in this world. I don't like traipsing off into different ones. But oh boy. What a journey!I gave this 4 stars for knocking my socks off. I was very unprepared for the adventure ahead. I didn't like Callie for about 3/4 of the book. She was just so... I don't know. But to keep this positive, what I did appreciate about her was her good sense to leave the first group and go back, and her good sense to like Pierce.This book was very allegorical and very interesting. The author made you get caught up in the Arena and the characters that makes it very hard to leave that world. I would've read this all in one sitting if I could've but life has some demands on my time (schoolwork and such), and unfortunately I need sleep to function. Life is rough for a bookworm.Anyway, it was a good book and I just might pick it up later to re-read!"}, {"userName": "Anna", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/1390576-anna", "userReview": "I might be leaning more towards 4 stars- I'm still reeling from the allegory and how closely it describes the views of Christianity. It was such an interesting way of telling the story and using symbols to help guide the characters. It really made me think and reflect on my life and my path. Pretty interesting..."}, {"userName": "Christine Jeffrey", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/68914911-christine-jeffrey", "userReview": "Love this book. I've read it several times. I love the parallel between that world & ours. It reminds me to make sure my spiritual armour is switched on at all times. Looking forward to reading it again."}, {"userName": "Sabrina Gese", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/19736781-sabrina-gese", "userReview": "Rich Christian allegory... one of my all time favorite reads. It accurately characterizes the process of conversion and sanctification. In so doing, it gives the reader a clearer understanding of what the Christian lifestyle entails, i.e. it's challenges and rewards."}, {"userName": "Jennifer", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/8450412-jennifer", "userReview": "Such a disappointment.. the first half of the book was wonderful.. the second half was sappy and preachy...."}], "description": "Callie Hayes is living a life of fear and disillusionment when she volunteers for a psychology experiment that promises to turn her life around. As her orientation proceeds, Callie becomes frightened by the secrecy and evasion she encounters. When she demands to be released from the program, she is suddenly dropped into a terrifying alien world and into a perilous battle between good and evil. With limited resources and only a few cryptic words to guide her, Callie embarks on a life-changing journey. Will she decipher the plans the Benefactor has established for her escape, or will she succumb to the deception of the Arena?", "title": "Arena", "url": "http://www.goodreads.com/book/show/142023.Arena", "average": 4.14, "cover": "https://images.gr-assets.com/books/1348514384l/142023.jpg", "reviews": 244, "authors": [{"url": "https://www.goodreads.com/author/show/70853.Karen_Hancock", "name": "Karen Hancock"}], "type": ["Fantasy", "Christian Fiction", "Science Fiction", "Christian", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/142023.Arena", "http://www.goodreads.com/book/show/30372202-arena", "http://www.goodreads.com/book/show/545761.The_Light_of_Eidon", "http://www.goodreads.com/book/show/736392.Shadow_Over_Kiriath", "http://www.goodreads.com/book/show/736391.The_Shadow_Within", "http://www.goodreads.com/book/show/122947.Return_of_the_Guardian_King", "http://www.goodreads.com/book/show/4532622-the-enclave", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}