{"ratings": 7816, "userreviews": [{"userName": "Smilingplatypus", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/3916153-smilingplatypus", "userReview": "This was a fascinating concept -- a successful, independent woman gets fed up with her failed romances and signs up for an arranged marriage service. It turns out to be light and predictable, with fairly shallow characters (in terms of development, and only sometimes in terms of personality), a bland romance, and an obvious \"plot twist\" towards the end. It wasn't bad, don't get me wrong: but it was a bit like eating \"empty calories\" in that it's rather fun while you're reading it, but afterwards you feel kind of guilty and you want to pick up something with more substance. Overall it was a decent summer read. Enjoyable, but fluffy and forgettable.That being said, I had better put all my cards on the table and admit that I very rarely read romances because they aren't really my cup of tea. (Other than Jane Austen, but I make an exception for her and her snark.) I will give this book credit because it didn't make me cringe and it stayed away from being overly sappy. So it is more than likely that people who are more in tune with the genre would love this book."}, {"userName": "Colleen", "userReviewDate": "Jul 16, 2010", "userURL": "http://www.goodreads.com/user/show/2957427-colleen", "userReview": "If I could give it a higher star rating, I would. And if it was published now everyone I know would be getting a copy for Christmas. Thank you, Catherine, for helping me realize that when written well, I love books with romance in them. Here's my full review, originally posted at http://lavenderlines.wordpress.comSo yesterday Catherine McKenzie's first book, Spin, made it on my list of favorite reads for 2010. I know we're only three days into 2011 but I can tell you that Arranged will make it on my best of 2011 list. I loved it that much. I stayed up until 3 am to finished it and immediately wanted to reread it again. Arranged may seem on the surface like a light \"chick lit\" read, but underneath it's about more serious issues like loneliness, stability and trust. And it's a book that I know will stick with me for a long time.Anne Blythe isn't always the most likable character in the world. She has a certain \"type\" of guy she's into and she's, well, kinda shallow when it comes to looks. For the first part of the book I spent a lot of time wanting to smack her upside the head. I mean, quit complaining that you can't find a decent guy when you only go for men who have movie star looks. Honestly. But as the book went on, and McKenzie let me slowly see deeper into Anne's psyche I felt a connection to the character that I rarely feel when reading. I think a lot of women are going to see aspects of themselves in Anne. I know I did.Okay, here's a bit of background on moi. You need to know it so that you can understand how fully and completely connected I felt with Anne by the time I got about half way through the book, and why I became so entrenched in her story and her happiness. The hubs and I met in a bit of an unconventional way: I answered his personal online ad . I was sick and tired of the dating game and wanted to meet someone I knew I'd be compatible with. I also wanted to avoid that awkward does-he-like-me-like-me stage when you first meet someone of the opposite sex. Since I was answering a personal ad, all I had to do was meet the guy, see if we clicked, and if we didn't, so be it. Sure it's not as serious of a commitment as an arranged marriage, but I could still identify with everything Anne was feeling pre and post wedding. For me the connection was at times painful, and some of the things Anne goes through broke my heart so bad that I had to set the book down for a bit and gather myself.As an Island girl, I got a kick out of all the Anne of Green Gables reference. I mean, there's no one on PEI who doesn't have some kind of a connection to Anne. Most of us have the seen the musical. And, if like me, you've ever worked as an usher at The Confederation Center of the Arts, then you've seen the musical enough times to know it off by heart 15 years later.The author's writing was once again great. McKenzie has a straight-forward writing style that lends itself perfectly to the story. She has the amazing ability to handle some tough issues in a light way without being condescending, rude or awkward about it. In her books it seems effortless but I know that it must be hard to maintain that balance.Arranged was way more romancy than Spin and -gasp- there may even be a bit of a sex scene it in, something that would normally turn the extremely prudish me off from finishing the book. But I felt such a strong connection to Anne and was so tied up in the plot and the writing was so great that I didn't give a hoot. I loved the book despite the fact that it had elements in it that I normally don't love. And that, my friends, is the sign of excellent writing, an amazing plot and stand out characters. All of which Arranged has."}, {"userName": "BookLover", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/12285159-booklover", "userReview": "I love Catherine McKenzie’s writing. This book was one of my favourite reads of 2013. I was initially drawn to this book based on the book being about an arranged marriage. I found the idea of arranged marriage in today’s age a fascinating topic and I was interested to see how it would be handled in this book.Anne Blythe, the main character was super likeable. I became attached to her from the beginning of the book. Her mother’s obsession to Anne of Green Gables and how it played out in both her life and her brother’s cracked me up.\nYes, that’s right. My mother not only named me Anne Shirley Blythe, she named my older brother Gilbert, after Anne of Green Gables’ love interest. It’s a miracle that I haven’t needed massive amounts of therapy. Yet.\nI remember being anxious for Anne, hoping her journey into an arranged marriage wouldn’t be a disaster. Then Jack entered the story. I loved Jack. What I really liked about him was that he wasn’t written as this perfect character. He was flawed, just like everyone else. From that moment on, I became anxious for the two of them, as a couple, hoping things would work out for them.Anne’s eccentric parents and their thorough grilling of Jack when he first met them was so funny.\n“You okay to drive?” I ask.Jack gives me a look. “Better than you.”I stand up straighter. “Hey, it was the only way I could get through the evening.”“And I thought you drank a lot of margaritas in Mexico.”“Bastard.”“I think your father established tonight that I’m definitely not a bastard.”\nThis book was funny, heartwarming and gut wrenching. To say I was shocked at the turn in plot at around the 75% mark is an understatement. I was gobsmacked. I loved how the story played out. I just plain loved Anne and Jack!  Great read!"}, {"userName": "Nancy", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/3122452-nancy", "userReview": "For some reason Catherine McKenzie needs to be my best friend. Supposing she is vaguely like the protagonists she writes, I am quite certain she and I would have a wonderful time together. I'm pretty sure I'd have to keep running to the bathroom because she makes me laugh so hard. Because I get it. I really do. My copy of Arranged is an ARC so I am not allowed to quote it. But if I could, I might just quote a little ditty from when Anne is feeling sorry for herself and finds herself drinking too much at her brother's house and singing a Gloria Gaynor song inside her head for which she knows most of the words although not all (da-dum, yeah, that's right, and then some other part, and then the good part, so go, go, go, walk through my door, and don't turn around, no, I won't welcome you here anymore... I'm going to survive!)\"Anne, what are you doing?\"I stop mid-twirl. \"Dancing to a song in my head.\"Gil takes the glass from my hand. \"Definitely enough wine for you.\"What McKenzie artistically accomplishes is a protagonist I know and dialogue that quickly summarizes relationships. Gil is Anne's older brother. He is diabolical. But he loves his sister. Jack is Anne's arranged husband. He is Jack. You get Jack. Sarah is Anne's best friend. She's a lawyer who will fight to the death if she thinks Anne is in danger. It's clever dialogue with witty comebacks.The twist - I didn't see it coming. I loved it.Expect a lot of drinking. Expect a lot of swearing. Expect a lot of laughing."}, {"userName": "Leona", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/7020824-leona", "userReview": "[ HEA because Anne was too much of a wimp to kick him to the curb.  (hide spoiler)]"}, {"userName": "Melissa Landers", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/8489275-melissa-landers", "userReview": "This was so delicious that I started and finished it in the same day! I found the concept of modern-day arranged marriage fascinating, especially the way it was facilitated by the matchmakers, Blythe & Co. This is a must read for anyone who enjoys shows like \"Married at First Sight.\""}, {"userName": "Hilda", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/2708273-hilda", "userReview": "Arranged marriage was the norm for centuries. Romantic love is a modern notion.When Anne Blythe learns that his long time boyfriend, Stuart, is cheating on her, she ends their relationship and decides to find a new man. This time, she vows to herself not to fall for dark-haired and blue-eyed man anymore. Anne has a type, yes, and all of her ex-boyfriends have that similar look. But it’s hard to be alone, especially when your ex-boyfriend is already married, your brother is expecting the fourth child, and your best friend is planning her wedding. Anne wants to have her own family, and this time, she’s willing to try anything. That’s when Blythe & Company starts to look like a great idea.Blythe & Company is an arranged marriage service with ninety-five percent success rate. Impressive, right? Jack seems like a great match. He’s handsome, a bit snarky in a good way, and a brilliant writer. Will this be a happily-ever-after that Anne dreams of?In my humble opinion, there are two reasons why you fall in love with a book. One, because that book is made of epicness, awesomeness, and oh-gosh-so-different-so-original-ness. Second, because you can associate yourself with the main character and you see yourself in him/her. In Arranged, the second reason applies.You know, there are moments when you read a book and you think, ‘Wait. Someone just wrote my whole story in pages. This. Story of my life.” Well, those moments happened to me a handful times. Sometimes it creeps me how similar I am with the main character. Sometimes, just like this situation, it enlightens my view.Anne is a hopeless romantic. After all, she’s named after Anne from Anne of Green Gables. She believes that romance should be like a fairytale. You meet your amazing knight-in-the-shining-armor, and you end up living your happily-ever-after. Me, being a romantic, believes in the same thing. Marriage is supposed to be the moment you unite with your long-awaited lover and run to your amazing future together, right? (Preferably with sunset in the background.)It was impossible to part myself from Arranged when I read it. I understand Anne’s feeling way too well that sometimes it scared me. I know very well that it may be dangerous to get absorbed into the story too much, but sometimes… you just can’t help yourself. I felt for Anne, and prayed for her happiness throughout the story. When I finished the book, I still brought it along in my bag just because I didn’t want to part with it too soon. That was the first time I understand the phrase, ‘You’ve read a good book when you feel like losing a friend in the end.’Er, sorry. This is such a messy review. To summarize, Arranged is a wonderful story that would appeal to romantic readers. The characters are lively and the stories flow too well you can’t stop reading. It’s romantic, funny, and sweet. You should read it and when you’re done, you can come to me so we can have a good chat about the ending. Don’t worry, it’s a good ending… I think. ;)An arranged marriage is not going to happen. Because it costs ten grand. Because it’s a crazy idea. Because I’m not going to marry a complete stranger. Because marriage is about love.Isn’t it?"}, {"userName": "Jennifer", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "[The only thing I would have liked to see is a little bit more development in regards to Anne and Jack's histories, their relationship hangups, and any growth they likely experienced during their time apart. (hide spoiler)]"}, {"userName": "Tammy Walton Grant", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/3047961-tammy-walton-grant", "userReview": "So my friend Buggy (*waves*) was reading a really cool-sounding book called Spin a while ago. I added it to my mountainous TBR, and when this book, by the same author, came across my radar I snagged it.I am so glad I did - this was sooooo good. I loved it, think everyone should read it, and here's a little bit about it: Anne has a great life, except for the love part of it. She just wants what everyone else seems to have. After breaking up with a cheating boyfriend and her best friend gets engaged, she decides enough is enough. She contacts what she thinks is a dating service - a big enough step, you'd think. Except that the dating service is really a marriage arranging outfit, and you can't really take any step larger than into matrimony.I can't even tell you what happens next without giving huge spoilers away, and as much as I hate to use the word \"twist\", there's a biggie.It's funny, it's poignant and there's a little bit of all of us in Anne. Her story is unique, and once we get to know her, we cheer for her all the way through.Thanks for the heads up on this author, Buggy! 5 stars."}, {"userName": "Therese Walsh", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/2037871-therese-walsh", "userReview": "Catherine McKenzie’s Arranged explores what happens when what you think you want collides with what you really need. It’s a rare book: smart, funny, honest, and absorbing. I truly enjoyed it."}, {"userName": "Sarah", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/126674-sarah", "userReview": "I ordered this book from the library because I had heard the author promoting it on The Next Chapter (CBC Radio) and I was interested in the parallels (romantic looks vs solid friendship) with Anne of Green Gables. I was disappointed because I didn't find the protagonist or her friends very interesting, and the connections to Anne Shirley were all superficial, overt, and beaten to death. I actually really disliked Anne Blythe at first and then somehow became resigned to thinking that she was merely dull. There is too much tedious dialogue where the characters bring up a subject and then deflect or deny, even in the supposed therapy sessions. The paragraph or so from Anne Blythe's published novel seemed like a much better-written and more entertaining book than this one.I feel as though I was led to believe that there was some kind of twist ending. I normally hate being spoiled even to that extent because if I am on the lookout for the twist that takes away from my enjoyment. When I was getting fed up with the tedium I said to myself \"God, I hope that Jack is just using Anne for copy\" -- and then I got to the part where Anne discovers that Jack had in fact written a book about the experience and was basically undercover collecting material for the book, so she leaves him. Even then I hoped that the twist was going to be that she wasn't going to take him back (not because I disliked Jack more than any other character; just because marrying by arrangement and then with minimal drama deciding to stay married is actually not a twist), but I guess the book betrayal was the twist. I wonder if Jack's book would have been a better read?"}, {"userName": "Didi", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/6082482-didi", "userReview": "I read this a while back and remember liking it. It had a very old fashioned feel to it and was quite sweet. It was also interesting to note the arranged marriage while outdated in North American society was the benchmark for coupling throughout history."}, {"userName": "Candie", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/6910187-candie", "userReview": "Wow. I don’t even know where to begin. This is the first book I read by Catherine McKenzie and I already know that it will not be my last. The entire time I was reading “Arranged,” a few of my friends kept asking me how it was and I felt like I always had the same response, “interesting.” I didn’t know how to properly put into words how I felt about this book, but now that I’ve completed it, I feel like I have to at the very least try… especially since I rated it as “amazing.”The simple (or not so simple) question that is asked throughout this book is – what type of life do you want? And what are you willing to do to get it? Anne, the extremely likeable and relatable main character, is a 33-year-old woman who has just broken up with another boyfriend and while trying to move on from her latest heartbreak is faced with the fact that she once again lost another chance at “forever.” However, as fate would have it – she stumbles upon an agency that “arranges” marriages amongst those who are, sort of, “done” with heartbreak and ready to build a lasting relationship based on friendship – not love.The most interesting aspect of this book is the initial question that it raises – would you ever consider an arranged marriage? Not based on religion. Not based on the values of your loved ones or the necessity to procreate as soon as possible, but simply based on wanting to build a secure future with someone that you are supposedly compatible with. As I was reading the book, it seemed completely logical and the entire idea (and even process) made sense until reality sinks in.As an author, Catherine McKenzie is truly amazing at building strong characters with unique and clear voices. In fact, they were so clear that the entire time, I was imagining what a potential screenplay for this book could look like. Not surprisingly, I loved the character of Anne. I’m sure being 33 and single myself didn’t hurt the cause. However, all of the characters with their flaws and all were extremely relatable. In particular, I was very impressed with McKenzie’s ability to write the character of Jack with such a distinctive voice from Anne’s as well as the other male characters in the book. Furthermore, I found it somewhat impressive that I wanted to know a little bit more about each character and I actually liked and felt invested in every single one, even the peripheral ones – from Anne’s brother to her best friend. There wasn’t any part of the book where I felt the need to skim until I got to the “good” parts which seems to be saying something.All in all, I would highly recommend this book as a light and quick read that will make you pause and think as well as genuinely feel. As a reader, I felt Anne’s nervousness, excitement, happiness, heartbreak and pain. This was such a great read and now I’m sad that it’s over. What are the chances for a sequel?"}, {"userName": "Rachel", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/1099875-rachel", "userReview": "I loved this book. Fun, well written above the rim chick lit with stellar dialog. The premise could've been problematic -- an arranged marriage -- but McKenzie brings it all together. Good read. Fun, entertaining with a heart connect."}, {"userName": "Fabi", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/33956197-fabi", "userReview": "Gostei muito deste Livro. Vou querer ler mais livros da autora!"}, {"userName": "Stacie Vaughan", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/4778983-stacie-vaughan", "userReview": "I became a fan of Catherine McKenzie after reading her debut novel, Spin and was excited to dive into her newest book, Arranged. The book follows the main character, Anne Blythe, as she leaves another failed relationship and feels down in the dumps because she is alone. All her friends are either married or are getting married and she is concerned that she won’t ever met the right guy. As she is walking on the street feeling self-pity, she finds a business card for something called Blythe & Company which she discovers is an Arranged Marriage service! She ends up giving them a call and making an appointment and that’s when all the fun begins!Anne does all the testing required by Blythe & Company and pays a hefty fee for their services. When they find a match for her, she goes to Mexico to meet her new husband and tie the knot. She clicks with Jack and things seem to be going really good for her and she is happy. Of course, the story does end there and the author threw a twist into the story when Anne discovers a big secret about her new husband and Blythe & Company. It’s a big shocker so I don’t want to ruin it for you and I was completely hooked and had to find out what was going to happen.I really liked Anne as a character and thought it was neat how her mother named her after Anne of the Anne of Green Gables books by Lucy Maud Montgomery (These are Canadian books based on a spunky young girl named Anne who lives with her aunt and uncle in PEI). I enjoyed all the references to Anne of Green Gables and how the character from Arranged even physically resembled Anne with her trademark red hair.The book made me laugh especially when Anne was down in Mexico going to meet her husband and she met some of the other clients of Blythe & Company. Margaret was a real nut and her choice of clothes put a smile on my face!I wasn’t too crazy for Jack, Anne’s match and new husband. I am not even sure if I can pinpoint exactly why I didn’t like him either. Maybe it was his personality or I sensed that he wasn’t being entirely honest with Anne? In any case, I didn’t like him and wasn’t really feeling the “connection” between him and Anne. However, it could be that the whole arranged marriage idea is completely foreign to me and I just don’t really understand how a person could marry someone they never even met.My favourite parts were learning about Blythe & Company and how the matchmaking works. I found it fascinating that they could do all these detailed tests and find the perfect match for their clients. The best part was at the end when Anne makes her last trip to Blythe & Company with a few choice words. I was rooting for her all the way.I definitely recommend you give this book a read. It was both fun and entertaining and worth picking up!"}, {"userName": "Dionna Johnson", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/10481128-dionna-johnson", "userReview": "This book started out wonderful!!! Couldn't put it down...somewhere in the middle it started to slow down and was kinda boring. But the end was absolutely horrible and I dislike how the book ended!!!"}, {"userName": "Michelle_Mck", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/5478355-michelle-mck", "userReview": "Originally posted on my blog here: https://missmichellemck.blogspot.com....Arranged has been sitting on my TBR since 2013, immediately the blurb of the book had appealed to me but then it got lost in the too many books on the TBR shelf and I forgot about it. Fast forward three years and I was looking for a books to read that had been on my TBR for ever and this one of course came up. Luckily a month or so back this book was on discount on the Kindle store so the stars aligned and the book and me were meant for a hot date.The reason originally the book appealed to me in part was because of the name of our main character, Anne Blythe!!! Hello Anne of Green Gables.... The blurb for the book in brief is; Anne has a good job, good friends and hopefully a book deal. Sadly she keeps choosing carbon copy men who are no good for her, she likes the lean, black hair, blue eye sort of man candy... Her best friend gets engaged and Anne thinks why isn't this happening for me? She finds a card in the street and next thing you know she is signing herself up for an arranged marriage! BOOM....The idea really appealed to me, a girl who works for me just married a man who was \"introduced to her\" by a matching service as part of her church and he comes from the same village as her family. They spent a year getting to know each other before they were married, that made me really curious about the idea and this book gives some insight.The first 50% of the book is focussed on the process and finally meeting of Jack and Anne. I liked Jack straight away, Anne I was on the fence with for some of the book but did love her especially in the final third of the book. The book is written really well, it got some tears out of me both happy and sad which is always a good sign... I would have liked a bit more time spent with some of the other characters, especially her brother Gilbert and his family and even her parents to get more of an understanding of the tension between her and her Mum, other than she is obsessed with Anne of Green Gables.I don't want to say more about the plot as I don't want to give anything away, it was really enjoyable, I knew something big was coming and the plot twist was interesting and enjoyable to see play out. The story felt resolved at the end which I love, I don't like what if's. Reading this makes me certain I will pick up more work by Catherine McKenzie..... The book personally gave me a few things to think about on my attitude/perspective toward dating and finding a partner so I managed to get more than I bargained for out of the book.A great read, 5 stars for me, I loved it!"}, {"userName": "Virginia Campbell", "userReviewDate": "Mar 31, 2012", "userURL": "http://www.goodreads.com/user/show/2333268-virginia-campbell", "userReview": "Everyone has their own idea of what \"Happily Ever After\" means, and what it means for themselves may differ from what they think it means for others. Arranged marriages are well documented throughout history, with women often having little choice in their matrimonial destinies. Matchmakers have been \"hired\" for many different reasons, offering a practiced brand of \"love for money\". Mail-order brides were the original \"personal ads\" and the forerunners to online dating. In this day and age, what's a woman to do? \"Arranged\", by Catherine McKenzie, tells the story of one modern woman's journey through the minefield of dating, love, and marriage. Anne Blythe has a lot going for her: work, friends, and a potential book-deal for her first novel. However, the heart always yearns for more, and what Anne lacks is the happy love life that she sees being enjoyed by those around her, including her best friend, Sarah. By chance, Anne finds a business card for what she thinks is a dating service called \"Blythe & Company\". Seeing the name as a sign from Divine Providence, Anne gathers her nerve and contacts the company, only to discover that they are not a dating service, but actually marriage arrangers. After taking time to get used to the idea, and pondering the success rate of Blythe & Company, Anne signs on to find her true mate. What she finds is so much more than she and the reader expect, and that is what makes this a very enjoyable read. Many women will see much of themselves in Anne, her hopes, and her life experiences. The humorous and revealing look at women and men, and love, sex, marriage, and life as we know it, is spot on. The course of love and happiness will not be smooth sailing for Anne. Neither the man she meets and marries, Jack, nor the marriage arrangers, Blythe & Company, are really what she first thought them to be. Has Anne made another misstep of the heart, this time one with serious emotional consequences, or will the hand of fate truly be a winning hand? Catherine McKenzie has created a character to root for, and touches on the hope that all of us have for our own \"HEA\". \"Arranged\" once again reminds us that matters of the heart often take us on unexpected journeys with outcomes that far exceed what we could ever have imagined. Review Copy Gratis Amazon Vine"}, {"userName": "Kristin", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/7567047-kristin", "userReview": "I love it when I stumble on a book that I was not expecting and it then turns out to be exactly what I need. Such was my introduction to the beautifully simple writing style of Catherine McKenzie through her second book Arranged.I came across Arranged while searching through the 'Deals' section on my Nook. I will confess it was the cover that caught my eye initially. Then I read the overview and thought to myself, \"hmm, this is different. I need something different. My book rut is quickly becoming a book pothole. \" After reading over some reviews that explained how McKenzie wove in a correlation to the classic serial Anne of Green Gables, I was sold (my sister-in-law and my niece are HUGE Anne fans.)What I didn't expect was how absorbed I would be after only the first few pages and even more that it would continue to keep me entertained all the way to the end. Arranged was first and foremost a strong character-driven self discovery novel. It had a handful of life themes that really wrapped up Anne's journey in a heart-felt and realistic manner. 'Forgiveness', 'making your own way' and 'love requires hard work' are the most prominent lessons Anne navigates through her relationship with Jack and the trials of their arranged marriage. I really can't say enough good things about McKenzie's writing style. It flows so easily. The dialogue is crisp and the settings transport you seamlessly. My mind did not have to work to understand the characters or the plot even though both were complex and three-dimensional. It just clicked. A writer that can do that is one to add to your favorites list. Review posted on my Bookshelf Blog"}, {"userName": "Kelly Hager", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/1436215-kelly-hager", "userReview": "After her latest relationship ends, Anne Blythe* is unsure of what to do. She wants to get married and have kids, but she keeps picking the wrong guys. She finds a business card for what she thinks is a dating service. When she finally decides to give it a try, she learns it's a company that actually creates arranged marriages.Even so, she eventually decides to go for it and when she meets Jack, there is an instant connection. But can there be a happy ending when you marry a stranger?I don't know that I would have picked this book for review if I hadn't already read and loved her earlier book, Spin. I don't read the literary equivalent of romantic comedies very often. But I DID love Spin and I was pretty sure that Catherine McKenzie would pull this off, too. (Spoiler: she did.)Yes, this book is fluffy and sounds like a really bad Katherine Heigl movie. But it's incredibly funny and smart and Anne is a wonderful narrator.And Anne is fantastic. Yes, she rushes into things without considering potential consequences, but she's also a wonderful person---good at her job, fiercely loyal to her friends and someone who loves completely. So while she's got flaws, she's also more than the sum total of those flaws.The love story between Jack and Anne is rushed (and unconventional, to say the least) but it also feels genuine. And that is what I love about Catherine McKenzie's books. The synopses sound like other books (or movies) but when I read them, they are so realistic and, yes, genuine.Highly recommended. I cannot wait for her next book.* = not a coincidence. Her full name is Anne Shirley Blythe."}, {"userName": "Maria João", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/1145990-maria-jo-o", "userReview": "O quanto eu adorei este livro. Nunca tendo lido nada dela, foi uma surpresa maravilhosa e já mandei vir um anterior.Primeiro a capa, deliciosa, completamente adequada. Depois a tradução, andamos a ficar mal habituadas com esta editora que prima e muito pela qualidade.Quanto à trama em si, temos uma série de coincidências que levam a protagonista a desistir do amor e deixar que escolham por ela. e ao contrário do que se possa pensar corre muito bem até que... e aqui é que tudo se torna engraçado.Não quero estragar o momento contando pormenores mas façam um favor a vocês próprios e leiam que não se irão arrepender."}, {"userName": "Say", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/3193958-say", "userReview": "Well, another first take on an author and guess what? I LOVED IT....AGAIN!!! Yes, at first I find Anne irritating with all the ranting of wanting to get married but other than that I loved everything about it, which made me give it 5 stars. And the reason for Jack getting into an arranged marriage? IT NEVER EVEN CROSSED MY MIND!!! You have to read it to know what I mean. Gonna check on this author again, definitely!!!"}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "Since I'm in a crappy mood this book was a perfect distraction. It's been so long since I properly sat down and read a book. For the past couple of months I can't even force myself to read the books I waited for months/years but Catherine McKenzie managed to get me out of my funk."}, {"userName": "Ana Fernandes", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/37833813-ana-fernandes", "userReview": "Vale a pena ler! Ao início não estava a achar nada de especial, mas com o passar das páginas a leitura foi-me envolvendo e a curiosidade aumentando. Gostei bastante. Uma escrita simples, mas cativante."}, {"userName": "Catherine McKenzie", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/2796203-catherine-mckenzie", "userReview": "UK version of Arranged ... coming February 1, 2015!"}, {"userName": "Myrna", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/8789819-myrna", "userReview": "Great chick lit book! Unique plot, entertaining, and fast read."}, {"userName": "Anjana", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/5741554-anjana", "userReview": "I should probably begin with telling you that I adore Catherine's writing. I read her book Spin last year and if you've read my review, you'd know how much I loved it. Chick lits are usually predictable, they have a standard plot that involves something funny, some romance and a lovable heroine but just as with Catherine's previous novel Spin, Arranged is anything but predictable. It has all the best elements of chick lit combined with a wonderful, relatable and unique love story. Anne Blythe is tired of dating. She's sick of going through one relationship after another hoping it would work out and that she might've found 'the one'. She's ready to settle down but after the end of her latest relationship, she realized she was nowhere closer to 'settling down' than when she was 20. However, call it fate or destiny, one day she comes across a business card that promises her the life she had dreamed of. I'm from India and arranged marriages are pretty common here. Well, as common as something that's advertised in the papers. I understand that it's awkward, getting married to someone you don't really know and it's probably not for me but I also know that it could be and is pretty amazing for some people, although most of us don't see that. Arranged is a beautiful novel about friendship turning into love. Anne's a protagonist that a lot of women can relate to - she's successful, has great friends, a loving family and believes in love. Sure, it's a little crazy that she has decided to go for an arranged marriage but after so many failed relationships, it's understandable. Besides, Jack and Anne hit it off right from the beginning and it's pretty awesome watching them fall in love. There's nothing sudden, abrupt or awkward about their relationship/feelings as we literally see them develop through the novel. As for Jack, well, he's a guy and he's flawed but Anne loves him anyway. I couldn't have put it any better than the author - it all comes down to what kind of life you want - and Anne knows what she wants. McKenzie's writing is to-the-point and enjoyable. I think she's the only author I know who manages to tackle serious topics while keeping the novel light, funny, romantic and entertaining. God, I was in tears by the end of the book - happy, sappy tears. I highly recommend this to anyone who enjoys love stories, chick lit or any kind of women's fiction really."}, {"userName": "Terri Wino", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/28305082-terri-wino", "userReview": "Catherine McKenzie gives good \"Chick Lit!!\" This is the second book I've read by her -- Forgotten being the first -- and I thoroughly enjoyed both!In part 1 of the book we meet Anne, a woman frustrated with failed relationships who, on a whim, decides to visit a dating service. However, she is shocked to discover that it is actually an arranged marriage service. Of course, she decides to go through with it...that's the point of the book after all.Part 2 of the book is Anne meeting and getting to know her husband-to-be. Jack is so not the type, physically or personality-wise, that is her past pattern. I love their struggle to figure out what the heck they're thinking, to actually do this thing. Basically, marry a complete stranger that some agency is telling you you're a good match with.Then comes part 3 of the book, which threw me for a loop because I honestly didn't see it coming. But it grabbed my interest and sucked me back in just when I was thinking, \"Well, we know how the rest of this formula is going to play out.\"Are there things that happen in this book that are way too convenient (like getting the money for the large fee the agency charges for their service)? Yep. Did it take away from the story for me? Nope!Do you KNOW how this story is going to eventually end? Of course. BUT I loved that story that brought me to the end!I really liked both Anne and Jack. I was happy when they were happy. I was angry and upset when they were.Catherine McKenzie has a way of making you feel as if you're a part of her characters. She draws you into their world, and it's a fun place to be for the duration of their story. I definitely will be reading her other books. If you enjoy romance that's not the typical girl-meets-guy, cookie-cutter formula, and like quirky characters, you should read her books too!"}, {"userName": "Liza Wiemer", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/3152001-liza-wiemer", "userReview": "An unconventional love story - and I LOVED it!ARRANGED had been on my to read list for over two years. And I am soooooooo glad I finally read it.My heart still aches from it. Maybe it's the hopeless romantic in me, but I really fell in love with Jack and Anne, who met through an arranged marriage service. Things between them seem really great - and the truth is that they ARE great together. But he screws up . . . and what he loses is the best thing in his life. Looking back, I don't think he was \"acting.\" From the moment he said \"I do\" I felt the authenticity of his words, and Anne's. Even though she was scared and he seemed more \"solid.\" It just seemed right. And I never lost that feeling, even after the \"revelations.\" Which, as a writer, means to me that Catherine McKenzie did an awesome job bringing this story to life. If I could have anything - like a wish - I'd love for Catherine to write a novella letting fans know what happened to Jack and Anne after. A part of me still feels unsettled. I want more. I want a novella. Maybe I'll get my wish?I will definitely be reading more books by Catherine McKenzie! Loved it!"}], "description": "Anne Blythe has a great life: a good job, good friends, and a potential book deal for her first novel. When it comes to finding someone to share it with, however, she just can't seem to get it right.After yet another relationship ends, Anne comes across a business card for what she thinks is a dating service, and she pockets it just in case. When her best friend, Sarah, announces she's engaged, Anne can't help feeling envious. On an impulse, she decides to give the service a try because maybe she could use a little assistance in finding the right man. But Anne soon discovers the company isn't a dating service; it's an exclusive, and pricey, arranged marriage service. She initially rejects the idea, but the more she thinks about it -- and the company's success rate -- the more it appeals to her. After all, arranged marriages are the norm for millions of women around the world, so why wouldn't it work for her?A few months later, Anne is travelling to a Mexican resort, where in one short weekend she will meet and marry Jack. And against all odds, it seems to be working out -- until Anne learns that Jack, and the company that arranged their marriage, are not what they seem at all.", "title": "Arranged", "url": "https://www.goodreads.com/book/show/12935956-arranged?utm_source=author_blog&utm_campaign=authorblog", "average": 3.69, "cover": "https://images.gr-assets.com/books/1324069296l/12935956.jpg", "reviews": 1112, "authors": [{"url": "https://www.goodreads.com/author/show/3111153.Catherine_McKenzie", "name": "Catherine McKenzie"}], "type": ["Womens Fiction", "Romance", "Fiction", "Contemporary", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/12935956-arranged", "http://www.goodreads.com/book/show/8590382-arranged", "http://www.goodreads.com/book/show/13146576-arranged", "http://www.goodreads.com/book/show/11683992-arranged", "http://www.goodreads.com/book/show/25408174-amor-por-encomenda", "http://www.goodreads.com/book/show/13425320-arranged", "http://www.goodreads.com/book/show/23877137-arranged", "http://www.goodreads.com/book/show/22496145-arranged", "http://www.goodreads.com/book/show/18819296-hidden", "http://www.goodreads.com/book/show/29477965-fractured", "http://www.goodreads.com/book/show/13624077-forgotten", "http://www.goodreads.com/book/show/35620124-the-good-liar", "http://www.goodreads.com/book/show/25317381-smoke"]}