{"ratings": 16669, "userreviews": [{"userName": "Kelli", "userReviewDate": "Mar 31, 2016", "userURL": "http://www.goodreads.com/user/show/4146551-kelli", "userReview": "This may be my favorite picture book for children. This is destined to be a classic. It is a soft, gentle story of friendship between a kindly zookeeper and his animal friends. Beautifully illustrated, every page contains subtleties in it's classically-rendered scenes. There is a softness that translates in every image, a kindness in every creature and this is not lost on my children. We have read this dozens of times and they always point out different things...sometimes funny, sometimes sweet. It feels old-fashioned and timeless. Just stunning! 5 stars every time."}, {"userName": "Manybooks", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/2970379-manybooks", "userReview": "Husband and wife team Philip C. and Erin E. Stead's A Sick Day for Amos McGee is sweetly and basically a glowing and softly intense tale of friendship (between zookeeper Amos McGee and a diverse group of zoo animals) and that the most simple acts of kindness, of sweetness and understanding are often, are usually the most healing, and sustaining (while confined at home and in bed due to a nasty flu-like cold, Amos McGee almost immediately begins to rally and feel better when his zoo animal friends visit to cheer him up, not with medicines, not with health care advice, but with games of cards and simply being there for him during his hours of need, during his sick day). And truth be told, I am actually rather pleasantly surprised at how much I have both enjoyed A Sick Day for Amos McGee and appreciated the sweet but delicately, lovingly presented messages of the importance of friendship, of being there for others, of reciprocating care and support by providing your own if/when required, even if this is not specifically being demanded, being asked for (mostly due to the fact that A Sick Day for Amos McGee is a story about a zookeeper and the zoo animals under his care, as more often than not, stories about zoos do tend to rub me the proverbially wrong way). Text and images work marvellously and gracefully together like a beautifully spinning and well oiled machine (both Philip C. Stead's caressingly gentle narrative and Erin E. Stead's simple but minutely expressive accompanying illustrations perform a joyous dance and celebration of friendship and of knowing what friends and acquaintances desire and require to be cheered, to be content, to be helped and sustained). Most highly recommended, and definitely a worthy recipient of the Caldecott Medal it was awarded, A Sick Day for Amos McGee is a sweet read for any time, but is due to its themes and contents also a perfect pick-me-up during times of flu and cold like illnesses, during times of affliction, and of course always a glowing paean to friendship in all its diverse forms and manifestations."}, {"userName": "Betsy", "userReviewDate": "Apr 06, 2010", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "Sometimes children’s book reviewers bandy about the term “classic” like it was a verbal shuttlecock. There’s nothing that raises the savvy readers’ eyebrows faster than to see some wordsmith drooling profusely over “a new classic” or a book merely “destined to become a classic”. Even worse is when they start calling a book “old-fashioned”. Nine times out of then what they’re talking about is the fact that the book parrots some picture book title of the past. That’s the crazy thing about A Sick Day for Amos McGee. It doesn’t parrot anyone, and when you read it you feel like you’ve know the book your whole life. Could have been written last year, ten years ago, or fifty. Doesn’t matter because the word “timeless” may as well be stamped all over each and every doggone page. If you want to give a child a book that will remain with them always (and lead to decades of folks growing up and desperately trying to relocate it with the children’s librarians of the future) this is the one that you want. Marvelous.Each morning it’s the same. Amos McGee gets out of bed, puts on his uniform, and goes to his job as zookeeper in the City Zoo. Amos takes his job very seriously. He always makes sure to play chess with the elephant, run races with the tortoise, sit quietly with the penguin, blow the rhino’s runny nose, and tell stories to the owl at dusk. Then one day Amos wakes up sick and has to stay in bed. The animals, bereft of his presence, decide something must be done. So they pick themselves up and take the bus to Amos’s house to keep him company for a change. And after everyone helps him out, Amos reads them all a story and each one of them tucks in for the night.It’s strange to think that author Philip Stead wrote both this and last year’s Creamed Tuna Fish and Peas on Toast. Not that the latter was a bad book or anything, mind you, but that was a case where the protagonist had to be a perpetual crankypants. The character of Amos simply couldn’t be more different. He's like a cross between your favorite grandpa and Mr. Rogers. I read through this book several times to get down the cadence of Mr. Stead’s wordplay too. He’s prone to terms like “amble”. He parallels Amos’s activities in the first half with similar activities with the animals are taking care of him in the second. He knows when to leave sections wordless. And at the end, the “goodnight” section sort of makes this an ideal bedtime book for small fry. Practically invokes Goodnight Moon it does.There’s definitely a Sebastian Meschenmoser quality to this book (a statement that is going to be understood by approximately three people out there). Meschenmoser is a German illustrator who has written titles like Learning to Fly and Waiting for Winter. Erin Stead’s style is similar partly because there is a common humanity to every animal she draws. It’s not just the anthropomorphic details, like a penguin in socks (an animal Meschenmoser shares an affection for). It’s deeper than that. Look at this cover and then stare deep into that elephant’s eyes. There are layers to that elephant. That elephant has seen things in its day and has come out the wiser for it. It could tell you stories that would curl your hair or make you laugh till it hurt. That’s what I see when I look at a Stead animal. I see a creature that has had a rich full life, and all because of how she has chosen to put pencil/woodblock to paper. Amos McGee himself could not be any better. You love him from the moment he stretches in his pajamas. Everyone here, from the owl to the tortoise is someone you believe in. Add onto all that the little tiny details as well. How Amos and the penguin sit and stand together, ankles turned inward. The fate of the penguin’s red balloon. Where Mr. McGee’s teddy bear is at any given time. The portrait of the penguin in the home. The rabbit reading a newspaper on the bus. And then there’s the penultimate spread where the animals gather around Amos as he gets ready to go to bed. His left foot rest gently against the rhino’s nose, his left hand on the elephant’s trunk. Very simple, natural, affectionate touches. You notice them, but you don’t. That’s the charm.So there's the content. Now look at the actual art and design. According to the bookflap, Erin creates her illustrations by hand using woodblock printing techniques and pencil.” That’s impressive in and of itself, but I think the use of color is fascinating. Ms. Stead is sparing. On the one hand, you’re never able to identify the book’s exact year. On the other, you know in the back of your brain that if the publisher wanted to use all the colors of the rainbow, they could. You could also read the book several times before you noticed the elaborate flower design that ties the horizon in place behind the runny nosed rhino. Little touches, but necessary.Husband and wife author/illustrator teams emerge once in a while, but they don’t always have the golden touch. That the Steads not only have it but are also willing to use it as a force for good instead of evil is gratifying. It’s also gratifying to think that maybe we’ll see them do more books in the future. I’d like that. I’d like that very much, and I’m wagering that a whole generation of children reading and loving this book are going to like it as well. Here, I’ll make it simple for you: Need to buy a picture book for a kid between the ages of four and eight? Buy this one. There you go. Problem solved.For ages 4-8."}, {"userName": "Lisa Vegan", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "I was sure I’d dock at least one star from my rating of this book because a zoo features prominently in the story, and I hate zoos. Huge thumbs down on zoos from me. But this story has enough fantastical elements that I ended up not being concerned with the over the top benign way this zoo, and its animals and zookeeper/zoo worker, were presented.I love that Amos has a teddy bear, and I particularly love the relationships between Amos and the several of the animals who are in the story. The illustrations are so sweet, and have an old fashioned feel about them that I enjoyed. I love the art style; I enjoyed all the illustrations.Although there is a lot of humor, this is a very quiet story. For that reason, and because of the last picture in the book, this might make a perfect bedtime story. I think kids will find it funny but not overly stimulating."}, {"userName": "Kathryn", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/446464-kathryn", "userReview": "This 2010 debut is up for some awards and for good reason. I think it's got a glorious \"classic\" feel in both the illustrations and the text; it is just so gentle and yet full of humor and imagination and good-heartedness and fun. Amos McGee is the sort of old man that I admire so deeply; one who has taken his old years as a blessing rather than a curse and who shares his time and his wisdom and kind heart with others. In this case, he works at a zoo and spends time with each animal there, getting to know their personalities and interacting with them in ways that they find mutually beneficial. But when Amos is too sick to come to work one day, the animals find a special way to help him feel better. I read this book while I was sick with a nasty post-Christmas cold and it cheered me no end. Created by a husband and wife team (be sure to check out the sooo cute dedication page) this book is definitely one of my favorites of 2010 and I highly recommend it to anyone looking for a sweet, gentle, humorous story about friendship."}, {"userName": "LindaJ^", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/4999879-lindaj", "userReview": "I bought this book as a gift for a youngster. Of course I couldn't gift it unless I liked it so I had to read it. It should be a classic, as the story is timeless. Amos is elderly and works at the zoo, where he is friends with an elephant, a penguin, an owl, a turtle, and a hippo. When he doesn't show up one day for work, the five animals get worried and take the bus to his house. He is so glad to see them. They take care of him and everyone is content! The illustrations are absolutely beautiful. I hope the youngster likes it as much as this oldster!"}, {"userName": "Ale Rivero", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/8429859-ale-rivero", "userReview": "Los dibujos en esta historia son los que se llevan la corona, me encantan los pequeños detalles que hacen a la ternura de la historia.El Sr. McGee y sus amigos son muy lindos, obviamente, esto lo dice una amante de lo animales, jaja.Es divertido ver cómo todo el amor que Amos le da a sus amigos en el zoológico luego es retribuido cuando él se encuentra enfermo.Ciertas escenas me hicieron acordar a algunas cosas de los personajes de Madagascar, pero en este caso los animalitos son más tranquis. Muy recomendable."}, {"userName": "Laura", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/29789832-laura", "userReview": "This is the sweetest book, ever. The illustrations are absolutely classic, right down to the red nose on Amos McGee. This is one of those books you just have to hug."}, {"userName": "Natalie", "userReviewDate": "Jan 14, 2011", "userURL": "http://www.goodreads.com/user/show/1671713-natalie", "userReview": "My daughter read A Sick Day for Amos McGee aloud to me before she went to sleep and it was a treat for both of us. I love stories for children where older characters retain a child-like quality of bonhomie and easy camaraderie. Amos has both which makes him irresistible to me. The structure of this book is really comforting too, a there and back again plot where the protagonist goes on a journey wherein the reader is introduced to everyone worth knowing and then they are separated but not for long because as one person can bring joy to others throughout their day, so too can a group of friends unite to bring one special person comfort and pleasure together! This is that sort of book. See above for an interior view of the book from publisher, Roaring Broook's site. The way award winning illustrator Erin Stead makes her pictures is the icing on the cake: a labor intensive process of block printing the backdrops & major features before completing detailed illustrations on top of them. She describes and illustrates her process really wonderfully in her blog. I still think The Today Show is SICK breaking with tradition and having Snooki on instead of this year's Caldecott and Newbery award winners. But I must confess I have never watched that show, so eventually I should get over it (after a few more healthy rants). If it had been an important show, like say Mutual of Omaha's Wild Kingdom, or a Columbo Rerun, or maybe The Beekman Boys I might have more to bitch about? But the principle of the scheduling choice is still kind of irritating! But, what the Steads have made in their book A Sick Day for Amos McGee is enough to make anyone feel better about a lot of things!"}, {"userName": "Ann", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/446509-ann", "userReview": "This book came to me highly recommended, and lived up to it all (not an easy thing to do!).This is an incredibly sweet, fantastical story about a zookeeper who spends his time with his good friends at the zoo (and those friends are the animals, of course!).He does all sorts of fun things (like playing chess with the elephant) or thoughtful things (like sitting with the penguin who is shy) and truly seems to have a bond and friendship with them.So, when Amos McGee doesn't come into work one day, the animals all get together and do something nice for Amos in return.It's a wonderful story, and just fantastical enough to be funny and still touching and charming. And the illustrations are so beautiful and wonderful and fun (I highly suggest looking at them carefully for all the cute additions - like the song bird wearing a tie!!!).This has such a classic and timeless feel, I'm sure it will delight readers and listeners of all ages!!Highly, HIGHLY recommended!!!"}, {"userName": "Evelyn Tapia", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/30267499-evelyn-tapia", "userReview": "I really liked reading this book because it was short and the pictures went along with the story. I think this picture book falls under one of the levels of illustration which is symmetry. The reader can find themselves enjoying reading this book. I think this would be appropriate for 1st and 2nd graders because it’s easy to understand for them. The story begins with Amos, an elderly, who works at the zoo. Throughout the day Amos went through a routine; from waking up,to taking the bus to work, and making a quick stop to see his friends. His friends are the elephant, the turtle, the penguin, the rhinoceros, and the owl. Amos spent quality time with them either by playing a game or providing his company. One day Amos woke up feeling sick. That they his friends notice his absence in the zoo. So they decide to go visit him at his home. They then share quality time with him and make him feel better."}, {"userName": "Tasha", "userReviewDate": "Apr 16, 2010", "userURL": "http://www.goodreads.com/user/show/929521-tasha", "userReview": "I was utterly charmed by this book. It has a gentle humor, a sweetness and an inherent loveliness that really makes it special.Amos McGee got up early every morning, changed into his uniform, and headed to work at the City Zoo. Even though he had a busy work schedule, he always had time to visit his friends. He played chess with the elephant, ran races with the tortoise, sat quietly with the shy penguin, wiped the rhino’s runny nose, and read books to the owl who was afraid of the dark. But one morning, Amos woke up and didn’t feel well enough to go to the zoo. His friends waited for him, but when Amos didn’t come they set out to visit him instead. The elephant played chess with him. The turtle played hide and seek instead of running races. The penguin kept Amos’ feet warm. The rhino always had a handkerchief ready when Amos sneezed. And at bedtime, the owl read them all a book.The husband and wife team who created this book really worked well together. Philip’s tone of writing has a gentle feel that matches his wife’s art perfectly. Philip’s writing is very readable and works well aloud. The small touches of detail make the world more convincing, including the elephant taking a lot of time to make his move in chess and the spoonfuls of sugar Amos uses at breakfast. It is these little facts that really invite one to linger longer in the book.Erin’s art is delightfully realistic for such a fantastical story. The animals are very true to life except for their hobbies. I especially enjoyed Erin’s two-page wordless spreads as the animals head to Amos’ home. Again with her art, the small touches add so much: the elephant lining up his chess pieces while waiting for Amos and the socks on the feet of the penguin. Small details but very important to the tone and feel of the book.Highly recommended, this book will be embraced by all who read it. Share it for units on zoos or colds. Now all I need to find is a shy penguin to keep my feet warm…Appropriate for ages 3-6."}, {"userName": "Jennifer", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/58584184-jennifer", "userReview": "CaldecottI love the friendship between Amos and his animals. He gives all of himself to them every day, being exactly what they need. \"He always made time to visit his good friends.\" He was exactly what each needed, nurturing for the rhinoceros, a friend to the shy penguin, mental stimulation for the elephant, and physical activity for the tortoise. It's a bit odd that he reads a bedtime story to the owl who is afraid of the dark. Even my Kindergartners know that owls are nocturnal and wake up to do all of their hunting at night. This might lead to an unnecessary explanation of how animals in captivity adapt to non-natural habits and alternative lifestyles (See, \"It Takes Two To Tango\").The intentionally left blank pages allow for extra pauses and for inferring and synthesizing of the story so far. The colors are light and the drawings aren't overly detailed so they add to the story without taking anything away from the words. The moral of the story is to be the kind of friend you would want to have. Or maybe it's to take care of your friends when you can and they'll take care of you when you need them. Whatever, it is, I like it."}, {"userName": "Virginia", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/3581866-virginia", "userReview": "Lovely and sweet. I really enjoyed the simple story and loved the drawings. My son loved the animals and named them over and over on each page. (He especially loved the owl and the balloon.)"}, {"userName": "Michael Wright", "userReviewDate": "Aug 23, 2016", "userURL": "http://www.goodreads.com/user/show/46114757-michael-wright", "userReview": "I read this to my daughter several times a day. She LOVES the rhinoceros with the runny nose!"}, {"userName": "Carlos Gastelum", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/34712185-carlos-gastelum", "userReview": "Stead, E., E. (2010) A sick day for amos mcgee. New York, NY: Georg von Holtzbrinck Publishing Group.A Sick Day for Amos Mc Gene is a picture book about a punctual zookeeper named Amos. Unfortunately, one day Amos wakes up very ill and is not able to show up to work, so the animals decide to pay him a surprise visit. Upon their arrival they decide to brighten up Amos’s day and succeed in helping him feel better. Each page is filled with pictures of animals doing unbelievable things. The illustrations in the book show how real life can be altered into something fictional. Stead’s book explores the theme of pet-bonding as it displays a man’s unbreakable bond with the zoo animals he cares for at work. This book is recommended for young elementary students and allows them to use their creative imagination. I could incorporate this book into my classroom by having students bring in their favorite animal or item into class and share why it is important to them."}, {"userName": "Marybeth Batie", "userReviewDate": "Dec 07, 2014", "userURL": "http://www.goodreads.com/user/show/34408001-marybeth-batie", "userReview": "I thought that this book was very well written and told a very cute story. Amos McGee is a zoo keeper and visits his animal friends every day to take care of them. One day, he is sick and can't make it to work, so the animals decide to pay him a visit and take care of him. I thought that the theme of friendship and loyalty shined through the pages, with the idea that you should always be there for your friends. It was comical to see the animals waiting at the bus stop, and I am sure children would enjoy that as well. This children's picture book is great for lower level readers, especially because of the penciled pictures and comic relief. In a young classroom this book could be used in a journal entry for what the students would do if they were home sick for a day. It can also be used in the science subject by studying the kinds of animals in the book, such as elephants or owls. Stead, P., & Stead, E. (2010). A sick day for Amos McGee. New York City: Roaring Brook Press."}, {"userName": "Mississippi Library Commission", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/6193041-mississippi-library-commission", "userReview": "This is the sweetest picture book ever; no wonder it won the Caldecott in 2011! In A Sick Day for Amos McGee, we meet genial Amos and his friends at the zoo where he works. He makes time to see them every day and they all enjoy their time together immensely. One unfortunate day, Amos wakes up and doesn't feel very well. Luckily for him, his zoo friends pay him a memorable visit. The illustrations are heartwarming and hilarious at the same time. The picture of the animals crammed into the metro bus may be our favorite. Your kids will love the animals' adventure and identify with having to stay home when they're ill. Highly recommended."}, {"userName": "Fjóla", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/5395741-fj-la", "userReview": "A lovely, understated story about friendship and empathy. And the illustrations are beautiful, humorous yet sensitive and expressive. The use of colors is refreshingly sober. I'll have some more of that, please ...I could see this as a story time read, but there are details in the pictures that are best appreciated with a lap read."}, {"userName": "Colby Sharp", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/5186758-colby-sharp", "userReview": "A Sick Day for Amos McGee is a beautiful picture book. In a day where it seems bright colors, and crazy art rule picture books, A Sick Day for Amos McGee is beautiful in its unflashiness. This great tale of friendship and love will become a long time favorite in both my classroom and home."}, {"userName": "Michele Knott", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/5915836-michele-knott", "userReview": "Somehow, I just never got around to reading this book. I'm glad I finally did. What a beautiful tale of friendship. Stead is quite talented with making books that have characters that come to life in his book. They become dimensional characters that you wish would reside outside of the pages."}, {"userName": "Kirsten Kinnell", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/124251-kirsten-kinnell", "userReview": "Lovely, quiet story, beautiful illustrations"}, {"userName": "Mary", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/84191-mary", "userReview": "A Sick Day for Amos McGee thrust its way into my heart in January 2011 when it won the Caldecott Medal. I had run a mock Caldecott unit with my third grade class, and this book wasn’t even on our radar enough to put on our ballots. I had some definite favorites that year, both for the Caldecott Medal and for timeless books I wanted to make sure I bought for my own children (Art & Max; City Dog, Country Frog; Ballet For Martha; Mirror Mirror; It’s a Book; Ubiquitous), and I was initially crushed when some of those favorites weren’t recognized at the ALA awards… Until I went to the bookstore that afternoon, bought A Sick Day for Amos McGee, and realized how amazing it was.\u2028\u2028Though Philip Stead had published one book previously, A Sick Day for Amos McGee was his wife Erin’s first illustrated book… and both newbies hit the nail squarely on the head with this charming, timeless book. Amos McGee, zookeeper who will remind adults of Mr. Rogers, is one of the more endearing book characters I can think of. He wakes early each morning, greets even the items around his house and the bus driver, and is extraordinarily devoted to the animals at his zoo. He knows each one intimately, taking care to make them feel comfortable and loved. Until, one day… Amos McGee gets sick. Amos’s tenderness with his animal friends is reflected in the worry they feel about him and the actions they take to ensure that he too feels comfortable and loved. This is the kind of story that makes children and adults alike want to treat their friends and loved ones the same way Amos McGee does.And the illustrations! Erin’s pencil and woodblock prints are done with minimal, reserved color, but are full of details that render each reading of those story new and exciting. I didn’t notice the repeated inclusion of a red balloon, tiny bird, and mouse until the fourth or fifth time that I read the book! Tiny details aside, Erin’s sketches allow the sweet, caring personalities of each character to show through. Readers feel genuinely concerned about the rhino with a runny nose, depicted with constant concern or worry on his face reflecting just how sick he feels, and compassionate toward the shy penguin, drawn with his wings and toes pointed in, as if he’s trying to curl up small enough to go unnoticed.Philip and Erin Stead, thank you for this book. A story of the kindest of friends, timeless illustrations leaving you with more with every reading… It was an instant favorite with my room full of third graders, and it is now a favorite with my own children (2 and 4.5). Publishers recommend this for ages 4-8, but it can definitely be enjoyed younger and likely older too! If you If you loved A Sick Day for Amos McGee, check out Bear Has a Story To Tell, the duo’s second collaboration together. It’s every bit as charming of a friendship story with as many fun details that make it new and interesting to read each time. For that matter, I love every single book that Philip Stead has written and every book Erin Stead has illustrated!"}, {"userName": "Jenny", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/1366775-jenny", "userReview": "This book has an old fashioned vibe to the illustrations. I wasn't certain what my reaction would be to this book, but I ended up loving it. It's a tale of friendship. Amos McGee is a creature of habit. Each day at the zoo, he visits his friends. He plays chess with the elephant, gives a tissue to the rhino and reads stories to the owl and so on. One day, he gets sick and stays home. His friends miss him and decide to take action.What I love is that Amos McGee probably doesn't think he is doing much...he has a routine that he follows and he lives a simple life. And yet, it is clear that he is making the lives of each of his unique, diverse friends better through his simple acts of kindness and concern and by meeting each of their unique needs. I think there are a number of reasons this touched me. First, sometimes I feel like my quiet little life doesn't have the power to change the world...I'm no Ghandi or MLK Jr. or Mother Teresa. But I think this book relates to something Mother Teresa said: \"If you can't feed a hundred people, then feed just one.\" Amos McGee didn't do anything grand, but he did show kindness and concern for those he came in contact with. I can do that too. Second, his friends are a diverse bunch. Now while I recognize that his friends are animals, they are a diverse bunch. It's a nice reminder that we can be friends with people of a variety of backgrounds. (And oh, how our world needs that!!) And finally, as a teacher, we seem to be talking a lot about equity in our school/district. My favorite definition of equity is not making everything equal but providing what each child needs to be successful. And that is what Amos does...he provides what each animal needs to be healthy/happy. I love this! (It's always possible that I am reading much more into this than the author's intent...I've spent the week preparing for a new school year and between that and recent events in the news, I have had lots brewing in my head which probably affected my interpretation.)"}, {"userName": "AgnesO", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/66226838-agneso", "userReview": "A Sick Day for Amos McGee is a Caldecott Award picture book written by Philip C. Stead and illustrated by Erin E. Stead. I selected this book from the ALSC website. A Sick Day for Amos McGee evokes emotions of warmth and sympathy. In particular, Amos McGee, the main character, is a dedicated zookeeper with regular routines. Despite his duties at the zoo, Amos always makes time for his animal friends. He enjoys playing chess with the elephant, running races with the tortoise, and reading stories to the owl. Consequently, the animals are attached to Amos; thus, when he wakes up sick and cannot go to work one day, the story is reversed as the animals decide to do something extraordinary…The profound theme in A Sick Day for Amos McGee reveals some of the essential qualities of friendship, including kindness, mutual caring, and altruism. The interactions between Amos and the zoo animals confirm that their friendship is truly genuine. Amos is a responsible and faithful character; he is motivated by pure compassion. Amos is simply charming. The story is told through simple text. The plot is intriguing and entertaining, and it keeps the reader engaged. The illustrations are gentle adding warmth to this beautiful picture book. The illustrator skillfully used woodblock prints to add soft color to the pencil drawings and, as a result, brought the characters to life and made each page visually appealing. The wordless pages create a pleasant balance allowing the illustrations to narrate the story. I would implement A Sick Day for Amos McGee in the primary grades as a read aloud to reflect on the nature of friendship as well as the importance of responsibility. In particular, book activities can engage students in retelling, sequencing events, investigating how illustrations create emotional impact on the reader and extend the story, making text-to-self connections, differentiating between fact and fiction, as well as identifying story structures. Because the characters in this picture book are animals, students can identify and classify the different types of zoo animals and explore the role of a zookeeper."}, {"userName": "Emily Arrant", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/70891398-emily-arrant", "userReview": "Summary: This is a picture book about friendship. Everyday Amos McGee spends time with his friends at the zoo. He keeps the shy penguin company, runs races with the tortoise, and reads bedtime stories with the owl. However, one day Amos McGee could not make it to the zoo because he was sick, so all of his zoo friends came to see him and returned the favor. Evaluation: This is a really great book and the pictures are great. It tells a great story about friendship. Has hidden messages throughout the pictures for higher thinking skills. It also has a variety of animals if you wanted to do a science lesson. This would be a great read aloud book or for independent reading. I really enjoyed this book as well as the illustrations.Teaching Idea: This book could be used for so many different teaching ideas. One teaching idea I had was to talk about the animals. I would have cut outs of the different animals and a sheet that says animals sort. They would have to sort the animals based on legs, size, color, and shape. I think this would be a fun and engaging lesson for younger students."}, {"userName": "Ubah Khasimuddin", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/18500983-ubah-khasimuddin", "userReview": "Love this classic book - it is so sweet, you Amos McGee is like Mr. Rodgers, just so sweet and takes care of all the animals at the zoo, with their quirks, just adorable. I think the book is an easy read and great bed time story, my 4 and 6 year old love it! A Caldecott winner, this book is a definitely one of those \"must have's\" on any child's shelf. I would recommend in a heartbeat (my favorite is the owl who is afraid of the dark, to cute)!"}, {"userName": "Sadia Mansoor", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/42662691-sadia-mansoor", "userReview": "A sweet & quiet story about how caring some friends could be, esp in the hour of need! :) PS..  ANNOUNCEMENT  Hurraayyyy... my 1000th book here! My 1000th entry yipppeeee! ^_^ :D Finally, reached this score after ages, hardwork & patience! :)"}, {"userName": "Tabatha Mulkey", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/70899708-tabatha-mulkey", "userReview": "Summary: Amos has friends in all sorts of shapes and sizes. In his case, all sorts of species, too! Every day he spends a little bit of time with each of his friends at the zoo. He runs races with the tortoise, keeps the shy penguin company, and even reads bedtime stories to the owl. But when Amos is too sick to make it to the zoo, his animal friends decide it’s time they returned the favor.Evaluation: I liked this book! I had never read it before until we had to for class and we had to look at all the colors and textures and stuff in the book and it really opened my eyes to all that stuff. This book is cute because it teaches a good story about friendship.Teaching Idea: I would use this book to talk about sick days. I would have my students write about what they would do on their sick day from school."}, {"userName": "laura (bookies & cookies)", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/3344244-laura-bookies-cookies", "userReview": "Cute!"}], "description": "Amos McGee, a friendly zookeeper, always made time to visit his good friends: the elephant, the tortoise, the penguin, the rhinoceros, and the owl.But one day—\"Ah-choo!\"—he woke up with the sniffles and the sneezes. Though he didn't make it into the zoo that day, he did receive some unexpected guests.Philip C. Stead's gently humorous tale of friendship and dedication is illustrated by his wife Erin E. Stead's elegant drawings, embellished with subtle hints of color.", "title": "A Sick Day for Amos McGee", "url": "http://www.goodreads.com/book/show/7268995-a-sick-day-for-amos-mcgee", "average": 4.25, "cover": "https://images.gr-assets.com/books/1312019421l/7268995.jpg", "reviews": 2185, "authors": [{"url": "https://www.goodreads.com/author/show/4902018.Philip_C_Stead", "name": "Philip C. Stead"}, {"url": "https://www.goodreads.com/author/show/4581894.Erin_E_Stead", "name": "Erin E. Stead"}], "type": ["Childrens", "Childrens", "Animals"], "outlinks": ["http://www.goodreads.com/book/show/7268995-a-sick-day-for-amos-mcgee", "http://www.goodreads.com/book/show/14651302-un-dia-diferente-para-el-senor-amos-mcgee", "http://www.goodreads.com/book/show/13170028-bear-has-a-story-to-tell", "http://www.goodreads.com/book/show/12567892-a-home-for-bird", "http://www.goodreads.com/book/show/23310688-lenny-lucy", "http://www.goodreads.com/book/show/25332010-ideas-are-all-around", "http://www.goodreads.com/book/show/17199269-hello-my-name-is-ruby"]}