{"ratings": 7932, "userreviews": [{"userName": "Deanna ", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "I have enjoyed many books by Catherine Ryan Hyde. Pay it Forward was the first and was a favorite and from there I went on to read many more. Other favorites are Take Me With You and Walk Me Home. I was really looking forward to reading Ask Him Why.In 2003 when Ruth's older brother, Joseph returns from Iraq well before he's due to come home. She is happy he's home and safe but very confused about the reason why he's back so soon. Her younger brother, Aubrey is also confused but positive that Joseph must have a good reason. But before anyone can get any answers from Joseph, he disappears. Ruth and Aubrey are desperate to find their brother and enlist the help of their aunt. However, will they find him and get the answers they are looking for? \n\"The thing I'll always remember best about that time is not how quickly our family fell apart. The memorable bit was when I first looked back at how we'd convinced ourselves we'd ever been together in the first place.\"\nAsk Him Why is about the bonds between family. I enjoyed many of the characters and the relationships between them. It shows how you don't have to share blood to have a close \"family\" bond. I was very angry at the parents and had a hard time finding redeeming qualities about them or understanding their actions. Other characters (Hammy, Isabella, and Luanne) were so lovable and I enjoyed them immensely. Judgement also played a big role in the story. How hard it is to come up against judgement and still be able to trust. These characters were caught between their love and the judgement of others. \n\"As long as I live, I'm never going to do what they're doing. I made myself a promise. And now I'm making the promise to you. I'm never going to judge somebody I don't know. And if somebody is accused of something in the newspaper or on TV. I'm going to remember that maybe he did it or maybe he didn't. I wasn't there so I don't know. Why doesn't anybody do that? Why do they all think they know?\"\nAsk Him Why is an emotional read but I found I didn't quite connect with it as much as some of the other books by Catherine Ryan Hyde. I was interested for the most part and I definitely wanted to know what happened, but I just wasn't as excited about it. It was a little predictable and at times it seemed to drag on. However, I still thought it was a well written story. I really enjoyed the last few chapters and thought the epilogue was great. So while it's not my favorite book by Catherine Ryan Hyde, I'm still happy I read it and I look forward to reading more from this author. Thank you to NetGalley for the free digital copy I received in return for my honest review."}, {"userName": "Elyse", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"But everybody's 'saying' Joseph's a betrayer who got two guys killed.\" \"Things will be better when we get to Aunt Sheila's for the summer\", I said. \"Why will they be better?\"\"Because even if there's a reporter or two calling, most people who live around there won't know who we are.\" Whether or not things get better when Ruth and Aubrey, visit their Aunt, (trying to escape their friends at school, bullying, Internet comments, newspaper articles, their parents fighting, and their entire community), since their older brother Joseph has come home after 3 1/2 months in Iraq....is questionable. I had a few questions ...(minor to this story ... but a few stayed with me) .... Here is one example: it's mentioned early in the storytelling that Aubrey becomes an astronomer as an adult. That's a pretty cool profession .. Yet I never read anything - again to tie in this 'drop' of information. I would have liked to know more details. We get a more visual picture of Ruth's adult life ... but I felt a little cheated not knowing Aubrey more intimately as an adult--- whom was my favorite 'child' character. The main themes were clear with tensions building.....We see kids being raised by parents with little to no emotional connection and expression. Curiosity was not encouraged, and personal questions could be cause for punishment. Other themes deal with anger, loneliness, humiliation, shame, purgatory, dis-honorabledischarge, raids in war, (The Middle East War), mutiny, court-martial, suppression, secrets, chronic digestion problems caused by trauma, suicide, trauma in general when it affects an entire family....depression... loss....forgiveness.I would highly recommend this book for High School students as well as adults. The teens who narrate are 'real-kids' and enjoyable to be with. Thank You Lake Union Publishing, Netgalley, Catherine Ryan Hyde"}, {"userName": "Debbie", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/12691311-debbie", "userReview": "This was my first book by Catherine Ryan Hyde and it won't be my last. I ordered \"Take Me with You\" just this morning as it was the book of the day on one of those sites I receive in my daily e-mail. I was only halfway through this book and I knew I wanted to read more of her work.This book was so good. I don't think that my review can even begin to let you imagine how good it was. It was so emotional and such a heart felt story. I felt myself asking the characters all the way through the book the title of the story, \"Ask Him Why?\". Then when I heard the reason, it really got to me. There's a lot of heart break in this story and none of it regards romance. It's the heart break of a family. One that was never a real family to begin with as it had a lot of silences and not a lot of hugs or love. But one that to no one's surprise grew more distant as the years went on. Joseph's story takes that family even more distant. They stayed in touch because it was expected, not so much as they wanted to.After many years, Joseph is back. Still no one knows his story and the distance is still there. Can the telling of his story bring this family back together or are the pains too difficult to deal with?Without a question of a doubt I recommend this book. It will touch, at least it did me, and it will make you think. Definitely a great story with real human characters.A huge thanks to Lake Union Publishing and Net Galley for approving me and providing me with a free e-galley in exchange for an honest review."}, {"userName": "Samar Aljarah", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/63173916-samar-aljarah", "userReview": "قرأت لهذه الكاتبة رواية اخرى هي Walk Me Home ولكنها في هذه الرواية لامست مشاعري بشكل أقوى لانها تتحدث عن عائلة جندي يخدم اثناء احتلال العراق ويتسبب في حادث يعد( خيانة) منه لوحدته وبلده واهله خاصة اخوته الصغار الذين تأثروا بالقصة التي تناقلتها الأخبار عن بطلهم الشخصي الذي كانوا يعدونه نموذجا الأحداث طويلة بعض الشي ولكن النهاية كانت مدهشة احيانا نحتاج لهذا النوع من الادب الذي يتحدث عن مشاعرنا الانسانية وسوء ظننا ومحاكمة الآخرين دون معرفة الحقائق والاستعجال في إطلاق الأحكام القطعية .. كاثرين ريان هايد لديها اكثر من ثلاثين رواية بعضها مثلت للسينمامثل فيلم Pay It Forward"}, {"userName": "Carol Brill", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/4427869-carol-brill", "userReview": "Ask Him Why is a powerful story about the consequences of rushing to judgement and condemning someone without first trying to understand what their action and asking, \"Why?' Here's the link to my full review for New York Journal of Books, http://www.nyjournalofbooks.com/book-..."}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "It's interesting how distant some families are, how it can takes years to get to the truth of any event, story. Some find their real family (mother/father figure) are not blood and such is the case in this novel. You do not ask questions, Ruth and Aubrey know this but when their brother Joseph comes home after only 3 months is Iraq, and it isn't because he's injured through a heroic act, they are hungry to figure out what has happened. He comes home a coward, or so the siblings slowly learn through others (news, internet, rumor). The family is destroyed through his choices, and we see the cracks that were already there. Hamish is a fascinating character, a father figure full of wisdom. How, Ruth wonders, did he know so much about her brother- even things she didn't know? How sad that a stranger can be closer to her brother than her own father!There are children that come from families that forbid emotional expression, such a devastating thing in any human being- having no voice, grasping to understand the world, needing reassurance during chaos but no one to talk to. I felt the tension during the read. Nothing like being kept in the dark when something enormous is happening, the whole world spinning but you're meant to act like everything is normal. It does something to a child, effecting them into adulthood, stuffing emotions like that. We all have a moral obligation to ourselves, and sometimes we can't do the 'right thing' without causing a horrible outcome. Sometimes in life, you truly are 'damned if you do, damned if you don't.' A lot of choices we make are based on the question 'can I live with myself if I.....' But there aren't always easy answers, and our actions (regardless of our intentions) can effect so many others. This is a provocative story, and I can imagine book club members having some serious conversations and arguments about it. Anything with a military theme like this would be a hot topic. People are quick to judge, certainly more now than when this story first takes place but even then... Interesting read. One wonders how different things would have been if the family structure were different, more expressive, more open. Sad."}, {"userName": "Beth McCraw", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/8654301-beth-mccraw", "userReview": "I loved this book so very much, I think it's one of my all time favorites! This is my first book by this author but definitely not my last. I'm going to go look for another by her right now!"}, {"userName": "Morris", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/32911939-morris", "userReview": "“Ask Him Why” is a very complex and emotionally taxing book about the price of war on both those fighting it and those close to them. It’s also a very real examination of the nature of the press and how it can tear people apart.The story is split between the events of a soldier returning from war to his family, including two younger siblings, after being dishonorably discharged and a period of reflection on the past that takes place a decade later. I won’t spoil the reasons for the discharge, but the children are left in the dark while their parents and brother deal with a press that is brutal in their treatment of the very difficult situation in which he found himself.The plot was good but there was a bit of a problem with the pacing in the middle. That is my only reason for giving it four stars instead of five. The ending picks back up nicely.I recommend “Ask Him Why” to anyone willing to ask themselves difficult questions, most importantly “what constitutes the right thing to do in war” and “how can we judge the difficult decisions of others in such difficult circumstances?” I, for one, will be looking at media coverage of certain stories through a new awareness.This review is based upon a complimentary copy provided by the publisher in exchange for an honest review."}, {"userName": "Kelly", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/9936139-kelly", "userReview": "3.5 *'s. \"Ask Him Why\" is the story of two teenagers, Ruth and Aubrey whose older brother Joseph is dishonorably discharged from the military during the Iraq war. It deals with how Ruth and Aubrey handle the stigma put on their family very differently. Much of the story is when they are teenagers and then the later part is when they are adults. I listened to the audio version and did enjoy the narration. This is a family drama featuring a dysfunctional family. There is not a lot of action, just feelings. I did enjoy the second part when they are adults much better. It takes the whole book to hear Joseph's side of the story. I did enjoy the ending and was happy to see how things tied up."}, {"userName": "Leah Good", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/11034763-leah-good", "userReview": "Thanks to Cyber Monday for talking me into taking a chance on a book I would never have noticed otherwise. Ask Him Why is way more literary than my typical YA Dystopian fare. Waaaaay different. All dialogue and emotional rumination, but it held my attention captive (obviously ... since I purchased it on Cyber Monday, started it on Tuesday, and am already finished with it.One of my most recent blog posts expressed some of the thoughts that ran through my head after hearing the synopsis of Me Before You. The idea of a novel that condoned medically assisted suicide really bothered me. Ask Him Why, another mainstream novel, carried an entirely different message. I feel like even the titles indicate that difference.I'm guessing Hammish, the mentor of Ask Him Why, was inspired at least partially by a similar real-life character I read about a while back. That theme of quietly being there to help strangers was my favorite part of the book and Hammish hands down my favorite character.So, what happens when war blurs black and white to gray, but the vast majority don't see the gray? How can a decision made thousands of miles away wreak havoc on an already dysfunctional family? Can reunion and reconciliation happen after a decade of separation?Note: My one word of warning with this story is the infrequent use of mild profanities."}, {"userName": "Lisazj1", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/5816343-lisazj1", "userReview": "3.5 stars"}, {"userName": "Cheryl", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "This is not a bad book, I just could not find myself relating or connecting with all of the characters in this book. Or maybe I did connect in some way as I could not stand most of them. I really only found Aubrey, Aunt Sheila, and Joseph to be interesting. The rest of the family I had no interest in. In fact, I found Aubrey, Ruth, and Joseph's mother to really piss me off. Any time she made an appearance in the story, I would cringe and after a while, I would quickly flip past her parts. Which I have to comment and say that as much as I appreciated the family dynamics surrounding Joseph's circumstance, I did grow tried at times of how slowly the story read. It seemed like parts would be repeated again and again but in different ways. A good ending though to this story."}, {"userName": "Teresa in Ohio ", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/2182384-teresa-in-ohio", "userReview": "When I began this book I didn't realize she is the author ofPay It Forwardwhich has a message. I didn't really like the book. So I decided to give this writer another try.This book is about a family who deals with scandal in diffetent ways. Most of the story is either Ruth or Aubery's perspective on the downfall of their brother. He goes off to war in the Middle East but three short months later he is back home. It takes most of the book to find out WHY he did what he did. By the time we find out what is going on, I am so done with the self pity of Ruth and the anger of Aubery I could care less what happens to them."}, {"userName": "Lesley", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/3430178-lesley", "userReview": "thanks net galley for the early preview of this book. I usually love the stories by this author. THis one was a good tale of devotion, family! But the reasons and secrets are what they are!"}, {"userName": "Brittany (brittanymariereads)", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/29017732-brittany-brittanymariereads", "userReview": "I have yet to read a book by Catherine Ryan Hyde that I didn't love. This was no exception."}, {"userName": "Michelle (Michelle's Book Ends) Shealy", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/648443-michelle-michelle-s-book-ends-shealy", "userReview": "http://michellebookends.blogspot.com/...\"I was fifteen when our brother Joseph was shipped overseas to fight, and I was fifteen when he came home, uninjured, three and a half months later. Yeah, I know what you're thinking. The army doesn't tend to have deployments that last only three and a half months. That was the heart of our problem right there...\"From the bestselling author of \"Pay it Forward\" comes a tale of family dysfunction and the love between siblings that bond them together, even when there are things tearing them apart. Ruth and her brother Aubrey are barely teenagers when their older brother Joseph is deployed to Iraq. Joseph returns though in just a few months, dishonorably discharged, with a story that the press is jumping on and the family can't comprehend.Ruth and Aubrey are struggling to understand secrets that are being uncovered and things that are left unsaid. Then and ten years down the road. They tell the story of what it's like to be a part of a family that is torn apart by their brothers actions. A family that was already on the edge of the abyss to begin with. Such a total lack in communication between family members make it so they kids have to find out on their own exactly what happened to their family before and after Joseph's discharge.The story goes back and forth between the time of the incident when Joseph came home that day to ten years later as they look back over what happened. The press was merciless, as the press would be. Soldiers died and people blamed Joseph. How did the family of a soldier cope when the world has already judged his guilt?An emotional drama. Ruth and Aubrey take refuge with their aunt and go in search of answers. Joseph and his parents are leaving these kids to dangle with no explanation. Something I think adults tend to do in a crisis. They think they're protecting the children by not talking about something, but it is still shaking their world as much as the adults.Sometimes we do a very wrong thing for the very right reasons. Can these siblings find the way back to each other? There is a beacon in the darkness in the form of an elderly stranger named Hammish. One whose knowledge of human nature can help bridge the gaps. We should all be so lucky to know such a person.The key to unraveling everything is if someone, anyone will just \"Ask Him Why\" he did what he did. There were times I was reading that I yelled at the book that very thing! Do they ever ask him? You'll have to read the book to find out. Anger definitely holds a person back from many things. Anger at Joseph is like Aubrey's blood, and runs through him deep and strong.I do like the way this book flowed and the way it ended. It was wrapped in a way that was both touching and realistic. A thought provoking journey through the pages. Being a soldier you do as you are told. What if you make a decision that is against orders? It happens. People can die. This is the story of a family who suffers the consequences of that one decision. Thank you to Netgalley and Lake Union Publishing for the A.R. C."}, {"userName": "Nenette", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/2156661-nenette", "userReview": "Irony, surprises, unexpected turns. Life is full of these; individuals and families go through them, some more than others. To hurdle these obstacles, it is important to keep the lines of communication open. The Stellkellners did not know how to communicate; they only knew to be silent. It was a destructive silence. It took years, a decade even, to break that silence, and things started to turn out well when it did.On the contrary, Hamish MacCallum knew how to keep silent when it's called for. He listens, he listens, and he listens. He'll talk alright, but never to tell one what to do. He speaks more through actions, and how loud that voice was!I love Catherine Ryan Hyde's books. She writes about ordinary lives that are not so ordinary. One can unearth troves of treasures in her stories. This one here is another story brimming with gems."}, {"userName": "Richard", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/26160256-richard", "userReview": "I am a longtime fan of Catherine Ryan Hyde. Although this novel started out more slowly than others I've read, it was equally satisfying. This is the story of a dysfunctional family blown apart and the very different journeys they take to come back together ten years later. It offers helpful insights on the human need to be seen, and effective ways to deal with the big obstacles in our lives. But it's not preachy--it's an honest portrait of difficult but enduring sibling affection. I would like to add that this novel illustrates how the smallest act can have a profound effect on the life of another. Be kind, people!"}, {"userName": "Sarah", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/7515174-sarah", "userReview": "I was given an ARC of Ask Him Why from NetGalley for an honest review and this is my review.For some reason this book did not grab me as emotionally as other books by this author have in the past and it left me with a flat emotionless feeling after reading it. I am not sure if it was the topic of avoiding orders during the war or how the story was presented but I had zero connection with the two main characters who were telling the story from their perspective and I really just wanted the book to get over.However, the story did pick up a bit towards the end when things started to move along a bit faster and that is why I decided to give the book a three out of five star rating."}, {"userName": "Sandy Denholm", "userReviewDate": "Nov 24, 2015", "userURL": "http://www.goodreads.com/user/show/10841675-sandy-denholm", "userReview": "Not many books make me cry . This one did. Beautifully written and told."}, {"userName": "Judy Collins", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Lake Union Publishing and NetGalley for an ARC in exchange for an honest review.You can always expect a moving, emotional, thought-provoking, and wise message from Catherine Ryan Hyde-- woven through the eloquent words of her powerful, unforgettable novels. With ASK HIM WHY,  there is much more than good storytelling, and a powerful message--- A novel you want to dissect. A flawed broken family. Daughter, Ruth (Duck), Younger son, Aubrey (Mr. Universe), and older son, Joseph. Brad and Janet – parents. A therapist (Luanne). Mistakes are made. Strong words are said. Betrayal. Consequences. Wasted Years. A powerful bold takeaway message: Hope, redemption, and forgiveness.A stranger,  a wise unselfish man  (Hammish MacCallum)  who pulls together a lost family. A saver of lives. Don’t we all wish we had more \"Ham’s\" in this world?  It would be a much better place.Ruth, a girl caught in the middle of two troubled brothers, desperately trying to put the pieces of their lives back together, even as a grown adult. Where presumptions only serve to mislead you.Many obstacles: the war, Iraq, a mission, a cliff, expectations, media, assumptions, troubled young adults, a broken family. ASK HIM WHY is like a complex puzzle. A broken family. This family does not know how to be a family. No communication. Silence is socially acceptable. Outward appearances matter. Parents handing down bad habits to their own children. What might a real family look like? When there are no role models, bad habits continue through generations, until a disaster, a tragedy ---recalculating. Sometimes this takes an outsider, a stranger, to lead the wayward back on the correct path. Strongly reminding me of a quote, “Maybe it isn’t that we’re supposed to find the pieces and put them back together. Maybe we’re the pieces. Maybe, what we’re supposed to do is come together. That’s how we stop the breaking.”If it doesn’t fit, don’t force it. If you’re working at solving a puzzle, it is impossible to force the pieces to fit. If you try and force pieces where they don’t belong, the rounded edges will separate and crease, damaging the puzzle.While reading many books, there are those rare, intriguing few which stand out. Ask Him  is one of those. Most readers read a novel for simple entertainment. I also enjoy dissecting or understanding the inspiration behind the novel. The construction. The hidden meanings. The message.With authors in particular such as Catherine Ryan Hyde  with a long list of successful books, readers (myself included), tend to compare one novel to another. Each novel deserves to stand on its own accord. What I enjoy about Hyde and Koontz, in particular; their writing is unique, clever, original, and no one book is like the other. You see reviews all over the board. Each reader receives a different message. Sometimes there is more than the outward appearance. The obvious. It urges you to dig deeper, for the hidden meaning, the extraordinary, lingering characters remaining with you. A book written from the heart. An ideal book for young and older adults, and those in between. Powerful! Always curious how authors take a small spark of an idea, an inspiration, and build something incredible---the thought behind the masterpiece. Having read no hints about how this book came to be; I am positive Hyde has an intriguing story. I for one would love to hear it—with an author Q&A. Perfect timing  with today’s national controversial headlines of war, unrest, terrorism, suicide, bullying, and hatred. There are so many mixed messages of good versus evil. A strong novel! Ask Him Why  is a complex book, you need to think about--to ponder. It draws you in. There is a thought process. It is one of those rare books, which does not use the sensational…\"See Me\" I am great, you have to read me. It is a more slow burning, deeper novel --calling you into the wee hours of the morning. Characters, events, emotions, words, actions.There is so much depth here; however, you need to peel back the layers. You will find yourself bookmarking so many pages of beautiful prose. Literary criticism can be at times, like the focus of this novel. Judgmental. This novel grows from the inside out, full of metaphors and life lessons. Ask.  When you don’t know something, you ask. You don’t assume. No one asked for Joseph’s side of the story. No one seems curious as to why he did what he did? There are always two sides to a coin. Aren't we all guilty of doing the same? There is also Forgiveness. Some of my favorite quotes:  Ruth: “How to start the pattern of silence. So innocently, and on such a small scale, and then once you open the door for them, they barge in and take on a life of their own.” Ham: “Good to get the truth out into the air. Everything grows best in oxygen and sunlight except secrets and guilt and regrets. They like the dark spaces. Drag them out into the light and they fail to thrive.” Ruth: “No pressure, I thought. Just a dying family member with a dying wish that’s probably impossible, but it’s my job to make it come true. No worries. Happy holidays to all. I’ll do my best.”Joseph: “I learned a good lesson a long time ago, too, Mr. Universe: never assume you’ll have a million more chances.” Ham: “They didn’t get what they needed from their folks, so now they can’t give you kids what they don’t have. They’re victims and the perpetrators, both, and the cycle just keeps going around and around. And I don’t know what do to stop it, any more than anybody else does, except I just know bacon and eggs and potatoes. It doesn’t fix everything, but it makes a dent, and anyway, like said before, I can only do what I can do and no more.” “Hammy says you can’t unroll a snowball. Just like you can’t un-ring a bell. We are responsible for what we do.”Ham: \"Nothing in this life is simple. When trouble comes to the world. They try to make things black and white, but nothing ever will be. It’s where all the bad stuff gets its start. There’s the trouble people make by trying to shape the world to suit them and failing.” \"Janet and Brad broke Joseph, and Hamish MacCallum patched him up and got him halfway back together again.\" \"How would you feel it you had to wait ten and half years, for someone to, ask, why?\"\"You can heal your own self first, but most people never do. Maybe because you have to start by admitting you’re broken.\" Aubrey to Luanne: \"Sometimes I wonder why I pay you money to have this stuff shoved in my face.\" Luanne: \"If it helps to be reminded, Aubrey, you don’t pay me much.\"  The ending: PRICELESS!  Highly Recommend. “There are no extra pieces in the universe. Everyone is here because he or she has a place to fill, and every piece must fit itself into the big jigsaw puzzle.”-Deepak Chopra JDCMustReadBooks"}, {"userName": "Kathleen", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/7431593-kathleen", "userReview": "I confess that Catherine Ryan Hyde, along Fredrick Bachman, is my go to feel good author. Her books invariably involve a child/adult relationship where an important life lesson is imparted. And generally she does a pretty good job. But this story is my least favorite. Ruth and Aubrey's older brother, while serving in Baghdad makes a decision which results in the death of a couple of fellow soldiers. There is fallout for the family including coerced estrangement between the siblings. And the parents are ridiculously self absorbed and distant. But the story unfolds disjointedly. The relationships never feel authentically developed. Honestly the better story would be to have focused on Joseph's and Hamish's relationship. Because the Ruth/Aubrey story was just not compelling.Better selections of this Author's books are Take me With You, Pay it Forward and Never LetMe Go."}, {"userName": "Gina Valdez", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/5807335-gina-valdez", "userReview": "I enjoyed the wisdom and perspective brought into the story by the old man. I found his lessons valuable. I thought the whole war angle was a bit reaching. Absolutely hated the parents. This is probably best a YA fiction."}, {"userName": "Lisa", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/8044375-lisa", "userReview": "Engrossing read. It kept my interest on a long flight even though there's not much action in the book. The end was predictable and a little trite but all in all a great read"}, {"userName": "K~Terror", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/4014136-k-terror", "userReview": "Rating: 3.5 starsI'll never look at breakfast the same way. This story offered an interesting study in family dynamics and being able to see outside yourself. Lots of feels!"}, {"userName": "Shelia Clark Smith", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/48769258-shelia-clark-smith", "userReview": "Interesting family dynamics, and while this was a good read, the storyline seems a bit contrived. I would recommend this book and would rate it a solid 3.5 if that were an option."}, {"userName": "Dorilyn", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/17811114-dorilyn", "userReview": "Breakfast is always the best mealA wonderful story of judging others, ourselves & situations. There is not always someone to blame for situations; things in life just happen. Often the best way to handle them is it stop, sit down & talk to someone. Things look more manageable when we get them out of our heads."}, {"userName": "Lorilee", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/7265326-lorilee", "userReview": "Who doesn't love the old man? This was a good story and a look into a dysfunctional family that you can relate to. I love that Joe takes over for Hammish."}, {"userName": "Allison", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/10746130-allison", "userReview": "Ask Him WhyI enjoyed this book! The messages and life lessons were valuable. I love a book that makes you reflect on your own life."}, {"userName": "KathyAnne", "userReviewDate": "Sep 06, 2015", "userURL": "http://www.goodreads.com/user/show/5617494-kathyanne", "userReview": "I've read several books by this author and I love how she always finds a way to make us think about situations and people from a completely different perspective. This story really made me think about the reality of what our soldiers go through when they are deployed. From our perspective it seems so cut and dry. You go, follow orders, kill the enemy and return home with a sense of pride that you've done your part to keep your country safe. But, in reality it is much more complicated. It's not so easy to put away your moral compass as one would think. This story focuses very much on the difficulties children face growing up in a dysfunctional family. It also shows the chain reaction of withholding truths and secrets and passing judgement on others without taking the time to fully understand someone's choices and actions. And, it's also very much focused on having to face the consequences of our actions. Even when we feel like we're doing the right thing, it can lead to bad things happening anyway. The title of this book makes sense by the end of the book... it seemed like a simple question... just \"Ask Him Why\"... but, would it have made any difference? The judgement of others is hard to change once they've made up their mind. Even if it was based on assumption. Even though I loved the premise for this story and it is indeed very thought provoking, I did struggle to get through it. For whatever reason I was unable to truly connect with the characters. So, for that reason I had to settle with 3 stars because even though I liked it, I really needed to feel a more emotional connection to the story for it to truly stand out. This book would be an excellent choice for a book club discussion. I love this author and will always read anything she writes. Her book Pay It Forward was such a phenomenal story, so I can't not read a Catherine Hyde book! She is very talented at dishing out life pondering situations to make us think. Love that about her writing. ARC was provided by the publisher thru netgalleyFollow us on KT Book ReviewsTwitterFacebookPinterest"}], "description": "From the bestselling author of Pay It Forward comes the stunning and emotional story of a young soldier’s unthinkable act…and the bonds of a sister and brother’s love.Ruth and her little brother, Aubrey, are just teenagers when their older brother ships off to Iraq. When Joseph returns, uninjured, only three and a half months later, Ruth is happy he is safe but also deeply worried. How can it be that her courageous big brother has been dishonorably discharged for refusing to go out on duty? Aubrey can’t believe that his hero doesn’t have very good reasons.Yet as the horrifying details of the incident emerge, Joseph disappears. In their attempts to find him, Ruth and Aubrey discover he has a past far darker than either of them could imagine. But even as they learn more about their brother, important questions remain unanswered—why did he betray his unit, his country, and now his family? Joseph’s refusal to speak ignites a fire in young Aubrey that results in a disastrous, and public, act of rebellion.The impact of Joseph’s fateful decision one night in Baghdad will echo for years to come, with his siblings caught between their love for him and the media’s engulfing frenzy of judgment. Will their family ever make their way back to each other and find a way to forgive?", "title": "Ask Him Why", "url": "https://www.goodreads.com/book/show/25828747-ask-him-why", "average": 4.09, "cover": "https://images.gr-assets.com/books/1444707443l/25828747.jpg", "reviews": 568, "authors": [{"url": "https://www.goodreads.com/author/show/126447.Catherine_Ryan_Hyde", "name": "Catherine Ryan Hyde"}], "type": ["Fiction", "Contemporary", "Drama"], "outlinks": ["http://www.goodreads.com/book/show/25828747-ask-him-why", "http://www.goodreads.com/book/show/25526969-ask-him-why", "http://www.goodreads.com/book/show/25703895-ask-him-why", "http://www.goodreads.com/book/show/215631.Pay_It_Forward", "http://www.goodreads.com/book/show/6780660-when-i-found-you", "http://www.goodreads.com/book/show/19355355-take-me-with-you", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/33389838-allie-and-bea"]}