{"ratings": 9, "userreviews": [{"userName": "Andre Widiartanto", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/4163127-andre-widiartanto", "userReview": "Yes: setiap kata memiliki kekuatan. Ambil saja contoh kata belajar. Di Indonesia kata ini tampaknya hampir tak punya makna, atau -berkat terlalu seringnya disebut oleh orangtua kita- seakan2 kata ini menjadi momok bagi para pelajar. Seiring pengalaman saya, ada dua kata yang lebih punya kekuatan dibanding kata tersebut, yaitu kata master dan research.Mastering memiliki makna tidak sekadar belajar. Kata ini lebih bermakna menguasai. Sedangkan kata yang kedua, research, memiliki arti mencari kembali. Kedua kata inilah yang saya pikir perlu dipraktekkan oleh pelajar kita dewasa ini."}], "description": "Kita menjalani kehidupan kata demi kata—untuk membangun relasi, untuk menyampaikan pendapat, untuk menentang kekeliruan yang dilakukan terhadap kita atau orang lain, untuk menenangkan anak dan teman. Kita juga—kadang tanpa sadar—menggunakan kata-kata yang salah, membuat kita terjerumus dalam situasi yang tidak kita inginkan.Kevin Hall menemukan kekuatan lebih dalam yang terkandung dalam kata-kata. Bersama seorang etimologis ternama yang tinggal di rumah perawatan, Kevin Hall menjalani proyek yang mengubah kehidupannya, juga kehidupan ribuan pembaca. Temukan sebelas kata—juga kata rahasia—yang, saat digunakan dengan tepat, bisa menerangi jalan Anda menuju kesuksesan seumur hidup yang layak Anda dapatkan.\"Saya tidak sabar melihat respons dunia terhadap. Buku ini sangat kaya dan menawarkan imbalan besar sehingga layak dibaca berulang kali.\" —John Assaraf, penulis buku laris New York Times untuk The Answer dan guru di The Secret\"Kevin Hall menunjukkan kepada kita kekuatan kata yang menakjubkan—alat yang bisa kita gunakan untuk membentuk pemikiran dan keyakinan baru—untuk membantu kita berubah, serta menciptakan sesuatu yang lebih baik bagi diri sendiri dan planet kita.\" —Spencer Johnson, M.D., penulis buku laris nomor 1 New York Times untuk Who Moved My Cheese? dan Peaks and Valleys\"Buku Kevin Hall adalah Og Mandino untuk abad ke-21.\" —David Blanchard, CEO Og Mandino Group", "title": "Aspire: 11 Kata yang Akan Mengubah Kehidupan Anda", "url": "http://www.goodreads.com/book/show/13409249-aspire", "average": 3.78, "cover": "https://images.gr-assets.com/books/1326186896l/13409249.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/3022796.Kevin_Hall", "name": "Kevin Hall"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/13409249-aspire", "http://www.goodreads.com/book/show/6713378-aspire", "http://www.goodreads.com/book/show/26893967-tales-of-horror-on-halloween-night", "http://www.goodreads.com/book/show/10225030-words-into-flesh", "http://www.goodreads.com/book/show/34178933-brick-buildings", "http://www.goodreads.com/book/show/26020363-el-poder-de-las-palabras"]}