{"ratings": 1341, "userreviews": [{"userName": "Maryanne", "userReviewDate": "Nov 29, 2008", "userURL": "http://www.goodreads.com/user/show/643103-maryanne", "userReview": "While reading this book I kept thinking it has got to get better. That is the only reason why I finished this book."}, {"userName": "Ellen", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/5881438-ellen", "userReview": "This is only the second Tracie Peterson book I've read, but thank goodness it wasn't the first, or I'd never pick another one up again. I had a favorable response to Silent Star, so when this new series was featured at Audible for a special price, I was looking forward to it. Tying together the plantation life of pre-Civil War South and the life of the textile mills in Lowell, Mass, made this book sound interesting. Peterson boldly points out the hypocrisy of the North in their anti-slavery beliefs by shining a similar light on indentured servitude and poor working conditions of the day. As interesting as this all was, I felt the emphasis on it overshadowed the inspiration and hope promised by the title and usually delivered by Bethany House Publishers. All the social commentary would have been fascinating to me, but I couldn't bear Jasmine's plight being married to Bradley. His evil was so dank and oppressive that I couldn't even glimpse hope. People's attempts to encourage Jasmine to seek the Lord and get down on her knees and thank Him rang hollow at best. The ongoing rape of the servant girl was too much. Perhaps future books in the series will take a different turn, but I'm not likely to find out."}, {"userName": "Carolyn", "userReviewDate": "Dec 31, 2010", "userURL": "http://www.goodreads.com/user/show/3928963-carolyn", "userReview": "it was awfully depressing for a cheesy christian romance novel. And it tried to overplay the historical fiction/civil war lead up aspects of it a bit too much. You felt like the author was showing off research. Oh, and then the author tries to wrap up everything really sappily (in a badly telegraphed way) in the last 20 pages. It wasn't bad, but I've read much better."}, {"userName": "Vikki", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/41633517-vikki", "userReview": "I read the earlier books of the Lowell Series and thoroughly enjoyed them. This book came along several years later but it was great to see the story continue. I look forward to the next book in this series."}, {"userName": "Jennifer Pryke", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/40561090-jennifer-pryke", "userReview": "Stiff and stilted. Characters were one dimensional. Forced myself to read hoping it would get better. It didn't. Gave up on it halfway through chapter 19."}, {"userName": "Karen", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/1449145-karen", "userReview": "A blending of lives from three directions: a plantation in the south, the cotton mills of Massachusetts and refugees from Ireland. The story is an artful blending of all the lives into a story of hardship, pain and survival...even triumph. The southern Jasmine Wainwright, daughter of the plantation owner has her marriage arranged to Bradley Houston, the dishonest, angry and lustful Mill Entrepenuer. The potato famine in Ireland has forced the immigration of Kaira and Paddy O'Neill and their entry into indentured servanthood in the Houston household.  The story keeps moving at a good pace. There are social issues of slavery that travel through the pages. Some parts of the book are very hard to stomach because of the intensity of emotion attached to the happenings in Kaira's as well as Jasmine's life. The ending of this book is one of the best I have read in quite a while. You are left with hope and a view of God's long-term salvation and care.  I look forward to book 2 in the series."}, {"userName": "Michele", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/1065386-michele", "userReview": "A wonderful Christian novel set both on a Mississippi plantation and in Lowell, Massachusetts. Jasmine is the daughter of a cotton plantation owner whose father sees a business opportunity to increase his cotton sales profits by arranging her marriage to a certain businessman, Bradley. In Ireland, Kiara and her young brother are orphaned by the famine and are sold as indentured servants. They are sent to America and end up in Bradley/Jasmine's household. Both women become victims of a cruel and demanding Bradley. The story follows how these women try to cope with him and what he does to them. As they run from God, God quietly shows them how to persevere and even triumph.It is not altogether a happy book but one that shows the struggles these women endure. It also highlights the evils of slavery."}, {"userName": "Jo", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/9843773-jo", "userReview": "I enjoyed the book in the main but there were occasions where it felt like the story jumped about a bit and this affected the flow of the reading. This was exacerbated by the poor formatting of the e-book with no evident divisions between location/time changes and paragraphs split unnecessarily and confusingly across multiple lines."}, {"userName": "Karen Reeves", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/36047283-karen-reeves", "userReview": "It was hard to read because we would think Jasmine would have other options. Realistically she would have very few and maybe her perception of inner peace and joy could have been better represented instead of a slow pace up an impossible mountain of no worldly content. But we felt for her strife so continued to read. It ended well and I'll say no more or the book would be spoiled."}, {"userName": "Mary Schenk", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/57396929-mary-schenk", "userReview": "This so far is not my favorite Tracie Peterson book, however it was still worth reading! This story was not a fairy tale Happy ending book it had real depth. I'm just not a fan of the chracters and it took awhile to get into!"}, {"userName": "Mary", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/48889066-mary", "userReview": "The love of GodThis book reminds us that when we go through the most difficult times we still need to trust in God. This story highlights the true nature of man both the good and the evil."}, {"userName": "Cynthia Childress", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/79095712-cynthia-childress", "userReview": "The Lights of Lowell series was EXCEPTIONAL. I think I finished the entire series in just a couple of weeks - woven with love, faith, even a bit of suspense, Tracie's books take me back in time and are so descriptive. I find myself hearing the voices of the characters speaking in their native dialect and seeing the emotion on their faces through their times of triumph and trial. I have thoroughly enjoyed reading Tracie's books and haven't found one that I have not appreciated."}, {"userName": "Michelle Robinson", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/3485266-michelle-robinson", "userReview": "Bradley is so despicable and he dominates so much of this book, I am having a really hard time completing it.There are so many issues with this book. That the true featured character is a rapist who rapes his victim repeatedly throughout the book and that was a bit too much to bear. I am sure that indentured servants were treated brutally by some of the people who held their indentures, it was still overwhelming to read of the repeated rapes when one is not expecting that kind of content. When I read Christian fiction, I am expecting a lighter not so depressing storyline.Another issue that I had is that when the girls began to get sick while working in the mills, the real historical reasons for the illnesses was overlooked. Mill workers did indeed die and get sick during this era of time. It would have been nice to see the author incorporate the real causes of deaths into her retelling. I like poetic license but this was an important issue in history and I wish it had been handled better.I also felt that slavery was a little like window dressing in this novel. It seemed as if the author was loathe to really decry the practice in any meaningful way. She wanted to underscore the hypocrisy of northern states benefitting from slavery more so than she wanted to deal with what an abomination slavery was. I imagine the author is either from the South or is somehow connected to Southern sympathizers who enjoy revisionist versions of history.I have never read a book by this author before and this was so unremittingly depressing that I cannot imagine reading another. I also agree with forgiveness but putting the onus on a rape victim to feel any certain way about her rapist is too much for me to swallow."}, {"userName": "Stephany", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/2746453-stephany", "userReview": "Tracie Peterson is one of my favorite Christian authors. She writes historical Christian fiction and I do think she writes a lot more accurately than many historical fiction romance writers. The characters feel more real and dynamic. (And not everything is about sex and balls!)This book is about Jasmine, who is the only daughter of a slave owner. She has a slew of older brothers, a depressed mother, and a father. Her father is a businessman but also dotes on Jasmine. One day, two men come to visit: Bradley and Nolan. Bradley is a businessman, working in Lowell where he helps with the factories. Nolan is his younger brother who is a writer. At the beginning of the novel, you want Nolan and Jasmine together. They are a perfect fit!But Bradley and J's dad enter into an agreement together and she has to marry Bradley. Bradley is a mean son of a gun and makes Jasmine feel lower than she deserves. He is not a nice man. As the book progresses, you see Jasmine grow up, both in age and in maturity. She begins to see how wrong owning slaves truly is. She also begins to mature in her faith, even when her days seem too dark to imagine.This was a great book, and one I will definitely read again and again."}, {"userName": "Kathryn", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/1329275-kathryn", "userReview": "when 18 year old jasmine finds herself in an arranged marriage to better the position of her family she tries to persuade her father to break the contract, but to no avail. She is married to Bradley, who is 38, a businessman who later cheats her father and other southern cotton growers out of money and into his own pockets. He is cruel to Jasmine expecting her to do his bidding and help with his social standing by getting out with the \"associate\" wives. She bears him a son and thinks that finally she has done something right, but again his business practices come back to haunt him. Jasmines father, Malcolm Wainwright comes to Lowell (the north) to see why he hasn't received correspondence concerning his plight with the cotton problems and suggests some responsibilities get shifted where Bradley is concerned. Meanwhile, Jasmine has befriended the Irish endentured servant, Kiara. They both learn to trust in the lord even when sorrow still follows."}, {"userName": "Susan Tietjen", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/18824716-susan-tietjen", "userReview": "I enjoyed the book and read it to the end, but I had some difficulty with Jasmine's character. I did like that she grew throughout the book and began to see the world the way it really was back then. She also lived in a time that was difficult for women. My problem was that we had to \"see\" more than just suggestive scenes of rape on the Irish house servant by Jasmine's vicious husband, but the same man who didn't own Jasmine but wanted to dominate her, would in real life have been just as brutal to Jasmine during their \"honeymoon\" and yet that part of their relationship isn't even addressed. The author did a great job making me hate her husband, and I was glad that she was finally able to find happiness at the end, but I had a hard time believing that someone wouldn't have caught onto him and both his abusiveness and his criminal behavior sooner."}, {"userName": "Kristina", "userReviewDate": "May 26, 2009", "userURL": "http://www.goodreads.com/user/show/1293215-kristina", "userReview": "The villain of this one seemed a little too outlandishly evil, without there being a particularly good reason. At the end of the book, everyone is encouraged to forgive him for all he has done wrong, pointing out that he wasn't always a bad person. But we have no explanation for why he turned out to be such a complete a-hole, other than \"responsibility made him grow up too fast.\" I don't particularly buy that, but whatever. Anyway, I didn't love this book (nothing unintentionally funny here, as in the last Petersen book I read), but it was fine for a quickie read. Unfortunately there are two sequels, which I suspect I will end up reading, only because there seems to be some unfinished business."}, {"userName": "Katrina Swaim", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/12179893-katrina-swaim", "userReview": "I'm not always impressed with Christian fiction, despite being a Christian myself, but I quite liked this Civil War era historical novel about the struggles of two women caught up and trapped in the power dynamics of a society still very much enmeshed in racial and gender inequality. I was impressed by the heroine's spirit, even in her submissiveness to those who had power over her. From my comfortable seat in 2016, it's easy to say that I would have defied my father and let my family bear the financial consequences, but I can see how she felt like she had no choices. I definitely came to care about the characters and what happened to them. I plan to pick up the next book in the series soon."}, {"userName": "Nikki Morton", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/43641357-nikki-morton", "userReview": "This is a tough book to review...Overall I liked the historical content as well as the Christian themes throughout. It was admittedly tough to see any light in Jasmine's situation, and I kept hoping for a way out for her. Her personal growth by the end of the book was a positive, though.I really liked Kiara and Paddy. Seeing the struggles they endured and how their stories turned out was certainly emotional.I think there are better things to come for these characters in the next two books of this series."}, {"userName": "Elizabeth", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/43119873-elizabeth", "userReview": "It was okay. Certain aspects of it I liked, whereas others I did not. It is pretty dark for Christian fiction, but I actually enjoyed how nothing was sugar coated. The characters were another story; I just didn't feel invested in any of them, I didn't really care what happened to them. Also, I felt the plot, though interesting, was a bit too predictable. Despite the mixed feelings, I will probably read the rest of the trilogy, as I thought it was alright and I can't stand to leave one unfinished."}, {"userName": "Rev. Linda", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/11359949-rev-linda", "userReview": "Another beginning to a series by my favorite Christian author, Tracie Peterson. Not a new one...written during one of my academic pursuit times when I was studying instead of pleasure reading. This one deals with the connection between the Lowell textile mills and the Southern plantation supplier of cotton. The husband in this was was a real jerk, so the ending was a surprise but satisfying...we reap what we sow. Ready to move on to the next one in the series, A Love Woven True."}, {"userName": "Dorothy Beer", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/51917272-dorothy-beer", "userReview": "A Tapestry of hopeAn enjoyable story. Makes one happy to grow up in a time when marriages are not decided by parents for financial or social gain. Also slavery and indentured servitude we're definitely not an admirable way of life. This book portrayed both cruel and kind individuals. Luckily even most working conditions have improved over the years. I would give this book 5stars"}, {"userName": "Samantha Westrick", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/36542249-samantha-westrick", "userReview": "I didn't mind this book too much until the last third, when it started getting extremely religious. I wasn't aware that this was a Christian novel, and although I am religious myself, I felt that in this case the author used it to wrap up the story neatly and to weaken the main character. It also felt particularly dated, like it was trying to preach the particular values held back in the time of the Civil War."}, {"userName": "SJ Garrison", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/47550206-sj-garrison", "userReview": "Even in all the cruelty's of life there's HopeThere was a lot of cruel evil twists from a man who sought wealth over love, but through God's word the women grew in the Lord and found hope when there seemed to be none. I stayed up late into the night to read chapter after chapter. But when I got to the last chapter I didn't want the story to end. I'd recommend this book to anyone that loves Christian story."}, {"userName": "Linda *Rapunzel*", "userReviewDate": "Dec 21, 2009", "userURL": "http://www.goodreads.com/user/show/2745354-linda-rapunzel", "userReview": "This book is amazing! It will make you mad, sad, happy, and many more emotions. The time is back when there were slaves, before women voted, and when the North wanted the South to stop trading cotton with England. I think everyone should read, but it is more better for girls to read. Everyone knows that I hate Bradley, but the ending is the best part of the book. Read it and it will make a difference about how everything is different now."}, {"userName": "Dee Renee  Chesnut", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/1253107-dee-renee-chesnut", "userReview": "This ebook was free when I downloaded it from Barnes and Noble to Nook library. For readers of historical Christian fiction genre, this book will do. I was disappointed because the synopsis of the story was better written than the book. The characters are flat. I recommend it only to fans of the authors."}, {"userName": "Shavavian Allister", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/41067520-shavavian-allister", "userReview": "I liked this book. Although the main character started off seemingly a bit flighty and naive (not by her own fault), she grew into her own and I ended up liking her. I hope in the next book she's a strong heroine. The topic of slavery was in here, but not a focal point...which seemed odd because it was talked about as though it WAS a focal point, if that makes any sense."}, {"userName": "Niki", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/9539332-niki", "userReview": "I thought this book was easy to read and enjoyable. I enjoyed the story line of characters from Ireland and characters from the south. I liked reading about the relationships and the struggles that the characters had to overcome during their lifetime."}, {"userName": "Kelly Willing", "userReviewDate": "Sep 05, 2016", "userURL": "http://www.goodreads.com/user/show/57411725-kelly-willing", "userReview": "Good but hard to read The story and characters were ok but the ebook was poorly edited. Paragraphs and sentences were split or run together so often it was hard to follow the story."}, {"userName": "Phycilla Gable", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/41831150-phycilla-gable", "userReview": "Amazon reviewReally great book with an interesting plot, lots of great characters, and a story of finding faith and dependence on God when the going gets tough. A story of both love, happiness and sadness and coming out on the other side."}], "description": "Lights of Lowell book 1. Tapestry of Hope weaves together the heartrending and hope-building stories of two young women. Jasmine Wainwright is the sheltered daughter of a Mississippi plantation owner. When her father strikes a deal to sell his cotton to Lowell mills through businessman Bradley Houston, he throws an arranged marriage with Jasmine into the bargain. Kiara O'Neill and her brother escape starvation in Ireland by traveling to America as Bradley Houston's indentured servants. But Bradley has more in mind for Kiara than she wants to imagine. Both women suffer in the home of this unloving husband and merciless master. Will God somehow bring hope to their lives?", "title": "A Tapestry of Hope\n      \n          (Lights of Lowell #1)", "url": "https://www.goodreads.com/book/show/162036.A_Tapestry_of_Hope__Lights_of_Lowell___1_", "average": 3.92, "cover": "https://images.gr-assets.com/books/1422417517l/162036.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/27788.Tracie_Peterson", "name": "Tracie Peterson"}, {"url": "https://www.goodreads.com/author/show/206097.Judith_McCoy_Miller", "name": "Judith McCoy Miller"}], "type": ["Christian Fiction", "Historical", "Christian", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/162036.A_Tapestry_of_Hope", "http://www.goodreads.com/book/show/19075479-a-tapestry-of-hope", "http://www.goodreads.com/book/show/9367292-a-tapestry-of-hope", "http://www.goodreads.com/book/show/360019.A_Lady_of_High_Regard", "http://www.goodreads.com/book/show/1742094.A_Daughter_s_Inheritance", "http://www.goodreads.com/book/show/227898.Land_of_My_Heart", "http://www.goodreads.com/book/show/6372454-dawn-s-prelude", "http://www.goodreads.com/book/show/15726455-the-icecutter-s-daughter"]}