{"ratings": 124, "userreviews": [{"userName": "Chrissie", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Haven't you seen CNN reportage documentaries starring Christiane Amampour? Well then you have an idea of the feel of this book. It is thorough, filled with history and geography and it focuses on political issues. The focus is much more political than cultural. How can you expect otherwise when dealing with an ethnic group that has over the centuries been decimated, split and torn by inner and outer violence. If you ask someone to tell of their life, you will soon be hearing about the violence they have survived. One hardly can concentrate on marital ceremonies, poetry and myths and food traditions when there are more vital things to mention. This book offers both, but much more time is spent on the politics, because for these people politics is a matter of survival.The author during 2002, before the Iraq war of 2003, traveled through the four countries of Greater Kurdistan, Turkey, Iran, Iraq and Syria to talk with the Kurds. She talks to the people and tells you their stories. She fills in with history and information about the geographic sites she visited. You are told what the people wear, what cars they drove and what they ate and drank. (It feels like a TV reportage!) You get the dates and measurements. How many square meters is Lake Van? You will be told. OK, what I am saying is that sometimes the details get a bit excessive. You meet many people, all the ones she has talked with and interviewed, but perhaps a little more depth with a fewer number of individuals might have given more. All these people, for me they turned in to a bit of blur. Still, I learned a lot and it was a very informative book! Please note that the book was published in 2004, so much has happened since then. I still feel to understand the present you need the history of the past first.Suzanne Toren reads the audiobook, and as usual does a magnificent job. She speaks clearly and slowly so you have time to absorb the facts."}, {"userName": "Ariane", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/3598401-ariane", "userReview": "This is my first book on Kurdistan. I really want to love it because I'm curious about the history and culture of the Kurds. Plus it is written in my favorite way of learning about a place, through the stories of its people. I appreciate the great deal of information I learn from this book, especially the author's coverage of the minorities: Yezidi, Ahl-e-Haqq and Alevi. However Bird's narrative fell flat to me, and I can't help but notice the unmistakable sense of entitlement and judgment in her tone as a privileged white. They are occasional, but nonetheless a turnoff."}, {"userName": "Jaclynn", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/14115149-jaclynn", "userReview": "100% recommended! I absolutely could not put this down. I have always heard about the Kurds on the news but I didn't really know who they were or what their issues as a minority were. Honestly, I wasn't even sure where exactly the Kurds were, and independent research into the subject was always so confusing. I didn't think that anyone could sort out their history and current struggles so simply. Bird is an absolute genius, and writes without pretension. This is a straight account from a woman who spent time in Syria, Iraq, Iran and Turkey herself. Written from a woman's perspective was especially interesting for me as she had insights into Kurdish women's struggles that a male author might never have been able to unearth.Breaking this down by the countries where Kurds currently live and having witnesses build the narrative through their individual stories make this a much more approachable book that you would expect."}, {"userName": "Cyrus Samii", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/68137434-cyrus-samii", "userReview": "The genre is journalistic travelogue with light ethnography. In those terms I found it to be an enjoyable and educational journey, traveling city st a time through Iraqi Kurdistan mostly, with brief jaunts through Kurdish areas in Iran, Syria, and Turkey. At times Bird slips into some grimace-worthy neo-Orientalist essentializing about traits of Kurdish societies, but I was willing to let it go as otherwise her rendering of points of view, folklore, and conventional wisdom in Kurdish society were quite illuminating."}, {"userName": "Roger Bailey", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/2578079-roger-bailey", "userReview": "For more than half way through this book reads like an extended National Geographic article. That is, the author traveled through Kurdistan talking to and interviewing people and reports back on those conversations and interviews focusing mostly on cultural matters. That is not uninteresting. As a matter of fact, I do read National Geographic now and then even if not every month. It just is not anything spectacular. That means that for the most of the time I spent reading this book I thought I was going to give it three stars. Simple travelogs just don't rate more than that to me. However, sometime well after half the book was through, but not so far past the halfway mark that it is insignificant, the focus turned to the oppression that the Kurds suffer under and their fightback. That is, it became much more political and political from a rebellious, if not revolutionary, perspective. That is of considerable more interest to me than a travelog and I became inclined to rate it four stars. Unfortunately, the four star rating was weighed down by the rather long travelog section of the book. That means that on the whole I wanted to rate it somewhere between three and four stars, but I had to choose between one or the other. After some consideration I decided that it leaned more toward four rather than three stars, but only barely."}, {"userName": "Elisabet Cairo", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/11109516-elisabet-cairo", "userReview": "I find this book quite informative since I am interested in the plight of Muslims and the history of the Middle East. It helps me to understand the people that have a connection to Islam, although I am finding that many times culture overrules the actual religion giving outsiders a misinformed view of true Islam. I also now understand the connection between Saddam Hussein and his attack on the Kurds and the \"Food for Oil\" program that resulted in large nations stealing money from the Kurds. I was inspired by what the Kurds have had to endure and how strong a human can be in the face of persecution. Given where the world is heading, I hope I can be as strong as the people in this book when it is my turn to show endurance."}, {"userName": "Yoonmee", "userReviewDate": "Sep 12, 2011", "userURL": "http://www.goodreads.com/user/show/265156-yoonmee", "userReview": "I didn't know much about the Kurds prior to reading this book, so this was definitely an eye-opener. A great introduction to the Kurds, sometimes it gets a little bit slow, but, hey, Kurdish history is long, there are many tribes and several different countries. One very interesting thing is that Bird was allowed access into the male world forbidden to Kurdish women simply because she is a Western woman. I wish she would have spent more time speaking and interacting with females, though. Oh well. It's still a very well-written book. The only annoying thing is that she mentioned everyone's English ability, as if the reader cared."}, {"userName": "Christopher", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/970274-christopher", "userReview": "I wanted to *love* this book-- but I did not. Even though I live in work in Kurdistan, and spent a year of my life learning the Kurdish (Sorani) language, this book was rather laborious. Not a compelling read. There were some parts, here and there, which were good. The chapter on the Yezidis, for example, was good. But not great. And it's too bad, because I do think that the subject matters, the settings, and the people are all very interesting. But this book just fell flat, at least for me, even though I wanted it to be so great and really hoped it would get better. So pehaps that's it: expectations disappointed. Three stars, at best."}, {"userName": "Melissa", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/5914951-melissa", "userReview": "So you hear about the Kurds on the news but you don't really know who they are or what their issues as a minority are. This book - through stories by Kurdish people from give an overview of their history struggle of the Kurdish people over the past century. Sometimes difficult to to comprehend the suffering but not a difficult read. Breaking this down by the countries where Kurds currently live and having witnesses build the narrative through their individual stories make this a much more approachable book that you would expect."}, {"userName": "Dorothea", "userReviewDate": "Jul 29, 2007", "userURL": "http://www.goodreads.com/user/show/117511-dorothea", "userReview": "Christiane Bird has given me new insight into the Kurdish people of the Middle East. The Kurdish people are a distinct ethnic group with their own language and ancient cultural heritage and are quite separate from the Arab people of Iraq and Syria, the Persians of Iran, and the Turks. This book was very informative, descriptive, and in light of today's political climate serves as a warning against taking these courageous people for granted as they are seeking to establish democracy among themselves inspite of centuries of persecution, tyranny and tribal divisiveness."}, {"userName": "Alesa", "userReviewDate": "Oct 24, 2010", "userURL": "http://www.goodreads.com/user/show/889171-alesa", "userReview": "I LOVE this book! I've read most of it twice. It's the very best book out there about the modern Kurdish people. Bird is a sensitive, caring traveler, who notices every detail. She also condenses Kurdish history very well. Anybody who has even a slight interest in the Kurds, or modern Iraq, Turkey or Iran, needs to read this book. I was shocked, in fact, that it was not available anywhere in Kurdish Iraq."}, {"userName": "Irfan", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/11273158-irfan", "userReview": "Terrific read. Highly recommended."}, {"userName": "Martin", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/12138885-martin", "userReview": "Really interesting in places. Would like to read an updated version to read how life is for the Kurds a decade on."}, {"userName": "Leila", "userReviewDate": "Mar 18, 2007", "userURL": "http://www.goodreads.com/user/show/30646-leila", "userReview": "This book was written by my friend Christiane who traveled to all four Kurdistans in order to write it."}, {"userName": "Kali", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/9661344-kali", "userReview": "3.5 stars"}, {"userName": "Matthieu Miossec", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/13744538-matthieu-miossec", "userReview": "Excellent."}], "description": "Though the Kurds played a major military and tactical role in the United States’ recent war with Iraq, most of us know little about this fiercely independent, long-marginalized people. Now acclaimed journalist Christiane Bird, who riveted readers with her tour of Islamic Iran in Neither East Nor West, travels through this volatile part of the world to tell the Kurds’ story, using personal observations and in-depth research to illuminate an astonishing history and vibrant culture. For the twenty-five to thirty million Kurds, Kurdistan is both an actual and a mythical place: an isolated, largely mountainous homeland that has historically offered sanctuary from the treacherous outside world and yet does not exist on modern maps. Parceled out among the four nation-states of Iraq, Turkey, Syria, and Iran after World War I, Kurdistan is a divided land with a tragic history, where the indomitable Kurds both celebrate their ancient culture and fight to control their own destiny. Occupying some of the Middle East’s most strategic and richest terrain, the Kurds are the fourth-largest ethnic group in the region and the largest ethnic group in the world without a state to call their own.Whether dancing at a Kurdish wedding in Iran, bearing witness to the destroyed Kurdish countryside in southeast Turkey, having lunch with a powerful exiled agha in Syria, or visiting the sites of Saddam Hussein’s horrific chemical attacks in Iraq, the intrepid, insightful Bird sheds light on a violently stunning world seen by few Westerners. Part mesmerizing travelogue, part action-packed history, part reportage, and part cultural study, this critical book offers timely insight into an unknown but increasingly influential part of the world. Bird paints a moving and unforgettable portrait of a people uneasily poised between a stubborn past and an impatient future.From the Hardcover edition.", "title": "A Thousand Sighs, A Thousand Revolts: Journeys in Kurdistan", "url": "http://www.goodreads.com/book/show/371484.A_Thousand_Sighs_A_Thousand_Revolts", "average": 3.91, "cover": "https://images.gr-assets.com/books/1320540956l/371484.jpg", "reviews": 16, "authors": [{"url": "https://www.goodreads.com/author/show/27530.Christiane_Bird", "name": "Christiane Bird"}], "type": ["Nonfiction", "Travel", "History", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/371484.A_Thousand_Sighs_A_Thousand_Revolts", "http://www.goodreads.com/book/show/7081784-a-thousand-sighs-a-thousand-revolts", "http://www.goodreads.com/book/show/161533.Neither_East_Nor_West", "http://www.goodreads.com/book/show/7875649-the-sultan-s-shadow", "http://www.goodreads.com/book/show/83922.Below_the_Line", "http://www.goodreads.com/book/show/1049998.Moon_Handbooks_New_York_State", "http://www.goodreads.com/book/show/599262.The_Da_Capo_Jazz_And_Blues_Lover_s_Guide_To_The_U_s_", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}