{"ratings": 5781, "userreviews": [{"userName": "Lena Morrison", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/28404981-lena-morrison", "userReview": "I have this book marked under Christian fiction, but I'm not sure if it should be. God was mentioned only once and Jesus never was. There were very few mentions of faith-related subjects.I read this book for the first time four years ago. I really liked it then, but I don't really like it now. I don't dislike it, I just think it's okay. My main reason for giving it the rating I did had little to do with it not having much about Jesus in it. Karen Kingsbury is a Christian author, but I guess she didn't want to incorporate faith in Jesus in this novel. The reason I gave it two stars instead of more is because it was so terribly cliche. It was a typical romantic inspirational novel through and through. Examples: You had two people who did not want love, who then fell in love. They had their own agendas, but of course they didn't matter anymore once they met. Ali was a dying fighter, Cody an angry cowboy. They kissed a lot before actually committing to one another. They had the \"sort of love most people never have.\" Once Ali was dying, she asked Cody to remarry. She told Cody that she would live on even after she died. There were too many cliches for my taste, and that dropped the rating way down. The writing was well done, except for the annoying dramatic one-liners that were dropped in here and there. I like Karen Kingsbury, but I know she is capable of better than this. On the bright side, there were a few sweet moments and touching lines. I learned a little about the rodeo culture. But other than that, there wasn't much to be excited about."}, {"userName": "Brittany", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/1496920-brittany", "userReview": "How would you deal with your dad leaving when you were five and saying that he is never coming back? well Cody Gunner didn't take it very well and struggled with anger. He thought he would never love again. Karen Kingsbury's A Thousand Tomorrows was an amazing and very interesting book. There are five characters but Cody's dad walked out in the beginning so it doesn't say much about him. Cody has a brother named Carl Joseph, he has Down Syndrome. Cody's mom is a loving mother that was left alone to take care of Carl Joseph and Cody. Cody was mad at his mom cause he thought that she was part of the reason why his dad left. Then later in the book he decided to start riding bulls to relieve the anger and he meets Ali, a mysterious barrel racer. Cody looked up to his dad, he played NFL football for the Atlanta Falcons but got hurt so that ended pretty fast. When they had Carl Joseph, they knew he was different from their first son but then they figured out he had down syndrome. His dad started to leave a lot and wouldn't come back for a long time but one day he wanted to leave for good so he went home and packed his bags. He looked at Cody's mom and said that he couldn't be a father to Carl Joseph. Cody begged his dad not to go but he wouldn't listen. Cody became very angry and didn't love anyone except Carl Joseph. Then one day he finds a way to relieve his anger, bull riding. When he was riding the bull, he wasn't fighting to stay on the bull, he was fighting his dad. He became the best bull rider there was. During all the rodeos he noticed Ali Daniels. She was a barrel racer and just like Cody, she was one that couldn't be beat. Then Cody and Ali start hanging out and talking. Cody starts to notice that Ali is always coughing and she always seems to be sick. One night Cody asked Ali about it and she told Cody her secret that she thought she would never tell anyone, she had Cystic Fibrosis. They became very close and it wasn't hard to tell that they fell in love. When they finally figured out that they couldn't live without each other, they get married and live on Ali's ranch. During all this Cody's dad decided that he was wrong and moved back to live with his mom and Cody wouldn't have anything to do with him. One day Ali goes for one of her check ups and they tell her that she only has one option and that is to get new lungs. So Cody and Ali's dad end up giving her one of their lungs. The operation went great but not to long after, she gets sick again. Does Cody ever forgive his dad? What happens to Ali? is she out of options or do they find a way to save her? To find out you have to read this book. I really did enjoy it and i think you will to. If you love this book you have to read the second book, Just Beyond The Clouds."}, {"userName": "Kelvey", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/37589734-kelvey", "userReview": "I have to admit that I don’t really like Karen Kingsbury’s novels. But, I saw this one on my mamaw’s bookshelf and the rodeo aspect caught my eye. Although I enjoyed it, I doubt I would read it again. When I finished the book, I felt like nothing happened although quite a bit did. Ali and Cody’s relationship was too fast-moving for my taste, and was kind of cheesy in some parts. I felt like it could’ve been handled better and that would’ve made their relationship more relatable and realistic. The part of the book that I enjoyed the most was Ali’s perspective. Her dealing with cystic fibrosis was fascinating–not to mention she was a barrel racer! I learned a lot about cystic fibrosis, and what people with that disease have to deal with on a daily basis. When Cody finally forgave his dad, I had some issues with it. He gave Ali all the glory to him “learning how to love” and “he couldn’t let go of all his anger if it wasn’t for Ali”. When really, it was God. We had no scene where Cody asked God for forgiveness, and that really bothered me. Ali couldn’t have done that; only God can help you truly let go of the bitterness you’ve held for years. Although I had issues with it, I did enjoy the story! I’m going to give A Thousand Tomorrows by Karen Kingsbury 3.5/5 stars.*I was not sent this by the publisher or author for review. All opinions are my own. I was in no way compensated for this review."}, {"userName": "Kw", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/2206216-kw", "userReview": "I read this sweet beautiful sad book this afternoon. I canhardly wait to read more Karen Kingsbury books."}, {"userName": "Nadwa", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/49603341-nadwa", "userReview": "Warning: Proceed with caution, I'm suffering a tremendous book hangover at the moment.  Yes, I finished this in a day. And surprisingly; No, I don't regret it. This book made me believe that eyes were made for a sole reason: Sobbing. And no, I don't mean casual sobbing, I mean sobbing-your-eyes-out-until-your-eyelids-are-swollen-PURPLE kind of sobbing. I don't understand why or how I bought this book. It was released eleven years ago, it was set in the 90's, it's old-fashioned, categorized as \"Christian Fiction\" (I'm not even Christian), and it's written in 3rd person (which isn't actually an issue, but i usually prefer 1st person). But  Oh My God, I'll be damned if I said this didn't hit me, hard.And the \"Christian Fiction\" part? I think I understand why it's categorized as such;In contemporary novels, the main characters (aka lovers) are usually all over each other from the first page, mind you. And I love how the writer here was so respectable of Cody and Ali's make out scenes that stop being described when stuff get 'steamy'. And I'm not saying that 'steamy' is bad or not favored (I mean, who doesn't love 'steamy' from time to time ;)?), I'm just saying that she sort of gave the couple 'privacy'. And let me tell you, this made their relationship so pure and chaste and sacred. Now, back to the novel. Flesh had failed Ali Daniels. But love never did; it never would. No matter how far the years took him from Ali's life, her love would live on.Because it lived on in him. I don't understand how such simple vocabulary can set up such an epic novel. It was inspiring; how the author wrote this. And I'm sure it was far from being easy. And I'm also certain that this is the proficient way of storytelling. Karen Kingsbury is definitely an author you should look out for. And she's someone I should probably thank; I stumbled upon this book by utter chance, and I'm gratful I did, for I would have never picked a book of this genre.I have never read much about familial love as much as I did here. The sacrifices, the love, the nurture, they were all extraordinary. In all the previous books I've read, the protagonist usually waits, in anticipation, to turn eighteen so they could run away from their parents, they usually show us how  annoying  their mother is, or how drunk their father is. This book had such a great impact on me, one I can't begin to describe."}, {"userName": "Jerry", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "[, not to mention that a character dies from cystic fibrosis in the last pages. (hide spoiler)]"}, {"userName": "Victoria", "userReviewDate": "Apr 11, 2010", "userURL": "http://www.goodreads.com/user/show/1987383-victoria", "userReview": "While this book did help me learn more about cystic fibrosis, this was about the only thing I liked about it. it included an unbearably unrealistic love story. Also, I was disappointed that Cody never found true forgiveness, the kind that comes only through the cross. Cody only found a sort of pseudo-forgiveness from the change Ali brought in his life. As I said, the love part was sadly unrealistic and shallow (I skipped some parts I didn't feel the need to read) considering Cody's past. I found the book as a whole to be hardly more than shallow fluff."}, {"userName": "Gwynette Koch", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/34805058-gwynette-koch", "userReview": "Personal Response:\tI give this book 5 out of 5 stars. I enjoyed the romance in this book. I love Cody’s character because of how in love he is with Ali. He gives up his dream of bull-riding to be with her, and he even gives her one of his lungs to help her live only three more years. The author kept my attention throughout the entire book which is why I read it so fast. I could not put this book down. I would definitely recommend this book. Plot:A Thousand Tomorrows is a Christian fiction novel by Karen Kingsbury about a professional bull-rider named Cody Gunner. He started riding bulls when he was in only seventh grade. He was amazing from the beginning, because his anger toward his father fueled his rides. His father abandoned him when he was a little boy. One day while Cody was on a pro-rodeo tour, he caught a glimpse of the top barrel-racer on the tour, Ali Daniels. He noticed that she was holding her breath while racing so he talked to her after she was done. They started to talk more and more. They talked in private because gossip traveled fast on the tour. Before long, they fell in love with each other, so Ali decided she should tell Cody why she held her breath while she raced; it was because Ali had a lung disease called cystic fibrosis. The disease did not bother him, so he asked her to marry him, and she said yes. Shortly after their wedding, Ali got much worse, and had to stop racing even though it was her dream to win a national championship. She needed a lung transplant which required two live donors: her father and her new husband. The transplant would add three more years to her life if all went well with the surgery. During those three years, Cody quit the tour and worked at Ali’s family’s ranch. He spent all of his time either working on the ranch or inside with Ali. Once the three years were up, Ali made Cody promise to remarry. After much reluctance, Cody agreed he would. Soon after, Ali died in his arms. About six months later, Cody knew that the only way he could deal with all of his sorrow was to climb on top of a bull’s back, so he went back to riding bulls, and eventually he made peace with it. Characterization:\tCody Gunner is a talented bull-rider who keeps all of his emotions inside of him. He fuels all of his anger on the bull when he rides. He meets his future wife on one of the tours; a barrel-racer named Ali Daniels. Throughout his marriage with her, he is extremely caring and sweet. Cody even gives up one of his lungs for her to live just three more years. He sticks by her through her entire sickness, even when he knows that she is going to die. After she dies he goes back to bull-riding but instead of using his anger to fuel his bull-riding, he focuses on his sorrow to fuel it. Setting:\tThe majority of this book takes place in present-day Colorado; however, the rest of the book takes place at multiple different cities where Cody and Ali compete in rodeos. The reason that the setting of this book plays such a big role is because Ali lives on a big ranch near the Rockies so her and Cody can ride horses and go for walks together. Another reason that Colorado plays such a big part in this book is because Ali goes to the University of Colorado Hospital in Denver, because it has a very good doctor there who knows how to take care of her disease. Audience:\tThis novel would be appropriate for mature audiences (14+) who like romance books that include horses and rodeos. This book would most likely be more enjoyed by females due to the romance aspect of the novel. The reason that I would recommend this book to mature audiences is because of the adult situations in the book. There is no inappropriate scene between Ali and Cody which is why I said 14+ for the audience."}, {"userName": "Elizabeth", "userReviewDate": "Mar 06, 2009", "userURL": "http://www.goodreads.com/user/show/1490295-elizabeth", "userReview": "March 7, 2009 In \"A Thousand Tomorrows,\" Karen Kingsbury tells the powerful story of two young people, both with different personal problems, who become best friends and eventually fall in love.Kingsbury, “America’s favorite inspirational storyteller,” captured me the moment I read the synopsis on the back of the book.  Cody Gunner, one of two main characters, lived a difficult life. When Cody was only eight years old his father, an ex-professional football player, left his family because his younger brother was born with down-syndrome. After deciding to never touch a football again, Cody took up bull riding, where he could unleash all the anger that had built up over the years. Ali Daniels, the second of the main characters, is one of the best barrel racers in the circuit, but must keep a huge secret from everyone other than her parents. Although she struggles with the situation, Ali continues to persevere and risks her own life to reach her lifelong dream – a national championship. Ali and Cody meet one day at a rodeo and, eventually, form a strong friendship and realize that they have much in common. After only a few months each one knows about every struggle the other faces. Each day the two begin to fall more in love, and later Ali’s secret begins to threaten her life. Cody must then make a heart-wrenching decision: keep bull riding and hope Ali gets better or stop and physically help save his first and only love’s life. This book was an easy, yet captivating read. Kingsbury had me hooked from the first page, and her realistic details and imagery made me feel like I was a part of the book. I, personally, enjoy watching bull riding, so when I saw the words “a talented cowboy” on the back of the book, I knew it was one I wanted to read. Although it was rather short,Kingsbury described each situation so well that after reading a few pages I was careful to read every word so I would not miss anything. Not only is \"A Thousand Tomorrows\" a story involving rodeo and young adults, but is a magnificent love story about perseverance, forgiveness, and making sacrifices for those that you love.  For those who are fans of Karen Kingsbury, this book is a must. Even though I have only read one of her trilogies, I have become a huge fan of her inspirational novels. \"A Thousand Tomorrows,\" in my opinion, is more directed towards females because it's a sappy love story type book. However, anyone who is interested in bull riding, barrel racing, or rodeo in general would love this book. \"A Thousand Tomorrows\" is a great book altogether, and taught me that forgiveness is always the right thing to do, never to judge someone because you never know what's going on in their life, and to live life to the fullest because you're never promised \"a thousand [more:] tomorrows.\""}, {"userName": "Imel", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/3165273-imel", "userReview": "berhubung cerita a thousand tommorow ini, salah satu tipe cerita favoritku jd kasih bintang 5a thousand tommorow kurang lebih sama inti cerita dengan Love Story nya Erich Segal & A walk to remember (nicholas spark)menyentuh dan tentunya byk pesan mengenai bagaimana menata kembali hubungan antar keluarga yg kurang harmonisdisini lagi-lagi ak menemukan tokoh utama pria, memiliki kerenggangan hubungan dengan orang tuanya trutama dg sang ayah (sebelumnya di Love Story, problemnya juga sama).Adalah Cody Gunner, seorang pemain rodeo yg sangat membenci ayahnya yg udh ninggalin dia, ibu dan adiknya gitu aja sewaktu cody masih kecil.Dan itu menibulkan sakit hati yg dalem bwt Cody hingga kemarahannya dia terhadap masa lalunya dia salurkan pada olahraga rodeo.Kemudian ada Ali Daniels, salah seorang pemain rodeo yg ikut dalam pertandingan. Ali, wanita tangguh dengan keinginan & tekad yg kuat berniat memenangkan pertandingan tetapi terhalang oleh satu kondisi yg juga rahasia yg disimpan Ali. Kondisi fisik Ali ternyata tidak setangguh dan sekuat keliatannya. Ali mengidap penyakit Cystic Fibrosis (Penyakit paru-paru yg diketahui bisa membunuh penderitanya). Meskipun sakit, itu tidak menyurutkan tekad dan semangat Ali untuk meraih gelar juara.Masuklah Cody dalam kehidupan Ali berawal dari rasa penasaran Cody terhadap Ali yg sebelumnya memang gak pernah bertegur sapa. Sudah bisa ditebak klo keduanya pada akhirnya saling jatuh cinta. Disaat itulah rahasia yang disembunyikan oleh keduanya akhirnya terbongkar. Rahasia Cody yg membenci ayahnya sendiri akhirnya diketahui oleh Ali. Begitu juga dengan Ali, Cody pun akhirnya tau alasan kenapa Ali seringkali sakit pernafasan yaitu karna CF yg mematikan. Tetapi Rahasia itu tidak mempengaruhi Cinta keduanya. Cody pun berniat menyumbangkan paru-parunya untuk Ali karena rasa cinta Cody yg begitu kuat pada Ali. Ali juga meminta Cody untuk berdamai dengan ayahnya, tetapi Cody msh belum mau memaafkan ayahnya meskipun Cody mengatakan akan mencobanya.seperti cerita love story, akhirnya Cody mau berdamai dan memaafkan ayahnya (jujur, nangis waktu Cody & ayahnya baikan ). Ali juga mendapatkan paru-paru donor dari Cody dan ayah Ali. tetapi tidak ada yang namanya happily ever after atau istilah bahagia selamanya seperti cerita dalam dongeng, berlaku pula untuk a thousand tommorow. Walaupun Cody dan Ali sanggup membuktikan bahwa cinta mereka akan selalu ada untuk ribuan hari esok lainnya tetapi balik lagi, Manusia boleh berencana, tetapi Yang Maha Kuasa pulalah yang menentukan. Nasib bisa dirubah, tapi Takdir tidak."}, {"userName": "Sabrina Zee", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/4685993-sabrina-zee", "userReview": "Buku ini memiliki banyak kesamaan dengan A Walk To Remember karya Nicholas Sparks. Cody Gunner merasa dikhianati ayahnya karena meninggalkan keluarga mereka saat dia masih kecil. Ia berubah menjadi seseorang yang lebih suka membenci. Yah, Landon Carter dalam AWTR juga membenci ayahnya sehingga memberontak. Tapi bedanya Cody menyalurkan kemarahannya dalam pertandingan rodeo. Menurutnya, delapan detik di atas punggung banteng bisa membuatnya melupakan kebenciannya.Ali Daniels sangat suka berkuda sejak kecil. Ia berkuda demi adiknya, Anna yang tidak punya kesempatan itu. Anna meninggal karena pneumonia sewaktu muda. Hanya saja Ali punya keterbatasan. Ia menderita cystic fibrosis. CF ini penyakit genetik yang menyebabkan paru-paru memproduksi terlalu banyak mucus. Kelainan ion channel di paru-paru itu membuat Ali tidak bisa menghirup debu terlalu banyak. Paru-parunya lemah dan ia selalu terbatuk-batuk setelah bertanding. Ia harus menahan napas sepanjang berkuda supaya tidak menghirup debu.Ali Daniels terdengar seperti Jamie Sullivan di AWTR. Kalau Jamie punya leukeumia, Ali punya CF. Cody dan Ali bertemu di gelanggang pertandingan rodeo. Mereka sama-sama penyendiri dan hanya memusatkan diri menjadi yang terbaik dalam bidangnya. Tapi sejak awal mereka sudah saling memperhatikan satu sama lain.Karen Kingsbury menulis buku ini karena terinspirasi oleh para penderita CF juga oleh para pendonor paru-paru bagi penderita CF. Paru-paru yang terasa biasa saja bagi orang normal itu sangat penting bagi penderita CF walau hanya secuping/selobus saja. Bagaikan janji untuk hidup selama ribuan hari esok (a thousand tomorrows). Ceritanya mengharukan sekali karena gaya bercerita penulis sangat mudah dimengerti. Belum lagi kalimat-kalimat inspirasionalnya. Cody mau memaafkan ayahnya karena belajar dari Ali. Bahwa hidup terlalu singkat untuk dihabiskan untuk membenci. Yah, menurut saya ini jauh lebih bagus dari AWTR. Lebih mendalam dan lebih banyak dialog membangunnya. Kedua tokoh yang punya rahasia, pelajaran untuk memaafkan, dukungan penuh sebuah keluarga, cinta tulus dan sebuah pengertian yang tidak perlu dipertanyakan... Pokoknya saya suka banget. \"Cody, apa kau sedang mengejarku?\"\"Tidak.\"\"Bagus. Karena aku tidak mau tertangkap.\"Tapi akhirnya Ali juga yang menahan Cody supaya tidak pergi. Gilaaa, si Cody parah... sayang banget sama si Ali."}, {"userName": "Shelley", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/5435752-shelley", "userReview": "This was an excellent book that I would highly recommend. It is my first Karen Kingsbury book and won't be my last, I have already bought the sequel to A Thousand Tomorrows, Just Beyond The Clouds which continues the Cody Gunner story. This book is classified as Christian Fiction but it didn't seem preachy, it does have a soft undertone of God and Christian principles in it but it isn't pushy which I like as it doesn't detract from the story, it enhances it. The main goal of this story , is love, and to live each day to its fullest because you never know what tomorrow may bring. Cody and Ali's story was so sweet but also so heartbreaking. Cody grew up knowing such heartbreak and anger and not allowing love into his life until he met Ali Daniels, then his whole life changed, she showed him how to love and forgive. She also showed him how to sacrifice. Unfortunately, their love was also fated to lead to he he heartbreak due to her Cystic Fibrosis. I loved the way Ali lived her life to the fullest riding her horse and barrel racing even if it meant shortening her life. Karen Kingsbury dealt with the issues of Downs Syndrome (Cody's brother has it) and Cystic Fibrosis in a very good and informative way showing that people with these disorders are very real people just like everyone else that and that they Justcan function in society, they just have to deal with life a little differently. I love how Cody treats his brother Carl Joseph, he always loved him even when he didn't love anyone else. This book had me smiling at times, tears at others. It was definitely a good read that I would highly recommend."}, {"userName": "Joanie Bruce", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/12027480-joanie-bruce", "userReview": "Warning: Spoiler alertWhat can I say about this book? The writing was superb, in true Karen Kingsbury style, but the ending is sad ... something I normally do NOT like in a fiction book.What I liked: Ms. Kingsbury makes you fall in love with the characters involved in this story. Their likes, dislikes, determination and stamina all shine through the story like sun shining through a hole in the clouds. The depth of their friendship/love is hypnotic, and it draws the reader into the story. She also has a way with words, and I'm sure her fans will agree.What I didn't like: The ending is very sad, and normally, I steer clear of books with sad endings. Even though Ms. Kingsbury warns you in the beginning of the book that Ali has Cystic Fibrosis, which is fatal, and you are expecting her death, it is still hard to read about her death at the end. I read books to uplift my day, and sad books fail in that area.Over all, I give this book four stars. Would I have read it if I had known the ending was sad? Probably not. But that doesn't mean it's not a great book. On the contrary the writing is superb....in everything from characters to the plot. Not liking sad books is only a quirk of my personality. I still would recommend it to anyone who enjoys a good love story, and I also recommend reading it with a box of tissues by your side."}, {"userName": "Maria Michaels", "userReviewDate": "Nov 01, 2011", "userURL": "http://www.goodreads.com/user/show/5891233-maria-michaels", "userReview": "It was difficult to stay interested in this book - the only thing that made me want to keep reading was the sweet love story. That part was the best part of the book. The author did a great job in my opinion of showing how two people gradually fell in love. Otherwise, there was no surprise in the ending - you see it coming from the beginning. No surprises along the way, either. I should quantify that I'm not a big fan of the rodeo, and this is heavily set in and around the rodeo - bull riding and barrel racing. You might as well have set it on another planet for all I know about either one of those subjects."}, {"userName": "Jeanie", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/5130755-jeanie", "userReview": "If you are sap for love stories that bring two people together with different hurts, you wil love this one. Cody with his past and the anger that he now has and Ali with the secret that keeps her fighting to be the best. I liked the back drop of the rodeo and I thought it played very well with the story. It was a very quick read that showed how forgiveness gives new begininngs along with healing. A real tear jerker. I thought it was interesting that faith was not a big part of this book however, God's presence was very much in it."}, {"userName": "Tess", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/2028689-tess", "userReview": "Loved this book from the very start. The love between the two main characters, Cody and Ali, was so real that I felt every emotion going through the chapters of their relationship. This of course included the end, where I cried throughout the last 40 pages, like a baby. I don't remember ever needing tissues (yes, plural) and having to catch my breath between sniffles when reading a book before. I loved every ounce of this story, and am greatly looking forward to the second in the series."}, {"userName": "Jean", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/20287501-jean", "userReview": "An excellent book about true love. This book has it all, family upsets, hate, happiness, sickness, strength, faith, sadness, and most of all the meaning of true love. Easy to feel as if you know the characters. Well worth reading."}, {"userName": "Oksana", "userReviewDate": "Jul 02, 2009", "userURL": "http://www.goodreads.com/user/show/2023422-oksana", "userReview": "This what true and genuine love is all about... sacrifice for the one you love and being able to let go if necessary..."}, {"userName": "T.M.", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/7335120-t-m", "userReview": "Bring the tissues. Touching story worthy of a full box of tissues. One of her best novels."}, {"userName": "Meghan Tharp", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/22350169-meghan-tharp", "userReview": "Cried and cried in this book...I cannot express how much I loved it."}, {"userName": "Kathy", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/772089-kathy", "userReview": "Definitely one of the best Karen Kingsbury books I've read so far! Sometimes, when you looking for it or not, love finds you and you'll do anything to hang on to it."}, {"userName": "Sam", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/16706082-sam", "userReview": "Ah-freakin-mazing"}, {"userName": "Emily", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/24544872-emily", "userReview": "I cried so much... oh my goodness. Such an adorable and tragic love story!"}, {"userName": "Colin", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/6284774-colin", "userReview": "This is an inspirational story. you'll cry, you'll get angry, you'll get spellbound. You will appreciate life, you will appreciate the importance of time. Sure you'll weep a thousand tears!"}, {"userName": "Nicole Jarrell", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/20095089-nicole-jarrell", "userReview": "Beautiful story, beautifully written. My first Karen Kingsbury novel, but I'll be reading a ton more!!"}, {"userName": "Casey", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/22757925-casey", "userReview": "This was a very intriguing book that kept me reading. I cried a lot of the time but it was a wonderful book."}, {"userName": "Lynn Grier", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/18551786-lynn-grier", "userReview": "This was a beautiful and sad story and I loved it. This was my first book by Karen Kingsbury. I just could not put it down. I will read more books by this author."}, {"userName": "Laura Pina", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/23462164-laura-pina", "userReview": "An incredible story of love and passion for life between two young people."}, {"userName": "Crystal", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/51843840-crystal", "userReview": "Now, This is my kind of book. Kingsbury pulls the heartstrings in this touching novel about love that never fails, forgiveness, courage and hope in the midst of life's biggest storms. Cody Gunner is filled with rage and bitterness after life deals him a tough hand early in life. he turns to bull riding to channel that anger and relieve its boiling pressure inside of him. he meets Ali Daniels, a mysterious barrel racer with a deep secret. Kingsbury weaves a tale that challenges and inspires the reader. I loved the font in this also. i8t was not a large print edition but it was easy to read. I read it in one day"}, {"userName": "Ivy Rose", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/42925359-ivy-rose", "userReview": "I cried. Couldn't see the page I was crying so hard. Why do Karen Kingsbury books do this to me??? The last time I cried over a book was one of hers--yeah. She's an amazing author. This book is no exception. I got so attached to the characters, my time with them felt too short. But it's so good. Though some of the cystic fibrosis treatments explained in the book are a little outdated, it definitely serves the purpose of raising awareness for CF. Beautiful, heartbreaking, and altogether incredible."}], "description": "In this mass market edition, #1 bestselling author Karen Kingsbury weaves a powerful story of a young couple whose love must face the ultimate challenge.Cody Gunner has no use for real love. Abandoned as a child by the person he needed the most, he swears he will never allow himself to love again. Ali Daniels denies love as well. Carrying a terrible secret, she lives life to the fullest, taking risks and refusing relationships. When Cody and Ali meet, their first instincts are to hide behind their emotional walls, seemingly doomed to repeat the patterns they have established for most of their lives. But their attraction is too strong, and soon they're doomed in another way, for neither can avoid falling in love, regardless of the consequences. Only after three years--a thousand tomorrows later--do they realize at what cost their relationship comes. In the end, they must decide if love is worth the ultimate price.", "title": "A Thousand Tomorrows\n      \n          (Cody Gunner #1)", "url": "https://www.goodreads.com/book/show/10257021-a-thousand-tomorrows", "average": 4.32, "cover": "https://images.gr-assets.com/books/1328308294l/10257021.jpg", "reviews": 364, "authors": [{"url": "https://www.goodreads.com/author/show/3159984.Karen_Kingsbury", "name": "Karen Kingsbury"}], "type": ["Christian Fiction", "Christian", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/10257021-a-thousand-tomorrows", "http://www.goodreads.com/book/show/229050.A_Thousand_Tomorrows", "http://www.goodreads.com/book/show/355403.A_Thousand_Tomorrows", "http://www.goodreads.com/book/show/1877776.A_Thousand_Tomorrows", "http://www.goodreads.com/book/show/1488175.A_Thousand_Tomorrows", "http://www.goodreads.com/book/show/9897697-ribuan-hari-esok", "http://www.goodreads.com/book/show/11433.Redemption", "http://www.goodreads.com/book/show/289644.Even_Now", "http://www.goodreads.com/book/show/35332.Remember", "http://www.goodreads.com/book/show/97862.One_Tuesday_Morning", "http://www.goodreads.com/book/show/8139321-leaving"]}