{"ratings": 111, "userreviews": [{"userName": "Rob Slaven", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/14011226-rob-slaven", "userReview": "I received this book free for review from the author or publisher in exchange for an honest review. Despite the privilege of receiving a free book, I’m absolutely candid about it below because I believe authors and readers will benefit most from honest reviews rather than vacuous 5-star reviews.The nutshell view of this book is difficult to constrain simply. A pair of time-travelers (a'la Doctor Who) skip about between a series of diverse worlds and engage in various rather disconnected adventures mostly involving criminal activities of a non-threatening sort.To the positive, the author's work has a tongue-in-cheek Douglas Adams feel about it though it must be admitted Gingell's main theme of stealing a spacecraft (which can communicate verbally and has an annoying personality) and taking off in it does have somewhat of a derivative and familiar feel to it. The writing is solid in style and flows along quite nicely from a textual standpoint. The pace is fast, the action is reasonably gripping and the sense of world and character is intriguing and original.To the negative, the work as a whole seems somewhat fragmented. I arrived at the end and wasn't entirely sure how (or if) the beginning, middle and end related to each other. Certainly the characters are consistent throughout but there was no solid sense of A then B then C. In part this is a result of the non-linear construction and is a typical result of time-travel as a plot element but generally one expects things to finally come together in a more cohesive corpus when the end is finally reached.In summary, this is a solid first effort in this series and has much potential but I think that in order to really take off the over-arching plot needs more solidity and consistency to give the reader a firmer sense of completion and narrative arc once the last page is reached.PS: I hope my review was helpful. If it was not, then please let me know what I left out that you’d want to know. I always aim to improve."}, {"userName": "Athena", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/16891485-athena", "userReview": "I really liked this first installment(?) in what looks to be several short stories/book-in-process about time-travelling anti-heroes and their time-travelling opposition. I'm a 'wait for the whole book' reader so when I hit the end and found it was really only a beginning I was a bit cranky, but that's just me.Gingell writes without a net (i.e., independently published), an act of bravery I admire greatly, and she delivers fully realized characters in a very short time. In Time-Traveller this comes across more in the secondary characters; perhaps the apparent MCs (Kez & Marx) aren't really the MCs? HmmmNow I want THE WHOLE STORY!! Please?"}, {"userName": "Sage Knightly", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/32900412-sage-knightly", "userReview": "A fun, quick read full of humor, sass, and adventure! Full revoew to come"}, {"userName": "Felicia Allen", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/29025122-felicia-allen", "userReview": "This was a super cute book. I can't wait for the second one to come out."}, {"userName": "Tony Green", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/46615183-tony-green", "userReview": "I really liked this first part of the series. It's very difficult not to like Marx (a small, angry man) and Kez (a rather vicious urchin who just happens to be able to be able to move instantly through time and space). Add to this that they have serious criminal tendencies and are constantly trying to stay one step ahead of the various people and organisations who are trying to either catch them or kill them and you have a recipe for a good story. It is very well written and flows nicely, even though some parts are a little confusing due to the non-linear factor which is difficult to avoid in a time travel story. I would have liked to have given this book four and a half stars but have to settle for giving it four. I am looking forward to reading more of this authors work."}, {"userName": "Diane", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/12854357-diane", "userReview": "2.75 stars, maybe. Entertaining, but deliberately disjointed: that's the nature of time travel. I feel like I just got a look at a few near-random pages from their album or dossier. I wonder whether later installments will clarify all the events/encounters that came before/after these scenes (chronology depending on whose perspective you consider)."}, {"userName": "Scott Baron", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/59076604-scott-baron", "userReview": "A thoroughly enjoyable read. The time travel genre rarely has anything truly novel spring forth, but in this story, W.R. Gingell creates just such an occurrence with precocious Kez. No spoilers, but she is more than meets the eye, in a most amusing sort of way.Timelines jump around, as they are wont to do in a story of this nature, but the seeming confusion is kept in check by a well-crafted timeline (more of which I'm looking forward to in Memento Mori, the sequel). All-in-all, a fun romp and well-worth your time if you enjoy the time travel genre. Or the surly mercenary genre. Or the smart-assed, hidden talent kid genre."}, {"userName": "Misha Krulis", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/17902485-misha-krulis", "userReview": "More please :)I don't think there is any character or world that W.R. Gingell creates that I don't want to know more about or join on their journeys.Completely different to the Two Monarchies Series (which I am also hoping for more of) but still grabs you like quicksand until your totally immersed.Looking forward to more adventures with Marx & Kez"}, {"userName": "Lisa A King", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/30771294-lisa-a-king", "userReview": "Such a fun and interesting story!I love the characters in this story. They are funny and engaging. The plot is interesting and full of twists and turns. I can't wait to read the next book."}, {"userName": "Jemma", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/37756135-jemma", "userReview": "-Having read the second book, I would certainly recommend the series. It works best however if you see this one as more of an introduction to the characters and setting. The second book is where it all starts to make sense and have a cool plot. - I enjoyed it, it was a fun read with entertaining characters :)Only thing I didn't like was the jumping all over the place. Time travel books are often confusing, but this one was the most confusing I've ever read. Nothing was linear at all! Every chapter was a different place in everyone's time line! And then the book ended. Luckily, I have the next book and will be reading that ASAP. :)"}, {"userName": "Sara", "userReviewDate": "Sep 01, 2016", "userURL": "http://www.goodreads.com/user/show/56167006-sara", "userReview": "it's a fun and short read, once you get into it, and I liked the characters well enough, but I'm not sure I understood what was happening or why they were doing the things they did. Yes, time and space travel are disjointed, but other than keeping away from someone who is trying to kidnap Kez, why are they bouncing around?"}, {"userName": "KC Montgomery", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/36049264-kc-montgomery", "userReview": "What a fun romp thru time and space! I am so ready for Volume Two! A fast paced story with likable (and unlikely) heroes, a mysterious villain, and with a supporting cast that you root for!"}, {"userName": "JoAnn Arnold", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/4640390-joann-arnold", "userReview": "I thoroughly enjoyed this. This reminds me a bit of James H. Schmitz's \"Witches of Karres\" except with time travel and a bit more snark. I like to see more with these characters."}, {"userName": "MB (What she read)", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/1586349-mb-what-she-read", "userReview": "This is an installment, not a full-fledged story. It has lots of potential, but there's not enough of a foundation (plot, backstory, character development, etc.) to make it of substance. It is mostly composed of action vignettes, but the lack of foundation made that not work for me. YMMV.I'd consider it more of a serial. It was cheap, and enjoyable enough, but didn't really go anywhere. You'll need to commit to reading and buying the rest of the series if you want the whole thing. This is more of a teaser."}, {"userName": "Cliff Dalton", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/5077299-cliff-dalton", "userReview": "Who's the Best Friend?Is Kez the best friend? Is it Marx? Maybe Mikkel, or Arabella. I can't tell and the book is only 151 pages so it seems like parts are missing. Also, why does Kez have a Cockney accent? It was entertaining, what there was of it. At no time was I worried about the welfare of the principal characters because - no suspense. Maybe next time will be better."}, {"userName": "Stephen", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/7925727-stephen", "userReview": "Quirky Not sure that have grasped all of the levels of this short book (literally), but it’s a good rollicking read at madcap pace. The characters are fun and I’m looking forward to their development in future volumes. It is original, does not take itself seriously and has potential legs (he said ruminatively as he twirled his wine glass)."}, {"userName": "Marzena", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/62184702-marzena", "userReview": "Very interesting time travel book with very likeable characters. Funny, adventures story. Very fresh look in whole new way. The plot was full of twist and turn.I voluntarily reviewed an Advance Reader Copy of this book"}, {"userName": "Warren", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/1508817-warren", "userReview": "Kind of strange."}], "description": "Meet Marx. Meet Kez.Marx is a small, angry man with a time machine and a chip on his shoulder. Kez is a homicidal little girl with a price on her head and a penchant for kicking people where it hurts the most.After a narrow escape from the owners of the stolen craft he pilots, the last thing Marx wants is another gun pointed at him. What he wants and what he gets, however, are two very different things.On the run from killers, shadowy corporations, and one very specific Someone, the last thing Kez wants when she points a gun at yet another apparent killer is a self-appointed protector.What she wants and what she needs, however, are two very different things...", "title": "A Time Traveller's Best Friend", "url": "http://www.goodreads.com/book/show/35890932-a-time-traveller-s-best-friend", "average": 3.64, "cover": "https://images.gr-assets.com/books/1501557942l/35890932.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/7849833.W_R_Gingell", "name": "W.R. Gingell"}], "type": ["Science Fiction", "Science Fiction", "Fiction", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/35890932-a-time-traveller-s-best-friend", "http://www.goodreads.com/book/show/24571624-a-time-traveller-s-best-friend", "http://www.goodreads.com/book/show/25635670-a-time-traveller-s-best-friend", "http://www.goodreads.com/book/show/23441090-a-time-traveller-s-best-friend", "http://www.goodreads.com/book/show/29481285-masque", "http://www.goodreads.com/book/show/37786997-spindle", "http://www.goodreads.com/book/show/33867423-shards-of-a-broken-sword", "http://www.goodreads.com/book/show/26790083-twelve-days-of-faery", "http://www.goodreads.com/book/show/33932233-blackfoot"]}