{"ratings": 1978, "userreviews": [{"userName": "David Zerangue", "userReviewDate": "Nov 09, 2010", "userURL": "http://www.goodreads.com/user/show/4517372-david-zerangue", "userReview": "I thought the prospect of solving mysteries with otherworldly guidance would be an interesting twist to a classic genre. Sadly, I was mistaken. The book was filled with typographical errors (publisher's issue, in my view). So, that was annoying. But the more irritating part was that the book was more of a modern day Nancy Drew/Hardy Boys mystery. Personally, I believe these books should be relocated from the mystery section of bookstores to the young adults section. I guess I should not be too harsh about this series as the author has published 13 books, I believe. So, someone out there likes them. That person just does not happen to be me. Unfortunately, I picked up an additional Aunt Dimity book when I purchased this one. So, I'll be reading that one at some point. It would be great to draw an alternative conclusion but I believe I have her format down..."}, {"userName": "Stacy", "userReviewDate": "Jul 07, 2009", "userURL": "http://www.goodreads.com/user/show/862507-stacy", "userReview": "Perhaps it's just me, but I'm finding the Aunt Dimity books to be going rather downhill. They are growing painfully formulaic, and what sympathy I once had for Lori is about gone. She's become an idiot, and Bill should dump her into a sanatorium for an extended stay.I may pick up some others when they're on the cut-out shelves and cheaper than paperbacks, but unless Atherton suddenly starts producing plots that make suspending disbelief a little more tempting, I may just go immerse myself in science fiction for a while."}, {"userName": "Barbara ★", "userReviewDate": "Mar 07, 2013", "userURL": "http://www.goodreads.com/user/show/1968285-barbara", "userReview": "I enjoyed this one much more than the last one I read. There was an honest to God mystery and it was actually suspenseful and interesting and I really liked Toby and hope he shows up in a future installment."}, {"userName": "Trish", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/1113281-trish", "userReview": "Remains one of my go-to series for when I need cheering up."}, {"userName": "Kristen", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/11382577-kristen", "userReview": "Aunt Dimity does it again! This is such a sweet, fun enjoyable series, and I get the next Aunt Dimity when I just want something light and unique with a bit of a mystery. Nancy Atherton never disappoints me!Having survived her near-death encounter with a crazed mad-man on a secluded Scottish island, Lori is back in Finch but dealing with severe post-traumatic stress disorder. Troubled by nightmares, terrified of thunderstorms and barely able to function, Bill decides a drastic change of scenery is needed.Lori, the twins and nanny-extraordinaire Anneliese are sent off to Bluebird Colorado to vacation in the mountain \"cabin\" of one of Bill's clients. Envisioning a shack with an out-house, Lori is delighted to discover a spectacular mountain get-away with every luxury one could imagine.Lori, Anneliese and the boys take to clean mountain air and horses and exercise, but before long, the local townspeople start telling Lori tales about how the cabin is cursed. Given Lori's nightly conversations with Aunt Dimity, who can always sense any evil in any building immediately if it is present, Lori discounts the stories as small-town supersition. But odd things keep happening, and before long Lori's off and investigating, despite all recommendations against it.This was a fun change of scenery for Lori and family, and there is a clever connection made between the folks of Bluebird and those back home in England. I figured out what was going on slightly before the book revealed it, but the Aunt Dimity books are never about the mystery, as much as they are about beloved characters that you cannot wait to revisit and catch up with in each new story. All the characters you love in ther series are here, and as always some characters specific to this story are introduced to add favour and spice."}, {"userName": "Stephen", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/3850112-stephen", "userReview": "I picked this book, and another Aunt Dimity, up in a sale and had never hear do her. I was pleasantly surprised by both books and enjoyed their quite different gentler mysteries. The Aunt Dimity character is certainly an original.I would recommend this series of books to anyone who wants a light entertaining read with no gore or distress, though there was a touch of scary spookiness in both the books, the other was Aunt Dimity: Snowbound: Snowbound (Aunt Dimity Mystery), that I have read.Aunt Dimity Goes West"}, {"userName": "Heather L", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/431357-heather-l", "userReview": "Another good addition to the series. Liked the setting in this one."}, {"userName": "Mako", "userReviewDate": "Mar 05, 2010", "userURL": "http://www.goodreads.com/user/show/296286-mako", "userReview": "This was my 1st experience with this series (#12 of her series). I am interested in trying an earlier work. I thought it was a fun read --- I consider this a beach or before bed book."}, {"userName": "Sarah Coller", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/43856473-sarah-coller", "userReview": "This is the second Aunt Dimity that I've actually abandoned at partially through. I read to about page 80 but I'm so sick of Lori's extramarital wanderings that I had to let it go. Lori's crush on 21 year old Toby is not cute, funny, or endearing. It's disgusting---for many reasons, but most obviously because this whole vacation was her faithful husband Bill's idea in the first place. We're not dealing with a silly school girl...isn't she like 40 or something? Please. Any concessions I gave Lori in the last book---one I actually enjoyed---have now been revoked. In this story, Lori has found a \"clone\" for every Finch person in those she meets in Colorado. I think introducing a clone for her husband is going a little too far---especially since the author has created these people as church-going people of faith. Ugh. I think I need another break from this series."}, {"userName": "Karen A. Wyle", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/4960159-karen-a-wyle", "userReview": "I'm rounding up a little.This installment of the Aunt Dimity mysteries is not quite as dark as the preceding, but does have the somewhat welcome realistic touch of showing how the events of that book led to Lori's PTSD. On the other hand, there's a set of quite unrealistic and unexplained facts (though Atherton leaves open the possibility that Lori exaggerates them) that weren't crucial to the story.As is often the case, we have new interesting characters joining the main series characters, as well as more well-described settings. The mystery is resolved nicely, with no deus ex machina element. Overall, I quite enjoyed the book."}, {"userName": "Lynn Pohlman", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/10366796-lynn-pohlman", "userReview": "Always a fun easy series to read. Great for weekends and stormy days. The different locations are well described and makes you want to visit there after reading the book."}, {"userName": "Gail", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/920629-gail", "userReview": "I think I like this one best - must be the family history aspect of it that kept me interested. It was a very good mystery story."}, {"userName": "Michele", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/6809291-michele", "userReview": "Lori didn't almost break her marriage vows, Aunt Dimity found a pal to talk to Lori with...and so much more!"}, {"userName": "Kathy Roberts", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/13756561-kathy-roberts", "userReview": "These books are getting violent..."}, {"userName": "The Flooze", "userReviewDate": "Feb 20, 2013", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "No matter where this woman goes, she can't help finding trouble!I'm enjoying the changes in Lori. She still jumps to conclusions, but they're of a less cynical sort. She's usually quick to acknowledge when she's been rude or presumptuous. And though she's never been one to shy away from possible danger, she's now proven herself as quite fierce when the situation calls for it. She and the sensible, insightful Dimity continue to make a grand team, whether at home at Finch or while visiting its Colorado doppelganger, Bluebird.There were many chuckles in this installment thanks to Toby, a sarcastic young caretaker, and Lori's rambunctious twins. The laughs bracketed the customary foray into history - this time focusing on Bluebird's gold-rush experiences. Atherton remains so adept at making the past come alive, her vivid descriptions brimming with humanity and forcing us to care about every character, whether alive or dead.I must also acknowledge Atherton's uncanny ability to sense precisely what the series needs to prevent it from becoming stagnant or tiresome. I'm just as interested now as I was at the onset, with only a few rocky moments in-between. At this rate, I'll be caught up in no time and will be sad to have to wait for the next installment!"}, {"userName": "Rebecca Douglass", "userReviewDate": "Mar 01, 2012", "userURL": "http://www.goodreads.com/user/show/7830952-rebecca-douglass", "userReview": "There's nothing \"great literature\" about the Aunt Dimity books, but they do what they do very well. Aunt Dimity Goes West is not my favorite of the series, however. Maybe that's because we move out of the English countryside and into an area that I know much better, so the stereotypes are more jarring and the setting less exotic. Also, Ms. Atherton brings in an additional ghost (or whatever Aunt Dimity is), and I find that stretches my willing suspension of disbelief to the edge of breaking. Too many mystical elements and she loses me.But the unfolding of the story with just the right amount of humor, interpersonal stuff, and suspense/danger is pretty well on target. We can laugh with Lori at her own overreactions, and have a good time worrying about the mysterious dangers she and the twins face without ever really losing any sleep over it. And we get the comfortable and comforting ending we expect.My husband and I often refer to the mysteries and light fiction we read as \"brain candy.\" But books like the \"Aunt Dimity\" series are more along the lines of comfort foods--things that can make you feel that all's right with the world."}, {"userName": "Maria", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/949924-maria", "userReview": "I loved the descriptions of Colorado, but the doppelganger bit got old real fast, especially with the names being so similar. Like most people, I don't like to think that there is someone else out there that close to another without being a twin. A unknown twin would have served the plot line better. The history, the introduction of the school teacher who had been dead for a hundred years, and the resolution of the current mystery were wonderful. The twins, as usual, were a treat. I loved their calm use of bad language when they did not have the least idea of what they were saying. So typical. The other thing I didn't like was the re-introduction of Lori being attracted to Toby, a guy fifteen years her junior. At this point, it just got ridiculous. The Auerbachs, who never actually enter the story other than through hearsay, were wonderful characters, and I was very happy that James and his wife ended up with them and that they did not sell their Colorado property. Hopefully Toby will come back into the story at some future date, but without the underlying attraction. Good grief. Is Lori never going to grow up?"}, {"userName": "Sue", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/1967458-sue", "userReview": "In her twelfth case, Lori Shepherd travels to Bluebird, Colorado, to try to escape the memories of her last adventure where she was shot and almost killed by a madman. Lori, her five-year-old twins, and their nanny Annelise will spend the summer at the Aerie, a luxurious log cabin owned by a friend of Lori’s husband, Danny Auerbach. When they arrive, they find the caretaker has left unexpectedly, and a 21-year-old college student, Toby, is to take his place. Lori soon learns the site is supposed to be cursed, due to a long ago mining accident, and that the Auerbach family hasn’t used the cabin since Christmas and left hurriedly then. Lori solves the mystery of the mine collapse, along with a current day puzzle that left her family in danger. Aunt Dimity, Lori’s ghostly friend, offers her usual sage advice through a blue journal. The beautiful surroundings and new friends, very reminiscent of her friends back home in Finch, England, help Lori heal in this humorous, satisfying cozy with exceptionally likable"}, {"userName": "Scilla", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/1891647-scilla", "userReview": "After being shot by Abbadon in Scotland, Lorrie continues to have nightmares. Bill arranges for Lorrie, Anneleise, and the twins to go to a cabin, the Aerie, in Colorado. The caretaker, James Blackwell, has suddenly left, and young Toby Cooper is very knowledgeable, helpful, and friendly. The view is spectacular; the cabin is wonderful; the twins love hiking, fishing, and riding horses at the nearby ranch. However, something mysterious is going on; the locals claim there is a curse on the Aerie, which is built over an old gold mine; the owners wife has refused to return, and why did Blackwell leave so suddenly. When the twins come back from the ranch where they have been riding horses and seeing buffalo swearing, they claim they heard the words from the floor of the tent where they sleep. Lorrie does some investigating with Aunt Dimity's help, and learns some history of the place and eventually solves the mystery."}, {"userName": "Sharmili", "userReviewDate": "Aug 09, 2007", "userURL": "http://www.goodreads.com/user/show/267382-sharmili", "userReview": "I love the Aunt Dimity series because there is something so heartwarming about it. But then, I also love to watch Murder She Wrote, and in my imagination, Aunt Dimity looks like Angela Lansbury and that Lori is a younger Angela, playing Jessica Fletcher's British cousin Emma. If that made sense to you, and you read these books, you understand why I enjoy the series. Here's the thing, though. I was reading, getting the same general happy vibe I get reading the latest Aunt Dimity, and yet something was missing. Where was Reginald in this book? Dear, beloved Reginald was missing from the cover. A friend of mine who works for the publishers even told me that she doesn't read Aunt Dimity, but even she always looks for the little, pink rabbit. The change in the cover art is definitely a hamper on the novel, because it's so distracting. If you can get past that, it's definitely a fun, light read."}, {"userName": "Sharon", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/2711832-sharon", "userReview": "As usual, Lori Shepherd indulges in speculation--which generally turns out to be incorrect, but somehow leads her to the solution of the mystery anyway. In this book, she is finding it difficult to recover a sense of safety and security following a stabbing and near death experience, so her husband arranges for her, the twins and the nanny to travel to Colorado and stay in a mountain cabin owned by one of his clients. She fears the worst but is happily surprised by the expansive and homey cabin as well as the assistant and guide hired to help them during their time there. Many of the inhabitants of the small village eerily remind her of the inhabitants of her home village in England with the exception of one or two. As she learns of the \"curse\" on the cabin, she discounts it until her sons tell of learning a number of swear words as they sleep in a tent in their playroom. What? Who? How? And disaster is averted."}, {"userName": "Betsy", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/33024987-betsy", "userReview": "The comparison between the people of Colorado and the people in Finch was ridiculous and Lori's reaction was even more ridiculous. The fact that her friends who also know these people didn't see the resemblance tell us a great deal about Lori Shepherd. Lori's attraction to the younger man is ridiculous as well. I really want Bill to stick around more because he acts as a restraining influence on Lori and she definitely couldn't flirt as much if Bill was there.The final point is that Annaliese does all the work and takes care of the boys so that Lori can behave in her less than stellar way. She's the mother and yet she does pretty much whatever she wants because of Annaliese. I have never seen two more precocious 5 year olds in my life. They're almost perfect and THEY NEVER LIE!"}, {"userName": "Boweavil", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/39539263-boweavil", "userReview": "Not happy with the change of scene but the smooth writing kept me going. The idea of the twinned populations was pretty well done, however."}, {"userName": "Sandy", "userReviewDate": "Jun 22, 2010", "userURL": "http://www.goodreads.com/user/show/1124058-sandy", "userReview": "I am certainly enjoying this series. Each book is a fun quick read. I do feel that the relationships between Lori and the \"male\" counterpart, in each of the books, is a bit unrealistic because of the speed with which she develops this close bond and camaraderie. I don't think things happen that quickly in real life. One quote I enjoyed in this book hails back to Shakespeare. One of the characters tells Lori that \"I created an atmosphere of tranquility and security in which you found it easier to sleep, and sleep, saith the Bard, is the balm of hurt minds, great natures' second course,chief nourisher in life's feast. Macbeth, Act two, Scene two.\" (pg. 162)How true that is! Sleep can be a great restorative and healer. It can be a time of sweet refreshment and renewal."}, {"userName": "Beth", "userReviewDate": "Feb 25, 2009", "userURL": "http://www.goodreads.com/user/show/951992-beth", "userReview": "After a harrowing, near death experience, Lori Shepherd (along with her two young sons travel from their home in England to a small, mountain town in Colorado, to recuperate. Through the caretaker, Toby, Lori finds out that the previous caretaker has vanished. The town gossip has it that the house they are staying in is haunted. Lori is aided by Aunt Dimity, the deceased friend of her mother's, who assures her that the house is not haunted. Of course, Aunt Dimity is long dead and communicates by writing in a journal Lori inherited from her mother. A patron recommended this series to me and I would recommend it to fans of Agatha Christie; a cozy mystery with likeable characters, an interesting angle and engaging characters."}, {"userName": "Carol", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/10318483-carol", "userReview": "We visit Bluebird, Colorado with Lori Shepherd, her boys and their nanny. Lori’s husband associate owns a huge cabin there.Her husband plans her vacation to help her recover from a gunshot wound and her nightmares involving a madman.Lori discovers that cabin is supposedly cursed while she is learning the history about the town and the mining community.Her boys enjoy going to a Cowboy Ranch toride horses.The surrounding are beautifully described. The characters are vivid, entertaining plus all addflavor to the story.Aunt Dimity, a ghost friend of Lori’s accompanies her on the trip. As usual, she gives Lori good advice.This is book #12 in An Aunt Dimity Mystery series. It can be read as a stand alone."}, {"userName": "Dharia Scarab", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/11756730-dharia-scarab", "userReview": "Since I don't normally write reviews unless I have something specific to say, here's the break down of how I rate my books...1 star... This book was bad, so bad I may have given up and skipped to the end. I will avoid this author like the plague in the future.2 stars... This book was not very good, and I won't be reading any more from the author.3 stars... This book was ok, but I won't go out of my way to read more, But if I find another book by the author for under a dollar I'd pick it up.4 stars... I really enjoyed this book and will definitely be on the look out to pick up more from the series/author.5 stars... I loved this book! It had earned a permanent home in my collection and I'll be picking up the rest of the series and other books from the author ASAP."}, {"userName": "Judy Goodnight", "userReviewDate": "Jan 28, 2010", "userURL": "http://www.goodreads.com/user/show/3205653-judy-goodnight", "userReview": "What I especially liked in this book:***Set just 6 weeks after Lori's harrowing experience in the previous book (Aunt Dimity & the Deep, Blue Sea), we see Lori struggling with PTSD, not just blithely bouncing back to her happy life.***The Colorado setting and typical history of the short-lived boom towns.What kept me from giving a fourth star:***The author's decision to populate the Colorado town of Bluebird with doppelgangers of the residents of Finch (Bluebird-Finch, get it?) and to have Lori endlessly make the comparisons between them.***The decision to have a huge chunk of the local mystery's revelation told to us via the magical blue journal.***I could see who \"the bad guy\" was from miles away.Overall, it was still enjoyable and a good read."}, {"userName": "KayKay", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/20170873-kaykay", "userReview": "The series is all about cozy mystery, nothing hardcore about solving puzzles. As a cozy/light reading, \"Aunt Dimity Goes West\" serves the entertaining purpose alright.In fact, this installment is one of the best, IMHO, among its predecessors. The ending with the twist is interesting. The only complain I have, as well as to other Aunt Dimity's installments, the development of the plots is always slow. Serious mystery lovers would not savor the adventures of Aunt Dimity and Lori; cozy mystery lovers would laugh along with Lori as she is such a fun character. I would give \"Aunt Dimity Goes West\" a 4-star rating as an installment of the series, but only a 3-star review as literature itself."}, {"userName": "George", "userReviewDate": "Jul 30, 2007", "userURL": "http://www.goodreads.com/user/show/3625-george", "userReview": "Another in the adventures of Lori Shepherd and her ghost Aunt Dimity. Lori is still recovering from her near death escape in the last novel and to help her recover from the mental aspects, her husband sends Lori, twin sons, and governess to a remote small town in the Colorado Rockies. Lori finds that several people in the small town resemble people in her English town of Finch. This recurring part of the story is a bit hard to take. The novel's mystery is a curse on the mine which the house Lori is staying in is built over and, with the help of Aunt Dimity and another ghost, Lori is able to unravel the mystery behind the curse."}], "description": "Everyone's favorite sleuth heads to the Rocky Mountains in the twelfth installment of Nancy Atherton's cozy mystery series Lori Sheppard barely survived her last adventure in Scotland before she's off on her next. This time in the mountain town of Bluebird, Colorado. No sooner than she's arrived do things start to go amiss. Someone has mysteriously disappeared, a charming and charismatic man seems to know more than he's letting on, and the whole town is hiding a dark secret. With Aunt Dimity's help, Lori sets out to solve a hundred-year-old mystery and discovers in the process that sometimes the strangest places can seem the most like home.Nancy Atherton's Aunt Dimity series has charmed its way into the hearts of mystery fans through eleven installments. In \"Aunt Dimity Goes West,\" Atherton's vivid storytelling and knack for bringing a setting to life will have fans lassoed to their chairs and guessing to the very end.", "title": "Aunt Dimity Goes West\n      \n          (Aunt Dimity Mystery #12)", "url": "http://www.goodreads.com/book/show/395886.Aunt_Dimity_Goes_West", "average": 3.88, "cover": "https://images.gr-assets.com/books/1440894638l/395886.jpg", "reviews": 118, "authors": [{"url": "https://www.goodreads.com/author/show/140848.Nancy_Atherton", "name": "Nancy Atherton"}], "type": ["Mystery", "Mystery", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/395886.Aunt_Dimity_Goes_West", "http://www.goodreads.com/book/show/2459732.Aunt_Dimity_Goes_West", "http://www.goodreads.com/book/show/8614810-aunt-dimity-goes-west", "http://www.goodreads.com/book/show/6372680-aunt-dimity-s-death", "http://www.goodreads.com/book/show/511263.Aunt_Dimity_and_the_Duke", "http://www.goodreads.com/book/show/574629.Aunt_Dimity_s_Good_Deed", "http://www.goodreads.com/book/show/511259.Aunt_Dimity_Beats_the_Devil", "http://www.goodreads.com/book/show/528038.Aunt_Dimity_Digs_In", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}