{"ratings": 524, "userreviews": [{"userName": "Marc", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/62840143-marc", "userReview": "Toobin's account of Clinton's legal problems in the 90's was supposed to be the topic of an up coming season of American Crime Story. Hence my interest in reading this book.The author does a decent job at showing how the Paula Jones trial in Arkansas, the White Water Investigation by Special Counsel Kenneth Starr and the Monica Lewinsky deposition intertwined into the hot mess that plagued Capitol Hill in 1997-1998. I enjoyed reading the details about the many personalities' life, career and motives.I would recommend the book to anyone who wants to sort out what happened in the 90's media frenzy over sex and the commander in chief . Bill Clinton was the very first president I was aware of (I was 10 during the impeachment trial). Back then I never quite understood why people were obsessed with cigars and blue dresses in the news. This book was helpful at putting all the pieces together."}, {"userName": "Tom", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/1375149-tom", "userReview": "I know what I remembered, being a Democrat and Clinton fan, and not following it too closely in the papers...Now I have a much better idea of how the Circus actually came to town, and I gotta say, I am even more disgusted than I was then. Toobin lays out the story with extensive sources in all its sordid detail. He is not a Clinton apologist, nor is he a Starr apologist. Mostly he lays out just the facts, as far as they can be known. There's a lot of facts, and his account is clear. And wretched. And revealing.And well-written, pretty much a page turner, especially towards the end.Overall, I am left with a feeling of sadness. And then I read today's papers, and the same self-interest trumping national interest dominates the action today. Maybe I am alone in doing so, but I call these people traitors. Please go away, or at the very least, hang your heads in shame and let someone who is interested in governing the country do so."}, {"userName": "Lee Miller", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/15656602-lee-miller", "userReview": "After reading the first two pages of \"Vast Conspiracy,\" you will be hooked. Jeffery Toobin has crafted a political analysis that reads like a political thriller.Yet in writing a fascinating, disturbing, and often wildly funny book, Toobin loses none of the objectivity, expertise, and standards that make him television's top legal analyst. Toobin's greatest achievement is walking the reader through the swirl of events step by step so the patterns and relationships become clear. He also displays a gift for explaining complicated legal issues in everyday terms. And, he brings a sense of history, a sympathetic understanding of people, and actual experience in an independent counsel's office to his stage.For example, when discussing sexual harassment, he summarizes its history as a legal concept, explains in depth its role in the impeachment scandal, and even reveals when the term was coined. When discussing a principal character, he presents a biographical sketch illuminating that person as a three-dimensional human being with a past, beliefs, and values of his or her own, values that shaped and colored their actions. Toobin expresses such concern for historical and human context throughout his book. The result is a work that does not narrowly focus on immediate events but instead examines the political and legal forces that stewed and fermented for decades before Monica Lewinsky was born and culminated in the Clinton impeachment trial. To help readers keep track of the overlapping events and myriad of personalities involved, Toobin includes a chronology of events and a cast of characters. All this, and it's a great read too! Of all the works that have come out of the Clinton trial, this is the most accessible to a general audience and the most important. If you read only one book about the impeachment, it should be this one."}, {"userName": "Tracy Jenkins", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/6228915-tracy-jenkins", "userReview": "This was a book our book club chose, and I really wasn't that interested in rehashing all the sordid details from the Clinton scandals. However, reading this some 15 years later it is clear this president for whatever reason (zipper problems not withstanding) created the most personal hatred against a sitting president in our history. This was not political hatred, it was personal and his time in office gave a catapulted start to the divisive right wing media strongholds that persist today from Ann Coulter to the Drudge report. Clinton's sexual problems were shameful, but the loss of civility and the vicious personal attacks are nothing less than unAmerican. Question is, once the genie's out of the bottle how do you put it back in? Worth reading and discussing from a basis of how do we get to productive discourse."}, {"userName": "Frank Stein", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/1398873-frank-stein", "userReview": "Even today, reading about the Clinton impeachment can feel like a tawdry activity. The public debate about impeachment was filled with intense discussions about penis shape, blow jobs, manual vaginal stimulation, and other sexual minutiae. It seems amazing that for over a year, the top political and media minds in the country debated little else. Jeffrey Toobin, in this fine recounting of the impeachment, shows that the tawdriness touched and diminished almost everyone who came into contact with the case. Toobin is something of an advocate for Clinton, but he can't help but note how small and pitiful Clinton appeared after the conclusion of this case, with his lies in both the Paula Jones deposition and in the Kenneth Starr grand jury, his pettifogging and circuitous answers to questions about all aspects of his past and relationships, and his consistent denials, to his family, to the country, and to his close aides, that he had engaged in \"sexual relations\" with Monica Lewinsky (in one case he told his White House lawyers, such as Robert Bennett, that it would be outrageous for him to engage in adulterous sex during this presidency, just hours after Lewinsky had left the Oval Office). Yet others were diminished even more than the President. Representative Henry Hyde, chair of the House Judiciary Committee, was celebrated by newspapers of all stripes when it was realized he would lead the impeachment hearings. He was considered a bipartisan and intelligent fact-finder with little prejudice. By the end, he would seem a zealot engaged in a foolish hunt for any information about Clinton's personal sex life. He had even organized a special \"war room\" in the Ford House Office Building where every salacious detail was kept. Kenneth Starr was formerly a respected federal appellate judge and solicitor general, whom everyone, from both parties, said was fair-minded, courteous and thoughtful. By the end of the case, when he was giving daily \"Hefty-Bag\" briefings to news reporters who came to see him take out his garbage, and when he had released to the House a 500-page report detailing every incident of oral sex engaged in by the President (many incidents were described in different sections of the report four or five times), he became the most hated man in the country. Toobin shows that Starr's supposed zealotry probably came from his inexperience in criminal matters and his deferral to his increasingly Clinton-hating staff, but it didn't matter. Starr's name too became mud.Almost every decision by every player in the story was subject to national debate, from the decision of Judge Susan Webber Wright to allow Monica Lewinsky on the witness list for the Paula Jones sexual harassment lawsuit to the Starr Independent Counsel's sequestering of Lewinsky in the Ritz-Carlton in Alexandria. Toobin tries to umpire each and every one of these debates, and although he clearly sides with Clinton and the Democrats on the whole, he makes fair calls about most issues. For instance, he argues that Wright's decision about Lewinsky was actually mandated by the broad evidence standards for sexual harassment in the Violence against Women Act, which Clinton himself had just signed in 1994, while the Starr team performed nothing untoward in questioning Lewinsky for hours in an admittedly comfortable location.The real question is what if anything we can learn from this debacle. Toobin says it demonstrates how political questions in America have gradually been redefined by lawyers as legal questions, and that the legal profession's dominance of politics is the real \"vast conspiracy\" we have to worry about. That's probably true, but this case rarely rose above the nominally legal, and remained almost totally political, on all sides, at all times. I have to say that I've never read another political book where I actually felt dirty after finishing. But that's exactly how this case should feel."}, {"userName": "Courtney Wynn", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/66217872-courtney-wynn", "userReview": "This book felt like a marathon. I bet this book would be more entertaining if you were watching the news when this all went down. I didn't know all the characters so I spent a lot of time looking up who each person was. This is basically a testament that politicians and lawyers are dishonest. Their motivation is power and they don't care how they get it. I can't believe how much tax dollars were spent on investigating the Clintons which never turned up anything. I didn't like how the author wrote about Monica Lewinsky considering how young she was but she's not perfect. The author mentioned how tired the public was of hearing about this scandal and that's how I felt for most of the book. It was a witch hunt."}, {"userName": "Jake", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/1401909-jake", "userReview": "Ah the good ol days when a President having an extramarital affair with a consenting adult was our nation's biggest scandal. Toobin is good at breaking down legalese for the rest of us. As he did in Run Of His Life, he shows the maneuvering of powers that converged in an unlikely way for a trial that descended into farce. But unlike the OJ Simpson trial, which took time to get there, Clinton's was ridiculous from the beginning.There are numerous people here, each with their own agenda and Toobin lends honesty and clarity to each of them. There were no winners in this scandal; everyone came off bad (except, perhaps for Monica Lewinsky who was used for her body by the President and harassed and bullied by his desperate adversaries in the Starr office). Though Toobin cuts through the bs to show that Clinton was railroaded, he also gives equal measure to Clinton's hubris and that of his lawyers. It's as evenhanded of a portrayal as one can expect."}, {"userName": "Pablo", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/22234506-pablo", "userReview": "There's no doubt that Toobin is a sophisticated writer and an engaging storyteller, but ultimately all the legal erudition and political savvy couldn't rescue the book from the tabloid-y gossip in which it wallows.The book does provide quite a bit of insight into the political machinations and personal vendettas that fueled this scandal, but I couldn't escape without feeling like too much brainpower had been expended on the topic.Still, this was the dominant political scandal of my childhood, and, thanks to A Vast Conspiracy, I now have a pretty strong grasp of it."}, {"userName": "Kamala", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/38437163-kamala", "userReview": "I was excited to read this book, as I as pretty young when this whole situation unfolded. What I found was a book with a LOT of information on the Clinton scandal, but it was really too much. I found A Vast Conspiracy to be somewhat repetitive, and just much longer than it needed to be to get the story out there."}, {"userName": "Emi", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/26632650-emi", "userReview": "Jeffrey Toobin is definitely one of the best non-fiction writers I know. This particular story is about the Monica Lewinsky. I still remember the scandal, so it was very interesting to read all the different aspects of this story. This story was not quite as good as his OJ Simpson book, but still a compelling narrative."}, {"userName": "Afshin Afshar", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/34863745-afshin-afshar", "userReview": "Jeffry Toobin does an excellent job of breaking down this curious and perhaps shameful (for all involved) episode in American history. He presents personalities, facts, processes, and the dynamics between them in a fascinating and captivating manner. A very enjoyable read for those who want to know what this entire thing was all about, how it started and eventually ended."}, {"userName": "Miranda", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/64485311-miranda", "userReview": "I loved The Run of His Life and Jeffrey Toobin did not disappoint with this book. I was a little kid during the Clinton impeachment trial so there was a lot that I didn't know before I read this book."}, {"userName": "Ryan", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/1263607-ryan", "userReview": "A deep dive into something I didn't have a ton of interest in, although it ended up being quite fascinating, especially from a legal perspective. Toobin's commentary and bias lays on a little thick at times."}, {"userName": "Laura", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/10661407-laura", "userReview": "Toobin's OJ Simpson book was better"}, {"userName": "Thushara Vithanage", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/13682856-thushara-vithanage", "userReview": "This book should made into a good TV series. :-)"}, {"userName": "Beth", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/522818-beth", "userReview": "Maybe this would have been better if I had read the physical book, but it was a bit of a dull listen for me."}, {"userName": "Tom Kammerer", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/24076359-tom-kammerer", "userReview": "Toobin tells a gripping tale that pulls the reader along"}, {"userName": "Charissa", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/5632494-charissa", "userReview": "I loved Jeffrey Toobin's book on OJ Simpson, \"The Run of His Life,\" so I read \"A Vast Conspiracy\" in the hopes that it would be as equally gripping and enlightening a tale of the Clinton/Lewinsky story. While this book is interesting, it gets very bogged down in procedural and legal details."}, {"userName": "Joseph", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/10481059-joseph", "userReview": "Complete and utter trash mixes with bold navigation through legal, political, and constitutional processes. Toobin, with liberties and licenses aside, illuminates every topic brightly and boldly with intelligent discussion and wise-cracking sarcasm. This book begins in a parking lot in Little Rock circa 1994 and ends in the ashes of late-90s kamikaze politics. The well-threaded thesis navigates three combustible and once tired forces that exploded in January 1998 -- well-financed and very bitter conservatives, invasive reporters and investigators (the running-on-fumes Starr office), and President Clinton's all-too-human weaknesses. The political and legal play-by-play is especially worth reading: as a former prosecutor, Toobin has a very good grasp on the plea/immunity negotiations between Lewinsky lawyers and Starr.An inherently fascinating topic with which to engage with, if only in the hopes of understanding these forces and hoping it never happens again. If that doesn't do, then a Tripp (haha) down memory lane will be fun enough. Get a used copy and haul this one to the beach."}, {"userName": "Bethany", "userReviewDate": "Aug 14, 2010", "userURL": "http://www.goodreads.com/user/show/71349-bethany", "userReview": "U-G-H. I wanted to read this book because I love Jeffrey Toobin (especially The Nine), and I wanted more of the story of how/why President Clinton got impeached. The opening was great, in which Toobin laid out the forces that converged on Clinton - the transformation of politics into legal battles initiated by the left during civil rights but then co-opted by the conservatives to take down Clinton, the many determined Clinton haters, the media's obsession with sex, and of course Clinton's own serial sexual activities... That part was good. But then it just devolved into a horribly disgusting tale of Clinton and a bunch of women in a Sodom & Gomorrah-type scene. I eventually gave up. Obviously that stuff is part of the story, but I thought it'd be kind of a trigger and more of the focus would be on background forces and behind-the-scenes people. Maybe eventually it becomes that, but I grew to nauseated to continue. I wish he'd been impeached for something more dignified. Yucko."}, {"userName": "Kelly", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/1594360-kelly", "userReview": "I will admit it was a little difficult to put out of my mind that that author of this book has been involved in a sex scandal of his own and fathered a child outside of his marriage. The man I used to call \"The Smart and Dreamy Jeffrey Toobin\" was tarnished in my eyes a bit. That being said, I enjoyed this well-reported telling of the Clinton Sex Scandal. The peek behind the scenes and the spelling out of all the times the situation could have been defused if it weren't for egos and ambition out of control was fascinating. And thank goodness SOMEONE took the time to read through all the documentation.There was a whiff of misogyny in the way Toobin portrays some of the women who played key roles, they were pathetic and needy while the men were acting on ambition and yes, probably thinking with the wrong head at times but did not come across as weak."}, {"userName": "Evan Rocher", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/34705940-evan-rocher", "userReview": "Interesting read. It's another Toobin in-depth reporting of a legal crisis. His analysis of the case is insightful, and it gives a fantastic feel for just how grimy, personal, and absurd the whole case against Clinton was. However, I'm curious about his sourcing for many of the conversations in the book--e.g. Goldstein's and Tripp's stuff. Toobin is a trustworthy journalist, but I walked away from some of the behind-the-scenes stuff (especially with the prosecution witnesses and the less connected members of the 'vast right-wing conspiracy') wondering how faithfully Toobin's sources had reported events. This would irritate me a lot less if Toobin presented these vignettes with a [i]caveat emptor[i] about their reliability. Still, a very enjoyable read. Be warned that parts can be frustratingly petty, but that's just how Tripp et al were."}, {"userName": "Riley", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/310425-riley", "userReview": "I never thought I'd again want to relive the silliness that was the Clinton impeachment, but I enjoyed this book nonetheless. Even in the lows of today's toxic politics, I think the Starr investigation is arguably the nadir, at least in my lifetime.As author Jeffrey Toobin concludes:\"At some point in the distant future, Americans will likely regard this entire fin de siecle spasm of decadence with incredulity -- at the tawdriness of the president's behavior, at the fanaticism of his pursuers, and at the shabbiness of the political, legal and journalistic systems in which this story festered. Mostly, though, these baffled future citizens will struggle with the same question about Bill Clinton. He was impeached for what? The answer will honor neither the president nor his times.\""}, {"userName": "Sue", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/11440698-sue", "userReview": "My purpose for reading this book was purely for documentation. I found the dates etc. that I needed however did not feel it necessary to read the gaudy details. The direct assessment of the of the facts were all I really needed. It is unfortunate that such detailed ugly account of the whole matter was written to reveal such a shabby, ugly case. I agree that when we elect a president of the U.S. we elect imperfect individuals, who's conduct can be less perfect. After 400 pages of investigations,,, litigations,,,& testimonies ,it was vindicating that on Feb. 12,1999 the senate so ordered that William Jefferson Clinton be acquitted of the charges, leaving him to work out his full term.."}, {"userName": "Evan", "userReviewDate": "Jan 24, 2010", "userURL": "http://www.goodreads.com/user/show/1178141-evan", "userReview": "I love Toobin, but--for me--this wasn't as compelling as some of his other books. It was still a pretty interesting read, but it didn't grab me in the same way that his O.J. book did. I think I was also pretty annoyed by the cast of characters. Clinton certainly told some lies in his day, and the tenacity and cold-heartedness with which the \"vast right-wing conspiracy\" went after him was pretty disgusting. Definitely a good read if you want a well-researched and comprehensive overview of the scandals of Clinton's presidency, but not as much of a page-turner as \"The Run of His Life.\""}, {"userName": "Evan Kostelka", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/6121353-evan-kostelka", "userReview": "This book goes into all the details about the near-impeachment of Bill Clinton. I was young and out of touch with politics when this was going on so it was interesting to read about all the rumors/accusations swirling around during this time. The author tried to present the story as compelling as he could, it still gets bogged down in so many names and relationships, however. He has a handy who's who in the front as well as a chronology to help you out."}, {"userName": "Nisha", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/4948572-nisha", "userReview": "Is it terrible to say I wanted more trashy Monica Lewinsky gossip? Because I did. I was ten or eleven years old when this all came about so details were fuzzy. The whole back story was appalling. I could have used much less Kenneth Starr but obviously it was needed since the book's underlying theme is vast conspiracy! I can never get enough of Toobin."}, {"userName": "Jessica Leight", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/27301150-jessica-leight", "userReview": "This is an interesting book that provides a detailed, grounded and clear overview of the convoluted Clinton scandal. There is nothing particularly original here, but it's a valuable narrative that's hard to find anywhere else, and Toobin writes it well. If you're interested in the political history of the period, the book is well worth reading."}, {"userName": "zltg", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/4961628-zltg", "userReview": "The book deserves two stars instead of more not because it is badly written but rather due to the inherent triviality of the subject matter. I think Toobin's view that the political system has hijacked the judicial system has great merit and it is pity that he did not expand this viewpoint in detail but delved into petty details of the pathetic case."}, {"userName": "Gretchen", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/3069900-gretchen", "userReview": "So far, all right. It is fascinating to read this now. I lived thru it, but wasn't really paying attention. The detail is rich. But, as with The Nine, Toobin doesn't hide his opinions. Which is fine, but the book is either a narrative report or a running editorial; can't be both."}], "description": "THE NATIONAL BESTSELLER  It was the most extraordinary public saga of our time, and Jeffrey Toobin gives us a definitive history of the ordeal that very nearly brought down a president. Here is the whole story of the Clinton sex scandals -- from its beginnings in a Little Rock hotel to its climax on the floor of the United States Senate with only the second vote on presidential removal in American history. Rich with Shakespearean characters and dramatic secrets, fueled with the high octane of a sensational legal thriller, and tinged by misguided, outlandish behavior that was played out at the very highest levels, Toobin's A Vast Conspiracy brings a dignity and integrity to this story that it has never before received.  The Clinton sex scandals will shape forever how we think about the signature issues of our day -- sex, privacy, civil rights, and, yes, cigars. A Vast Conspiracy will shape forever how we think about the Clinton scandals.", "title": "A   Vast Conspiracy: The Real Story of the Sex Scandal That Nearly Brought Down a President", "url": "http://www.goodreads.com/book/show/681873.A_Vast_Conspiracy", "average": 3.87, "cover": "https://images.gr-assets.com/books/1348115906l/681873.jpg", "reviews": 44, "authors": [{"url": "https://www.goodreads.com/author/show/163130.Jeffrey_Toobin", "name": "Jeffrey Toobin"}], "type": ["Nonfiction", "Politics", "History"], "outlinks": ["http://www.goodreads.com/book/show/681873.A_Vast_Conspiracy", "http://www.goodreads.com/book/show/16098962-a-vast-conspiracy", "http://www.goodreads.com/book/show/34839553-a-vast-conspiracy", "http://www.goodreads.com/book/show/19216267-a-vast-conspiracy", "http://www.goodreads.com/book/show/280413.A_Vast_Conspiracy", "http://www.goodreads.com/book/show/280410.The_Nine", "http://www.goodreads.com/book/show/280412.The_Run_of_His_Life_", "http://www.goodreads.com/book/show/28007903-american-heiress", "http://www.goodreads.com/book/show/13331179-the-oath", "http://www.goodreads.com/book/show/280411.Too_Close_to_Call"]}