{"ratings": 5373, "userreviews": [{"userName": "Cheri", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Last August I read Rick Bragg’s “All Over But the Shoutin’” and was swept away by the poetry of his story, his family’s story, a story born of pain and sorrow and sadness and poverty. But as poor as his family might have been, they were rich in love, imagination, tradition, and family, in the things that matter most.Ava was Bragg’s grandmother, his grandfather Charlie whom he never met as his grandfather’s death preceded Rick Bragg’s birth, and although he knew some details about his grandfather before he set out to write his story, he wanted to hear who this man had been, and so he sought out those old enough to share his grandfather’s stories.”’After Daddy died,’ my momma told me, ‘it was like there was nothin’.’ I remember the night, an icy night in December, I asked three of Charlie Bundrum’s daughter to tell me about his funeral. I sat in embarrassment as my aunts, all in their sixties, just stared hard at the floor. Juanita, tough as whalebone and hell, began to softly cry, and Jo, who has survived Uncle John and ulcers, wiped at her eyes. My mother, Margaret, got up and left the room. For coffee, she said. What kind of man was this, I wondered, who is so beloved, so missed, that the mere mention of his death would make them cry forty-two years after he was preached into the sky? A man like that, I thought to myself, probably deserves a book.”The beauty of this book, and there is so much beauty inside, is in Rick Bragg’s telling of this story of Charlie Bundrum’s life, how he came to be married to Ava when she was just sixteen and he was seventeen. The life they lived, the children they had, the heartaches, the happiness, the upheaval, the pursuit of a tiny bit of prosperity, and the abundance of love. It is also a story of the Great Depression, its impact on an area still suffering economic atrophy from Reconstruction. ”People with deep roots stood fast in the doorways of ancestral homes, and lost everything. People without roots, the wanderers like Charlie Bundrum, drifted with the times, and survived.”Bragg’s older brother, Sam, is old enough to have been saved a bit by Charlie, he has a dime on a string he has almost always owned, given to him by their grandfather Charlie, but while his memories of the man are tied to this dime, they lack the shine and definition that the dime has, in some areas. On a day they went out to fish, and Rick Bragg is unusually successful; where his older brother, who has heretofore outfished his baby brother, has caught nothing this day, Bragg has caught six bass. Sam dismisses it, saying:“’Ricky,’ he said, ‘I was fishin’ for the big fish. Then he stared up at a perfect blue sky, a sky without a cloud. ‘And everybody knows,’ he said, ‘the big fish won’t bite on a bluebird day.’ I just looked at him, because I did not have a rock to throw. On the one day I outfish him, he is spouting poetry. Yet I could not help but wonder where that phrase, that lovely phrase, came from. Who still talks like that, I wondered, in a modern-day South that has become so homogenized, so bland, that middle school children in Atlanta make fun of people who sound Southern? I found it was just something my grandfather and men like him used to say, something passed down to him, to us, like a silver pocket watch. “A man like Charlie Bundrum doesn’t leave much else, not title or property, not even letters in the attic. There’s just stories, all told second-and thirdhand, as long as somebody remembers. The thing to do, if you can, is write them down on new paper.”Bragg’s writing is magical, easily transporting me back to another era before my time, a place I’ve likely never been, to hear stories about people I’ve never met, - but I could see it all so clearly, could see the lightening bugs, and smell Charlie’s likker, hear Charlie telling his own stories. But there is more, as much as I loved hearing Charlie’s story, Ava’s Man’s story, there’s Rick Bragg, himself, all of his family, the strong sense of family, the draw that keeps us returning to that place, those people that our hearts know as family, that are hearts see as home. “Can I get a hallelujahCan I get an amenFeels like the Holy Ghost running through yaWhen I play the highway FMI find my soul revivalSinging every single verseYeah I guess that’s my church”\tMaren Morris - My Church written by Michael Ford Busbee, Maren MorrisRecommended"}, {"userName": "Chrissie", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "NO SPOILERS!!!On completion: I am sad to leave this book. It was a delight to read. I fell in love with Charlie, Ava's Man. the author's grandfather. Rick Bragg talked with all his relatives to find out about his grandfather. He was in fact born after his death. It wasn't easy finding out about Charlie because when he died everybody simply could no longer talk about him. It was too hurtful. You can look at this man and say he wasn't so great; he did so many things he shouldn't do. The fact is he was great! Why? Well, because he did so many things he should do, too, and he did these things so darn well. He was a great father. You could depend upon him. The times were tough, but he pulled all of his kids through except one who died. He pulled them through to such an extent that they never wanted to be far from him. They could always rely on him. So how bad is it to make a little likker on the side, to cuss, to wear ventilated, sometimes dirty, patched overalls and to brawl now and then when you see what he did achieve. He gave security and love to those in his famuily. He built a wall around his home and he never brought his likker inside that wall. He knew that would cause grief, So he stuck to that rule. I recommend you read this book because it is a delight to know this person. I see him as a model figure for how a father should be. At the same time you really learn how it was to live through the Depression in the South. I like books that teach something. This did. The witing was magical because it conveyed a time and a place that I didn't know at all and made it so real I could touch and smell and see and hear and feel it inside of me. Maybe I should have given it five stars, but I think I didn't quite feel for any of the other characters as much. When he dies the book looses steam, but that is only about a chapter from the last page. Not terribly much happens, but you do get to know a wonderful human being! I feel most comfortable with four stars, so that is what it gets. *****************************************OK, this is my last quote, for more you must read the book. So all the men, just about all of them were making their own likker, down in the South along the border between Georgia and Alabama. Charlie simply had to, during the Depression you took any opportunity available to bring home a little cash, for food or to pay doctors. He had six kids! And his likker never killed anyone. He made good likker. Nothing poisonous, like others did. It wasn't a big operation, no indeed. The revenuers there paid absolutely no mind to Charlie Bundrum or his little moonshine still, it would have been like arresting someone for popping bubble gum in the middle of Mardi Gras. (page 143)***********************************I am halway through, and enjoying every minute of it. Rick Bragg can write. He can make stories about likker and lightning bugs and ghosts. You will believe them just as I do. What a storyteller! Ghost stories begin like this. But then drinking stories, begin this way too. (Page 130) I don't drink, b/c it's messy with diabetes. It is not that I have anything against others that do! The book takes place during the Prohibition, and I am a law-abiding type, but these stories are delightful. Men drank. Men worked. Men fought. By the time you were thirteen or fourteen, you were a man, or else something pitiful.......But this was one of the reasons they loved him.(Ava's man, i.e. Charlie, the author's grandfather)His nature, his fine nature, was not turned ugly by it. He drank and he laughed and he drank and he sang and he drank and he told good stories, and sometimes he drank and he just went to bed smiling. (page 132)The prose is like a song.***************************************Just a taste of the author's wonderful knack for telling a story; (Page44-45)By his momma's death, Charlie was more man than most ever get, a tall, hard, strong and smiling man, as if he were immune to the fires that had scorched him, if not purified by them.He lived for fiddle music and corn likker, and became a white-hot banjo picker, and a buck dancer and a ladies' man, because women just love a man who can dance. At seventeen he could cut lumber all day, then tell stories all night, and people in the foothills said he would never settle down or maybe even amount to much. But the boy would charma bird off a wire. And there seemed to be no fear in him, no fear at all. It was almost as if he had died already, met the devil and knew he could charm him or trick him or even whip him, because what did ol' Scratch have left to show him that he had not already seen. You get folk songs too, that make you want to hum along. And if yu are wondering what a buck dancer is, worry no more. Read the book, and you will know and be able to see it in your mind's eye. This book is about the author's grandfather and mother who grew up in the Appalachian foothills, in towns straddling the Alabama and Georgia state line, before and during the Depression. I can tell right now that one should pick up this book to roll the words around in your mouth before swallowing them. The author won a Pulitzer Prize. I think it was for this book, if I remember correctly. And I love reading it on my Kindle! Can reading be this simple and delightful?!"}, {"userName": "Kirk Smith", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "I enjoyed this so much I could almost just start over and read again. I found Rick Bragg's style to be pure reading pleasure. Gosh that was good!"}, {"userName": "Snotchocheez", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "In 2004, I (by happenstance, if not a strange, whimsical predestination) found myself uprooted from 35 years of stasis in Los Angeles, and replanted in semi-rural Northeast Alabama. Many of my friends and acquaintances back home (and, heck, most people I meet here) wonder why I'd do something that crazy. I really don't have an explanation for any of them, but after reading Rick Bragg's brilliant love-letter to NE Alabama and his family (\"Ava's Man\"), I can direct any questioners of my sanity to this book to glean why I might possibly have found my life (and my home) here, in a place where the 21st century struggles to catch up with the rest of the country.Had I not been recommended this book by a friend of mine, I probably wouldn't have given Mr. Bragg's account of life here (and more specifically, of his grandfather Charlie Bundrum) a second glace. Biographies tend to bore me senseless, and upon encountering this book at Guntersville Library (with a visage of a sepia-toned nondescript nattily-dressed depression-era man) I thought it'd be a snooze-fest.Needless to say, it's not. While I live today not more than 40 minutes from the Coosa River (whose banks were in proximity of many of the places the Bundrum family relocated to to escape the ravages of poverty in Depression-era Alabama), the book's message (while South-centric) is absolutely universal. At first perusal, it just seems like a fawning tribute by a former-Alabamian to his grandfather. When you dig a little deeper, you discover a burbling, vibrant pulse coursing through the book's veins. There's much more here than meets the eye. Mr. Bragg (a Pulitzer Prize winner for Feature Writing in 1996 while writing for the New York Times at their Atlanta desk, and a dyed-in-the wool Alabamian) brings his talents to the fore in providing a patchwork pastiche describing the jubilation, the heartbreak, the enduring (and unbreakable) ties that that bind the Bundrum family together in one of the most adverse of scenarios imaginable.Mr. Bragg does in 250 pages what I'd never be able to do: describe (big ugly warts and all) my newly adopted home, and explain (concisely, and universally) its appeal to me. The best I can do is sing the book's praises to every potential reader I encounter, and hope that some take my advice and just read the damn book, already. (In light of the fact that despite the book's settings being one hour north and west of here, and that a whole \nchapter\n is devoted to the town of Guntersville, AL where I live, and that I checked this book (written in 2001) out from Guntersville Library, and find from the \"date due\" stamped page that only FIVE of my fellow patrons checked it out before me, I've certainly got a lot of work to do)."}, {"userName": "Kathleen", "userReviewDate": "Nov 02, 2010", "userURL": "http://www.goodreads.com/user/show/883089-kathleen", "userReview": "I read All Over But the Shoutin' about 10 years ago, and thought it amazing. Why I have waited so long to read another Rick Bragg book, I have no idea. Ava's Man is the story of Charlie Bundrum, Mr. Bragg's grandfather, who died before he was born. It is a living story though, vibrant and powerful, showing why Charlie Bundrum is a legend in his own family, but also showing his flaws. Mr. Bragg has a wonderful facility with words, and there are so many delightful turns of phrase in this book. You just skip from one to the next, sucking them in and turning them over in your mouth, like hard candy. Ava's Man was really a pleasure to read.Living in North Alabama myself, I enjoyed the familiarity of many of the locales and marvelled at how much the characters in the book reminded me of people I know. More than just a story of his own family, Mr. Bragg tells the story of a place and a time in a truly beautiful way.I had the pleasure of hearing Mr. Bragg speak at a recent book festival in Nashville and he made me laugh hard and think harder. So did this book. I sat down to write this review and gave the book four stars, as I thought it not as excellent a read as All Over but the Shoutin'. Heck, though, what is? This one rates five too."}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "Rick Bragg never knew his maternal grandfather, Charlie, but the man is a legend among the family and friends he left behind. A good provider, a loving father, a teasing husband, a loyal friend, he was also a bootlegger who loved his own product and had a temper. He never turned it on anyone who didn't deserve it, and apparently some of the best stories about him took place when he'd been drinking.My uncle has been telling me for--oh, years now, that I just have to read Rick Bragg. I do take his recommendations seriously, but my to-read list is out of control and I'm just now getting to him. How I wish I had listened to my uncle earlier. I will not be waiting years to read more of Bragg's work, that is for sure.This book was great. It just felt like home, and can there be any higher praise for a book? Granted, my daddy doesn't drink alcohol and my parents still live in the same house we grew up in, but Bragg's language and stories felt right in a way that is hard to explain. They settled on me like well-worn clothes or shoes, for all that I've never read his work before. Read this: \"He spoke in the language--the very specific language--of the Appalachian foothills. It was an unusual mix of formal English and mountain dialect. The simple word 'him' was two distinct sounds--'he-yum.' And a phrase like \"Well, I better go,\" was, in the language of our people, more likely to sound like 'Weeeelllll, Ah bet' go.' Some words are chopped off and some are stretched out till they moan, creating a language like the terrain itself. Think of that language as a series of mountains, cliffs, valleys, and sinkholes, where only these people, born and raised here, know the trails.\" Yes. That. I have never and don't think I will ever read a better description of our dialect. That is it, right there. Don't judge it; listen to it and relax into it, give us time to get to our point, and enjoy the ride. It's easy to see why Charlie's family still mourns him. His breed is becoming more and more scarce in the \"New South.\" Bragg writes about this in his epilogue. \"The realities of this new, true South are not as romantic as in Charlie's time, as bleak and painful as that time was for people of his class. The new, true South is, for people like him, a South of mills that will never reopen, of fields that will never be planted again, of train tracks that are being turned into bicycle trails. In the new, true South, it is harder to be poor and proud, harder to work your way into an unapologetic, hard-eyed independence.\" It's true. But we still see remnants and throwbacks from that time, and we honor them. Men like Charlie might not have had much education, but they did what they had to do to feed their families and they never backed down. They wrung every bit of life that they could out of their allotted time.All that sounds all serious, but my favorite parts were the funny stories, and there were plenty of those. I kept reading bits aloud to my husband, and even he (not a Southerner or a reader) would bust out laughing. He'll still say, \"But God ain't that gravy good,\" and crack himself up. That was a great story. I think I read that one to anyone who would listen for a few days, and they all laughed out loud as well. There are a few run-ins with the law, some run-ins with honest-to-goodness criminals, tales of fishing on the river, friends and strays picked up and cared for along the way, children and grandchildren loved beyond all reason, and Charlie's own hilarious quirks and screw-ups.There's no big theme or lesson or plot here, just stories about a good man doing his best in a changing world. Except that is a lesson in itself, isn't it? Bragg obviously misses the grandfather he never met, and he writes so beautifully about Charlie that I miss him as well. Pick this one up, laugh and cry by turns, and be thankful that you got to know him too."}, {"userName": "d Kate dooley", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/5227992-d-kate-dooley", "userReview": "This is a book to read outloud to your best friend. Then read it again, so you repeat all the good parts to yourself. Read it while the rain falls on a tin roof. Read it beside the woodstove. Read it in the cab of a pickup truck while the windshield wipers keep time. Read it to your kids. Read it to your kids in the rain by the light of a kerosene lamp. Keep it on a shelf in the kitchen and when you're feeling down, open anywhere and read. It's like music from an old time radio."}, {"userName": "Kg", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/21323551-kg", "userReview": "This book is definitely on my top ten favorites shelf, and will remain there no matter how many more books I may read and love. The language conveys a heavy, burdened, hot rural Depression-era south, and with so much love and respect. Rick Bragg never got to meet his grandfather and has pieced together this tale from stories gathered from aunts, his mother, grandmother and friends. Charlie Bundrum is an everyday hero, working hard and trying to feed a family on a meager existence in a time when no one had much of anything except their family to lean on. One part that stays with me always is this: For years after her husband's death, people would ask Ava Bundrum why she didn't go get herself a man. She'd always reply, \"I ain't goin' get me no man. I had me one.\" There are so many wonderfully sweet, heartbreaking, beautiful stories here- it's dense with adoration, and for good reason. Charlie Bundrum isn't typically the kind of person a book gets written about, but after reading, you'll know why Rick Bragg wrote it. I've read this book twice now, and I have listened to the audiobook read by the author more times than that. I can't get enough, nor can I say enough about how much this book affected me. I have given it as a gift to more than one person- if you have a heart and love to read a master-storyteller unfold his craft, you'll fall in love with this book, too."}, {"userName": "Yaaresse", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/20735143-yaaresse", "userReview": "This was a great way to end the 2017 reading year. It's a solid 4.5, but I'm rounding up for sentimental reasons. I see a lot of my step-grandad, dad and uncles in this book. (I was going to say \"aside from the moonshine,\" but now that I think about it....) Ava's Man is the second of Rick Bragg's books about his family. Where All Over but the Shoutin' focused mostly on Bragg's mother and the family's conflicted emotions surrounding his mostly absent, alcoholic, and abusive father, this book goes farther into the past and focuses on Bragg's maternal grandfather. As usual, Bragg doesn't pretty up much, but it's clear that Charlie Bundrum was a larger-than-life man who, like many southern men in the early 1900s rural south, worked hard and lived harder. While I enjoyed both books, I think this one flows a little better and is more focused. This isn't necessarily a sequel, but it probably is a good idea to read them in order since he does give a more basic explanation of how everyone is related in the first book."}, {"userName": "James", "userReviewDate": "Mar 28, 2007", "userURL": "http://www.goodreads.com/user/show/15436-james", "userReview": "A wonderfully gritty biography of the author's grandfather, whom he knows only through family legend, sung beautifully in the voice of the south. Dripping in metaphors and history, it left me whistful for my own past and thankful to be among my family as I absorbed it. As it's sat around the house it's been picked up by almost everyone and has developed an impromptu waiting list. I'm off to drop it at my Grandma Amy's right now."}, {"userName": "Amy Kannel", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/13118895-amy-kannel", "userReview": "Some people can tell a good story—-the kind that makes you crazy to find out what happens, and then brokenhearted when it’s over. Some people can string words and sentences together in a way that makes the English language sing, and makes you marvel at the craft of writing. Rick Bragg is both, brilliantly. His sequel to All Over But the Shoutin’ is every bit as poignant and stirring."}, {"userName": "Connie", "userReviewDate": "Jun 03, 2009", "userURL": "http://www.goodreads.com/user/show/136416-connie", "userReview": "This is the biography of Rick Bragg's grandfather, a hard-drinking, hard-fighting man who loved his family but couldn't always support them. Very well written but I had to wonder if he was worth all the ancestor worship. An interesting look at growing up very poor and white in the south. He does not mention blacks at all but surely they were a part of his grandfather's world."}, {"userName": "Kim", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/21874204-kim", "userReview": "Rick Bragg is a five-star author on my personal spreadsheet of fame."}, {"userName": "Lori L (She Treads Softly) ", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/4592109-lori-l-she-treads-softly", "userReview": "In Ava's Man Rick Bragg has written a unique tribute to his maternal grandfather, Charlie Bundrum, a man he never knew but one he learned about through the stories of others. Bragg introduces us to Charlie through the carefully written anecdotes he has collected from those who knew Charlie personally. Charlie was a husband, father, roofer, and bootlegger. He was a man who lived by his own personal code in a specific area and place in time.Charlie Bundrum was \"so beloved, so missed, that the mere mention of his death would make them [his grown daughters] cry forty-two years after he was preached into the sky.\"(pg. 9) \"He grew up in hateful poverty, fought it all his life and died with nothing but a family that worshiped him and a name that gleams like new money.\" (pg. 12) Bragg said that he wrote this book in response to those who told him that he \"short-shrifted them in the first book, especially about Charlie, about Ava, about their children\" (pg.13) After Bragg's All Over but the Shoutin' readers wanted to know more about the people who were his mother's parents.In this tribute to his grandfather, Bragg has crafted an amazing, descriptive portrait of his grandfather, a man who lived in crushing poverty during the Depression. He protected his children at all costs. He liked to drink the \"likker\" he distilled, yet he was a drinker who would laugh rather than get angry. \"Even as a boy, he thought people who steal were trash, real trash. 'And a man who'll lie,' he said, even back then, 'will steal.' \" (pg. 53) This biography of Charlie Bundrum is a truly amazing tribute. Bragg's use of language clearly evokes the time and place as well as establishing the characters. This is a memoir that could have become maudlin, but I really think that the quality of Bragg's writing sustains the narrative and elevates it above the ordinary. This is a genuine, honest, portrait of the grandfather Bragg never knew except through the stories of others and a book that should be treasured for generations to come.Very Highly Recommended - one of the best; http://shetreadssoftly.blogspot.com/"}, {"userName": "Kay Johnson", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/2934886-kay-johnson", "userReview": "This follow-up to All Over But the Shoutin' shows us once again why Rick Bragg was honored with the Pulitzer Prize. This story chronicles the life of his grandfather, who Bragg never knew. He relied on the stories and legends handed down from family. Bragg's family is a sort of antithesis to the Tara and Twelve Oaks crowd of Gone with the Wind Fame. Having grown up in the south myself, I learned a great deal about southerners, like me, who aren't part of the mint-julep, debutante South. No, our people WORKED for the mint-julep, debutantes. Indeed, the only people who had it worse than poor whites in the Depression and post-Depression South were poor blacks. He puts a human face on thousands of nameless people, like his family, who picked cotton, took in ironing, grew their own gardens, hunted for dinner in the woods and at the end of a fishing pole, and brewed their own version of southern comfort. As my Dad read this story, he laughed and shook his head and often looked up to say, \"I know these people.\" I felt the same way, and I'm a generation removed. A fascinating read that reminds us that the prosperity we enjoy today was won on the backs of people just like the ones portrayed in Bragg's book."}, {"userName": "Deb", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/3422309-deb", "userReview": "Author Rick Bragg tells the story of his grandfather, Charlie Bundrum, using the stories told by Charlie's children and grandchildren during a family reunion in 1999. Charlie is a larger-than-life character; a tall, strong man who fiercely loved and protected his family all his life. His story is set in the time of the Great Depression, in rural Alabama. My favorite quote:\"He ought to have a monument,\" Travis says, \"because there ain't no more like him. All his kind are gone.In a time when a nation drowning in its poor never so resented them, in the lingering pain of Reconstruction, in the great Depression and the recovery that never quite reached all the way to my people, Charlie Bundrum took giant steps in rundown boots. He grew up in a hateful poverty, fought it all his life and died with nothing except a family that worshipped him and a name that gleams like new money. When he died, mourners packed Tredegar Congregational Holiness Church. Men in overalls and oil-stained jumpers and women with hands stung red from picking okra sat by men in dry-cleaned suits and women in dresses bought on Peachtree Street, and even the preacher cried."}, {"userName": "Susanhayeshotmail.com", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/2712657-susanhayeshotmail-com", "userReview": "Oh.my.word. How have I lived without this author? I cannot wait to get my hands on his other books because this is one heapin' helping of wonderful! Rick Bragg never knew his grandaddy, Charlie Bundrum, and also knew remarkably little about him as well. Bragg set about rectifying the situation by asking questions at the family reunion. Turns out the lack of information is not, as he feared, because Charlie was a scallywag, which he was to a certain degree, but because Charlie was so loved and respected that to talk about him seemed to stir up grief and make the loss of him fresh and sad again. I understand as I do believe I have fallen a little in love with Charlie myself. Bragg's memoir does an outstanding job painting a very real and warm picture of Charlie as well as the time and place he lived in. I could hardly put it down and a week later I'm still sad it's over. Thank you Nicole for passing it my way!"}, {"userName": "Kendra", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/5983505-kendra", "userReview": "Thoroughly enjoyed this book...everything about it. The story is about the author's grandfather, Charlie Bundrum, who died before Bragg was born. As Bragg writes in the book, [Charlie] \"was just a man, I guess, whose wings never quite fit him right.\"I don't usually read non-fiction and I was leery but I am so happy that I trusted the suggestion of a friend and the many fabulous reviews. Bragg's way of writing captivated and delighted me. As someone born and raised in the south and a member of a classic (and a bit cliched) southern family clan, I could relate and see bits of my own family in every corner of this story. I stopped several times to lovingly reflect on personal stories and passed loved ones. I reread entire chapters just to enjoy Bragg's story-telling again.I recommend this one...and I believe you'll enjoy it even more if you're from the south."}, {"userName": "Gail P", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/26786299-gail-p", "userReview": "Heart felt story. If I hadn't read \"All's over but the Shoutin \" first I probably would have given it a 5 star. \"All's over but the Shoutin \" is the better work. It's difficult to reach back in time, recent times particularly - times almost remembered. My parents grew up in Alabama during the great depression. I was talking to my father not long before he died at 81. He spoke a little of the hardness, but he was overcome by misery by the memories of the boys - black boys - who were his friends. He started crying as he told me they were so hungry they were eating worms.It would take thousands of such stories to tell the misery of the depression."}, {"userName": "Gerald McFarland", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/16746640-gerald-mcfarland", "userReview": "This story of a backcountry man, Charlie Bundrum, ends up being a history of him and his family through the first half of the twentieth century. Charlie is a brawler, a moonshine maker and drinker, and a troublemaker. Most of his troubles are his own fault. Moving his family back and forth across the border between Alabama and Georgia, often because the law's after him or he's out of work, he somehow manages to provide food for his family. In the end, despite all his faults, he's loved by his extended family. It's a rousing tale told in a droll manner, but three stars is as high as I would go."}, {"userName": "Chanel", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/6026487-chanel", "userReview": "This was a really good book. Ava's Man who husband's name was Charlie Bundrum was a blue collar man full of pride, strength, determination and character. He worked hard to keep his family from poverty during the Depression by doing all types of odd jobs. This book takes place in a time when community really matter. They don't make men like Mr. Bundrum anymore. It was extremely refreshing to revisit this hard but simpler time of life. His grandson (the author) Rick Bragg did a wonderful job giving this tribute to his grandfather by bringing him back to life. I really enjoyed it."}, {"userName": "Danika", "userReviewDate": "Jun 12, 2011", "userURL": "http://www.goodreads.com/user/show/193449-danika", "userReview": "This is an awful lot like Bragg's earlier book, \"All Over but the Shoutin'\". If you liked that one, you'll definitely enjoy this memoir, which is based on Rick's grandfather Charlie (who he never met). Set in Alabama/Georgia and spanning Charlie's life, mostly after his marriage to Ava. Lots of \"likker\", fighting and poverty. But Charlie seems like a pretty admirable guy who inspires admiration in all who know him."}, {"userName": "Sarah", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/12024724-sarah", "userReview": "Rick Bragg pens a beautiful tribute to the grandfather he never knew. This was a man devoted to his family, not a man without faults (which the author shares as well), but a man who left his family with a legacy of love and kindness after pushing through really tough times in the poverty stricken South. Lots of laughs and suspense to balance the heartfelt moments. I thoroughly enjoyed this book. Southerners, you will relate."}, {"userName": "Emily", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/4449127-emily", "userReview": "I wouldn't have picked this up if not for a much appreciated recommendation from one of my goodreads friends.Rick Bragg wrote a loving tribute to his grandfather, a man he only knew through family stories. Bragg paints a vivid picture of what growing up poor and raising a large family in the south was like before and during the Depression. The book is moving and in parts surprisingly humorous, with many passages that beg to be read out loud. I will definitely read more by this author."}, {"userName": "PennsyLady (Bev)", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/12364449-pennsylady-bev", "userReview": "I highly recommend this bookIn a beautifully touching manner, Bragg traces the life of his maternal grandfather.Bragg never knew Charlie Bundrum...but through family and community history , he paintsan authentic picture of this much loved Appalachian man.The audio was garnish to his story and made the tale compelling to continue.5* and a favoriteA special thanks to the bookworm challenge and Koren's shelf"}, {"userName": "Kendal", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/1764123-kendal", "userReview": "I love the way Bragg writes. My adoration of this book comes in part from my heritage. I grew up near where much of the book takes place. Bragg writes about poor or lower middle class southerners in a way that rarely works. His character are regal and what some would call \"white trash\" at the same time."}, {"userName": "Amy Wright", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/1611637-amy-wright", "userReview": "This book deserves 10 stars. One of the most beautifully written characterizations of a fine human being that I have ever read. I cried at the end, because it was over and because of the sweetness in which it came to a close. Well done Rick Bragg, Well done."}, {"userName": "Toni", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/991781-toni", "userReview": "I don't award five stars to many books, but Charlie's story is a real treasure and I savored every word of the author's almost poetic writing style. Thank you Rick Bragg for bringing the grandfather you never met to life. I don't think I will soon forget him."}, {"userName": "Catherine Shattuck", "userReviewDate": "Jan 02, 2012", "userURL": "http://www.goodreads.com/user/show/6453935-catherine-shattuck", "userReview": "Rick Bragg is one of the best living writers today. He sings the South alive with every beautiful word he writes."}, {"userName": "Rita Kay ", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/3466094-rita-kay", "userReview": "A touching story of southern life during the depression. There is a nobility about the simplicity and lack of sophistication of Charlie Bundrum, the author's grandfather who died before he was born."}], "description": "The Pulitzer Prize–winning author of All Over but the Shoutin’ continues his personal history of the Deep South with an evocation of his mother’s childhood in the Appalachian foothills during the Great Depression, and the magnificent story of the man who raised her.Charlie Bundrum was a roofer, a carpenter, a whiskey-maker, a fisherman who knew every inch of the Coosa River, made boats out of car hoods and knew how to pack a wound with brown sugar to stop the blood. He could not read, but he asked his wife, Ava, to read him the paper every day so he would not be ignorant. He was a man who took giant steps in rundown boots, a true hero whom history would otherwise have beem overlooked.In the decade of the Great Depression, Charlie moved his family twenty-one times, keeping seven children one step ahead of the poverty and starvation that threatened them from every side. He worked at the steel mill when the steel was rolling, or for a side of bacon or a bushel of peaches when it wasn’t. He paid the doctor who delivered his fourth daughter, Margaret -- Bragg’s mother -- with a jar of whiskey. He understood the finer points of the law as it applied to poor people and drinking men; he was a banjo player and a buck dancer who worked off fines when life got a little sideways, and he sang when he was drunk, where other men fought or cussed. He had a talent for living.His children revered him. When he died, cars lined the blacktop for more than a mile.Rick Bragg has built a soaring monument to the grandfather he never knew -- a father who stood by his family in hard times and left a backwoods legend behind -- in a book that blazes with his love for his family, and for a particular stretch of dirt road along the Alabama-Georgia border. A powerfully intimate piece of American history as it was experienced by the working people of the Deep South, a glorious record of a life of character, tenacity and indomitable joy and an unforgettable tribute to a vanishing culture, Ava’s Man is Rick Bragg at his stunning best.", "title": "Ava's Man", "url": "https://www.goodreads.com/book/show/108067.Ava_s_Man", "average": 4.22, "cover": "https://images.gr-assets.com/books/1320441819l/108067.jpg", "reviews": 504, "authors": [{"url": "https://www.goodreads.com/author/show/31122.Rick_Bragg", "name": "Rick Bragg"}], "type": ["Nonfiction", "Biography", "Autobiography", "American"], "outlinks": ["http://www.goodreads.com/book/show/108067.Ava_s_Man", "http://www.goodreads.com/book/show/34602239-ava-s-man", "http://www.goodreads.com/book/show/6555752-ava-s-man", "http://www.goodreads.com/book/show/470511.Ava_s_Man", "http://www.goodreads.com/book/show/2422269.Ava_s_Man", "http://www.goodreads.com/book/show/470495.All_Over_But_the_Shoutin_", "http://www.goodreads.com/book/show/2060666.The_Prince_of_Frogtown", "http://www.goodreads.com/book/show/24396962-my-southern-journey", "http://www.goodreads.com/book/show/6502869-the-most-they-ever-had", "http://www.goodreads.com/book/show/18635022-jerry-lee-lewis", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}