{"ratings": 54, "userreviews": [{"userName": "Claire Riley", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/4419930-claire-riley", "userReview": "Eli Constant has done it again, and this time she teamed up with author B.V. Barr to co-write this instant hit.This awesome woman never fails to surprise me, taking one of my favourite horror genres and twisting it into something even more brutal and chilling than I thought possible.Children. Z-Children to be more precise. What could be more horrifying than watching your own children turn into flesh eating monsters? Not much, and neither author held back on the gore and guts in this gut-wrenching horror story. (see what I did there? wink!)The story takes on an interesting layout, of several stories that cross paths at the beginning of the outbreak? Apocalypse? End of mankind? So many ways to describe these scenes... The stories show different angles, and different versions of events from several characters that I very quickly grew to like and dislike, but regardless, the end was always inevitable for them.The Z-children came.The Z-children fed.And the only way to stop these once beautiful little darlings is to kill them.It's both equal parts disturbing as it is awesome!\nI can not wait for book 2!"}, {"userName": "Becky Stephens", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/24779079-becky-stephens", "userReview": "Z Children: Awakening is a wild ride! The action begins immediately and doesn't stop until the very last page. It is a true page turner where I found myself holding my breath during the more suspenseful moments.I like that the authors chose to tell the individuals' stories from those characters' points of view. I feel that by choosing to write in first person instead of third person, we - the readers - feel like we're part of the story too. It feels as if a friend is telling me their story, not a stranger whose life to which I am indifferent. So, I care deeply about every minute detail and what happens to them. Each of their stories is unique and seemingly separate from the others. However, we soon see that their paths begin to intersect in the most interesting ways.What I love most about Z Children is that there was a thread of awareness in a particular group of the dead. I won't say more and spoil it for those of you who haven't read it yet, but know that these scenes are so well written that it's almost heartbreaking. Almost. They are still zombies after all.B.V. Barr and Eli Constant have created a truly terrifying zombie apocalypse. It starts with children, which is heartbreaking and terrifying. When we, as adults, finally wrap our brains around the idea that zombies exist, it turns out that the most viscous and terrifying ones are children, who aren't as easy to take out as adult zombies. Z Children: Awakening ends with a huge cliff hanger. In a matter of seconds, I cycled through several emotions. First, shock that I wouldn't know what happens to my beloved characters yet. Then came anger. How dare the authors end a book like that? But, when acceptance settled in, I was relieved to know that there are more Z children to come, and I am anxiously - and impatiently - awaiting the next book in the Z Children series.I received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}, {"userName": "Maribel Zamora", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/12712945-maribel-zamora", "userReview": "\"Humanity was the first casualty of war\" -The Drifter(J.W.)I went into this blind- no teasers, no reader input, or author-nothing. The only thing I did know was the title and well \"Z Children Awakening\" really catches your eye.The second worst thing to fast running zombies are kid zombies(to me anyways).Lets hope I don't have to add to the list by the end of this book...**Side note I was reading this at my twin nieces 5th grade graduation-lets just say it was the perfect setting to be scared out of your mind!I've read quite a few zompoc books but none that started the infection like this.And that added to the scare factor for me. For something that suppose to help your children from illness and you as a parent almost being responsible for it well that's just gut wrenching in itself.In Z Children Awakening we get six main POV's- all characters you instantly want to root for.Susan with her two kids and father.Sherry- Susan's best friend and her little companion by default.Juan- stuck on the side of the road, without a clue to the carnage the world has become.Virgina- the doctor, with the infected kids in her front office and her plans for Dallas.Young Bonnie- who at a young age already took care of herself and familyThe Drifter(J.W.) and Ranger- both with a background sure to come in handy.Book one got me hooked now I need to know what out courageous characters have in store for their future. P.S. \"Some Awareness\"Yeah zombies with some awareness- added to the above list."}, {"userName": "Melanie Marsh", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/8058065-melanie-marsh", "userReview": "Z Children is one of my worst nightmares come to life. Zombie kids. There’s nothing worse than freaky ass kids. There is just something about the idea of such innocent beings becoming capable of a horror so disgusting. Eli Constant has a way with words that leaves the reader stunned and excited at the same time. This was a great book. I was sucked into the story before I realized just how quickly I was reading. We get to watch the world around us crumble through the eyes of several different characters. I really liked how Constant changed up the perspectives and how they intersect. The characters were easy to relate to and believable in their journeys. I enjoyed every aspect of this book even though it freaked me out a little bit and made me nervous about getting my kids their vaccines. I do wish the author had been a little clearer on how the outbreak started. I had a little bit of trouble with the timeline and the vaccine explanation, so I am hoping that is clarified in future books. It was a quick and fun read and a must read if you like zombies."}, {"userName": "T.W. Brown", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/3234548-t-w-brown", "userReview": "I was fortunate to receive an ARC of this from the author. I am always ready for something new, but just reading the title had me wondering what sort of horrors were waiting. The wait is short. Eli has a way about her when it comes to pulling real people into a horrific situation and making the reader see the world through the eyes of her characters. There can be nothing more terrifying that zombie children. It was one of those things that is as heartrending as it is terrifying. What really has me floored is that Constant co-wrote this with her dad. The pair work together to cobble together a seamless story that transitions smoothly as key characters are introduced in what has the potential to be a very engrossing series (after I reached the ending, I knew the ride was not over).This book might be cruising under your radar, and let me tell you now that you will want to put it square in the crosshairs. I don't do spoilers, I will just tell you that you need to be prepared to have your heart broken more than once."}, {"userName": "T.W. Brown", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/3234548-t-w-brown", "userReview": "I was fortunate to receive an ARC of this from the author. I am always ready for something new, but just reading the title had me wondering what sort of horrors were waiting. The wait is short.Eli has a way about her when it comes to pulling real people into a horrific situation and making the reader see the world through the eyes of her characters. There can be nothing more terrifying that zombie children. It was one of those things that is as heartrending as it is terrifying. What really has me floored is that Constant co-wrote this with her dad. The pair work together to cobble together a seamless story that transitions smoothly as key characters are introduced in what has the potential to be a very engrossing series (after I reached the ending, I knew the ride was not over).This book might be cruising under your radar, and let me tell you now that you will want to put it square in the cross-hairs. I don't do spoilers, I will just tell you that you need to be prepared to have your heart broken more than once."}, {"userName": "Jessica Austin Gudmundson", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/38798662-jessica-austin-gudmundson", "userReview": "Omg you guys. This has got to be one of the scariest books I've read in a while. It deals with issues that are near and dear to my heart: children and vaccinations. Not only was this book extremely unsettling (someone else's word, and I'm using it) to begin with, it also has a completely different take on zombies and awareness. And speed, let's not forget the speed of these things. *shudder* There is also a connection between the zombies that just kind of adds to the horror of it all. I had to stop reading it at night, and I maybe had to sleep with the light on that one time. I also really enjoyed the way the book was written from different perspectives. We get to meet all the main players and get a really good feel for what they go through. And I already have some favorites. I also found myself yelling at these people, getting all wrapped up in the action. It's a well written book that scared the crap out of me. SO AWESOME."}, {"userName": "San", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/17586355-san", "userReview": "This book was awesome but unsettling. The thought of children as fearsome zombies and having to kill them is chilling. The story takes place from the point of view of a number of characters (Bonnie being my favourite) at the start of the apocalypse/outbreak and how it changed the lives of these characters. It was brutal, sad, heartbreaking with touch's of humour as well. I've read a good few zombie apocalypse books and this is up there with the best of them. I'm pretty sure there will be a part two, as the ending was pretty much a OMG What's gonna happen moment. If you love Zombies, The Apocalypse and Horror you'll love this. Highly recommended!"}, {"userName": "AudioBookReviewer", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "My original Z Children: Awakening audiobook review and many others can be found at Audiobook Reviewer.After taking their standard vaccines, millions of children are transformed into zombies.  They are fast and deadly and those they bite also turn into zombies.  The story follows several characters as they face the nightmare of a world thrown into chaos:  A single mother of two and her aging father, a children’s clothing store owner, a 12-year-old girl orphaned by the zombies, a homeless shell-shocked veteran, a love-sick pediatrician and an Argentinian martial arts expert.  Their paths cross as they try to escape the ravages of their hungry attackers.It is a unique approach to how zombies are created, but other than that, there isn’t too much that is new.  The survivors break into stores for food, water, and supplies, grab guns and knives and kill the zombies by destroying their brains.  They feel guilty killing zombie kids, but do what they have to to survive.Most of the book is spent introducing each character.  There is action, but it is often stalled by long winded introspection on the part of each character, their many insecurities, and self-doubt.  There are several attempts at humor, but these seem to miss a lot of the time.The story is performed by Johnny Mack.  He has a pleasant voice, but doesn’t add much to the story.  As most of the characters are female, the story might have been better served with a female narrator.  His character voices are fine and there is no mistaking who is speaking, but there is not a lot of drama in the narration.Overall, this is a rehash of the standard zombie apocalypse story.  It is book one in a series of unknown length, so the story may evolve now that the characters have been established.   It attempts to end with a cliff-hanger but instead ends abruptly and unsatisfyingly.  It may be unfair to judge the series based on the first book, but that’s all we have at the moment.  For many listeners it may not hold enough interest to continue on.Audiobook was provided for review by the author."}, {"userName": "BookLoversLife", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/4020075-bookloverslife", "userReview": "Ok, I admit, I wasn't too sure about this when I first saw it because I always have a hard time with Zombie kids, but it sounded good and had some amazing reviews. So anyway, I started it with trepidation but found myself devouring it!!! How the virus came to be was unique. It is easy to imagine it happening. Seeing the kids go from being sick and turning into monsters was hard but it was so well done and so well written that it made for an amazing book. I adored all the characters! Susan, with the help of her dad, is taking her two kids to the doctors for their injections, but once there, she sees the place is packed with sick kids. She waits for a while but when a child bites someone and things escalate, she grabs her kids and her father and gets out of there, but where can they go when it seems that kids everywhere are turning into monsters? Sherry, Susan's best friend, owns a kids clothing store and is opening up when a mum comes in with her kids. One of them had gotten sick all over himself on the way to school so she stopped at the shop to pick up something. Sherry notices that some of the kids look really ill, but it's not till one starts attaching the mum that Sherry realises things are bad. The child that got sick initially seems ok, so Sherry grabs him and they try to escape. We also have a drifter and his dog, a young girl who has had a hard life but is forced to do things to survive, a martial arts/fitness instructor and a doctor. All of these experience the outbreak in different ways and all have to survive a world gone mad. Anyway, this book was heartbreaking because I couldn't imagine something like this happening to my kids, but it kept me on the edge of my seat throughout. It's bad enough reading or watching a movie that has scary ass kids in it, but reading a book with scary ass, smart, strong Zombie kids in it, just gave me the heebie jeebies!!! I literally couldn't put this down because I had to see what happened next, it was so well written and developed and I devoured it!!! That ending though!!! I need the next one!! Highly recommend.Johnny Mack read this really well. Most of the characters were female but it didn't matter. The narrator made this play out as a movie in my head. I never once thought that a female narrator would be better. He had plenty of tones and cadences and his female tones were amazing actually!! Thoroughly enjoyed his performance!I was voluntarily provided this audiobook for free from the author, narrator, or publisher. This in no way affected nor influenced my thoughts."}, {"userName": "Lori", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/4817090-lori", "userReview": "3.5 starsThis was an entertaining, engaging and enjoyable story. It took me a bit to really be pulled in ( a couple of chapters)but once I was I listened straight through. It's a creative concept to start with the children. Children are our weakness. We are inherently programmed to take care of them and keep them safe. Vaccines are a double edged sword, both \"peace of mind\" and a \"source of worry\" all at the same time. You hear horror stories and those are always in the back of a parents mind. What happens if the worst case scenario happens. With little ankle biters running amok everywhere of coarse it's going to be interesting with plenty of suspense and on edge of your seat action.  Good cast of well rounded and likable characters. The story introduces the characters and follows their progress in alternating chapters throughout most of the story. Now that the story has been set up and the characters established the next book should be really good. I'm looking forward to it. It does end in a cliffhanger. So be prepared.Johnny Mack did a really good job with the narration. Nice voice that is easy to listen to for long periods of time. Clearly spoken with a nice even pace. Of coarse his male character voices are great. His female voices are good. There is not much difference between his male and female character voices. Just a slight change of tone and cadence. I never had a problem understanding who was speaking. I prefer slight change of tone for female characters instead of screechy any day. He brought the characters and the story to life. Hopefully he will narrating the rest of the series. Very enjoyableI was voluntarily given this free review copy audiobook at my request and voluntarily provided this review."}, {"userName": "RJ", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4187755-rj", "userReview": "A common vaccination given to children goes horribly wrong. Children are changing into raging flesh-eating monsters. There are several sub-plots of survivors who managed to avoid or escape the zombie children. The book rotates through these sub-plots as people flee infected areas and look for safety. A pretty good opener to a new series. This audiobook was given by the author, narrator, or publisher at no cost in exchange for an unbiased review via Audiobook Boom."}, {"userName": "Johnny", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/8603667-johnny", "userReview": "DifferentThis isn't your normal zombie apocalypse book.Zombie kids that are fast, zombie adults that are slow. While this book had a few mistakes, I felt that the type of story was good enough to get 4 stars.I can recommend this book simply for its different take on the whole zombie apocalypse."}, {"userName": "Gail", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/28503145-gail", "userReview": "Seriously, can you get any more messed up than this? I mean, take a healthy dose of zombies, then a splash of fast rabid zombies, add a healthy drop of paranoia, and to top it all off, it is freaking spread by children. Freaking Children.So, if you ever thought that zombies were a little disturbing before, maybe you should read this with the lights on. Nothing makes horror worse than when you mix it with the innocence of children. Especially when you make them, drooling, rabid, hungry, running zombie children. Sorry, Children of the Corn have nothing on this. I can take children with some demon telling them what to do, but pack hunting children who just want to eat me for lunch, no thanks.This book is told from the perspectives of several different people, and at some point, I hope they all get together and join forces. They all seem to have some strengths of their own, and together they could be an unstoppable force. Or at least, maybe they could survive and not be eaten. Of course, just when things may finally be going everyone’s way, that is the end of the book. So, here I am, hoping and praying the next book is written soon. It is the waiting I can barely stand. Even though I am almost too scared to read the next one. Almost."}, {"userName": "Halima Rahman", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/11369249-halima-rahman", "userReview": "Oh Zombies. Zombies, Zombies, everywhere! I am obsessed with the apocalypse and so when I found that Eli Constant had teamed up with D V Barr to create an Z apocalypse story - I was so so excited!! It intrigues me to know how people would react to the end of the world as we know it & this story tells it perfectly from the point of view of very different characters.  But wait I was not ready for this - Child Zombies!! Fast, fearful, fascinating! They think, they plan and they attack without discrimination and then there's the adult Z's - returning from death to add to the tragedy. A lot of discomfit and unease at the thought of innocent children becoming bloody monsters - I have been left scared!  The beginning of the end being so realistic for each character that it's left me thinking what if?? This could actually happen in the near future! Feeling already attached to the characters, I can not wait to read what happens in the next book. This is a must read for those looking for a genuine, high quality Zombie tale with a twist."}, {"userName": "Stephanie Lunsford", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/14783992-stephanie-lunsford", "userReview": "What would you do if your kids turned on you & started treating you like you were dinner? Would you be able to put down your own baby? Could you really leave them locked up to possibly chew up someone else? What would you do to protect your children from other Z Children? Even their own siblings?! Where would you go? Who would you turn to?These questions are what Susan, Sherry, Juan, Dr. Lynn, JW, Bonnie, etc face in Z Children. Pick up the book today to find out how each answered them! Let's just say maybe we can learn a few things from them...? Or not!? It is definitely a page turner and one I could NOT put down! I want MORE MORE MORE!!!!!! I felt like I was inside this book along with each of the characters going through their stories!"}, {"userName": "Edina", "userReviewDate": "Jul 11, 2016", "userURL": "http://www.goodreads.com/user/show/26162362-edina", "userReview": "Great writing, great characters, unfortunately the too many POVs ruined it for me, I wish each of them would have their own book, because this way every time I started to get into the story the connection was cut off by a different POV..."}, {"userName": "Shannie", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/9379579-shannie", "userReview": "Holy crap!! You did it again my Eli! Nothing scarier than zombie kids lol Can't wait to read the next book!"}, {"userName": "Denise", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/6921596-denise", "userReview": "Horrible horrible. Not the book but the idea of sweet innocent children becoming zombies and eating their parents. Great story."}], "description": "An alternate cover for this ASIN can be found here and here.Our kids are no longer our future… They’re our demise. Humanity’s advancements in medicine, meant to eliminate disease and extend life, have led to a macabre reality of childhood vaccinations gone terribly wrong. Kids have transformed, changed into ravenous beasts that are nightmarishly quick, disproportionally strong, and void of empathy. No amount of planning or preparation could have saved the human race against this unexpected attack, centralized in the heart of every human home, and the U.S. is quickly thrown into a chaos of Z Children. By the end of the first day, the entire world is jolted into a veritable hell on earth. Yet, there are survivors- individuals who, by luck, skill, or circumstance, lived through the initial wave of destruction. These ‘lucky’ ones will join together, bonded in their quest for survival. They will try to maintain their humanity in a world where children have graduated from bubble baths to blood baths. And they will try to find an answer to the only question that matters: What will tomorrow bring?", "title": "Awakening\n      \n          (Z Children #1)", "url": "http://www.goodreads.com/book/show/25693826-awakening", "average": 4.31, "cover": "https://images.gr-assets.com/books/1442011380l/25693826.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/14072877.B_V_Barr", "name": "B.V. Barr"}, {"url": "https://www.goodreads.com/author/show/6901568.Eli_Constant", "name": "Eli Constant"}], "type": ["Horror", "Horror", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25693826-awakening", "http://www.goodreads.com/book/show/25493749-awakening", "http://www.goodreads.com/book/show/31195938-awakening", "http://www.goodreads.com/book/show/30941311-the-surge", "http://www.goodreads.com/book/show/35615298-the-rising", "http://www.goodreads.com/book/show/30324939-eat-prey-decay", "http://www.goodreads.com/book/show/39844778-z-children"]}