{"ratings": 499, "userreviews": [{"userName": "Sue", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "I have difficulty reviewing and rating this book. It's actually one I might not have finished had it not been for the CR discussion. There's nothing difficult. It's certainly accessible. But the characters. Isaac... I can believe him as a character. Nora is a moral argument masquerading as a character in search of relationships. I didn't like her, didn't believe in her, and ultimately didn't want to read about her anymore. I really wished Isaac had fallen for someone else, but such is life."}, {"userName": "Sherry", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/5652025-sherry", "userReview": "I enjoyed every page of this character driven novel. Two artists- a writer and photographer- struggle with their creative identities while trying to rekindle their past love affair. Insights into what artists must sacrifice to serve their creative demons as well as care for those they love. Highly recommend to all writers."}, {"userName": "Dana", "userReviewDate": "Jan 01, 2011", "userURL": "http://www.goodreads.com/user/show/4725799-dana", "userReview": "a quiet little book, very well written, about 2 people who find each other again after breaking apart 5 years earlier. an intelligent book about intelligent, interesting young people in nyc, post 9/11. I finished this book now (writing this a few days since 1st 2 sentences. It was beautifully written, and I loved the strong character development, loving the characters despite their flaws, BUT, I hated the last sentence, as it left me hanging. I hate books that don't let the reader know how the story ends! So frustrated by that last sentence."}, {"userName": "John", "userReviewDate": "Oct 08, 2011", "userURL": "http://www.goodreads.com/user/show/290848-john", "userReview": "I had liked the movie of Morton's Starting Out In the Evening, so when the Constant Reader gang put this one on a discussion list, I decided to go for it. Did I enjoy it? Not exactly, no. Did I regret the time spent reading it? No, it's a well written book. Indeed, the plotting is its main strength, switching effectively between the two main characters, without a lot of re-hashing events. While I wasn't thrilled with Billie, Nora's aunt, as a person, the arc of her story did work to propel the story towards its conclusion. The other, minor characters worked well I thought, especially Juliette (who appears briefly near the very end).Nora herself I wasn't so crazy about. She came across as self-centered; her moments of caring about Isaac seemed forced, and her \"devotion\" (to use a word that Morton way over-uses) to her aunt implied some sort of guilt, or perhaps resentment, that may have been too subtle for me. In the end, I wasn't really rooting for her, though I didn't dislike her enough to root against her either ... just what-EVER ...Isaac, on other hand, was well drawn (for the most part). He didn't come across as a \"failure\", but as someone with poor self-promotion skills. A rather reclusive famous photographer treats him as a friend; I came away feeling that the man accepted Isaac because he knew that Isaac wouldn't ever try to take advantage of him. Not to say it's too late - Isaac does show an interest in a possible career advancing opportunity late in the story. So, he's flawed, but potentially redeemable.So, would I recommend this one? Yes, though I wouldn't fault folks who give up on it either as there's work for the payoff."}, {"userName": "Michael", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/3680008-michael", "userReview": "Issac and Nora love for each other has transcended over years, and have never lost it`s passion. After years of contemplating about whether one thinks of each other, Nora first makes the first step when she calls Isaac. Issac recognizes her silence without her saying a word, and the two decided to meet up and rebuild what was broken. Although Nora is in a relationship, she never stop loving Isaac and she struggles to break things off with her current mate. As a photographer, Isaac captures pictures that has been featured in top the magazines and when he is not taking photos, he is thinking of Nora and the life they shared. In addition, Norah takes care of her sickly aunt Billie and writes fiction for a living, but when one of her portraits resembles Issac life, their relationship is tested in more ways than they can imagined. This is an outstanding novel about love, hope and forgiveness, it has been awhile since I read a romantic book that has captured me from the beginning, to the end."}, {"userName": "Patricia Tyburczy-bettis", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/11100150-patricia-tyburczy-bettis", "userReview": "I often choose character driven novels, and so that is what was appealing to me about this story. Also, it isn't necessary for me to like the characters in order to remain interested in what is happening with them. To my mind, this is a story about obession, and how following that, whether it is a physical and emotional attachment for another, or the drive to manifest one's creative core, can either save or destroy you. It is about the consequences of choice, and ultimately what we learn about ourselves, or do not. Sometimes it appears to be a \"selfish\" choice to make writing or painting or dance or sculpture a priority to those who do not share the same inner drive and vision. Good story."}, {"userName": "Joanna", "userReviewDate": "Nov 16, 2008", "userURL": "http://www.goodreads.com/user/show/565947-joanna", "userReview": "This book was not very good, but I liked it. I hate when that happens."}, {"userName": "Erin Chandler", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/14661284-erin-chandler", "userReview": "I hate rating books. I struggled with rating this one, 'liked it?' or 'really liked it?' The truth is I really liked it. While Brian Morton is not among my favorite writers and his occasional, out of the blue and over the top description of some inanimate object was slightly irritating… I could not wait to get back to this book. Norah and Isaac I got and he nailed them circumstance after circumstance. He presented their weaknesses and strengths in the most casual way as they struggled with the relationship they have with each other and the relationship they have with themselves. Norah particularly hit a nerve with her struggle with using the people around her as fodder for writing. I am constantly waging a war with myself on what bridges are worth burning for a good story and what stories are best kept to myself. How far can I push a person before they go from mildly irritated to pissed off for good? Norah was so familiar I sometimes cringed and that's what a good writer does right? Point us to ourselves? Well Brian Morton did that beautifully and simply."}, {"userName": "Cecelia Hightower", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/7723939-cecelia-hightower", "userReview": "(2003, pp. 289) I am not sure where I picked up or received this book, but I found it interesting and easy to read. Brian Morton's development of characters was done very well I thought. It is a love story with a different presentation, in that the female is an author, who is creative when she is writing about those that she knows personally and she presents many negative points. It is hard to hold onto friends and family and lovers, when the writing is shared. Her love interest is a photographer who has a great love of his choice of career and even though he has had some success, he is not really as successful as he thought he would be and should be at this time of his life. He struggles internally and believe that Nora is his true love, as she does of him. I liked the book."}, {"userName": "Penney", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/14584770-penney", "userReview": "Love this author's work. This is my favorite of the three novels I've read so far. Interestingly, several of my friends did NOT like the one Brian Morton novel I recommended they read (Florence Gordon). I suspect some readers can't see past the negative aspects of characterization and conclude that these novels are like so much of the typical cynical nasty contemporary fiction out there. But I see just the opposite--fully rounded characters, warts and all, worthy of compassion despite their flaws and brokenness, at times admirable, and even noble, in their striving toward goodness."}, {"userName": "Barbara Nutting", "userReviewDate": "Aug 24, 2016", "userURL": "http://www.goodreads.com/user/show/23533869-barbara-nutting", "userReview": "VERY low key and laid back! Not my usual type of read but it was well written and it's nice to find something different for a change. I did take umbrage at his description of an old lady alone except for her cats as being sad. I am all those things (but my cats are all in the big litter box in the sky after 18 years) and couldn't be happier!! Being alone DOES NOT mean being lonely - it means doing what you want whenever you want without having to explain your actions to anyone!! So there Brian Morton!"}, {"userName": "Susann", "userReviewDate": "Jul 01, 2008", "userURL": "http://www.goodreads.com/user/show/959531-susann", "userReview": "Years ago, I swiped this from the free book table at work. I liked it just fine but, now that it's review-time, I don't have much to say about it. Nora didn't do much for me personally, but I admired and respected Isaac's love for her. Morton showed how when you love someone, your love just is. It's just there."}, {"userName": "Rdailey", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/1285173-rdailey", "userReview": "A *very* good book-- definitely a \"keeper\"! Morton portrays the two main characters, Nora and Isaac, beautifully and equally well... the struggles they endure are profound, intimate yet universal, crossing the generations... I highly recommend this read!"}, {"userName": "Yulia", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/185835-yulia", "userReview": "Morton once again challenges us to question whether we would be able to live up to our own ethical standards and ideals. This book also asks, what is ultimately more important to an artist: to live well or to create well? If a writer dies unknown in a forest, is it too late to self-publish?"}, {"userName": "Diane", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/1434745-diane", "userReview": "My kind of book - complex characters wrestling with their lives, relationships, values and behavior in ways I find absorbing. Especially since they're artists, one a writer and the other a photographer. Good read. Will look for more by this writer."}, {"userName": "Carol", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/902516-carol", "userReview": "Not as good as his latest, Florence Gordon."}, {"userName": "Sanja Knezovic", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/6744338-sanja-knezovic", "userReview": "The book is about love, compassion and compromises. It is a beautiful book,"}, {"userName": "Karen", "userReviewDate": "May 20, 2008", "userURL": "http://www.goodreads.com/user/show/1055116-karen", "userReview": "It makes me wonder if my liking this so much means I'm totally middle-aged. But I did really like it."}, {"userName": "Michele", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/34329097-michele", "userReview": "2.5 This book felt shallow at the start, but I didn't give up on it. I hoped the author would eventually bring me somewhere worth journeying. The concept of two artists of differing mediums connecting & reuniting after five years apart, seemed intriguing. However, for me, the book essentially went nowhere. While I liked the character of Issac--noble, prideful, honest in his conflicting thoughts, Nora & Billie felt forced, unrealistic. Bille's purpose was, I suppose, meant to bring out Nora's compassion & devotion, yet neither was convincing. Billie led most of her life empty & tragically alone. Nora extended herself when/where she thought she should, but she always kept her own interests first. She was too selfish to be a mother, a singular caregiver, or commit herself to the love of her life. I did find the inner thoughts & conflicts of the two main characters interesting, & ultimately that is why I kept reading. I realize this is character-driven novel, but nothing much happened. We're told Issac changed, but I didn't feel either he or Nora grew in any significant way. Isaac became disgruntled with his art, & Nora chose to cave to her muse's method despite the fact it only found success by hurting those she claimed to care for. Love is not big enough for Nora, & because the book ends with no conclusion, the relationship seemed to be doomed even if we wanted to imagine it could go forward. Worse, their relationship seemed meaningless; they understood each other (in the \"soulmate-like way\"), yet they couldn't find fulfillment apart or together. This left me feeling cynical."}, {"userName": "Mary Wilt", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/8527372-mary-wilt", "userReview": "Read this after \"Started Out in the Evening\", and it would be hard to say which I preferred. The multiple reviews saying this is a \"character driven\" novel are correct, or possibly it might be phrased as a character focused work. If you are also a fiction writer, you'll recognize the ethical dilemma at the heart of the story."}, {"userName": "Kris", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/63285101-kris", "userReview": "I liked this book well enough. I like reading about relationships and their challenges but it was hampered by an unlikable main character. It was mostly an enjoyable read but I dislike nebulous endings."}, {"userName": "Shankia Monique Tinsley", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/1837565-shankia-monique-tinsley", "userReview": "Brian Morton gets down to the root of how we really feel as humans. This is the second novel that I have read from him and intend to read many more!"}, {"userName": "LK Hunsaker", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/2121270-lk-hunsaker", "userReview": "I grabbed this one because the story of two artists of different media captured my attention, as well as it being somewhat modern lit fic (2003).There were some shining moments in the story and it was generally well written, but it was too staccato for me (Nora did this. Nora did that...) at first. That did get better, or I got used to it. Worse: I did not like Nora. I could have been okay with that if I'd changed my mind by the end, but I didn't, because instead of seeing her mistakes and working to fix them, she shrugged it off and said that's just who I am; love it or leave it. I have a huge issue with knowing you're hurting people or hurting yourself and thinking it's okay because it's just who you are.I still could have been okay with it if Isaac had come to his senses and stopped putting up with it instead of being a rug she walked on and therefore, an accomplice to her superficial kind of \"love\" for others.Along with this are some very pointed political statements unnecessary to the story that almost made me think the story was written in order to throw out the authors political views and for not much more than that.I'm still giving it 3 stars for some good writing, an interesting concept, and because hopefully it will bring to light how some people are so willing to use others and how they get away with doing so. It's a good character study. The end left me thinking, \"Is that it?\" but then, I think that's the point of the story. Sometimes things just don't change."}, {"userName": "Ben", "userReviewDate": "Mar 24, 2008", "userURL": "http://www.goodreads.com/user/show/250757-ben", "userReview": "The premise of this book was really interesting, unfotunately, the book wasn't nearly as good as the premise. In the synopses I read beforehand, Nora, the author who reconnects with an old boyfriend, starts writing a story which she belated realizes is a thinly-veiled, negative portrait of her boyfriend. In the book however, she knows basically from the start that it's about her boyfriend, moreover, Morton spends several dozen pages giving a history of Nora's writing, a series of stories that were all thinly-veiled, negative portraits of those closest to her. The synopses all offered this epic struggle of Nora's art vs her love, whether she should write the story or not. In the book, however, she knows from the start what she's doing and does it anyway, so no real struggle. The reader knows everything but the ending after the first 50-75 pages but has to read 100 more pages just to get to the ending. Finally, I'm not a huge fan of writers who constantly name drop authors in an attempt to sound more literary, or repeatedly offer up pop culture references, which dates the book and distracts readers who didn't live in New York in 2000."}, {"userName": "Chanda", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/2009682-chanda", "userReview": "I am having a difficult time finding anything redeeming about this book. The characters were all pitiable with nothing to endear them. All of them are sad examples of unfulfilled adults. It was really a depressing read! I was particularly unimpressed by the main female character. She's immature and selfish, despite the few samples of caring thrown in. Ultimately there isn't anyone to care about in the novel. The cats I guess. I hope the cats make out all right in the end. There was one quote that stuck with me despite all else, delivered by Isaac: \"When it's your party, you have no rights.\" Ha! In the throes of wedding planning myself, I had to ruefully agree with that sentiment. As backwards as it seems, in many ways that's actually true! http://bibliofilesbookrating.blogspot..."}, {"userName": "Shane", "userReviewDate": "Jun 24, 2008", "userURL": "http://www.goodreads.com/user/show/1203728-shane", "userReview": "This author has managed to grab me. While the stories lack in any setting description it is wholly made up in character descriptions. The author creativly describes the workings of peoples minds to an extent that it almost feels as if these people are not truely created and instead close freinds of the writer. Which is what the actually story touches on. A look into how people interact with each other, and an even closer look at the inner workings of fiction writers, this story grabs you and allows you to partake in a world that is surely much different from you own. Great book and a quick read!"}, {"userName": "Nick", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/3134745-nick", "userReview": "Quiet and thoughtful, with characters who are synmpathetic despite major flaws. I don't care for the overall theme (following one's solitary artistic calling versus living a life with others) because to me the choice seems a no-brainer (the latter. Not much happens in the plot department, but the thing that drew me in was the interior dialogue of the two main characters. I could see myself at various times in each of them. That was interesting and fun. Overall the book is not very fun, but absorbing."}, {"userName": "Kerstin", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/45620399-kerstin", "userReview": "Most of the indifferent reviews of this book are pretty spot on. The first few chapters of this book grabbed me as the feeling of lost love was relatable. But the more I read, then more I wanted the book to be over. It took until over half the book was read to get anywhere. The book is full of literary references, most of which I didn't understand. The end of the book leaves you hanging, which is okay in a way, but it also leaves you wondering, after all that, what actually happens between the two characters. This is a love story without much of love or story."}, {"userName": "Tawny", "userReviewDate": "Jul 10, 2010", "userURL": "http://www.goodreads.com/user/show/1001935-tawny", "userReview": "I felt a connection to the conflict in this book, which dealt with writing literature about loved ones. I enjoyed all the quotes from famous writers, however, in general the language was pretty foul. Next time give me a heads up, Mom! Favorite lines: 1. \"A man does his best work when he has a stake in the future\" (176). 2. \"We think of our lives as incredibly complicated and long, composed of many different stages, different eras, when the truth is that a life is but a single note\" (189)."}, {"userName": "Jeanne (love2cook)", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/12210182-jeanne-love2cook", "userReview": "I thought it was kind of a strange story. The main character Nora is a writer who every time she writes something good it's about some one she knows and it's highly critical of them. When they read the story she's written they no longer have anything to do with her. Her main and probably best friend is Issac. She finally writes about him....................you can guess the outcome. I still don't know if I liked the story or not but I kept right on reading till the end. Strange ending!"}], "description": "Isaac and Nora haven't seen each other in five years, yet when Nora phones Isaac late one night, he knows who it is before she's spoken a word. Isaac, a photographer, is relinquishing his artistic career, while Nora, a writer, is seeking to rededicate herself to hers. Fueled by their rediscovered love, Nora is soon on fire with the best work she's ever done, until she realizes that the story she's writing has turned into a fictionalized portrait of Isaac, exposing his frailties and compromises and sure to be viewed by him as a betrayal. How do we remain faithful to our calling if it estranges us from the people we love? How do we remain in love after we have seen the very worst of our loved ones? These are some of the questions explored in a novel that critics are calling \"an absolute pleasure\" (The Seattle Times).", "title": "A Window Across the River", "url": "https://www.goodreads.com/book/show/382470.A_Window_Across_the_River", "average": 3.28, "cover": "https://images.gr-assets.com/books/1428586118l/382470.jpg", "reviews": 76, "authors": [{"url": "https://www.goodreads.com/author/show/54766.Brian_Morton", "name": "Brian Morton"}], "type": ["Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/382470.A_Window_Across_the_River", "http://www.goodreads.com/book/show/8763804-a-window-across-the-river", "http://www.goodreads.com/book/show/4562204-a-window-across-the-river", "http://www.goodreads.com/book/show/20256545-florence-gordon", "http://www.goodreads.com/book/show/382469.Starting_Out_in_the_Evening", "http://www.goodreads.com/book/show/452437.Breakable_You", "http://www.goodreads.com/book/show/382472.The_Dylanist", "http://www.goodreads.com/book/show/39686716-breakable-you"]}