{"ratings": 52174, "userreviews": [{"userName": "Jen", "userReviewDate": "Jan 13, 2009", "userURL": "http://www.goodreads.com/user/show/1719442-jen", "userReview": "Hmmm...okay. I learned that:1. With enough money you can relocate to Provence and buy a 200 year old farmhouse with mossy swimming pool, problematic pipes, and a wine cave backing up to the Luberon mountains. Wait, it gets worse!2. Once you do this everyone who has ever vaguely heard your name and Provence together in the same sentence will attempt to visit whilst you are having a hell of a time fixing the charming antiquated house and bicycling into town. Hard times.3. Tragedy strikes! Everything in Provence moves at a slower pace- including uninvited house guest departures and the guys you hired to remodel your soon to be awesome Provencal place. You are to be pitied, poor thing, having been forced to survive on mostly fresh breads, herbed cheeses, and the occasional sausage.4. It can be rough rumbling around in an old car looking for great places to eat. It is a daunting task you face after finding them, having to stuff your face with delicacies drizzled with truffle sauce.5. The somewhat backwards, rough, but ultimately charming locals are worth talking to- you never know if they'll tell you about how to choose a pig for hunting truffles or inform you that they've booby trapped the area from foreign campers. How quaint, the poor dears!6. Truly, life in Provence can prove to be much tougher than it seems. But give it a year or so before you decide to go home- at the very least, wait until you have managed to have your grapes harvested by the guy that works your vines-you've got to have your own wine to drink with your breads and cheeses to give you the strength to go on."}, {"userName": "Noel", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/291748-noel", "userReview": "I read a couple of reviews on goodreads for this book and had to laugh at some of those who felt the book was whiney and written by a rich guy who could afford a super farmhouse with a pool no less! One review said that Mayle went back to England to live. Well – those reviews smack of small minded jealousy. Right now a farmhouse in France can be bought for as little as US$250,000.00; back in 1989 before this became trendy, property values were even more reasonable, especially coming from England where everything was/is expensive. It was kind of like selling your million dollar house in San Francisco and moving to Iowa – you could buy the entire town for the price of your modest house in California. I don’t think Mayle whined about the repairs to his house – in fact, he took it lightly and with a clear dose of patience and humor. Kudos to the Mayles to manage their money well enough to be able to enjoy the lifestyle which I don’t believe it was at all over the top. Anyhow – I just had to say that.Now for the book. I loved this book. I curled up with a glass of wine (Chilean, sorry) and read this in a couple of evenings. I laughed and laughed and commiserated with the Mayles. The writing is witty and the pace is excellent. It’s a romp through Provence over the course of a year. Peter and his wife have left behind their lives in England to move to Provence, buy a farmhouse and settle in to a slower pace of life. The story starts with the formidable paperwork process in buying a house, and reminded me of the process my son has gone through to rent a simple apartment in Brazil. Frustrating to the point of being funny. Mayle goes on to beautifully describe the climate, which is so different from common knowledge (again, very similar to our Brazilian experience); the absolutely mouthwatering gastronomic descriptions, locals, tourists, and then the never ending quest to fix the house. This part in particular reminded me of the time we bought a “fixer-upper” right on the beach in a beautiful town in Chile, and went through so many similar situations with repairmen and guests. At the time it drove us crazy, but now we look back at those times with a bit more fondness. In any case, Mayle brings the area to life, and does so in a light engaging way."}, {"userName": "Margitte", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "The next best thing to living in France, is to read this book. Loved it!It is the first book in this genre which provided a complete picture of life in a rural French town by two Brits moving there."}, {"userName": "Jan-Maat", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "[ provided you dream of living of living in a stone farm house in Provence and eating fantastic restaurant food at modest prices (hide spoiler)]"}, {"userName": "Leftbanker", "userReviewDate": "Sep 30, 2007", "userURL": "http://www.goodreads.com/user/show/352711-leftbanker", "userReview": "It’s sad to think that there are probably dozens of great books about people who have moved to France that were rejected by publishers so they could take this book, which is completely devoid of insights, and shove it down our throats. The book has a wonderful premise in which a British guy and his wife move to the south of France and begin a new life. I think most people who read this book didn’t need much more than that. It is mostly the tedious description of the work he does on an old house and has little to do with France. I can’t recall a single entertaining passage in the entire book.I give almost everything here five stars. I’m not a book critic but there are certain extremely popular books that just need to be eviscerated. Please explain to me why this book was popular? After I finished reading this I didn't think that I had learned a single thing about life in France.I found zero sense of adventure in what he had to say about France. It’s travel writing for the rich which—at least for me—is usually boring. Instead of a book about an over-privileged douche bag paying people to fix up an old house I’d much rather read a memoir of someone who moved to France and actually had to work for a living. I rate this book down there with Under the Tuscan Sun."}, {"userName": "David", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/5241822-david", "userReview": "I've read quite a few negative reviews of this book, many of them focusing on the author's presumption in being able to afford a home in Provence and the reviewers' consequent inability to \"relate\" to him. Others see it as \"trite\" and not at all what they were expecting. Well, balderdash. I found this to be a very entertaining account of the first year in a new home and a new country, with all the explorations, discoveries, disappointments, triumphs and failures that go along with it. Would it be a good basis for discussion in a book group? Probably not. Was it enlightening, or did it change the way I think about things? Can't say that it was, or did. But the author's dry wit, talent for understatement, and occasional eloquence painted an interesting picture of life in Provence, with characters that were by turn amusing, infuriating, puzzling, and human. This book did a great job of carrying me away from Michigan into a place I've never been and experiences I'll likely never have. It was fun!"}, {"userName": "Dave", "userReviewDate": "Oct 01, 2007", "userURL": "http://www.goodreads.com/user/show/317722-dave", "userReview": "This is a fun book that is literally about the first year Mayle spent in his new home in Provence. The chapters are divided into months, so a reader gets to enjoy with Mayle the seasonal changes of this beautiful region of France. Mayle understands the importance of gastronomy to the French and his food descriptions are a well written part of his story. Mayle mentions in passing, in an almost disparaging way, people of affluence buying up property in Southern France. This perspective was interesting because it says more about Mayle than it does about those other rich people. Mayle is, after all, a wealthy writer from England who is able to purchase a two century old stone house with a stone swimming pool on land that contains a vineyard, a cherry orchard, and other agricultural acreage all tended by a local farmer (the tradition being that the landowner purchases the seed/vines while the farmer does the work. The landowner gets 1/3 of the profit and the farmer gets 2/3--even though it may seem generous and not at all the tenant farming or sharecropping as we know it, it's still being a classic \"Landlord\"). It seems that Mayle considers himself more a part of the local population than a foreign \"Lord of the Manor\" type. It made me wonder what the locals really thought of Mayle and his wife.The book is engagingly written and funny in parts; filled with memorable characters. Occasionally, these characters descended to the level of caricature however, so that sometimes the story read more like \"Green Acres--The Continental Version.\""}, {"userName": "Hannah", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/6940509-hannah", "userReview": "4 Stars - Fantastic book, would absolutely recommend it.There's really nothing I don't like about this book. It's short, easy to read, and such fun. Peter Mayle, the author, writes in a charming book that, in my opinion makes the people of Provence endearing. As an American, we often hear (or rather we're aware of the stereotype) how stuck-up, abrasive the French are. Albeit, I have met many-a French-person in my day and luckily I have never had this stereotype confirmed. Sure, they're mannerisms are different but isn't that to be expected? Anyway, I digress.I enjoyed this book even more because it was relatable. I spent a significant amount of time living in a village, well more like a town, in the north of Moldova. Of course a former Soviet, Eastern European country is quite different than France but I was struck by how many similarities there are. For instance, the struggles the author and his wife faced during construction on their house , particularly the timeline is very familiar. In my Moldovan experiences, things don't run on a \"city\" schedule (e.g. when someone says work starts at 8:00 am, it would be a miracle if that actually happened). Also, the constant advice and interaction with neighbors is similar. It's fascinating. I guess provincial life is similar across the board in Europe, or at least in these two cases."}, {"userName": "Christine", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/418712-christine", "userReview": "I found this book walking to the B train this morning. Someone had gotten rid of it. Don't judge me to harshly for my foray into escapism, it makes the morning commute go fast. 1 week or so later... So I've finished it, and although it had its moments where I chuckled a bit, I really didn't find it to be the incredible, evocative travel writing that it had been cracked up to be. The food descriptions were probably the strongest part, and I have to admit I did find my mouth watering on occasion. Now, don't get me wrong, I'm always up for a good renovation story, but Peter Mayle's mind was so distracted with getting his home perfected, that the establishment of place (which is so key to travel writing) suffered for it. The characters are neither larger than life nor realistic, and I didn't really get a sense of personality from anyone except the bumbling country neighbor. Mayle and his wife irritated me with their constant whining about the lack of progress being made on their farmhouse's heating system. I love a bit of daydream fodder, but this didn't really take me anywhere."}, {"userName": "Kara", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/51047234-kara", "userReview": "\"A Year in Provence” is not lesfic, nor is it a new book. Thirty years ago it kicked off a new type of travel book that showed the reader what it would be like to live in an area, not just visit it.Honestly, I expected much more from the book. The first half or two-thirds showed that rich Englishmen and their wives were very condescending toward the rural French. The last part of the book showed more kindness toward the country folks, but only by declaring that the expats were now like them, and the author now wanted us to laugh at the visiting English boors.The book was more a series of unconnected events depicting rural life rather than any real exploration of the lives and personalities of the people.The narrator did a decent job. Overall, the book is a bit disappointing so probably a 2.5* but I’ll round up to 3* because some of the events did make me laugh more than a 2* book would."}, {"userName": "Dennis", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/1512303-dennis", "userReview": "J'adore the English sense of humor. With stiff upper lip and wry observation sprinkled with warm affection, Englishman Peter Mayle embraces a cadre of colorful characters inhabiting the warmer south of France in this memoir documenting his first year as a new permanent resident relocated from Britain to the Lubéron region of Provence.A Year In Provence is suitably divided into twelve chapters, each devoted to one month, January through December, staging the progress of renovations on Peter and Madame’s newly purchased two hundred year old home. Over the course of the year it becomes clear that here time is measured in seasons, not days, and that the tempo in Provence would not change for newcomers. A project as simple as moving an antique concrete planter into the garden, for example, is not something that can be arranged overnight. “There would be visits of inspection, drinks, heated arguments. Dates would be fixed, and then forgotten. Shoulders would be shrugged and time would pass by.”The author has a special penchant for observing human nature and describing it both with humor and heart. Lubéron country folk can be suspicious of visitors from throughout Europe who descend upon the Côte d’Azur in the summer months, including German campers, Belgian road hogs, Swiss hotel dwellers, and the British with their notoriously weak stomachs and plumbing complaints; but the Provençal people are warm, amiable, and all too eager to ensure their friends are well fed. The absolute joy of Provence is the food and free flowing local wine, which refreshes even the most curious of exchanges such as unexpected house calls made by traveling Oriental rug salesmen or visits paid by French bureaucrats at Christmastime to hint for annual tips.These pages are peppered with French, “Voilà!” “Oh là là,” “Allez,” which enhances the feel for a foreigner’s life in France as well as doubling as a grammar in simple and useful phrases to those readers who are sure to add Provence to their must-see list. This account is often laugh-out-loud hilarious and is every bit as savory as the much sought after and highly prized black Périgord truffles grown only in this region."}, {"userName": "Julie Ehlers", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "In some ways it wasn't really this book's fault that I didn't like it. It came out in the U.S. in 1990 and was probably one of the first \"I-lived-among-the-French-and-they-are-peculiar\" memoirs. Since then, there have been countless other memoirs on this same topic, several of which I have read and enjoyed, so by the time I got to this, the flagship volume, the subject matter was a little old hat. Also problematic is that, while some of this book is composed of funny anecdotes, some of it is just Mayle explaining how the French do things (cheek kissing, for example), and those sections not only aren't particularly funny, they're sometimes rather dull. Maybe they were fascinating in 1990, I don't know. But frankly, once you've read David Sedaris on French villagers, Peter Mayle is just never going to stack up.The book does contain the obligatory shout-outs to French paperwork and the way business is conducted there, as well as copious descriptions of food and wine, so it hits all the right marks, and I considered giving it an extra star (3 total) in recognition of the fact that I read it about 25 years too late. But I started to get annoyed at the way Mayle poked fun at French peasants, accusing them of being either penny-pinchers with ancient cars (hilarious, right?), or \"greedy\" for hoping to sell their houses for high prices. Meanwhile, he was spending a gargantuan sum on remodeling his large Provence house, not to mention all those cases of wine. His ridiculing the less well-off, even if all in good fun, rubbed me the wrong way, so the extra star came right back off. When my sister gave me this book years ago (after she had read it and loved it), she also gave me its sequel, Toujours Provence, but it's going to be a long time before I'll be willing go in for more of this sort of thing."}, {"userName": "Kim", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/1519524-kim", "userReview": "2.5 stars, ok +. I'll give the next two a go!"}, {"userName": "Bookish Temptations", "userReviewDate": "Dec 28, 2015", "userURL": "http://www.goodreads.com/user/show/6843950-bookish-temptations", "userReview": "Such a fabulous book. If you've never read a book by Peter Mayle I'd really recommend that you do. I've enjoyed all of his books...some of them several times."}, {"userName": "❂ Jennifer ", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/1340220-jennifer", "userReview": "One of those beautiful, descriptive memoirs that make me want to sell everything I own for a house in France (or Italy) and a life of tranquility and luxurious food. Only slightly more wordy review: http://jenn.booklikes.com/post/123517..."}, {"userName": "Cyndy Aleo", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/5475913-cyndy-aleo", "userReview": "In the course of thinning out my book herd, I've been reading books that I haven't read in years, trying to determine whether I should keep them, or move them along. Going back to Peter Mayle's A Year in Provence was like going back to an old friend's house, but I've never been so hungry in my life as the two times I've read this book.::: The Dream :::Mayle and his wife live out a dream come true, dropping everything, selling their home, and moving full-time to Provence, a region of France generally known to span from the Alps to the Rhône River, with the Côte d'Azur in the southern section. Known for its food, its wine, and its perfumes, it is a popular vacation destination in Europe, with a generally Mediterranean climate. Mayle's book chronicles their first year in the 200-year-old farmhouse that they bought in a rural area of Provence, including their struggles with the language, renovation of the house, and settling in with their new neighbors.::: The Year :::A Year in Provence is broken into twelve chapters, one per month, beginning in January as they start out their new life in Provence and ending with their first Christmas. What makes the book so interesting (and for me, misplaced in the travel section) is that it focuses much more on the culture of Mayle's area of Provence rather than on the scenery. He includes tales of restaurants and meals eaten there, but even more memorable than the food are the chefs and servers that he meets, the additional knowledge and culture that they often impart. One woman sends Mayle to an olive oil mill, and we learn about the world of olive oil, which is almost as intricate as that of wine.Even better are the characters Mayle introduces us to. We meet Faustin, who runs the vineyard on Mayle's property, the curmudgeonly neighbor Massot, and a host of skilled laborers who are in and out most of the year while working on the home renovations. Each individual the Mayles meet helps them on their journey from tourists who moved to Provence to something resembling natives. Each experience, from goat races to plumbing issues, is related in such detail that you almost believe you are there, and reading this book on an empty stomach will leave you pricing flights online.::: The Final Say :::A Year in Provence is one of those books that you can read a chapter every so often, or all at once. Like one of the excellent meals Mayle describes, it's a delicious read, and leaves you hungering not only for the food, but also for more on some of the characters. You feel as if they have become old friends, and I'm eagerly anticipating re-reading the follow-up, Toujours Provence. This review previously published at Epinions: http://www.epinions.com/review/A_Year..."}, {"userName": "Maria", "userReviewDate": "Nov 28, 2007", "userURL": "http://www.goodreads.com/user/show/309472-maria", "userReview": "3.5 stars.Well, this was a very charming read. The whole \"o hay we moved 2 provence, awesome rite?\" thing wasn't nearly as obnoxious as I thought it was going to be, although I still think these travelogues are highly masturbatory in nature. Peter Mayle has a light touch with a pen (I think I read the whole thing in under five hours), and a real flair for characterisation. I admire a man who can sketch a portrait in a sentence, like this bit describing his uncle, for example: \"'Puke in private, dear boy,' he used to say.\"One of the other things in the plus column is that despite the fact that he describes over half a dozen different meals, he doesn't go into great detail about the actual food. He is not that great at making you salivate. This is a good thing. I hate books that make me miserable about what I'm having for dinner in reality. It would have been okay in this particular case, I guess, since it was Thanksgiving weekend that featured, among other things, roast duck with pineapple, strawberry-cranberry sauce, yams, roast pork, Black Forest cake, pumpkin pie made from scratch, potato pie, and other tasties, but whatever.No, this book is mainly about the lifestyle in Provence. It doesn't over-romanticise it, but it's clearly relaxing and lovely and healthy and all those good things.I think I am going to read the sequel in case some of the same people appear in it too. Especially Bennett. Bennett is awesome.Book club notes:pp.36-37: funny rant about people inviting themselves. Also: \"Drink your coffee before it gets dirty.\"p.49: LEARN HOW TO MAKE TRANCHES DOREES.p.87: Hilarious bit about burglaries. \"He looked at me as if I had committed an act of terminal lunacy. 'You must be protected immediately. I will send a man this afternoon. Stay en garde until he comes.'\"p.112: Ah, the gay English uncle. \"Puke in private, dear boy.\"p.124: BENNETT!"}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "Sep 26, 2009", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "Peter Mayle and his wife finally decide to say goodbye to dreary British weather and move to sunny Provence in France. This book tells about their experiences living in Provence, from the colorful locals to the excellent food to the workmen who come and go like forces of nature.This book had me ready to go on vacation in Provence. Notice that I don't say \"move to Provence.\" I would starve. All those lovingly written descriptions of French food left me cold. I could survive for a week or two though.Parts of this had me roaring with laughter. My favorite part was probably the goat race. Oh my gosh! I read this on one of my last nights at my old job, and let me tell you, I was doing my best to hold back my laughter while sitting around on my downtime in the emergency room, but little snickers and giggles were escaping, and I had tears rolling down my face. Not exactly the appropriate place for that, but luckily I was tucked away in my little corner, and I don't think anybody noticed. I hope.Another of my favorite parts was the translation of the French person's body language. I'm sure it's different, but I hope this gives me a place to start in translating my Cuban father-in-laws body language. He doesn't just tell a story, he enacts it, with hands flying everywhere. I think any homeowner can relate to the stories of the workmen. At least these guys did show up, but, wow, I don't know if that's good or bad. The Mayles did come up with an ingenious way to get them back to work though. I may have to give that a try sometime...So there's no big, earth-shattering plot here. This still felt like a vacation in a book, and it's nice to come across those every once in a while."}, {"userName": "David Silva", "userReviewDate": "Dec 17, 2011", "userURL": "http://www.goodreads.com/user/show/7199106-david-silva", "userReview": "I vacationed in the Luberon area of France this year, the setting of Peter Mayle's book and mini series. My friend had read his book prior to arranging the trip and as expected the familiarity was a great starting point. I decided to wait on reading the book until after the trip. I wanted to experience it all first hand. After a truly fabulous time walking all over, eating pretty much nonstop, fumbling with French to the always very polite shop keepers, going to see every little town's offering of charm,on and on excitement and beauty. An old graveyard, picking apples in an ignored field, finding treasures along the road and even a colorful local or two, the week was up and we had to move on. On the plane ride home I read Mayle's take. It was wonderful recognizing the landscape and the homes and the general feel for the place, the daily markets. I did not encounter home upkeep issues which played such a constant and mainly humorous part of the book and the colorful and rather broadly drawn locals were simply business like and charming in my real like experience. But recapturing the visual of the magical was something A Year In Provence did very well, and for this reason I will pick this book up every few years to relive the Luberon."}, {"userName": "Snap", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/2995611-snap", "userReview": "I've been cleaning out the bookshelves and found A YEAR IN PROVENCE. I know I read this book when it was first published and remembered enjoying Mayle's chronicles of the year he and his wife moved to Provence. I thought it was the perfect weekend read and I was correct! I enjoyed visiting Provence again. There is a certain rhythm to life in Provence. Mayle's sketches of his neighbors, laborers, markets and restaurants; the customs of the country and the pleasure and frustrations of home ownership were all entertaining. Food, food and more food! A fun and delightful re-read."}, {"userName": "Todd Wright", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/3127606-todd-wright", "userReview": "The idea for this book was borrowed from Green Acres. Mayle loves living in the country but immediately needs to update his house in an effort to make it more familiar. Wow, look at the crazy locals, they carry guns and use dogs to hunt. Contractors don't meet their deadlines. People take three hours for lunch. Table grapes are picked by hand (who knew.)Mayle eventually comes to love living in Provence and, without irony, complains about others moving to the area and spoiling the atmosphere.Good writing makes this book tolerable, but the hipster attitude is difficult to tolerate."}, {"userName": "Nooilforpacifists", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/26071992-nooilforpacifists", "userReview": "Not as funny as he thinks he is. Goes on and on--starry-eyed Anglo-Saxon loose in flinty Province, kept afloat by uncontrollable electricians and incompetent plumbers. And, ultimately, by profits from this best-seller.Major result of publication, and sequel, has been increase in prices in Auberges and -- worse yet -- doubling the price of nearby Michelin 1, 2 and 3 star restaurants (L'Auberge Procençale; La Bonne Étape: Le Dispason; Méo)."}, {"userName": "Antonomasia", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/6249204-antonomasia", "userReview": "[3.5] Back in the early 90's, A Year in Provence was a favourite easy target for satirists and alternative comedians on British TV. Now in my 30s, with a new liking for books about moving to the country and doing up an old house, I wanted to find out what this object of so many jokes was really like.And, much as I love it when I genuinely disagree with haterz, I can kind of see the satirists' point.There is, nevertheless, much to like about this book. It can be enjoyably escapist and it has some lovely descriptions of places and customs. It's a very easy and fast read, without being dumbed down or badly written, and is fairly witty; so in many ways it was a great book to read when not feeling well. But its main fault is one I particularly dislike, so it gets 3 stars rather than 4. In other books of this ilk, we see the authors making friends with local people, becoming part of the place socially as well as materially. Mayle gets to know people, yes, but he talks about them with a detachment that is subtly condescending. I'm not sure he even means it that way; it's probably a form of old-fashioned British reserve, but it can come across like a more polite and stealthy means of saying \"look at these funny Frogs with their strange customs and lazy ways, hahaha\". Oddly, he never reflects on the costs of their house project or personal good fortune - even in the light of being glad they can afford this lifestyle these days, though they couldn't when younger, as may often be heard from better-off middle-aged to older people. This creates another layer of detachment from most readers.And whilst he has good words to say about many things, such as quality food and beautiful landscapes, I don't hear the sort of unbridled enthusiasm and immersion in experience which makes me warm to the authors of memoirs."}, {"userName": "Joan Reeves", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/5232286-joan-reeves", "userReview": "Part Travelogue; Part Love LetterI loved this charming book. My interest was stirred by the Russell Crowe film A Good Year which was based on Mr. Mayle's book. The movie is heartwarming, witty, and full of sweet charm, and tjh. Naturally I had to seek out the author of the book from which the movie was adapted. In doing so, I bought all of the other books written by Peter Mayle an ex-patriot Englishman living the life we all want to live in Provence.Thus I began the first of his books A YEAR IN PROVENCE, his twelve-month epistle of establishing a new home in the Provençale region of France.The articulate Mr. Mayle, a refugee from the advertising business, is of course articulate. More importantly though, he has a fondness for his subject matter and a humorous delivery that will at times make you smile and at other times make you roar with laughter.The book is part travelogue and part love letter to Provence that will make you wish with every fiber of your being that you could find a similar Provençal farm house with land growing grape vines and fruit trees and shuck this rat race for the tranquil life described by Mr. Mayle.If you haven't read this book, get a copy from your favorite online or local bookstore. I must warn you about one thing though. Don't do as I did initially and read a chapter at bedtime. The descriptions of the food consumed by the Mayles and their French neighbors and friends will make your mouth water. You'll find yourself in the kitchen uncorking a bottle of pinot noir and rooting through the fridge for a block of cheese."}, {"userName": "Tatiana", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/22783852-tatiana", "userReview": "Эту книгу можно описать всего двумя словами - \"МЕЧТЫ СБЫВАЮТСЯ\" :DПоддавшись порыву, супружеская пара из Англии осуществляет свою давнюю мечту - покупают небольшой фермерский домик на юге Франции в Провансе. Но герои даже не подозревали, что покупка дома обернется настоящей серией приключений. Жить в Провансе не так-то просто, их на каждом шагу будут подстерегать неожиданные открытия, новые знакомства, смешные и нелепые ситуации. \"Год в Провансе\" - это потрясающе светлая, очаровательная и смешная книга. Читала в запой, ее просто невозможно отложить. Безумно понравится главный герой, от чьего лица видеться повествование, я не переставала восхищаться тем, как он подмечал разные мелочи, как запоминал то, что ему рассказывали и как использовал эти знания на практики.Еще не могу не отметить тот факт, что книга впервые была издана в 1989 году, но у истории совершенно нет временных рамок, читая ее, легко представить, что в такое приключение попали люди живущие и в 2014-15 гг. Не знаю почему, но лично мне такие истории очень импонируют. Ну и , конечно, не могу не предупредить. Если вы любите поесть, это книгу не стоит читать без бутерброда, шоколадки или еще какого-нибудь снэка. Я вообще не гурман, но БОЖЕ, столько в книге еды и как это все интересно, живо и аппетитно описано. Под конец книги я не удержалась, зашла в хлебный, купила себе длинный батон и плавленный сыр, разрезала батон пополам, намазала его сыром и съела ПОЛОВИНУ батона за раз! XD"}, {"userName": "Negin", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/6326169-negin", "userReview": "I read right this before our visit to Provence, which has turned out to be one of my favorite places on earth. I was quite excited to read this since I’d always heard such great stuff about it. The book started out nicely enough but then became rather repetitive. Most of the stories were about renovating the author’s home in Provence and various dinner parties. There wasn’t much of a plot at all. I ended up skipping lots of pages and being quite bored, except of course for the parts describing food, since I really do love food! According to the author, the French simply adore their food, something that I can fully relate to. Some of my favorite quotes:“The French are as passionate about food as other nationalities are about sport and politics.\"“We remembered being told that the French spend as much of their income on their stomachs as the English do on their cars and stereo systems, and we could easily believe it.”"}, {"userName": "Robert", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/52594834-robert", "userReview": "Peter Mayle duce o viaţă frumoasă şi calmă. Sunt fericit că mai există încă oameni care se bucură din lucruri mărunte.  Mai vreau să vă zic ceva: Vreau să mă mut în Provence!"}, {"userName": "Catherine", "userReviewDate": "May 23, 2008", "userURL": "http://www.goodreads.com/user/show/617160-catherine", "userReview": "A Year in Provence is a book about a couple who decides to leave their every-day-life behind and begin a new life together in Provence. For those of you who don't know what Provence is, it's kind of like Tuscany meets France, but better. After reading this book, I truly hope some day Mike and I can enjoy a few days in Provence together.The book was divided into twelve chapters by month. It was a very easy read and often made me hungry as much of the story is about French food. Unfortunately, I found myself skimming over the parts about wine as I don't drink wine and (although his descriptions are very good) I think wine sounds pretty boring.The problem I had with this book was that at times it felt like there was no beginning, middle or end. To me it seemed the book ended the same way it started.I thought that the character was criticizing all of the tourists, however, he was rather new and foreign to Provence so I thought he should also be careful calling the kettle black. At one point in the book, the main character is complaining that it's hard to have company come because while your company is on vacation, he still had to carry out every day life. He claimed it was always hard to get things done with company in town because they expected you to play with them the entire time when in reality, you have things to accomplish. This would be a valid argument except for the fact that the English couple is actually quite lazy. They pay someone else to re-do their kitchen and to take care of their garden. The majority of their day is spent at the market, in the pool sipping wine or out at a fantastic restaurant. I had a hard time understanding exactly what they thought their company was impairing them from accomplishing (unless watching paint dry was on their to-do list). I think the real issue was that they were so much enjoying their time to themselves in their own part of Provence that they didn't like sharing their piece of Provence with people from their old life. English friends coming to visit only made them realize that they were English and not French.My last beef about the book is that if you step back, it's simply a diary of their home remodel. It should have focused less on this as the story of the remodel took away from the relaxing vacation I was taking inside this book.I think if I had this same life in Provence I would eventually get bored and fat. The characters never exercise but live from meal to meal. Although French people take their food seriously, I am sure they are more active than this English couple because they manage to take in all the calories but not get large. (I haven't seen very many large French people).This book would have been perfect if it included an appendix with some yummy recipes. I found myself closing the book and wanting to go buy some delicious cheeses, big grapes and Fresh warm bread (warm and fluffy on the inside, crisp and delish on the outside.).All in all, I gave this book a B-. Reading it took me to Provence in my own little escape. The descriptions of the food and the culture were entertaining and rather accurate. I would recommend this book to anyone looking for a relaxing, easy and dreamy summer read. A great book to read if you can't afford to go to France this summer and are still looking for an escape."}, {"userName": "Neil Fox", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/23158468-neil-fox", "userReview": "Reading this at the back end of a Northern European winter, Provence seems, and is, a million miles away. From the pages of this book flow the sights, smells, tastes, moods, sounds and ambiance of Provence, right down to the clear, crisp and sharp quality of the Provencale light. The sights of its flaura - the vines, wild flowers, thyme, lavender and forests of cedar, scrub pine and walnut are combined with the tastes of its gastronomic delights - the cheeses, pates, terraines, casseroles and game in a fusion that only those who have visited this delightful part of France can fully appreciate. Alas, beyond its vividly descriptive evocation of the sights and tastes of Provence, the book regrettably thereafter falls back on caricature that unintentionally satirises and patronizes its inhabitants. The characters are exaggerated caricatures - bumbling tradesmen, eccentric country folk (more than once referred to as bumpkins), honest farmers (condescendingly referred to as Peasants') and gregarious cooks. The dialogue is resplendent with \"Oh la la's\", \"Merde\" and \"Allo' alloa's\" accompanied by nonchalant Gallic shrugs. Mayle portrays himself as the quintessential amicable outsider Englishman, an object of curious amusement for the bumpkin-like locals, or a \"Rosbif\" as the French like to counter-label the English in retaliation for the widely used \"Frogs\" assignation.English visitors to Mayle's Provencale bolt-hole are likewise \" Ted & Susan\" type caricatures of traveling English folk - linguistically, culturally and culinarily challenged bungling tourists and nuisance guests. For sure this is patronizing stuff which becomes repetitively annoying.I didn't bother to Wikipedia Mr Mayle's backstory to learn more about the background as to how or why he set about his adventure in Provence, but his writing mentally conjures up an image of a privileged City-type getting away from it all spending his bonus playing the country squire in rural France - the type that Brexit will shortly render an endangered species. Mabel I'm being a bit unkind, and for sure Mayle has a genuine fondness for the French and their quirky traditional rural way of life, but I don't think I'll be reading the follow-on \"Toujours Provence\" and \"Encore Provence\" - plus de la meme chose, je crois. No encore required.."}, {"userName": "Manab", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/11914172-manab", "userReview": "লেখার হাত ভালোই ভদ্রলোকের, পাতার পর পাতা খাবারের নাম লিখে যাবে স্রেফ, আপনি ভাববেন কী না কী লিখতেছে।যেহেতু বইটায় আসলে আগ্রহোদ্দীপক কিছু ত দূরে থাকুক, কিছু ঘটে না, অনেকের ভালো না লাগা স্বাভাবিক। অন্য সময়ে পড়লে হয়ত আমারও লাগত না, কিন্তু বইটায় একটা হাওয়া হাওয়া ব্যাপার আছে, এবং যেহেতু কোনো ঘটনা নাই, মানে এক বছর প্রভাঁস বসবাস বাদে, আপনি নিজেও এই বই এক বছর লাগায়ে পড়তে পারবেন। মানে পড়ার কোনো তাড়া নাই, কথিত এলাকার মত ভেতরের অক্ষরেরাও মৃদুমন্দ ভেক ধরে থাকে।ফলে, রোগী এবং পরীক্ষার্থীদের জন্য আদর্শ। বিশেষ করে বিছানায় আটকে গেছে যারা।তাছাড়া ভদ্রলোকের রসবোধ ভালো, অল্পের মধ্যে যতখানি দেখা যায়। প্রতিবেশী ভদ্রলোক অদ্ভূত, পানির কল-সারানির লোকটাও।শেষ করে ফেলতে হলো, কারণ একে ত আমি একসাথে দুইটা বই পড়তে পারি না, তাই এইটা আস্তে আস্তে পড়তে থাকা মানে আর কিছু না পড়া, তাইতে আবার এখন রোযা চলতেছে, এবং এই বইয়ের অর্দ্ধেক শব্দ খাবারের নাম।তবে এমনও ত না যে ঘর থেকে বাইর হইলে আমি রোযা ধরে রাখবো!পীয়্যানের বই। সে একদিন হুট করে কিনে দুম করে পড়তে দিছে।"}], "description": "National Bestseller In this witty and warm-hearted account, Peter Mayle tells what it is like to realize a long-cherished dream and actually move into a 200-year-old stone farmhouse in the remote country of the Lubéron with his wife and two large dogs. He endures January's frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of goat racing through the middle of town, and delights in the glorious regional cuisine. A Year in Provence transports us into all the earthy pleasures of Provençal life and lets us live vicariously at a tempo governed by seasons, not by days.", "title": "A Year in Provence\n      \n          (Provence #1)", "url": "http://www.goodreads.com/book/show/40189.A_Year_in_Provence", "average": 3.95, "cover": "https://images.gr-assets.com/books/1494896848l/40189.jpg", "reviews": 2508, "authors": [{"url": "https://www.goodreads.com/author/show/19316.Peter_Mayle", "name": "Peter Mayle"}], "type": ["Travel", "Nonfiction", "Autobiography", "Cultural", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/40189.A_Year_in_Provence", "http://www.goodreads.com/book/show/8297770-a-year-in-provence", "http://www.goodreads.com/book/show/419182.A_Year_In_Provence", "http://www.goodreads.com/book/show/9417986-a-year-in-provence", "http://www.goodreads.com/book/show/535319.A_Year_In_Provence", "http://www.goodreads.com/book/show/955803.A_Year_in_Provence", "http://www.goodreads.com/book/show/44259.A_Year_in_Provence", "http://www.goodreads.com/book/show/6115088", "http://www.goodreads.com/book/show/12975315-a-year-in-provence", "http://www.goodreads.com/book/show/44255.Toujours_Provence", "http://www.goodreads.com/book/show/40184.Encore_Provence", "http://www.goodreads.com/book/show/40183.French_Lessons", "http://www.goodreads.com/book/show/40190.A_Good_Year", "http://www.goodreads.com/book/show/562549.Hotel_Pastis", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}