{"ratings": 141, "userreviews": [{"userName": "Bill", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "**Review for Audiobook version** Well, this one was certainly not boring. Lots of action and sarcastic wit filled dialog. With a title like BadAss Zombie Road Trip you can expect over the top characters, whacky road trip antics and plenty of comedy.After a deal gone south with the devil, Dale loses his soul and now instead of going to Reno to play a gig, he and Jonah must travel across the country to literally try and save their souls. Along the way they will meet many interesting characters and even end up all douched up in maxi pads and feminine odor control products. Huh? Yep. Hygiene happens.The narrator did a great job with this one. Good inflection and comedic timing. Recommended for a light hearted and fun listen.*I received a review copy of the audiobook from the publisher/author for an honest review and this is it."}, {"userName": "Kat", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/3835702-kat", "userReview": "Zombies, Satan and a road-trip? I was so excited when Tonia approached me about reading this book – what better ingredients could there be for a good story? Jonah is one of those “background” kind of guys, smart, kind and just not that lucky with women. His best friend Dale is his exact opposite, not the sharpest knife in the block, has women chasing after him and frankly is a bit of a tw@t. On their way to perform at a gig in Reno, Jonah decides to take a detour to California and reunite Dale with his estranged father, with disastrous results. Compelled to drive across the country in search of Dale’s soul, all the while trying to keep a zombie from eating everyone in sight and try not to fall into Satan’s traps it’s going to be a long week. The writing of BadAss Zombie Road Trip is spot on – action in all the right places, witty dialogue and realistic characters who are either love ‘em or hate ‘em types, and there are more than a few laughs along the way. “He’s more than just a bit of a douche. I’m surprised he doesn’t smell like vinegar.” My favourite part of the book was definitely in the final stages, when Jonah has to take some pretty extreme measures to stop the stench of the rotting zombie in the backseat, and my favourite character was Satan, who is surprisingly funny for the Prince of Darkness – although I guess you’ve got to have a sense of humour in his line of work. The only problem I had was towards the end when there is a change of plans due to the dodgy past of Candy the stripper (oh yes, what a cliché!), it was necessary for the story but it distracted me from the flow of the book. Overall, if you like zombies, road-trips, Satan and a laugh, this is a book you’d really enjoy."}, {"userName": "Sheri White", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/3884085-sheri-white", "userReview": "Amusing and gross - fun story to read."}, {"userName": "AudioBookReviewer", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "ABR's original Badass Zombie Road Trip audiobook review and many others can be found at Audiobook Reviewer.I initially sat back more than a little shocked at Tonia Brown’s book Badass Zombie Road Trip. I went into it with no expectations or knowledge of what it was about, and when the f-bombs started dropping I laughed, paused the book and did some research into what exactly I was getting myself into.If you give Badass Zombie Roadtrip a chance, you definitely need to know what you’re getting into.First off, BZRT isn’t a post apocalyptic novel per se. There’s really only a single zombie character in the book and he and the other main character are involved in a wacky trip across America to regain his soul. It was sort of stolen by the Devil, you see. In a traffic stop. Sort of.Trying to summarize the plot of BZRT wouldn’t do it any justice, so I won’t. I will however cover some of the things you should know about the book.Jonah and Dale do NOT shy away from lengthy discussions about sex and gore. I would venture to say that 50% of their interactions revolve around moving the plot forward, and the other 50% are them ragging on each other in a humorous, but potentially very offending fashion. If you’re thin skinned about any kind of racy humor, you probably won’t appreciate their scenes, and they’re the book. While funny and well written, I do think the two character’s are a bit over the top. Intentional as this may be, some of their conversations go on about sex (or in one long section of the book a missing thumb) for a bit too long, and it drags out the story and made it a little less entertaining for me.BZRT strikes me as a strong homage to Neil Gaiman’s and Terry Pratchett’s Good Omens, and that’s very high praise from me. I would also add that it feels like Tonia Brown channeled Kevin Smith into her writing for this and while I would normally be thrilled for that, it does make the book a strange, off-kilter experience. I enjoyed it, but I can see how this is not the cup of tea for the faint hearted, or for those seeking out a traditional post-apocalyptic story, or one with lots of action.Expect crude laughs in spades and you’ll love this book.Despite a few moments of audio echo in the performance John Voorhees does a wonderful job being very theatrical throughout. He jumps between Satan, Dale and Jonah with a zeal that’s hard not to enjoy and when Candy the stripper (You knew that was coming, right? The name?) his rendition of her entertains, and her presence makes the book more enjoyable as well.Badass Zombie Roadtrip is a trip alright, and I hope you pack well and expect some fun.Audiobook provided for review by the author via audiobook blast dot com."}, {"userName": "J.R.", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/7586367-j-r", "userReview": "Ever have a road trip with a buddy? Usually those trips are great fun. Not the case with Jonah and Dale. Best friends since kids, the two have become musicians if only in their own eyes and plan a trip to Nevada where they have a gig. Sounds pretty innocent, two best buds on a trip, not a care in the world.But then things go to hell and I mean that literally.Dale, the outgoing, gregarious member of the duo has a habit of falling asleep in the car during trips like many people do. Not all that uncommon. But, while at a diner on the way to their gig, the conversation turns to locations that they always wanted to visit. Turns out Dale has never been to Disneyland in California but when Jonah mentions going there, Dale gets upset and won’t explain why.An idea forms in Jonah’s mind, what if they blew off their music gig in Nevada and headed to sunny California?Once Dale falls asleep, Jonah makes that fateful decision to head to CA. Bad idea.Dale wakes up just after they cross the state line and freaks out. He struggles with Jonah for control of the car causing them to get pulled over by a California Highway Patrol motorcycle officer. Only this officer is not your normal officer, he turns out to be Satan himself and he wants Dale’s soul.Way to go Jonah.Turns out old Scratch had made a deal for Dale’s soul way back when Dale was a kid but due to some paperwork issues, the contract was only good in California. Lucifer takes Dale’s soul leaving the body on the side of the road. Jonah, witnessing this event pleads for some way to get his friend back. Ever thoughtful, the Devil offers Jonah a chance, more of a sick, twisted game really. A cross-country hide and seek that if Jonah wins, he gets Dale’s soul back. If he loses, the Devil takes both of their souls. Reanimating Dale’s now soulless body as a guide, Satan promises not to interfere with Jonah. Yeah, that would happen.Jonah, now with zombie Dale as a passenger, follow some extremely random clues in an effort to find Dale’s soul within the seven day time frame. Along the way, they meet with Dale’s father, pick-up a stripper running from a low level mob boss, make local media attention when Dale feeds behind an AM/PM when they stop for gas, lose some of Dale’s body parts and end up right back where they started from thanks to their passenger, Candi, the stripper.All in all, Badass Zombie Road Trip is one hell of a dark comedy roller coaster ride as two friends try to beat the Devil at his own game.Ms. Brown’s writing is on par, very fun and enjoyable to read. Zombie Road Trip makes my personal list as a definite keeper."}, {"userName": "Graeme Reynolds", "userReviewDate": "Sep 19, 2012", "userURL": "http://www.goodreads.com/user/show/5697009-graeme-reynolds", "userReview": "Badass Zombie Road Trip by Tonia BrownReview by Graeme ReynoldsJonah Benton lives a relatively quiet life in a small American town. He had a dead end job and despite being smart and intelligent, lives constantly in the shadow of his best friend, Dale, who is dumb, obnoxious and attracts members of the opposite sex like flies to an overflowing litter tray. When they embark on a trip to play a gig in Reno, Jonah takes a detour into California to reunite Dale with his estranged father, and it’s at this point that events take a turn for the worse. Jonah is forced to make a deal with Satan to save his best friends soul, putting his own on the line in the process. Jonah, the newly zombiefied Dale and a stripper called Candy, must travel across the United states to find Dale’s missing soul, while being pursued by the Police and the Mafia. However Satan is not going to make things easy for them.I will admit that I am sick of zombies. There are only so many books or movies that I can get through that involves a small group of survivors holding out against the threat of a zombie horde, so I started reading this with a little trepidation. I need not have worried. Badass Zombie Road Trip is a very different book from the usual zombie fare. For one thing, it’s absolutely hilarious. Horror comedy is not an easy thing to pull off, but this book delivers it in spades. The banter between Jonah and Dale is natural and highly amusing, but things really pick up once Dale’s soul is taken and the pair have to start dealing with Dales new state of existence. Such as his hunger for living human flesh and the fact that he has begun to rot. The scene where they try to cope with the stench by gluing feminine hygiene products to the indignant Dale is absolute genius, as is a section where Dales attempt to obtain some food results in his intended target (a small yappy dog) stealing one of his body parts and burying it in a back yard.There are not many scares in this book, and despite the subject matter it is very firmly on the comedy side of the fence. That’s not to say that there is not plenty of tension and once I started the book, I found it to be a real page turner.Overall, Badass Zombie Road Trip does exactly what it says on the tin. It’s a funny, sometimes moving, sometimes gross and always entertaining road novel, which happens to have a zombie as one of the protagonists.If this sounds like your sort of thing, then you could do a lot worse than picking up this novel."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "From the title of this book, Badass Zombie Road Trip, I had a vision of an apocalyptic ride across undead highways in a classic car (maybe a convertible Caddy or a hot rod like an old Road Runner). Even the picture used on the cover reinforced that vision. Alas, it was not meant to be. What I got instead was a tale of Jonah and Dale, best buddies, on the run to chase down a lost soul before the devil does them in. Not a bad trade off, especially when Candy, a beautiful hitchhiker, is added to the mix. She adds a bit of spice to the testosterone mix, especially since Dale, the lothario of the duo, has his sights set on her as his next conquest, while Jonah, the meek and mild member of the pair, is falling hard for her in his own modest way. The threesome has to make it cross country after a poorly thought out (and devilishly influenced) detour into California, where Dale soul is taken from him by Lucifer himself, collecting on a debt incurred during his childhood. To save his friend, Jonah ups the stakes and tosses his soul into the mix if Satan will give them a chance to reclaim Dale’s soul. Unfortunately for both of them, the Devil doesn’t play fair, so Dale is not only soulless, he’s lifeless too-though he can move around and talk…and he’s hungry for a bit more than junk food. Jonah and Dale’s relationship is an interesting dynamic. Dale is overwhelming, loud, obnoxious, and a letch, while Jonah is quiet, intelligent, sincere, and innocent. They seem to fit together well, though Dale’s bullying tended to rub me the wrong way and I wanted Jonah to stand up for himself a bit more. And that is where Candy, the intriguing hitchhiker who gets the boys into even more trouble, comes in. She is beautiful, somewhat mysterious, and triggers strong interest from both of them. Plus, she adds her own brand of trouble to the story that keeps things hopping. Overall, the journey is an entertaining one, though it grinds through a few scenes. Dragging a zombie across country that needs to feed on something…substantial…every now and then is definitely a cause for concern and plenty of misfortune. The Devil is cunning and likes to cause as much woe for our road warriors as possible, which keeps things popping. The dark humor here works and so does the relationship between the three main characters, who seem to mesh well, even when they’re causing each other major grief. This is a quick read, and a fun one."}, {"userName": "Heather Faville", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/2697506-heather-faville", "userReview": "I love road trips. Whether it be heading out with a specific destination in mind or if we just hop in the truck and start driving. Road trips almost always lead us to some new and fun discovery...or at least some awesome memories and pictures.In the case of Badass Zombie Road Trip our 2 main characters, Jonah and Dale, truly do end up on a road trip from hell. It's a little bit Smokey and the Bandit and a little bit Thelma and Louise with the Devil hot on their tale. This has to be one of the funniest and most entertaining books I've read in a long time. Within it's pages you will find action, adventure, romance, some mystery and intrigue and, of course, some devilish antics with the Prince of Darkness himself.I really don't want to go into much detail regarding the story as the summary above says all you need to know to get started. The characters are a fun mix. Jonah is, pretty much, a goody two-shoes, Dale is a bit of a dick and the Devil is actually rather charming, in a manipulative soul stealing burn in hell sort of way. As with much of Tonia Brown's work the dialogue on Badass Zombie Road Trip is witty and quite often hilarious!A definite must read if you are in need of some fun in your reading. I loved it."}, {"userName": "Aaron Reiser", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/7989805-aaron-reiser", "userReview": "I expected this book to be a day or two wasted just reading some random material but I have to admit that I was pleasantly surprised by this author. It's a light read with some great characters (Jonah, Dale, Candy, and the Devil) that really pull you in. The banter between the two friends is exactly what I would expect and the Devil plays his part well. I'd recommend this book if you have a week to read something light and fun, and I will definitely keep looking at this author for more good works."}, {"userName": "Ariyana Spencer", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/5770125-ariyana-spencer", "userReview": "A hell of a good time! I read the title and knew I wanted to read the book immediately. If glee is your initial reaction to reading the words \"Badass Zombie Road Trip,\" then this is the tale for you. It's a fun, gross-out adventure about two friends on a mission...no, not a mission from God. More like a mission from Satan. Also, there's a zombie, a stripper, and missing-body-part hijinks. Can't go wrong with that combination."}, {"userName": "Pamellia", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/12457099-pamellia", "userReview": "Fun, easy read. Good sentence structure and editing. Sort of a goofy story line, but it as fun and amusingRecommended for those enjoying light, comical zombie stories."}, {"userName": "Netanella", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/1157679-netanella", "userReview": "Three 1/2 rounded to four stars for the sheer audacity of the plotline. Good stuff."}, {"userName": "William Breen", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/18817069-william-breen", "userReview": "Entertaining, quick read."}, {"userName": "Janyne", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/2953856-janyne", "userReview": "3 stars, met expectations. Like a B rate zombie movie, entertaining in a can't avert my eyes kind of way."}, {"userName": "Nathan Robinson", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/5396157-nathan-robinson", "userReview": "Badass Zombie Road Trip by Tonia BrownI could find little wrong with BZRT; it’s nicely written, well plotted with enough twists and turns to keep any readers attention all the while being an interesting take on the zombie genre. The plot involving two friends, one who, by way of other worldly forces and a deal with a certain fallen angel, finds himself a fully fledged paid up member of the undead, is far enough away from traditional zombie fare to attract a full range of horror fans. Dale and Jonah, our bickering polar opposite heroes, are two childhood friends, who chose a path of becoming a jobbing musical duo/band with high dreams of making it big with little chance of doing so with their different music tastes. By hook or by crook, Jonah finds himself with a dead friend on his hands and is given seven days to travel across country in order to save both of their souls with much devious interference from a certain ruler of the underworld. Along the way they pick up a stripper with a dangerous trail behind her, bringing a welcome romantic element to proceedings, and a much needed different dimension to the buddy movie that the book soon becomes. Not that’s a negative thing, BZRT does follow a traditional buddy formula with two opposites that grate and irritate each who suddenly find themselves as fish out of water and into the frying pan. But it’s well written banter, reminiscent of Shane Black witticisms (who should write and direct if they ever make this into a damned film, Sean William Scott as Dale, Anton Yelchin as Jonah. DO IT HOLLYWOOD! I DARES YA! ZOMBIES ARE VOGUE AT THE MOMENT!). It’s refreshing to have a zombie character that isn’t simply a meat eater, someone who’s gaining a soul whilst they forward on their journey, using their affliction as a MacGuffin, not just something that must be fought and defeated, but something that must be saved, despite its hunger and it’s attitude towards the female kind. It would have been nice to see the Zombie get a little dirtier with his wanton desires, even if for comic effect, this would made the story a little more dangerous than it already is.If you enjoyed the Kevin Smith produced ‘Reaper’, (which I miss; let’s bring back Ray Wise in this as the devil, eh?) then I’d thoroughly recommend this book to you. The plots not overly complicated but it works so damned well you don’t care. It does exactly what it says on the tin. It’s a road trip- with a zombie, but strangely with heart and at core we have a friendship that can’t even be faulted by death, forged by comradeship and will to do right."}, {"userName": "Amie's Book Reviews", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/11232185-amie-s-book-reviews", "userReview": "BAD ASS ZOMBIE ROAD TRIPAuthor: Tonia BrownType of Book: Audiobook - Unabridged Narrator: John Voorhees Length: 10 hours, 15 minutesGenre: Zombie FictionRelease Date: February 20, 2015Publisher: Tonia Brown Rating: 5 out of 5 stars ⭐⭐⭐⭐⭐ * I received a free copy of this audiobook from AudioBookBlast in exchange for an honest review. ** This audiobook is not suitable for listeners under the age of eighteen, nor is it suitable for people who are easily offended or who dislike profanity and crude sexual descriptions.With that said, this audiobook is hilarious. It is a mixture of horror and comedy. The author mixes those two genres in a way that will have listeners laughing out loud. Jonah and his best friend, Dale set out on a road trip to Reno, Nevada. They have booked a gig at a Reno casino for one night. The two friends are a duo and they are not very talented, but they love to perform. Dale tells Jonah that the only place he can't go is to California, but he won't say why or what would happen if he did go there.With a couple days to spare before their gig, as they are Driving towards Reno, Dale falls asleep. Jonah decides to help his friend face his fears and to drive into California while Dale sleeps. As soon as they cross the border their lives take an unexpected turn for the bizarre. Suddenly they are on a road trip that involves a zombie, a stripper and Satan himself. If something can go wrong, it does and Dale and Jonah find themselves in a race for their immortal souls. This is NOT your average zombie story. It is unique. I know that people say that word a lot: \"unique\". But this book truly is. The narration is excellent. John Voorhees has talent in spades. Each character's voice is so distinctive that listeners will assume that there is more than just one narrator. His pacing is spot-on and he definitely has a flair for the dramatic. His depiction of the voice of Satan contains the perfect mix of condescension, disdain and casual evil. I will definitely seek out more books narrated by John Voorhees. If you are a fan of dark comedy, this audiobook is for you. I rate BAD ASS ZOMBIE ROAD TRIP as 5 out of 5 stars. ⭐⭐⭐⭐⭐"}, {"userName": "Jami", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/7042212-jami", "userReview": "I had a couple of rough starts with this audiobook, I was having a hard time getting into in and had to stop listening until the time was right. After I got about a third of the way in to the book I was hooked. Tonia Brown broke out of the zombie stereotype with this one. It is full of dark college humor and cringe worthy gore. Nice combo in my book! But not recommended for young ears unless you want to have really awkward conversations explaining the content, or if you don't have a sense of humor. But if you do, give this book a chance. Just not while eating.. Jonah and Dale have been besties since they were kids. They are in a two man 'band' together and going on tour. The two of them are polar opposites. Jonah is the nerdy, inexperienced, shy part of the duo- and Dale is the loud, womanizer, obnoxious side. When Jonah finds out Dale has never been to California he decides to make a detour on the way to the next gig in Reno while Dale is passed out in the back seat to reunite him with his estranged father. Bad move. As soon as they cross the state line, they are pulled over by Satan, who takes Dales soul. Jonah makes a deal with the devil for his friends soul, and this takes them on a wild goose chase of a road trip with a time limit. Satan reanimates Dale to keep Jonah company, and to help out along the way. So Dale is a full fledged zombie, hunger for flesh, decomposing (dead skin chafes pretty easily) and digestive issues (what goes in must come out). Along the way they pick up Candy- the stripper, who is only trying to get back home to her father.. right? The trio get in plenty of sticky situations along the way including a dog taking off with an appendage of Dale's, and using feminine hygiene to control the.. ahem.. smell. John Vorhees does a great job with the narration. Each character has their own voice, you are never confused about who is talking. He adds in emotion to the characters, bringing them to life. His pacing is good, and he has a pleasant speaking voice that is easy to listen to. Audiobook was provided by the author in exchange for an honest review via Audiobookblast dot com"}, {"userName": "David Eccles", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/13435834-david-eccles", "userReview": "This review is a mirror of the review i left on Amazon.co.ukJonah and Dale are long-time buddies, but are complete polar opposites: Dale is good looking, a real ladies' man, and really rather rude and obnoxious, whereas Jonah is introverted, the thinker of the two, and lacking in experience with the ladies. Our unlikely duo are on their way to play a gig in Reno, but while Dale is asleep in their red Ford Focus, Jonah decides to help Dale to be re-united with his estranged father and instead drives to California.Upon waking, we learn why Dale was so insistent that he should never return to California.Enter: Satan, and the beginning of a rip-roaring, riotous road trip to return Dale's soul to his body while traveling the breadth of America from West coast California to North Carolina! And all before Dale's re-animated corpse begins to rot and stink!We follow Dale and Jonah on their adventure, discovering what it's really like to be a zombie, and what the pitfalls are to travel with the undead by your side. Picking up the ravishing Candy along the way adds another layer of difficulty to their already seemingly impossible task, and throw in a run-in with Californian Mafia wannabes, Dale's father and multiple revisits by the hilarious and deeply devious Lucifer, and you have a truly satisfying and side-splittingly funny read ahead of you.As to how it all ends up--you'll just have to read the book!Tonia Brown has written one Hell of a zombie tale, and I highly recommend that you read it!"}, {"userName": "Annie", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "** I was given a free copy of this book in exchange for an honest review **I honestly loved this!! I laughed and laughed!! The concept was unique and well executed and the story was hilarious!!Jonah and Dale are longtime best friends and have a small band together...well on the way to a gig they run into a a little trouble...see Dale has been banned from California and will not tell Jonah why...Well Jonah gets the bright idea to take him there anyway, so when Dale goes to sleep on there way to a gig..off to California they go! Well that's where the Devil comes into play....Posing as a traffic cop he pulls them over and gets Dale's soul...Jonah makes a deal to try and get it back and a hilarious road trip ensues....on the way they meet Candy a stripper on the run...and things get even more complicated...This is a laugh out loud hilarious book...and I recommend it!!!Thank You Audiobookblast(dot)com"}, {"userName": "Mark Cain", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/22468885-mark-cain", "userReview": "A Fun Book, Even for the Non-Zombie fan!\"This must be distinctly understood,\" as Dickens said at the beginning of a Christmas Carol. Otherwise, there would be nothing special about my liking this book.So let me say it again. I'm not a zombie fan. Never have been. They're too slow. Too stupid. Give me a good old-fashioned vampire every time.Except ... when zombies are used in comedy, they can be great. What we have in this book is a classic buddy road trip. It just so happens that one of the buddies is a zombie. Enough about the plot, though. I don't want to spoil it for you.The main characters are personality opposites -- they clash constantly -- but are held together by a deep bond of affection. The situations they get themselves in are sometimes silly, other times laugh-out-loud funny. It kept me entertained for the whole run of the book.Highly recommended. Even if you don't like zombies."}, {"userName": "Tina", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/9816828-tina", "userReview": "Badass Zombie Road Trip | [Tonia Brown]Badass Zombie Road TripUNABRIDGEDby Tonia BrownNarrated by John VoorheesReviewed: 6/19/15\"Great Story\"OverallPerformanceStoryI received this book for a honest review , here goes. I loved the story , it was funny but suspenseful . How can you go wrong with Satan , A zombie, a nerd and stripper. I listen at work and several times I found myself laughing .You are the author of this review\"My name is Larry E Crawford.\"OverallPerformanceStoryAWESOME!!!! Keep them coming and we will keep reading them. Also it has a great ending. You are the author of this review"}, {"userName": "Kari", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/6903365-kari", "userReview": "Hmm this fits the horror genre in much the same way The Scary Movie franchise does. If you include Satan, soul selling, and zombies as the only need for horror classification this fits. Otherwise it is a charming novel about two friends on an adventure with a bit of a love twist thrown in. I might have given it more stars with more horror plot and aspects but as it read more of a romantic adventure I did not. There is some humour to the plot and it moves along at a fast pace. In fact there where even some surprises along the way. Keywords For January --badI will not be counting this as horror for Book Riot's Read Harder Challenge, 2016."}, {"userName": "Tracie McBride", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/4150533-tracie-mcbride", "userReview": "A recent conversation with the author on Facebook reminded me to write my review. Tonia Brown writes funny. Funny ha-ha, not funny peculiar. Hers is a natural, unforced, organic humour that riffs off many predecessors but with an end result that is fresh and entertaining rather than derivative. That Facebook conversation was about the possibility of a film treatment of BAZRT - this book is ripe for a film adaptation. Think 21 Jump Street, Tucker and Dale vs Evil, Sean of the Dead and The Hangover, thrown in a blender and served up tastier than the sum of its parts."}, {"userName": "Valerie Moschovis", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/27332844-valerie-moschovis", "userReview": "Badass Zombie Road TripThis is a buddy road trip with a twist. I like zombies so chose this book. This is not your typical zombie story, so don't be afraid if that's not your thing. Of course, there's some light romance along with the bromance. Get this book -- it's a devilishly good read."}, {"userName": "Rosann", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/5819763-rosann", "userReview": "A really fun book to read and couldnt help but laugh at the things these 2 friends would end up getting themselves into. You have the devil himself, who had a bit of a dark humor, 1 zombie, his best friend and a girl ..there always has to be a girl involved, and of course the Dad (Mike) where in the end, Karma came back on him and the devil laughed since in the end he got what he wanted."}, {"userName": "Amy", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/1429106-amy", "userReview": "I honestly wasn't expecting too much from a zombie road trip tale but I was happy to be mistaken. The story was interesting, the pacing was good, there were unexpected twists and turns and it ended up being very entertaining."}, {"userName": "Miles", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/28018011-miles", "userReview": "This was one of the funniest books I've read. It's a quick read and I recommend it to anyone looking for a laugh. It is definitely a movie waiting to happen, (maybe starring Michael Cera as Jonah, James Franco as Dale, and Emma Stone as Candy) I just wish the ending was a little more clever."}, {"userName": "Sharon", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/2897335-sharon", "userReview": "Loved it!!!"}, {"userName": "Bree", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/5755102-bree", "userReview": "A fun roadtrip with a zombie."}, {"userName": "Robin", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/11154802-robin", "userReview": "4.5 stars. Fun characters. fun story."}], "description": "2,000 miles. Seven days. Two souls. One zombie. Satan. Everyone LOVES Tonia Brown's BADASS ZOMBIE ROAD TRIP. You know why? Because it's BADASS! Just check out what people are saying! Tash Williams from AndyErupts: Badass Zombie Road Trip is a fantastic book, the storyline is extremely well thought out and the action starts almost immediately. It is also extremely funny and has one of the best instances of truly expressive swearing I have ever read in a book… I am being honest in saying that this book is one of the best stories I have read in a long while. Nathan Robinson at Snakebite Horror: Nicely written, well plotted with enough twists and turns to keep any reader's attention all the while being an interesting take on the zombie genre… and far enough away from traditional zombie fare to attract a full range of horror fans. The Aussie Zombie: The writing of BadAss Zombie Road Trip is spot on – action in all the right places, witty dialogue and realistic characters who are either love ‘em or hate ‘em types, and there are more than a few laughs along the way. Lori Bowland at Living Dead Media: Readers are in for a treat with \"Badass Zombie Road Trip. It's one of the most enjoyable of horror comedy novels to come along in a while. The entire book is hilarious, wonderful and flawless. It's the best of screwball comedies with a bit of the grisly to keep it delightfully weird. Be prepared to laugh your hearts out and be taken on an insane cross country journey. Graeme Reynolds' Blog: Badass Zombie Road Trip is a very different book from the usual zombie fare. For one thing, it’s absolutely hilarious. Horror comedy is not an easy thing to pull off, but this book delivers it in spades. It’s a funny, sometimes moving, sometimes gross and always entertaining road novel, which happens to have a zombie as one of the protagonists. Buy Zombie: Badass Zombie Road Trip was a unique tale about the undead and one that I highly recommend picking this one up immediately! It’ll be a quick read but a fun one. Synopsis: Jonah has seven days to find his best friend’s soul, or lose his own, dragging a zombie across the country with a stripper who has an agenda of her own, while being pursued for a crime he didn’t commit... and dealing with Satan.", "title": "BadAss Zombie Road Trip", "url": "https://www.goodreads.com/book/show/13454467-badass-zombie-road-trip", "average": 3.83, "cover": "https://images.gr-assets.com/books/1329664180l/13454467.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/3160763.Tonia_Brown", "name": "Tonia Brown"}], "type": ["Horror", "Horror", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/13454467-badass-zombie-road-trip", "http://www.goodreads.com/book/show/12093821-rodger-dodger", "http://www.goodreads.com/book/show/8087046-clockworks-and-corsets", "http://www.goodreads.com/book/show/13582372-skin-trade", "http://www.goodreads.com/book/show/8515643-lucky-stiff", "http://www.goodreads.com/book/show/13493277-the-trouble-with-waxford"]}