{"ratings": 29956, "userreviews": [{"userName": "Trevor", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "So, you are about to tuck into a lentil burger with chia seed extract for that omega three boast you know your body has been crying out for since your last detox, especially since you aren’t completely sure if the cannabis oil you’ve been baking into your gluten free cookies has given you indigestion or if it is the start of the stomach cancer you thought you might have had and was the reason why you started eating the damn things in the first place. The guy on the Internet who sold you the oil sounded damn convincing, but, then again, so did the guy who told you that you needed mega doses of vitamin Q – an extract from goat urine and krill that, if taken in large enough doses, might even make your hair curly.If this sounds like Tuesday, rather than a WTF moment, then this is a book you really, really need to read, and right now. Actually, no matter what your religion, you need to read this book. This guy is both very funny and very clever – these are, truth be told, two of my favourite things in the whole wide world. As much as I hate to admit it, I would probably forgive just about anyone anything if they can just display these two qualities – even only every now and again. But this book is also insanely important for you to read as well. In it you will learn stuff. Let me explain how I came to read it.A couple of weeks ago there was a newspaper article – no, a flood of newspaper articles all over my social media feeds – all about research that proved that you get cancer by bad luck rather than any of that other crap you thought you got cancer from – you know, ‘life style’, smoking, stuff like that. This might sound like bad news, but since there is stuff-all you can do about bad luck – even if you are a management arsehole who ‘makes his own luck’ – that then has a reassuring ring to it if you think about it for long enough. Pass the smokes and yes, I will have a double, no, stuff it, just leave the bottle. Except the next day or so another article appeared in the Guardian that said this first series of articles were all crap – AND that the reason why they were all crap was because journalists are too bloody stupid to know if a bus is up them, well, unless the passengers get out, and if you want to avoid being fooled again, read this book. So I did. And they were right. This is a necessary read – you’ve been repeatedly told that now – and I’m going to tell you again – what are you waiting for?What will you be told by reading this book? Well, one of the main things is that there are two things that have been repeatedly shown to lead to a healthy and productive life – eat food, mostly vegetables with lots of fruit thrown in for the colours if nothing else, and exercise. There is no magic pill, there is no secret wonder food, there is only that to know – eat stuff that is good for you and exercise enough so that your body doesn’t atrophy and you’ll probably be ok. No guarantees, by the way, life doesn’t come with guarantees, but do that and you are doing your bit, do less than that are you are building up Karma that’s going to get you, sooner or later. When people tell you that you need to do more than this eating food and moving your arse occassionally, they are selling you something, and the most likely thing they are selling you is bullshit. As he says, someone who tells the truth or someone who lies are similar in that at least both of them know there is a truth that is worth lying about – however, someone who bullshits doesn’t even give the truth that level of respect. It is embarrassing to admit the amounts of bullshit I assumed must have a bit of scientific backing behind them before reading this book. The most obvious one being the whole fish oil idea, hmm. But I’m guilty with an excuse. I am someone who really doesn’t like the taste of fish. There are times when I will eat fish – those times are directly correlated to when I’m in a Japanese restaurant – but I’m really not going to thank you for giving me fish. Particularly something strong and oily like sardines. I can understand why some people might want to put sardines into other people’s mouths – just as I can understand waterboarding – but to willingly do this to themselves is a form of flagellation I’ve never quite understood – torturing others, fine, but yourself? Not even Dick Cheney water boards himself. I know, there are international conventions on this sort of thing, but they are all so 1945, don’t you think? So, if you want to put sardines in your mouth – and I feel a bit queasy even suggesting such a thing - well, that’s up to you, but I still have to come down on the side of Nuremberg when it comes to doing this to other people.This reluctance of mine to eat fish in general, but oily fish in particular, has made me prone to the idea that I probably should have fish oil supplements to make me smarter or to prevent arthritis, or one of the other wondrous things these oils do. And, if ‘odourless’ wasn’t a cruel hoax, I would be using these tablets today. Fortunately, the problem is that there doesn’t seem to have ever been any conclusive evidence that taking these tablets does any of the things attributed to them, or at least they don’t make you smarter.This is where you are supposed to say, ‘Yep, and that is because of the drug companies – there’s no money in patenting something natural and so they refuse to pay for the research’. Except, the people who do make these tablets make bucket loads of money – so why don’t they pay for the research? Simple answer, they are not interested in ‘proof’, they are only interested in your general feelings of unease mixed with a medical sounding science-y enough sort of vague idea with the right ‘vibe’ that encourages you to buy the damn things in the first place – they don’t expect them to ‘work’, other than psychologically to let you think you have done your bit to improve your health without that ‘bit’ involving you actually eating better food or shifting your arse now and again. How sad we have become when we actually seem to believe that all cures come in pills.This bit of the book, the bit on fish oils and how the company that produced them gave out millions of the damn things in a study (well, not really a study) to see if they would make high school students smarter, is perhaps the most disturbing part of what had been up to this point a quite disturbing enough kind of book to be getting on with. Want to know why kids might not do so well at school? Well, then start looking at the actual diets they have, look at their social class and the stresses and strains that puts on their lives and their ability to study (you know, like not enough food in their stomach, no where quiet to do homework, constant humiliation because they can’t afford pens, paper, uniform, excursions, sports fees) before you give them some crap pill as a cure-all. As is pointed out here, the pills given to these students would have cost more than the school lunches they got.The other things this book will help you understand are, in no particular order – the Hawthorn Effect, the Placebo Effect, why you shouldn’t listen to someone who gives you statistics that are based on percentages, rather than in actual numbers in the population, why your kid needs their MMR jabs – just frigging do it - and how to know if something about medicine is probably bollocks – HINT: if a journalist is telling you and it sounds exaggerated, it probably is and you should probably ignore what they are saying. In fact, one of the best cures to most social ills would probably involve banning journalists from, well, just about everything. Unfortunately, it seems that journalists main qualification in life is that they can write rather convincingly about things they know next to nothing about – how we have not descended into utter oblivion already is one of the mysteries of modern living and one that is still open to speculation. That rational people constantly predict the end is nigh isn’t surprising, that we haven’t all drowned in a sea of pomegranate juice is what is surprising.Like I said at the start – you need this book. Not least so that when you decide you are going to start eating berries with names you can’t even pronounce it won’t just be because Oprah has them on her superfoods list, but because they taste nicer than raspberries – which is basically the only reason one should eat just about anything."}, {"userName": "Mohammed-Makram", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/15385951-mohammed-makram", "userReview": "يا ناس يا عسلالفنكوش وصل1- حوار من فيلم واحده بواحده الشهير بالفنكوشمره اخترعت كريم للشعر. أعظم كريم للشعر ظهر لحد دلوقتى.تفتكر حد اشتراه؟ أبدا.لكن لما قولنا ان فيه مادة سرية رقمها الكودى 742212 الكل اشتروه زى المجانينعارف تطلع ايه 742212 دى؟نمرة تليفونى القديمة.رابط المقطعhttps://youtu.be/HF_xkUnF4tc2- يقول فولتير ان مهمة الطبيب هى تسلية المريض الى أن تتكفل الطبيعة بشفائه من مرضه.3 – إذا قرأت رواية شرف للعبقرى صنع الله ابراهيم فأنت بالطبع تتذكر قصة الدكتور رمزى الذى يبدو أنه مؤلف هذا الكتاب او على الأقل هى قصة شركات الأدوية التى تتكرر بحذافيرها بكرة و عشيا4- لقطتنا الأخيرة هى لأمى التى ترسلنى لإحضار أوقية من الفازلين المرطب ليدى التى تجف خلال فصل الشتاءكان هذا فى منتصف الثمانينات تقريبا و كانت أوقية الفازلين الطبى بنصف جنيه مصرى لا غير تأتيك فى ورقة من المشمع الملفوف يدويا.احتكرت شركات الأدوية الأن كل شىء ابتداء من هذا الفازلين الى المكملات الغذائية الى علاجات السرطان الوهمية الى التطعيمات الى الأمراض المنقرضة التى تعيد احيائها معمليا و بعثها من جديد و معها الأمصال الواقية بمليارات الدولارات.بالطبع لا تعمل شركات الأدوية بمفردها فى تجارة قوامها سبعمائة مليار دولار سنويا سنة 2008 حسب الكتابو لكن يعمل معها جيش جرار من الاطباء و مندوبى مبيعات الأدوية وظيفتهم تجميل الغش و تحويل النقود من جيوب المرضى الى شركاتهم بدون منتج حقيقى او جعلك تتخيل ان منتجهم المسعر بمائة ضعف من ثمنه الحقيقى أفضل من المنتج المحلى الذى به نفس المادة الفعالة و تدعمه الدولة ان بقى هناك ثمة دول أمام مافيا الدواء العالمى.ليس هذا و حسب بل كذلك مراكز أبحاث تنفق عليها شركات الأدوية و تمنعها من تبنى أى ابحاث لا تخدم سياستها الربحية مهما كان ذلك مفيدا و مهما للبشرية و مراكز أبحاث أخرى وظيفتها الوحيدة دفع الشكوك و درء الشبهات عن أى تقرير تفضح هذا الزيف و تحاول محاربته.و أخيرا و ليس أخرا ألة اعلامية جبارة تقوم بالدعاية و الدعاية المضادة و الدفاع و التسويق و الترويج و اثارة المخاوف و بعث الطمأنينة و كل شىء بحسابه و فى دوره المحدد تماما.و لم يتبق الا أنتفلتقرأ و لتحاول أن تفهم كيف يتلاعبون بنا لعلنا نستطيع مواجهة أكبر الرابحين من رجال الأعمال المدنيين بعد نشاطى التمويل و السياحة.فى نهاية هذه المراجعة لا أملك الا أن أقدم التحية للرجل الوحيد فى العالم الذى يستطيع أن يأخذ الإيدز من المريض و يعطيه له صباع كفته يتغذى عليه"}, {"userName": "Petra X", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "10-star book Edit - I have edited the review as the book is now available in the US. Truly a worthwhile read, one up for us against big Pharma!Until recently this book was not available in the US as books that attack big Pharma, alternative medicine gurus (especially the tv variety) and sacred cows like the MMR-Autism myth get sued just to stop publication even if there is no hope of winning the suit. This is an important book and illuminates the part the media plays in the dissemination of information - truths, half-truths and outright (but very profitable) lies in the medical, health and nutrition fields and why we are taken in. Why the truth is both deliberately and in a very cavalier manner hidden from us by all that stand to make a buck, even peripherally like some columnist for a news rag. It also explains, after a fashion, the still not properly understood placebo effect and why therapies that can have no possible physical effects whatsoever, particularly homeopathy with its dilution of the active ingredient to the nth degree, still work! We are amazing! The book is too."}, {"userName": "David", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/155663-david", "userReview": "This is a marvelous book about people getting science--mostly medical and nutritional science--really really wrong. I was struck by an amazing coincidence from the very first page. Just two weeks before I read this book, a friend described to me the foot bath that he had undergone, exactly as described in the book Bad Science. He is scientifically oriented, so he was just flabbergasted when the procedure left a brown sludge in the foot bath, but the treatment removed all the pain in his knees from some injury for a couple of weeks. He had no idea how the treatment \"worked\". Very likely, the placebo effect was working.Dr. Ben Goldacre is a psychiatrist, and a weekly columnist in The Guardian. He describes many techniques for spotting \"bad science\". He traces the history of all sorts of wild, so-called \"science-based\" gimmicks, like \"Brain Gym\", homeopathy, anti-oxidants and nutritionists. Goldacre analyzes why people like to believe in stupid things. Goldacre does not beat around the bush--he calls a spade a spade. He calls the pharmaceutical industry \"evil\". He describes dozens of subtle, hard-to-catch statistical gimmicks that are frequently used to justify licensing pharmaceutical drugs. I just loved the quote by Richard Feynman: You know, the most amazing thing happened to me tonight. I was coming here, on the way to the lecture, and I came in throught the parking lot. And you won't believe what happened. I saw a car with the license plate ARW 157. Can you imagine? Of all the millions of license plates in the state, what was the chance that I would see that particular one tonight? Amazing... Goldacre traces the history of the anti-vaccine movement, starting with paper written by Dr. Anthony Wakefield on the relationship between the MMR vaccine (Measles, Mumps, Rubella) and autism in children. It was published in The Lancet in 1998. Wakefield immediately earned about $70,000 for his research, by lawyers who were suing on behalf of parents of autistic children. Eventually he was to receive ten times that much from a legal aid fund. While the paper was truly bad, Goldacre finds most of the fault in the anti-MMR scare not in the paper itself, but in the media frenzy that followed it. The media picked up the story and uncritically pushed the story to the public. Goldacre writes, \"... bullshit has become an extremely important public health issue, ...\" The media fail science spectacularly. While newspapers have specialized health and science correspondents who understand science, but \"editors will always--cynically--sideline those people and give stupid stories to generalists, for the simple reason that they want stupid stories. Science is beyond their intellectual horizon, so they assume you can just make it up anyway.\"This book is definitely eye-opening. It is well written, engaging, humorous at times, but at the same time completely serious. And, after reading this book, you will be in a far better position to objectively evaluate the quality of medical research. Highly recommended!"}, {"userName": "Becky", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "This book is both fascinating and frustrating, and illustrates that the only way to get the real info on anything is to be a scientist. Data scientist, research scientist, medical scientist, science scientist, mad scientist... But the good news is that one doesn't need to be a PROFESSIONAL scientist in order to get to the truth of an issue, but one just has to have the kind of critical thinking that a good scientist applies. After all 87.3% of people know that 77% of statistics can be made to show anything at all, and 31% of statistics are made up on the spot. It's a real problem, because 68% of all people believe 54% of all statistics they encounter, and question only 1.8% of them. And those only because they are less than 45% in agreement with their pre-determined position on the topic. So, what all that means is that you should dust off your bullshit detector. I know that I've had to pull mine out of storage. (There were birds nesting in it. I've relocated them to a lovely tree in my back yard. They're settling in nicely. ) There is just so much conflicting information out there that it can be hard to know what is real and what isn't, and this book seeks to help you educate yourself on how to find out. And it takes work. You have to be willing to dig for info, and not just fall into line with the first scare-tactic headline you read. You have to be diligent in not only doing your own research but being analytical enough to make sense of it, and open minded enough to accept it as the truth, even if it's not the answer you wanted. You would think that so much of what is related in this book would be common sense, but it is kinda scary how much stock people put in a sensational headline, or a passionate celebrity with anecdotes to spare. I totally include myself in that, and I don't fault anyone for trying to raise awareness to an issue that they feel passionately about. But manipulating facts to make a claim, or having no facts at all and just going by what sounds plausible or \"feels\" right is not OK, especially if it means that society is put at risk because of a fear of vaccinations. For example. This book is kind of a hybrid of The Panic Virus: A True Story of Medicine, Science, and Fear and Idiot America: How Stupidity Became a Virtue in the Land of the Free (both of which I highly recommend), but with more scientific method... and bringing more awareness to the bullshit method. And it was great. Enlightening and eye-opening, but there's a flaw in Goldacre's reasoning about some things, and it bothered me just enough to drop a star. Throughout this book, Goldacre talks about manipulation possibilities for clinical trials, ways that they (drug companies, etc) can make the product they are testing (and spending many millions of dollars to develop) look as beneficial as possible. This runs the gamut from testing them against placebo, or inaccurate doses of a competitor's drug, so that theirs comes out performing better, or the competitor's drug causes side-effects from the inaccurate dosage, or running a trial for longer than originally designed (until the data bears out better results) or shorter (so that the results don't start going downhill after a good start), or selectively choosing people more likely to respond well, or not randomizing, or not blinding the study, or moving the goal posts (drug was developed as a pain reliever, but didn't perform well for that purpose, but people are dropping weight like a bad habit, so now they're calling it a diet pill), or just not publishing (or purposefully publishing the study in an obscure place), etc. All these methods of manipulating the results or making it hard for people to find out what was actually in the study, and yet Goldacre still puts a lot of credence and trust in published studies in general. While I, the cynical one, am sitting here thinking: Why do you assume that they aren't lying? Why do you assume that they are going to publish that they gave the improper dosage of a competitor's drug in the trials? They have a stake in ensuring that their drug comes out on top, and it's clear that manipulation happens, so why would anyone think that it would then be published in their report? Is it not likely, if they lack ethics enough to manipulate the data in the trial itself, to then report that they did not? I just felt that assuming that reports are going to accurately reflect EXACTLY what was tested is a stretch, especially when we're talking about people and companies with a financial stake in marketing their product, and questionable, shady ethics. Anyway... aside from that one thing, this book was great. I really enjoyed it, and felt that it was the right mix of serious and humor, as well as the right mix of science and narrative. I definitely recommend this. The audiobook is pretty great as well. I liked the reader a lot."}, {"userName": "Paul Bryant", "userReviewDate": "Jan 02, 2010", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Beads that sparkle like a prism, snake oil for your rheumatism, Calico and gingham for the girls.Cast your eye on Dr. Borer’s patent-pending hair restorer,guaranteed to grow hair on a billiard ballHands up who doesn't recognise which gender-bending musical those portentous words emanate from ?Okay, it was Calamity Jane. You knew that, I know. Can't just be me whose mind is stuffed with the lyrical junk of six decades.Onward to the review.Ben Goodacre is the sworn foe of all modern-day medical mountebanks, and there's a whole internet full of those around, more than you can shake a juju stick at, so he has a lot to do and he bounds out of bed each morning and rattles off his Guardian column about – let’s say – homeopathy and just how REALLY INSANE it is – then jumps in his E-Type Jag and straight to the airport where a plane is waiting to take him to Minnesota where the local tv station in St Paul is about to interview Dr Cleothilde Barnfather who is recommending everyone to take fishoil pills every day, but only particular ones enriched with antioxidants and infused with chlorophyll, yeah that’s right, only his own brand Barnfather Live Forever Fish Oil (tag line “they’re easy to swallow because they come from a fish”) – now then, brave Ben is about to reveal the author of the bestselling Fish Oil Will Enable You To Outlive Your Great-Grandchildren as none other than... (gasp) Randy Merckenschlitzfer, failed used tumbledrier salesman and no doctor at all – his PHD was obtained through the post from some institution in Albuquerque which frankly no one has heard of including the janitor of the block of flats in which it is supposed to reside (Ben has checked) - hah! Take that! And that! Where’s your double-blind randomised clinical trial for your fishoil pills “Doctor Barnfather”, or should we say Randy? Oh, there never was one? How not surprised I am! Viewers, this guy is a FAKE. Naturally, everyone goes on buying the fishoil pills and Randy buys another swimming pool, this one made in the shape of a haddock, and Ben Goodacre writes some even angrier columns about it and feels marginally better, just as Randy’s customers do.Knockabout aside, this book exposes the shoddy thinking and egregious lust for non-existent breakthroughs, miracle cures and health horror stories which bedevil the British press and which are perpetrated by humanities graduates who do not understand scientific method or basic maths. Two are given the full treatment (the MRSA hospital superbug non-epidemic and the MMR-vaccine-causes-autism hoax) and many other rubbish claims are debated in a breezy manner which – alas – all sounds like preaching to the converted to me, and also scores uncomfortably high on the science-nerdometer for this English/Theology graduate.There are graphs. You have been warned."}, {"userName": "Lena", "userReviewDate": "Jan 15, 2011", "userURL": "http://www.goodreads.com/user/show/220791-lena", "userReview": "Ben Goldacre is a man with a mission. A UK doctor who writes a column for the Guardian, he'd like it very much if people would stop making their health decisions on the basis of crap science.Unfortunately, there is an awful lot of crap science out there. So Goldacre does his best to educate people about how to tell the difference between the good, the bad, and the ugly.Along the way, he entertainingly uses the usual suspects of homeopathy and foot detox baths to illustrate his points. But he also takes on something called \"Brain Gym,\" a UK school program supposedly designed to improve learning, the rather outlandish claims of cosmetic cream manufactures, famous (in the UK at least) TV \"nutritionists\" pushing their own lines of fancy supplements, and the entire pharmaceutical industry.In the process, he strives to help readers understand why so much of the science reported in the media is unreliable. His section on media distortions of science was among the most valuable parts of the book. He highlights the malignant tendency of the media to publish sensationalistic scare stories based on only the thinnest of evidence. One of his hints to keep in mind when reading a new story - if a doctor announces an incredible new breakthrough via press release, rather than peer reviewed journal, be very, very skeptical.The book was written in 2008, after Andrew Wakefield's paper linking the MMR vaccine to autism had already been withdrawn, but before he was found guilty of the outright fraud he actually perpetuated. Goldacre spends a section reviewing this scare in detail, pointing out that the media's later vilification of Wakefield would never have been necessary if anyone with a basic understanding of science had written the story to begin with - the original paper was so flimsy it didn't warrant the attention it got even if it hadn't turned out to be fraudulent.It's Goldacre's discussion of the MRSA scare in the UK that is even more disturbing, however, as he demonstrates how this scare was essentially fabricated by a media hungry for sensational news. I'm not sure I agree with him that this is the fault of humanities-trained journalists who think science is subjective and therefore feel justified in giving equal time to totally unqualified \"experts,\" but there's no question the media's habit of reporting shaky sensational findings and completely ignoring follow up studies showing the original stories were in error is seriously hazardous to our health.It was also interesting to hear his theory that part of the reason that pharmaceutical companies are prone to sensationalizing mediocre results is because the low-hanging medical fruit has already been harvested. During the middle part of the century, phenomenal life-saving breakthroughs were happening all the time. Since the mid-'70's, however, very few of these have occurred, which Goldacre suggests is the reason why Pharma has turned to \"medicalizing\" common complaints and pumping up iffy research findings in effort to preserve profits.His chapter on HIV denialism in South Africa was also very enlightening. He explains the cultural and political factors that combined with bad science to result in a devastating governmental policy of recommending beetroot to AIDS patients instead of antiretroviral drugs.Goldacre has real faith in the ability of non-scientists to understand the basics of what makes good science if they have the motivation to do so. But the overwhelming abundance of crap science in all areas of our lives has resulted in what he calls \"corrosive intellectual side-effects.\" While it may be harmless in the short term for people to indulge in a little homeopathy every now and again, the damage and death from things like declining vaccination rates and HIV denialism is all too real. This book offers a powerful inoculation against that disease."}, {"userName": "Red Panda", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "This book has some important lessons to impart and, as loathe as I am to tell anybody what they should or shouldn't read, this is one of the few books I wish could be made compulsory reading.Goldacre writes with passion about subjects that are clearly important to him and yet still manages to write conversationally and with good humour. Parts of this book made me laugh out loud and parts of this book, sometimes less than a page later, made me both angry and desperately sad. One chapter (on the MRSA debacle in UK hospitals) actually brought tears to my eyes.Lessons this book illustrates extremely well:1. Correlation does not equal causation.2. 'Anecdotal evidence' barely qualifies as evidence at all.3. Research must be performed correctly, with a control group and a large enough trial group for the study to be statistically significant. Oh, and without a pre-existing bias, obviously.4. Evidence should be checkable and from a reliable source. If medical 'research' has only been published in a colour Sunday supplement in a tabloid newspaper, it's most likely not worth the paper it's written on.There are many other lessons to take away from this book but if I add more I run the risk of just paraphrasing the entire book and the author has explained it all a hundred times better than I could. Just read the book. I promise you you will learn something and be entertained along the way."}, {"userName": "Tania Kliphuis", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/2858613-tania-kliphuis", "userReview": "I wish that I could give this book 4 stars. I tell you what, I give the idea for this book 4 stars. Unfortunately though, the execution wasn't so fantastic. That said, I do think that anyone interested in the way that the media are able to influence public opinion about serious matters, and in the recent explosion of health-related reality TV should give it a read. It is an interesting book if you can get over the shoddy editing and Goldacres' pomp and ceremony.Goldacre insists that this should be \"an entertaining read\" but it just falls short. Whoever edited it allows Goldacre to be all over the page, which is unnecessarily distracting. Certain catchprases are also overused, which again makes me wonder who the editor was. That said, he probably fought his publisher tooth-and-nail to ensure that his precious book didn't lose its \"essence\" or something. For all of his insistence that \"Humanities graduates\" (the journalists) don't have the knowledge and wherewithal to write scientific news reports, Goldacre and his fancy-pants BSc perhaps should have hired one to help him write an entertaining non-fiction book.Which brings me to my final gripe about the book. Goldacre has a condescending attitude towards anyone who does not have a BSc. In fact, people who do have a BSc but have not had the opportunities to find a career in which to use it also get an irritating \"oh shame\" moment from him. Actually, Ben Goldacre is just condescending. This is a great pity because these are the very audience he has written this \"entertaining read\" for. So, yes, it's ok. It will certainly put you off homeopathy."}, {"userName": "Jim", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "I knew there was a lot of bad science & horrible media coverage out there, but I had no idea just how bad. This isn't a book just about that, though. While Goldacre does give some very good examples, he spends a lot of time teaching the reader how to spot bad science specifically in the field of medicine. I knew a lot of it, but the only statistics class I took was quite a while ago. The refresher was needed.As Goldacre so aptly shows, numbers can easily lie, especially when blasted on headlines & interpreted badly to sell the news through sensationalism. \"Deaths rise by 50%\" sounds like a major crisis. It might not be a lie, but when the reality is that deaths are up from 4 in 10,000 to 6, I feel lied to. That's tough on the people involved, but not statistically significant.He takes both homeopathy & big pharma to task, shows where & how both lie. He also shows where they don't. Homeopathy might not physically be any good & is full of hucksters (He says they're not liars, just bullshit artists.) but he goes into some detail about the healing powers of our minds. The Placebo Effect is a lot more involved than I had thought. It explains a lot about all sorts of faith healing.He spends quite a bit of time showing the media irresponsibility when they cause public panics especially in the case of the MMR vaccine. That began back in the mid 90's & the effects are still haunting us. While the media reported the sensational & absolutely fraudulent claims linking MMR vaccine & autism, they didn't devote any effort to correcting the story. That means we still have idiot actors telling people about the imaginary evils of vaccination & outbreaks of debilitating & deadly diseases that were almost wiped out before the current insanity.All in all, a great read. I recommend it to everyone, even if you don't agree with his take on everything. The tools he teaches are needed in today's complex world. If you want to know more, check out his website:http://www.badscience.net/"}, {"userName": "Mohamed al-Jamri", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/20245481-mohamed-al-jamri", "userReview": "يحظى العلم بمكانة محترمة في المجتمع، ويثق به غالبية الناس. لذلك ظهرت فئات من الدجّالين ينصبون على الناس بإسم العلم، فكيف نستطيع التمييز بين العلم الحقيقي والزائف؟ يخبرنا الدكتور والصحفي بن جولديكر في كتابه «العلم الزائف» أن الإجابة على هذا السؤال ليست عن طريق حفظ قائمة طويلة من العلوم الزائفة، بل عن طريق تعلم أساسيات العلم.غياب التعليم عن «الطب المسند بالدليل» وحصولنا على معظم معلوماتنا من أفراد غير مؤهلين لا يفقهون في العلم، أدى إلى حالة من الخلط والتضليل. في هذا الكتاب يتطرق جولديكر إلى مواضيع كثيرة من «الديتوكس» ومواد التجميل وتأثير الدواء الوهمي وخبراء التغذية وصولاً إلى الشركات المصنّعة للأدوية ودور الصحافة. يحلل الكاتب هذه المواضيع وأكثر مستخدماً أسلوباً لا يخلو من الفكاهة ليفضح أسرار الدجّالين والمضلّلين باختلاف أنواعهم ويشرح من خلال هذه المواضيع منهجية العلم، فالمعرفة بمنهجية «العلم الحقيقي» تؤهلنا لكشف «العلم الزائف» بأنفسنا.يعتقد كثير من الناس أن العلم ما هو إلا سلطة معرفية تعطينا الحقائق الجاهزة، لذلك يبدأ الكاتب بشرح المنهجية العلمية عن طريق تجربة علمية بسيطة على ما يعرف بمنتجات «الديتوكس». تدّعي هذه الصناعة أن وضع الرجل في الماء لمدة معينة سيخرج منها السموم عن طريق تأثير منتجهم، وكدليل على ذلك سيتغير لون الماء إلى البني بعد خروج السموم. فهل تغيّر لون الماء هو بسبب خروج السموم من الجسم أم لسبب آخر؟ هنّا يقدمنا الكاتب لما يعرف بإسم «دراسة الحالات والشواهد» فلاختبار صحة هذا الإدعاء يمكننا عدم وضع أرجلنا في الماء ومراقبته، فإن تحول إلى اللون البني فهذا يعني أن سبب تغيّر اللون لا يعود إلى خروج السموم بل إلى سبب آخر، وفي الحقيقة هذا ما يحدث. يذكر الكاتب كذلك عدداً من المواضيع المرتبطة بالطب البديل والدراسات العلمية التي خضعت لها، وينتقد تغطية الصحافة المضللة للموضوع. إن الأطباء لا يرفضون العلاجات البديلة هكذا دون أخذها بالاعتبار، بل بعد دراستها والوصول إلى عدم جدواها.ينتقل الكاتب بعد ذلك إلى ما يعرف بـ«أنشطة رياضة العقل» في المدارس البريطانية وهي ممارسات رياضية من المفترض أن تنشّط عمل العقل، ولكنها تتضمن أمور غريبة مثل إبقاء الماء في الفم لمدة معيّنة لكي «يمتصه الدماغ مباشرة». إن هذه الأنشطة وإن كانت مفيدة كنوع بسيط من الرياضة إلا أنها تدمّر منطق الأطفال وفهمهم للعلم وتزرع بذرة لاستغلالهم طيلة العمر، خاصة أنها تقدَّم لهم بمصطلحات عملية ومن قبل نفس الأستاذ الذي يشرح لهم العلوم الصحيحة. إن أكبر خطر لهذا الموضوع حسب الكاتب هو أنه يجعل الناس إتكاليّين يشعرون بالعجز عن طريق تحويل العلم لموضوع غامض غير قابل للفهم. نفس النقد يوجّه لكريمات الترطيب التي لا يختلف الرخيص منها عن غالي الثمن في شيء سوى طريقة التسويق. إنها لا تحتوي على مكونات سحرية والفيتامينات لا تعمل إلا بتركيزات عالية جداً لا تتوفر في هذه المستحضرات.في الفصلين الرابع والخامس، يتطرّق الكاتب للمعلاجة المثلية «الهوميوباثي» وتأثير الدواء الوهمي «البلاسيبو». المعالجة المثلية هي إحدى أبرز أنواع العلاجات البديلة وتقوم فكرتها على أن المواد السامة إذا تم تناولها بتركيز منخفض في الماء فإنها تؤدي للشفاء. بعد استعراض الأسباب النظرية التي تجعل هذه الممارسة غير منطقية يشرح الكاتب كيفية عمل دراسات علمية محكمة، ويطرح فكرة تأثير الدواء الوهمي وكيف يمكن لحبة دواء لا تحتوي غير السكر أن تؤدي لبعض النتائج الإيجابية (والسلبية أيضاً) إذا تم تقديمها ضمن معتقدات وبيئة ثقافية معينة. يطرح الكاتب كذلك طرق تحليل البيانات وأهمية المراجعات المنهجية للدراسات كتلك التي تقوم بها مؤسسة كوكرن للحصول على صورة مكتملة من كل الدراسات وتجنّب الانتقاء المنحاز.أما أكبر صدمة في الكتاب فكانت تلك المتعلقة بخبراء التغذية، هؤلاء ممن يصفون الفيتامينات وحبوب زيت الأسماك ومضادات الأكسدة يستخدمون طرق ملتوية ومخادعة لاظهار أنفسهم على أنهم أطباء حقيقيون يعتمدون على الأدلة والدراسات العلمية، ولكن الحقيقة لم تكن لتكون أبعد من ذلك! يستخدم هؤلاء عدة طرق لخداع الناس، بل ويحصلون على ظهور إعلامي قوي. من ضمن خدعهم هي القيام بعرض انتقائي للدراسات العلمية واختيار تلك التي تؤيَد المنتجات التي يبيعونها فقط، بينما الممارسة العلمية الصحيحة هي الذهاب إلى المراجعات المنهجية للدراسات والتي تقوم بجمع نتائج كل الدراسات بصورة دقيقة، وعند تطبيقها على أشهر هذه المنتجات كحبوب فيتامين سي ومضادات الأكسدة ظهر عدم وجود فائدة حقيقية لهذه الفيتامينات، بل إنها قد تزيد من مخاطر الإصابة بسرطان الرئة للمدخنين.ولم يترك الكاتب شركات الأدوية الطبية بل انتقدهم بصورة كبيرة وأظهر أنهم يستخدمون تكتيكات مشابهة لتلك المستخدمة من قبل خبراء التغذية، وقد توَسع بشكل أكبر هنا وقام بتأليف كتاب خاص عن كيفية خداع هذه الشركات للأطباء تحت عنوان «Bad Pharma». وفي النهاية يركز بشكل خاص على انتقاد دور وسائل الإعلام في تضليل العامة، خصوصاً فيما يتلعق بالتطعيم الثلاثي والربط الخاطئ بينه وبين إصابة الطفل بالتوحد وكيف أدى هذا إلى تفشي الحصبة في بعد الأماكن بعد أن كانت مرضاً لا يسمع به.عندما كنت في كلية الطب، كانت إحدى المواد التي درسناها تتعلق بـ«الطب المسند بالدليل» ولم ندرك أهمية هذه المادة إلا قبل التخرج بقليل. إن هذا الكتاب يشبه هذه المادة إلى حد كبير إلا أنه مقدم بصورة جذابة وخفيفة الظل، ومدعّم بأمثلة وقصص حقيقية تبيّن أهمية كل معلومة والمخاطر الناتجة عن الإخلال بالبحث العلمي على المرضى، كما يتم ذكر الكثير من النقاط الجانبية المثيرة المتعلقة بالموضوع. لا يكتفي الكاتب بتحذيرنا من بعض الدجّالين وخدعهم فحسب، بل يعلّمنا كيف نستطيع اكتشافها بأنفسنا، لأن الدجّالين دائماً ما يطورون ويغيرون من أساليبهم. هذا الكتاب تطبيق لمقولة الفلكي الفيزيائي نيل تايسون «عندما تكون مُثقفاً و مُتعلماً علميًا، يبدو العالم من حولك مختلفاً»."}, {"userName": "Nikki ", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "\"Just as the Big Bang theory is far more interesting than the creation story in Genesis, so the story that science can tell us about the natural world is far more interesting than any fable about magic pills concocted by an alternative therapist.\" Well, no. Stories are important. They tell us what people's preoccupations are, what people want and what they're scared of. Scientifically, Goldacre's right -- but science isn't the only thing to be concerned about. I'm sure he'd think this reaction typical of an arts student who has a belief system that, wishy-washy, may or may not involve a god, and who rather defends people's right to believe whatever damn fool thing they want to as long as they don't force it upon me. That's very much Goldacre's style -- flippant, funny, but at the core you get the sense that he'd like to hit you over the head with the book to batter the concepts into you. Science Is The Only Thing. If You Can't Test It, It Isn't Real.For what he's talking about -- \"brain gym\", which I was subjected to, for example, or homeopathy -- he's totally right, but the way he talks just sets my teeth on edge. I'm quite sure we couldn't get on if we got onto questions with subjective answers. So yeah, his writing about science is good, and perfectly clear to a relative layman (I did a biology AS level, and my mother's a doctor, though), but something about his attitude just narks me.I mean. \"The people who run the media are humanities graduates with little understanding of science, who wear their ignorance as a badge of honour. Secretly, deep down, perhaps they resent the fact that they have denied themselves access to the most significant developments in the history of Western thought from the past two hundred years...\"That's a direct quote from Goldacre. And watch! I can do it too: \"The people who [write books like Bad Science] are [science graduates] with no understanding of [the important things in life], who wear their ignorance as a badge of honour. Secretly, deep down, perhaps they resent the fact that they [do not understand the power of stories, and resent their limitation of thinking that Western thought is the pinnacle of human achievement].\"Oh, and SSRIs: to be honest, I do subscribe to the theory that if they work for me, I'd rather not question it. (And they do. I haven't reacted to them in the exact way I'd been told I would: I had no side-effects, for example, and they began to work fairly quickly. Within a couple of weeks, all the major symptoms of my depression were gone, and though I wept when my grandfather died while I was on antidepressants, my feelings were in proportion to the event, unlike when my dad's mother died and I took to my bed for a week. I have not experienced any increase in anxiety, or that much trumpeted criticism that SSRIs make people want to kill themselves.) So I'm probably too biased to accept a word that Goldacre says on the subject, even forgetting the fact that a close relative has done research into antidepressants and I typed up their results! Of course it would be galling to accept that SSRIs are rubbish and I've been duped. But still, even trying to keep my own bias in mind, that doesn't sit right with me. I wonder -- has Goldacre written anything about his own biases? My humanities degree has at least taught me that no one acts without some kind of stimulation. If you're looking at post-colonialism in literature, it's probably because the theory speaks to you (in my case, because I'm Welsh and some postcolonial theory can be applied; for others it's the issue of kyriarchy, the way that all kinds of things intersect, so that racism sometimes looks and acts a bit like sexism or homophobia, and so the theory can be applied elsewhere). If you're a feminist, you can find sexism in every text you read (and I'm not saying it isn't there, or you don't experience it as there). More harmlessly, perhaps, I'm a lover of Gawain, and I can interpret any given text as sympathetic to Gawain based on the social mores of its time -- or it's a shitty book, of course.So yeah, watching Ben Goldacre froth in this book made me sort of want to know why it's so important to him. That's a bit of an ad hominem attack on his work, I suppose, but I do wonder how careful Ben Goldacre is to make sure he doesn't just find the results he's looking for, as he accuses other people of doing, or if he assumes that because he's debunking it in other people, he's immune.ETA: As I am now more than halfway through a biology degree, I'm tempted to revisit this book and see what I think now. Watch this space!"}, {"userName": "Christopher", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/14386596-christopher", "userReview": "Audiobook. The guy doing the audiobook has a ton of passion.---------------------Bad Science is an excellent book about how to approach news articles about scientific papers. He goes over what flaws to look out for in the studies themselves, as well as the common ways journalists completely screw up reporting about subjects they don't always understand. In particular, he focuses a lot on homeopathy and the MMR autism link (which doesn't actually exist), both of which he destroys. The takeaways from this book are how to identify shoddy reporting, what questions to ask about research to know if it is shoddy research, and a deep distrust of anything you're ever told. :pThe most interesting bit to me, as someone who is used to not trusting reporters' science articles, was the bit on the placebo effect. This was by no means a new concept, but the depth of it is staggering. That four sugar pills are better than two sugar pills for treating pain is insane. That red pills are better than yellow pills for treating pain is nuts. There is more, but I am wary of misquoting it, so I'll stop. Just note that the placebo effect defies every bit of good sense you have. My primary complaint about the book is the tone. It is amazing when he is preaching to the choir as he is with me, but he calls a spade a spade. He has no problem calling Big Parma evil, nor some researchers frauds (by name), nor calling some journalists incompetent. If you currently believe in homeopathy, you might find yourself insulted too much to listen. He doesn't mean to. His anger is firmly directed at greedy businesses, stupid/unethical/greedy researchers, and terrible journalism that is telling you lies as truth. But I can see how one could take his attack on homeopathy (and various other things) as attacks on themselves. They are not though, so do attempt to look past his flippant and challenging tone to what he is presenting."}, {"userName": "Simon Wood", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/22378179-simon-wood", "userReview": "HOW TO IMMUNISE YOURSELF FROM DELUSION It seems a bit gratuitous to write the 223rd review (relevant to uk amazon site) of Ben Goldacres book \"Bad Science\" but having decided that it would be more of a fault not to recognise the brilliance of his book I'll go ahead any way.The Bad Science that particularly irks Goldacre and takes up the bulk of his book is that which relates to the medical sphere. It's not that he thinks purveyors of crystal healing, homeopathy or the wannabe scientific but far from terrific \"nutritionists\" should be soundly horse whipped weekly or even fortnightly, but that he wishes they would stop pretending to be what they are not which is science. The other target of his ire is the media, the scare-mongering, the cry wolf-ers who were up to their necks in the MMR scare-mongering without understanding more than a tiny fraction of the whole story. With regard to MRSA he gob-smacked this cynical reader with the information that the \"scientist\" who was coming up with the +ve results for the newspapers was working from his garden shed, done up with pieces of kitchen fittings and sub-standard scientific apparatus: The Walter Mitty of the world of micro-biology no less!He's also interesting, though it is by no means a central part of the book, on the attractions of the quick (quack?) fixes to deal with complex problems within society. The account of the Teeside Fish oil fiasco is fairly disturbing, as is the bizarre (and trademarked) exercises that are apparently carried out in hundreds of schools across the land. Hopefully this aspect of his writings will be explored further in a later book.Totally recommended, Goldacre is an effortlessly witty writer and by some slight of hand. . . sorry . . . by rational explanation he makes statistics, especially those relevant to the study of the efficacy of medical treatments, entirely comprehensible. 100% recommended. A first step to immunising yourself from irrational medical nostrums, saving yourself a pile of money as well as having a well earned laugh."}, {"userName": "Mairita (Marii grāmatplaukts)", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/8351706-mairita-marii-gr-matplaukts", "userReview": "Vērtīga (ne vienmēr viegli lasāma) lasāmviela ikvienam par muļķībām, ko mums baro pašpasludināti uztura speciālisti, krūmu dakteri, intuīcijā balstītu pierādījumu piekritēji, negodīgi farmācijas uzņēmumi un plašsaziņas līdzekļi. Īsumā - viss ir slikti, bet pēc šīs grāmatas vismaz spēsiet noteikt, kāpēc ir slikti.Pilnā atsauksme https://gramatas.wordpress.com/2016/0..."}, {"userName": "Matt", "userReviewDate": "Mar 16, 2010", "userURL": "http://www.goodreads.com/user/show/3445885-matt", "userReview": "This excellent book written by the intelligent and entertaining doctor and health communicator Ben Goldacre is a must read for anyone who has an opinion about any health issue you've seen, heard or read about in the media. Although written in the context of the UK, its lessons and advice apply to anyone anywhere.Covering everything from CAM (including chiropractic and homeopathy) to vaccinations to self-proclaimed \"TV professors\" (like Gillian McKeith) to the pros & cons of the pharmaceutical industry, the author shows the reader both sides of the story, shows the evidence, and explains the problems. But these are not just his proclamations on the issues: he points to scientific papers, additional resources, metastudies, and sites like the brilliant Cochrane Collaboration. While some of it is about correcting the egregious falsehoods proclaimed by journalists and snake oil peddlers, it is mostly about arming the reader with the tools to determine for yourself whether a topic or a position is as described or worth further investigation. Critical thinking, logic and skepticism... skills that everyone needs, but most are lacking.Everyone should read this book.Kindle note: I bought the Amazon Kindle version of this book. While it has all the expected footnotes and endnotes linked nicely, the text makes frequent references to graphs, tables, diagrams and images that do not appear in the Kindle version. This is not a shortcoming of the Kindle or ebook format (I've converted a number of ebooks I already own into Kindle format, complete with images, graphs, etc) -- this is simply laziness on the part of the publisher. You might want to consider this before buying any Kindle ebook that may contain non-text items.Update: This ebook has been updated since my initial review in 2010 and the previously mentioned Kindle formatting shortcomings have been resolved."}, {"userName": "Nancy", "userReviewDate": "Oct 25, 2011", "userURL": "http://www.goodreads.com/user/show/803323-nancy", "userReview": "I've read about most of the topics covered in this book elsewhere, but Goldacre does a great job of teaching us to spot the failures of Big Pharma, alternative medicine and journalism. He does this in an entertaining way using ripped-from-the-headlines stories.Last week I was in the mood to read some non-fiction so went to the shelves of one of my goodreads friends and made a list of her 5 star health and science books. Armed with that,I found several of those books at the library and have been happily reading ever since. Goodreads is a wonderful way to discover good books published years ago. Unlike a just published book that you have to wait months for at the library, good books published 2 or 10 or 76 years don't have a waiting list (see  Rats Lice and History: Being a Study in Biography Which After Twelve Preliminary Chapters Indispensable for the Preparation of the Lay Reader Deals With the Life History of Typhus Fever  for another good one I found this way .)"}, {"userName": "Ken Robert", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/2649186-ken-robert", "userReview": "No one is spared in this delightfully infuriating tour of the myriad ways we can be duped by bad advice on health and medicine.The author, Dr. Ben Goldacre, skewers alternative medicine quack jobs, data dithering drug researchers, scare mongering journalists, pinheaded politicians, and simple minded celebrities who would all gleefully sell us horse manure if we were willing to buy it.And he does it with a flair for making the confusing understandable as well as entertaining.Read this book and you'll walk away with a better defense against poor reasoning, terrible math, and your own mind's tendency to play tricks on you, or, in other words, bad science."}, {"userName": "Dekks", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/7979448-dekks", "userReview": "Excellent book that I think everyone should read, I don't consider myself to be a particular naive person, and I'm not a conspiracy nut whatsoever, but at the same time am under no illusions about Big Pharma. That said, it was a real eye opener to see just how biased and flawed some of the medical studies were and that very reputable medical journals regularly publish findings and studies that should be very suspect to the professional scientist.The only problem with this book, and why I only gave it three stars is that the author tends to get a little bogged down in the technical details, and so sometimes he can stray between aiming as the layman (such as I would consider myself) and someone in a medical/scientific to whom the more complex aspects of a trial could be very interesting, but turned into bit of a science textbook for me.I also think he spent a little too much time going into the charlatan fields like Homeopathy etc, one chapter on pseudo science would of been enough to get his message across without rehashing the same argument over and over, which got a little laborious, even if I do agree with him.Some editing could turn this from a good book into a excellent one, and one final point is that while the book is humourous in places, it isn't really that funny, which isn't really a valid criticism as I don't think it particularly is trying to be, but a lot of reviews and product pages list it as a laugh out loud expose of what's wrong with science reporting which might mislead some readers."}, {"userName": "seryal olcay", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/41680784-seryal-olcay", "userReview": "It took me long to finish it but OMG what a wonderful book for those who are interested in real scientific evidence based facts to charlatans who believes in their imagination or stupid nutritionists, homeopathists. I had a lot inspriration from the book and enjoyed the reading very much.I'd like to quote; 'The true cost of sth , as the Economist says, 'is what you give up to get it.So much loss of money, health resources on to get rid of superstitious accusations, belief , bullshitters.The anticampaginers to vaccination programme was the most striking one for me and the omega pills , how misused they were was also incredible."}, {"userName": "Sibilla", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/14031508-sibilla", "userReview": "Viss vienmēr ir sarežģītāk nekā izskatās un vienkāršu atbilžu nav.Vispār ļoti laba grāmata, kas veicina kritisko domāšanu."}, {"userName": "Jafar", "userReviewDate": "May 09, 2010", "userURL": "http://www.goodreads.com/user/show/26188-jafar", "userReview": "This is the kind of the book that I would make everyone read when I get to rule the world. There’s so much nonsense going around these days in the name of science and research that a lot of people would be quite shocked with this book. Examples are endless. Detox treatment? Just a big hoax. Homeopathy? Even a bigger hoax. All those fancy and expensive cosmetic products that supposedly do magic to your skin? Just a waste of money. Vitamin C prevents and treats cold? Not really. Antioxidants slow down aging? No – more of it may actually be even bad for you. You think fish-oil pills make your children smarter? Let’s just hope they haven’t inherited your science genes. How about all those vitamin and mineral pills and food supplement products? Useless and waste of money if your diet is half decent. Does everything really either cause cancer or cure it? As impossible as it may seem to believe given what the media tell us every day, the answer is no.Goldacre does more than debunk these popular myths. He digs deeper into why bad science gets disseminated and why the public believes it. A lot of it has to do with simple commercial self-interest. Take the case of \"nutritionists,\" for example. Their biggest achievement is brainwashing the entire population into believing that what they say is based on scientific research. They may occasionally say something sensible, like: eat more fruits and vegetables, but that doesn’t make them any money. To push the pills and the products on people, they resort to science-y-sounding misinformation. Despite what most think, calling yourself a nutritionist does not require any scientific qualifications. Some of them may have science degrees, but these people are not scientists and what they say is not backed by real scientific research. Then there are the overworked and/or under-qualified journalists who don’t know how to read and interpret scientific papers. Statistics is not an easy subject, and there’s always the pressure to come up with something catchy, better yet alarming. So they get it all wrong when they supposedly transfer knowledge from the experts to the laymen. There many other social, cultural, and psychological factors discussed in the book that are contributing to the prevalent presentation of mumbo-jumbo as science.Unfortunately, bad science doesn’t only result in ridiculous but harmless situations like a Hollywood celebrity going for a laughable detox ritual or Tony and Cherie Blair taking their children to a New Age healer for dowsing with crystal pendulums. Bad science can cost many, many lives. The handling of the AIDS crisis in Africa is only one such sad example."}, {"userName": "Deirdre", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/11513-deirdre", "userReview": "An extension of his blog, this is a collection of basically rants about how science and statistics are abused by a variety of people. It also looks at faulty science behind some nutritionists and some of their dodgy \"credentials\". His emphasis is on making people question \"facts\" and double check the evidence.However, people don't have the time for a lot of this, and when you're offered a glimmer of hope people tend to take it. The placebo effect is explored here and he does admit that it works and works well if people load it with belief, so maybe examining everything doesn't always work as well as it might.It's a book worth reading, if only to read why he is so virulently opposed to some people's \"science\", I must admit to having read some of the books involved and having some reservations but it wasn't until I actually read this that I truly realised what was bothering me about them. This is part of the problem, I do have a background in Science but I really didn't have enough energy or time to really exhaustively research some of the \"facts\" given to me by some of these writers. The fact that there are people like Ben Goldacre out there help me sort the truth from the fiction."}, {"userName": "عمر الحمادي", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/8663167", "userReview": "هذا الكتاب يجب أن يصنف من ضمن أعظم كتب العصر الحديث في نقد العلم الزائف بأدوات العلم الصحيح، فلقد استفاد الطبيب بن جولدكير من خلفيته الطبية والتجريبية في قراءة الأبحاث لكي يقدم للناس الحقيقة في قالب الأسطورة، وعند انتهائك من قراءة الكتاب ستعرف كيف تقرأ إعلانات الصحف والقنوات المرئية للمنتجات الدوائية بكل حرفية !تطرق المؤلف للكثير من الادعاءات مثل ارتباط التطعيم الثلاثي بمرض التوحد و وجود مرض الإيدز الذي أنكره رئيس جنوب أفريقيا و ادعاءات خبراء التغذية في إطالة الحياة.يستطيع أي متمكن من كتابة مثل هذا الكتاب لكن باستخدام أمثلة من بعض المتلحفين بلحاف الدين والذين استخدموا الدجل الديني لتمرير أفكارهم/تجارتهم بين الناس وباسم الله !"}, {"userName": "Jan-Maat", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "A readable romp through the misuse and abuse of health related science in the media. The analysis of homeopathy, mrs McKeith and the brain gym seemed like shooting fish in a barrel, but then I remember that people make a lot of money marketing that kind of nonsense."}, {"userName": "Ints", "userReviewDate": "Sep 29, 2012", "userURL": "http://www.goodreads.com/user/show/8501383-ints", "userReview": "Pērkot šo grāmatu īpašu izpēti neveicu, šķita, ka tā būs kārtējā par fiziku un astronomiju. Tādēļ jāatzīst, biju nedaudz pārsteigts, ka gaidītās fizikas un astronomijas vietā ieraudzīju medicīnu. Ja tā no rīta nebūtu paņemta līdzi lasīšanai, tad diez tuvākajā laikā viņai būtu bijušas izredzes tapt izlasītai.Autors „slikto zinātni” apskata no mediķa skatu punkta. Pamatota kritika tiek veltīta homeopātiem, pārtikas piedevu tirgotājiem, brīnumzāļu pārdevējiem, lielo farmācijas kompāniju mārketinga stratēģijām, viltotai statistikai un pāri visam nekompetentiem un nespeciālistiem žurnālistiem, kas, neiebraukuši problēmas būtībā, baida parasto cilvēku.Iesākumā uz autoru skatījos ar zināmu skepsi, ja jau cilvēkam patīk kritizēt visus, tad, iespējams, tā var būt arī neliela psihiska novirze. Tomēr lasīšanas gaitā sapratu, ka tik traki nemaz nav. Autors, izsakot kritiku, neskopojas ar savu loģisko izvedumu izklāstu, kā īstam profesionālim neiztrūkst atsauces uz pirmavotiem. Tas viss ļauj ieinteresētam lasītājam strukturēt un iegūt jaunas zināšanas.Izlasot šo grāmatu, izlaboju dažus robus savās zināšanās. Piemēram, agrāk arī es uzskatīju, ka zivju eļļa bērnībā ir intelekta uzlabotājs. Izrādās, ka nav neviena reāla pētījuma, kas šo pieņēmumu apstiprinātu. Tomēr zivju eļļas industrija ir pietiekoši bagāta, lai spētu šo mītu pasniegt kā daļu no sava mārketinga stratēģijas. Un tā vietā, lai vecāki pievērstu uzmanību saviem bērniem, skolotāji savai kvalifikācija, ir daudz vieglāk iebarot bērnam pāris kapsuliņas, tā cerot atrisināt pēc būtības sociālu problēmu.Interesanta bija arī nodaļa, kas apspriež Lielbritānijā populāru tēmu – vakcinēt vai nevakcinēt bērnus. Valdošais uzskats ir, kompleksā MMR vakcīna jaundzimušajiem var izraisīt autismu. Kājas šim uzskatam aug no pētījuma, kas aptvēris veselus septiņus bērnus no kuriem visi vakcinēti un veseli pieci „saslimuši” ar autismu. Diemžēl šis pētījums nevienā nopietnā medicīnas žurnālā tā arī netika publicēts, tomēr mediju reakcija bija iespaidīga, tas nekas, ka vēlāk veiktie pētījumi neko tādu neatklāja, labu stāstu jau ar patiesību nemaitās.Autors jau pēc būtības nav pret to, ka cilvēki rūpējas par savu veselību, cenšas lietot uzturā veselīgāku pārtiku un nedaudz pasporto. Autoram nepatīk tas, kā uzņēmīgi ļaudis mēģina šo cilvēka vēlmi ekspluatēt. Cilvēks pēc dabas ir slinks, un savus ieradumus mainīt ir spējīgs tikai retais. Tāpēc bieži vien parādās kārtējā brīnumzāle, kas piedāvā cilvēkam neko nedarīt tikai iedzert pa tabletītei un viss nokārtosies. Brīnumzāle tiek pabalstīta ar publikācijām, kuras atrodamas paša ražotāja izdotajā žurnālā.Arī mūsdienu farmācijas industrijai rodas problēmas – jaunas zāles tiek izgudrotas retāk, patentu termiņi beidzas, tādēļ nākas izdomāt gan risinājumu, gan problēmu. Tā rodas dažādas zāles, kas nodarbojas ar „pseidoslimību” ārstēšanu. Piemēram, kas tā par slimību – vēlme naktīs ēst. Parādās arī zāles, kas pēc būtības ir sliktākas par vecajām, bet nedaudz pieslīpējot pētījumu datus var to efektu uzprišināt, līdz izcilam.Grāmatu vērtēju ar 10 no 10 ballēm. Māca cilvēkus domāt, akli neticēt visam ko avīzēs atgremo žurnālisti un pārvarēt slinkumu iedziļinoties problēmās, sevišķi ja tās skar paša veselību."}, {"userName": "Amanda", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/7458029-amanda", "userReview": "I am so incredibly disappointed by this book. I expected a comical look at some of the more popular science misconceptions sweeping the world (okay, the UK and US). Instead, I struggled paragraph by paragraph to not just light the book on fire. In terms of content: many of the points raised by the author are good, and I think that more people need to read and understand how the world around them works (esp. medicine). But the tone of the book... the author is a jackass (sorry, not sorry). He is arrogant and rude and at every turn is insulting both the readers and the authority figures who are \"deceiving\" the public. I really wish I could recommend this book because the content is important and even interesting. But I just can't support a book that alternates between calling the readers idiots and just plain laughing in your face. That is a sure way to alienate everyone who is looking for answers in a world of misrepresented science."}, {"userName": "Anna J. Shelby ☕", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/36740745-anna-j-shelby", "userReview": "Looking for a book that shines a light on the ways media infuences public opinion in matters of homoepathy, fish oil, antioxidants and the likes? Here it is. Topped with some suggestions how to approach scientific studies, papers and flawed reviews of those. Minus two starts for the condescending tone and the overload on examples."}, {"userName": "Carly", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/4490040-carly", "userReview": "“I spend a lot of time talking to people who disagree with me - I would go so far as to say that it's my favourite leisure activity.”I'm an avid fan of \nMore or Less\n, the popular statistics radio programme on BBC Radio, and I always enjoy Ben Goldacre's appearances on the show. At one point, I remember Tim Hartford introducing him as something like \"the perennially angry Guardian columnist,\" to which Goldacre responded, \"I am not perennially angry!\" or similar. He got quite heated about it, much to everyone's amusement. But Bad Science makes it clear, in the most entertaining way possible, why he's always angry. Homeopathy, alternative medicine, vitamins, fad nutrition, cosmetics, the MMR scare, the South African government's refusal to espouse antiretrovirals... he covers all of them, provides plenty of hard data, and eloquently and entertainingly discusses both the problems with the science and the potential dangers with the way they're advertised. I really enjoyed the book. My only complaint--and it's pretty minor--is that Goldacre's commentary can be a little patronising; he studiously avoids what he terms the \"tedious\" technical details, warns the reader of any impending math, and at one point goes into a diatribe that seems to assume the reader is an MMR scare believer. He also shies away from using probability, preferring natural frequencies, because he considers probability both unnatural and unnaturally difficult, but given that the UK weather only started using probability in 2011, I guess it's a cultural thing.Even though I guess I knew a lot of the substance in the abstract, this book was still an eye-opener for me. I knew the claims of the vitamin industry were questionable, but I had no idea how many studies actually disputed the common wisdom. (By the way, did you know that the \"beta carotene is good for your eyesight\" thing was a myth propagated by the British during WWII? They claimed their pilots' aim was due to a high-carrot diet, not to, say, radar.) I had no idea of the tragedy of Matthias Rath's influence on the South African government and the millions of lives lost because of it. I had never heard of Brain Gym, and I hope to never hear of it again. (By the way, Dr Goldacre, will you please go after Lumosity? Their ads drive me nuts.) He details the media mayhem surrounding the MMR-vaccine-causes-autism saga. He eviscerates, in an entirely fact-based discussion, the claims about homeopathy and other alternative medicines. My favourite part was when he bought a \"certified professional membership\" to the American Association of Nutritional Consultants, the same august institution claimed by a famous nutritionist, for his dead cat:\"I mean, I don't sign my dead cat up to bogus professional organizations for the good of my health, you know. It may sound disproportionate to suggest that I will continue to point out these obfuscations for as long as they are made, but I will, because to me there is a strange fascination in tracking their true extent.\"I think Goldacre has isolated the core problem with this popular anti-science: it trains the populous to trust white-lab-coated authority figures, not facts. It teaches us not to question, but to blindly believe. And that is the true tragedy of Bad Science.And now on to Bad Pharma..."}, {"userName": "S.Baqer Al-Meshqab", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/19072481-s-baqer-al-meshqab", "userReview": "OK. This book was way out of my comfort zone. I would have given it a 5 star rating if I had anything to do with medicine, but for an average person who knew nothing of MMR & MRSA, four stars would suffice. Sorry Mr. Goldacre.Bad Science is a book published to specifically to unveil the masks of those who pretend to be real scientist. As the author states; he wants his readers to know what bad science looks like to identify the real one. The book covers \"sciency\" myths in the fields of medicine. Examples that will be tackled: Detox is a fraud. Ear Candling is a big fat joke. Brain Gym activities are pathetic and Homeopathy is just one of the biggest scams of the history of science. Goldacre will explain how experiments can be held to study the validity of these claims, and what are the basis of real experiments.He will tackle the Placebo effect and how it can be part of controlled randomized trials with which we can know if, say, a homeopathic approach is actually working or not. While reading this book you will get to understand the factors that governs the way a placebo effect works as well, including the characteristics of the given drugs or the state of the doctors who are giving them too.Then he will take you to a world full of wonders about the magical power of Nutritionists and pharmaceutical institutions. are Antioxidants really good to fight aging? Can carotene fight lung cancer? You may not believe it, but some of the so-called nutritionists don't even know that Chlorophyll helps produce oxygen (while still in an alive tree), but don't store oxygen in green leaves. Something a 12-year old child knows by heart. Do fish oil pills improve child intelligence? A scandal of what these companies will do to attract the public is widely detailed in this book. They will invent new illnesses for pills they already have, They will manipulate facts or refer to non-existent or already disregarded studies to support their claims. They will refrain from publishing their invisible research to prove the work-ability of their drugs, or they will cherry-pick whatever suits them to give them the positive results they hope for. Goldacre will tell you about the journey of the drugs and the phases they go through before they see the light, and if you were one of those who want to play tricks on the mind of doctors to convince them that your drug really works, you will find some tips here and there as for how to do it, except that for people who will study your research from A to Z, and they will, these tricks won't work. The author dedicates a large chunk of this book explaining the effect of media on spreading these scientific myths. How journalists love health scares stories, how they can be manipulated, and how numbers can play a great convincing role, especially when they are misinterpreted. The claims of MMR vaccine causing Autism in children is greatly covered (which was a bit hard on me to understand).Regardless, the book was informative (even though I did not understand everything as so many topics were alien to me) and entertaining (the sarcastic style of the author made the book much lighter than it could be). You may not be a doctor or a medical student, but some stuff here are for every one. You will learn something; who knows, you could be the next victim of some nutritionists who will try to convince you that some oranges don't have Vitamin C, so that you will buy the box of pills that have a picture of themselves right on top, with a big fake smile. Cheers!"}], "description": "Full of spleen, this is a hilarious, invigorating and informative journey through the world of Bad Science. When Dr Ben Goldacre saw someone on daytime TV dipping her feet in an 'Aqua Detox' footbath, releasing her toxins into the water, turning it brown, he thought he'd try the same at home. 'Like some kind of Johnny Ball cum Witchfinder General', using his girlfriend's Barbie doll, he gently passed an electrical current through the warm salt water. It turned brown. In his words: 'before my very eyes, the world's first Detox Barbie was sat, with her feet in a pool of brown sludge, purged of a weekend's immorality.' Dr Ben Goldacre is the author of the Bad Science column in the Guardian. His book is about all the 'bad science' we are constantly bombarded with in the media and in advertising. At a time when science is used to prove everything and nothing, everyone has their own 'bad science' moments from the useless pie-chart on the back of cereal packets to the use of the word 'visibly' in cosmetics ads.", "title": "Bad Science", "url": "http://www.goodreads.com/book/show/3272165-bad-science", "average": 4.07, "cover": "https://images.gr-assets.com/books/1327251503l/3272165.jpg", "reviews": 1540, "authors": [{"url": "https://www.goodreads.com/author/show/1387272.Ben_Goldacre", "name": "Ben Goldacre"}], "type": ["Science", "Nonfiction", "Science", "Health", "Health"], "outlinks": ["http://www.goodreads.com/book/show/3272165-bad-science", "http://www.goodreads.com/book/show/26132980", "http://www.goodreads.com/book/show/4605017-bad-science", "http://www.goodreads.com/book/show/17318786-bad-science", "http://www.goodreads.com/book/show/28946524-slikt-zin-tne", "http://www.goodreads.com/book/show/7939559-bad-science", "http://www.goodreads.com/book/show/15795155-bad-pharma", "http://www.goodreads.com/book/show/23132200-i-think-you-ll-find-it-s-a-bit-more-complicated-than-that", "http://www.goodreads.com/book/show/27253969-do-statins-work", "http://www.goodreads.com/book/show/1051446.Irrationality", "http://www.goodreads.com/book/show/1980365.Testing_Treatments"]}