{"ratings": 602, "userreviews": [{"userName": "Sherwood Smith", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/162084-sherwood-smith", "userReview": "This one stands alone, between the Inda storyline and the modern one.Things that came and went in my head while I was writing it: the usual stuff I seem to engage with (different permutations of love, the cost of power, survival mentality and its pitfalls, magic and adventure) but also narratives and reliability and unreliability. The layers of narrative in records.As always, whether any of it communicates or entertains is up to the reader!"}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestI'm really annoyed at this book. Not because it was terrible, or even because it was bad - no, I'm angry because it could have been AMAZING and instead it was merely okay. Part of that lies with the incredibly misleading summary, which would have you believe that this is a fantasy romance story, possibly with elements of F/F. Instead, what romance there is in here is severely underplayed, with the focus being on politics and court intrigue. Don't get me wrong; I love court intrigue, I thrive on court intrigue, but that summary set me up for something else entirely.Our narrator, Emras, is only mentioned once in the summary on Goodreads, which would have you think that she's a secondary character and not, you know, the voice driving the narrative. And what an utterly dull voice it is...honestly, it's to this story's credit that BANNER OF THE DAMNED could be as engaging as it was with dull-as-dishwater Emras telling the story.Emras is a scribe. She's arrogant, sanctimonious, and hypocritical. These things sort of end up almost being her downfall by the end of the book, which actually says some pretty cool things about how power corrupts even when you attempt to use it for good, although it doesn't really come to bite her in the butt as much as it should. After going to scribe school, she's appointed to Princess Lasva to be her royal scribe. Lasva is a Colendi princess. Colend is a fantasy land that borrows heavily from both Japanese and French culture. This shouldn't work, but it does, and what follows is an amazingly detailed description of all the little cuts and secret languages they use to communicate in the very height of courtly fashion. I'm sure this will bore some people to tears, but I found it fascinating.Lasva is in love with a man named Kaidas...I think he's the son of a baron. Lesser nobility, in any case. They carry on a romance that titillates the court with how secretive it is, and fills the duchess, Carola, with burning, vindictive envy. When Lasva is forced to end her relationship with Kaidas and marry a foreign prince by her Queen sister, you can bet that Carola swoops in to steal her man only to realize that being married doesn't necessitate love. Lasva finds this out too with her husband-to-be, Ivandred. His court, Marloven Hesea, is as sparse and crude as Colend is opulent and courtly. In a territory of unrest, he and his people thrive on strength and honor and war, and even have a secret school that's entirely devoted to making boys into young men, and young men into soldiers.Lasva, Kaidas, Carola, and Ivandred were my favorite characters. I rooted for Lasva and Kaidas to be together, and my heart broke for them when they were forced to marry elsewhere for political reasons. It took me a while to get over it, and while I never rooted for Kaidas and Carola, I gradually began to ship Ivandred and Lasva. I'm such a sucker for strong men with fragile hearts, and Ivandred has such a tragic backstory. Also, am I the only one who desperately wants an M/M prequel about Invandred and Dandrid's relationship with they were young men? Yes? Yes? I thought not.While in Marloven, Lasva quickly realizes that the land that's become her new home is fraught with terrible danger. War, fracturing alliances, and dark, dark magic. She also realizes that the men around her are too proud to lose face and sacrifice honor, so she embarks upon a brilliant campaign of sowing fragile seeds of peace through the women with Emras at her side, hoping all the while that her husband and his enemies won't trample them to oblivion or be found out by magical spies.In one of my status updates, I said that this is pretty much Game of Thrones for women and I stand by that. This world is a world that has evolved beyond rape. War is fought fiercely and brutally but without gratuitous torture and sexual and physical violence. The world is just as developed and the characters are just as flawed and complex, but they're a lot more likable and human-like, even the bad ones. Let's be honest, a lot of the \"people\" in the Game of Throne series are just monsters in human skin. BANNER OF THE DAMNED has politics, intrigue, war, magic, love, and romance, but it manages to balance all these things and show how the characters change and develop because of these various things, for better or for worse. Also, it does something that Game of Thrones doesn't: it touches upon the many different kinds of love and sexualities. For example, in Marloven Hesea, they have a history of gender fluidity and it shows in the flexibility of the pronouns in their ballads. Colend has several different names for \"love\" depending on who you're attracted to (those who like men, those who like women, those who like both), or not. Emras, the narrator, is asexual, and the author is careful to point out that while Emars can still feel love and affection - and does - it is only the physical expression, in the sexual sense, that puts her off, although she can still enjoy touch.The problem is, as I said, that Emras just isn't a very interesting character. I was fascinated with all the side characters orbiting around her like satellites and couldn't figure out how she could be so dull. Even when she's learning magic spells, I could scarcely be bothered to care. She just didn't seem to have much personality and I couldn't quite figure out if that's because her will had been utterly bent towards adhering to the rules of being a scribe (although Birdy and Tiflis went to the same school and had the same training, and they didn't have this boredom issue), or if it's just that the author is stronger at writing in the third person than the first person, and therefore comes across as impersonal as habit because when writing third person you have to be removed to let the characters tell their stories. Regardless of the reason, Emras was this wonderful story's downfall, and I'm pissed at her for it, because the writing and world-building and characterization (of anyone but Emras) are utterly brilliant.Also, Ivandred: you poor, sad Marloven cinnamon roll. You didn't deserve what happened to you. :(3 to 3.5 stars"}, {"userName": "Shoshana", "userReviewDate": "Apr 12, 2012", "userURL": "http://www.goodreads.com/user/show/4988551-shoshana", "userReview": "Sherwood Smith writes these ridiculous books where she uses about fifty hundred different perspectives, elaborates on plots threads and characters that for hundreds of pages seem entirely irrelevant, and throws in dozens of unnecessary mini-lectures on history and linguistics - and it works. SO WELL.I don't know any other author who can do what she does. She grips me even when I already know the end. In Banner of the Damned, I saw doom approaching for three hundred pages (out of a 700 page book) - and it still surprised me. I stayed with Emras, the first person narrator (there are probably 12 other third person narrators - weird, I know! but explained, and also after the first jolt into third person, it just becomes fine - necessary, even, to allow for the scope of the story) for something like 20 years, and never tired of her (though I wanted to scream at her to wake up).The examination of violence in Banner of the Damned transcends anything she manages in the same vein in the Inda quartet or any of the stories in the modern arc (A Stranger to Command; Crown Duel; etc.) - which makes sense for this story. The juxtaposition of Colend and Marloven Hesea is fascinating and works really well as a device for that kind of exploration.Sherwood Smith's world is so thorough and detailed and complete and compelling, that every installment fills what feels like a vital niche in my knowledge of Sartorias-deles' history and stories, and I ache for more after every book. This was a story specifically about magic and Norsunder (though you wouldn't know it for the first three to four hundred pages - and that's not a flaw. I don't think), and it made me want to re-read the Inda books and A Stranger to Command with my new trove of information - and of course I want her to write (or has she already written it? publish, in that case) the one where Ivandred returns! I've wanted that since Stranger, and now I'm desperate - and sad (about Ivandred, about his First Lancers, about the historical arc of Marloven Hess, about not having every cranny of this world written down for me yet).And so ready for more!P.S. Plus also I love how Sherwood deals with sex, specifically. I love reading a world where there is no rape; I love the easy inclusion of many kinds of love and varieties of sexual/nonsexual feeling. The ability of an author to do something like this in a fantasy world is part of why I have no desire to read, say, A Game of Thrones, where authors are still rehashing the same old medieval/misogynist worlds and bringing nothing new to the woman question."}, {"userName": "Andrew", "userReviewDate": "Apr 25, 2012", "userURL": "http://www.goodreads.com/user/show/7371054-andrew", "userReview": "Starts out with an seductively quotable opening statement, which I won't quote. Instead, I will say that the author seems to have written an *entire book* to address a single offhand complaint I made in a one-paragraph review of _Inda_ in 2006. (To wit: \"...the narration has potholes; it's mostly tight-third-person, but sometimes jumps heads or goes omniscient to make some point.\")I know this is not possible. Instead, the author must have set up a stylistic rifle on the mantel in a 2006 book, based on story elements going back to her earliest stories, and then let it percolate in our subconsciouses for six years before giving us a (partial) explanation.This is playing the game at a very high level. Smith is not the only author doing it these days, but GRRMartin and Steven Erikson and even Pat Rothfuss are Big Names in Fantasy. I say that Smith needs some attention in this regard. Norsunder deserves credit as one of the great Dark Powers in modern fantasy, a boogeyman whom nobody knows what they *want*. They just pop up occasionally (all ancient history, of course, doesn't happen these days) and instigate some trouble or make some people disappear. And by \"they\" I mean this ordinary-looking guy, who isn't scary until you read some history and realize he was mentioned two thousand years ago. And he isn't even one of the important ones. I'm not conveying this very well. It's *really good* setup._Banner_ takes place about four centuries after the Inda books, in Colend, the other side of the continent from Marloven Hesea. The tone couldn't be more opposed: the Colend court is mannered and leisurely to a Guy-Gavriel-Kayan degree. However, the Marloven empire is still lurking, military as ever -- though not in the same way as Inda's nation. (Another lurking theme is how the history of Marloven Hesea is the history of the Marloven military academy. This is never stated, but after N books it's absolutely clear.)The viewpoint is Emras, a young scribe. Scribes are rigorously trained to be honest and apolitical; naturally, Emras winds up ass-deep in politics and lies. The frame text (still not quoting) makes it clear that this ends badly; the book is about how. As with the Inda series, there are princes, princesses, wars, betrayals, and epic tragic romances -- although Emras is mostly an observer of the latter. Unlike with the Inda series, this book gives us some meta *about* the Inda series: one of Emras's jobs is to translate the four-hundred-year-old memoirs that (presumably) become the quadrilogy. (There are several versions, not necessarily all reliable.) And then the head-jumping comes into it... As I say, meta. And intriguing."}, {"userName": "Wealhtheow", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/76129-wealhtheow", "userReview": "[in which Lasva is Guinevere, Ivandred is Arthur, and Kaidas returns for no apparent reason to be Lancelot (hide spoiler)]"}, {"userName": "Emma Deplores Goodreads Censorship", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/5229326-emma-deplores-goodreads-censorship", "userReview": "[She accidentally becomes the evil mage! That ought to be fascinating! I can't help thinking of Wicked, which I read just a few months ago--no, this book doesn't try to be Wicked in any way, but, well, when the main character moves into a tower and starts doing magical experiments and is labelled as evil, I'm going to think about it, and the comparison does not do this book any favors. (hide spoiler)]"}, {"userName": "Erin DeLaney", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/4545616-erin-delaney", "userReview": "I've been a fan of Sherwood Smith for many years, and have been looking forward to this book particularly, ever since reading the \"Summer Thunder\" excerpt. I was not disappointed at all. This book is definitely in a different category than her Young Adult books (Crown Duel, Posse, Wren, etc), mainly in my opinion due to complexity. This falls more along the lines of the Inda series, and is a great prequel to that story.Sherwood Smith has the ability to make her world seem so rich that when I read novels set on S-d it feels like I am educating myself on history, as opposed to reading a made up story. This book was no exception, and while I went into it knowing how it would end based on legends from other times, I was drawn in to the plot and characters so intensely that I couldn't put it down. I think it manages to carry tremendous complexity without being slow or wordy. If you liked the Inda series, this is a must read. If you are new to Sherwood Smith, it can be a stand-alone story, so might be a less daunting entry point than Inda, although perhaps a bit confusing without the backstory."}, {"userName": "Francesca Forrest", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/2265896-francesca-forrest", "userReview": "[It’s not all frivolity at the court of Colend, however: political machinations are always going on, and real threats exist. The birth of an heir to Queen Hatahra leads to heartbreak for Lasva—which the charismatic Prince Ivandred, newly arrived from distant Marloven Hesea can relieve, if not erase.The second part of Banner of the Damned takes place in Marloven Hesea, a land as different from Colend as iron from silk. Emras accompanies Lasva—now married to Ivandred—to Marloven Hesea, where political threats are issued and rebuffed with swords and arrows, not words, and where, furthermore, it is rumored that an evil magical threat may lurk. This half of the story has wonderful depictions of clashes of culture and painfully accurate depictions of the difficulty of communication across those barriers (and other, personal barriers), but overall it’s much more concerned with Emras’s increasing involvement—and skill—in magic and her tackling of hard questions of right and wrong, temptation and justification. This part of the novel is doing life-and-death danger, excitement, fear and hope. And then that third thing. Emras has been enjoined to look out for an evil mage. That mage is uncovered, eventually, and both is and isn't whom you expect. (hide spoiler)]"}, {"userName": "Debbie Gascoyne", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/2030013-debbie-gascoyne", "userReview": "mm mm good. Long, engrossing, \"epic\" in scope without the cliches of epic fantasy. I loved the pov character, loved the slightly tricky narrative frame. I confess I guessed the \"reveal\" long before Emris did, but I think knowing or suspecting more than the narrator is deliberate. I liked that the author limited the characters she focussed on - I found the wide range of viewpoint characters in her Inda series confusing at times, and enjoyed settling in to watch the relationships between a small group."}, {"userName": "Janny", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/1937942-janny", "userReview": "An intricate court intrigue in a highly developed world - this book is a delightful, leisurely read that builds carefully and delivers a poignant, powerful finish. Spans the gamut between a civilized court and a culture of manners and progresses to a second setting that is austere and centered on warfare, which created a tension of contrasts with lots of depth."}, {"userName": "Rebecca McNutt", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Banner of the Damned has so many great elements. The narrator, Emras, is asexual, which makes her easy to relate to and makes this novel stand out as very original, plus it doesn't have so much of the graphic sex and violence that modern fantasy is becoming (in)famous for in many cases. Each character is very complex, and nothing is sugar-coated, but they still stand up for each other despite their differences."}, {"userName": "Charty", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/607703-charty", "userReview": "I feel a bit at a loss, reviewing Sherwood Smith books anymore. I love her Wren books, and the Crown Duel set, but pretty much everything after that has been a let down. When the Inda books came out, I was excited for an adult series and while I finished the first book, I just didn't love it enough to keep going. Picking up Banner of the Damned was an act of faith for me. Since it's a standalone (although long enough for two books) I felt safe enough and while I did read it and it wasn't too bad, I feel it reveals many of Smith's flaws that, from my perspective, keep her out of the must read/buy pile.The first problem, and it's a major one, is the narrator Emras. She's been trained as a scribe all her life, including strict principles of non-interference in the lives of those she serves. Thye write, they observe, but they are outside the action and are not meant to involve themselves in events. Now the conflict of the story comes in that of course, Emras is thinking she's being all neutral and impartial and she in fact throws pretty much all her training out the window and is neck deep in things. Now that would have been awesome, except Emras is about as interesting as a post. Her distance from the events that unfold makes it hard as a reader to care much about her, especially as so much of it is focused on other, potentially more interesting characters. The distancing of the narrative voice and its often passionless recounting of events kept me constantly out of the story. And did I mention she is boring as hell? She has no life except to serve the Princess Lasva. The author made an interesting choice to have her be elor which is the world's version of someone who is essentially asexual. I have nothing against that, I think that's a novel tack, but the author seems to equate asexual with boring, which seems pretty unforgivable. She has NO close relationships with anyone, seems incapable of them (except in a limited way with Birdy) so it made it hard to warm to her.This leads to another difficulty I found with this book (and Smith's other adult novels) is that despite being written for an adult audience, the writing and concepts struck me as being very juvenile. I've read plenty of very adult YA (in terms of concept and language) and these books just don't seem as sophisticated. Yes, Smith has built this immensely elaborate world with languages and geography and culture, and yet it's almost that over explanation of everything that detracts from the book's power. I understand that she has labored over this world, crafted it like a gem, and while as I reader I want to be immersed in the author's world, I don't need to know every single thing about how it all works. My imagination should be brought into play here, too. Also, her magic system sounds like what an eight year old would come up with. Firesticks? Waste Wands? Cat boxes that clean themselves? The political situations, the interpersonal relationships...just not different enough for my taste. And the personal relationships were very trite. Sure, Kaidas and Lasva's epic romance was moving, but Smith never quite convinced me that Lasva and Ivandred were truly a couple. And when she does deign to deal with sex, it's so carefully danced around you just get a feeling that the author (or maybe it's Emras) going, Oooo, icky) Don't get me wrong, I don't need porn level Anita Blake or anything, but I had a difficult time believing in these relationships. Smith would have been better off to have left it entirely to the reader's imagination or made them more complicated. For instance Lasva talks about her sex life with Ivandred, but it's reduced to we have angry sex and why does she like it? Fine, that's a very adult, complicated part of relationship, but she brings it up and then never addresses it. I can't decide if she wanted to spice things up and then didn't know where to take it or what happened. The story wasn't substantially changed with the information, so why bother to include it?Lastly, the villein of the story again, was so removed, it was hard to think that he was all that evil. Sure, he had his own agenda, but without really understanding why he was bad (Norsunder=bad) I couldn't get real worked up about him, especially since that wasn't revealed until the end of the story. And to wrap, the time spacing was just weird. The first half of the book takes place over a relatively even span of time, but by the end, the story is jumping YEARS in a few chapters. Thank god since it mostly consisted of Emras making wards around the kingdom (yawn).I read it, it was ok but I certainly wouldn't spend money on it, even if you are a Smith fan."}, {"userName": "Lorena", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/251417-lorena", "userReview": "Let me say right off the bat that I adore Sherwood Smith, and I adored the Inda series. (And if you haven't read the Inda series, there is absolutely no reason for you to pick up this book, because the most compelling elements of it depend on you knowing the history of Sartorias-Deles.) But (and you knew there was a \"but\"), this book just didn't work for me. A large part of that was because of the way the story was framed. The story is told from the perspective of a first-person narrator - the scribe Emras - making a record of events that have already occurred. Through magical means (and this is given away in the first sentence of the book, so I don't think I'm spoiling anything here), she is also able to serve as the omniscient third-person narrator for several other characters in the story. The problem is that Emras is, by her own admission, socially and emotionally detached from other people, asexual, and, frankly...boring (although highly intelligent). So what you are left with is nearly 700 pages of story as told by a boring person. This setup allows Smith to explore a lot of philosophical issues in the world she has created, such as violence in its many forms, whether humans can ever fully commit to peace, prejudice, the reliability (or unreliability) of narrators, and the way we justify our actions to make them fit our supposed ideals. It came across (to me, anyway) as far too heavy-handed, though. Smith's strength, usually, is in her characters and their complex interactions and motivations. Smith has always raised interesting questions of philosophy and social commentary in her previous books, by letting the readers observe the characters and how they think and move in the world she has created - in other words, by SHOWING, not TELLING. Indeed, those parts of the story told in the third-person snap along nicely, and if I could rate those parts of the book separately, this would probably be another 4-star book for me. But we always return, far too quickly, to the first-person Emras viewpoint, and there things go back to dragging as Emras TELLS us all about the issues important to the story, as played out in her own head. Which is, as I have mentioned, a fairly boring and socially limited head. Also, while Emras' nature is necessary to drive the plot in many ways, it is her nature not to see this until several hundred pages after the reader has figured this out. So in the end, you are forced to spend a huge amount of time with a narrator who is personally uninteresting in most ways, and so oblivious to the importance of events around her that you constantly want to reach through the pages and smack her a few times.As much as I enjoyed learning more about how Sartorias-Deles has developed since Inda's time, and as much as I enjoyed the voices of the other characters in the story, I'm afraid this book is mostly a failure to me because of the narrative choice. I can understand why Smith chose this narrator for this story, I can appreciate the intellectual exercise of having the story told by a narrator with certain limits (although the magic work-arounds for some of those limits strike me as a little convenient). Still, it's hard to complain too much about the work-arounds, since they give us the most interesting bits of the story. Overall, I think the over-arching story would have been better served by continuing in a third-person narrative voice."}, {"userName": "Minli", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/981514-minli", "userReview": "I feel like it's impossible for me to review BANNER OF THE DAMNED objectively; Sartorias-deles is one of those worlds that I've sunk so completely into, I'm finding it difficult to distinguish the novel from an actual scribe's record in Eidervaen. But I will try. I've read iterations of BANNER before, both in the short story Summer Thunder before Emras's perspective was pulled out, and heard the author do a reading of it at conference. There is so much I want to say. More than anything, this book is about narratives and how we record them, and how history and time and meddling distort them. Also, to great extend, patriotism--what we do for duty, for our spouses, our families. And how Emras's account may or may not be more reliable than any other, but then, she does have a certain advantage. But while I really enjoy having Emras as narrator, I'm also afraid of identifying with her. I love how she tries to be a good person--tries so, so hard--and yet her downfall is her thirst for knowledge and her duty to her country and profession--which are just as entwined with her identity. Lasva's story will always be tragic to me. Just like Joret and Tau in the Inda books, I will never, ever envy that kind of extreme beauty. I also don't understand it. I've never felt instant attraction to the extent that I want to not only possess them, but strip them of their free will. But for the sake of this story, I went with it, and I couldn't help but pity Lasva. In an over-refined and over-cultured country like Colend, no one deserves straightforward, unconditional love more than Lasva, and that's because she's a good person who's had to make deal with facade after facade. And her romance is likewise tragic. Her marriage is tragic too. Boo.As for Marloven Hess, to be honest, it was a relief to be back there. There's not too much mention of the Academy aside from the fact that Ivandred went there and the kinship ties he has with his academy-mates are so strong (twisted, but strong) that they even defy death. It was fun to see glimpses of other s-d books--the characters read Fox's record (the Inda books), and Tharais and Geral, Shevraeth's ancestors, make an appearance. Yay easter eggs :)It's so easy to get lost in an epic like this. I took my sweet time reading it. The pacing is sometimes uneven, but at this point I was so invested in the characters and story (and tragic ending… basically, you know that Ivandred walks into Norsunder and out of time with his First Lancers from reading A Stranger to Command. Sorry if I spoiled anyone) I didn't mind one bit. I just can't wait for more."}, {"userName": "Cecily", "userReviewDate": "Dec 02, 2013", "userURL": "http://www.goodreads.com/user/show/178074-cecily", "userReview": "I think what pleased me the most about this book was how much Inda was in it. I knew it took place several hundred years after Inda's epic saga so I was expecting a completely separate tale. And, at first, it seemed like that's what we had. Our story begins in Colend and we learn the court rules and politics of a culture only briefly learned about in the Inda stories. (Tau's knowledge of Colendi plays is what I remember the most.) I love Sherwood Smith for how deep the rabbit hole goes. When she writes about a society, she doesn't mess around. I felt so comfy by the time we left Colend that our character's discomfort and alarm at the Marloven way of life was MY discomfort. Which is crazy, because I thought I knew the Marlovens best. But not so. they've changed a lot, including the spellings of names and territories. The new academy was especially heartbreaking. Anyway, this story was compelling and told from different points of view. Our main character is Emras, a scribe who is writing this book as her \"defense\". Putting the puzzle together over a massive 700 page book was tons of fun. The only quibble I had was how fast the story ended after a rather alarming character loss. I don't know if I just have a soft spot for the Marlovens (I do), but I wasn't pleased with how the Princess ended up either. I know life isn't fair, but I was put out. :( The ending also felt open-ended enough for a sequel, but I couldn't tell. I'll have to check into that.In short, awesome book. I wouldn't recommend it though unless you've read the Inda quartet. (And you should read those books anyway. At least five times each.)"}, {"userName": "katayoun Masoodi", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/53974-katayoun-masoodi", "userReview": "maybe sometimes, 3 1/5 if i hadn't read any of smith's other books, but i love this world and a story about this world is a happy event and usually atleast 4 for just existing!"}, {"userName": "egelantier", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/2172362-egelantier", "userReview": "so i thought, i need to read something quick and easy, and next thing i knew, i was reading banner of the damned, all glorious 695 pages of it. ooooooops. it's a very distant (400 years in the future) sequel to inda (that's why i was wary of reading it before, and in some ways i was right, because apparently it took marlovens less than five generations to completely fuck up everything inda and evred and hadand and co sweated and suffered for. i rooted for you, marlovens, we all rooted for you! but worth it), centered about emras, a young asexual (it's a point in her personal history but not the issue of the book; sartorias-deles verse is wonderfully and casually blase about all the permutations of orientations and relationships, and it's one of the things i love passionately about these books) girl growing up in a heyan-like royal court of colend. emras is a scribe, which is a profession and a vocation centered about not interfering, not influencing events and always telling the truth; as a result she's a sheltered, naive, kind and decent person, and it, of course, means that soon she will discover that a) lying is the most fun a girl can have without taking her clothes off (ha) and b) good intentions pave the way exactly to the destination you'd expect.anyway, the first part of the book is about emras growing up in colend and being assigned as a personal scribe to lasva, a brilliant and warm young princess struggling with her turbulent first love, and with her place in the court; and in the second lasva will go away to marloven hesea, a cold, martial kingdom, marry prince ivandred and do her best to wed peace and war, whereas emras will learn magic and discover, erm, things about herself she'd rather not. it's glorious high fantasy in the same way inda is glorious high-fantasy: worldbuilt at a breathtaking scope, seamlessly blending high politics and personal lives and intersections thereof, populated with breathing multifaceted people just trying to do their best (or, occasionally, their worst), dealing with culture clash and with various ways of communication and miscommunication, quietly and with dignity showing many facets of love. there's a lot of wonderful meta-commentary on inda (which exists as the in-universe text, in several permutations of various truthfulness), but the book stands pretty firmly alone as well. and there's a clever, clever twist built in (not shocking twist, per se, because you spot it far ahead of emras) that makes the whole book an exercise in breathless waiting for the tragedy.but for me the most frustrating weakness of the book was in its strength: emras is a brilliant meta narrator (remember how in inda the pov will switch from omnipresent to tight third and back? it's addressed here), but the very nature of her narrative meant that in the second part of the book she willfully isolates herself from the things most interesting to me: lasva and ivandred's fraught relationship, lasva's attempts at integration, culture clash, everyday marloven lives. basically, i loved the book i read, but i'm sad for the book i could have read; but it's probably the point of the story, as well.as always, highly and strongly recommended."}, {"userName": "Q", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/2172298-q", "userReview": "Heartbreakingly different from the other books in Inda universe. Emras blindness as well as blindness of those around her is so sad and inevitable. The cloud of dread follows every plot twist until the reveal comes like lightning: ruthless and inescapable.Despite liking the book, I would've preferred not to read it: the ending is rather hopeless to me, and I don't like feeling hopeless after a good book."}, {"userName": "Serena", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/3638539-serena", "userReview": "Banner of the Damned is a perfect example of why Sherwood Smith is a genius. The world of Sartorias-deles that she has created is rich in history and detail. This book ties together so many threads from her previous stories (Inda, Crown Duel, Senrid, A Stranger to Command) that you can't help but be amazed by her skill as a world-builder and storyteller.Banner of the Damned covered so much ground, that it felt like I was reading a whole series, rather than one book. The main character Emras starts out as an insignificant scribe who happens to be in the right place at the right time. Over the course of the novel she is confronted with many moral and ethical decisions that ultimately make her an integral part of the story. You really see the arc of her character, as she transitions from a young naive student to a mature woman that takes accountability for her actions.Although the narrative is mostly from the perspective of Emras, it is not solely her story– it's a behind-the-scenes look at how culture shapes nations. This is also a great example of how subjective history is when it's distorted for personal or political reasons. The perspective of the book shifts at times to other characters, so we get a intimate portrait of all the main players. Each and every character in Banner of the Damned is unique and interesting, Smith is excellent at conveying their motivations and desires so they all seem to come to life. No character is without a flaw, and even the villains are not purely evil. There is such a wide range of personalities and emotions, that it's easy to relate to and empathize with the characters.The tremendous amount of political and historical detail can sometimes be overwhelming, but it this case it only serves to enhance the reality of the world, and add dimension to the story. If you're new to Sherwood Smith, I would recommend starting with some of the \"easier\" books (Crown Duel, Senrid, Inda), and working your way up to this one.Read more on my website"}, {"userName": "Anna", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/8668007-anna", "userReview": "Oh my. What a book - this was the best read I've had for quite a while, it really is the definition of an epic fantasy - stretching out over time, featuring many nations, vastly different cultures, and dozens of vividly drawn characters. Reading it was like swimming in a vast bubblebath, all embracing, deeply relaxing and every time I dipped into it I would forget all about my daily concerns. Although, the bubblebath comparison makes it sound amorphous and this is a very thoughtfully constructed book. When I first started reading I could not see how the disparate characters fit together, but at the end everything fit together in the most satisfactory way. And yet, even with the epic scale of the plot and interwoven storylines Sherwood Smith never loses sight of the humanity of her characters. I've loved so many of her books, but this has effortlessly leapfrogged ahead to become my favourite to date.It's a sequel of sorts to the Inda novels which I haven't read yet (though the first two are now waiting for me on my Kindle) but set hundreds of years later and I never felt like I needed to have read the Inda novels first. I skipped over them because military fantasy isn't quite my cup of tea, but now that I've read Banner of the Damned I'm eagerly looking forward to them. I don't want to give away any spoilers in this review because I adored reading this book without any idea of what was to come, but I think I can say that one of my favourite aspects is the examination of culture and culture clashes. I'm sure that I have much much more to say about this book, but I've stayed up far too late tonight finishing it & I really need to get some sleep. Once I got to the 80% read mark, there was no way I was going to get to sleep tonight without finding out how it all ended!"}, {"userName": "John", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/309661-john", "userReview": "A young scribe follows her beloved princess, who is swept away by a barbarian prince, takes up the study of magic and discovers a plot is far more complex, and that goes back far longer, than she imagines. This is a fine example of a book that would have been much better if 300-400 pages shorter. The author is good at action scenes but:A) She devotes huge wads of the story to developing the culture of gesture and subtlety in which the princess is raised, but next to, say, Daniel Abraham's similar culture in his SHADOW IN SUMMER it comes off as superficial,B) There are dozens and dozens of pages in which nothing of significance occurs that advances the plot...all in the service of character development, I guess. I found these unreadably dull and, in the end, barely, if at all, either relevant or enriching.C) The author should stay away from sex scenes, as sample lines like \"His senses organized differently from mine, with a strong erotic component that sent a thin thread of fire through my vitals...\" and \"'Obliterate me,' she whispered, and sank her teeth into the palm of his hand.\" demonstrate.A worthy kernel, but tedious in the execution. Sequels are a distinct possibility but I'm not likely to read any unless they're only about half as long and better edited."}, {"userName": "Jacqie", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/2133111-jacqie", "userReview": "So I liked the style of this book. An Asian-feeling fantasy setting with intricate social customs and politics, viewed through the eyes of a rather naive scribe who has access to the highest nobility. I think I didn't like it better than I did because I was just missing context. I think this book is set about 400 years after the author's previous series, something I didn't know when I picked up the book. I felt the lack of that background, especially once I left the first section of the book. Because it's a big one for me these days- 600+ pages is more of a commitment than it used to be- I ended up not finishing. But I would very much like to read the previous series and enjoy this world from the beginning- as I said, I like the author's style.One issue: there was a map in the book, but I could not match the map to ANY place names more than 100 pages in. This annoyed me and made me feel even more like I didn't have proper context, or that I hadn't even gotten to the \"real story\" almost 200 pages in to the book."}, {"userName": "Phoebe", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/2807810-phoebe", "userReview": "Emras tells her lengthy story in the form of a defense, but we don't understand the circumstances under which she should need to write a defense until close to the end of this nearly 700 page fantasy masterpiece. Her scribe skills and manner of deportment are such that she is made Royal Scribe to the princess Lasvas at only 16; this coveted position, however, carries with it a dismaying complexity that requires Emras to be extremely careful and discreet. Then, when the queen finally has a child, her sister Lasvas is free to make a good marriage, since she will no longer be heir to the throne of Colendi. Smith's usual astonishingly detailed fantasy world (already created in the much earlier-timed Inda novels) makes for a rich reading experience, tough to emerge from. Emras and Lasvas are on the brink of some earth-shattering adventures, and Emras' funny little personality carries this tale of magic, romance, politics, and adventure. Highly recommended, but a huge time commitment! Adult."}, {"userName": "Anne Osterlund", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/2232237-anne-osterlund", "userReview": "Emras is taught to be a scribe. To hide in the background and observe, not just the words people say but the emotions and truths behind them.When she is assigned to stand alongside Lasva of Collend as the princess’s personal scribe, Emras can imagine no higher honor. But this will change. With the birth of an heir that will change both Emras’s world and Lasva’s. With a romantically driven assault that will invite a warrior into a kingdom renowned for peace. And with a new task.A task that will test two kingdoms, defy the greatest mages of the current era, and ensure that Emras will never be remembered for fading into the background.Banner of the Damned is Sherwood Smith’s latest epic in the world of Senrid, Shevraeth, Inda, etc. I felt like Lasva’s relationships were the most interesting in the story, as well as her attempts to carve out a semblance of peace within a culture almost entirely centered around war."}, {"userName": "Caity Ross", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/57277436-caity-ross", "userReview": "It has been a long time since I have been so completely submerged in a fantasy world. After finishing, I spent the rest of the day in a post-book haze... Brilliantly done, Ms. Smith."}, {"userName": "Jasmine", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/1145788-jasmine", "userReview": "Wow, that was not unenjoyable, but my word nothing really happened. That was a 800 page book that was really dependant on a previous four books, and setting up for another four. I liked a lot of the people! Ace main character! Fun world! And five hundred pages devoted to a few months of fashion followed by three hundred pages for ten years of magic work described in metaphor. *puts chin on fist, considers book*"}, {"userName": "Hallie", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/1145657-hallie", "userReview": "Lucky enough to read this in MS - can't wait to reread it in print. Takes place several hundred years after the events in the Inda books, and as well as being a great story in its own right, shows multiple different perspectives on the earlier books. Wonderful."}, {"userName": "MB (What she read)", "userReviewDate": "Jan 20, 2012", "userURL": "http://www.goodreads.com/user/show/1586349-mb-what-she-read", "userReview": "I would recommend reading the Inda series first. I haven't and am having a difficult time with this. (A very detailed and complicated world, little action so far, and almost no backstory.)"}, {"userName": "Rachel", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/8747706-rachel", "userReview": "I started this one a while ago but never finished, can't remember why. Been revisiting S.S.'s works the last couple weeks and returned to this. I don't understand how I didn't finish it immediately before! Perhaps because I was coming off of the high of the Inda books and wanted something to fill the void, and it didn't quite fit. On this read, with a bit more distance from Inda, I found it to be well-paced, fascinating, and altogether much more dire than anything I'm used to from this author -- setting us up for an epic battle to come, I hope, in her forthcoming books. (When, WHEN will they finally come out??)I don't know if I'd recommend this as a starting point for Sherwood Smith's work. I'd say, start with the Inda books, read Banner, then A Stranger To Command. Crown Duel was my entry point into her work years and years ago, but it may not be super vital for anyone following the Norsunder plotline throughout these books, which flashes in and out of the storylines of her books tantalizingly.Speaking of which, this is the closest glimpse we've gotten so far of Norsunder's mechanisms. Which was wonderful, and gave that sense of direness I mentioned -- because in her other books, the antagonists are at the end of the day, comfortingly human and with a human's comprehensible, short lifespan. Now, we get a glimpse of the very, very long plans in place, and it makes one shiver at the inscrutability of it all. Yes, I can't wait to learn more.So, what else is there to like? A lot:* Examinations of Colendi court rituals, the gates and the ribbons and the rituals and the words and the color symbolism... If you love intricate social rituals and formalities and such, you will enjoy this aspect. I love how the culture of Colend came just as vividly to life as the culture of Marloven Hess/Hesea -- and how you could really FEEL the difference between the cultures, and sympathize with the culture shock -- an admirable feat of storytelling, since I found Marloven ways so familiar from the Inda books -- and now I saw them through Colendi eyes as uncomfortable, barbaric, etc. etc. * Speaking of culture shock, I really love Sherwood Smith's depictions of strangers in strange lands, of paying attention to how these characters feel in new surroundings... the small details of homesickness on the holidays, down to the different scent in the air -- it makes her world feel so much more vast, that thrill of verisimilitude* The pacing, and the gradual turn (I won't say more b/c spoilers) of the narrator -- going along with that, the exploration of unreliable/reliable narration, I *love* how she uses POV here* The friendships between the characters, and the exploration of the many permutations of romance/sex -- Emras is asexual (though not aromantic!) which is not something you see much, and I appreciated that* If you've read Inda, this book gives such a sense of the epic, because you're seeing the events depicted so vividly in those books, now through the filter of history, and the changes in Marloven Hess/Hesea -- just like what I said about the homesickness details earlier, these changes give me a sense of the vastness of this world's history, and make me hunger for all the details and story threads I don't knowThis last part is the greatest \"flaw\" of this book, which is just that it feels like a very detailed, compelling *prequel* to the huge story arc to come. I am glad to have it, but I think I would enjoy it more if I could hop right into the story arc, and/or I read it as a prequel, after I was able to see the shape of events in the future. I don't know if this review is helpful to anyone not already interested in this universe -- anyway, I'm glad to have read it, and can't wait for whatever's coming next. Sherwood Smith is a truly formidable talent -- the way she combines centuries of detailed worldbuilding with careful study of human nature, society, etc. -- with the mechanics of good storytelling, plotting, characterization. I can't wait to read more.4/5 stars"}, {"userName": "Hannah Ringler", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/29400353-hannah-ringler", "userReview": "So, the first thing you ought to know about Banner of the Damned is that Sherwood Smith’s books are pretty much all set in the same ‘verse. There are a couple of exceptions - Exordium, for example, is a space opera, and Wren’s books are set in, well, Wren’s world - but the seven books that make up the Inda, Banner of the Damned, and Crown Duel sequence are all set in Sartorias-Deles. They are also all doorstoppers, which gives you a vague inkling of the complexity of the worldbuilding that goes into these babies.And it is seriously complex. The major complaint I get from people I evange - er, share - these books with is that they are way too complicated and take forever to get going. This is, in fact, a hundred percent true. The first fifty or a hundred pages of Inda, and of Banner of the Damned, involve a lot of setup and character development. Smith manages to avoid heavy exposition by starting the main characters out young and in need of education, but the flip side to this particular solution to exposition is that the main action of the story takes forever and a day to get started. I personally don’t mind - worldbuilding is a major novel kink for me - but it definitely can be offputting. To those of you who find it so, I say - don’t give up. Stick with it. I promise, it’s worth it. Each country is beautifully developed and, while one can see occasional resemblances to aspects of various cultures in our world, none of the countries is recognizable as a thinly-veiled England, Japan, etc. The geography informs the social structure, and those following the story chronologically from Inda through Crown Duel can actually pick up on linguistic and cultural drift over the thousand-odd years of time covered.Banner of the Damned is the story of Emras, a young scribe who finds herself in the service of Princess Lasva of Colend. Lasva is enchanting; kind, cheerful, affectionate, breathtakingly beautiful, and genuinely fond of her sister the Queen, to whom she is heir. Although Emras is at first determined to hold to the scribe commandment of no interference, her growing investment in Lasva determines her to do whatever is necessary to ensure Lasva’s happiness.What Smith really excels at, even beyond her skill at worldbuilding, is creating characters a reader really gets attached to and villains whose downfall you can’t quite rejoice in. Banner of the Damned is teeming with both varieties, and I’m not sure there’s a named character in the book I really felt indifferent to. Part of the reason the characters really pop is the complexity of their relationships - Lasva, for example, has love affairs with three men, one who loved her for her power, one who loved her for her mind, and a third that loved her for her body, and all of these relationships have serious political and emotional consequences. Emras, whose love affairs don’t really have the power to topple thrones, appeals in another way - she’s asexual (not aromantic though) and while it’s an orientation that’s widely accepted in Colend, it’s one that costs her some pangs as the story rolls along and her relationship requires some very human experimentation and negotiation before everyone settles into something that works well for them. I was really excited about that, actually - asexual representation is pretty damn rare in novels, to the point that I’m not sure I’ve actually read a novel with an asexual main character before, and that it was a book I could recommend to the ace people in my life as one that represented them was a pretty serious selling point for me.As for the villains, well, while a number of people do some pretty damn terrible things in the book, it’s hard to say that any of them is precisely a villain. The main deceiver in the story is a pawn for a greater outside force we never really see, and the end of the novel suggests that his motivations are much more complex than they appear. He deceives some people into committing villainy, but they themselves are not bad people - they are loyal, devoted people struggling to protect those they care about as best they can, and when they realize what they’ve been doing, they make amends. One character is particularly vile - he uses sex to get information and then murders his informant - but when he gets what’s coming to him, you can’t really rejoice in it because the reason he’s getting punished is not the reason he should be getting punished, and so his punishment is unjust. Another character is wildly unpleasant, cruel, and manipulative and does triumph, but the triumph is a hollow one and every day after only serves to reinforce this character’s loneliness. Each villain is well-rounded and developed, and while I never felt quite the dragging sorrow that the death of one of the villains in Inda caused (he never had a chance! if he’d just had a chance!), the villains inspire considerably more regret, sympathy, and wistfulness than anger or fear, which is a nice reading experience.Of course, it’s also an incredibly exciting read. The last few hundred pages, in particular, are edge-of-your-seat as the carefully-orchestrated events begin their final catastrophic slide, and I’m not sure it’s possible to stop reading at the very end. The middle is pretty solid as well; it’s where a lot of the romance elements resolve, dissolve, and evolve, which is pretty engrossing. It’s not structured or directed as deftly as some of Smith’s other works - it feels as if she were trying a new kind of plot that she was a little uncomfortable with - but is still solid.The plot does get a bit heavy-handed at times, and the story lost sight of the larger picture too often even for a narrative where the main character isn’t supposed to be aware that there is a larger picture, but these aren’t big enough flaws to throw you out of the story. I also thought that it could use a bit more foreshadowing to link the title to the story. While it does make sense at the end of the book, joining the image of the banner of the damned to events earlier in the novel (particularly those involving one of Lasva’s lovers and the woman who married him) and weaving the idea of deliberate sacrifice in reparation of wrongs you have committed into the fabric of the story from the beginning would’ve made it a much more compelling image and a much more suitable title. And, while it is a pretty solid standalone novel, some of the historical content wouldn’t make much sense without having first read Inda.tl;dr - it’s a good book, a fun read, and wildly exciting at times, and it has an asexual main character, but it doesn’t quite match up to the very high standards set by the Inda quartet (which I highly recommend reading first). Warnings for violence, voyeurism, and manipulation."}], "description": "Princess Lasva is about to be named heir to her childless sister, the queen. But, when the queen finally bears an heir, Lasva's future is shattered. Grief-stricken, she leaves her country of Colend and falls into the arms of Prince Ivandred of Marloven Hesea. His people are utterly different-with their expertise in riding, weaponry, and magic- and the two soon marry.When the sensational news makes its way to Lasva's sister, the queen worries for Lasva at the hands of the Marlovens, whose king's mage is in league with the magical land of Norsunder-considered by Colendi to be their enemy. The queen orders Emras, a scribe, to guard Lasva.But it may be too late-Lasva is already deeply involved with the Marlovens and their magic. War wages on, and all are forced to redefine love, loyalty, and power...", "title": "Banner of the Damned", "url": "https://www.goodreads.com/book/show/9708616.Banner_of_the_Damned", "average": 3.64, "cover": "https://images.gr-assets.com/books/1331202982l/9708616.jpg", "reviews": 99, "authors": [{"url": "https://www.goodreads.com/author/show/12350.Sherwood_Smith", "name": "Sherwood Smith"}], "type": ["Fantasy", "Fiction", "Fantasy", "Lgbt", "Did Not Finish"], "outlinks": ["http://www.goodreads.com/book/show/9708616-banner-of-the-damned", "http://www.goodreads.com/book/show/13576203-banner-of-the-damned", "http://www.goodreads.com/book/show/15811589-banner-of-the-damned", "http://www.goodreads.com/book/show/21060.Crown_Duel", "http://www.goodreads.com/book/show/596308.Court_Duel", "http://www.goodreads.com/book/show/596307.Crown_Duel", "http://www.goodreads.com/book/show/222837.Inda", "http://www.goodreads.com/book/show/2852832-a-posse-of-princesses"]}