{"ratings": 209, "userreviews": [{"userName": "P.J. Sullivan", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/2259722-p-j-sullivan", "userReview": "Ever wonder what goes on at Cancer Centers of America? This book may give you some clues, as the author was associated with those cancer hospitals.His program in three steps:1- Debulk tumors with “traditional” treatments: surgery, radiation, chemo, plus hyperthermia.2- Regulate remaining cancer cells with enzymes.3- Feed the immune system. Build resistance with nutrition.What is meant by nutrition? “Anti-cancer” foods, especially proteins and vegetables, plus megasupplements: vitamins, minerals, herbs, glandulars, fatty acids, probiotics, food extracts. This book assumes that cancer is caused by deficiencies, not excesses.The recipes in this book include ingredients that should be off-limits to cancer patients: salt, sugar, garlic, meats, cheese and dairy, wine, bacon and eggs. Even “liquid smoke,” whatever that is. This book states repeatedly that sugar feeds cancer. Then why do its recipes call for brown sugar? It says on page 115 that brown sugar is “virtually identical to white sugar.” The author calls salt an “essential nutrient.” Being inorganic, salt is neither essential nor a nutrient. Organic sodium and organic chloride are essential, but you won’t find them in salt. He thinks a vegetarian diet might be too alkaline, but cancer patients tend to be too acidic. He calls garlic a “superfood” but garlic is a toxic irritant that contains allicin and mustard oil.The “traditional” treatments included in this program disable or damage the immune system. Can nutrition repair that damage? Many of these “super” nutrients are said to “boost” the immune system, but how do they do that? Some of them are toxic. If you ingest poison you will get an immune response, but provoking the immune system is not the same as boosting it. Garlic, for example, is credited with stimulating the immune system; its toxicity provokes an immune response. On page 73 this book says, “Biological therapies attempt to fine-tune and focus the immune system into a more vigorous attack on the cancer,” but “most forms have extremely toxic side effects.” So it is unlikely that the damage to the immune system can be undone, and that is the bottom line of this program.A good discussion but too much science and not enough nature, in my opinion. Too many dubious “super” nutrients to balance against one another. Too much complex biochemistry to manage. Healing does not need to be this complicated. Are concentrated supplements effective in pill form? Can they even be safe in megadoses?This book is right to assert the importance of nutrition in cancer but I am reminded of Herbert M. Shelton’s sage advice: “There are no superfoods.”"}, {"userName": "Kate", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/9526644-kate", "userReview": "Repetitive. Plays fast and loose with much of the cited research. (I checked dozens of his citations against the originals.) Oddly, the recipes -- supposedly healthy -- involve a lot of fried food, despite his point elsewhere that cooking destroys the hard-to-come-by, and much needed, enzymes. There are FAR better books on cancer nutrition out there."}, {"userName": "Michele", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/2976529-michele", "userReview": "This book gives interesting and useful information to those suffering from cancer. The main thing I took away from it is that sugar is a prime cause of inflammation in the body and that cancer cells are attracted to it. There is an easy pull-out chart to use for reference and a CD which has the main points of the book recorded on it so that people who aren't well enough to read can listen. The only downside I see is that there is so much information related to supplements that you would really have to be organized or have someone very organized following you in order to track all of those things. Also, I think you would really have to find a doctor open to using these supplements, and I'm not sure that's such an easy thing. I guess it depends on your doctor and where you live. In any case, the book is full of useful information and seeks to help people from all angles, despite its mostly nutrition-based stance."}, {"userName": "Ashwini", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/52200566-ashwini", "userReview": "An end to end work on cancer. explains the disease, what causes it, how well does the medical profession understand it, how to deal with it. nutrition along with conventional treatment options works the best. don't blindly trust your oncologist if he is not nutritionally oriented. explore your options. cancer is not the end of the world it is a new hope for a new you and I wish and pray that hope will prevail above all odds."}, {"userName": "Mary Karpel-Jergic", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/25326846-mary-karpel-jergic", "userReview": "Jam packed with information, this book is a testimony to the knowledge accumulated by this author, however, it is quite a challenge to hold on to everything that you're being told - it's a rather overwhelming compendium of nutritional facts and not organised very well which is a shame because there are great nuggets of useful info about the various attributes and qualities of food and supplements and their potential application for cancer prevention and/or dealing with the effects of chemotherapy.It is somewhat dated as we have come a long way with understanding diet since it was first published in 1994 and this revised version (2005) is still a distance from considering a raw or vegan diet. Nevertheless, for the basics around what various foods offer and their roles in cell metabolism this book is a wonderful resource to have on your book shelf."}, {"userName": "Grace Dadoyan", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/6890639-grace-dadoyan", "userReview": "This book is very repetitive and the author takes several opportunities to remind you of his 3 degrees and other various credentials. There is some useful information here but there are many other books out there that have as much or more information, are easier to read, and are more current. He recommends an omnivorous diet which may appeal to some people since most cancer books will recommend at least a vegetarian approach. The material, even in the 2005 edition, is outdated - he says that preliminary evidence shows Splenda to be safe and he does not list agave nectar under alternate sweeteners. I kept thinking the book read like an infomercial and then when I got 2/3 of the way through the book, he starts touting the benefits of a supplement called ImmunoPower which he has formulated. So despite containing some accurate information, the book is in fact, one big infomercial for his products. Check out Anticancer A New Way of Life or Waking the Warrior Goddess instead."}, {"userName": "Ann", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/22246543-ann", "userReview": "Beating Cancer with Nutrition, by P. Quillin, ISBN: 0-9638372-9-X, @ 1997, PB, eBay 10/2008, 6.35"}, {"userName": "Mrsgaskell", "userReviewDate": "Sep 01, 2010", "userURL": "http://www.goodreads.com/user/show/4093272-mrsgaskell", "userReview": "I'm not sorry I read this book but I would be very cautious about implementing any major changes in my diet. I showed the book to my dietician and we discussed some questions that the book raised for me. In that way it was useful and my dietician provided me with additional information on glycemic index, and use of soy products for example. The book is not specific to any one cancer and one cannot conclude that what works for one type of cancer will work for another. Also, the patient profiles were similar to testimonials rather than rigorous scientific studies. That said, success stories are always encouraging and this book reminds one that nutrition and attitude are valuable adjuncts to chemotherapy and radiation."}, {"userName": "Ann", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/22246543-ann", "userReview": "Beating Cancer with Nutrition, by P. Quillin, ISBN: 096383729X, @ 1997, PB, eBay, 2/2010, different front cover than what Goodreads is showing."}, {"userName": "Debbie Burgess-Shaw", "userReviewDate": "Jan 03, 2015", "userURL": "http://www.goodreads.com/user/show/5171131-debbie-burgess-shaw", "userReview": "This book would have gotten 5 stars if I could have easily purchased the ImmunoPower created by this author. Finding a good, tasty, broad-spectrum vitamin powder is difficult and this author's website didn't allow me to purchase the quantities required to get the discounted price. Otherwise, the information in this book is excellent. He emphasizes the need for good nutrition to fight the cancer battle AND the elimination of sugar and those foods that quickly turn to sugar once eaten."}, {"userName": "Julie", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/611043-julie", "userReview": "My sister in law downloaded the Kindle version for me. Great resource to help you really understand how poorly we are eating and what healing we can begin with simple wholesome food. Definitely gave me fabulous ideas to help strengthen my body as I enter chemotherapy and hopefully to help my immune system stay strong during treatment and beyond!"}, {"userName": "Rachel", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/1121836-rachel", "userReview": "THe information in this book is a bit outdated, and the material is not organized very well (the recipes kind of hang out in the middle chapters) but there is still a fair amount of good information here."}, {"userName": "Andrea", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/1687582-andrea", "userReview": "The information is sometimes contradictory and somewhat outdated. I wouldn't count on this book as my only source of nutrition and supplement guidance, not by far. But it's still helpful in some ways."}, {"userName": "Judy Schmidt", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/11159777-judy-schmidt", "userReview": "Extremely well referenced."}, {"userName": "Armatstorage", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/911497-armatstorage", "userReview": "Has 374 pages I skimmed. Has great quotes and lots of fascinating info about nutrition and our bodies. Would like to own it."}, {"userName": "Rachel Meyers", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/3098739-rachel-meyers", "userReview": "This book is amazing well researched and is about using nutrition to enhance your traditional medicaine like chemo and radiation. It's amazing that more doctors don't use nutritional therapy."}, {"userName": "Marilyn", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/47690985-marilyn", "userReview": "This book is really full of useful information. It is one the most comprehensive I have read on the subject."}, {"userName": "Denise Messenger", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/10642646-denise-messenger", "userReview": "This book outlines how important nutrition is to cancer recovery. It is thorough, well presented and comprehensive. It has some excellent recipes."}], "description": "Beating Cancer with Nutrition. Sugar feeds Cancer: diet and supplements can starve tumors? Nutrition makes chemo and radiation more toxic to the tumor while protecting the patient. Nutrition changes underlying causes of cancer, improving outcome for cancer patients regardless of other therapies. Why Beating Cancer with Nutrition is unique: The book was developed after working with over 500 cancer patients and organizing 3 international symposiums on the subject. The information contained in BCN is both scientifically backed with references and clinically proven in the hospital with patients. This information helps cancer patients to improve quality and quantity of life. BCN had been translated into Japanese and Chinese and is being translated into Korean. BCN had become a home study continuing education course for registered nurses. BCN 2001 version will contain a 72-minute audio CD version in response to the requests from tired cancer patients who said they needed and audio version of the book to get started. BCN had sold 110,000 copies in 7 years in print, which is impressive for small publishers. Why Patrick Quillin is Unique: For the past 10 years, Dr. Patrick Quillin has served as the Director of Nutrition for Cancer Treatment Centers of America. He is an internationally respected expert in the area of nutrition and cancer. He has earned his bachelor's, Master's and doctorate degrees in nutrition and is a registered and licensed dietitian ( RD & LD) and Certified Nutrition Specialist (CNS) with the American College of Nutrition.", "title": "Beating Cancer with Nutrition: Optimal Nutrition Can Improve the Outcome in Medically-Treated Cancer Patients", "url": "http://www.goodreads.com/book/show/51276.Beating_Cancer_with_Nutrition", "average": 4.03, "cover": "https://images.gr-assets.com/books/1442460741l/51276.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/28831.Patrick_Quillin", "name": "Patrick Quillin"}, {"url": "https://www.goodreads.com/author/show/877665.Noreen_Quillin", "name": "Noreen Quillin"}], "type": ["Health", "Nonfiction", "Health", "Food and Drink", "Health"], "outlinks": ["http://www.goodreads.com/book/show/51276.Beating_Cancer_with_Nutrition", "http://www.goodreads.com/book/show/18815065-beating-cancer-with-nutrition", "http://www.goodreads.com/book/show/34212293-beating-cancer-with-nutrition", "http://www.goodreads.com/book/show/4492722-beating-cancer-with-nutrition", "http://www.goodreads.com/book/show/102780.Honey_Garlic_and_Vinegar", "http://www.goodreads.com/book/show/7015088-wisdom-and-healing-power-of-whole-foods-the", "http://www.goodreads.com/book/show/2000825.The_Healing_Power_of_Cayenne_Pepper", "http://www.goodreads.com/book/show/956704.The_Diabetes_Improvement_Program", "http://www.goodreads.com/book/show/3402056-amish-folk-medicine", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}