{"ratings": 628, "userreviews": [{"userName": "Josh Stallings", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/4685410-josh-stallings", "userReview": "I better like it, i wrote the damn thing."}, {"userName": "Marvin", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "There is nothing quite like the cold taste of gun oil on a stainless steel barrel to bring your life in focus. From the first sentence of Beautiful, Naked, and Dead, you know that Moses McGuire is not your average smart-ass crime noir anti-hero. Mo just might blast himself out of existence by the next few pages. He's the kind of guy that places \"Find a reason to live\" as number one task on his daily \"to-do\" list. He's out of luck, up Shit Creek, has only one friend, and that friend will resemble the title of this book before the first chapter is over.Charlie Huston fans and Joe Lansdale aficionados should be rejoicing for Josh Stallings fits right into that category of dark, rough crime fiction with a sharp witted edge. BN&D is one hell of a debut novel and should open a lot of eyes to just how powerful this genre can be. Stallings' protagonist is unique because he is as reluctant as they come not just to his misadventure but to life in general. The death of his friend gives him his reason to live but everything is tenuous in this story and the reader is never quite sure who will end up on top. The author's powerful prose keeps things hopping and I especially love his real-life description of a Los Angeles that is hidden from the sight of most eyes. For pure visceral beauty and excitement, this shoots up to my number one pick for best novel of 2011."}, {"userName": "Patrick O'Neil", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/1316664-patrick-o-neil", "userReview": "Suicidal tough guy, dead stripper, lap dances, cute dog, drug use, heavy drinking, awkward sex scenes, and thugs of all persuasions – what more could you ask for? Josh Stallings' protagonist Moses McGuire put's the anti in antisocial. He's a thug with a heart of gold that wakes up contemplating sticking a gun in his mouth and offing himself every morning – well, the mornings that he's not kicking the shit out of someone. And then there's the fact that he talks to himself, like a lot, and oddly there is nothing more personifying than a strip club bouncer doing a near constant self-depreciating monologue accompanied by a soundtrack of '80's punk that'll make you kind of actually like the guy (kind of) – and that's just the first chapter. But that's all you're getting form me, I don't want to give it away. Just go read Josh Stallings' Beautiful, Naked & Dead. Why, you ask? As if all that wasn't enough? Well, how about because it's fucking cool as shit, that's why. Ok?"}, {"userName": "Ian Ayris", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/4996524-ian-ayris", "userReview": "Blimey. Where to start? I'd heard great things about Josh Stallings and his debut novel, BEAUTIFUL, NAKED & DEAD. Great things. And when I eventually got round to reading it, I realised why.BEAUTIFUL, NAKED & DEAD is narrated by the protagonist - Moses McGuire - battle-scarred veteran of the Beirut streets of the late seventies, now a bouncer in an LA strip club, with a penchant for drugs, alcohol, and lap dances. One you could take home to your mum, ladies. Added to this, Moses has almost no sense of humour, is so dour he called almost be Scottish (apologies to my Scottish friends, there) and spends much of the book not caring whether he lives or dies. When we first meet Moses, he's not in the best of places . . .'As an adult I have found that a barrel in your mouth forces you to pause, take a moment, ask that all important question. How did my life get this fucked? If I don?t need anyone, why am I so lonely? At least I like to think it was that deep, fact was I had a bone numbing hangover, a throbbing head and a fur covered tongue. The gun was on my dresser and if I had any aspirin they were all the way in the bathroom.Thumbing back the hammer of my snub nose Smith & Wesson .38, it clicked into place. Three pounds of pressure on the trigger would drop the hammer onto the primer, igniting the 4.5 grains of smokeless gunpowder. The resulting explosion would drive 158 grains of lead at 1085 feet per second out of the barrel, plowing up through my pallet, through my brain and out the back of my skull. Sure, it seems like a lot of complex engineering just to end one life, but it was the simplest thing I could come up with at the time. Idiot. All I had to do was hang around lon enough and people would line up to do the job for me.'As a reader, I like to be able to emotionally invest in a character. Even if the character doesn't care about themselves, I need to care. And I cared about Moses from the very first. You see, Stallings has this way of writing, this brutally stunning way with words that rips a character right open in front of you - shows you it all - blood dripping, heart beating, the darkness aflame. What you get when you peer into the spaces between the terse words of Moses McGuire is the sort of man who will throw himself in front of a cannon to save those he loves. Indeed, he spends much of the book doing so. The heart that beats within Moses McGuire is strong is strong enough to beat for a thousand broken people. This, people is not the pantomime heroics of a Jack Reacher.Moses McGuire is the real deal.The book itself rips along at a breakneck speed, taking in the seedy side of LA Raymond Chandler could only dream of putting into words. Stallings is much closer to a James M.Cain than a Raymond Chandler, in my opinion, and his gritty evocation of the seedy side of the LA underbelly beats Chandler's brilliant one liners hands down, as far as I am concerned.Since I have started taking my own writing seriously, I find it very hard to read a book without that little editor in me thinking 'why did he use that word' or 'that doesn't make sense' or 'it would have been so much better if . . .' etc. I'm forever tripping up on misused or overused words, plot holes, rubbish descriptors, weak characters, etc. In most books, I find something. In some, loads. In BEAUTIFUL, NAKED & DEAD, I found nothing. If the days of our lives moved along on wheels of justice, Moses McGuire would be the leader of the free world, and Josh Stallings would be its poet laureate.BEAUTIFUL, NAKED & DEAD is brutal and it is magnificent. And you need to read it.NOW."}, {"userName": "Tfitoby", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "Could easily sit within the modern pulp novels put out by Hard Case Crime, Beautiful, Naked & Dead is a by the numbers update on the golden age of the stories about outsiders with a death wish caught up on investigating the death of a friend/lover/family member with revenge in mind. Moses McGuire is Frank Miller's Marv with Kelly and Cass his Goldie and Wendy. The only difference between Miller's story and the central plot of Beautiful, Naked & Dead is that Moses is irresistible to every single woman he comes in to contact with, except for the angry Hispanic dyke cop, and every male character either completely respects him or is trying to kill him. It gets old pretty quickly, and McGuire is a complete moron of a character. At one point Moses clashes with seemingly himself twenty years in the future right down to his response to interrogation with the threat of death, and he doesn't even notice the irony of the similarity, whilst the plot is driven by a character telling him \"I'm not who you think I am\" before being found dead and it takes McGuire about 180 pages before he starts to realise that there were things about the girl that he didn't know and perhaps she wasn't who he thought she was.Yes, there's some great stuff in here, wonderful hardboiled dialogue coupled with a tough, no nonsense attitude that makes for sporadic reading pleasure but it sure could do with, at the very least, a copy editor."}, {"userName": "Johnny", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/1865024-johnny", "userReview": "This is one of the best books that I've read this year. No question. If there are any publishers out there reading this, you should put that coke back in the drawer and call Josh Stallings. Trust me, you want to be in the Josh Stallings business. This guy has crazy skills.Lean, but with depth. Violent, yet human. BEAUTIFUL, NAKED & DEAD shines as a perfect example of what can still be done within genre work. While it embraces many of the conventions, it also finds its own way with humor and pathos. Any fan of the genre will recognize the tortured soul that is Moses McGuire, a damaged man in search of his own morality.A different story, but this book reminded me a lot of Ted Lewis' GET CARTER in the tone and atmosphere, although Stalling incorporates considerably more humor into his writing.Looking forward to the next installment, but first I'm going to have to catch my breath."}, {"userName": "Josh", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "Josh Stallings, much like Moses McGuire (the protagonist of Beautiful, Naked & Dead) kicks some serious ass in his debut novel about a slain strip club barmaid and her knight in rusty armour. Exploring the crime underworld of adult entertainment, BN&D takes the reader on a journey from East L.A to Sin City and all manner of clubs and brothels in between as Moses seeks a form of vengeance as natural to the ex marine as breathing. As mobsters and would be tough guys fall, blood flows equal to alcohol in this not stop noir induced romp of pure action and brutality. Bare witness as Moses unleashes a torrent of hate fuelled rage cinematic in its beauty, criminally good in its execution - 5 Stars."}, {"userName": "Michael", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/4447095-michael", "userReview": "You know what, forget Moby Dick and A Tale of Two Cities because Beautiful, Naked & Dead by Josh Stallings has one of the best opening lines of a book I’ve ever read: “There is nothing quite like the cold taste of gun oil on a stainless steel barrel.” If that doesn’t pique your hard-boiled interest then this might not be your genre. If it does, then take the phone off the hook and cancel your plans because once you get past that opening sentence you’re not going to want to talk to anyone or go anywhere until you’ve finished reading.Moses McGuire is a forty-three year old ex-marine and ex-con standing at a dead end. A child of the ‘battle zone’, he works as a bouncer at a strip club when he needs the money, which is pretty much all the time. Moses is damaged and teetering on the brink and he wakes up every morning wondering if that’s the day he has the nerve to check out. Yes, it’s bleak, dark and depressing but sometimes that’s life. At least it is in Stallings’ gritty and violent world. It isn’t until Mo gets a call from a close friend who works at the club that he finds a reason to get up in the morning. If you want more of a synopsis than that you’ll have to get it elsewhere because I don’t want to spoil any story developments for you.One bit of advice - two actually; the first is to go out and get this book and the second is to not make my mistake and casually add it to your reading pile. I read books in the order I get them and when I got a copy of Beautiful, Naked & Dead, I just added it to the bottom of the pile where it waited its turn. Don’t make that same mistake. Get this one and start reading it immediately. And I’m talking like walking-to-your-car immediately. Even if you’re driving, read it. You can drive with one hand and hold the book with the other and read at red lights.Beautiful, Naked & Dead is written with raw power and authenticity and Moses McGuire is one of the most compelling noir anti-heroes I’ve read in some time. If it’s true that authors get better the more they write, then we have a lot to look forward to from Josh Stallings.Oh, and trust me on one thing, when I get the sequel, Out There Bad, it’ll go right to the top of my reading pile."}, {"userName": "Ctgt", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "I tossed the nasty plastic gun to the big boy and watched them drive away, wondering what the hell was wrong with the youth of today. Hell, when I was their age, I never would have let some old fuck get the drop on me.Stallings has been on my radar for a couple of years now and I'm finally getting around to reading this first Moses McGuire book. This is the type of story where there are no good guys, you have MosesI was a ship without a rudder, and a questionable moral compass to guide meI hated computers, they made me feel stupid and old. I was an analogue man living in a digital ageand a few other characters who have a redeeming quality or two and then you have the bottom feeders. Two bit hoods, local mob and crooked cops.In between drinking and contemplating suicide, Moses works at the local strip club as a bouncer and finds a couple of toughs trying to shake down some of the girls.(See above quote) He heads to the local mob boss, Don the Pope Gallico to make sure he's not stepping on any toes before he rousts the guys.The Pope;These Armenian pricks have some balls, huh? If it was ten years ago, I'd just take them off the count and call it a day. New York wants us to make peace. They're trying to strike a deal with the Russians. This is the golden age of mergers, huh kid?andNow this crap in my territory. If it's sanctioned, bodies got to drop. Let a man shit on your lawn, he'll be screwing your wife by nightfall.Moses has a strange sort of big brother relationship(with unrealized hopes of more)with Kelly, a waitress from the club and after receiving a call from her and later discovering what happened to her, he decides his mission in life is to right those wrongs done to her.Booze, sex, violence and drugs fuel this story that moved at a great clip and introduced some great new characters. I'll definitely be checking out more of this series. Recommended for crime or thuglit lovers.A shower, a cup of coffee and some food in that order, and death to anyone who tried to stop me."}, {"userName": "Rose", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/7891507-rose", "userReview": "I'll tell you this right upfront - this is a man-book. There is no lovely romance, no beautiful poetic prose, in fact there isn't anything remotely lovely in here at all. There's no sci-fy, fantasy, or post apocalyptic world. It's a straight-up, no fluff story about a guy who finds his friend dead and makes a promise to find out who killed her. It was great. The characters are straight out of the slums. I don't know how true to life they actually are - I'm not one to hang out at strip clubs or with members of the mob - but they seemed fairly authentic. Everyone here was part of the underbelly of society and one of them, Moses McGuire, was trying to do right by his murdered friend. Things don't end that well - remember this is a man-book - but it ends fairly OK considering the lives these people lead. If you're looking for a straight-up good story that keeps you flipping pages, this is your book!"}, {"userName": "Benoit Lelièvre", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/3634428-benoit-leli-vre", "userReview": "I powered through this baby in seventy-two hours. While it's not perfect, Moses McGuire is the most charming and gritty character I've read in a LONG while. Josh Stallings brought his protagonist to life with a secret alchemy that he shares with the greatest writers. Quite unique and enjoyable, consider me a fan. I've been told that OUT THERE BAD out does this one on every aspect, so expect a review soon."}, {"userName": "Karen Fowler", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/4985963-karen-fowler", "userReview": "First, let me say that I was more-than impressed with the caliber of writing in this novel. Stallings has a first-rate way with the written word, so much so that I found myself wanting to highlight passages while reading - a rare occurrence with me and one that speaks volumes towards the exacting prose. I'll skip the synopsis, because that's what blurbs are for. Told from the perspective of the novel's main character, Moses, the language is clean, cutting and often insightful. It's been a while since I've read a book with such a complex and flawed character (read: REAL) and at times I could practically hear his voice in my head as the story was told. There are some seedier elements in this novel, a couple of adult situations, but they are not numerous, nor are they just there for gratification, it's all just part of Moses' life. I'd be hard pressed to name another novel where the central voice was as authentic as it is in this one. I'll be on the lookout for other works by Stallings, because I know this isn't just a one-hit wonder and more great book will follow."}, {"userName": "Katie", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/5089432-katie", "userReview": "“We were all children of the battle zone. Growing up in violence you learned to duck and weave, you learned how to read the signs and become whoever you needed to be to keep from getting wacked.”Stallings’ Moses McGuire is a great anti-hero - he’s a damaged, ex-services, ex –con strip club bouncer, packing a punch. He’s the exact kind of guy you shouldn’t like but you just can’t help yourself, he’s smart and noble and he’s smack bang in the middle of a murder investigation of his one and only friend.The storyline is fantastic, with enough twists and well choreographed fight scenes to keep the pages turning. Beautiful, Dead and Naked is full of insight to the dark, anything-goes, underworld. Stallings has created a Travis Bickle/Patrick Bateman character who stays on this side of crazy long enough to be a good man. A great read."}, {"userName": "Julie", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/5779942-julie", "userReview": "In Moses McGuire, Josh Stallings has given us a new hero. Battle-scarred, cynical and suicidal, frequently drunk and a regular dry-humper of strippers, he might not sound like the sort of person you’d see coming to the rescue, but don’t be fooled: Moses is one of the most loyal, decent and moral people you’ll meet (certainly between the pages of this novel).In Beautiful, Naked and Dead, Moses is an avenging angel, albeit one with a pocket full of drugs and bullets. It’s a long, hard journey he takes us on, and it’s one hell of a ride. Buckle up and brace yourself - you won’t want to miss a thing.It’s hard to believe this is Josh Stallings’ debut novel. Not only is he a terrific story-teller, he’s one hell of a writer."}, {"userName": "Bill", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "This is the first book in the Moses McGuire series, Moses being the main character. He is a 43 year old bouncer at a strip club and is one of the shoot first, ask questions later types. In short, a real tough guy.In this book, one of the girls at the club who is a waitress, not a stripper, is his only real friend. So when she gets raped and murdered, he is hellbent on revenge. This is what you could call a real hard-boiled crime novel. And as such, there is a LOT of violence and some fairly graphic sex, so if you don't like those you better not read this. But I found it very entertaining, with almost non-stop action, and very well written as well. So it's on to book 2 for me."}, {"userName": "Kathryn", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/5664164-kathryn", "userReview": "A bouncer, stripper, hooker, some mob guys, feds and of course, a whole LOT of guns. Moses MacGuire didn't know what was coming the day Kelly called for help, but he went to her rescue anyways. In walks Cass with a whole different story of what's going down and the ball rolls downhill faster from there. This is a fast paced, keep you on the edge of your seat, great story. Off the beaten track for what I normally read, I was quite surprised. I'm definitely reading the next story."}, {"userName": "Elizabeth A.", "userReviewDate": "Apr 07, 2011", "userURL": "http://www.goodreads.com/user/show/2146364-elizabeth-a", "userReview": "Forty-three year old Moses McGuire wakes up every day with a decision to make: go to his job as a bouncer at a strip club, or kill himself? The job at the strip club is relatively new, he got that shortly after being released from prison, but the thoughts of suicide aren’t. In fact, as Moses recalls it he was six years old the first time the thought seriously crossed his mind.Somehow he made it another thirty-seven years down a rugged road without topping himself, but not without hitting a few major potholes along the way. Medically discharged from the marines for “almost constant drinking and general insanity,” Moses has served time, picked up more than his share of battle scars from bar fights, is in debt to his ex-wife and his bookie, and has been cut off by his dealer for passing a bad check. (“Hell, what kind of dealer takes checks anyway?”) That suicide option looks better every morning.And the morning we meet him at the start of Beautiful, Naked & Dead may well have been the day, until Moses gets a phone call from one of the girls at the strip club asking for his help. Not just any girl, actually, but the one person in the world Moses considers a friend. When she doesn’t show for their scheduled meeting Moses goes to her apartment, where he finds she’s been brutally tortured and murdered. The one good thing in his life having been taken from him, there’s going to be Hell to pay for those responsible, as well as anyone foolish enough to get in his way.He may be a Scotch drinking, pill popping, strip club frequenting, suicidal ex-con of Viking ancestry (complete with red beard and body “built for wielding a battle-axe”), but Moses nevertheless has an unquestionably rock-solid moral compass. Unfortunately for him, in Beautiful, Naked & Dead following his moral compass leads Moses into a storm of nearly biblical proportions, landing him in the middle of a turf fight between Armenian and Italian gangsters, and in the way of both the local police trying to solve his friend’s murder as well as Federal agents working the organized crime angle. They in turn threaten Moses with everything from torture to death to prison, but what none of them seem to understand is that Moses neither fears their guns nor respects their badges. He’s a man on a mission with nothing to lose, and be it with fists or guns, Moses doesn’t care how much blood he has to shed to get the answers he wants.Author Josh Stallings is masterfully understated in his handling of the seamy underworld that is sex for sale in America, a topic around which a large portion of the story revolves. Whether dealing with the comparatively benign strip clubs like the one where Moses works, the legal brothels in Nevada where Moses’ search takes him, or the rough business of exploitation pornography that rears its ugly head, Stallings brings each to life in a very matter of fact manner. Gangster or stripper, cop or ex-con, the characters in Stallings’ world are neither heroes nor victims, deserving neither admiration nor pity. They are simply people struggling, with varying degrees of success, to make their way through the world to the best of their respective abilities.As I was reading Beautiful, Naked & Dead I marked passages that I thought I may want to quote in this review. In looking back at my notes, however, I realized that if I used everything I marked I’d basically be quoting you half the book. Stallings’ prose is that tight, engaging, and memorable. In fact, Beautiful, Naked & Dead is the poster child book for those who love good writing, especially hard-boiled crime writing, to wave as they rage against the publishing machine that gives contracts to people like Snooki while authors who really have the chops and who are paying their dues, authors like Josh Stallings, are somehow left out in the cold.Moses McGuire is an uncommon lead, but a fitting one for a book that has an uncommon mix of brutality and beauty, sex and love, hate and humor, hopelessness and hope. Uncommon though it all may be, however, under the skillful hand of Josh Stallings it not only works, it makes perfect sense. Make no mistake about it, Beautiful, Naked & Dead is big league crime fiction, and by all means you should step up to the plate … you’d just better seriously dig in when you do because Stallings is bringing the heat."}, {"userName": "Dave", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/27137-dave", "userReview": "It can be hard writing book reviews some times even if it is for a book you loved. Ultimately it's worth it though. I get the satisfaction of having produced something and every once in awhile I get something out of it, like being turned onto the works of a new writer. That's what happened several months back when Josh Stallings approached me about his debut novel, \"Beautiful, Naked & Dead.\" Stallings believed that because I was a fan of Charlie Huston's work I would like his work as well. I just finished Stallings' first novel and I had to say he was absolutely right \"Beautiful, Naked & Dead\" was a hell of a debut novel.The protagonist of the novel is a big man named Moses McGuire. He's extremely good in a fight, but that's because he's been fighting his entire life. When we first meet him the mental scars from all that fighting are starting to be too much and he's considering suicide. A panicked phone call from his one and only friend makes him reconsider. He then heads to the strip club where he works as a bouncer to try and help his friend. A chance encounter with some vicious thugs though causes him to miss the meeting with his friend and when he goes to find her he discovers she's been horribly murdered.That death triggers something in Moses. It sends him racing across California and Nevada in a desperate quest to find and destroy his friend's killers. During his search he uncovers a web of violence connecting the mob, internet porn, and federal agents. As we the readers accompany Moses we uncover what makes him tick and why he is the man he is.In Moses, Stalling has a deeply flawed and fascinating hero. He's haunted by a life time of violence. It's made him a suicidal, alcoholic who consumes speed to stay awake on long journeys. He's a deeply loyal guy though who's true to his word and guided by righteous fury. As a reader you root for Moses in his quest to slay both the bad guys and his personal demons.Along the way you also meet a variety of interesting supporting characters like the strippers that dance at the club where Moses works. Piper was my favorite; a fierce red head who tries to be a friend to Moses. Other interesting supporting players include a laconic street thug named Gregor and Leo, a veteran soldier for the Chicago mob.Moses' interactions with these and various other characters are often funny, tragic, powerful, or exciting depending on the nature of the scene. Stallings shifts between these moods expertly and paces his novel just right. And like the best crime fiction you get an ending that make you feel that you really took a long and meaningful journey with a character. I look forward to taking more journey's with Moses McGuire too. I recently picked up Stallings's second Moses McGuire novel, \"Out There Bad\" and look forward to reading it."}, {"userName": "Pearce Hansen", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/1214213-pearce-hansen", "userReview": "Chandler wouldn't recognize Stallings' L.A., but Raymond would definitely FEEL modern LA from Josh's descriptions. Chandler looms large over every mystery writer -- where would we be if he hadn't invented the mode wherein a tough, lonely private man opens up his innermost feelings to us the voyeuristic reader, as he never would to anyone in real life? But the very best of Chandler's descendants make the style and the poesy their own, unique -- and so it is with Josh Stallings' debut effort, Beautiful Naked & Dead.I feel like I've come late to the party here, as I'd been hearing good things about it for a long time but only just now got around to. And boy am I glad I did, it's one of the best books I've read in quite a while. Moses McGuire is a leading man to root for; a guy who's hit every patch of rough road life has had to offer him, and bears the scars to prove it -- but a fiercely moral man, protective of the innocent and loyal to his own uncompromising code.The background scenery is poetically delineated (but not TOO poetically: just enough to be evocative and distinctive, without being affected). The characters and their interpersonal interactions are three dimensional and believable. The story itself was a mad dash of peeling onion skins, with unexpected plot twists and break neck action. In the parlance, this was a real page turner that kept me glued to my Kindle asking over and over 'And THEN what happened?' until the very end.This is a great book, beautifully written by an author that brought a lot of heart to the keyboard. If it has any fault, it's that it had to end. I'm buying the sequel, Out There Bad, as soon as I'm done posting this review."}, {"userName": "Valentina", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/4197862-valentina", "userReview": "This was one of those books that could have easily been published in the traditional manner, making you wonder what some of the publishing houses out there are thinking. Thankfully, there the self-pub route is available, otherwise, we’d lose a lot of good books by the roadside.The plot is fast and fun, a thriller of the best sort, with lots of twists and a pervasive sexual undertone that goes well with the gritty images of mob bosses and drug pushers. There is not a single boring moment. It is tightly written so there is no extraneous information. It was obviously carefully written and edited, making it a powerful story. A punch in the gut. It’s interesting to see the atmosphere in strip clubs, it’s not a usual setting for a book, and yet it is written with care, trying to avoid the clichés that come along with it.The main character, Moses, a bouncer at a strip club who feels like he has to find out what happened to his friend, Kelly, is a surprisingly captivating person. He starts off a bit on the flat side, but as the plot moves along he starts acquiring layers that make him a believable character. We begin to sympathize with him in his struggles. Cass, the female protagonist, is a feisty one, with great dialogue and many, many coy moments. A good complement to Moses.For anyone that likes a good thriller, this book is a good choice."}, {"userName": "Darren Sant", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/4175288-darren-sant", "userReview": "Moses McGuire is depressed. He's so depressed that he's considering ending it all. However, his delivery of hot lead to his grey matter is rudely interrupted by a call for help from a friend. Moses jumps on his trusty Norton and heads over to the strip joint where he works to rendezvous with his damsel in distress.Beautiful, Naked and Dead is the literary equivalent of a Tarantino movie. You have all the ingredients needed: Mobsters, wise cracking characters, fast cars, girls and guns. However, Josh Stallings delivers so much more with this novel than a film could. You believe every single line his characters deliver. There is intelligence to the characterisation that transcends novels usually found in this genre. The crowning glory is Moses himself. Stallings has created not only a truly three dimensional character here but some of snappiest dialogue and downbeat wisdom come from McGuire’s stubborn cranium. This novel was also, perhaps, the best edited e-book I think I've come across. There wasn't a wasted line or word in it. The next time the literati look down their collective noses at this genre I will, with a smug smile, withdraw from behind my back a copy of Beautiful, Naked and Dead and defy them to find fault with it. This ladies and gentleman is quite simply a benchmark to aspire to. Stallings pick up your phone that's Tarantino on the other end with film options."}, {"userName": "Jerry Grahs", "userReviewDate": "Apr 21, 2013", "userURL": "http://www.goodreads.com/user/show/18871373-jerry-grahs", "userReview": "Meet marine corp vet, ex-con, suicidal strip club bouncer Moses McGuire. If you read one unknown author this month or year for that matter, make it Josh Stallings. The dude can flat out write and has created a noir character worthy of some of the classics characters in the genre. Stallings' slow rolls the plot in favor of developing McGuire's character and really allows you to get into his mind in a way that you rarely see today in the noir genre. I won't give you plot details, you can find those elsewhere. In my eyes, the plot is secondary here anyway - and at times is a bit lacking (and thus the four vs five stars)...as you become less interested in the twists and turns then the inner workings of McGuire's mind. Stallings seems to know the trails that McGuire travels pretty well and is definitely a talent to watch. I know there is a follow-up McGuire book and I hope there will be many more down the road."}, {"userName": "Michael", "userReviewDate": "Apr 28, 2011", "userURL": "http://www.goodreads.com/user/show/4917543-michael", "userReview": "I was really impressed with this novel from the beginning. The main character Moses is fully fleshed out from page one, and I loved the story of him getting thrown in this crazy world. This book was like when you are expecting a nice kiss from your grandma but instead she grabs the back of your head with both hands and head butts you! With a high body count and a unique set of characters this noir novel stands out from any first novel I've ever read. The real crime here is it's only 2.99 for the kindle so WHY HAVE YOU NOT BOUGHT IT YET! Another quality that stood out wasn't just the violence(which was awesome) or the story(which also was awesome), but a lot of the insights into life and society that I found to be brilliant. If you like your stories Intelligent and bloody than you are doing yourself a disservice by not picking this up. I cannot wait until the second book!"}, {"userName": "Michael Leffel", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/14226542-michael-leffel", "userReview": "A true hard boiled crime novel, Moses (the protagonist) could be called down on his luck, if he had any where to fall. He only has his personal honor and not a lot else. Moses begins as a very unlikable character but quickly grows on you like jock itch, 1/2 way thru you really like him and root for him. When you ain't got nothing you ain't got nothing to loose, but when one of his friend gets murdered its to much for Moses and the adventure begins. But what will he do as he get things that are worth keeping?This was a phenomenal read."}, {"userName": "Richard Godwin", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/5097867-richard-godwin", "userReview": "Hard as nails narrative that never lets up. Josh Stallings has created an ambiguous anti hero in Moses, who, though tough as they come, has a more developed character than your average tough guy. The novel resonates with despair and low life. Excellent read."}, {"userName": "Sabrina Ogden", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/5027720-sabrina-ogden", "userReview": "Prior to reading Beautiful, Naked & Dead by Josh Stallings, I hadn't dreamt about a book I was reading since my Oscar Martello reading days right before Christmas. I was starting to think I'd lost my, uh... touch, for lack of a better word. I mean, it's not like I can will a character into a dream. In fact, my one and only dream about Oscar Martello didn't even have Oscar Martello in it. Moses McGuire on the other hand... ﻿****Having never been in a club that featured GIRLS! GIRLS! GIRLS! I was doing a pretty good job at blending in. My skirt was short and tight. My hair was teased to perfection. My make-up was immaculate. My music choice was hard-core 50 Cent with the perfect thump, thump, thump. My pole dancing skills were flawless.Wait a second. Flawless?Ah, man! The beginning of this dream is a nightmare of catastrophic proportions. Me, in a nudie bar with perfect pole dancing skills? Ya, right! I can't walk in a straight line sober. What on earth made me think I could try my hand at pole dancing... even in a dream?****﻿Well, before we get back to that, let me tell you about this book I found on the twitter feed. It was pushed on us really, really hard by my friend @McDroll (This is how we address ourselves on twitter. I'm @sabrinaogden). Anyway, @McDroll read this book written by this guy, @LysdexicWriter (Josh Stallings), that she found on twitter and totally loved. So she pimped it and talked about it until we were all forced to buy a copy. Then an amazing thing happened. People started reading it, people started talking about it, and people started falling madly in love with the main character, Moses McGuire. True story. Read the reviews on Amazon. In Beautiful, Naked & Dead by Josh Stallings, you'll meet Moses McGuire. Moses is an ex-marine, an ex-con, and an ex-husband in debt to the ex-wife and ex-bookie. He's also been recently cut off from his drug dealer for passing a bad check. The guys got a new career as a bouncer at a strip club, and for the most part, well, let's just say he takes his job pretty seriously. Moses is pretty miserable and he's pretty much made a mess of his life, but the one thing that I think keeps him going from day to day is the one woman at the club that isn't a stripper. Her name is Kelly, and she's the only light in his world that is covered in darkness. True darkness. Moses has been considering suicide since he was six years old. And at the very beginning of Beautiful, Naked & Dead we read about his personal day to day decision to either live, or die. In the story you'll read about Moses getting lap dances, popping pills and taking too long to come to the aid of the one woman that seems to matter the most to him, Kelly. After you read that, you'll learn of Kelly's brutal death and Moses going kick-ass crazy on the guys that did it. You'll also meet Kelly's twin sister, and read about a totally screwed up and, thankfully, brief romance. But most importantly you read about Moses. My guess will be that you will fall in love with him like so many of us already have. And while you're reading, you'll find that Moses is just as modest about his good looks in the book, as the author Josh Stallings is about his writing. Maybe it's the modesty from both men that's making all the women nutty. I don't know. All I know is that I read this really incredible book with an amazing character and story line and that all I've wanted to do is read more about this character and encourage and support this author with his writing. It truly is an amazing book. Hard-boiled, dark, full of suspense and fast cars, this is a debut novel with a character that can be stuck on repeat for years without me getting weary. Seriously. I didn't call Moses hubba-hubba superlicious in a previous post for no reason, ladies. As for the dream...I'll leave that to your imagination."}, {"userName": "Julia Madeleine", "userReviewDate": "Apr 17, 2011", "userURL": "http://www.goodreads.com/user/show/4221507-julia-madeleine", "userReview": "In Josh Stallings debut crime novel, Beautiful, Naked & Dead, we meet Moses McGuire a depressed, hard drinking, aging ex-con, and ex-military guy, on the edge of suicide. When he gets an urgent phone call from the one woman in the world he considers his only true friend, Kelly, a waitress at Club Xtasy in East L.A., the “titty bar” where Moses works as a doorman, Mo puts all thoughts of doing himself in on the back burner. Kelly is in some kind of trouble and needs Mo’s help. But Mo, being as broken as he is, and trying hard to overcompensate by playing pseudo daddy-hero to the women at the strip club he sees as lost little girls in need of care-taking, bungles the one time that his heroism really matters. Instead of running straight to Kelly when he realizes she’s not at the club, he stalls, has a few drinks and a quickie lap dance while she’s being brutally tortured and murdered. Mo manages to pull his damaged self together and decides to track down the scumbags responsible for killing her. He sells his motorcycle, buys an old Crown Victoria, and a goes on a road trip—a no holds barred, take no prisoners, kill em’ all, rampage. And it’s a hell of a fun ride all the way. I must admit, in the beginning of the story, I wasn’t fond of Mo and his dark, brooding personality, with all his weaknesses, but slowly he began to grow on me. Somewhere toward the end of the book, I decided I loved him. Maybe it was the barbarian inside of him that, when push comes to shove, Mo is able to release and accomplish something good. Good? Well, depends on how you look at it. Mo is a completely well rounded character, and Stallings does a fantastic job of making him come alive. Josh Stallings hits you with both barrels in this gritty, bad-ass, crime-drama. This book is sick!"}, {"userName": "Lisarose", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/1917785-lisarose", "userReview": "I'll I admit it: I'm the author's sister- Warning my review is probably biased- That said I'm so proud of the kid; it's a great read and a hell of a dark ride. Beautiful Naked and Dead is classic hard-boiled detective fiction in the tradition of Ramon Chandler and Water Mosely. Moses McGuire, the protagonist, is the archetypal wounded knight- The poor sucker has a fierce moral code- so wants to do right- but is blinded by rage, wounds, and alcoholism. The first lines of the novel are: \"There is nothing like the cold taste of gun oil on a stainless steel barrel to bring your life into focus\" and the book keeps on punching.Moses's character development throughout the novel is spot on and the description of the seamier side of life in the L.A sex trade and the characters involved in it are vivid and real. The book takes off when Moses sets out to to avenge the death of one of his girls. His quest leads him through the legal brothels of Nevada and finally to a battle with the mob in the mountains above Palo Alto- The plot is fast paced and the underlying mystery is intriguing. Although the book is dark and violent- Moses character is so well drawn- I came to care about him and want to get to know him better."}, {"userName": "Joey Mestrow", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/16902196-joey-mestrow", "userReview": "\"Let us put on manly readiness\". - MacbethMobsters and strippers and hookers and shootouts....oh my!Tony Scott wishes he was still alive to direct this into a feature. It was definitely in the vein of his 1991 film \"The Last Boy Scout\", in the sense that while the story is well layered to serve its purpose, the masculinity of this story is very over the top. In fact, there is not one female character in this novel that is not a stripper or a hooker. Is it sexist? Hell yes. Sexist, with redeemable qualities of the rough characters looking to set things right after the death of a certain someone close to Moses, our scotch guzzling and head-bashing hero with a heart of gold. Told through the eyes of an ex-con/ex-marine/suicidal strip club bouncer named Moses Maguire, this is a world where there are no good people. Only people out to get theirs. I thought this was very well crafted since it is not often that an author manages to turn a two-bit loser and suicidal junkie into a knight in white shining armor. I'm probably going to start the sequel tomorrow.Warning...if you are part of the Oprah book club, this probably is not for you."}, {"userName": "Gareth Price", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/5315952-gareth-price", "userReview": "A ball-crunching tale of what happens when a man with nothing to live for sets out to avenge the murder of a close friend. Moses McGuire is neither a PI, police-man, lawyer or anywhere near legal so goes about the job in any way he can, often with messy, violent consequences. You will end up rooting for Moses even if some of his actions are a bit extreme - if you've read this type of book before you know what to expect yet Josh Stallings manages to keep it all fresh & the pace never stops. You won't want to argue with Mr McGuire, either, even if you don't agree with his opinion of The Clash's London Calling album.Unpredictable, always exciting & very well written this is the sort of book that keeps you reading til the end & then has you wishing it was twice the length. A very fine debut from Josh Stallings who seems to have appeared from nowhere although his bio suggests he has been honing his craft for a while now & it shows in the attention to detail in this book. Good news is that a second Moses McGuire story is out very soon. I, for one, cannot wait."}], "description": "\"Josh Stallings is the kind of writer who shouldn't have to publish for himself, but here he is slugging it out the hard way. Just like one of the hardasses in his own books. The man knows what to do with paper and ink. Read the damn thing.\" -Charlie Huston \"Someone once said of Raymond Chandler that he wrote 'as if pain hurt and life mattered.' That's true of Josh Stallings, too. Hop on, kick the starter, and let him lead you on a long, painful, but entertaining ride through Moses McGuire's world. One hint: wear your helmet and your leathers. It might get messy.\" -Tad Williams BEAUTIFUL, NAKED AND DEAD is hard-boiled crime novel. Moses McGuire a suicidal strip club bouncer is out to avenge the death of one of his girls. From his East L.A. home, through the legal brothels of Nevada and finally to a battle with the mob in the mountains above Palo Alto, it is a sex soaked, rage driven, road trip from hell.", "title": "Beautiful, Naked & Dead\n      \n          (Moses McGuire #1)", "url": "http://www.goodreads.com/book/show/10766272-beautiful-naked-dead", "average": 3.78, "cover": "https://images.gr-assets.com/books/1299821072l/10766272.jpg", "reviews": 92, "authors": [{"url": "https://www.goodreads.com/author/show/4710519.Josh_Stallings", "name": "Josh Stallings"}], "type": ["Mystery", "Mystery", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/10766272-beautiful-naked-dead", "http://www.goodreads.com/book/show/10824157-beautiful-naked-dead", "http://www.goodreads.com/book/show/11830353-out-there-bad", "http://www.goodreads.com/book/show/18752899-one-more-body", "http://www.goodreads.com/book/show/17558941-all-the-wild-children", "http://www.goodreads.com/book/show/27738731-young-americans", "http://www.goodreads.com/book/show/15710579-blood-tacos-2"]}