{"ratings": 2039, "userreviews": [{"userName": "Steph Su", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/2010935-steph-su", "userReview": "17-year-old Jordy--a runaway after coming out to his homophobic parents--didn't know it was going to change his life when he saves a beautiful blond girl from rape. Suddenly he's stuck taking care of Chloe--which is not her real name but is preferred over her real one--who is strangely childlike although incredibly smart and determined at times. Jordy's got problems of his own, too, but he can't help feeling that he must protect Chloe, that something terrible has happened to her and that she is using her childlike disposition to mask her past.An unfortunate string of events leads to Jordy and Chloe heading on a road trip across America, so that Chloe can hopefully learn that it's a beautiful world out there, not just full of abuse and neglect. They see beauty, but they also encounter some terrible things as well...but in the end, isn't that what it's all about? The world is both good and bad, and it's only by becoming part of it that you can truly live life.Catherine Ryan Hyde is an amazingly talented writer. From the start, I was pulled into Jordy and Chloe's predicament, and despite the perpetual air of mystery that hung around the duo, I was able to get to know them very well. Chloe reminds me a lot of Stargirl, only with a dark past that we never get to know. Leaving Chloe's past a mystery may be frustrating, but it strengthens the message of this here-and-now book, which is to live life in the moment and not allow your past to dictate your future. For anyone looking for an uplifting road-trip story that will linger with you for a while, BECOMING CHLOE is THE number one choice."}, {"userName": "Sonya ", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/3484687-sonya", "userReview": "This book was nice.Not my favorite.But it was a good book.Finding the beauty in the world; thats something i'd love to accomplish.But I don't need to travel 1000 miles. Beauty is all around me (:"}, {"userName": "Michelle", "userReviewDate": "Feb 02, 2009", "userURL": "http://www.goodreads.com/user/show/1824225-michelle", "userReview": "This book was beautiful. The idea is that these two homeless kids who've been beat up by life (literally) get together and end up going on a road trip to try to decide if there is enough beauty in life to want to keep living. I was impressed by the author's portrayal of the beauty of nature, the kindness of strangers, and also the carelessness of people and the deliberate cruelty of people to one another: she puts them all in, and doesn't try to make it all good or all bad. I loved the characters and their inherent goodness, and the ending was satisfying and well-written. The letters at the end of the books contain some great quotes about the nature of life."}, {"userName": "John Egbert", "userReviewDate": "Apr 05, 2011", "userURL": "http://www.goodreads.com/user/show/5223517-john-egbert", "userReview": "Edit: Changing the shelves -- Chloe isn't a manic pixie. She's just childish.Edit Edit: I wrote a really fangirlish review and saved it on my comp. I'll post it although keep in mind I wrote it after finishing the book and it will be very, very fangirlish. And since I read this book like a year ago I am also very naive and childish in it. Please no comments on some of the stuff I will say, such as my bashing of N&E's No Kiss List. I decided to post the review uncensored -- a glimpse into what I used to think like.--And the best book of the year award goes to -- Becoming Chloe.I'm sorry, Charles Dickens. I should have given it to you for A Tale Of Two Cities. That really was a good book. But I just couldn't bring myself to do it. After reading this book I still am amazed. I loved it. I'm serious. Jordy's POV is beautiful.I used to not want to read this book, but it makes me want to slap myself in the face. I was lied to. I was thinking this book was focused on gay prositution. Pulheeze. There is hardly any content like that.No description, just a hint to let us know what just went on. That's what I like about Jordy. He's practical, but informitive. Good job, Catherine Ryan Hyde. You, you are a YA author that should be on all best selling lists.I read this book until twelve at night, and every time I thought about going to bed and finishing it in the morning I slapped myself. I read this book all the way to the end and I was satisfyed completly. I loved this book.I want to only give it four stars, but then I'd be a dirty liar. This is a five star novel, and this is why I love to read. Chloe -- I thought she'd be annoying. You probably think she'll be annoying. You're wrong. Her naivitey is played off the best I could ever think. She reminds me of Luna Lovegood in the real word, only more gritty with a horrible past and no loving Xenophellius as her father. She is so innocent, and broken. Like a dead butterfly, completly intact. I know it sounds lame, but it's true. Now, I'm not one to praise books. I mean, I was pretty much hating on all YA up until this point, with the Hush Hush and the Fallen and the Twilight -- but this book makes me want to read more.I will warn you, Jordy is kind of a slut at first. NO, not like that. Only with this one creepy old guy, but he realizes that this is wrong and breaks it up and leaves with Chloe. It's not much of a spoiler.And then there's that creep who offers to give him a real awesome coat (like a black leather trenchcoat awesome) but in exchange for some you-know-what. Jordy considers, and is about to do it but then realizes how sick that would be and he runs away,All of the characters in this book learn from there mistake. Everyone learns something. Even the reader learns something more beautiful than can ever be explained in words. I'm sorry, but it's true.Reading about Jordy and Chloe struggle isn't like Angela's Ashes, another supposedly sad book I skimmed once -- there's just enough pity so that your heart is poured out and mush but so you aren't annoyed. The characters are alive. You are alive.Catherine Ryan Hyde, I think I might love you. And I might just name all of my children after you.I am not just saying this. This is the reason why I still read books. This is exactly the reason.I might not have portrayed the characters as beautifully as I wanted it to seem, or maybe I just didn't get the message through. Or perhaps you're still skeptical and won't read the book anyway. Whatever the case is, I don't give a damn.I read this book cover to cover, and no matter what anyone says or thinks it will be imprinted in my mind forever. I will never forget the story of Chloe and Jordy.Never.---Side note : For those of you wondering if this book is appropriate for kids (or your own innocent eyes) considering the subject matter --Cursing : 6/10The cursing is pretty bad, but no one throws aroud the f-word ten times a page. In fact, I don't think there really is any use of the f-word in this. But that isn't to say there aren't uses of other cuss words.Sexual Content - 2/10I'm serious. There are literally no horrible scenes in this book. It's not just because Jordy is gay and he's traveling with Chloe, a girl, but despite what you're probably thinking there are no vivid descriptions of Jordy getting it on with that creepy old dude. The creepy old dude only appears in like, 5 pages. Seriously. And Chloe doesn't turn Jordy from being gay and then they get together, and Jordy doesn't fool around with Chloe or anything like that. Mostly Jordy just kind of suggests or hints what might have happened after cutting the scene, which is really nice when you really don't want to read anything like that.Violence - 9/10Yeah, it's pretty heavy in this book. Jordy gets beat up only two or three times, but it's still pretty heavy. Plus, he might-have-killed a guy, but he didn't even know himself. It was really unclear. Oh, and Chloe nearly bites his arm off too. That's pretty descriptive.Creepy Gaynesss - 1/10I put this category here for those of you who are either homophobes or a little wary about reading yaoi(aka guy on guy romance). It's okay (being wary about yaoi, I mean...you are a self admitting homophobe maybe you should seek help), because at first I was too. After being scarred by Rachel Cohn and David Leviathan's horrible garbage (Naomi And Ely's No Kiss List was the worst book ever written) I swore to never read any fiction that involved gay people in it again, especially when it featured a girl best friend. Thank God I cast this aside and actually tried reading something new. Thank God. Yeah, there are no squicky squicky sexytiems about, em, things mentioned in Naomi and Ely's Kiss List that I really, really, really don't want to talk about here. You wouldn't even know he was gay if it wasn't for the light prostitution and the occasional reference of a guy who he thinks is really hot. He comes across one gay boy on his travels who wants to get it on, but Jordy (although his mind says yes) says no. In a very mature way. I didn't feel awkward reading this book at all. Even though Jordy is a seventeen year old gay dude I didn't find it hard to empathize with him and feel for him. That's what makes a book.Boring - 0/10I added this category for people like me who have really short attention spans and don't have time for stupid boring books. Well, this book isn't stupid or boring. Seriously. I'd recommend this book to every one I know.AT LEAST START READING THIS BOOK, OR ELSE YOU WILL SERIOUSLY MISS OUT ON SOMETHING THAT COULD AND WILL CHANGE YOUR LIFE.I sound so much like someone paid to say nice things about a really horrible book, but I swear it isn't true. If I could I'd give this book less stars, because I don't know if I really want to give it this many, but this book deserves nothing less of five stars. Nothing less, and I wish I could give it more.---Um, yeah, I might come up with a better and more mature sounding review later but as of now I am just really lazy.See ya."}, {"userName": "Lauren", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/1676535-lauren", "userReview": "Becoming Chloe is one of those books that gives you hope in the world we live in, that even if it fells like the world is crashing down around us sometimes and we're nothing short of loosing it all, there is still beauty in it. Beauty that is endless. Beauty that gives you hope no matter what the situation. From the first page, the reader is thrown into the world of Jordy, a boy who's just about lost it all. He's homeless and has no money to speak, as well as a big cut in his head that he doesn't want to talk about. But that doesn't stop him from reaching out to Chloe, a girl who is so worse of then him, it makes him look privileged. But inside the beautiful, bubbly, and sometimes simple Chloe hides secrets so dark, it's slowly making her loose it all. So Jordan starts operation beautiful world with a mission to show Chloe that the world is beautiful even with the chaos, wars, and murders surrounding them. And off they go on a trip across the country were they'll meet the nice and mean and see the beautiful and ugly. But will Chloe be able to pull it all together by the end? Will Jordan? You'll just have to see. Jordy and Chloe were both main characters I loved from the beginning. Jordy was always the put together one, the adult in the relationship, but yet he had just as much freight and horror in his love Chloe had, leaving me to never cease to root for him no matter what the situation. Chloe, on the other hand, was in most cases the child, so emotionally detached from the world it made you wonder if there was something mentally wrong with her, but at other times she's wise beyond her short eighteen years of life. She also was a character I rooted for from the first and last page and everything in between. The plot of this moved smoothly and never once made me loose interest. Though, the one thing I loved most about it was its ability to give hope to the reader no matter what the situation and make you grateful for the live you have because there's always someone out there worse of than you and beauty still out there to be amazed by. It was just such a great and empowering message! In all, Becoming Chloe is my first book by Catherine Ryan Hyde but it definitely will not be my last. My last words consist of this; Read this book! It's touching, empowering, gritty, and hopeful! A book I feel most should read at least once in their lifetimes. Grade: A-"}, {"userName": "Rick", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/1019632-rick", "userReview": "Stick with this one. It may seem to take a whole to get its groove, but by the end its message of love and redemption are quite profound and touching."}, {"userName": "Karla Mae (Reads and Thoughts)", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/6756923-karla-mae-reads-and-thoughts", "userReview": "Becoming Chloe is one of the books that have been sitting on my shelf for way too long now. Despite my heavy TBR I find myself that time scouring for back titles and was able to pick this one up.Becoming Chloe surprised me. Just when I was expecting a typical road trip story, I was given a powerful story about two homeless teens with dark pasts.\n\n\n“Nothing wrong with the Grand Canyon, nothing wrong with wanting to see the ocean. Nothing wrong with big beautiful things. But sometimes beauty can be some pretty close work.”\n\n\nJordy and Chloe’s life is full of darkness, chaos and war. You couldn’t really blame them when all they can see in this life are the negative ones – the ugly ones. From New York to California, they go on a mission to see the beauty of the world around them. They were able to meet good and generous people, see beautiful places and gets more appreciative day by day on the life that they are living.Jordy oh how I love rooting for Jordy. Despite being on the same poor circumstance as Chloe, he was able lead the two of them on a journey that is literally very hard for two homeless people to do. He remains strong, responsible, and supportive and never fails to uplift Chloe whenever she has her “blue moments”.Chloe is sweet, bubbly and full of energy on the outside but inside she’s full of secrets from her past. She’s not your typical eighteen year old teen – sometimes she struggles with her emotions that makes me think she’s acting like child but sometimes, her words and thoughts makes her seem wiser than her age.\n\n\n“Even if this was the only thing I ever did in my whole life, it would be worth having a life just to do this.”\n\n\nThe story was pretty short and actually started a bit slow for me, but as I finished the first page, it has gripped me. Jordy and Chloe are teens thrown together by bad circumstances yet they are able to look on the bright side and beauty of life and just go on.In all, this story is very empowering and thought provoking. It makes me think that when I feel like I’m experiencing the worst there might be someone out there who are experiencing so much worst than I do, so learn to be strong, find solutions, don’t give up and appreciate all the beauty in life.*For more reviews, please feel free to visit Reads and  Thoughts*"}, {"userName": "H", "userReviewDate": "Feb 22, 2010", "userURL": "http://www.goodreads.com/user/show/3066154-h", "userReview": "This is not what I usually read but I thought I'd try something new and different and I'm glad I did.This book made a whole lot of difference to me. It's one of those books that make you see the world differently like you've never seen it before. Even if slightly. There are so many beautiful things in our world, not just from the exterior but from the interior that we take for granted or not really 'look' at them carefully.Jordy and Chloe are very unique yet relatable characters. I loved how special their relationship is. Like best friends but even more than that.They had met so many nice and lovely people on the way. It's so easy to warm up to everybody with Jordy's narration. They were some strange parts since he sees guys as you know and it feels weird at first but it grew on me by the end of the book. Anyhow, I would've actually loved a totally different ending--perfect, but that doesn't happen in real life, does it? Hyde made it very realistic and true when she chose the path the story took though I would've loved something developed between Jordy and Chloe."}, {"userName": "Akanksha  Singh", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/4596834-akanksha-singh", "userReview": "A very sensitive, poignant read....it was a great break from senseless YA romances with a girl who love TWO guys:-PIt's a story about a guy called Jordan who has left home and is living on the streets. He doesn't have a care in life until one day he rescues a girl from being harrassed. The girl, Wanda who doesn't like her name and on Jordy's suggestion changes it to Chloe, seems very innocent, she doesn't know what's happening to her and yet sometimes she surprises Jordy with displays of extraordinary brilliance. She has witnessed horrors and she has seen all her nightmares come true. And in order to block out all that agony she chose to forget.....an amazing story where Jordy sets out to free Chloe from the anguish and trauma and show her that everyone's not bad.....a journey of redemption and an attempt to defeat their pasts.....A must must read!!!Oh i forgot to mention the best part, the guy's gay so its NOT a love story!!"}, {"userName": "Danielle Frost", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/38753146-danielle-frost", "userReview": "This story was just so sweet and lovely, it does make you realise there are more beautiful things in the world even when you think everything in the world is falling around you.I liked this book more because it wasn't a love story it was an unlikely friendship and it was beautiful. They grew a bond you couldn't break and he stuck by her no matter what and helped her more than anyone else would.A lovely short read, I would recommend it to anyone"}, {"userName": "Rebecca McNutt", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I honestly thought that this book would turn out to be just a bad romance novel between a ditz and some guy she meets. I stand corrected; Becoming Chloe is amazing! It's a book that proves that everyone in the world has a story to tell, and that to be happy isn't just popping antidepressants or going to therapy, it's about doing what you love and following your dreams with the people you care about the most. This is a book everyone needs to read at least once, it's excellent!"}, {"userName": "Sydney", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/23753671-sydney", "userReview": "**3.5 STARS**I'm conflicted about this one. This was a pretty cute book; it was nothing that special though. Personally, i think it took way too long to pick up, but when it did it was okay. Most of the time I was just waiting for something significant to happen, but at some times it really was such a beautiful story. Overall, the book felt a little childlike to me, but at certain points when the deeper side of things were explored, I really enjoyed those moments."}, {"userName": "Madilyn", "userReviewDate": "Mar 23, 2010", "userURL": "http://www.goodreads.com/user/show/3486004-madilyn", "userReview": "I love love love this book. I read it in the midst of my teen angst and it opened up a whole new world of happiness for me. Catherine Ryan Hyde is an amazing writer to check out if you like the stories of troubled youth who learn and teach and grow through others."}, {"userName": "Lisa Bryant", "userReviewDate": "Apr 21, 2015", "userURL": "http://www.goodreads.com/user/show/4281523-lisa-bryant", "userReview": "3.5 This is a hard book to review. Sweet and beautiful in some ways. Dark and disturbing in others. Overall I really liked it."}, {"userName": "Gerry", "userReviewDate": "Jul 29, 2016", "userURL": "http://www.goodreads.com/user/show/227726-gerry", "userReview": "I'm rereading Becoming Chloe right after the first reading.There is so much in this book! I don't really know what to write about it for fear of giving things away."}, {"userName": "Mona Lisa (ForestGreenReader)", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/43295264-mona-lisa-forestgreenreader", "userReview": "I first read this book when I was in middle school. It was the first book I read that explored the idea of suicide, it also helped develop my yearning for travel.The writing is very simplistic, so are the characters and character development. But it's simple in a nice, heart warming way. I immediately liked Jordan (I too get easily attached to others, and somehow become the mother figure in my group of friends), and I also adored Chloe. It was nice seeing them travel by any means, meeting amazing people- but their trip wasn't always happy-go-lucky.This is quick read. But if you're a person that sometimes forgets to take a breather and have a look at the world we're all living in (despite all the ugliness) and remember there's beauty still here- I recommend this book for you."}, {"userName": "Kathy Oaster", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/31452232-kathy-oaster", "userReview": "Jordy and Chloe are both homeless and living in New York City. They meet during a horrific event and become close friends. Jordy decides to help Chloe deal with her difficult past by traveling across the United States to look for the beauty in the world. Jordy, although doing it for Chloe, learns about beauty himself during the journey. He realizes that most things can be looked at as beautiful. Chloe, on the other hand, sees that many things can be taken more than one way....for example, rain makes the trees grow, but too much can cause flooding. Fire can keep you warm in the winter, but can also burn your shelter down.----The book mentions rape and homosexual relationships, but these are not described in detail and are necessary for the overall story."}, {"userName": "Kathleen DuVall", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/52525647-kathleen-duvall", "userReview": "I read this book while sitting on the beach in St. Martin and it made me remember once again what a wonderful life I have. Not that this was so dark and deep but that there are people who have had it so much tougher and seem to find a way to find some beauty in the world. Jordy and Chloe were two of those lucky people who find someone in their life to accept them the way they are, no matter how imperfect and love them anyway. I too have that in my life but I'm fortunate to have not gone through what they did to find it. They also met a lot of very gracious people on their journey that renews my hope for humanity."}, {"userName": "Kailey", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/41856482-kailey", "userReview": "I absolutely loved this book. It really spoke to me and inspired me. I think it spoke to me in ways I don't even know, because I just finished it and I'm sitting here crying and I really don't know why. This book inspired me to see the beauty in EVERYTHING no matter my situation. It inspired me to love people and really how far a little act of kindness can go. It inspired me to travel and take risks, because why not? The world is crazy, beautiful, and terrible all at once. At the same time, I don't have to travel to learn what they know, even though I want to, I can find beauty right here and right now. But soon, I want to just get rid of everything and travel."}, {"userName": "Barbara Hughes", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/43758528-barbara-hughes", "userReview": "Because I work at a high school library, I often read YA books so I can recommend them to my students who might be interested in certain books. I'm sure that young adults would relate to this book, but I felt it was a bit of fantasy. Possibly this could really happen, but probably not. This author uses all kinds of social situations in her books and I do enjoy her enlightening me on situations I have not and most likely will never be in. But our students have lots of these same life situations and it helps me understand them better so I can possibly help them by showing them with books that they are not alone. Someone else is just like them and can identify with them."}, {"userName": "Pat", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/1107203-pat", "userReview": "Top Notch AuthorCatherine Ryan Hyde is a fabulous writer. I've read so many of her books and haven't come across one that hasn't touched me. Jordy and Chloe travel across the U.S. With literally just the shirts on their backs. They meet all kinds of beautiful people along the way."}, {"userName": "Mary Peake", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/37051378-mary-peake", "userReview": "Started but almost stoppedAuthor always takes on significant subjects, which I like. The subject of this boom was so far from my comfort zone that I almost put it down. Very dark and very sad. But as I read on my eyes were opened to some awful places! But finished reading it and it finally have me some hope"}, {"userName": "Kathy Charniak", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/26235392-kathy-charniak", "userReview": "MemorableI loved this book. It showed me that there are good people in this world. Jordan loved and took care of Chloe. He didn't have to but he chose to,like she was his little sister. Chloe was kind and gentle. I believe she was an empath,sensitive to people and animals. I enjoyed their journey together. Memorable."}, {"userName": "judy petiton", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/50452825-judy-petiton", "userReview": "Good readAs always Catherine Ryan Hyde delivers. This book did not hold my attention like some of her others and it took time to connect but all in all it is another of her exceptional books!"}, {"userName": "Rachel Holt", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/65581404-rachel-holt", "userReview": "I read Becoming Chloe for the first time years ago, but I found that I have greater appreciation for it now that I'm older. It may be a \"young-adult\" book, but it deals with pretty mature themes and hits deeper the older you are."}, {"userName": "Aaron", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/31888340-aaron", "userReview": "This novel is recommended to those who have personal experience with being abused as a child in horrific manners. This novel has the ability to bring closure to those who are struggling to overcome their hurt pasts."}, {"userName": "Rick Sanchez", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/73837189-rick-sanchez", "userReview": "Why couldn't they have said what was wrong with Chloe? I was kinda hoping to find out why she behaved the way she did."}, {"userName": "Megan", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/9378730-megan", "userReview": "Easy, young adult novel with some pretty heavy topics. I enjoyed the story mostly for their cross country adventure which stirred my wanderlust."}, {"userName": "N Rowe", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/46379571-n-rowe", "userReview": "The happy and sad of Jordy and ChloeAnother wonderful story from Catherine Ryan, she knows people and life and the world and she writes so well about them."}, {"userName": "Siri", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/17172289-siri", "userReview": "Always enjoyable. Loved this one."}], "description": "Meet Jordy. Heâ€™s on his own in New York City. Nobody to depend on; nobody depending on him. And itâ€™s been working fine.Until this girl comes along. Sheâ€™s 18 and blond and prettyâ€“her world should be perfect. But sheâ€™s seen things no one should ever see in their whole lifeâ€“the kind of things that break a person. She doesnâ€™t seem broken, though. She seems . . . innocent. Like she doesnâ€™t know a whole lot. Only sometimes she does.The one thing she knows for sure is that the world is an ugly place. Now her life may depend on Jordy proving her wrong. So they hit the road to discover the truthâ€“and thereâ€™s no going back from what they find out.This deeply felt, redemptive novel reveals both the dark corners and hidden joys of lifeâ€™s journeyâ€“and the remarkable resilience of the human soul.", "title": "Becoming Chloe", "url": "http://www.goodreads.com/book/show/229490.Becoming_Chloe", "average": 3.88, "cover": "https://images.gr-assets.com/books/1397277185l/229490.jpg", "reviews": 184, "authors": [{"url": "https://www.goodreads.com/author/show/126447.Catherine_Ryan_Hyde", "name": "Catherine Ryan Hyde"}], "type": ["Young Adult", "Fiction", "Realistic Fiction", "Lgbt", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/229490.Becoming_Chloe", "http://www.goodreads.com/book/show/2879835-becoming-chloe", "http://www.goodreads.com/book/show/8493201-becoming-chloe", "http://www.goodreads.com/book/show/215631.Pay_It_Forward", "http://www.goodreads.com/book/show/6780660-when-i-found-you", "http://www.goodreads.com/book/show/19355355-take-me-with-you", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/33389838-allie-and-bea"]}