{"ratings": 992, "userreviews": [{"userName": "Andrea Guy", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/1887553-andrea-guy", "userReview": "Beyond All Measure is a beautiful Christian historical romance that is full of the color of the time period. The story is set in Hickory Ridge Tennessee shortly after the Civil War. Dorothy Love paints a rather good picture of how things were in the south at that time.Ada Wentworth had traveled to that small town to be a companion to Lillian Caldwell. Lillian is one of the highlights of the book. She's such a spunky, fun old lady. She's a wonderful curmudgeon at times, and at others she's totally sweet.It is hard not to love Wyatt Caldwell, as well. He's the kind of hero we all want. He's kindhearted, loves his family, is loyal. Even when sparks fly between him and Ada, you want these two together, and since it is a romance, you know it will happen eventually.I've been reading more Christian romances lately, but this one really stands out as a good one. Why? Religion is part of the story, but it isn't the whole story.Each character has been hurt by things in their life and they grow to love and trust, even after they make some bad choices.This is a book that just about anyone can read and enjoy! I'm looking forward to the next book in the series."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "He Whose heart is kind beyond all measureGives unto each day what He deems best -Lovingly, it's part of pain and pleasure,Mingling toil with peace and rest. - Carolina Sandell Berg, \"Day by Day\" (C. 1865)A broken heart is a difficult thing to bear. Even worse is the ability to let down the walls that we build up to protect the wounds from being hurt even more, while hopefully allowing the heart to mend. Yet in that process, we fail to realize what our actions are really doing. They set us apart from allowing others to see what we truly are like, and block the ability to ever really love and trust again.Ada Wentworth is looking for a way to begin again. Vowing a personal covenant with herself, she promises to stand strong, become an independent woman and never trust the love of a man again, no matter how kind or attractive he may be. Hickory Ridge, in Tennessee offers her that hope again. Answering an ad in the paper for a ladies companion, she hopes to work long enough to save up the money to move back to Boston and start up a hat shop of her own. Healing from a broken heart, she has hardened herself to everything and everyone including God. Determined and strong-willed, she resolves to do whatever it takes to make it on her own, without the help of anyone, no matter how her heart still hurts inside.Wyatt Caldwell is the local lumber mill owner, whose ad, Ada has come to answer. Living a bit far away from town, he is looking for someone to care for his aunt Lillian Willis. Since the mill has been busy, Wyatt has built a home near the mill and therefore, needs someone to look after Lillian while he is gone for most of the day. The only problem is that Lillian Willis, is herself set in her ways, strong-willed and cantankerous. She knows just about everyone in town and has an opinion on everything. Not only that, but she has some spells that may just about push poor Miss Ada back to Boston.What surprises await Ada when she steps off the train and into the hearts of the residents of Hickory Ridge, and what danger also looms under the cover of darkness that may end things for her before she has a chance to find love again.I received Beyond All Measure by Dorothy Love compliments of TLC Book Tours for my honest review. Being a huge fan of western romances with a twist, this one was a delight to read. I loved the characters that she develops and makes the readers have a real relationship with them. Ada's so determined to not let anyone in, she fails to see the truth that lies right before her eyes at times. Lillian has to be my favorite, being so blunt and honest, she doesn't hold back when something needs to be said. That being said, this book rates a 5 out of 5 stars in my opinion and can't wait to continue the story in the next book in the Hickory Ridge Romance series."}, {"userName": "Renee", "userReviewDate": "Nov 09, 2010", "userURL": "http://www.goodreads.com/user/show/2965894-renee", "userReview": "The years following the American Civil War were a tumultuous period, especially for the South. Author Dorothy Love has managed to capture the unrest, the struggle to rebuild lives as well as issues of prejudice and racism all the while weaving in a sweet romance. Hickory Ridge, Tennessee, meets Boston, Massachusetts, in this inspiring story of finding ones faith in troubling times and perfect love.The first thing that came to mind when reading this story was in spite of how different 1871 was compared to today's world some things never change. The spirit of community and the everybody knows everbody's business is something that will never change and in that aspect this book was very authentic. One thing irked me near the end of the story and that was the punishment or lack there of of one of the characters. Without giving too much away she nearly assaulted a main character but no charges were ever pressed. The character who did not press charges struck me as one who would have wanted justice and to protect others, not leave a person who was a danger to society run free.The romance also left a bit to be desired. I felt Ada and Wyatt were always arguing (no, not the romantic tension kind of clashing, just flat out not getting along) and all of a sudden Wyatt was proposing. It seemed a bit forced. I must say however, that I'm really looking forward to what happens next for some of the characters especially the orphan girl, Sophie and Carrie, the widow. I can't help but hope for Sophie to grow up and find her own love and for Carrie to finally move past her grief. The little peeks into their lives in Beyond All Measure have definitely whetted my appetite for more. For a first inspirational Ms. Love has definitely done well and I'm sure will do nothing but improve with her sophomore novel, Beauty for Ashes.*I received my complimentary review copy from the publisher through Booksneeze.*"}, {"userName": "Heather", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/7946816-heather", "userReview": "Beyond All Measure by Dorothy Love is a wonderful book about a young woman from Boston who finds herself in Hickory Ridge Tennessee in the years following the Civil War. In the summer of 1871 Ada Wentworth has no family, no home, and no money to her name. Ada accepts a position as a lady's companion for the elderly Lillian Willis, aunt of the local lumber mill owner, Wyatt Caldwell. Ada plans to save up enough money to establish her own hat shop with the millinery skills her mother taught her.With unanswered questions from her past, Ada is guarded but finds herself drawn to Wyatt, a Texan with big plans, and Sophie, a mulatto girl who lives at the local orphanage. The problem is that Ada's friendship with Sophie attracts attention from some townsfolk who want to displace Two Creeks, a settlement of \"colored\" men and women at the edge of town. Tensions rise but Ada is determined to help Sophie.When Lillian passes Ada is left without employment or a home. And now that his aunt has passed Wyatt is free to return to Texas to start his dream of owning a ranch. Can Ada let go of her past and trust god with her future? Can she let go of the betrayal of another to trust Wyatt with her heart?This is a book that I really enjoyed. I am currently working on several books, and you know when you are drawn to put other books down that you've found a keeper. Beyond All Measure if definitely a keeper. I enjoyed the main characters, but I really liked the secondary characters. They were not left behind while the story centered on a select few. This is a great read.This book also had a discussion guide at the end, good for personal reflection or a book club. Thomas Nelson has provided me with a complimentary copy of the ebook for review purposes."}, {"userName": "Laura", "userReviewDate": "Sep 26, 2011", "userURL": "http://www.goodreads.com/user/show/2603986-laura", "userReview": "Beyond All Measure by author Dorothy Love is a beautiful, well-written novel set in 1871. If you love historical romances - you will love this book!Ada Wentworth has lost her family, her fiance and her fortune. She feels betrayed by those she loved and has a hard time trusting anyone. In dire need of money, she answers an advertisement in the Boston Herald to take a position as a ladies companion to an elderly woman. Unfortunately, some people in the small town of Hickory Ridge, Tennessee, are finding it difficult to accept a \"Northerner\" in their midst and Ada begins to think she has made a big mistake. Especially when she discovers that her job would require more than she had bargained for. But, things aren't all that bad for Ada. Her employer, Wyatt Caldwell is attractive, kind and more than a little interested in her. Can Ada let down her guard and trust her heart to someone again?I love discovering new authors! While Dorothy Love is not new to some, she is new to me and I'm so glad she contacted me to review her book. She has fleshed out her characters so well that I could picture them quite clearly. Love captured the feelings of prejudice and bigotry in the South, not only toward those of a different colour, but toward those from the North. To place her character who was from the North in a setting where she was the former enemy kept me wondering who the villains were in this piece. In fact, I was so involved with this book I couldn't put it down and finished it in two days! She absolutely stunned me with the ending too. I didn't see it coming.The mixture of romance, suspense and the overall feeling of historical accuracy left me feeling well satisfied at the end of this book. I give it 5 out of 5 stars!"}, {"userName": "Laura", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/1603322-laura", "userReview": "Looking for a fresh start after the death of her father and the end of her engagement, Ada Wentworth flees to Tennessee to become a companion for an elderly lady and to start working on her dream of making hats for ladies. What she finds in Hickory Ridge is a small town divided by prejudice in the aftermath of the Civil War: prejudice against black people and Yankees. To further complicate things, Ada seems to be falling for Wyatt, the nephew of the woman she cares for. Can she become a successful businesswoman without losing her heart? Or is the price worth it? I enjoyed this book. The time of the Civil War has always been of interest to me (I even took a whole class on it in college), and I liked the way Dorothy Love handled the topic of race and regions and the prejudices people have towards one another. It was a great side storyline in addition to the romance. Ada and Wyatt are great characters (I’m a character-driven reader). Sophie, a young orphan girl who is racially mixed, and Lillian, the stogy old lady Ada cares for, are excellent supporting characters and breathe a little humor into a tough time period. The plot was well-developed and was realistic for that time period in American history. I was surprised when the person terrorizing Ada was revealed, but I won’t spoil that for you. This was the first book I’ve read by Dorothy Love, but I will check out her other books. I recommend this book for any Christian fiction fans.I received this free book from Booksneeze for the purpose of reviewing. My thoughts and opinions are my own."}, {"userName": "Cheryl", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Ada Wentworth has left Boston to come to Hickory Ridge, Tennessee. Ada wanted to see the country. Thus why she applied to be a woman companion. When Ada arrives at Hickory Ridge, she has second thoughts. To make matters worse, the other woman who was to help assist Ada with her job has left town. Now Ada is all alone in a town with no money to get back. There is just one bright spot, her employer…Wyatt Caldwell. Wyatt owns the local lumber mill. He has not seen anyone as beautiful as Ada. Wyatt starts courting Ada. Ada agrees that the feelings are mutual but Wyatt has made it clear that he plans to leave and go to Chicago. Ada wants to leaves as well as soon as she can gather enough money to go. Thus why she will not give into her feelings for Wyatt. Ada wants to start up a hat shop. Her mother taught her how to make fashionable hats.Beyond All Measure is the first book in the Hickory Ridge series. This book was good. It may be labeled as Christian Romance but the messages are subtle and not in your face. This brings me to my next point…Wyatt and Ada. Cute couple but not a lot of romance between the two. It seemed that every time that they got together, they would argue. Wyatt’s Aunt Lillian was someone that grew on me. At first I didn’t like her. She was grouchy and mean to Ada but the more that I got to know her, the more I liked her. The people of Hickory Ridge were an eccentric bunch. They added favor to the story. Some of them I liked and some I did not. Overall, this book is a nice start to this series."}, {"userName": "Carly", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/2390389-carly", "userReview": "When I think about Christian historical romances, there is a certain feel, writing style, mood, setting and story flow that I really hope to find. I may not find all of my favorite elements in a certain book, but I do like to see some of them. Beyond All Measure had everything that I love about historical fiction. I adored this book! Dorothy created a exactly the kind of book I want to read and read often.The first thing I liked was the writing. Dorothy writes with an excellent flow that just moved this story very quickly and kept my attention on this absolutely charming story. Beyond All Measure was one of those books that I did not want to end. There was just something about this story and these characters mixed in with the setting of Hickory Ridge that completely delighted this reader.I also liked the time period this story takes place in. Taking place in the South soon after the Civil War ended as the South continues to heal made this story historically interesting. The difference between the world Ada comes from and the world Wyatt comes from made for some interesting, not to mention tense, moments. But the romance of this story was sweet and the subtle Christian message was uplifting. Beyond All Measure was a wonderful book, one of my favorites for this year. It was such a pleasure to read it and I am very anxious for the next book in the Hickory Ridge Romances series. Dorothy Love is a great addition to the world of Christian fiction."}, {"userName": "Holly (2 Kids and Tired)", "userReviewDate": "Oct 18, 2011", "userURL": "http://www.goodreads.com/user/show/584266-holly-2-kids-and-tired", "userReview": "Having lost her fortune, family and fiance during the Civil War and its aftermath, Ada Wentworth answers an ad for a position as a lady's companion and finds herself in Tennessee, a long way from Boston. While her greatest desire is to own her own millinery shop, she realizes she must first fund it and Wyatt Caldwell wants her to put her full attention toward caring for his crotchety aunt. Ada also has a painful past and must learn what it is God wants her to do. Naturally, Ada and Wyatt are attracted to each other, but a jealous school teacher wants Wyatt only for herself.I enjoyed watching Ada and Lillian's relationship grow and it was refreshing to see the townspeople begin to soften towards Ada as they put aside their Yankee prejudices. This is a book packed full of adventure and experiences and the KKK aspect and overt racism brought a different perspective. Beyond All Measure is a charming, clean Christian novel. While I enjoyed the novel, I found some of the characterizations a bit extreme. However, this is a story that does draw you in and I'm glad to know it's the first of a series. I look forward to the next installment."}, {"userName": "Abbie", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/4270443-abbie", "userReview": "3.5 Stars Ada takes a job in Tennessee as a ladies companion because she is broke and has no where else to turn. Her goal is to save her money and make hats for a living like her mom did. Lillian is the older lady she is working for and not so easy to get alone with. On her first day there she meets Wyatt who is the nephew of Lillian. He is the owner of the local lumber mill. Wyatt has never meet someone quite like Ada. He finds himself starting to care for her. Ada had a bad break up with her former fiancé and does not trust Wyatt at first. Soon some strange things start to happen that make them work together. Will these two find true love? This book was pretty good. I thought the subject of the KKK and racism was an interesting side story to this book. I felt the mixture of romance and suspense was well placed. It did get a little slow in the middle but over all I enjoyed this book. The ending was a little predictable but enjoyable. If you like a historical Christian romance with a little suspense thrown in you should check this book out.http://abbiesreadingcorner.com/2011/1..."}, {"userName": "Elizabeth", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/15264985-elizabeth", "userReview": "I have found a new favorite author! I absolutely loved this book.Historical fiction at its finest. Like the first it kept me intrigued.Kept me reading past my bed time more than once. I liked that that the characters possessed strong Christian values.Great read! Looking forward to reading more in the series. *Please be aware this story takes place in the south and does have some kkk involvement/violence FYI for the younger readers."}, {"userName": "A.M. Heath", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/32030349-a-m-heath", "userReview": "I'm a huge fan of post Civil War fiction. I'm a huge fan of a book with a Tennessee setting. I'm now a huge fan of Dorothy Love. Mrs. Love has won me over with her attention to detail, lovable characters, charming town, and accurate historical setting. I'm looking forward to more from Dorothy Love!"}, {"userName": "Rachel Brand", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/572197-rachel-brand", "userReview": "Daughter of a prosperous Bostonian family, Ada Wentworth never thought she’d find herself travelling south with all of her worldly belongings packed into a single trunk. But when her family fell on hard times and she found herself orphaned and penniless, Ada was forced to take up a position as a companion to an elderly woman in the flourishing town of Hickory Ridge, Tennessee. Despite her reservations about residing in the South so soon after the end of the Civil War, Ada needs to escape Boston. She doesn’t plan to put down roots in Hickory Ridge, merely stay there long enough to acquire money to start her own millinery business and support herself through the talent that her dying mother taught her. But soon Ada finds herself swept up into the daily life of this small town, and even coming to care for Lillian, the aging woman who isn’t ready to let go of life just yet. As she and Lillian slowly come to live with each other’s faults and forge a friendship, Ada also opens up to Lillian’s nephew, Wyatt, who also plans to leave Tennessee as soon as possible, dreaming of starting a farm back in his native Texas once his lumber mill becomes prosperous enough. Both Ada and Wyatt know that it would be inconvenient to become too attached to each other, but events conspire to bring together. Particularly when someone appears to be targeting Ada and Lillian. Is it the Klan, concerned about Ada’s treatment of the local African-American community, and keen to make the Northerner leave their town? Or is someone jealous of Ada’s relationship with Wyatt, the most eligible bachelor in Hickory Ridge? Just when Ada starts to think about settling in the town she’s come to feel at home in, disturbing occurrences make her wonder if she’s really welcome there at all.As soon as Ada stepped off the train in Hickory Ridge I knew that I was going to enjoy this book. Dorothy described the town so vividly that I could imagine every shop and house. Once the scene was set, the inhabitants of the town were added to the picture, creating a wonderful backdrop for the story. There aren’t a lot of books where I can really engage with the setting as I did in Beyond All Measure, and it’s definitely a sign of a good author to be able to evoke the feel of a place without detracting from the plot of the novel. It took me a few chapters to warm up to Ada, whose background and reasons for moving to Hickory Ridge remained mysterious, but once the friendship between her and Lillian developed her story made for an engaging read. Ada’s ambitions to open a millinery shop and support herself made her a very unique character, in a period when women mainly desire marriage and families, and the descriptions of her hat-making were fascinating. The relationship between Ada and Wyatt is slow to develop, and hindered by Wyatt’s scepticism over how much Ada truly cares for Lillian. Believing that Ada is prioritising her hat-making business over looking after his aunt, Wyatt initially has no desire to develop any sort of relationship with Ada. But despite this, the two end up bonding over their fondness for the aging Lillian and the fact that they’re both technically outsiders in Hickory Ridge, with neither of them planning to remain in the town once Lillian has passed away. Their relationship brought up interesting questions about compromise and what you would be willing to sacrifice for the one you love. While I initially felt that the growth of their relationship was a bit disjointed and perhaps got sidelined by other events in the novel, there was a conversation between the two of them at the end of the novel which injected a lot of realism into their romance and really evoked what I feel a loving relationship is about.Alongside her developing romance with Wyatt, Ada encounters problems with the Klan, who are keen to evict the local black population and claim their land for themselves. Ada upsets them when she tutors a mulatto orphan and is seen fraternising with other people from the black settlement. Some of the locals already dislike her because she’s from the North, and she doesn’t improve her reputation by her attitude towards their African-American neighbours. I felt that Dorothy was able to paint a realistic picture of post-Civil War Tennessee without making it seem as if all Southerners were racist slave owners, but also without falling into the other trap of every character being a secret abolitionist and everyone embracing racial equality. Instead, she created a believable image of the occupants Hickory Ridge: some were members of the Klan, some merely wanted the land that the black community lived on, and others were apathetic. Ada herself, while wanting to help Sophie to get an education in spite of the difficulties her mixed-race parentage caused, did not express any other feelings about abolition or racial equality, which I felt was quite realistic. I read this book well over a week ago, and in hindsight I’d have to say that what stuck in my memory most was the way that Dorothy painted a picture of the town and its inhabitants. She certainly has a way with describing locations and allowing them to interact with her characters. But I can’t help but realise that although I can clearly remember the setting, the characters and the subplot about Sophie, I’m struggling to recall the details of Ada and Wyatt’s romance. Even as I was reading the book, it felt disjointed in places and it didn’t seem to flow entirely naturally. I did thoroughly enjoy this novel, but I feel that it is strongest in its descriptions and characterisations, but perhaps a bit lacking in the romance department. However, this is Dorothy Love’s debut, and when that is taken into consideration, I think it’s an excellent into the historical fiction genre. I hope that her writing continues to improve as she creates more tales about Hickory Ridge. 8/10"}, {"userName": "Deb", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/15558418-deb", "userReview": "This was a GREAT book. Dorothy Love sets the stage so you can picture the surroundings. However, she does not over describe the setting. The characters are very believable. I would love to see this made into a movie as long as they stick closely to the book. On to Book 2..."}, {"userName": "Elizabeth", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/5553732-elizabeth", "userReview": "This was a beautiful story from start to finish. I loved every minute spent reading it, and each of the characters I got to know in Hickory Ridge. The tender romance between the two main characters built upon a sweet, \"dear friend\"ship. Just the way it should be."}, {"userName": "Lydia", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/6600735-lydia", "userReview": "I really liked the setting of the story-Tennessee after the Civil War, split by racial and other tensions. The characters were intriguing, however, I felt Ava's hesitancy toward romance to be weak and brought down her likability."}, {"userName": "Lisa Morrow", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/7803880-lisa-morrow", "userReview": "Loved it! Starting the second book!"}, {"userName": "Gerrie", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/7757620-gerrie", "userReview": "3.5 out of 5 stars"}, {"userName": "Paula-O", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/3327000-paula-o", "userReview": "My first time to read a book by Dorothy Love and I will read more, I am always happy to find a good Christian author and stories that feed my soul. I esp liked the words by Carolina Sandell Berg \"Day by Day\" He whose heart is kind beyond all measure gives unto each day what he deams best-- Lovingly,its part of pain and pleasure, mingling toil with peace and rest...Hickory Ridge Romance series book #1 \"Beyond All Measure\" written by Dorothy Love.I liked the beautiful cover and content did not disapoint me.I hope you will take time to check this author and her work.The story is of Ada a proper Bostonian who travels to Hickory Ridge Tennessee after her father and an aunt have died, she was devastated when a beau broke their engagement and left town suddenly which left her skittish as a colt about any other men in her life. Ada had been offered a job as a ladys companion, a job she felt she could do though she had few skills. She was an educated young woman and had traveled to Europe at one time.She likes the pretty little southern town nestled into the foothills of the Great Smoky Mtns but she planned to stay only long enough to make monies for her dream of owning a millinery shop...Wyatt Caldwell is the nephew of Lillian, a woman who speaks her mind but has a heart of gold, Lillian is not well and needs someone to help her with daily chores and also to be a companion.Wyatt owns a lumber mill and has to be the most honest and kind young man around, he is a handsome young man that has been a great help to his aunt and remembers fondly his youth when this aunt had been a great help to him. He meets Ada at the station when she arrives and he likes the way she looks and acts almost immediately. after some time he is sure that God has brought Ada into his life and that she is to be part of his future...Ada soon finds out her job entails lots more then just being a companion, she soon learns to like this fiesty little woman and doesnt mind the chores she must do to help out. Seeing Wyatt often doesnt hurt much either -although she is not looking for a man in her life.As the South struggles to heal in the aftermath of the civil war, a woman must let go of her painful past that she might embrace God's plans for her future. Is there to be a future for Ada& Wyatt. Read and enjoy this wonderful story by Dorothy Love."}, {"userName": "Bookworm1858", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/2807605-bookworm1858", "userReview": "3.5/5I really loved the cover for this with that lovely purple and the hat. I personally don't like wearing hats but I am interested in seeing other people wearing hats such as the lovely Ada Wentworth, main character in this book, and of course that is appropriate for the time period.Ada is a destitute Bostonian who takes a position as a companion to the elderly Lillian in Tennessee. Upon her arrival, she is shocked to discover that her job is even more grueling as she will be maid, cook, and nurse to Lillian. She is also surprised by Lillian's handsome nephew Wyatt, lumber mill owner, the smallness of the town despite its flourishing in tough conditions, and the presence of the nascent KKK and its intolerance for black people and Northerners. She is also haunted with \"whys\" in regard to her father's mismanagement of money and a broken engagement.I mostly liked the characters although Lillian has a difficult temperament and there's another character who was very grating and outright mean to Ada. And as a Northern, I have soft feelings for someone who is from the North who is trying to make it in the South, especially in the post-Civil War years. Wyatt is a good man, who cares for his family and longs for the land of Texas. The clashes between Ada and Wyatt at the start were interesting (Wyatt was kind of a jerk and unable to understand the difficulties of being a poor woman without a male protector).While I liked the main characters, I thought the KKK aspects and the villagers' bigotry was shoehorned in a bit awkwardly although I appreciate the attempts to include them. I guess I thought they could have been more menacing and I didn't entirely buy that most of the characters we met denounced the KKK. Seriously? But it is Christian romance so I understand why those elements wouldn't be played up enough.My least favorite part came when Ada's ex-fiance shows up and reveals the secret behind why he broke their engagement. I spent much of the book waiting for him to arrive because he was obviously going to show up and push her toward Wyatt although that whole sequence of events happened even faster than I had anticipated.Overall: An okay historical romance; the faith elements were lovely though."}, {"userName": "Victor Gentile", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Dorothy Love in her new book, \"Beyond All Measure\" Book One in the Hickory Ridge Romance series published by Thomas Nelson takes us to Hickory Ridge, Tennessee in 1871.Ada Wentworth has been attacked by life. She has lost her family, her fiance and her fortune and now feels that the only person she can rely upon is herself, certainly not God. So she has traveled to Hickory Ridge to be a lady's companion to Lillian Willis, an elderly woman not in good health. Wyatt Caldwell is the local lumber mill owner and Lillian's nephew. Ada eventually wants to open her own millinery shop and stay in Hickory Ridge, Wyatt wants to return to Texas and start his own Longhorn ranch. How will this relationship ever work out?Dorothy Love has woven some very complicated themes into \"Beyond All Measure\". There is the theme of racism as Ada gets involved with Sophie, a mulatto girl who resides at the Hickory Ridge orphanage. Tensions rise as group of locals seek to displace the residents of Two Creeks, a \"colored\" settlement on the edge of town. Hickory Ridge is a town set in a time just after the Civil War where the people are just trying to figure out how to rebuild after the war. Not only the town but each other as well. Ms. Love is an excellent writer and makes all her characters believable and you care deeply for them as she deftly unfolds the plot before us. This is a nice romance with great themes. Ms. Love has given us a great beginning to a wonderful series. I am looking forward to the next book.If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book free from the publisher through the BookSneeze®.com  book review bloggers program.. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Staci", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/177641-staci", "userReview": "First thoughts when I finished this book: \"I can't wait to visit Hickory Ridge again!!!\"I loved this book...it was such an enjoyable read for me. I was hooked by the end of the first chapter. I found myself eager to pick it up and get it finished because I wanted to know what was going to happen next for Ada.I love this character that the author created. She comes from a life of comfort but realizes that if she doesn't learn how to take care of herself no one else will. She's been disappointed in life by her father and ex-fiance and her trust is hard to earn. The cantankerous Lillian was a character I immediately loved. Why? Because she reminded me of my own Grandmother! Even though both of them had very irascible personalities, beneath that tough exterior there were caring hearts.I adored Wyatt! He was such a true gentleman and I believed in his character. The historical aspects of the Civil War, the aftereffects that it had on not only the soldiers that fought and lived, but also the impact it had on towns and livelihoods of those who lived in them.Great story with plausible characters and the dialogue came across very authentic to me.Recommend? If you're looking for a solid love story with a little bit of faith sprinkled within the pages then I highly recommend this book. There is no Bible thumping going on in this story. The author writes about the faith that these characters had and I feel that she did a wonderful job of making the dialogue sound credible. I don't think it's out-of-place at all for an older woman to read the Bible daily, nor do I find it out of character that she would advise Ada to trust the Lord. Nothing was heavy handed....quite subtle and it worked for me!I'm looking forward to reading more books that take place in Hickory Ridge!"}, {"userName": "Margaret Metz", "userReviewDate": "May 18, 2011", "userURL": "http://www.goodreads.com/user/show/3220021-margaret-metz", "userReview": "I really looked forward to this book and was not let down at all. The inside is as wonderful as its cover. It's amazing to me that this is Dorothy Love's debut novel. Now I can't wait for her new book, Beauty for Ashes. :o)The characters are what make a book come alive for me and this has some gems. Ada is a southern belle by birth who grew up in the north. She wants to be independent, has the drive to start her own business, and a sort of stubborn pride that gets her into trouble on more than one occasion. She also is refined, doesn't know how to cook well, or drive a team of horses. She is smart, compassionate, beautiful and haunted by hurts and mysteries from her past.Lillian is demanding, intelligent, and driven. She doesn't want to be cared for by anybody and resents that age and illness have made that necessary. She loves Wyatt very much and wants the best for him - and is very dedicated to other charitable causes as well. She loves God and encourages Ada to trust Him.Sophie is like the perfect accessory to an outfit. In a way, I think her character made this book. She is a beautiful mulatto orphan girl Ada becomes attached to. She is a talented storyteller but not getting any education. Ada's relationship with Sophie bring out all the turmoil the city has been going through and shows both the best and worst of Hickory Ridge.Then we come to Wyatt. He's handsome, funny, charming, dedicated to Lillian and very good at his business. He's still bothered by memories of the war and nurses resentment towards the person who ruined his father. He's very generous and normally fair-minded but he can be stubborn.I fell in love with the people in Hickory Ridge and can't wait to read more about them in her next book. This one goes on my favorites list. I hope you'll put it on your list if you haven't read it already."}, {"userName": "Liz", "userReviewDate": "Nov 24, 2015", "userURL": "http://www.goodreads.com/user/show/27398857-liz", "userReview": "I recently discovered Dorothy Love, so I've been \"backtracking\" and reading some of her earlier books. I enjoyed this romance from the post-Civil War south, but I have to admit it didn't have the depth or pace of her latest book, A Respectable Actress. Still, I liked it enough that I'm looking forward to following the characters in the second Hickory Ridge Series book. Ada Wentworth is a young woman looking for a fresh start after losing her parents, her financial standing and her fiancee. All she has left is her dream of becoming a hat maker. She answers an advertisement and becomes a live-in companion to a crochetty old widow who conveniently has a handsome and prosperous nephew. Wyatt Caldwell also has a dream, and it doesn't include marriage or staying in Hickory Ridge - he wants to return to Texas and become a rancher. These two young people are predictably but delightfully thrown together around Aunt Lil, and sparks fly. This book appealed to me because of the varied seasons of life displayed in its characters. Aunt Lil's dementia, for instance, is handled very realistically. Her mood swings and temper and sweetness are all true to life and add to the tension in the story. Also, both main characters begin the story as church-goers, but bitter at the turns their lives have taken. It was moving to see how they came to see the need for personal faith (though I would have liked more detail here), and that the messy puzzle of their lives did fit into God's perfect plan.Every romance should have a happy ending, and this one has several. But Dorothy Love is also good at weaving in the bitter with the sweet. If you enjoy fiction set in our country's Reconstruction period, I think you'll relish time in this series."}, {"userName": "Erlyn Trinidad", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/722982-erlyn-trinidad", "userReview": "Beyond Measure is such a surprise! What I initially thought to be an old-school, slow paced with very minimal twists and turns kind of a novel, got me reading even while aboard the train on my way to and from work. And speaking of trains, there’s something wonderful about how the author started off the story in a train station and ended it as well at the train station. Oopps! Well, that wasn’t really a spoiler isn’t it?Alright, when I got the book I was much too excited. I love era novels. It gives one a picture of the kind of life that people used to live before our modern times. Beyond All Measure takes you back into that time when people retire to bed early because they rely on the light of the sun or the limited light of a candle or a lamp. It brings you back in time when people used to board stallions with rigs as a means of transportation, back when people are used to hard labor in the country and when women are known to quilt, weave and wear elaborate hats.Apart from most novels these days, Beyond All Measure, is a rare treasure. It is something I would want my son, or future daughter, to read when they reach their adolescent years. It teaches one to be God-fearing and faithful, and to hold on to their values and morals. It is entirely devoid of the moaning and groaning most novels nowadays have justifying those to be of an artistic pursuit. Above all, what I like most about the story is what I want to impart most to my son and my other future children, should the good Lord decide to bless us with more – that God’s ways are above are ways and His thoughts are above our thoughts, and that true happiness is obtained thru obedience, beyond all measure."}, {"userName": "Beth", "userReviewDate": "May 31, 2011", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Beyond All Measure was a very sweet read. I love the post-Civil War setting. Love did an excellent job capturing the feelings of that time, especially the prejudices between North and South. The main character, Ada, is from Boston, and therefore an outsider to the people of Hickory Ridge, Tennessee. She had her own prejudices about the South, but by the novels end, they come to understand one another instead of painting everyone with the same brush.Speaking of Tennessee, I really enjoyed the setting that Love created (being from Tennessee myself, it felt like home). The feel of the small town that is really starting to grow and prosper was strong.The Christian aspects of the novel were also handled so well. Nothing was heavy-handed or preachy, and each instance fit within the story line. The characters had genuine fears and anxieties; they were wonderfully imperfect.The romance between Ada and Wyatt was sweet and felt genuine. The way it played out was a bit predictable, but expected since it is a \"Hickory Ridge romance.\" The ending felt a bit rushed for me, and I didn't want such a drastic turn-around on Ada's part. To say that you have completely let go of every fear in regards to love is unrealistic; to go ahead and fall in love anyway, but still have fears, that is real.I will definitely read more books in the series, should Love write more; I want to see what happens to the other characters, and be swept back to Tennessee in 1871. Recommended, especially f you like sweet romances in a well done post-Civil War settings."}, {"userName": "April", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/3154123-april", "userReview": "RATING:4.5)BEYOND ALL MEASURE by Dorothy Love is an exciting inspirational historical fiction set in 1871 Hickory Ridge, Tennessee. This is this author's debut into Christian fiction. It is the first in the \"A Hickory Ridge Romance\". It is written with depth and details.The plot is intriguing,easy to follow,exciting with the charm of the old South.The characters are enchanting,charming,engaging and will capture your heart. It has romance,faith,healing,the struggles of the aftermath of the Civil War,trust,community,dreams,forgiveness,painful past,betrayal,the charm of a small community,misunderstandings, fear,hate,h,and finding love after the sacrifices of war. Ada Wentworth,is penniless,and has lost that she holds dear.She must find a job and travels to Hickory RidgeTennessee from Boston to become a Lady's companion. Ada stills has dreams of her own. Wyatt Caldwell,local lumber mill owner,kind,ex-war veteran,a,his Aunt Lillian is who Ada is a Lady's companion,and he believes Ada coming to town was Providence,but he has dreams of his own. While Ada and Wyatt fights their attraction,they must learn to trust each other and let go of the past. This is my first time reading this author but it will not be my last. While this is a Christian historical fiction is not \"preachy\".It does have the underline message of faith,hope and God's plan for our life. A must read for any historical,romance,inspirational,post civil war,and Old South readers. A keeper. This book was received for review from the author.Details can be found at Thomas Nelson and My Book Addiction and More."}, {"userName": "Ann", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/1888142-ann", "userReview": "Penniless and alone, Ada Wentworth travels from her home in Boston to accept a job as a companion to an elderly woman in Hickory Ridge, Tennessee. The War Between the States has only been over for a short time, and once Ada arrives in Hickory Ridge, she finds that many townsfolk are not willing to accept a Yankee in their midst.\tTo add to her difficulties, the woman she’s hired to attend, Lillian Willis, is crotchety and critical of Ada’s every effort. As Ada struggles to master cooking and cleaning, tasks she’s never had to perform, her one bright spot is Miss Lillian’s nephew, Wyatt Caldwell. \tWyatt is the owner of a successful lumber mill in Hickory Ridge, but his heart remains in his home state of Texas. Between his desire to return to ranching, and Ada’s plans to open a millinery shop in Hickory Ridge, the two of them seem destined to travel separate paths.\tIn Beyond All Measure, Dorothy Love has crafted a beautifully detailed story of life in the aftermath of war. Her descriptions of Hickory Ridge left me feeling I’d spent time in Tennessee.\tIf you’re of lover of historical romance, Beyond All Measure is sure to captivate your imagination. I found myself sneaking spare moments to read when I should have been busy with other things. I think you’ll enjoy this story, too."}, {"userName": "Christine", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/5046823-christine", "userReview": "Set in the post-Civil War South, Beyond All Measure is a touching story of learning to forgive and love. After Ada loses her father and aunt in a tragic accident and her fiancé abandons her without explanation, she accepts a position in Hickory Ridge, TN as a companion to elderly Lillian. Everything goes wrong from the moment she arrives. She discovers she wasn’t given the complete job description which angers and frustrates her. She has no money and no choice but to continue in the position. In the months to follow, she fights to follow her own dreams for financial independence along with caring for the loving but troublesome Lillian. To compound her problems, she begins to fall in love with Wyatt, Lillian’s nephew. Wyatt’s one dream is to fulfill his obligation of providing for his aunt and return to the ranch he loves in Texas. Scarred by memories of his time in the war, he fights his growing attraction for the Yankee he hired to care for his aunt. When he discovers Ada lied to him and misled him, there doesn’t seem any way these two can reconcile their differences.It will take a great deal of faith in God and acceptance of His healing love to mend the hearts of Wyatt and Ada. A near drowning, a death, an abduction, and a fire all help to show them that God is not just what they need, He is Beyond All Measure."}, {"userName": "ILoveBooks", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/4177633-ilovebooks", "userReview": "The plot is set in the Civil War era, the characters are well-developed and endearing to the reader, and the novel ends well with no cliff-hangers. Ada and Wyatt are two of the main characters; a romance blooms between the two of them throughout the novel. Ada is looking for a new life after fleeing to Tennessee, her main dream to make hats for a living. Hickory Ridge, the town Ada ends up in. is unsurprisingly prejudiced against both the blacks and the new Yankees. Ada takes a job as caretaker to the elderly Lillian in order to save up for her dream of owning a hat shop. She bravely begins to make her own path and lay down roots. Wyatt is the handsome man of the novel and the town's most eligible bachelor. When he shows an interest in the unsuspecting Ada she receives more negative publicity than anything. Sophie an orphaned, racially-mixed girl and stodgy, elderly Lillian make for terrific secondary characters; they provide the comic relief for the novel. Ada must put her trust in God and potentially her heart with Wyatt. This novel is well-written with romance, comedy, and action interwoven together. The book is recommended for young adults/adults who enjoy books from the civil war era and romance."}], "description": "Ada has loved deeply and lost dearly. But protecting her heart could mean missing the love of a lifetime.Ada Wentworth may be young, but she's seen enough of life to know she can only rely on herself. Everyone including God it seems, has let her down. Having lost her family, her fiance, and her fortune, Ada journeys from Boston to Hickory Ridge, Tennessee, to take a position as a lady's companion. Though initially charmed by the pretty little Southern town tucked into the foothills of the great Smokies, Ada plans to stay only until she can earn enough to establish a millinery shop.Her employer, Wyatt Caldwell, the local lumber mill owner, is easily the kindest, most attractive man Ada has met in Hickory Ridge. He believes providence has brought her to town and into his life. But how, after so many betrayals, can she ever trust again? Besides, Wyatt has a dream of his own. A dream that will one day take him far from Hickory Ridge.As the South struggles to heal in the aftermath of the Civil War, one woman must let go of her painful past in order to embrace God's plans for her. Can she trust Him, and Wyatt, with her future and her heart?", "title": "Beyond All Measure\n      \n          (Hickory Ridge Romance #1)", "url": "https://www.goodreads.com/book/show/9669007-beyond-all-measure", "average": 3.89, "cover": "https://images.gr-assets.com/books/1380858309l/9669007.jpg", "reviews": 101, "authors": [{"url": "https://www.goodreads.com/author/show/3150553.Dorothy_Love", "name": "Dorothy Love"}], "type": ["Christian Fiction", "Historical", "Romance", "Christian", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/9669007-beyond-all-measure", "http://www.goodreads.com/book/show/11547274-beyond-all-measure", "http://www.goodreads.com/book/show/11942647-beauty-for-ashes", "http://www.goodreads.com/book/show/27840642-mrs-lee-and-mrs-gray", "http://www.goodreads.com/book/show/17456100-carolina-gold", "http://www.goodreads.com/book/show/21556053-the-bracelet", "http://www.goodreads.com/book/show/14487652-every-perfect-gift", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}