{"ratings": 6, "userreviews": [{"userName": "Laney", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/4597628-laney", "userReview": "I enjoyed it. It was a good completion of the series."}, {"userName": "Lesia Chambliss", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/9105299-lesia-chambliss", "userReview": "I have really enjoyed the Children of the Light series. The authors love of history shines through in her writing. David & Annie have been through many trials on their path to find love, and they will battle their own inner self, their faith, and family before they can find that happiness. Many secrets are revealed in this book 3, and David & Annie struggle to sort out what's truly important. If you enjoyed book 1, Keeping Secrets, then I highly recommend Breaking Promises and Binding Fire."}, {"userName": "InD'tale Magazine", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/13341540-ind-tale-magazine", "userReview": "Set in 1760s Virginia and filled with Quakers as secondary characters and plotlines, this tale has rich history to pull from, and does it well. Read full review in the 2015 Holiday issue of InD'tale Magazine."}], "description": "An Estranged Husband David Cayle wants nothing to do with his wife. He may have broken promises, but she kept secrets. Important ones. His only hope to mend his shattered self is to start over in the backcountry far away from her and Cayle Farms. But walking away from her is not as easy as he thought, for she is not done with her secrets, and this one will change his life forever.A Frightened Mother Annie Cayle faces an unknown future. Despite her last days at Cayle Farms and the danger she left behind, she is desperate to return home. When David Cayle arrives unexpectedly in Richmond, she asks him to change his plans for the sake of her unborn child. But home is not safe, and neither is David Cayle. A Child that Binds With their friendship torn apart, and their marriage shattered beyond repair, David and Annie must forge a new destiny for the sake of their child. But when old enemies exact revenge they are forced to confront past secrets and broken promises. But can David face his deepest fears to save his wife? Or, in the end, will the past destroy them both?", "title": "Binding Fire (Children of the Light, #3)", "url": "http://www.goodreads.com/book/show/26814074-binding-fire", "average": 3.83, "cover": "https://images.gr-assets.com/books/1443193120l/26814074.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/8172831.Donna_Hechler_Porter", "name": "Donna Hechler Porter"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/26814074-binding-fire", "http://www.goodreads.com/book/show/27034254-binding-fire", "http://www.goodreads.com/book/show/25314505-keeping-secrets", "http://www.goodreads.com/book/show/25596435-breaking-promises", "http://www.goodreads.com/book/show/32806218-will-someone-please-shoot-the-cuckoo", "http://www.goodreads.com/book/show/36515432-the-rood", "http://www.goodreads.com/book/show/28242198-the-children-of-the-light-trilogy"]}