{"ratings": 202, "userreviews": [{"userName": "EZRead eBookstore", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/3680893-ezread-ebookstore", "userReview": "(watch the short review: http://vimeo.com/34092188)This book pulls no punches when it comes to the stomach-turning details of an abused child’s upbringing. “Upbringing” is not even an acceptable word to use for a little girl who was raised with physical and sexual abuse at every turn. If anyone ever had any doubt about the possible ugliness in the world, they need only read “Bitter Memories” to look into the cruelty that is capable of beating in the hearts of people.Instead of the typical rise and fall of bad events before Sue’s life gets better, the little girl’s life merely continues to spiral with a hurricane of grief, abuse, and a seemingly loveless life. On a journey with her abusive Daddy, who she can’t help but love and trust, Sue is constantly meeting new friends and relatives of her father to add to her misery. Starvation, beatings, molestation – it seems most everyone gets a chance to abuse Sue at some point. While Sue continues adding notches to her horror stories, the only person she should be able to turn to – Daddy – is one of the worst pieces to this puzzle of an ugly childhood.With no one to turn to, what else is a little girl to do but make up her own heroes in her head? Readers may interpret the people Sue sees as imaginary friends, multiple personalities, or guardian angels. Either way, the only escape afforded to the little girl are these friends that no one else in the world can see. In times when she can’t take anymore, Sue is lets go of herself, allowing her other personalities to take over her body and shield Sue from the abuse. What may seem as a side-effect of Sue’s torment is actually what spares and possibly saves her.Though there is no upside to the story of an abused child, reading a book like this will at least motivate more people to become child advocates. After reading this story, it is nearly impossible to ignore that inner mother bear, or papa bear, that roars against injustice towards innocent and helpless children.- EZRead Staffer, Ameliafind the book here: http://www.ezread.com/book.asp?EAN=97..."}, {"userName": "Tyra Hammer", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/6433607-tyra-hammer", "userReview": "I can say I've never read a book that sucked me into it, as much as this one! This book will grab you by the heart and make you feel like your in it!! It was never set down until I finished reading the entire thing. Yes, it's that good!! It's definitely a must read."}, {"userName": "John Brooke", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/6108350-john-brooke", "userReview": "Practically every character in this book with the exception of about 3 out of a myriad of horrible, bestial, wicked sub-human creatures, has any human compassion. It is very difficult to write from a child's viewpoint of what is happening in her innocent life, without slipping in some comments from the authors adult vocabulary, with a few exceptions, she has pulled this off magnificently.Sue Julsin pulled back the covers to reveal a hellish world that has given me nightmares with her vivid descriptions of the experiences of a little girl in the midst of horror. It's absolutely amazing that the kid kept her sanity throughout the story. Truly an amazing true story of incredible abuse and a compelling read."}, {"userName": "Sue Julsen", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/4661828-sue-julsen", "userReview": "This copy of Bitter Memories is no longer in print! Please go to https://www.createspace.com/4125493 for the new edition -- new cover -- new lower price!Website: http://sj2448.wix.com/suejulsen"}, {"userName": "Fran", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/1032865-fran", "userReview": "Bitter MemoriesSue JulsenTake some blue and some black paint and a paintbrush and smooth the blue on one side of a face and the black on the other. Let them set and dry. Add some red blotches, welts and huge bruises, and what do you see? Visualize the face that is covered with black and blue paint and bruises and you will see abuse, but not every kind. This is just the tip of the pain. Add to this a smack with a hand, the welts from a belt buckle or strap and the intense heat from a hot iron or scalding water and even then you do not have the pain and horror that some children encounter when their parents decide to destroy their innocence, take away their childhood memories and create their own private house of horrors, nightmares and pain. Some scars are left on the outside for the world to see and pity, others are more devastating as they are hidden within the mind, heart and soul of the victim, leaving them alone, cold and scared. Sarah never had a chance. Her father decided that for her as he stole her away from her mother at the age of three, teaching her how to live in a world filled with crime and using her for his own personal gratification and need. One precious child, one innocent youth many Bitter Memories.Imagine moving into the home of your grandparents who did not think your father was worth anything. Imagine that they were right. Imagine a child of three hearing her parent’s quarrel over the fact that she had the nerve to be born and make their lives difficult. Imagine her mother going to work and wanting to earn a living and her father threatening her if she did not quit. Imagine hearing your father say to your mother, “If you wanted a kid you should stay home with it.” Why would you ever keep this man in your life? Why would you allow him to consider your child an object, an It? Sarah blamed herself and became fearful of her parents. All she heard was yelling and screaming and would take her only friend, her doll Judy and hide. Sarah prayed for the Lord to take her home to him in order for her parents to be happy. No matter how hard she tried her father did not love her. No child deserves this. Her mother had been married numerous times before, and her parents did not want her to marry her father. She should have listened.In the middle of the night Sarah hears a voice in her ear telling her to get dressed and be quiet. Unconditional love is hard to find and that is why she never questioned her father and went along with him thinking they were going to come back and get her mother. What happens is frightening as her Uncle Henry saves her from what would happen again. Brought home to her mother they never figure that her father would do it again. Losing many jobs, injuring her mother, violent and cold to Sarah, everyone thought the worst was over. Once again her father came to her in the middle of the night but this time he succeeded. Placing her in the back of the car, mistreating her, mean and telling her to stay quiet, Sarah spent hours in the back seat of the car—cold, hungry, dirty and afraid. When they finally stopped, it would land them a home for a short time as her father befriended a waitress named Martha. But, after months of comfort and feeling somewhat secure a fight ensued and once again she was on the road with this sick and deranged man. Leaving the woman’s house in shambles they traveled many hours and miles while Violet, her mother became a drunk, violent, and despondent. With the help of her family and her sister who did nothing but make things worse, Violet eventually had to be placed in a sanitarium for her own sake. But, Sarah had no idea of her mother’s anguish, plight or fears being told she was dead and no longer a part of her life.What happens next should never happen to a young child or any child. Her father calmed down and the end of her innocence is born as she is forced into a dreamlike world in order to exist when the man that is supposed to be your protector uses your love to gratify his male needs. Telling her this was the way he would show her he loved her and making her touch him, which she knew was wrong, was the way. Do you hear the angel’s voice whispering to her and protecting her? Hearing the voices in her head she would learn that she takes the humiliation and pretended to be talking to someone else in her head. Wishing he did not love her so much, she sent herself into what you might call a suspended animation. There were four voices in her head that would protect her and keep her safe from harm. Her father loved to con women and he managed to get what he wanted and free food too. The angel’s voice would haunt her and tell her how smart her father was. Women stayed for a day or two and expected him to work but he wanted to take from them and not work. Leaving some in the middle of the night, her father would trash their houses as a reminder that he was there, leaving them just like me with nothing. Added to his cunning and sick ways he even justified stealing from these women and taught her to do the same. No matter how many women he met they always left in a hurry, but once with one thousand dollars left in a cookie jar. Once again on the road and now in Wyoming.Telling her about his brother and saying they would stay with him. But, the man she met and the reason she was introduced to him was not what you think. She would now learn what a trick meant and the raw meaning of the word used. Sent upstairs with the sons, she would learn another game and hear the angels speak. What happens next is sick, will make your stomach turn and truly turn your insides to stone. If she told, they would hurt her. But, no one would stop the boys and her Uncle from their sick and perverse acts, not even their mother. Sarah drifted in and out of consciousness, even her father thought she would die. Temperature so high they would finally call a doctor. When they finally left, Sarah would know the true meaning of HATE. Fever burning and hoping her guardian angel would protect her, they left hoping to find a doctor for her. Not able to communicate and tell them what happened, she thought they just were not listening as she recounts for the reader the reason she got sick. What the doctor and his wife saw alerted them to the fact that she was bruised and abused, so why didn’t they call the police?When her father meets Janet and decides to remain there with her, Sarah’s life turns into more than just a living nightmare. Leaving her alone with this sick and demented person, she used Sarah to make money by selling Sarah’s body for twenty dollars to as many men as possible. A young child caught in a web of lies, deceit, hate and in her own world filled with four guardian angels, hoping they would save her from what would come next. But, when a break is made and her father decides to finally leave, she winds up with his sister and the abuse only gets worse. When her Uncle Henry finally gets some information about her whereabouts and they finally bring her home, she hopes that her mother will remain with her forever. But, Violet is too far-gone and gets drunk and soon the worst happens. Somehow she falls off a banister and the truth behind her death lies buried. Living with her grandparents brought her some joy, but living with her Aunt Olivia and Uncle Henry, was no better than living with her father. The abuse continues, as her aunt did not really want her around, blamed her for things she could never have done and the loneliness inside of her never left. What does happen and how she manages to survive, you need to read for yourself.When the reality of her situation finally hits her, and she gets the help she really needed, will Sarah ever be whole? Will she realize that what happened to her was not her fault and that she is special, really kind, smart and deserves to live a life that other kids have?Told in Sarah’s own voice, you can feel the pain, the sorrow, shed the tears along with her and hide when the belt or worse is about to hit, as author Sue Julsen tells this true life story of what happens when everyone turns a blind eye and abuse is allowed to fester, but in the final analysis it does not win.To all parents, grandparents, educators, pastors, guidance counselors and family members you need to report abuse when you see it. You need to protect our children and not let this happen to anyone you know. If you even suspect a problem, you need to tell. As an educator, I learned the signs and did not think twice about reporting abuse whether physical, mental or sexual to save a child. What frightens me is that somewhere out there, there is another Sarah. Thank you Sue for sharing your story, and thank you for the honor of reviewing your book. Let’s take that blue paint and black paint and spill them out and replace them with the color of the beautiful faces of all of the children in this world with perfect smiles.Fran Lewis: reviewer"}, {"userName": "Geoffrey Feller", "userReviewDate": "Apr 27, 2013", "userURL": "http://www.goodreads.com/user/show/13969715-geoffrey-feller", "userReview": "“Bitter Memories” by Sue Julsen is a disturbing yet compelling story of what happens to a little girl who is taken away from her mother and extended family by her criminal father, a man who abuses the young Sarah sexually and who exposes her to still more suffering at the hands of people they encounter while the father is on the run. The prose is raw and not for the faint of heart. Sarah is not only sexually molested but abused physically, verbally, and emotionally. It’s maybe too much for some readers to tolerate but I found myself caring about Sarah and fearing for what might happen next. The psychological damage is manifested in the “others” who appear to help Sarah survive the abuse; this is dissociative identity disorder, what used to be termed multiple personalities. I’m no expert on it but I have some second-hand knowledge of the disorder and what Julsen writes here strikes me as being quite authentic. I hate to nitpick on such a book with such serious and important themes but there were a number of times where Sarah’s reactions and comments seemed beyond what a child under the age of six would be capable of. Also, there is a funeral scene late in the book in which some of the characters are described in ways that had already been established earlier. It read like a story written separately from the main text or perhaps had been originally intended as the beginning of a sequel. The repetitive description of how Sarah saw these people was unnecessary to the point of distraction for me. It took me a little while to go along with the shift from Sarah’s first-person experiences on the road with her father to the third-person scenes of her family’s problems dealing with her abduction. Julsen admits that these are imagined conversations based on what she knows about the people involved. However, if we take the entirety of the book as what Truman Capote described as a “non-fiction novel”, I can accept the third-person scenes in that spirit as well as some of what might have been speculation on the author’s part about certain relatively minor details in the earliest part of Sarah’s terrifying journey. I want to end on what I thought was an especially strong point for “Bitter Memories”. It’s no spoiler to report that Sarah is eventually rescued (although some details need to be kept for future readers to discover) since this is a near-autobiography. I really liked the way Sarah’s return to Texas was not just some happy ending with tears and hugs and promises of “everything will be all right now”. It was totally believable that a child’s return to a family that had suffered the agony of her abduction would continue to be dysfunctional and that the problems brewing in her long absence would impact Sarah herself. This is not a flawless book yet it is an important story to be told and one I’m glad to have read."}, {"userName": "Anne Hawn Smith", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/2393446-anne-hawn-smith", "userReview": "What a sad, sad book and it is a hard book to read. Several times I thought I would skip ahead because it is hard to believe that a father could take a child and submit her to such torture. He even thought he loved her when she was just an object and a bargaining chip. I felt like I needed to read the book because this was a real child and this happened to her. I didn't want to turn away from this kind of abuse and pretend it didn't exist. This father kidnapped his daughter more to torment his wife than because he loved her. Once he had her, it seemed that every male, whatever their age, wants to sexually abuse her. It is just hard to believe that this kind of thing exists. In the past, when I heard on the news about a non-custodial kidnapping rather than a stranger kidnapping it was with some relief. I mistakenly thought that the parent wouldn't hurt the child and I felt the pain of the custodial parent more than the child. After reading this book, I won't feel that way again."}, {"userName": "Jamie Campbell", "userReviewDate": "Dec 17, 2011", "userURL": "http://www.goodreads.com/user/show/7203120-jamie-campbell", "userReview": "I'm not a writer, just an avid reader. I came across this book and Sue, by chance through a family member. Bitter Memories brought forth so many emotions in me while reading it, rage, terror, sympathy, empathy. Sue, the Author, should be commended for writing her own life story not only to help others, but to shine a light on the cruelty and depravity that can be hidden so well and so deep, that it's not seen behind just an ordinary face. Hopefully for Sue, writing this was cathartic for her. It became a learning experience for me. Nothing and no one is \"Normal\" and most things are not as ordinary as things seem on the surface."}, {"userName": "ML", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/22709158-ml", "userReview": "I found this book to be the best reading I have ever done. The author's style of writing is so vivid that you feel every heartache of her life. This is not just a great book. It is without a doubt a book of therapy for those who have also suffered abuse. A must read. Don't stop at this book by Sue Julsen. Treat yourself to her other books and discover the rest of her life as well. One of the best styles of writing I have seen"}, {"userName": "Gordon", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/7059394-gordon", "userReview": "This heartbreaking story of the author's early life touched my heart and soul. It opened my eyes to the horrors of child abuse as told from the author's own personal experiences. How she survived is amazing! I couldn't put the book down until I'd read the last page. Excellent writing of this difficult subject. I highly recommend this book."}, {"userName": "Nancy Parish", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/6064440-nancy-parish", "userReview": "This is THE best book there is on child abuse. Sue writes from the perspective of a child and the astonishing lengths that one goes to in order to protect themselves. It is both beautiful and heart wrenching. But above all, it is accurate!Sue has great courage to write this book - but there are many people who will be forever thankful that she did. I can't recommend it enough!"}, {"userName": "Laura", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/142401-laura", "userReview": "This book is a heartbreaking true story which will keep you on the edge of your seat. I could not put it down. It will keep you in tears hoping against all hope that the heroine of the book survives her harrowing life. A great read!"}, {"userName": "Kerry Williams pettit", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/9753796-kerry-williams-pettit", "userReview": "This book was difficult to read at times due to the graphic content but was also almost impossible to put down. To say I \"enjoyed\" this book doesn't sound appropriate but it was definitely a page turner."}, {"userName": "T.R. Robinson", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/34170124-t-r-robinson", "userReview": "Once read, most reader’s will undoubtedly consider the author to be a very brave woman. To put these experiences into writing, let alone publishing them for all the world to see, must have taken considerable courage. Readers should know, when initially writing and publishing this book, the author chose to conceal her own and other’s identities; ‘To protect the innocent and the guilty’. Nevertheless, she has subsequently been brave enough to reveal her identity by publishing photographs of herself. This woman’s courage has to be admired: how many others would have been prepared to take such a step?Complete review may be read at: https://trrobinsonpublications.com/20..."}, {"userName": "Lisa Gatts", "userReviewDate": "Jun 21, 2013", "userURL": "http://www.goodreads.com/user/show/8918437-lisa-gatts", "userReview": "This book was good, actually it was very good. I thought the majority of the story was above a 4 but I took off a star because of the last 1/4 or so of the book. If Amazon had half stars, I would have given it a 3 1/2. Anyways the reason I did not give the book 5 stars was because of the disrespectful attitude the character in the book known as Sarah developed after her father was arrested and she was returned home to her family.Before I get all kinds of hateful comments on my review I would like to elaborate as to why I say this. I really do sympathize with the abuse she suffered as a very young child. I think that a few of the people she came in contact with were sick individuals and their behavior was wrong. I cannot sympathize or have 1 drop of compassion for child abusers of any type, whether that be physical,mental,and especially sexual abuse.I was only hoping that \"Sarah\" the character(or real-life Sarah) could have found a certain measure of inner peace after her rescue. The past cannot be changed and in order for her to move forward with her life and find some level of happiness and content, she needs to find a way to sort through her past abuse to help her as she moves into her future. What bothered me was that even though she was not even a teenager yet, she referred to her aunt over and over again as \"the bitch\", \"Auntie Bitch\", Mrs. Bitch and although she disliked the woman she was still her family. Our family members,especially our elders deserve to be treated with respect. we cannot choose our relatives.I think that as a child she owes her Aunt/Uncle and Grandparents a certain level of respect and I do not think that calling them names is appropriate nor is it going to solve anything. When she accuses her Auntie Bitch of killing her Mother that is just pointless. Sarah's mother chose to drink and no one poured the alcohol down her throat. Sarah's Aunt and Mother chose to get drunk again and again even when they knew the end result was usually them getting in verbal and physical altercations time after time. After her Uncle took her mother to the State Hospital to dry out the mother slipped and fell because of ice on the bottom of her shoe. Another example was the way she treated the people who chose to pay their respect at the funeral home. An overweight lady said \"I want chocolate cake so bad, I think funerals make me want chocolate cake.\"and Sarah said later Sarah referred to her as \"chocolate cake Maggie\". Not a huge big deal and and young children typically do and say stuff like that from time to time but inappropriate for a funeral.Everything just seemed to get under Sarah's skin that was irrelevant to the story such ass when she was counting ten,eleven,twelve,thirteen, cars at the funeral of \"more strangers\", not very nice, these were people who liked or loved you mother enough to take time out of their busy day or jobs to pay their respects, and they deserve to be acknowledged for that not picked apart and labeled. Sorry, just the way I feel. Sarah never referred to her father as a Monster or any other unsuitable names I can think of but will not type here______.There were many adults and even children who were horribly mean and hurtful to Sarah. They abused her over and over in horrible ways that are unforgivable and they deserve to be punished and in my opinion probably worse..... but I believe in karma also so in time hopefully their actions will come back on them tenfold.I hope that \"Sarah\" has nothing but good things come to her in the future and I truly hope she finds happiness because she deserves it. I would recommend this book to Amazon readers and for the most part I enjoyed the bulk of the story. The author is definitely talented and has the potential to possibly write a best seller someday. There was just a few things I felt that were worth mentioning and as a reader I have that right when I purchase an e-book (or rather 5,000 e-books)on Amazon.I had no idea this was a trilogy though and have just purchased the other 2 in the trilogy and another by this author too."}, {"userName": "Donna", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/13171305-donna", "userReview": "While I don't doubt that the author suffered abuse, I just found parts of it to be unbelievable. For one, she remembers a lot of details that a small child would not remember. In fact, toward the end of the book, she says that she remembers nothing of her past life before she was kidnapped yet she describes conversations and events of that time in great detail. Another thing that was mentioned in the book that makes me have doubts about the detailed events is that she indicates she regularly wrote in her diary. How did she learn to read and write if she never stepped foot into a school until after she was reunited with her Mother? If descriptions of her Father are to be believed, it is very doubtful that he would be so loving that he would take the time to teach her. Lastly, she remembers thinking things at the time of the event(s). Some of these things were \"thought\" in a way that no small child would think.Again, I truly believe that her father was a monster and so were some of the other perverts that were introduced into her life. I am willing to believe that some, even all, of the events are true but I personally feel that some of it MAY have been exaggerated. It's just the vibe that I got while reading it."}, {"userName": "Barbara Pack", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/16424627-barbara-pack", "userReview": "This book started me on a journey with the author. I love all of her books, but this one is special to me, because she is sharing all of the pain and suffering she went through as a child. She enlightens the world about how evil people can be sometimes, especially to children. She also gives child abuse victims hope that they will someday get over being abused.I love the book and recommend it to all."}, {"userName": "Sue Sipin", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/13008985-sue-sipin", "userReview": "I don't have lots of time to write reviews. But all I have read of Sue's have made me aware of my own books I am currently writing about me memories and truths of what I have gone thru. These are the best books about her life and mine. I would jump and follow all she has to say. We have all gone through these positions once in our lives. Thank you Sue, for being so brave and giving me the courage to tell mine ! Love ya, SueAnn"}, {"userName": "Teresa Brown", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/16431178-teresa-brown", "userReview": "It was an extremely sad book. It hurt so much knowing how much that little girl went through, especially having a daughter that is the same age as the girl was when she was taken. abuse is abuse whether it's physical or emotional, they both have lasting affects on children and I think it's very important that people are aware of that."}, {"userName": "Morgan Inman", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/28280232-morgan-inman", "userReview": "Heart wrenchingThis book is a tear jerker. It is inspiring to let people of abuse know that their is always hope."}], "description": "When Sue Julsen was two, her father attempted to run away with her but was stopped before he reached the city limits. A year later Sue was not so lucky. Her father had spent that intervening year biding his time, lulling the family into a false sense of security, so that when he abducted Sue again he would get clean away. And he did.It turned out to be, for Sue, the start of a six year road trip from hell during which she was subjected to unremitting exploitation, starvation and abuse so severe that she constantly had to disassociate herself mentally from it to survive.And beyond the overwhelming heartbreak and terror, there was a nagging question. Sue’s father would regularly hook up with waitresses in diners and they would stay a few days with them. But why then, each time, did he end up trashing the place and refusing to let Sue say goodbye to them. Were these waitresses really sleeping, as he would insist, or was something more sinister happening?Disclaimer:The names in this account have been changed to protect the innocent and the guilty, as has the locale, but the events described in ‘Bitter Memories’ did indeed take place as best Sue Julsen can remember them as a very small child hurled into a maelstrom no child should ever have to face.NOTE: ADULT LANGUAGE, GRAPHIC CONTENTThis is not a cozy, feel-good read. It is a true story of extreme child abuse and the will to survive. Language and content is not suitable for anyone under 18 years of age.This is the first in the series. Although I'm using my real name in the above description, my name in the book is Sarah.Cover design by Gary McCluskeyPlease visit my website to learn about all my books: memoir series, true crime, crime fiction series, and the first in a fantasy series.http://sj2448.wix.com/suejulsen", "title": "Bitter Memories: A Memoir of Heartache & Survival (Memories, #1)", "url": "http://www.goodreads.com/book/show/17732064-bitter-memories", "average": 3.86, "cover": "https://images.gr-assets.com/books/1365136656l/17732064.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/4093695.Sue_Julsen", "name": "Sue Julsen"}, {"url": "https://www.goodreads.com/author/show/2918082.Gary_McCluskey", "name": "Gary McCluskey"}], "type": ["Nonfiction", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/17732064-bitter-memories", "http://www.goodreads.com/book/show/8490425-bitter-memories", "http://www.goodreads.com/book/show/18921350-bitter-memories", "http://www.goodreads.com/book/show/22283235-drowning-in-memories", "http://www.goodreads.com/book/show/22030885-zip-ties-and-lies-the-anderson-dimaggio-case", "http://www.goodreads.com/book/show/16035883-from-the-heart", "http://www.goodreads.com/book/show/17970195-trophy-murders", "http://www.goodreads.com/book/show/22550995-cutter-s-revenge", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}