{"ratings": 135, "userreviews": [{"userName": "Matt", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "I’ve struggled a bit to best describe my feelings for this book. I suppose the best – yes, the best – way is by analogy. Richard Berleth’s Bloody Mohawk can only be compared to a pizza dinner that has been prepared and served by a pug wearing a tuxedo. At first blush, this situation has all the hallmarks of a perfect meal. Pizza. A dog dressed like a person. It’s almost can’t miss. But then you realize the pizza has a crust that is a bit undercooked, and not enough cheese, and it tastes a little bit like a paw. You start to get disappointed. But you think a little harder, and come to the realization that pizza is almost always edible, and besides, it was just served to you by a pug. In a tuxedo. To explain my analogy a bit further (as though that’s necessary!), the subject of Bloody Mohawk – the French & Indian War and the American Revolution in New York’s Mohawk Valley – is almost impossible to screw up. It is imbued with fascinating characters, dime-novel adventure, and Shakespearian threads of revenge and betrayal. However, while reading Bloody Mohawk, I kept getting the nagging sensation that things weren’t coming together right. All the ingredients were present, but they had not cohered. Halfway through, I thought I was disappointed. At the end, though, after a little reflection, I decided I wasn’t as unhappy as I’d earlier thought. (This is probably the time to say that I am not comparing Richard Berleth to a pug. He has a PhD in English literature, teaches at a college, has published several books, and judging from his photo, seems like a nice man). Bloody Mohawk is divided into two sections. The first deals with the New York frontier generally, and the Mohawk Valley specifically, during the time of the French & Indian War. The second half covers the time period of the American Revolution. As Berleth explains early on, the geography of the Mohawk Valley gave it strategic importance in the event of a war. In the years before the Erie Canal, the Mohawk was the main inland artery connecting the shores of Lake Superior with eastern civilization. For decades, control over the Valley was closely linked to control over the North American continent. The French & Indian War section is the more problematic of the two. The issue, I think, is contextual and chronological. It is never made clear how the Mohawk Valley fit into the larger scope of war. Moreover, Berleth does a poor job setting up a timeline. He leaps from one event to another and moves back and forth in time, without ever explaining the simple causality of war, how one event led to another and to another. On one page Berleth is dealing with the Braddock Massacre and the Battle of Lake George; seemingly on the next, he jumps forward ten years, to the massacre at Fort William Henry. Frankly put, the French & Indian War chapters are a muddle. The paradigmatic example, in my opinion, is Berleth’s treatment of Fort William Henry. This massacre – made famous by James Fennimore Cooper’s The Last of the Mohicans – is advertised by name on the back cover. Its inclusion, in fact, is the reason I came upon and purchased this book. Thus, it was frustrating (to say the least) to discover that Berleth cursorily dispenses with this battle in two pages. And unfortunately, they were not helpful pages. He simply writes that Montcalm besieged Colonel Munro at Fort William Henry; that General Webb didn't come to help; and that later, 700 men were killed. Anyone reading these pages without any background on the subject would be forgiven for asking the obvious questions: who was Montcalm, and why was he besieging Fort William Henry? Who was Colonel Munro, and why was he inside Fort William Henry? Who was General Webb, and why didn't he help? What was the importance of Fort William Henry, other than as a centerpiece to one of the worst famous novels ever written? Berleth makes no attempt at enlightenment. I don’t know why this part of the book is so confused and bad. It doesn’t have to be. At other places, Berleth shows a grasp of the material and an ability to form a coherent narrative. For instance, he does a creditable job describing the so-called Bloody Morning Scout and the Battle of Lake George, where Sir William Johnsons’ rag-tag army stumbled into and fought their way out of an ambush planned by Baron Jean-Armand de Dieskau. This chapter, at least, takes into account the fundamental elements of military history (the players, the strategy, the tactics and the execution) that are lacking elsewhere. The second half of Bloody Mohawk is quite a bit better than the first (which obviously sounds like damning by faint praise). It still suffers from a lack of focus and an inability to decide what events are important, why these events are important, and how many pages to devote to the event. It can get a little maddening. For example, Berleth continually mentions the Battle of Saratoga, one of the great colonial victories of the Revolution, which took place in New York. Yet he never takes the time to write about, you know, what happened at Saratoga. One is tempted to point out that, taking the title literally, the battle did not take place in the Mohawk Valley. But Berleth himself doesn’t take his title seriously. He devotes space elsewhere to the Wyoming Valley Massacre and the Braddock Massacre, which both took place in Pennsylvania. The main reason why the Revolutionary War section succeeds at all is that Berleth recognizes the set-piece potential of the Battle of Oriskany. Oriskany was one of the bloodiest battles of the American Revolution. A column of colonial militiamen, under the command of General Nicholas Herkimer, were marching to the relief of Fort Stanwix, which was under siege. Herkimer’s men ran into an ambush of Iroquois warriors, Tory rangers, and German light infantry, under the command of Barry St. Leger. The ensuing battle, among the trees, at close range, often hand-to-hand, pitted neighbor against neighbor, in what more approximated civil war than a war for independence. Only a fortuitous thunderstorm, which caused a break in the fighting and allowed a mortally-wounded Herkimer to regroup, saved the colonial detachment. Berleth has no problem managing the inherent drama and confusion of this encounter: In the front, [Ebenezer] Cox obeyed his general’s orders and formed his companies to fire straight down the road into a swelling mass of attackers. Their first fusillade held back a score of shouting braves. Jacob Dieffendorf, a lieutenant in the 1st, ran a young Indian through with his sword, heard his name called, turned, and was shot in the face by another assailant. George Casler, seeing this, slammed the butt of his musket into the head of the man who had shot the lieutenant and finished him with a hatchet. As Cox’s men reloaded, they were taken under fire by dozens of Mohawks and Tories who had worked into the deadfall to the north and south of the roadway. Muskets discharged practically in the faces of opponents. Militia who were not cowering in the bloody dirt now thrust out at the ambuscades with bayonets and climbed piles of brush to fall on the enemy with knives and fists…The battle of Oriskany is the high point of Bloody Mohawk. After it, the punitive Sullivan Expedition (a genocidal excursion ordered by George Washington to erase the Iroquois) and the vicious Cherry Valley Massacre seem anticlimactic. Part of the reason they seem anticlimactic is that these stories have been told elsewhere, better. To be fair to Berleth, he never set out to reinvent the wheel. He is very upfront about his purposes (a narrative history of the Mohawk Valley) and his limitations (namely, exchanging detail for a sweeping scope). He is not a historian, and he relies heavily on secondary sources. Indeed, he openly directs his readers to the bibliography section, in order to track down sources offering greater detail. My problem with this, however, is that it seems to undercut any arguments in favor of the book’s existence. By sacrificing so much detail and analysis to “sweep,” you aren’t left with much substance. I find it hard to recommend this book when you can find everything in it – and much, much more – in other, better books. Chief among these other, better books, is the oft-cited works of Alan W. Eckert, whose Winning of America series is required reading for any American history buffs (this despite his uncomfortable hybrid style, in which he writes his history in the form of a novel). Eckert’s portrait of William Johnson and his telling of Oriskany, Fort Stanwix, and the Cherry Valley Massacre far exceed anything found in Bloody Mohawk in terms of detail, analysis, and narrative liveliness. (Eckert can be very dry, but his formal prose is subject to graphic eruptions of violence that certainly keep you on your toes). Still, after all that complaining, I come back round to the fact that I didn't hate Bloody Mohawk. I can’t hate compelling history told by a passionate author any more than I could hate pizza served by a pug. At the very least, it tantalizes you with all the thousands of stories that exist from those fraught years in the Mohawk Valley. And it points you in the right direction if you want to find out more about them, which you will. It’ll get you interested in battles and massacres and raids and escapes you might never have heard about before. It might even tempt you to pull an old copy of Drums Along the Mohawk down off the shelf, and you might even read some of it, before you realize that it’s just a thinly-veiled and intellectually-porous reproach of FDR’s New Deal. In other words, when you’re dealing with history like this, there is no such thing as bad, just varying degrees of good."}, {"userName": "Kathleen Hulser", "userReviewDate": "May 10, 2010", "userURL": "http://www.goodreads.com/user/show/1587359-kathleen-hulser", "userReview": "Terrific take on geography as history, roams through what the glaciers did, following rivers and lakes through upstate New York, Quebec, Ontario, Pennsylvania, New Jersey and Connecticut to probe conflict in the 18th century. I especially appreciate the way Berleth focuses on local meanings. You understand that it is not the monolithic British administration in play, but rather Sir William Johnson and his minions; not a big lump of Indians, but actual Mohawks, Oneidas and others; not colonials in general but Palatine Germans, Scots-Irish, irascible farmers and unassimilated Dutch. His readings of first hand accounts revive long-forgotten words from such worthies as Conrad Weiser and the Rev. Samuel Kirkland. The missionary Kirkland had a close shave indeed when his conversion efforts were interpreted instead as the beginning of a run of local bad luck -- what's startling is how modern his words from his journal about this near-death experience are."}, {"userName": "Chuck", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/3995241-chuck", "userReview": "A well written history of the Mohawk Valley during the Colonial and Revolutionary periods when it was a critical strategic location. Richard Berleth chooses his topics wisely and writes engagingly about why the Valley was so important and how major invasions, first by the French and 20 years later, by the English were defeated, saving the New York Colony. And he details the cost and sacrifice involved with as much as 2/3rd of the population dead or fled from the Valley. The Battle of Oriskany was the bloodiest battle of the Revolutionary war and decimated the male population of military age. Subsequent attacks of what in many ways, was a civil war, destroyed much of theremaining settlements. He also discusses how politics, diversity and ethnic issues affected an area populated by Dutch, Germans, English, Scots-Irish, and native Americans.I recommend reading this book if you are interested in understanding the 18th Century history of the Mohawk Valley, are interested in military or United States history, or simply want to read a very well written and a well-told story."}, {"userName": "Nicholas Maulucci", "userReviewDate": "Dec 26, 2014", "userURL": "http://www.goodreads.com/user/show/30991013-nicholas-maulucci", "userReview": "awesome book. very detailed and intricate history of upstate New York during the revolutionary period. the book deals mainly with the relationship of the Indians with the loyalists or the militia. Oneida, Seneca, Mohawk, Iroquois, tuscarora, Onondaga...I loved the book telling the history of a state that I have zig zagged and lived in for 20 years. Onondaga (syracuse), cobleskill, Schenectady, cherry valley...the raids, the savagery, the valor. I thoroughly enjoyed this tough read about beautiful upstate New York and its revolutionary history. two thumbs up! recommended for die hard historians of the revolutionary war."}, {"userName": "Glen", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/4052946-glen", "userReview": "A thorough account of the relationship between the Native Americans, Loyalists, and Patriots in New York State during the French and Indian War and the Revolutionary War. Serves as another reminder of the disservice our nation did the Native Americans after enlisting their help to defeat the British. As a resident of Upstate NY I enjoyed the local history the book provided."}, {"userName": "Joy Wilson", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/11153230-joy-wilson", "userReview": "In the US we are all taught about the revolutionary war; however, I knew nothing about the portion of the war that took place in the northern sphere. I found out about the battle on the Plains of Abraham while vacationing in Montreal and Quebec City. This period of history is often quickly discussed and then passed up for the more sexy Civil war. This book is well composed and well-written as the stories of the people who lived, settled, and died in the Mohawk River valley. Berleth does an excellent job of describing the people and their reasons for being on the frontier. He also describes with clarity relationships among European and Native Americans and the meaning of civilization. The Iroquois League was a remarkable system of government and commerce. It covered millions of miles of territory and was able to adjust for a while to the incursion by European settlers. Anyone who is interested in early American history would do well to read this book and learn more about the war in the northern regions of New York, Vermont, and the Great Lakes."}, {"userName": "Bill", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/5909073-bill", "userReview": "Family ties and an interest in history led me to this book. I knew of Ft William Henry, Ft Edward, and the Battle of Bennington. I always smiled seeing the sign announcing Whitehall (Skenesboro) as the birthplace of the US Navy. Reading the story behind the Battle of Valcour Island, and the subsequent burning of the American fleet had me captivated. I knew of the Battle of Oriskany; what happened there was something I didn't know. But most impressive to me was what the author said about the various Native American tribes, especially the Iroquois League. I enjoyed learning the differences between them, as well as their varying alliances. A very informative book for anyone interested in colonial America."}, {"userName": "Bettie", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/19585784-bettie", "userReview": "I am not really a reader of battles but this one caught my interest as the \"patriarch\" of our family was scalped on May 22, 1780 in Fonda, New York. This book gave me a sense of the history leading up to this event and why and how it might have happened, despite the lore that he was a \"close personal friend\" of William Johnson, and had always been on good terms with the Indians. A lot of terrible things happened in those years on all sides. The Fonda have survived... the Natives haven't fared as well."}, {"userName": "Jerry Walsh", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/4739236-jerry-walsh", "userReview": "Very detailed story about the civil war between the Tories and their Indian allies and Patriots and their Indian allies in NY state. This should be required reading for anyone who wants to know about the American Revolution. Also learned much about the politics and infighting during the revolution. The anger and mental anguish the Iroquois People went through as the way of life and culture was being destroyed helped me understand the problems in the Middle East. The destruction in the Mohawk Valley in lives and property were enormous."}, {"userName": "Bap", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/892400-bap", "userReview": "This is the story of the frontier in upstate New York where the Iroquois confederation vied with the French to the north, the avaricious Dutch to the south replaced by the restless British and German Palantine emigrees. For fifty years, the Iroquois were the dominant force by their diplomatic skills and fighting prowess but they were doomed. Ultimately they backed the wrong side and got caught up in the revolutionary war which in upstate NY was a brutal civil war with Tories fighting Patriots and the Iroquois confederation split asunder. This book is an excellent account of a tragic era."}, {"userName": "Edward Lewandowski", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/19009727-edward-lewandowski", "userReview": "This was my second try getting through this book. I finally skipped the chapters about the missionaries and once I got back into it, it was extremely good reading. The Mohawk Valley was a repeated target of the Tories and their Indian allies. Learned some new info since I have read other books on the same subject, both fiction and nonfiction."}, {"userName": "Pierce", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/58998509-pierce", "userReview": "Excellent story and an amazing factual history of the region. It was an academic struggle to keep tabs on all the names of various people and geographical locations. You will need to concentrate while reading this book. It is not light reading that can be rapidly skimmed with other distractions around you ."}, {"userName": "Amanda", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/56408813-amanda", "userReview": "Insightful, and wonderfully laid out with the French and Indian War in the first half, and the Revolution in the second half. Stories are intertwined within the pages that give the reader a peak into the lives of the people and the natives during the colonial America."}, {"userName": "Nick", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/301548-nick", "userReview": "I really enjoyed this book. Berleth's sweeping history of the Mohawk river valley is engrossing - the story picks up where the English have already come and taken over from the Dutch, who are snooty old money at this point, and the people of the long house have an uneasy co-existance with the white settlers, supplying them with pelts in return for manufactured goods. The book follows the sweep of events until at the end, the confederation of the native peoples is ripped apart in the extremely bloody and personal conflict of the Revolutionary War (spoiler alert).My only word of warning here is that \"Bloody Mohawk\" really isn't kidding. During the first half of the book it's not too bad, but by the time the Revolutionary War starts, it's a mercy when people are just getting shot point-blank in the face with muskets and not getting scalped while still alive or hung with their own entrails. If you can deal with the depressing and frankly astonishing amount of blood shed in the second half, you won't want to miss this."}, {"userName": "Eric", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/9986918-eric", "userReview": "I liked it alot. It brought to life incidents I was familiar with, and tied them together with an historical overview that I hadn't previously had. I've visited many of the sites discussed, such as Newtown battlefield, Johnson Hall, Albany, etc., but this narrative definitely put it into a clearer perspective."}, {"userName": "Bob", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/30330807-bob", "userReview": "This the first book I have read that details the native Americans' role in the war. Other, more well known books gloss over the subject when in fact it was a major part of the revolution. My only problem reading it was that the timeline jumped around somewhat and I had difficulty keeping up with the characters. This was overall, a very good book."}, {"userName": "Debra", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/634204-debra", "userReview": "Uneven. When it is good, it is very very good....Of course I live in the Mohawk Valley, in what was then called German Flats. William Johnson has fascinated me for decades. Of course I am going to enjoy and be picky with this book."}, {"userName": "Sarah", "userReviewDate": "May 16, 2010", "userURL": "http://www.goodreads.com/user/show/3316070-sarah", "userReview": "I'm starting over again because the last time I picked up this book was in 2010...And I have a better attention span now. hahahah"}, {"userName": "Doug Galli", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/26122360-doug-galli", "userReview": "Outstanding narrative on two wars fought mainly on New York soil. A must read if you love local history"}, {"userName": "Jeremiah Gumm", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/3139011-jeremiah-gumm", "userReview": "Fascinating read about the oft-forgotten history of the Mohawk River Valley in central New York. Berleth provides a balanced and fascinating historical narrative that was easy to read."}, {"userName": "MaryAnn Warner", "userReviewDate": "Jun 27, 2015", "userURL": "http://www.goodreads.com/user/show/8283118-maryann-warner", "userReview": "Loved the local history I learned from this book! Wish I was better at retaining the names, but so many, along with the places are familiar to me."}], "description": "In this narrative history of the Mohawk River Valley and surrounding region from 1713 to 1794, Professor Richard Berleth charts the passage of the valley from a fast-growing agrarian region streaming with colonial traffic to a war-ravaged wasteland. The valley's diverse cultural mix of Iroquois Indians, Palatine Germans, Scots-Irish, Dutch, English, and Highland Scots played as much of a role as its unique geography in the cataclysmic events of the 1700sthe French and Indian Wars and the battles of the American Revolution. Patriots eventually wrenched the valley from British interests and the Iroquois nations, but at fearsome cost. When the fighting was over, the valley lay in ruins and as much as two-thirds of its population lay dead or had been displaced. But by not holding this vital inland waterwaythe gateway to the West, \"the river between the mountains\"America might have lost the Revolution, as well as much or all of the then poorly defined province of New York.", "title": "Bloody Mohawk: The French and Indian War & American Revolution on New York's Frontier", "url": "https://www.goodreads.com/book/show/7592598-bloody-mohawk", "average": 4.16, "cover": "https://images.gr-assets.com/books/1349052220l/7592598.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/717227.Richard_J_Berleth", "name": "Richard J. Berleth"}, {"url": "https://www.goodreads.com/author/show/739525.Robert_Weibel", "name": "Robert Weibel"}], "type": ["History", "Military History", "Nonfiction", "North American Hi...", "Military"], "outlinks": ["http://www.goodreads.com/book/show/7592598-bloody-mohawk", "http://www.goodreads.com/book/show/700073.The_Twilight_Lords", "http://www.goodreads.com/book/show/1539181.Samuel_s_Choice", "http://www.goodreads.com/book/show/1582066.Mary_Patten_s_Voyage", "http://www.goodreads.com/book/show/1582065.The_Orphan_Stone"]}