{"ratings": 54865, "userreviews": [{"userName": "Tatiana", "userReviewDate": "Jan 11, 2011", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As seen on The ReadventurerThis book is not going to be out until June, so I feel very lucky for having had an opportunity to read it so early. I hope it will get enough promo buzz over the next few months to reach tons of readers, because Blood Red Road very much deserves it. It is a stand-out in the new crop of dystopian/post-apocalyptic YA fiction, most of which is crap.The novel is basically an adventure quest set in a distant post-apocalyptic future. Saba's twin brother Lugh is kidnapped in front of her eyes. Why and where he is taken, Saba doesn't know, but she is determined to do everything she can to find and rescue him. Obstacles and adventures are ahead of her.I quite liked Saba. There is a bit of Katniss Everdeen in her - that familiar determination, stubbornness, strength, charisma and heightened survival instincts. In fact, Blood Red Road is a celebration of girl power. You will not see a single limp damsel in distress in this novel. Women here, regardless of their age, are strong and self-reliant and, surprisingly, they don't waste their time on trying to prove they have balls to the men around them by wearing pants and rejecting everything feminine. They simply are women and they kick ass. No gender politics and struggles here. Very refreshing.What else is great about the book it the writing style. I am guessing it will be a hit or miss with the readers. Saba lives in a world where almost all traces of civilization are gone. She can't read or write, so her narrating style consists of abrupt, grammatically-incorrect sentences. Somehow it adds character to Saba's voice and urgency to the story itself. The pacing of this novel is fast and it is never boring.On the other hand, I agree with other reviewers who think the first part of the novel is stronger than the second. Very true. The first half is intense and suspenseful, colored by Saba's single desire to save her brother. The second half is still well-paced, but is diluted by rather predictable plot twists and formulaic romantic back and forth. Although I won't be complaining about romance for too long. I would have been upset if there was none and the main male squeeze is a cool, likable dude. Sufficiently hot make-out sessions were greatly appreciated as well.All in all, I am left with a feeling that the beginning of the novel indicated that the book would be something more ambitious, something more important and meaningful. What it is is a well-written, fast paced adventure-type commercial teen fiction which is not such a bad thing IMO. Blood Red Road might not be my favorite book in the dystopian/post-apocalyptic genre, but it is definitely one of the better ones. I look forward to reading the next two books in this promising new trilogy."}, {"userName": "Jillian -always aspiring-", "userReviewDate": "Dec 27, 2010", "userURL": "http://www.goodreads.com/user/show/3085436-jillian--always-aspiring-", "userReview": "Listen up since you may never hear these words from me again about any other book:  I am not surprised in the least that this book is getting such buzz, nor that rights to the film have already been acquired by Ridley Scott.  You want to know why?  Because this book has everything that will keep anyone, whether a reader or movie-goer, hooked: action, suspense, drama, unpredictability, emotion, romance, and great characterization.Unlike other dystopian YA novels, Blood Red Road isn't focused on issues that lead to rebellion and upheaval.  You know what it is?  An adventure, plain and simple.  It's not seeking to teach but to engross and entertain -- and, for me, I was so thoroughly engrossed and entertained by this story that I really became invested in it over the course of almost 500 pages.Truthfully,  Blood Red Road brought with it much of the amazement and horror that books such as Wolf Tower, Poison Study, and The Hunger Games had brought me in the past.  The world-building is not the main focus here; the characters and their emotions are in the spotlight while the adventure of the story acts as the plot.And what an adventure it is.  Dystopian, as I felt with Veronica Roth's Divergent, gives too many false impressions and preconceived notions to readers about this book.  Rather, the term dystopian fantasy fits Blood Red Road just right since the world of the story is much easier to imagine in fantasy terms than realistic ones.  It's a fantastical adventure that, though lacking magic and swords, still manages to thrill and amaze.The heroine, Saba, honestly takes a bit of time to warm up towards. . .but she is loyal, brave, and gutsy.  She comes from a long line of heroines like Katniss from The Hunger Games and Katsa from Graceling who are flawed yet powerful, emotionally stunted in some respects but passionate when it comes to the well-beings of family, friends, and other loved ones.  Such heroines come to mean more to me than most other YA heroines, especially those who fall hard and fast (and oftentimes irrationally) for the love interests and who can't take care of themselves whatsoever without falling into angst or damsel-in-distress mode.Don't let me fool you into thinking that this novel is the Saba Show; yes, it's her story but that doesn't mean she's always the center of everything.  Honestly, I loved all the characters and every little piece and tidbit about them.   Jack, the love interest, didn't coddle Saba but tried to lead her to changing for the better even though she railed against him again and again.  Emmi, for being a little sister character, was not a whiny little brat; instead, she was a hard-working and loyal girl, a smaller version of Saba, just much more innocent and child-like.The dialect in the narrative may turn off some readers, just as the lack of dialogue tags and overt descriptions might, but I found all of it to be marks of this book's refreshing qualities compared to other YA dystopians focused on love and rebellion.  No, this book won't wow everyone, but those who value adventure in their stories may come out of this book with more praise than criticism.I really look forward to what happens in the sequels; I suspect that Moira Young will keep surprising and amazing me in equal doses.  June 7th can't come early enough for me to own my own copy of this book!"}, {"userName": "Wendy Darling", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "This review may contain mild spoilers, but they're nothing that you won't see in the trailer for the film. That's right, Ridley Scott optioned this book for a film before it was even published, and it's easy to see why. It's a hugely entertaining spectacle full of adventure and excitement and thrills, with action scenes that you can clearly picture as you read them.Saba's twin brother Lugh has been kidnapped by a band of horsemen, and she sets off alone on the quest to bring him back. Well, she tries to go alone, but her pesky little sister Emmi keeps finding a way to tag along after her, even though they're trekking through a dried up wasteland filled with danger around every turn. Here are some of the things that made this story super fun:* Saba is a bad-ass. There's no beating around the bush about this, the girl can handle a crossbow and won't let anything get in the way of her goal.* There is cage-fighting. Girl cage-fighting.* There is a thrilling prison escape.* There are giant killer worms.I could go on and on, but frankly if you weren't convinced by giant killer worms, this is clearly not the book for you. Oh! But there is one more very important thing: Jack. Tall, handsome Jack. Saba doesn't want to be distracted by anything, but it's pretty hard not to pay attention to a guy as attractive as this one. All of these things made Blood Red Road a great escapist fantasy, and I think most people are really going to enjoy it.There were, however, some things that I felt could have used a little more fleshing out: * While I liked the pivotal third cage fight, the previous two fights were throwaway scenes, which were lost opportunities for more action.* Some of the transitions between scenes could have been a little smoother. * There are two scenes of sacrifice in this book, both of which I expected, but both could probably have been written to pack more of an emotional punch. I did appreciate the clear visual beauty of the first one, however,* I also think the relationship in this book was probably its weakest point. I like Jack a lot, and I like Saba--but the push and pull between them felt unreasonably drawn out and a little forced. The dialogue there also bordered on a little cheesy at times, though again, I did like them as a couple. It's also important to note that the dialect in this book, which is harsh and a little grating, may be hard for some readers to stomach. Normally this kind of thing would be irritating to me, but actually I found the speech in the book pretty easy to adjust to, which is a mark of how great a job the author did with moving the action and dialogue along. There is also lots of terrific humor and great characters peppered throughout, though it might've been nice to give them a little more ink. What makes this book a 3 star book for me, though is that it's an enjoyable read but perhaps one that's not terribly...deep. Or complex. But then again, it's not really trying to be. Overall, the story is a lot of fun to read and the action and adventure provide one heck of a ride. Saba's going to be remembered as a literary heroine who is prickly and flawed, but still fiercely determined and ultimately extremely likable. I can't wait to meet up with her again to see where the next journey takes her.This review also appears in The Midnight Garden. An advance copy was provided by the publisher."}, {"userName": "mark monday", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "the protagonist of this post-apocalyptic YA western is a crow named Nero. now this is some bird! he has tons of personality: kind and generous and affectionate and reasonable and quick-thinking and a good sport and he finds clues and naturally he saves the day in the end with his excellent ability to fly swiftly & summon cavalry. Nero, you're the MAN BIRD! I loved that crow and was enchanted by his every appearance. ::happy sigh::the blurbs for this book describe it as a sort of Mad Max in book form. I dunno about that. maybe a little. I also dunno about it being a Road Warrior type book. however I would say that it is definitely a Mad Max Beyond Thunderdome type book, complete with a sort of thunderdome and tough kids coming out of their world to rescue other kids and get in all sorts of unpleasant adventures.so Nero flies through this blighted landscape trying to do the best that he can and usually succeeding. he is some kind of bird! \nunfortunately he is surrounded by a cast that is less than inspiring. there is a mysterious young adventurer named Jack who charms everyone and has important life lessons to teach and who spends a lot of time shirtless and who inexplicably hides important details about an important journey because... well, why exactly? I dunno. there is a two-dimensional villainess named Ma Pincher, I think, who is characterized by her apparent 'manliness' - which I suppose is a real flaw in a woman, right? huh. there is some character who enters the narrative so that he can die in the end. there is a tough and loyal little sister named Emmi, who I didn't mind so much and thought was rather adorable in her tough and loyal little way. there is a boy twin named Lugh who is pure good and who has long golden hair and a hairy chest and that's about all as far as characterization goes. most unfortunately there is a girl twin named Saba who is dreadful, just thoroughly repellent. unimaginative, short-sighted, petty, verbally and emotionally abusive to her younger sister, disinterested in anything but her own goal (sulks about saving the world for chrissakes!), and harboring distinctly creepy and quasi-incestuous feelings towards her twin. she was a real drag whenever she appeared. unfortunately she appears on every page.there is a love story that takes over in the last third which only made the stomach flu I was stuck with this past weekend feel worse. thanks a lot, love story!the cover is cheez whiz and that silhouette doesn't look much like the character it is supposed to be. and where's Nero??the voice is not badly done, I suppose. it is a FIRST PERSON YOU ARE THERE NOW I AM DESCRIBING THIS AS IT HAPPENS TO ME RIGHT NOW OMG type voice except in a Bastard Out of Carolina rural redneck twang and minus the omg. despite being annoying it was rather effective too. I guess. so thanks to the not-bad prose and especially thanks to the wonderful, amazing, delightful hero of a crow named Nero who owns every scene he's in, a painful-to-read book gets 2 stars instead of 1 star.good job, Nero! not only did you save the day, you just saved this book from being a completely excruciating experience for me! in the end, it was only rather excruciating. yay, Nero!"}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Feb 09, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "My First Impression-What the hell is this writing style?Immediately, you notice the grammatically incorrect sentences. For example:“Lugh’s bin sayin it fer a while now. Pa’s gitten worse. Mind you, he ain’t bin right fer a long time”My thoughts on this writing style:At first, I had a hard time reading it. After about 20 pages, I did not even notice it. As the story progresses, you realize how important this writing style is to portray Saba. The grammatically incorrect sentences reveal Saba’s rawness and her simple desire to survive without the need for fancy words or even correct words. Saba can’t read, or write. She hasn’t even seen a book (they were destroyed by the Wreckers- the people responsible for the Post-Apocalyptic world they are living in), never written a sentence, and never had a need to. The Characters-Saba:Saba had me all over the place. I hated her, loved her, felt pity for her, felt anger for her and in the end, I wanted to cheer for her and tell her good job! Saba is your typical “middle child” in the beginning. She lives a life of non-existence. As the story progresses, you see Saba grow into an individual person and not just one half of a twin.Lugh:Her older brother (he’s Saba’s twin but older by two hours) is always in the lead. Where Lugh goes, Saba follows. Saba doesn’t have to think, or feel, or live beyond the four walls of her shack because no one expects her to. Lugh does the thinking. Emmi:Saba’s younger sister Emmi is the one that gets the blame for all the problems (the rest of the family doesn’t blame Emi but Saba’s blame & poor Emi’s guilt play an essential part in the story regarding the development of the characters). If only Emi wasn’t born, her mom wouldn’t have died. “If only” happens a lot to poor Emmi. You feel for her. Emi was one of the sweetest, most enduring characters. I loved how Emi came out stronger than anyone imagined by the end of the book.Jack:I waited, and waited and waited for Jack to disappoint me. He’s the romantic interest for Saba and I expected the author to do the typical “lack of trust” route or “misunderstanding” route often taken with the romantic interest in the book. Did not happen. Just because there was trust and overall communication, doesn’t mean the potential romance between Jack and Saba was boring. In fact, I loved their interactions. Jack not only put Saba in her place regarding the way she treated Emi but he also challenged Saba in the way she thought about herself and their relationship together.The Setting:Dusty. Dirty. Gritty. Blazing Sun. Deadly winds. It does not rain, it pours. The people are not civilized, they are trying to survive. Get in their way, you die. You can’t fend for yourself, you starve and then you die.What I loved:Saba wasn’t perfect. She screwed up plenty. It’s easy to forget that she is so young when you really get into the book. There is a point when she is running out of water and she uses some of the water to clean her face. This is what a girl just trying to survive would do. The author made her imperfect in an imperfect world. Because of that, I loved Saba and the story even more.The 2nd half of the book. It was more character oriented and less action/world building but I thought it was wonderful. I love how the reader is witness to Saba’s transformation. The pace in the 2nd half is slower but much more personal. In the beginning, it was all about survival and tactics, and figuring others out. The 2nd half was watching Saba's walls come down and the development of her relationship with Jack, her sister and her new friends. What I didn’t like:Small holes in the story. I really had to look for things not to like. That is how much I loved this book.Overall:Loved it. I want the 2nd book now!"}, {"userName": "Emily May", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "This is the novel that I wanted Graceling to be. An alternate world/reality full of adventure with a hardcore warrior heroine, and here's the key bit, who doesn't feel the need to unsex herself (à la Lady Macbeth) and prove that she's not feminine. In fact, all the female characters are wonderfully strong and unforgiving, no damsels finally, and there's just a general sense of equality - pretty much everyone is a warrior without a masculinity v. femininity contest. Where Graceling seemed in some ways downright offensive to a 'certain type' of women, Blood Red Road has a heroine who is unapologetic of her gender and doesn't attempt to constantly prove herself by becoming stereotypically masculine.Saba is a great heroine. She makes no pretense of being some kind of saviour or martyr, she simply has two missions: find her brother, and stay alive. She uses violence throughout, but only to accomplish her missions rather than some kind of demonstration of her worth. I also liked the love interest of the novel, even with all the unnecessary dithering about they both did with regards to one another, it seems romance is never straight forward.The dystopian element of the novel had just the right amount of action and horror, without that \"I'm just cruisin along through this awful, oppressive society\" like in Matched, where it's damn near impossible to care about the characters because even they don't seem too bothered about the whole situation. It was a refreshingly quick take-off too. I prepared myself for a slow start when I encountered dust clouds in the first few pages (uh, do I care?) but the novel got to the action almost instantly with a murder and kidnapping - that's right, no Diana Gabaldon style digression from the main story, I've missed this kind of novel that get's into the thick of the plot right away. Oh, and another thing... journies. I love journies in novels, when they're kept at a good fast pace you feel like there's constantly something happening. Though the books are actually very different from Blood Red Road, one of the main reasons I loved The Knife of Never Letting Go and Beyond the Deepwoods is because they had awesome fast-paced journies throughout. So, yeah, kudos for that.I know some people who've read ARCs of this didn't like the language style, but I did. I've always liked different accents, dialect and colloquialism. It was different, but a good kind of different. Though, on that subject, I'd just like to finish with my own opinion of a bad kind of different:\nWhat on earth is this bloody awful UK cover?The US version is a million and one times better:"}, {"userName": "karen", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this book is one of the most-anticipated release titles in teen fiction, and i got to read it early because ariel is a gift to mankind.take that, teens!! you guys get fast metabolisms and hopeful outlooks and unlimited potential, and i get advanced readers copies. even steven.so she gave me this book about twins and a bird, which is like giving a new young mother a buddy book where a kidnapper teams up with SIDS for adventures and romance.but i braved my fears and read what i was hoping would be cormac mccarthy for teens- a postapocalyptic meditation on evil where a chick on a horse roams the desert enacting vengeance and trying to reclaim her kidnapped twin. sounds rad, right???i started reading this on the subway home from going to see true grit. as blood red road is about a rugged sunbaked environment and a girl on a horse with a mission, there was no way i wasn't going to visualize that true grit actress in this role, even though she was considerably younger than the girl in this book.this is simply anecdotal and maybe i am stalling?? the book is very fast-paced, and the story is exciting and original - the kids are going to love this. me, i had troubles with my disbelief-suspension because i have been around the literary block and have read all sorts of books, but i was still enjoying it and turning the pages rapidly with anticipation. the cage match stuff was the best, and i would love to have read more of that segment. it reminded me of blood of heroes, which is an excellent movie. WHY DOES NO ONE AGREE WITH ME ON THIS? but in this book: two girls, one cage - anything goes. and any girl who loses three times gets to \"retire\" by being torn apart by the rabid crowd. why have any additional plot? this is all i needed to love this book. alas, it was but fleeting. but while it was happening, it was badass and i was riveted.however, the romance subplot was the weakest element. she is eighteen, he is ... older, but they act like teenagers in their mood swings and emotional fumblings. and ariel pointed out that in this situation, where there are so few people and no way to pattern behavior and no expectations based on media, etc, they would naturally behave in an awkward way, but if this is the case, it requires a lot of psychological extrapolation on the part of the reader, which seems unkind to a teen audience, who are necessarily weaker in their extratextual assessments, simply based upon inexperience, so i am dismissing that explanation. hear me, ariel - i dismiss it!it was good, and i will read the rest of the books when they come out, no mistake, but it didn't turn me inside out the way hunger games did. it just seemed... superficial. katniss has depth as a character - she is flawed, but her flaws make sense and humanize her. this character is just single minded to her own detriment, and prone to little hissy fits. again, this might be a result of not having anyone in her life to teach her behavioral norms, or just of different norms for a different world, but characters take really serious actions that should have repercussions and consequences, and they make these decisions so casually. YOU ARE LIVING IN A WASTELAND! WITH SCARY SANDWORMS AND A MANIACAL KING!! CAUSE AND EFFECT NEEDS TO BE CONSIDERED, PLEASE. don't just assume there is going to be a \"later.\" y'all need to communicate better.it may be the next big thing, but it may not be my next big thing. i will most definitely read more of this series, and the rest of you can wait until june to make up your own minds."}, {"userName": "maymay❀", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "Full review posted: Here’s a fun concept, let’s write a book but instead of using actual WORDS we’ll just slam our palms against the keyboard repeatedly and then publish whatever we get!!!1!!11!!1!! ~best seller~I want firstly to apologize to the synopsis of the book bc it was too good to be representing such an awful book remember, this is my opinion Secondly I want to apologize to grammar rules of the English language. I’m sorry this book killed you, you deserved better. And for those who think I am overreacting, this is what we had to work with:\nLugh thinks fer a moment. Then he says, Love makes you weak. Carin fer somebody that much means you cain’t think straight.\nThis book definitely takes place in a dystopian world because quotation marks are extinct. So, as you can see, getting past the writing is a feat on its own (which I was not able to overcome bc I was too busy clawing at my eyes after reading 3 sentences) Thirdly, saba is a terrible main character. Not only is she a self-pitying, whiny, loserhead but she’s so incredibly mean to her little sister it made me sick. she even reached a point where she slapped her in hER FACE LIKE THE KID IS NINE YEARS OLD YOU PIECE OF TRASH. And she went all ‘boo hoo, woe is me what have I become’ but THAT DOESN’T MAKE UP FOR ITThis book tries REALLY hard to make it interesting and so it builds conflicts upon conflicts upon conflicts that result from some hella dumb decisions and are all so underdeveloped it’s just, I can’t. andthentheromancemeet prince charming\n “Like what you see, Angel?” he says.\nAt this point I was doing that ear shattering screech bc GET ME AWAY FROM THISAround 50% of wading through this swamp of a book I finally decided that I didn’t hate myself enough to continue and so I skimmed to the end and read a Wikipedia synopsis (why are there so few of those, I demand more) Wiki tells me that a few side characters, who I didn’t particularly care about, die in a very lame and unnecessary fashion and to this I say ha! I knew this book wasn’t worth it. And the characters are so dumb like they have absolutely NO game plan, they don’t think twice about ANYTHING, they trust EVERYONE like fricken just make it stop please Thus ends my suffering bc please don’t make me relive this book again “Yer in my blood, Saba, he says. Yer in my head. Yer in my breath, yer in my bones...gawd help me, yer everywhere. You have bin since the first moment I set eyes on you.”^can someone translate this into English for me thanks 1 star! ~~~~~~~~~~~~~~~~~~~~~~~~i never heard of this book in my entire life until my canadian sista told me and then i read the synopsis and died bc it sounds incredible\nBuddy read with my partner in crime, my bleach bae"}, {"userName": "Flannery", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/652877-flannery", "userReview": "[Lugh and Maev love connection? *wink* (hide spoiler)]"}, {"userName": "Caitlin", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/4337019-caitlin", "userReview": "[2.5 stars. (This is a long review by the way :] ) First off, I was really excited about this book. I love dystopians not based around a controlling society, but a anarchy. Plus, I love the desert, wasteland feel. Growing up in the desert, I know a thing or two about it. But this also may be the reason why I'm so hard on the book.Blood Red Road has so much potential, it's practically overflowing with greatness. But sadly it falls short of just that.I liked the book, but there's a ton of stuff I didn't like about it too. And as always, dislike over rules like. First things first. Dislikes.PROSE: Blood Red Road is written in dialect--so it's 1st POV, but the narration follows the exact voice of the main character (Saba). There's a few books out there that have the same type of prose. The Adventures of Huckleberry Finn. Every heard of it? Well, unlike Huck Finn, the dialect prose doesn't quite work for Blood Red Road. Using dialect is difficult. It lacks detail on the surroundings and goes more in depth with characters. Plus, sometimes it's difficult to read dialect in your head. Young does a great job at writing her voice (mostly. there's a few spots where I read out loud and found that it still sounded funny) but she chose the wrong prose. I mean, I wanna know about the world. About the battles Saba and friends face. I want to feel the gritty earth beneath her feet and feel the urge to win in cage fighting. But we only get the minimum. This may be a dystopian, but I still treated it as if it's a fantasy. It's a whole new world--a wasteland full of thieves and murderers. Yet, even after experiencing it, it still failed to show me. I wanted more of everything.Another thing about the prose that drove me insane was the way Young wrote everything. Short. Sentences. Usually writers use short sentences to create tension, to really get the adrenaline going during actions scenes. Young uses short sentences all the time. Enough to kill the tension. After awhile I didn't care whether Saba was fighting for her life or just riding a horse. I'm not kidding you. By the end of the book (which is nearly 500 pages) I was pulling out my hair. I couldn't finish it one sitting because I couldn't stand the structure. Sounds like I'm being picky, but as the book progressed the more annoyed I became.SABA: FOr the first few breaks (there's no chapters just little breaks that probably waste half the book due to white paper) I actually liked her. She was a stubborn naive girl. She loved her brother and her father, living on her dry farm, blah blah blah. Then as soon as her bother is taken away, suddenly she's a changed individual. I mean, she's like, \"I'm a bad ass who hasn't left my little isolated farm and can't read! that's right! I'm not afraid to kill!\" That right there made me angry. It's possible she could develop from naive girl, depending on her father and brother, to warrior chick, but we don't see any of that development. It wasn't till over half way through the book she started to fall back into my favor again. But that was due to different characters and the development between her sister and Jack. Shows that she's vulnerable (but not too vulnerable!)HOLES: This book is like swiss cheese. Usually I don't mind swiss cheese. It's an okay cheese, but books aren't suppose to be swiss cheese. As long as the holes can be patched up in a book or two, then I'm alright. I don't even care. But the holes in this book are purely fact based. There's on moment where Saba is traveling. She's thirsty so she drinks water then splashes her face with water. My thoughts at that time: \"What are you doing? You're in the desert? Don't you need water? Why are you wasting it?\" But I let it pass, thinking there must be some reasonable explanation. But then a little bit later she's like \"We're low on water!\" Palm to the forehead. Seriously? Didn't you think of that before? Stuff like this happens through out the book. She could have killed the bad guy, half way through the book, but instead just says, \"Oh he looks dead. So he's dead.\" Or, my favorite, that Saba exposure and knowledge of the world--less than that--society is very limited, yet she's able to handle things like some God damn genius. I don't know. Some may disagree--and I'll admit. She had moments where she seemed \"naive\" but not enough moments. I mean, I don't care if your 18, you can still be a child. And the prose may be partially to blame. The lack of detail and short sentences don't help expand ideas or the surroundings.CLICHE/AIRS: Like holes, I'm okay with cliches, as long as they tread their own path away from the typical structure. Blood Red Road actually didn't have many cliches, but the ones that existed in the text, were the ones that mattered. If you've ever watched a western--or are a western fan, then reading this book may feel familiar. Jack (which is a total western, rough and tough name) and Saba's relationship is cliche (I hate you, then love you) but even the characteristics between them are cliche (Jack's the tough loner traveler. Bad ass, only cares for himself blah blah blah. No plans just ideas. Wild card). But of course he can't resist Saba's stubbornness. I won't go any further. I'm not saying I didn't like it, but man, I'd like to see some originality. Then, besides the romance cliche, you have some other western cliches. You know, scary lookin' guy, but he's a all soft (Ike, sound familiar?) with a kid, (Tommo) and then deaths that seem almost pointless. Or the end--yea, that was a cliche too.Airs as in, half this book gives off this \"this is impossible, air.\" There were moments in the book were a \"mission\" was deemed \"Life threatening, like, luck's the only thing that's gonna get us out alive.\" But then, all the sudden everyone's alive. Hardly anyone's bleeding. Now wasn't that easy? I felt like every other event was like this. Talks it up, all big and scary and ends up finishing in a page or two. I don't know. I just found myself sighing, wishing for more. (AGain this may be due to the prose). That realistic, \"this makes sense\" feeling was missing..LIKES.Okay, so I know I'm raggin' on and on, but I did enjoy the book. I mean, yea I hated the prose, ready to put it down, but I kept reading because the plot was intriguing. So much more can be explored, but Young did a good job at leaving the book as a stand alone (BUt it's gonna be a series. It says so, damnit). They're many unanswered questions--who's the Tonton? What about that Chaal? What about Jack? What about the stars?I don't need to tell you there's action. You're guaranteed you'll be blown away instantly (like literally because of the dust storm) and if you loved that never ending stream of activity, well this is the book for you. Blood, fights, instincts. All here. My favorite part was Saba and Emmi's relationship development. In the beginning it was obvious Saba despised her little sister, but by the end it was love all around. It was a nice easy pace (unlike Saba's own transition) and I was pleased. Overall, this book may seem great, but once you sit and think about it, things fall apart. But in reality, this book isn't a \"thinking\" book. It's an action book. All that is required is \"go go go go\" and you definitely go go go. All the time. (hide spoiler)]"}, {"userName": "jessica", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/10171516-jessica", "userReview": "phew! this book was an uphill battle for me. i thought the story itself was so very cool and quite the adventure, but i just could not get over the writing style. if youve read this, you know what i mean. its written in first person with the narrator speaking in VERY improper grammar, no punctuation, misspelled words, etc. its quite difficult to get used to and i nearly gave up several times. but like i said, the story itself was my only motivating factor. i think if this been executed differently, i would have absolutely loved it. but right now im just kind of ‘meh’ - there were parts i loved and obviously parts i didnt. at the moment, im unsure if i will continue the series. \n2.5 stars"}, {"userName": "C.G. Drews", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "Omg what are words. WHAT IS AIR. HOW DO I POSSIBLY SUM UP MY INFINITE LOVE FOR THIS BOOK?!?!?! I've borrowed this a billion times from the library and ALWAYS sent it back unread because I peeked at the first page and...slang and no dialogue tags? Um. no thank you. I WAS A DELUDED PENGUIN BRAIN AND I CAN'T BELIEVE I DIDN'T GIVE THIS BOOK A CHACNE TILL NOW. IT IS BEAUTIFUL AND PERFECT. You know those books that you feel like are written For you because they do everything absolutely perfectly and do ALL your favourite things and just afjdsaklfd feels and intense flailing and omg, this book = I love it an astronomical amount.I still can't get over how it basically had a checklist of EVERYTHING I love in a novel, like:• Twins who are the sun and stars to each other and would die for each other.• HUGE emphasis on family and siblings.• A seriously tough narrator who is tough but relatable and ornery but not too proud to say sorry. • FIGHTING AND VIOLENT STUFF YeAH• Unique formatting (in that it had lateral spelling and no dialogue tags and no chapters)• Never spares the characters and people get hurt and die ALL OVER THE PLACE• Tough grittiness that just makes me squeak with pure happiness.Omg, thank you bookish universe for this book, is ALL I CAN SAY. I'm 10000% convinced it was written for me. That is all.HAHA JUST KIDDING. I'M GONNA SAY MORE BECAUSE I'M OBSESSED.The more I read, the more I had these intense feelings of \"How is this book so incredible?!\" I have a really rough month of reading ... like all 2-stars and shoddy plots and just BLAH. But Blood Red Road was different and unique and exciting. And while the no-dialogue-tag thing bugged me originally, I got used to it. (I still am not entirely sure why there are none though?) And I LOVED how it was all lateral spelling like ezzack = exact; especkted = expected. It reminded me SO MUCH of The Knife of Never Letting Go (which I also adored; NO SURPRISES). And usually I hum and haw over my star ratings but I KNEW this was 5-stars all the way. ALL THE WAY FOLKS.And the characters?!?! They are my darling little tough spitfire babies. ALL of them were incredible. Even when they picked up minor secondary characters on the journey, I still loved them. BECAUSE THEY'RE TOUGH BUT RELATABLE. Usually, I see the tough characters who would chew you up for breakfast and I'm like \"eh\". But omg, these guys?!?! They all managed to feel so dimensional. • SABA: She's the narrator and so so ornery. She's hard and sharp and so mean, but she has intense feelings and she's just working hard to survive and not get hurt, you know? She loves her brother so much and she'd die before she gave up on finding him. I LOVE SABA. Although, she is flawed. TOTALLY flawed (this just makes me love her more, tbh) because hse has a little sister, Emmi, who their mother died giving birth to. Saba blames Emmi, which is stupid, but she's just MEAN to Emmi the whole time. And their relationship growth is just about the best thing of ever.• LUGH: He's Saba's twin. She describes them as the sun (him) and the night (her) and I loved them both so sos much. Obviously Lugh's not in the book much since he gets kidnapped in the beginning and the book is about getting him back. BUT. We do get a few scenes with him and he's so so lovely and wonderful. And I wanted them to save him so so bad.• EMMI: SHE IS ADORABLE. She's really a lot like Saba, which is probably why they clash so badly. She's 9 and skinny and gangly and refuses to be left in \"safe places\" while Saba goes to find Lugh. She never does what she's told either and her and Saba bicker the whole time. :')• JACK: Omg, Jack Jack Jack, how do I even describe my love for Jack?!! Obviously he's the love interest and I LOVE HIM TOO. SO YEAH. SABA AND I HAVE THAT IN COMMON. But they have a real hate relationship to start with and it's adorable I ship it so so hard. Why do I always ship the ones who hate each other?!? Gah. But they help each other and they save each other and they kiss each other, then they punch each other. And I just ADORE THEM. Jack is a snake and a charmer, and Saba is earth and reality. New OTP. 'Scuse me, I shall be over in my corner shipping.• FREE HAWKS: They're a group of outlaw fighting girls who go around causing havoc to evil and just are generally AWESOME. ...okay, okay there are more characters but I won't go into everyone. Least to say EVERYONE is dimensional and I loved all their names (Lugh! Saba! Epona! Ike! Tommo! Maev!).The plot is a bit of a journey, bit of a time bomb. Like Lugh was kidnapped and they have to a) find him, and b) get there before certain date. It makes the plot SO STRESSFUL. I couldn't put it down. And of course there are detours for battles and kidnapping and omg, all the cage fights. I think that was partly my favourite bit because it was SO INTENSE. Saba is a violent scary person and I love her.SO DID I MENTION HOW MUCH I LOVED IT YET?!?! hahahahah. *ahem* I do. Quite a bit. I shall be reading the next ones stat, because I am NOT happy with that ending. Like blood everywhere, but no no no it did not have a happily ever after and I'm so invested in these characters already that I need to READ FOREVER and see them have a HEA. (Ha. I bet they won't get one.) And I need more of Saba and Lugh and Jaaaaaack. I loved the pacing (although, tbh, it IS probably a bit needlessly long) and I loved the characters and the action and the dusty dry setting. I JUST LOVED IT, OKAY?!?!? How did I put it off so long...omg, I am so deluded.(Everyone needs read this now.)"}, {"userName": "Joyzi", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/1591538-joyzi", "userReview": "[How about the next book? Who will be the villain and what will be the conflict? (hide spoiler)]"}, {"userName": "Jo", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/2467655-jo", "userReview": "“If you know how to read the stars, you can read the story of people’s lives.”\nInitial Final Page Thoughts.Blaaaahhh I had such high hopes for this book and I thought I was going to love it. And I did until about half way through… and then I just wanted to punch things the red hot descended and things got fuzzy.High Points.The first half. Emmi. Jack (and his hairless chest). Ike. Tommo. Nero. The setting, Ms Young certainly knows how to set up a story and build a world. Loved it. Written in the stars. Action-packed. The language (Everyone knows I’m a Nessochist… the language really reminded me of The Chaos Walking Trilogy.) Gladiators. Gauntlet. Nero. Skinny dipping. Gee-gees. Badass girls (Again… very Answer-like, no?). Bow and arrows. Boys with swagger. Nero.Low Point.Saba…. I’ll deal with you later. That effin’ heartstone. COME ON. Epiphanies? No thanks. I just really didn’t care about the characters enough to get sad when everything happened at the end. It should have been sad… but it wasn’t. The whole second part of the book, basically. It was just so random. All coherence seemed to go out of the window and shreds of plot was just thrown at me with giddy abandon. I’m probably just being too fussy and harsh but I’m so disappointed because I thought I was going to love this book. And I always get the angriest and show no mercy when I feel let down by a book that should’ve been amazing. Heroine.Sabby… can I call you Sabby?No?OK, fine I’ll just call you AFP Saba. You had all the qualities that I love in a heroine: You’re feisty, you’re a bit of a bitch, you can cage fight, you love your family…ish and boy, are you determined. In the first half.Then what happened? Did someone slip you some chaal? And Tell you to have absolutely no common sense? Tell you to be as oblivious as…um, an oblivious thing? Tell you to constantly pick fights with your heart’s desire for no reason? Tell you to compare your heart’s desires naked body to your brother’s naked body? (Weird, btw, Saba… weird) Tell you to be a complete and utter little madam with your sister (who did nothing to warrant your hate)? Tell you to lead your heart’s desire on and then leave him in the lurch and then whinge when he started to lose interest? Tell you to keep making stupid decisions that would put everyone in jeopardy because you had to get your own way? Tell you to ignore what anyone had told you and keep asking why that bloody heart stone kept scorching you? (JUST THROW IT IN A RAVINE IF IT CONFUSES YOU TOO MUCH)Wait…someone did slip you some chaal and make you do all of that?That Nero has a funny sense of humour, doesn’t he?Love Interest.Jack, I really liked you. You’re a rebel. You lost the pony tail (Close call on that one). You were cheeky. You were rough around the edges. You could hold your own against a killer worm. You are exactly how I take my men…. But then you had to go and spoil it all, didn’t you? By singing like a freakNo. It’s not fate. It’s you being a typical boy and fancying the unattainable girl and then confusing fate with insta-love. And it’s your own fault. And you’ll have to suffer the consequences. And when I say consequences I mean being with the moodiest cow in all of the land FOREVER. Or at least the next two books (minus the chapters they fall out for no reason). HA.For the record, I’m fully Team DeMalo. Just me? OK. Best Friend/Sister.I HAD SO MUCH LOVE FOR THE HAWKS AND EMMI. See? I am capable of being positive. Baddie.The King…. I just… WHAT. Why did he keep referring to himself in the third person? Why didn’t he die? I’m sorry… did I miss the bit where we were told he a psycho killer from a slasher film?! And if he was so obviously B.A.N.A.N.A.S then why did grown, fearsome men play his little games and believe his crazy ideas? I just didn’t understand. AT ALL.Theme Tune.All Sparks- EditorsAll sparks will burn out in the end.That really sums up my thoughts for this book. What a shame. Angst Level.100/10. That’s right. And about 2% of that was genuine sadness… mostly in the first few chapters. And a tiny bit at the end.The rest, ladies and gentlemen, is 98% of complete and utter boy angst. Seriously. Seriously. We were told you were a warrior. A badass. You can shoot a bow and arrow. But when you are near someone of the male disposition you start spewing all this “I ‘ate him and his crooked grin”/ “But actually, he’s jest Jack. And this weird necklace thing is buzzin’ and burnin’ at me… but I don’t know why” *sexysexyflirtyflirtyleadthepoorboyon* “What nooo. I hate you. Yer annoyin’ and I can’t do this.” *silenttreatmentforafewchapters* “His silver moonlight eyes are lookin’ pretty fine right now.” “Maybe I do fancy ‘im. I just wish I had some way of knowing how I felt about Jack but alas, no. I just have this necklace that is melting into my skin whenever I’m near him. I’m sure that supposed to mean something…. Never mind. I hate you.”Saba, I don’t mean to be rude… but aren’t you supposed to be looking for Lugh? Y’know… saving your brother’s life. Not ogling the waxed-chest wonder with his swagger-boots and basically being ridiculous over your complicated feelings for him? That’s my job. Recommended For.Everyone who isn’t me and my friends who read this with me, apparently. Seriously. I think there is something wrong with my mind. I feel like I’m going to get shunned from the YA community and lynched and other terrible things. People who like dystopian books. People who like adventure books. People who like strong, kick ass heroines until they turn to Play-Doh when a boy walks past. People who like books with a fantastic setting. People who know who wish they had a sassy crow sidekick. People who get excited at the prospect of singing killer worms bringing us home. You can read this review and (slightly less angry) other exciting things on my blog here."}, {"userName": "Meredith Holley", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/1302775-meredith-holley", "userReview": "!!!!! This book kicks my ass. Moira Young has gotta be the Beatrix Kiddo of y/a writers. She comes in here, probably blindfolded or some such, turns the conventional rescue story on its head, and then writes it all out in solid, beautiful dialect because that’s just how badass she is. The effortlessness alone is enough to make me think we’ve arrived in some new country of storytelling. Suddenly, we’re in the middle of it, and I didn’t even realize the tour bus could go there. I don’t even want to talk about all of the incredible women in this book because the telling of it is so nonchalant and so free from politics that it seems a shame to freak out about it. Even though it does make me freak out. We should have been talking about women like this the whole time. These girls are so legit. They talk to each other like girls talk. They kick ass the way girls kick ass. They are smart, but they’re not trying to throw it in your face. They’re just incidentally as cool as actual girls.I won’t tell you much about this book because I don’t want to spoil all the transitions from one kind of beauty to another. I don’t want to spoil the easy absence of agenda, the genuine relationships, or the well-timed action. As I said before, this book kicked my ass, so I’m still in the fetal position, spitting blood and reflecting on the wussiness of my life and writing. However, I will pull myself together enough to reflect that, aside from being a post-apocalyptic story about how to be a sister and how to be a woman, this book is incidentally also about power and slavery. Don’t get me wrong, though. This story is not allegorical in the way the Hunger Games is. (I really don’t want to compare the two books, though, even though they are somewhat similar. The comparison really annoys me because I feel like it comes down to the scarcity of books with truly badass female characters. Comparing the writing would be like comparing Zora Neale Hurston and Willa Cather. Why would you? Both are wonderful and wonderfully different. It seems vulgar to compare authors only because they talk about women living in similar settings.) I am reading in a message about slavery here because, while this book contains slavery, it is ultimately about adventure, not about slavery or morality or politics.I am studying slavery in Zanzibar right now, though, so I’m going to comment on it. Estimates say that there are about 30 million slaves in the world right now – more than all of the slaves in the 19th century trans-Atlantic slave trade. Most of them are women and children. They process our sugar and coffee and chocolate. They work in fields and in brothels and in homes. They live all around us. The Oregon State Bar estimated that in 2006, slave traffickers made more money than Nike, Starbucks, and Microsoft combined. Slavery doesn’t just exist in post-apocalyptic dystopias. And, as this book gracefully illustrates, it is perpetuated by both men and women. Young does a lovely job of showing the grotesqueness of feeding off violence and humiliation. She also shows the beauty of revolution.My only complaint about this book is that I think the second half loses steam. Spoiler alert? There are many excellent parts still, but it doesn’t have the magic of the first half. It felt like the plot got heavy, and she sacrificed some of the story-telling to a checklist of what characters needed to die to fulfill y/a requirements. It didn’t feel as careful as the first half. I think I would have preferred to leave more unanswered questions than to tie the plot up so neatly and formulaically. **End possible spoiler alert**I’m not sure I’m even complaining about that, though, as I still enjoyed it. If I had loved the second half as much as the first, I think this would have become my favorite book of all time. As it is, this book is still probably in my top 10.!!!!!_______(I read this as an ARC on my Kindle that a friend gave me before I went to Zanzibar. Thank you, friend!!!)"}, {"userName": "Limonessa", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/4147373-limonessa", "userReview": "2.5 stars There are many successful books that get turned into movies. Not necessarily good movies. Actually, it is very rare for the movie to be better than the book. But not impossible. Blood Red Road might be one of such rare cases. I read somewhere that this book was optioned to be become a movie even BEFORE being published. That's where the problems lies: Blood Red Road is trying too hard to be a movie before even being a book. That means that while it's got some elements that would be of stunning effect on screen - cage fights, killer worms, a battle à la Braveheart - it falls a bit short on the elements which are needed to make it a good book. I am talking about a solid plot, characterization, worldbuilding and... well, common sense, actually. Set in a post-apocalyptic world, we meet Saba, her twin brother Lugh, her sister Emmi and their father living in Silverlake, a place which reminded me a bit of the movie Mad Max. The mother is dead and they are experiencing a terrible drought that is making their lives really hard. When some mysterious men on horses kidnap Lugh and kill their father, Saba sets off with her little sister to rescue him. It is during this quest that she becomes involved in spectacular cage fights, a jail breakout, a race across the desert and killer worms. With the aid of a team of rebels, Jack - a guy to who she seems to be unexplainably attracted to - and his friends, will they succeed in their mission and save Lugh from a terrible destiny?The beginning of the story is really promising. It has a certain The Reapers are the Angels feeling which I really like. Both the use of the language and the lack of quotation marks enrich the book and the rhythm is so fast-paced that it is pretty difficult to put it down. The narration is engrossing, the scenes spectacular and very imaginative. As I said before, it is probably going to make a nice movie. Up until about 70% I would probably have given it 4 stars.But then things started going downhill and even the little flaws that I had spotted before and was willing to overlook - because the book was fun - started to add up and become one too many.My first problem is with world building. In this book it's so basic that if I had to draw it on a map, it would look like one of my 4 y.o. daughter's drawings.We set off in SilverLAKE, we pass through CrossCREEK and reach HopeTOWN. We then take horses and go meet people under some DarkTREES, cross the DarkMOUNTAINS and after a battle in the FreedomFIELDS we go live happily ever after to the BigWATER. There is no mention of other towns, of other people even existing outside of Hopetown, no hint at how this world is structured. Take the King. What is he king of? It feels like this world is populated by just a handful of people who live in a bunch landmarks.The plot had too many holes, there are too many things which don't add up and which include - but alas, are not limited to: -Saba's ability to fight like a pro wrestler with no prior training whatsoever;-the unlikeliness of the all-knowing crow;-the use of telepathy on various occasions between characters;I was constantly asking myself questions which belong to the sphere of common sense: -why would one take a 9 year old on a suicide rescue mission?-why would one shoot a clearly already dead person and NOT the source of all her problems who only SEEMS to be dead? -why would a king hold a celebration that takes place once every six years and which testifies his power in front of a bunch of slaves and not of all his subjects?and most of all:WHY does Jack like Saba?Which takes me back to the last problem: characterization.With the exception of Saba, who is a well formed, albeit unlikable character, I thought the other characters fell a bit flat. I felt that JUST AS they started to become interesting, something happened and they were interesting no more. Take Jack for example: from cocky bastard he turns into besotted idiot. And for the life of me I could not understand why he became so enamored of Saba. She is so inconsistent and fickle, so apparently unexperienced, rather morbidly fixated with Lugh... I admired her stubbornness and her ability to hold her own but why Jack would be so in love with her... not a clue.And I won't even talk about Lugh.I am sure all my questions will be answered in the sequel(s) to this book, but I need them NOW. Their absence is enough not to make want to pick up the sequel to this."}, {"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Jun 06, 2011", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "2.5 stars I believe that, consciously or unconsciously, every author has a list of priorities he/she keeps in mind when writing a book. I know that every reader has priorities/expectations/preferences when choosing what to read. Unfortunately, Moira Young’s priorities and mine are very, very different.To be perfectly fair here, she didn’t write this book for me. She wrote it for teenagers who have a hard time focusing on anything for too long. And I have to give it to her, the book is an attention gripper from start to finish. It will entertain you as long as you don’t think too hard about it. Because once you start thinking, it all goes down the drain. I also think that Blood Red Road was written for people who need to visualize something clearly in order to enjoy it. I’m not one of those people. I have to feel and then feel some more, and the only thing Saba made me feel was annoyance. There were so many inconsistencies in Saba’s character. Her life was described as completely isolated, from when she was born until the men showed up and took her twin brother away, shortly after their 18th birthday. Her mother died giving birth to her younger sister Emmi, and for the first 18 years of her life, the only people Saba ever talked to were her father and her brother Lugh. She mostly ignored poor Emmi. Knowing that, her understanding of people’s nature and behavior later in the book really bothered me. She was too insightful for someone who had no experience with other people. I thought about it a lot last night, and then this morning, entirely by accident, I stumbled upon a blog post written by Ann Aguirre in which she addressed this very issue. Her character Deuce (Enclave) also grew up pretty isolated, in a small community that lived underground. Ann was asked about the much hated love triangle she included in the book. This was (part of) her answer:Her (Deuce's) emotional intuition is pretty close to nonexistent, and she misses cues that seem obvious to us because she's very underdeveloped in that regard. Yes, it's obvious to us that Fade digs her and that Stalker does too, and that by training with him, she's making Fade think she doesn't like him. But Deuce doesn't think in those terms. Stone and Thimble were her closest friends in brat-hood, and she never encountered an either/or situation with them. And that's really her primary source of social experience. She has no romantic history whatsoever.And that's why Aguirre is one of my favorite authors. If an author wants me to really understand the character, he/she must do the same first. I know many people had problems with the dialect that was used in this book, but for me, that was the best part. It was extremely well done, very consistent, and it made the rest a little more bearable. I can’t really recommend this book, but considering how most of my friends rated it, I can’t not recommend it either. All I can say is that I won’t be continuing the series."}, {"userName": "Vinaya", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/4687823-vinaya", "userReview": "The whole time I was reading Blood Red Road, there was a part of me standing away and thinking — where is it? Where is the part that's going to twist me up and spit me out? Where's that intense feeling that marks a book I truly loved? Tragically, I never did reach that part.In part, my expectations are to blame. I read too many reviews and they all loved the book so much, I think I was expecting it to be as spectacular as the Second Coming of Christ. My expectations were pretty much sky high, and this book had to pay for their unrealistic nature. But the other part of it is all on Moira Young.Unlike a lot of other readers, I had no problem with the dialect. I've read books with way harder dialects, and this one was an easy transition. The problem wasn't so much with the dialect as it was with the sparsity of the prose. There were sentences. Very short sentences. With no description. Which is one of the biggest reasons why I never really felt connected to the book. I wanted heat and fire and passion - what I got was a terse factual recitation of the surroundings. Some authors, notably Marillier, have a talent for using a few words and pulling you into their world. This is not a talent Moira Young possesses. I knew there was a desert, vast and unending; I knew there was a bunch of mountains and forests. But I never felt the burning heat of the sun on red baked land, or the dark shadows of the green trees in the deep forest. If there was one thing I cannot fault Young on, it's her characterizations. Saba has a very distinctive voice, one that managed to single-handedly earn this book 3.5 stars. This book is full of kick-ass woman and children. Saba is so beautifully flawed; and the joy of finding a character who can be petty and self-absorbed and mean but still courageous and vulnerable and loyal is almost painful. This is the sort of woman we need more of in YA lit. Saba is a better role model than the damsels-in-distress that populate YA paranormals. And none of the other women in the book are any less, either. From nine-year old Emmi to the tough-yet-friendly Hawks, no-one is less than capable of taking care of themselves and their group.Emmi was great, and I sort-of wanted to hurt Saba for being such a bitch to her; one of my favourite scenes in the book is when Jack stands up to Saba and calls her on her lack of feeling for Emmi, saying that he thinks Emmi would be safer with him than with Saba. Jack was my absolute favourite character in the story. Despite not having a voice, his personality emerges clearly, cocky and funny but with unexpected depths. I thought the chemistry between Saba and Jack was pretty damn hot, and I almost never say that about YA couples. Apart from the sparse world building, the other thing that didn't really grip me about this book was the several instances of logic fail. Seriously, Saba, you need to learn to take a pulse before you assume someone is dead. And I hated the random death at the end. What was the point? Not to mention how The Hawks turned up at the exact moment they were needed; that was a little too Hollywood for me. But I did like how Young hints at the possibility of magic, without ever confirming it outright. From Saba's father's star gazing to the heartstone to the strangely long-lived King, there are subtle signs of the paranormal, but no obvious presence. I like how this story could function as a stand-alone, even as it leaves many unanswered questions that form the foundation for the second book in the trilogy. All in all, I think this was a great debut novel - not too profound, but a kick-ass adventure that does its job well, and with maximum entertainment. Moira Young has an interesting voice, and I'd be very interested in seeing where she heads from here. Disclosure: This is a review of an ARC galley. Thank you, Michelle, for sending this book across oceans and continents and making it possible for me to read it without waiting forever for the release date!"}, {"userName": "Ela ", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/5661715-ela", "userReview": "[image error]"}, {"userName": "Catie", "userReviewDate": "Apr 20, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "The first few opening chapters of this book have just about everything that I love in young adult speculative fiction: a futuristic world that’s original and believable, a tough heroine who’s too rash for her own good, a perilous quest, and just a touch of depth. Perfection. And no, the dialect and lack of quotation marks really don’t bother me at all. I think that the dialect creates a great atmosphere and the lack of quotation marks really work to make the dialogue seem immediate and natural.This book is pretty darn entertaining and if you look at it sideways while holding it about ten feet away from your eyes (with your go go gadget arms) on a foggy day and during the exact moment of a solar eclipse, then about 50% of it makes sense. It really reminds me so much of an action movie. All emphasis is placed on moving everything forward, always forward, without stopping to consider if it makes sense or to develop the characters or the settings. It’s like we can’t stop for even a moment! Throw in some cage-fighting, mutant worms (that somehow disappear to let armies of girls and savages through in the nick of time), cartoonish enemies, weird rituals, prophetic dreams, and a bird with the IQ of your average rocket scientist; do whatever you have to. Just keep the action coming.But it’s still entertaining. I think that the only thing that truly bothers me is the ”romance.” The quotation marks and italics are used there to express my snooty and condescending disbelief that what’s contained within these pages is romance. Basically what we have here is love at first sight, facilitated by a piece of mood jewelry, and hindered by the main character’s stubborn denial.The main character, who I initially loved, becomes more and more annoying and nonsensical as the story progresses. She moves from ruthless to uncaring, from determined to stubborn, from rash to stupidly reckless. By the end I didn’t feel any emotional connection to this book or to its characters. I think that the character who I connect with the most is Emmi, but she’s very minor. Battles are fought and won, people die, problems are resolved. It’s all very hazy to me even now, only a day later. I just couldn’t dig up any emotion for what was happening. But I do remember that the author wraps the story up enough so that it’s not a cliffhanger or a major lead in to the next book in the series, which is very decent of her. I am thankful for that! Perfect Musical PairingThe Submarines – AnymoreI feel like this is Emmi’s song. “Why can't you just love me the same wayI disappoint you try as I mayBut don't say you'd be better off without me”She’s the real strong female heroine in this book. She’s a survivor, and it took Saba long enough to realize that! I love how she surprises Saba with hidden stores of strength and ability. I’m glad that she was along for this ride, no matter how ridiculous it was for Jack to insist on bringing her."}, {"userName": "Krystle", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/2639204-krystle", "userReview": "This book is like:andandWhy? Saba’s got that bad ass attitude like Katniss, cagefighting that Wolverine does in the first movie, and killer worms from Tremors. Awesome combination if I do say so myself.The first thing you notice about the book is the terse, short, and simple sentences used stylistically to evoke Saba’s voice. Not to mention everything’s written out phonetically so that will give a lot of people cause to stop or stumble in the beginning. But you get used to it very quickly and the words just fly by after that. Some people might not like the way the author chose to portray her prose, but I enjoyed it. I think phonetically spelt things that show up in text gives me a great picture of how a character speaks and acts, not to mention it gives the story a lot more flavor and depth. Also, it’s excellent in keeping up with the idea that Saba isn’t well educated and that she can’t read or has been brought up with any proper teaching.Everything about this book is fast paced. You’ve got her on the quest to find her brother, then her capture and subsequent fight to escape (cagefighting!), and then the final climactic showdown which is just as fun as well. The second half of the book wasn’t as exhilarating as the first part but it does keep up the tension and fun.On the other hand, though, Saba can be quite a piece of work. She’s a lot more obnoxiously self-serving than Katniss was, and there are many times when you want to grit your teeth in frustration. Her treatment of her sister can be quite mean sometimes. I did like that the author tried to portray the whole firstborn syndrome where the child feels threatened by the appearance of another sibling to rob their parents’ full attention which leads to fights and confrontation between siblings (usually) but… I don’t know. Saba’s attitude sort of turned me off sometimes.The romance was pretty corny in regards to the whole necklace aspect of it but it wasn’t in your face and they did have some nice kissing scenes for the most part. Sure, the plot of this book may tend on the predictable but it’s a fun action ride all the way through. I don’t know why they’re classifying this as dystopia; I read it more as post-apocalyptic fiction than anything else.Maybe I liked this so much purely out of the tired and overly done trend of dystopian fiction where most of the books have been substantially unfulfilling and subpar. It was like a breath of fresh air. The world could have done with a bit more set-up instead of simple pass overs, because I never really felt in it. Most of it consisted of a few nondescript sentences and perhaps an allusion or two but nothing concrete that would have me thinking.But other than that, this book is a great read. I can’t wait to watch the movie!"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "First off: there is nothing wrong with this book. But I'm being picky these days since my reading time has been cut WAY back due to me being back in school. In a way, I like this. However, the strong slang, or pidgin or whatever it's called, is killing me right now. jest, fer, yuh, bin, gittin, unnerstand, figgered, nuthin', gawdfersaken, babby-swolled, hisself, et, yuz, hafta, afeared, gittin, unner... Plus, it's one of those \"survival\" books as well where not much happens but the main character finds shelter and food and wanders ... I'm not feeling it. But it seems fine as far as stories go. Fans of The Wolf Road would probably like this (although this book came before that one and Wolf Road is not YA, I don't think). I got to 100 pages and am quitting. It's over 450 pages long, and I don't think I'm interested in the writing style enough to continue. No rating."}, {"userName": "Maureen", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "As usual I’m very late to the party, but I really enjoyed this! It features a hate to love done in the way I actually enjoy it (aka the right way), a deeply flawed MC who is called out on her issues, adventure, and bringing down an evil government.The writing was a bit hard to get into at first because of how it’s written (slang, no quotation marks for speaking) but once I was hooked I HAD to finish."}, {"userName": "Giselle", "userReviewDate": "Feb 13, 2012", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "After seeing all the wonderful reviews of this book, I was excited to see it appear at my doorstep, and I didn't wait long to dive into it. A violent futuristic world, fast pace action, with a kick-butt heroine? Count me in! It delivers what it promises, as I instantly became absorbed in Saba's journey to save her brother. \"Once, we could count on pullin a fish from the lake an a beast from our traps. Fer everything else, we planted some, foraged some, an all in all, we made out okay. But fer the last year, whatever we do, however hard we try, it jest ain't enough, Not without rain. We bin watchin the land die, bit by bit.\"As you can see from the above quote, the first thing anyone will notice going into this will be the writing style. If you look at the reviews, some love it, and others hate it. Luckily, I am on the loving it side, though it helped that I knew what to expect going in. I read a short excerpt beforehand, and in turn, I had absolutely no problems getting into the story right away. I also could not imagine the book without it. It has character! It makes it so unique, so filled with personality that you can't help but feel like Saba is sitting in front of you, recounting her journey. I'm telling you, I could hear her. It's a brilliant way to give life to a story. Saba is off to find her brother who's been kidnapped, which also left her in charge of her pesky little sister. At first, Saba seemed like she was going to be a whiny, exasperating protagonist. She was awful to her sister, and a bit too reliant on her brother. However, as the story progresses, we get to see Saba grow and change into this strong-willed, feisty person overflowing with bravery. She never ceases to be extremely stubborn, even a bit too much at times where I wanted to scream at her for it. But for the most part, I loved her fearless personality and determination.The world: So ugly, but so beautiful. The moving sand dunes, the everlasting nothingness, the red dust; everything is so impressive, yet intimidating. I constantly felt a sense of longing for the world that was. Even though Saba has never seen anything but, you can feel the loneliness everywhere. There are also hints of fantasy and magic elements throughout the novel that make it even more impressive, not to mention unnerving.The book is not without a few flaws: Some turnabouts at the end felt a bit too Hollywood-like; The world itself left me with a few questions- some of the details are a bit fuzzy at the edges; Then the stars- all this intriguing astrology in the beginning that gets abandoned by mid-book. Though these are all pretty minor overall, and since this is the first in its series, it felt to me like we were sent off into a strong, fast pace story that concentrates on action and excitement at first, but will (hopefully) give us a more refined world building in the following installments.Incredibly gripping and grossly entertaining, Blood Red Road sends us on a journey full of bumps and scrapes that will leave your heart pounding with energy. I highly recommend it to every fan of The Hunger Games. Oh, and there's cage fighting! Enough said! --For more of my reviews, visit my blog at \nXpresso Reads"}, {"userName": "Carol. ", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[ Further adventures include escape from Shantytown (and in the tradition of the best heroes, burning the pool of scum to the ground as she escapes), temporary refuge in the Amazon camp, and setting across another waste inhabited by sand-worms to get to the drug fields were Lugh is being kept.  (hide spoiler)]"}, {"userName": "Lucia", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/8837962-lucia", "userReview": "SERIES RATING AND SPOILER-FREE REVIEW:\nBook 1: Blood Red Road- STARSBook 2: Rebel Heart - 2 STARSBook 3: Raging Star - 2.5 STARS This is the most conflicted I have ever felt about book series. I adored some parts of this trilogy and hated the others. Let's see what are pluses and minuses of Dust Lands trilogy.(+) REALISTIC NARRATORSaba, the narrator and heroine of this trilogy, is bold, rude, vicious and very determined. On the top of that she is selfish and stubborn. Surprisingly, instead of being annoyed with Saba, these character traits made her look more human in my eyes (not some idealized unrealistic saint). (+) SIBLING RELATIONSHIPSSibling relationships play a big role in this series and author introduced very interesting take on it. Either it is between Saba and her twin brother or between Saba and her younger sister, author masterfully shows us how shaky such relationships can be and how much they change over the time. (+) HUMANITY VS. SURVIVALDo you know what I like the most about dystopian genre? I love how it focuses on humanity, on its worst and best parts, showing the depths to which people would go to survive. The constant struggle, the constant fight between morals and selfish will to survive in wicked world so different from ours, that is what I like the most about dystopian novels. And Dust Lands series is full of it. You can feel it from every page (especially in Blood Red Road). I love this kind of intensity because it gives me big feels. And emotional reads always stay with me for the longest.(+) CHEMISTRY IN THE FIRST BOOKThere was so much chemistry between Saba and Jack in Blood Red Road. Just the two of them talking together was sparkling. What a shame it doesn't reach next books in trilogy.(-) PARTICULAR WRITING STYLEMade up slang, no proper grammar, no quotation marks, etc. I admit that I found it interesting and unique at the beginning. But later on it was very distracting and discouraging.(-) SEQUEL FIASCOSurely, you are wondering what possessed me to rate sequels so poorly after liking first book in series so much. Answer is simple. Everything that I liked about characters and storyline in Blood Red Road was missing in sequel. Thrilling fights for survival - gone. Smart heroine - gone. Potent chemistry - gone. Addictive plot - gone. I was so disappointed that I even contemplated to forget that I ever read sequel and to pretend that Blood Red Road was a standalone. Rebel Heart turned into something I hate - almost every important male character had romantic feelings for Saba. I hate this trope in all kinds of genres. It's huge pet peeve of mine and if it wasn't for great first and last chapter, I would give Rebel Heart only one star. But curious creature that I am, I had to pick the third book up as well. Even though Raging Star was slightly better than Rebel Heart, it still didn't live up to my expectations I had after falling in love with first book.(-) THE DARKLING SYNDROMEI am not fan of The Darkling Syndrome and unfortunately, this series suffers from it. (Those of you who are not familiar with Grisha Trilogy, The Darkling Syndrome is what I call a situation in books when heroine develops some kind of feelings/connection to villain and this connection disables her to fight villain properly.) It drove me crazy. So even though storytelling in this series is great, I didn't like at all how story developed. It had negative effect on my emotional investment in the story and sadly, I wasn't rooting for the heroine in books #2 and #3. But it is only my personal feeling. I do think that first book is worth reading. And who knows, maybe you would feel differently about the story development that I did.MORE REVIEWS ON MY BLOG \nReading Is My Breathing"}, {"userName": "Cara", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/1876075-cara", "userReview": "I must warn all of you who read this that I'm gonna have a bit of a gush fest before I write anything of real relevance. Ok so right now I should be doing lots of other things (responsible people things), but I just cannot contain my excitement for this book. This hasn't happened to me in a long while. Sure I read great books often enough but none that have made me SO excited I might burst. I frankly really love this book to pieces. I'm surprised I returned the book to the library in one piece! Rebel Heart cannot come out soon enough.Saba lives in Silverlake. She has a twin named Lugh, a sister named Emmi, and a Pa. Ma died nine years ago and it's just them. No one else lives around them really. There has been a drought and they are struggling. Saba's Pa can read the stars and he sees some things he doesn't like. Lugh is thinking his Dad is full of hogwash, but one day a storm comes. A storm that brings men with black robes who take Lugh away but the question is why? Saba vows she will find him, no matter what it takes. Here is where the adventure begins. The language took some time to get use to but I feel it fits this society. More people live in the outskirts and try to keep to themselves. Most people can't read, so the language is bound to change. The beginning may feel slow to some people but I assure you it picks up, and you need that background to get a feel of how the place is. I imagine dust gets into everything and the world has lost most of its color. It's interesting to see how these dystopian societies always have a form of escapism. Here they have the cage games and the chaal, but we have these things too just in different forms. I think this is one of the main reasons why I love to read dystopia. It reflects us to a certain extent. Now onto characters! Saba (what a cool name) is who carries the book the most I think. She is genuinely tough. Not tough sometimes and only when it's convenient but because that's who she is. It's so rewarding to see how she grows from being a girl that had never been outta of Silverlake to a survivor. I imagine she always had it in her; it just didn't come out till she needed it. Then of course I have to mention Jack. Goodness Jack is perfect for Saba and I like how he doesn't always take what she dishes out. And I'll have to try to stop talking about him so much. Then there is Saba's sister Emmi who is such a complex character that you root for too. There are many great people in this book. No way could I cover it all. Despite how much I loved this book the harsh critic (this part is really small) in me for some reason wanted to grant this book with less stars. There is the language the reader has to get used to, the absence of quotations marks, how stubborn Saba is, her obsession over Lugh, Saba's misplaced apathy towards Emmi, and the lack of explanation of how exactly the world got this way. But you know what? I forgive all of it."}, {"userName": "Brad", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "The criticism \"derivative\" was designed for this schlockfest. Fun first person, which delivers it from one star hell, but when the whole book is derived from the lives of Han Solo, Princess Leia and Lando Calrissian from the Trilogy and the canon books, no one can argue that this book isn't derivitive in the extreme.\"You're full of shit, Brad!\"Really?! Fuck you! I am full of knowingness you heathen! Look and learn:Sarlac moment with crazy lake worms. ✓ Ike as Chewbacca/Lando. ✓Jack and Saba as Han and Leia. ✓ Saba and Lugh as Leia and Luke (yep, they're twins with benefits). ✓Han and Bria (Han's first love from the Crispon trilogy) fighting drug creating, religion creating bad-asses. ✓Belligerent chick (Saba/Leia) tames charming scoundrel (Jack/Han). ✓Lando/Ike smacking down Han/Jack. ✓Evil bad-asses forming their own little Empire. ✓Tontons to ride on Hoth turned into Sith like religious kooks named ... yep ... Tontons. ✓Then add a little Mad Max, a little Hunger Games, a little The Road, and suddenly you've got a property that folks want to buy. Whoooooopppppeeee!!!!In the plus category, as a longtime Albertan, the fact that you can trace the action from the Kanaskis to the plains to Drumheller (without the lovely Canadian author ever mentioning those names) is pretty cool. Even so -- a waste of fucking time. The film version will be vastly better. p.s. Everytime Saba talks about slipping into the Red Hot before she goes on a murderous, violent rampage, I can't help thinking of spicy sausage."}, {"userName": "Lucy", "userReviewDate": "Apr 30, 2011", "userURL": "http://www.goodreads.com/user/show/3813315-lucy", "userReview": "This is another book where I didn't really understand the world building. I'm not sure if this is supposed to be a dystopian future of our world or an alternate universe. I started under the assumption that this was a dystopian future and maybe the author did too. If the author was trying to write a dystopian future the idea unraveled as she tried to create a plot and started making stuff up to make it work. There's a weird plant that functions half as a drug that makes people super passive and makes the rest super aggressive depending on dosage? I'm not sure anything quite like that exists, but I was still leaning toward future dystopian after the plant came up. The giant killer man-eating worms were what confused me out of accepting the world building.I wasn't crazy about the weird grammar stuff. I alternated between the audiobook and a kindle copy depending on where I was and how much time I had. The spelling drove me buggy on the kindle reading. I much preferred believing Saba's brother was named \"Lou\" instead of Lugh. Ick. The audiobook drove me a little buggy too with the Big Southern Accent. I'm beginning to associate a lack of formal education in books being relayed as a Southern accent in an audiobook. It also made me wonder where all of this was taking place. The Southern part of the United States? As Tatiana pointed out the author is English so I spent even more time obsessing. (The author doesn't have a website let alone an FAQ, agh.)Saba's quest to find Lugh after he is kidnapped felt strange. I don't think the author knew why Lugh had been kidnapped when she started writing. His birthday is special and makes him an ideal sacrifice. I thought the fact that they were twins would play an important role in all of this, but it was a plot line laid out but never explored. An unfired Checkov gun. Why were they twins if her birthday wasn't important? Why go through all the trouble of saying the stranger who witnessed Lugh's birth left before Saba was born if it wasn't important? I know this is the first book in a series, but it felt like the birthday sacrifice thing had reached a conclusion by the end of the book and Saba's shared birthday played no role. Oh well. Unsatisfying for me.I didn't enjoy Saba much as a character. She was unbearably obsessed with Lugh and not in a those-bastards-might-be-hurting-my-brother kind of way. As in an unhealthy, half in love with her golden boy brother who is the best person ever kind of way. Thank God, a love interest is introduced. I'm very tired of the question of incest in YA, real or not. No more incest books for awhile, please. (I still can't finish Forbidden because it's so effing dull.)Saba is also not a very consistent character. She tried to ditch her sister a few times in the beginning, but the little girl keeps trailing after her. Then she tries to leave her other places and lets herself get out voted. A eight or nine year old makes a real asset on a rescue mission, as is proved when she's captured and used as a hostage. They sacrifice another member of the group when she's captured -- Saba shoots her in the heart, but the world comes to a Dead Stop when the little sister is snagged. Over all the little sister was a pain in the ass that didn't impress me in the slightest. I would have been less annoyed if Saba had actively decided to keep her sister instead of all her failed attempts to ditch her. It was a waste of pages and a waste. of. my. time. If I had to read ONE MORE ARGUMENT about where the kid was going I would've broken my kindle.Blood Red Road wasn't awful, but it didn't have a lot of substance. The world building was lackluster and unprincipled. The main character was difficult to like and her plights were hard for me to care about. Even when she's in a cage fighting other girls and sending them to their deaths she's so emotionally divorced from the situation that I couldn't feel any empathy for her or interest in her escape.Three stars because it was a bit better than okay, but I probably won't continue the series because once my generosity evaporates it'll only goal downhill in the star department."}, {"userName": "Arlene", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Blood Red Road by Moira Young is a highly anticipated YA dystopic novel that’s not due out until June 2011. So first off, thank you to my reading buddy,  Crystal , for sharing her ARC with me. I have to say, I really enjoyed this post-apocalyptic novel that carries quite a unique narrative, fast-paced plot, constant action, and dynamic set of characters. It actually took me about 75 - 80 pages to finally fall into the story mainly due to the grammatically incorrect narrative that was purposely executed to represent the downfall of civilization and cultivated learning. However once Saba, the main character, set off on her quest to find her brother, I was glued to the pages and drawn into her high adventure journey.As mentioned, in this book we meet Saba, the main character and narrator of this story. Her world revolves around her twin brother, Lugh, who she’s never been separated from since birth. One fateful day when the dust storms bring 4 horsemen into their Silverlake desert home and kidnap Lugh, she finds herself cast outside of Lugh’s shadow and on a quest to rescue her brother. On her adventure, we discover that Saba is a fierce fighter whose determination and strength can conquer any obstacle in her path which ultimately labels her the Angel of Death.The setting throughout the novel places the characters in dried-up wastelands that’s subject to desert storms, heavy rains and constant climate challenges. When Saba leaves her secluded desert home and travels through these ravaged wastelands and treacherous mountains, we discover that her world is filled with destruction and corruption where the people are manipulated by a king that controls them through chaal, which is a drug that makes them subservient and easily manipulated. The story includes a strong set of secondary characters that were very well developed. We come across the highly adventurous Jack, who does a great job of bringing down Saba’s defenses so we can see a different side of her character. Their moments and dialog had me re-reading many passages simply because they were either funny or heartfelt. Jack was full of awesome. The Free Hawks were a great addition to the story line too as I can always appreciate the badassness of a gang of girl revolutionaries. Emmi was probably my favorite aside from Saba and Jack. I loved her innocent determination and I hope to read more of her in the coming novels. Lastly, I have to admit the second half of this story had me glued to the pages because that’s where loyalties and trust play a heavy hand. I truly enjoyed watching Saba’s self discovery as she learned that she’s more than Lugh’s twin; she’s strong and determined when faced with constant struggle. She’s definitely a character I can enthusiastically root for. Overall, Saba managed to capture my compassion and attention, so I definitely look forward to reading the next two installments in this trilogy. Well done!Flannery, you’re up! Hope you enjoy! =]Playlist song: New Divide – Linkin Park"}], "description": "Saba has spent her whole life in Silverlake, a dried-up wasteland ravaged by constant sandstorms. The Wrecker civilization has long been destroyed, leaving only landfills for Saba and her family to scavenge from. That's fine by her, as long as her beloved twin brother Lugh is around. But when four cloaked horsemen capture Lugh, Saba's world is shattered, and she embarks on a quest to get him back.Suddenly thrown into the lawless, ugly reality of the outside world, Saba discovers she is a fierce fighter, an unbeatable survivor, and a cunning opponent. Teamed up with a handsome daredevil named Jack and a gang of girl revolutionaries called the Free Hawks, Saba's unrelenting search for Lugh stages a showdown that will change the course of her own civilization.", "title": "Blood Red Road\n      \n          (Dust Lands #1)", "url": "http://www.goodreads.com/book/show/10578758-blood-red-road", "average": 3.93, "cover": "https://images.gr-assets.com/books/1331430566l/10578758.jpg", "reviews": 5694, "authors": [{"url": "https://www.goodreads.com/author/show/4487674.Moira_Young", "name": "Moira Young"}], "type": ["Young Adult", "Science Fiction", "Fantasy", "Romance", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/10578758-blood-red-road", "http://www.goodreads.com/book/show/9917938-blood-red-road", "http://www.goodreads.com/book/show/12400425-blood-red-road", "http://www.goodreads.com/book/show/9969742-blood-red-road", "http://www.goodreads.com/book/show/12790954-blood-red-road", "http://www.goodreads.com/book/show/13042154-rebel-heart", "http://www.goodreads.com/book/show/15835877-raging-star", "http://www.goodreads.com/book/show/24885710-the-dust-lands-trilogy", "http://www.goodreads.com/book/show/29429171-the-road-to-ever-after", "http://www.goodreads.com/book/show/28154326"]}