{"ratings": 4196, "userreviews": [{"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "[and possibly even a heart or two (hide spoiler)]"}, {"userName": "Alex ", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/11057966-alex", "userReview": "I would have enjoyed the plot and the supernatural world more if the heroine hadn't been so annoyingly indecisive. \"I love Chance, I don't love Chance, but wait, I do love him ...uh lol nope, I don't!!\"She was exhausting. And the way she was so self-centered, like every fucking guy had a thing for her!!! Nah. I won't be reading more of this series..1.5 star"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Mar 31, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "This was a very interesting and unique foray into the world of magic noir, or noir occult detective fantasy fiction. Corine Solomon is a fairly conflicted, and troubled character. Her mother was a practicing witch who was essentially burned to death by the suspicious and intolerant townspeople in Kilmer, Georgia. Before she died, her mom endowed her with her power, in the form of the ability to read objects. However, it comes at signficant cost to Corine. She bears the scars of the readings on her hands and fingers. Scars to match those deep in her soul.After she almost died on one of their cases, Corine cut out in the middle of the night, leaving her boyfriend and business partner, Chance behind. She left because she didn't believe he loved her, and that he was just using her for her abilities. She left because she let him in and paid the price. In her life, Corine learned that caring for others is a losing proposition. And Chance messed her up too much inside. So she fled to Mexico, running a pawn shop, and living as close to a normal life as was possible for her.But, eighteen months later, Chance shows up. His mother has been kidnapped, and he needs her special gift to find her. Chance has a special gift of his own, incredible luck. Unfortunately, his luck isn't so good for those around him. That, and Chance is just way too self-controlled and distant for her, despite being gorgeous and her weakness emotionally. They strike a deal, she helps him find his mother, he helps her get revenge against the people who killed her mother. And, it's just business. Their relationship is over, or so Corine says.This story twists and turns, and shows a side of Texas very familiar to me. The aspects of Mexican culture ring very true to someone who's spent a fair amount of time in that environment, and add to this story like the spice of chili powder. Corine is a narrator who is not always nice and kind and neat, but she sneaks in on you, so well that you end up liking her for all her flaws. Chance is delicious--dapper, half-Korean, completely intriguing, and very much in love with Corine, but unsure how to show it. He's the enigmatic guy who sounds great on paper, but probably isn't the best boyfriend. But what in life is perfect? I wanted Corine to forgive him, even seeing his flaws. There's also interesting secondary characters, such as Chance's friend Chucho, and his wife, Eva, who help this couple in many important ways; Jesse, who's a cop in Laredo with a gift for empathy. He appoints himself as Corine's mentor in the world of the gifted, but he wants to be more. Maybe, Corine wants more too. Sex is not an issue, but falling in love is. Can she have all the wild, crazy sex with Jesse, and avoid falling into the trap of loving Chance? And there's a killer who considers himself the hand of God. Is he going to help or hinder Corine and Chance in their search for his mother?Normally, I don't like my noir urban fantasy too filled with romantic angst, but it was well done and fitting in this story. After all, Corine's life is very turbulent, and that's a big part of her life. I have to say it really added to this story. I have a feeling her future will always be entwined with Chance, and that's not such a bad thing to me.The magic and occult aspects were very intriguing. There were some parts that were borderline scary. I think Ms. Aguirre told a great story of dark magic being used to further the criminal enterprises of those who prey on the strange entity that is the border of Mexico and Texas. I had little trouble believing that the cartels would hire witches and warlocks to employ sorcerous magic to keep business going. If I had a complaint, I think that the tension could have been sustained in some of the suspenseful moments. The execution tended to be somewhat anti-climatic. Otherwise, this was a great foray into the dark world of bordertown Texas and Mexico, where magic is alive and well. Corine is a character I got invested in, and I definitely want to read more stories with her. And I hope that Chance stays in the picture. He's quite a character, himself."}, {"userName": "Nicole", "userReviewDate": "Feb 06, 2011", "userURL": "http://www.goodreads.com/user/show/4022926-nicole", "userReview": "Ok, this may be a hard review to read because I find it hard to put into words the things that didn't sit right with me and this book. First off, it's my favorite genre and it's a series, so I had high hopes. But then it quickly became one of those books that I had to force myself to finish and I really hate that, I mean, I started doing housework instead of reading and that's just wrong! This book had too much going on and nothing at the same time. (vague much Nicole?) The concept of Corine and her special talent of reading object's histories was good, but I have never seen a book go off on so many different tangents from that point of intro. Had the author stayed the course with Corine's ability and gone into depth about her personal journey to that point, I might of enjoyed the book a whole lot more. But instead, it was filled with vague info reveals and half developed characters that shot off on an unbelievably challenging quest to rescue her ex-boyfriend's kidnapped mother. For me, the plot had the feel of walking on a treadmill, doing lots of km's but going nowhere and ticking off the allocated bad guys...Dirty cops-tick, black magic-tick, life sucking shades-tick, zombie corpses-tick, organised crime-tick and a whole lot of gun fire and grenade action. Not to mention that it strayed so far from it's own point that the biggest anti-climax is when *spoiler* they finally achieve what they actually set out to do. I may be backward, but this is normally the highlight of a book for me, but this was the biggest boring fizzer of an ending after all the crap they went through to get there. I could go on, but I think that's got this book off my chest...onto more Highlander books for me I think!"}, {"userName": "LMM", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/1533889-lmm", "userReview": "When this book started off, I thought I was going to end up liking it much more than I did. It had a more adult, Urban Fantasy tone reminiscent of Sign of the Zodiac series for me. It was a little noir-ish & the dialog was a bit hard boiled but not OTT. I really thought I was going to appreciate the main character Corine, as a smart yet, conflicted for good reasons heroine. She initially seemed to know her mind well enough & could handle herself.The premise also seemed interesting & not too fantastical. However, that degraded & by 75% the way through the book the eye rolls began. Aside from being predictable... ***SPOILERS BELOW***Corine's lamenting over Chance, the ex she walked out on became tedious & immature. I felt her insecurity about him & the way he felt about her was borderline asinine b'c it was obvious the entire novel how he felt. Her lack of self-esteem pretty much permeated almost all instances. Example; During a re-group at a colleague's home after a field skirmish, Chuch (said colleague) is complementing his wife on how hot she is but really, it's an obvious flattering tactic to keep her safe at home so she's out of harm's way. Corine's inner monologue about this? \"I probably could've taken offense that nobody thought I was so hot I'd distract the Mercs from conversation, but I decided I'd let that go. I did OK after all, Some guys dug the long hair hippie chick.\" Really? She could've taken offense by what a husband was saying to his beloved wife in order to distract her to keep her safe at all costs? Come ON...baring in mind the context of the situation this was a juvenile bit of dialog to throw in there & only made me come to feel Corine is too insecure for her own good so why should I be reading an entire series about her? Her observations about Chance & what she needed from him where at highly inappropriate at most times. Let's face it, they were in a supernatural war/rescue mission & a highly dangerous one at that. Yet as Chance is formulating a plan in front of the Scooby Gang & leaves to go call an integral person to help them, Corine's self-pity hit an all time pathetic level for me. \"While Chance went to look for Booke online & Chuch checked the weapons cache, I ate a bowl of bean soup breakfast. No one came to see about me. I sighed & took my bowl to the sink. I had my wounded palm & festering zombie bite on my shoulder that needed tending to. Was it unreasonable to want Chance to put me 1st? The way he blew hot & cold compromised my chief objection of resuming our relationship. With that dance, I thought he changed, but now I stood in the kitchen with a burned hand & no help. \" Ummm...earth to Corine, your in the middle of a WAR. His mom has been kidnapped which is why you were enlisted in the 1st place & oh for fuck's sake....ASK SOMEBODY like a big girl to help you tend to your wound instead of standing there like Norman-No-Mate's waiting for someone to notice you!The examples go on but I'll stop there. Added to which, the woman had just pitched a fit and left Chance b'c she though he was doing someone else & so so she turned right around & kissing the formulaic 3rd in the love triangle. Hypocrite.And on top of the redundant & inappropriate love life moaning, there was also a lot of BS about food, eating , bringing dishes to the sink, etc.. her red hair (what's the deal with that? So what she changes her hair a lot & now it's red), her bad hippie chick style (embroidered Khaki's & a enough peasant blouses to choke a gypsy) & how Chance has tiger eyes with a whipcord build. My point is that I felt it needed an editor. The world building also needs to be fleshed out and the contradictions need to be noticed in order to stop. For example Jesse, the 3rd in the love triangle, is an empath. Yet he had no idea that his partner was a sociopathic warlock enslaving women for God knows how long or that Corine was not guilty when he shoved her face into the ground & read her her Miranda Rights at a crime scene. He actually tells her she's lying. Er...OK. not only does Jesse suck as the worlds worst empath, but he sucks at this \"mentor\" thing he supposed to be to Corine (supposedly if you find another gifted - you become their mentor - the whole thing has yet to be properly explained) & last but not least, he sucks as a potential lover. One of these days I'm going to find a new series that I love but I'm afraid it's not looking like it's this one. I usually have a 3 book minimum rule so I'll try the 2nd but I'm not going to get my hopes up too high although I would like to. I really think it does have potential in spite of it all."}, {"userName": "Cat Russell  (Addicted2Heroines)", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/4250664-cat-russell-addicted2heroines", "userReview": "\"Christ. What do you want from me?\"\"Only what I always wanted. Everything.\"Unresolved love triangle! How could I not read the next story? Especially when Chance and Saldana both are in the next book =)This was a great start to the series. Not perfect, but it was a quick, fun read that I would recommend to anyone who loves urban fantasy. I really enjoyed the unique world of magic that Aguirre has created and the lively characters that reside there - witches, wizards, warlocks, demons, zombies and the Gifted.Corine is a handler. She can touch any object that holds a charge and tell where it's been, the previous owner's emotions when last holding the object, and occassionally the object's future.Then there is Chance, the ex that Corine fled from in the middle of the night without warning. Chance has a special talent of his own. He's luck. \"He spins the coin a hundred times and comes up tails every time.\"Unfortunately, his talent comes with complications. Not for Chance, but for those close to him. With Chance acting as a bad luck repellent, it finds purchase elsewhere and a lot of that bad luck has been directed at Corine.As the story begins, Chance tracks her down to ask for her help in locating his mother, Min.They work together in following the clues that Min has left behind so that they can discover who her captors are and where they have taken her. They also recruit several friends along the way, many with talents or backgrounds that prove highly beneficial toward helping them acheive their goal. There is Saldana, a sexy cop who is also an empath. Chuch and his unlicensed private investigator wife, Eva. And an online friend named Booke who helps them out from a distance.Corine divides her time between solving Min's disappearance, fighting her feelings for Chance and exploring her attraction toward the sexy cop, Saldana, who has agreed to become her gifted mentor.The \"will they or won't they\" between Corine and Chance was laid on a little too thick at times, taking up a large majority of the story. I enjoyed the tension between the two and Chance's jealousy, but some of that time being devoted to learning more about the underground world of the gifted would have been nice too. Overall, this was a highly entertaining read. It left me wanting more Corine, more Chance, and more Jesse Saldana. \"People never offer an open hand, and if they do, you should step back to avoid the slap.\""}, {"userName": "Ithlilian", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/4793655-ithlilian", "userReview": "I've been looking forward to reading this for a long time. Disappointed does not even begin to describe how I feel. Usually, I can read any UF and enjoy it, but Blue Diablo was not enjoyable at all. I see that many do not agree, but I would like to present some of the reasons I did not enjoy this book so that prospective readers have both the positive and negative viewpoints. First, the novel is largely bickering between the main character and her ex. I understand that they are exploring why their relationship went bad, and one or both parties are trying to rekindle something, but it was not enjoyable to me. The first 100 pages consist almost entirely of dialogue between the ex lovers with a few other characters thrown in occasionally. I do enjoy dialogue heavy novels, but not when the dialogue is banter between two people that already know each other, whom the reader knows nothing about. I like to find out about my characters before having to deal with their relationship issues, but that's just my personal preference. My second issue was the plot and mystery behind the novel. We are told fairly quickly that the novel is about finding the mother to Corine's ex, but the mystery solving is agonizingly slow to me. Everything unfolds in a fairly predictable manor. Corine starts by using her power to tell where an object has been to find clues to where the missing person is located. Then they follow one obvious clue to another obvious clue. Talking to one person leads to another person that is helpful. It's really too simple for me, and not enough to get me through a book with characters that I did not enjoy. Even with all of the dialogue between characters, I have to say I never got a feel for Corine. There isn't one thing that sets her apart from anyone else. I personally found her flimsy, and not likable, again that is just my opinion. I'm trying not to step on any toes with my review. I find that UF books are largely mystery, world building, and characters. If any one of those things are strong, the others do no have to be perfect for me to enjoy it. I didn't enjoy the characters in Blue Diablo, the world building and magic were not strong and were not unique, and the mystery solving was too linear for me. That, of course, is not to say that others will not enjoy this book, but I personally did not like it at all."}, {"userName": "Cathy ", "userReviewDate": "Apr 08, 2010", "userURL": "http://www.goodreads.com/user/show/1526945-cathy", "userReview": "Really a 3.5. Solid urban fantasy. No vampires or werewolves, just lots of scary and sometimes beneficial magic. Oh, and a few zombies. 2 hot guys, one imperfect gal in over her head but doing her best, and some (too convenient but fun) friends help save the day. And a little Chihauhau named Butch who, as much as I love dogs, was just too lazy a writer's tool with his helpful abilities.I liked that Corine is far from perfect. Like how she says or does little things as digs against her ex, or thinks about them but resists. Just like a real woman would do. I don't know what I think about her and Chance, we'll have to see in the next book. They were together for 3 years and she's learned more about him emotionally in the last week. Why the hold-up? Personally, I like Jesse, I'm more of a jeans girl than silks and linens. I enjoyed the scenes in Mexico and later the use of the culture In the border cities. I read on the author's site that she lives in Mexico and she did a good job of conveying a bit of the street sceen there and the flavor of the community, especially in Mexico City where Corine is at the beginning of the book. So it was a good story, nothing outstanding that everyone should immediately rush out and read, but one I'm sure most urban fantasy/romance fans would enjoy."}, {"userName": "Summer", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/2274107-summer", "userReview": "I want to write a better review of this book as I really liked it, but with school starting back up tomorrow I'm swamped. The basics is it's about a woman named Corine who has psychometry, the ability to touch an object and sense it's past and in Corine's case, sometimes it's future as well. She's been running around most of her life, but most recently she's been running away from her ex-boyfriend Chance. Chance is a mysterious man who somehow has incredible luck. They used to work together as a team helping people find lost objects or people until one job almost took Corine's life. It's been over a year since she's taken off to Mexico to build a new life for herself and she feels pretty settled in. Until one day Chance comes back asking Corine for help and she doesn't know if she can refuse.I have yet to read anything by Ann Aguirre that hasn't sucked me in from the first few pages. Something about towards the end I felt like it was too big in a hurry to wrap everything up quickly but otherwise I loved it. It made me really want to eat Mexican food too, so be warned. I was DYING for homemade tortillas when they were mentioned in the book. I'm definitely looking forward to the sequel."}, {"userName": "Azar", "userReviewDate": "Aug 06, 2009", "userURL": "http://www.goodreads.com/user/show/267961-azar", "userReview": "Okay, I have to admit: I picked this book up for one reason and one reason only. The protagonist's ex was a man named Chance with strange luck. (This will only make sense to any fans of the mid-90s TV series Strange Luck. *g*)That said, I really enjoyed it. Corine is an engaging heroine (much frumpier than the girl on the cover, which amused me) with believable fears and issues (considering the world she lives in). I liked that her gift didn't come without a price, and found the reason for that intriguing. Another great thing is that for an urban fantasy novel (at least the kind typically aimed at us girls), Chance was pretty well developed too, largely through his relationship with his missing mother, who turns out to have a past neither he nor Corine ever imagined. The supporting cast of characters was great too, to the point where I almost didn't roll my eyes at the requisite rival for Corine's affections, a local cop who happens to be an empath. Most importantly, the book left me wanting to know more about both Corine and Chance. This is good since it's the first of a series. *g*"}, {"userName": "Carolyn F.", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/2624012-carolyn-f", "userReview": "Hmmm, I loved Ann Aguirre's Sirantha Jax series so I came to this book thinking I'd love it too. My expectations were too high. The book is good but not as good. I'm planning on reading the rest of the series, but mostly because I want to see what happens between Corine and Chance. Corine ran away from a relationship with Chance when it felt like he didn't care how much she was hurt in using her gift and never really opened up to her during their time together. In fact, when he finds her and she goes to help her he asks her to dance which he never let her know he could do. He won't tell her his real name. When they're intimate, he's staring off at something keeping himself apart from her and she feels like he's going through the steps needed for a sexual encounter. Start here, then do this, etc. She leaves because she thinks they're not good for each other. When he finds her, he doesn't really understand what went wrong but slowly through her helping him, he starts to see. With my description I thought I would love this book, but I liked it. Hopefully book #2 is better."}, {"userName": "Regina", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "2.75 stars. This is hard for me to review. I like the world aguirre created. The characters were interesting. Her writing about living in Mexico and then living on the border was realistic. I enjoyed the mixture in of Mexican culture. But I wasn't engaged in the story and I was bored during the last quarter of the book. I ultimately skimmed the last 40 pages. The dynamic between Corine and Chance was intriguing at first but Corine was so darned immature about relationships and I thought she was downright mean to Chance. Additionally, Chance was not that appealing. The back and forth between Chance and Corine was very annoying. Interesting at first but with no progression in the story and the immaturity of Corrine it got old. The heroine Corine is different than a typical heroine. Th story of her mother and background was really interesting. But the overall story was so boring and slow I do not know if I would reommend this book. I am not sure if I will keep reading the series. For more on this series check out Badass Book Reviews"}, {"userName": "Katie(babs)", "userReviewDate": "Oct 18, 2008", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "Blue Diablo is the first book in this new series about Corine Solomon who has the gift as a handler, where she touches something someone owns and will have visions about that person. Corine is an everyday average person, just like you and me. She is trying to stay under the radar because her ability is both a blessing and a curse.Ann has this wonderful talent at writing characters you can sympathize with. Corine is one of them as a woman who is on the run from her past. She wishes to build a life where she will feel safe. Unfortunately that is not in the cards for Corine. Over a year ago she walked out on her lover Chance and ran for the hills, or rather to Mexico City where she opened a pawn shop. I find this a bit ironic seeing that these items have a past because of their owners who have sold them. Corine lives everyday on the edge waiting for someone to find her, specifically Chance, and pull her back into the life that almost killed her. Then one day Chance finds her and she knows her almost idyllic life is over.Corine doesn’t know Chance’s real name. How’s that for trust? Chance is a bit shady. He is loan shark and does favors for people where he gets paid. He was also a type of manager for Corine where he used her and her gift at foretelling much like a circus sideshow. Corine would help find missing people, but always for a price. For awhile Corine and Chance were happy. Chance is that seductive type of guy a woman would do anything for and Corine fell for him hard. But the pressure was too much for Corine to handle. Corine is still not over Chance and he knows it. But he needs Corine to help him. His mother Min has gone missing and Chance thinks she was taken. He is worried sick and knows Corine is the only one who can help him. Because Corine likes Chance’s mother and can see Chance has a deep love for his mama, she decides to help him even though she knows Chance may try and seduce her back and into the world she left behind. Also Chance has something else up his sleeve. He is much like the devil who offers Eve the apple. He may be able to find the people who killed Corine’s mother when she was a little girl. The one thing Corine wants is revenge and Chance knows it. So with that prize dangling over her head, off she goes with Chance into the unknown.Chance and Corine are not alone on this dangerous journey. They are surrounded by a cast of characters that will help them. They meet Jesse Saldana, the investigating officer on Min's case. Jesse also has an ability like Corine. He is an empath and wants to become Corine’s mentor. He wouldn’t mind giving Corine a hand in other ways. He finds Corine attractive and she doesn't think he shabby either. But then there is Chance who she is still not completely over. Jesse is not all that innocent either and the people he knows may have something to do with Min’s disappearance. Chance puts a great deal of trust in Jesus Maria Ortiz Obregon, nickname Chuch and his wife Eva. Chuch and Eva have a great marriage and are very protective of each other and those they care about. Chuch (who I kept wanting to call Church) is powerful in his own right. He practices with magical charms and has unlimited resources at his disposal. He uses technology and old fashioned know how to find the answers Chance and Corine need.Corine needs all the help she can get because she and Chance are not just dealing with nasty criminals, but someone who knows how to use black magic. Min has kept secrets from her son and because of them she has placed herself in danger. Chance needs to go into the dark underbelly of Mexico where prostitution is rampant as well as those who use the supernatural for their own sick means. Chance is willing to put his life on the line for his mother and it is up to Corine to do the same for the woman who gave birth to the man she still loves but cannot be with.Blue Diablo is so very original and refreshing. I have to give it to Ann to writing a story with a nice balance of fantasy and mystery. This is considered an Urban Fantasy and the wonderful thing with this genre is that there are so many levels to it. I believe Ann has invented a whole new type of Urban Fantasy with Blue Diablo. I am calling it now and I say this is an Urban Fantasy Noir. The atmosphere is very much like a police procedural just like the ones you watch on television such as Law and Order or CSI. Ann has touched upon something that I don’t think has been done that often.Even though the main protagonist is Corine, Ann gives the reader a nice balance with her whole cast. This is truly an ensemble piece. Even though Blue Diablo is from Corine’s point of view, all the other important characters are given equal screen time. Every time Corine is on the page, we also see Jesse, Chance, Chuch and Eva. These people are a great team.The tension is thick and a bit desperate but there are moments with some laughs. There is one scene where a seance will be held to contact Jesse’s dead lover. He has to bring something that the deceased owned and could only find what he think was her diaphragm. And when his dead lover is reached, her reaction to the birth control is hilarious. It is not hers! That brought out a few chuckles.Blue Diablo has some romantic undertones but it is very subtle. There is talk of Chance and Corine’s relationship and their feelings but it is not the most important thing. Corine is attracted to both Chance and Jesse but it seems so realistic even as they are caught in the middle of this drama of Min's whereabouts. Don’t be surprised if you are up in the air between Jesse and Chance because both men have so much to offer Corine.As for Chance, he is a slick guy who uses guilt and emotional blackmail on Corine. I found myself sympathizing with Chance because he is hurting and he does love Corine deeply. Ann had asked if I though Chance found Corine just to use her for her ability or because he loves her. I truly believe Chance loves Corine. Time and again he tells Corine his feelings for her. He tells her she is the only one for him and no other. And I don’t see him feeding her a line just because he wants her in his bed again. The reason I find Chance to be a great guy is not only because of his love for his mother, but in another scene where he has to spend the night with Corine. He wants to just sleep beside her and keeps his socks on. Why? Because he would never have sex with his socks on. From that small statement and action I knew Chance was the real deal.Blue Diablo is a great read for both men and women alike. This is a story that will have you hooked and has a great cinematic feeling to it. Blue Diablo on the big screen? I say yes. Ann you have shown us once again what a writer with incredible talent can do."}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Review courtesy of AllThingsUrbanFantasy.blogspot.comBLUE DIABLO is the first book in Ann Aguirre’s Corine Solomon series. The first half of this book is absolutely amazing. I loved Corine, with her vulnerable yet tough bravado. I loved the history between Corine and her ex Chance, who was not at all your typical alpha hero (though still every inch an alpha). But most of all I loved Ann Aguirre’s writing. It was earthy and smart, full of texture. Every one of my senses was engaged. If you’ve ever been to Mexico, you’ll appreciate the authentic flavor that will absolutely convince you that you’ve spend the weekend south of the border.The second half of the was not quite as amazing. There were a few nearly pointless scenes (the séance) where a teeny tiny piece of evidence was gleaned that could have been obtained in other (much less complicated) ways. Also a bit too much procrastination when it came to the final showdown. Corine and Chance kept visiting the same locations over and over again when one visit would have sufficed. Don’t get me wrong, BLUE DIABLO was still an excellent book and the start of what promises to be a topnotch urban fantasy series. Chance has a line early on in the book where he says he doesn’t believe in love at first sight, but he does believe in that ‘Click. Recognition.’ That’s kind of how I feel about BLUE DIABLO. There is something here that just clicked. Maybe it wasn’t love at first site, but I think I waited all of 5 minutes before pre-ordering Hell Fire (Corine Solomon, book 2) which releases on April 6, 2010.Sexual Content: References to sex, vague descriptions of sex, a non graphic rape scene (extremely brief), references to rape and sex trafficking. My Rating: 4/5"}, {"userName": "Kathy (Kindle-aholic)", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/4612721-kathy-kindle-aholic", "userReview": "I remember this one as being so different from what I had been reading, and was pretty easy to get into.There is a lot of angst in this one - unresolved romantic tension, a painful psychic power, kidnapped loved ones, and so on.As I recall, the mystery wasn't that great - the MC isn't an investigator, and there were things left unresolved.Relationship-wise, a lot was left unresolved as well. I actually liked that in this book, because I didn't feel that the characters were all that healthy for each other. Kind of refreshing that they weren't put back together again."}, {"userName": "Katyana", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/1891730-katyana", "userReview": "Maybe a 3.5.I never really got into it. I don't know why. I felt like I was waiting for something to happen for most of the book.Firstly, the relationship stuff.It felt off to me. We got a lot of reminiscing / ranting, from Corine's POV, about what a cold bastard Chance used to be, and how she poured her heart and soul into their relationship the first time around. But the Chance that we, the readers, meet... is TOTALLY different. For the first 95% of the book, he's Mr. Sensitive: all puppy-dog eyes, heart on his sleeve, behaving like a kicked puppy when she treats him badly. And through that same segment, she is the cold, detatched bitch that she accuses him of being - despite the fact that the dude's ***mom has been kidnapped*** she never misses a chance to put him down, make him feel like crap, or just generally kick him in the teeth.Two things happened towards the end of the book, and honestly, they both felt pretty ham-handled to me.1 - Chance reveals that he was in love with a \"gifted\" woman before Corine, and she died. The implication is that he held himself back from Corine when they were together out of some kind of screwed up self-defense. This received all of one page of discussion, and frankly is something that he should have brought up waaaaaaaaaaaaay back when he first showed up and expressed that he wanted her back. Sort of along the lines of \"I fucked up, here's why...\" The way it was handled, it felt... odd. Tossed off. A minor point. When in fact, it is a MAJOR point. THE point, even.2 - In the aftermath of Big Battle #1, and through Big Battle #2, Chance inexplicably becomes a douchebag. Okay, not exactly. But as I said, through 95% of the book he was so attentive to her, caring, affectionate, everything anyone could want. Recovering from the battle, despite her injury, he gives her not one iota of attention. And he takes off on his own during Big Battle #2. The impression we are left with is \"hey, here's that douchebag we have been hearing about all book long.\" But WHY? It felt... utterly out of the blue, and horribly out of character for Chance. It was baffling to me.Then we have the plot.It wasn't bad, but it wasn't... well, it wasn't there. I mean, for 313 of the 316 pages in this book, I had no fucking idea what was going on. I am not even kidding. There was this necro warlock dude. And he kept attacking them. For the life of me, I have no idea what brought them to his attention, anyway. And also, given that in the last 3 pages of the book, when Chance's mom stands in the middle of the living room and explains the plot to us in a monologue, she says she put a spell on the bad guys so that they could never harm Chance, I don't entirely get why they were being attacked at all. But that aside. The plot went like this:Chance's mom (Min) was kidnapped. --> While investigating, Chance and Corine are attacked by Necro Warlock Big Bad. They don't know why. --> As they continue to investigate, they keep getting attacked by the Necro Warlock Big Bad, who apparently isn't very good at his job. --> They start to wonder if Necro Warlock Big Bad may be connected to Min's kidnapping. Reader wonders WTF is going on in this book, but is fortunately too distracted by relationship drama to spare it too much attention. --> Random huge dude shows up, claiming to be God's Hand, here to smite evil. Says God sent him to help in their quest. --> The team (Corine, Chance, Hand of God) troop off to attack Necro Warlock Big Bad compound (Big Battle #1). --> They win. (Hand of God prolly made this a forgone conclusion.) --> Still no mom, however. Dead warlock appears to be involved with human trafficking. --> Because Corine fell and hit her head on a Montoya tombstone, they look into this Montoya guy. (there is a lot of mysterious, is-it-God coincidence in this book, FYI) --> the team (Hand of God in tow) hit the Montoya compound (Big Battle #2). Rescue mom. Never see Montoya. --> At home, in the last 3 pages of the book, mom tells us WTF happened.Now, maybe I am spoiled, but... I like my story unfolding, as opposed to spoon-fed. I like to guess at who the bad guy is, or what the plan is. Midway through Big Battle #2, about ... 20 pages, maybe, from the end of the book, I realized that I had no freaking idea what was going on. Like, our characters are shooting Uzis at dudes in this Latin American compound, and I didn't really understand how we had gotten there. And also, there was a ... psychic? Magic? Super-dog. Is it God? Dunno. And a dude I suspect may be Stephen Hawking, astral projecting in on occasion to help them out.Seriously, WTF?And I am more sad because I picked up the second book along with the first, at the bookstore. Now it is sitting on my shelf, giving me eyes. But I don't wanna be baffled by another book! Do. Not. Want! :((And for people who wonder at the 3 star rating... my scale is a little weird. I think I have to adjust it down a little. 1 star = didn't even finish it. 2 stars = why, God, did I finish this? 3 stars = Eh. I finished it, it didn't hurt too much, parts were mildly entertaining. 4 stars = woo fun! 5 stars = holy crap, everyone must read this.)"}, {"userName": "Janice (Janicu)", "userReviewDate": "Jun 27, 2009", "userURL": "http://www.goodreads.com/user/show/20432-janice-janicu", "userReview": "http://janicu.livejournal.com/67296.htmlBlue Diablo is the first book in a new urban fantasy series by Ann Aguirre, who also writes the lovely science fiction romance series starring Sirantha Jax.The Premise: This series centers around Corine Solomon, who is a Handler - someone who can touch an object and recall its past. This means she's really sought after for her skills, but they have a high price for Corine, physically and in other ways. At the start of Blue Diablo Corine is in Mexico, living as an expatriate and not using her special handler talent. She's been in Mexico for about a year, after walking away from a bad relationship where she felt that her ex, Chance, did not really love her and valued her more for her talent than for herself. Unfortunately for Corine, her past doesn't stay away, and Chance shows up, asking for her help to find his mother, Yi-Min Chin, someone Corine really likes.My Thoughts: This book right away does a couple of things that gave it high points in my book: First of all the setting was not all in the United States, which is refreshing when I see it anywhere. Corine is living in Mexico before events mean she has to travel to Laredo, Texas, and this is reflected in her day to day life, the food, and the language. Spanish is peppered throughout the dialog, and I'm very glad that I took enough Spanish classes in my lifetime to understand it! I also enjoyed the descriptions of food (ah how I love reading about food).The second thing was Chance, Corine's ex-boyfriend, who is a half (at least) Asian hero. I have a huge soft spot for mixed race characters!. He's a very intriguing guy - at first he seems very polished and put together, sort of distant, but I think the reader gets this through the way Corine sees him because the book is written from her first person point of view. As the story progresses Corine begins to realize he may not be the person she thought he was. He's also changed in the year that Corine was away, and there are still feelings on both sides about the other. It's a little bit painful on both their parts and ultimately I hope things work out for them, but Corine is not quick to forgive at all. They have issues to sort out. I had to agree that Corine wasn't always the most gracious character, but love is messy sometimes. On the other hand, it almost seems like Chance actually likes her more for it (Disfunctional? I can't decide. There were a one scene in particular which springs to mind).That brings me to another aspect which I've noticed in Aguirre's work - the romances have their ups and downs and the main characters aren't perfect. They're flawed. Sometimes they do things I don't really like, but ultimately I can understand it, and I hope for them to grow. Which they do. I think Jax grows from book 1 to book 2 of her series, and I expect to see something similar with Corine.But I probably shouldn't just focus on the Chance/Corine relationship. Really I am Team Chance, but there is another love interest involved in Blue Diablo. There is a cop named Jesse Saldana, the main investigator in the disappearance of Chance's mother who has a talent too (he's an empath). Jesse wants to become Corine's mentor, but it's clear he's also interested in more. Whether Corine can trust him is another question.It's not just about the love triangle and the mystery of what happened to Yi-Min Chin. Corine meets some of Chance's contacts in Laredo and makes friends (who I liked), so the secondary characters were strong as well (Eva and Chuch were a really cute couple). And I particularly liked the dog! Ann hints there is a plot twist involving the dog in later books, dying to know what. There is also plenty of action going on - magical and other violence goes on. It's a bit gorey at times, but I didn't find it that dark despite that (not sure what my threshold is though. It may be high).Overall: I liked it - an urban fantasy with an international flare. It's an action packed first book, full of flawed but likeable characters and relationships. Must read for Ann Aguirre fans, and urban fantasy lovers who want to try out a new author who haven't read this one before."}, {"userName": "Kim", "userReviewDate": "Mar 19, 2009", "userURL": "http://www.goodreads.com/user/show/112377-kim", "userReview": "Please note: this review is based on an ARC I received; the book itself is due out April 7.If you haven't read anything by Ann Aguirre yet, what are you waiting for? Blue Diablo is a refreshingly new entry in the urban fantasy genre, featuring a sassy protagonist who is haunted by her past. Corine Solomon is a handler, who can read the history of an object by touch alone. Her ability was given to her by her mother as she died in a fire; consequently, every time Corine uses the ability she experiences extreme pain and burn scars. Formerly Corine used this ability in partnership with her lover Chance to locate missing persons, but when their last case went horribly wrong, Corine fled the country and opened her own antique store in Mexico City. But when Chance's mother goes missing, Corine agrees to use her abilities to help find her, and she finds that chapter of her past hasn't quite closed yet. I really loved this book, and Corine in particular. She's sassy and a survivor, but she's not the stereotypical kickass hard-bodied heroine you usually find in urban fantasy. She's short, dresses in bohemian chic, and likes to eat; she could be me or one of my girlfriends, except for her ability and the tragedy of her past. To me, she seemed quite real, as did her relationship with Chance; these are people who knew each other deeply in the past, but are uncertain how to relate to one another in the present. There's chemistry there all right, but Corine is uncertain whether she wants to go down that road again. Another thing I really enjoyed about this book is how real Corine's world felt. Aguirre is herself an ex-pat living in Mexico, which no doubt helped in portraying Corine's life in Mexico City. What really impressed me, however, was how the supernatural details were intricately woven with the details of daily life. It was really easy to believe in the magic that powers Corine's world because there are a lot of people who do believe in it; among the magically skilled are curanderas and practitioners of wicca and voodoo, who are credited with such abilities in the world outside the novel as well. I like urban fantasies with winged fay and gargoyles, but it's also a nice change to read something that doesn't stretch my credibility too far. Highly recommended, for its appealing characters, fast-paced plot, and authentic magical world."}, {"userName": "Gemma", "userReviewDate": "Nov 24, 2009", "userURL": "http://www.goodreads.com/user/show/2741525-gemma", "userReview": "This was a really strange book for me. I had bought it on the premise that the author Patricia Briggs had recommended the author and in ways I see similarities between Corine and Mercy from Briggs books.The premise for this book is that Corine is asked by her ex-lover and manager to help find his mother who is missing. She agrees out of love for his mother, Min, as she lost her mother in a fire when she was 12 years old. Corine has been hiding out in Mexico for the last few years, since the last job she did with her ex went south. She has changed her name and her hair colour to hide from her enemies and from Chance (her ex)Now the twist is that due to some twist of fate Corine is a reader, which means she can tell about the past of the person that owns the object or the future owner of an object. This 'gift' was a present or legacy from her mother, who naturally had this gift. Since it wasn't inhertied, corine suffers burns when ever she does a reading.The story was a bit slow and most of it involved Chance and Corine trying to pick up the trail. There were a couple of intresting bits in, The Seance and Butch to name a couple.Its not until about 2/3 of the way through the book do things start to pick up pace and we begin to see there is more to this than meets the eye.Overall, I would give it 3.5 stars, but it doesn't allow for that, so I've marked it down. The character development was good, but the plot was a bit slow. There is a set up for the sequal and though I'd like to read it, I'm in ruch to go out and pre-order it."}, {"userName": "Jess", "userReviewDate": "Apr 10, 2009", "userURL": "http://www.goodreads.com/user/show/901103-jess", "userReview": "Alright... I don't know what to say about this book, and I don't know really how to rate it. I enjoyed parts of it, and others were just grating on my nerves.I thought that Corrine was an interesting character, with a very cool ability. It was something that isn't portrayed much in other books, and Chance's character also was really unique. I was excited to read this one because it's different from the vamp, were etc.. that currently dominate the pnr/uf market. I liked the relationship between Corrine and Jesse, they provided some relief to the otherwise monotonous relationship of Corrine and Chance.Frankly, other than Chance's abilities which I thought were intriguing, he was really a scumbucket of a person. I didn't like him. I thought he was selfish and just overall he was irritating. I got so tired of the back and fort between Chance and Corrine. Get over it!! Accept that the relationship is over, or don't. Stop going back and forth like it's life or death. Jeeze.I don't think I'll bother with any sort of sequel, I liked the book to read it once, but not enough to read it again. And I really didn't like Chance lol."}, {"userName": "Daffodil", "userReviewDate": "Oct 08, 2010", "userURL": "http://www.goodreads.com/user/show/3596317-daffodil", "userReview": "I've enjoyed Ann Aguirre's Sirantha Jax series and her Ava Grey Skin series for differring reasons. So I went into this wanting to love Blue Diablo, but it's not quite there for me. I didn't really feel the attraction between the main characters. It's all on paper, but not making the connection for me. I did like the concept. Corine's powers and how she received them are interesting as well as other's paranormal abilities mentioned. The first 2/3 just felt slow. The introduction of a character in the last 1/4 really picked things up and the action sped towards a quick finale. I'll probably add the next book in the series to my TBR, but it won't go to the top of the list."}, {"userName": "Maria Schneider", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/2656836-maria-schneider", "userReview": "I'd give it 2.5. It's a decent enough read, but the angst between the two main characters is petty and somewhat contrived in places. Overall it's a decent enough read to give the series a try if you like Urban Fantasy."}, {"userName": "Kelly", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/1681911-kelly", "userReview": "If you're looking for an urban fantasy with a sympathetic heroine, a hot hero, cool abilities, some magic, and a demon or two, then this is the book for you. Not a vampire or werewolf in sight.Great premise, great writing. Damn, the sequel can't get here fast enough."}, {"userName": "Julie", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/17692043-julie", "userReview": "Basic plot-Chance comes to his ex-gifrlfriend Corine to ask if she will use her talent as a handler to help him find out what happened to his missing mom. She agrees in return for him using his talent of luck to find out what really happened to her mom years ago. What follows are demons, a villainous necromatic warlock, an angel of justice (not sure what else to call Kel), and a whole host of side characters to pull the plot along. Corine Solomon has the curse of psychometry. She can “see” things by touching an object. I would say she’s a loner. She lost her mother in a terrible fire, bounced in and out of foster homes, and doesn’t do long term relationships. While I can understand her reticent, it was that hot and cold attitude to Chance, her last relationship, that drove me bonkers! Chance has the gift of luck. He can focus his talent and good things happen for him..but not so much for those closest to him. He’s charming and appears to be an open book, but he tend to keep his innermost thoughts to himself. Getting to know Corine, I can’t blame the guy, but it turns out his reluctance goes further into his past. If you’re looking for romance, it’s a side dish, not the main course here. Chance and Corine have a connection, but Corine is so bottled up emotionally that there isn’t going to be a repeat relationship anytime soon. Corine left Chance over a year ago and although Chance says he’s never forgotten her, his actions imply otherwise to Corine. On her part, Corine responds childishly with her wishy-washy attitude to him, and it literally goes on and on. (I’m hoping Corine matures soon, because I really, really, didn’t like a lot about her character.)Blue Diablo is urban fantasy with some romantic elements. I started this book hoping it would pull me in from the start. There’s a lot of threads to follow, some made sense and others not so much, but the ending made the story worthwhile. While I didn’t really like Corine (and that could change with future books) I loved the secondary cast! Chuch the mechanic, with a few surprises under his belt and his wife Eva, a not quite licensed PI with a sassy personality. Butch the Chihuahua, who’s sense of communication had me cracking up! Booke, the Englishman who never sleeps and is a guru for magic. And then Jesse Saldana, a cop with a gift of empathy, a strong duty for justice, and who also has the hots for Corine. I hope to see more of them in future entries. While I wasn’t completely vested until the last 1/4 of the story, the ending was intriguing enough to make me pick up the next book."}, {"userName": "Kathy Davie", "userReviewDate": "Dec 09, 2011", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "First in the Corine Solomon urban fantasy series revolving around Corine, a handler of objects, and the new life she may be making in Laredo.  My Take This was good! A completely different take on the paranormal emphasizing some unexpected Gifts: handling objects to learn their history and Luck. Aguirre creates a sense of everyone out for themselves at the start and as the story progresses, the truth of the main characters' intentions emerges creating the promise of a very interesting series. In this installment, Corine and Chance uncover a smuggling business that supplies la zona among others in Laredo.Aguirre does a good job of creating a back story and incorporating it into the story without me feeling as though the information is being dumped on me like an encyclopedia while creating a pleasurable tension at the same time; we're simply continuing on with the characters' lives. I also enjoyed Aguirre's ability to retain the suspense with Corine's reply to Chance's question about their relationship at the end… I'm anxious to read the next in the series, \nHellfire\n, to discover if Chuch and Eva will continue to be a part of Corine and Chance's lives.Poor Jesse. Aguirre has this guy bouncing back and forth, torn between his responsibilities as a cop and his knowledge of other. I'm curious as to how he will fit in as well. The Story Life is good here in Mexico where Corine has set herself up in her pawnshop business, Casa de Empeño. She's always worked retail. Part of her Gift enables her to convince anyone to buy something and she's making an okay living here. With luck, no one from her past will ever appear and she will have peace from the hurt.Until Chance shows up. With a need for her help that she cannot withstand. Against her will, fighting against her desire for Chance, Corine goes with him. For she too loves Yi Min-chin. Min was kidnapped in Laredo and Jesse Saladan, the detective in charge of her case, has some unexpected revelations for Corine. He is other as well with a wellspring of information and contacts. Jesse is also interested in Corine for more personal reasons.Corine can't resist the opportunity to pay back Chance for his coldness when they were together and to use Jesse as a way to prevent restarting her relationship with Chance. A very careful dance between Jesse's interest and Chance's jealousy. And an interest that gets tested with the increased activity that surrounds Corine: attacks, bombings, and executions all have Jesse torn between his duty and his knowledge.For Corine and Chance uncover a major smuggling operation using a powerful sorcerer. The Characters Corine Solomon is a handler. When she touches an object, it's history unveils itself in her mind but at a terrible physical cost. The cost is because her Gift is not one with which she was born. Instead, the Gift came to her when her mother, Cherie Solomon, performed a spell transferring her own magic to her daughter when a Kilmer, Georgia mob came to burn them to death. Her mother gave her life to save Corine.Chance is luck itself. He focuses his Gift to the best possible outcome of whatever it is he desires, using it to help people although he is not averse to making money off it. This last is what finally pushes Corine to run from him. That last job. The luck favors Chance but not the people with him. His mother, Yi Min-chin, is a licensed homeopathic practitioner who loves Corine.Señor Alvarez does the buying for Corine's shop and steps in to watch over things when she has to leave for a day or more.Jesse Saldana is the detective in charge of Yi Min-chin's case in Laredo; Nathan Moon is his querulous partner. Jesse also has a Gift and he introduces her to the underground for people like them: Jeannie is the bartender at the Twilight in San Antonio and her husband, Bucky, has already warned Jesse away from her; Twila has a Gift of Sight and can see threads of fate, she always requires payment; and, Maris is the woman to see about discovering who can create powerful sendings. Butch is the orphaned chihuahua that Corine takes in. A good thing too since Butch is quite knowledgable about his owner's assassins and communicates well.Jesus Maria \"Chuch\" Ortiz Obregón is a mechanic now; in a previous life, he ran guns. And he's totally aware of the magic side of life. A good man to have at your back. His wife is Eva with a gift for forgery and an unlicensed private investigator who thinks well on her feet.Ian Booke is an Internet friend of Chuch's who lives in Stoke, England. His expertise is in hermetic magic and he takes this opportunity to try out astral projection; damned useful for scouting out locations ahead of time. There's a mystery attached to our Ian...Clayton Mann believed no one should get to tell him no if he wanted to rape a woman and Kel Ferguson is a killer for Jesus, a.k.a., God's Hand; both are locked up through Corine and Chance's actions. Both are threats to the two of them should they ever escape. The Cover It's a red-haired Corine leaning up against the bar in a white cotton blouse tied to bare her midriff wearing faded blue jeans and an elaborate belt and buckle with her favorite Blue Diablo drink."}, {"userName": "Samina ~ Escapism~", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/3974718-samina-escapism", "userReview": "My ratings: 4 out of 5 stars.All that Corine Soloman has ever wanted was to lead a normal life. Working retail, sell antiques, and just be as normal as possible. But she is anything but normal. She is a handler. A rarity among the Gifted, she can see the final moment of any object that she holds in her hands. After running from one corner of the country to another , changing her appearances every time she is now fed up. This time she wants to settle down and not think about running away. But than a surprise visit from Chance her Ex changes all her well laid plans. Chance is on a mission to rescue his mother and he wants Corine as she is the only person who can help him. Corine has no choice but to go with Chance to find his mother and together they realise they have chewed more than they can bite. It seems a lot more forces are in action and they want chance and Corine dead.Reading this story from Corine POV made it all very interesting. Corine was a straightforward, sincere and real heroine. She was not your typical Urban Fantasy heroine who would kick the villain's ass nor was she the annoying type who just scream and get in the hero's way during a fight scene. What I loved about her was how real she felt to me. I could relate to everything she felt and went thought. She was trapped in the situation and felt obligated to help Chance but on the other hand she wanted to run away to her life which she had established for herself.\n“Sometimes broken things heal crooked. The pieces didn’t fit anymore.”\nChance was unusual for a hero too. It loved how he was half Asian and tall, lean, dark and all in all a sex pot. I also loved his special ability and the price that came with it.He could not express himself properly and was emotionally barricaded. He probably feels a lot more about Corine than he lets on and people tend to misunderstand him. Throughout the book the sexual tension between Corine and Chance was palpable. They kept going back and forth and I was left feeling will they or will they not. It was clear that chance wanted Corine but Corine was confused and rightly so. She had suffered through out her time with Chance and felt she was being used. The fact that ether was another hotties around didn't help matters.\n\" You think my feeling for you died up when you walked away, Corine? You're still my love , even if you don't love me back.”\nOfficer Jesse Saldana was the was a new love interest which was introduced which turned this into bit of a triangle. He was obviously attracted to Corine and so was Corinne. I mean you can't blame her. Man in uniform who is loyal, sexy, handsome and uptight that you simply want to loosen him up a little. The jealousy his entry elicitated in Chance was oh so delicious.\n“Is that love? It seems like a pale word, too easily tossed about by people who don’t know the meaning of it, who twist it for their own ends. I’m afraid of it now, right up there with clowns, close spaces, and open flames.”\nThe plot was intriguing and the mystery was well written that I had no clue what would happen next. In true Ann Aguirre style, her side characters were as well done as her main ones. I loved Eva, Chuch, Ferguson and the ever elusive, Booke. They added so much spice to the story. They all were more than what meets the eyes and you are convinced there is much more in store for them. The whole story had a running Mexican feel to it all as it was set so close to the border and I really enjoyed the refrences to food and culture and ofcourse magic, warlock, zombies and rituals. Murder, magic , drug filled world painted by Aguirre was dangerous and exciting.\n“He would bear scars because of me, as I carried them for him.”\nDid I say I love the name Blue Diablo? I didn't even know it was a drink until mentioned. Even with all it's strong elements a few things let this down . I wish there was more information about the Gifted. Corine is initiated into their world by Jesse but I just wish there was more explanation about why they were gifted/ Corine obviously has a tragic past and it coloured her life in more ways than one realises. Moreover, the ending felt a bit abrupt. I wanted more explanation and after the climax and on why Min( Chance's Mother) was kidnapped.\n\"You're like sunshine to me , Corine.”\nBlue Diablo mainly centered the relationship between Corine, Chance and Jesse. Chance and Corine were hot and cold they had me on pins and needles. It was a well balanced Urban Fantasy with lots of romance (even if it had little sexy times) and a brand new world with characters which have room for character development.\n\"Christ. What do you want from me?\"\"Only what I always wanted. Everything.”\nI certainly would be reading the next book, Hell's Fire to know more about Corinne and her new found ability and of course, get more Chance.Read more of my reviews at Escapism from Reality"}, {"userName": "Tabitha (Lovely Books Blog)", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/11973030-tabitha-lovely-books-blog", "userReview": "Read more reviews like this at http://lovelybooksblog.blogspot.com!I’m not a fan of books that include a former lover coming back into a character’s life. For some reason not being able to see how they met always makes me feel like I’m being thrown into a story that has no background. However, Blue Diablo didn’t feel like that, I didn’t feel thrown into the story and Aguirre had a way of weaving the story in such a way that not having all the details of their relationship made sense instead of feeling disorienting. The farther I got into the story the more it became apparent that I was going to really enjoy this novel.Even though the plot of Blue Diablo was nothing new, Aguirre was able to make it feel fresh and exciting through wonderful writing and amazing character development. A vast majority of the plot involved Corine and Chance, as well as their friends Chuch and Eva, doing legwork and talking to people but Aguirre’s writing had a magnetic quality that made me keep reading, even when there was nothing exciting going on. Even though they were few and far between the action moments that were present were heart stopping and full of enough excitement to hold me over until the next one.Gritty and rough the Mexican setting worked perfectly for the story and really made the entire plot come together. I don’t think the kidnapping aspect would have been as dramatic without the setting and in the end it was part of what really made the novel. Another thing that really made the novel come together was Chance’s gift, the gift of luck. I was completely fascinated by his abilities and I absolutely cannot wait to read the next novel so I can learn more about how they work.The only thing I didn’t like about this novel was the infuriating love triangle. Love triangles never make anybody happy and the triangle in Blue Diablo was especially annoying because of how back and forth all the character were. Nobody could make up their mind and before long I got sick of reading about the back and forth games between Corine, Jesse, and Chance. Not to mention it was totally obvious who Corine wanted the entire time; she spends a vast majority of her time thinking about Chance and their past relationship and how she wants him back even though she thinks it wouldn’t be good for her.Fans of urban fantasy who aren’t scared of a terrible love triangle won’t be disappointed by Blue Diablo. Aguirre’s captivating writing and wonderful character development make for the few shortcomings in this novel and in the end I found myself loving this novel more than I initially thought I would. Count me in for the next novel!"}, {"userName": "Blodeuedd Finland", "userReviewDate": "Mar 18, 2009", "userURL": "http://www.goodreads.com/user/show/1962503-blodeuedd-finland", "userReview": "Blue Diablo by Ann AguirreA Corine Solomon Novel18 months ago Corine Solomon left her lover and crossed the border to Mexico. She was fleeing her past and her gift, as a \"handler\". Which means that when she touch something she can know its past, and sometimes its future. She used it to find missing people - and that is now why people want to find her.That is how her ex, Chance shows up in her store. He has an ability that gives him luck. Someone they both care about has gone missing and he needs her to find that someone, not to mention that he needs her too. Their search leads them into a world of dark magic, demons, zombies, witches and people that show her that she is not as alone as she first thought.I really did enjoy this book, and I knew it from the start. It is that kind of book that makes you want to continue reading, you feel the urge to know what is going to happen. It's an easy book to read, and it was just what I needed. It sure lifted my spirits after reading some not so good books. i felt that good books are still being written and this is one of them.First of all I liked Corine, she is colourful (and then I am not talking about her clothes). I didn't know what to think about Chance at first, just as she struggled with her own emotions for him. But then I did want to see them together. Though I do confess that sexy cop Jesse Saldana sure stirred the blood when he showed up. He was a lovely surprise in the book.This book sure had a bit of everything thrown in and perhaps that is why I liked it. It did feel different, and a good book needs that to stand out. What is better than dark magic, and then zombies too. Yes even those fitted in.I do like a book that makes me giggle, and smile. Oh it has some really good bits in it, one that involved a conversation about some cakes and ice-cream after dinner sure made me giggle while I read it.So if you are on a lookout for a book invloving paranormal, romance, danger, and some fun times then this is the book for you.How I am supposed to say something bad now..... ok, the cover, when Corine was described in the book I sure thought about her a certain way and that cover doesn't seem like her. The jeans, yes, but not the blouse. Lol, yes this really seems to be the only negative thing I can think of.I will give this book 4/5 because I enjoyed it a lot, and I would recommend it to others.It also made me want to read more of Aguirre's books since I haven't read her sci-fi books yet.Blue Diablo comes out on April 7th"}, {"userName": "Sarah", "userReviewDate": "May 14, 2010", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "Corine is a handler which means that she can touch an item and know it's history but using her gift comes at a high price. She has been living in Mexico City for the last 18 months trying to hide from her ex-boyfriend Chance and the life they had together. Although they used to help people with her gift they often ended up getting into trouble and made some dangerous enemies along the way. Now Corine just wants to live a quiet life and keep her \"gift\" a secret. When Chance arrives on her doorstep the last thing she wants is to get involved with him again but he needs her help. Min, someone they are both very close to, has gone missing and the only way they are going to be able to find her is using Corine's gift. Following a trail of clues to Texas they come up against a dangerous enemy - they are going to need help but it isn't going to be easy to decide who they can trust. Blue Diablo is told from Corine's perspective and I liked her voice immediately, Corine may not be your typical urban fantasy heroine but she is a very real character that I found it easy to relate to. Her past relationship with Chance has been plagued with difficulties and although Corine left him they both still have strong feelings for each other. Despite the attraction between them Corine is nervous about letting him close as she doesn't want to get hurt again. I felt the way that Corine and Chance reacted to each other was very realistic and I'm interested in seeing things develop between them in future books in the series. There is a great cast of supporting characters from their friend Chuch & his wife Eva to the sexy detective Jesse Saldana who is also investigating Min's disappearance. Ann Aguirre has a wonderful way of describing things making it easy to picture the scene - after reading this book it is easy to imagine that I've actually visited Mexico and Texas. If I have anything negative to say it would be that some of the action scenes towards the end of the book felt a little rushed but I found that a minor irritation and overall I really enjoyed Blue Diablo. I thought this was a great start to a new series & I'm looking forward to reading Hell Fire and finding out what happens to Corine next."}, {"userName": "Patrícia", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/149100-patr-cia", "userReview": "RATING: 1.5 stars.I don't know if it's the author's writing style (it must be, at least partially, as I had some trouble getting through Grimspace as well) but this one was hard to read through. The plot was very simple and straightforward, not that interesting; maybe not enough for a full novel, so the author fills pages and pages with Corine (the main - sort-of - character) contemplating her past relationship with Chance, her ex-boyfriend who appears on her doorstep at the beginning asking for her help to find his missing mother. Angsty thoughts and interactions between these two characters follow, sprinkled throughout the book, making it... well, boring. The kidnapping is pushed to second plan, not given as much spotlight as the relationship talk. Ok, so it's normal to wonder what could have been but does Corine really need to do it every other chapter? Does she has to think about how she wants to jump Chance's bones and then angst because she can't that frequently? Do they have to have embarrassing and pointless conversations about how they misinterpreted each other in the past every other page? A little of all this might be called character development, but this much just reeks of filler. Of course with this much focus of the status of the characters' relationship the plot wasn't properly explored and the resolution felt... flat. There was little foreshadowing (about who the evil warlock was, etc), the characters did little to no investigative work and most of the time they just stood around in a house.World building was pretty bad as well. Okay, so there is a hidden world of practitioners but what exactly is a handler? How did Corine come by her gift (the explanation given is murky at best)? If Jesse is her mentor, why didn't he explain more about that world? The author would have gained more in setting the world in which the characters move than focusing on Corine and her ex (who does seem like he'll be present in the next book).Honestly, I didn't like this one much. It was boring and underdeveloped in all the ways that mattered. I know Aguirre can do better, as I've read the first in her other series, \"Grimspace\" and enjoyed it a lot more."}], "description": "Corine Solomon is a handler. When she touches an object she instantly knows its history and its future. Using her ability, she can find the missing, which is why people never stop trying to find her. Like her ex-boyfriend Chance, who needs Corine's gift to find someone dear to them both. But the search proves dangerous as it leads them into a strange world of demons and sorcerers, ghosts and witchcraft, zombies, and black magic...", "title": "Blue Diablo\n      \n          (Corine Solomon #1)", "url": "https://www.goodreads.com/book/show/3588137.Blue_Diablo__Corine_Solomon___1_", "average": 3.54, "cover": "https://images.gr-assets.com/books/1304756284l/3588137.jpg", "reviews": 331, "authors": [{"url": "https://www.goodreads.com/author/show/835348.Ann_Aguirre", "name": "Ann Aguirre"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/3588137-blue-diablo", "http://www.goodreads.com/book/show/6624378-blue-diablo", "http://www.goodreads.com/book/show/7236264-blue-diablo", "http://www.goodreads.com/book/show/8071624-blue-diablo", "http://www.goodreads.com/book/show/7137327-enclave", "http://www.goodreads.com/book/show/10193062-outpost", "http://www.goodreads.com/book/show/10596724-horde", "http://www.goodreads.com/book/show/1828067.Grimspace", "http://www.goodreads.com/book/show/3182799-wanderlust"]}