{"ratings": 97, "userreviews": [{"userName": "P.S. Meraux", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/57439192-p-s-meraux", "userReview": "The story begins with a special infant being abandoned or rescued --depending upon your viewpoint -- outside the front door of the Whayne family. Emily grows up like a normal child without realizing that’s she’s got special abilities. Her godfather makes sure that she is prepared for any trouble that might come her way by encouraging the girl to take swimming, fencing, martial arts and horse-back riding…all are skills which will come into play later on. C. E. Johnson creates a confluence of worlds where all kinds of amazing feats are possible. And I loved the fact that while Emily has pointed ears, her bondsmate, AKA magical animal companion didn’t. Narration takes place through many POV’s which creates a rich texture for this environment and gives the characters more complex and well-developed personalities. Between Earth and Acacia there is a veritable smorgasbord of inhabitants: humans, magicians, vampires, wraiths, elves, gnomes, ogres, goblins, wyverns, keleks, corsairs, sarchus, Gorgs, water cobras, and yapoks. Oh, and lest I forget…there be dragons too! Quite an intimidating array of potential opponents for a teenage girl and her pet doberman to deal with.If I had one negative thought about the book, it’s that I never understood what is so special about ‘Ammolite’ for Emily. The author has crafted a well thought out novel that I can highly recommend to any age group. There are a number of loose threads but I expect they will be answered in the subsequent books and serve as a hook for readers. I look forward to the next book in the series."}, {"userName": "Peter Diggins", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/31080346-peter-diggins", "userReview": "Review Summary: The Ammolite Adventures: Bluestone is a well-written young adult fantasy book that is a real page-turner.Rating: 90%Review in a bit more detail: Emily Whayne was dumped. And by dumped, I mean dumped on the doorstep of strangers, as a baby. Luckily for Emily, her adopted parents raised her well, with help from her godfather Dr Andrew Dalton. Dr Dalton is in truth a wizardly-type from the world of Acacia; Emily’s true homeland. With Dr Dalton’s help, Emily develops her own magical abilities. Emily’s progression attracts the attention of several organisations, from Earth and elsewhere, who seek to capture her for their own ends.Emily must rely on her wits and training to evade them all for long enough, to make the trip home to find out some truths about her own unique origin.“You’re a wizard, Harry.”Or, in this case, Emily. Emily’s magical training bears no resemblance to Hogwarts, though. Having said that, the magic systems used in this book are very well thought-out and explained. A good example is the very well fleshed out animal bonds magicians form. Emily forms a bond with Xena, a Doberman puppy that grows into… a large Doberman. Emily is also lucky to have some very staunch allies on her quest. Clear lines are drawn to differentiate between those for and against. The villains are interesting; it’s easy to feel a little sympathy for them, as their all-too-human emotions are drawn forth and on display. There’s a very good glossary at the back that helps if you get a little lost on the way through.A book about teenage girls coming of age isn’t normally high on my list of things to read, but having said that, I’m glad I had the opportunity to read this book. I’m looking forward to reading the rest of the series. I’d recommend this to any fan of young adult fantasy fiction. It’s an excellent read. Pete Diggins14 July 2017"}, {"userName": "Nathan", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/46098438-nathan", "userReview": "I am a 6th grader, accidentally stumbled on this book, and glad I did so. I picked it up and never put it down until the very end. The Ammolite Adventures is a unique combination of science-fiction and fantasy, my favorite genres. This book is unlike any other I have read before. Emily, the main character, is as intriguing as the twists and turns that are defining her young adult life. I can’t wait to read the second book in the series, and perhaps other books written by CE Johnson in the future. Girls, boys, young or old, this is a great read."}, {"userName": "Stjepan Cobets", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/44823204-stjepan-cobets", "userReview": "My rating for the book is 3.8Writer C.E. Johnson introduces us to the world when Emily's baby was brought to the doorstep of the Whayne family. In a message that a baby had been brought into their home for dangers and they had to raise Emily as her child because they were chosen. Most of the stories in the book are happening on Earth and talk about Emily's growing up. The story is well written and I have to admit that the writer has a lush imagination, the characters are well balanced, but my main objection is that Emily is too perfect. No one is perfect and everyone has own flaws, and this is missing. Basically, this is a good book fantasy that still needs to take us to the world of Acacia and the world of magic Emily possesses. Emily will go through the book to grow up and become aware of the real truths about her origins because her godfather is Dr. Dalton will introduce her into the world of magic and explain her everything she needs to get back to Acacia. But her enemies are not asleep and at all costs, they want to catch Emily, and in all this is invaded a government secret organization that seeking for the people with special powers. Although this is YA fantasy novel I would recommend it to all lovers of genre fantasy. The story will grow in the following sequel and become a very interesting serial fantasy."}, {"userName": "Angel Leya", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/39838345-angel-leya", "userReview": "Loved this story!14 year old Emily has powers, which thanks to the guidance of her godfather have both developed and remained hidden. But Emily is not from this world, and she'll have to make a decision soon, to either travel to her home world and learn more about the family that gave her up as a child, or face the two groups threatening to disrupt the life she's come to love on Earth.The book had a bit of a slow start, the threats around Emily not really building to a truly threatening boil until about the halfway point in the book. I also found some sentences to be a bit long and winding.But the world the author created is incredible and unique. The magic use is intriguing, and the time difference as well. I found some aspects of the time difference little hard to reconcile (1 day on Earth equals a year on Acacia, so Emily has been gone for about 5000 years), but the author includes a list of rules in the glossary at the end (along with lists of names and places in case you get lost). Traveling to Earth resets your age, so it's possible to live an incredibly long time. I can only assume that her family and the main evil character, Samil, have utilized this fact to the fullest extent possible.There are a lot of loose ends (what do Drogor and Samil want with Earth? and how does Malachi play into things?), and the book ends on a bit of cliffhanger, but I found myself thoroughly enjoying it by the end.I will say, though Emily is 14, she seems much more mature (more upper YA), and Samil and the female vampire's roles are certainly a bit darker, so I feel fantasy readers of young adult and upwards will enjoy this book."}, {"userName": "Val Johnson", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/52205424-val-johnson", "userReview": "Excellent reading. Easy to understand with vivid descriptions of characters and scenes."}, {"userName": "D. Miller", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/43217141-d-miller", "userReview": "Some novels in a series can stand on their own, but not this one. The Ammolite Adventures #1 Bluestone leaves so many loose threads at the end of the last sentence that the reader can only hope for the sequels to tie at least most of them up. Like all creators of great fantasy novels, C. E. Johnson introduces the reader to a new world unlike any other he/she has experienced; Acacia (described as a parallel world to Earth) is dominated by magic—white, black and all colors in between—and is governed by rules all its own with special creatures, some that match those on Earth, but others that are entirely different, too. Capping off the book is a detailed glossary, of which I wasn’t aware until the end, as I read a Kindle version. It might have been helpful earlier on.The first few pages drew me right in with the story of the female baby from some unknown land being deposited on a couple’s doorstep in the midst of a snowstorm by a “warrior”. The author’s mastery of vivid description is evident from the start, although some young adult readers may find the description too thick at times. Emily is a likeable heroine, a kind person who doesn’t want to cause harm to others, in a story that introduces a cast of much less sympathetic characters. Over time, she hones her physical skills and prowess, unwittingly preparing herself for battles to come on Earth but even more so on Acacia. She loves her earthly parents but also longs for contact with her real family, the family that presumably still lives back in her original home of Acacia, despite a violent event that forced her to be taken from them and brought to Earth for her safety. But as Earth is the only home she has known, returning home to Acacia with only her bondsmate, a loyal and fearless female Doberman mix, is a daunting challenge for one so young. However, life on Earth is becoming increasingly perilous for her and by extension her earthly family as multiple adversaries rise up to try to capture her, having recognized her unique supernatural gifts.The conclusion of this book reads like the end of one long chapter, so the reader is left hanging. Does Emily find her family, well and alive? The reader is still not sure exactly what traumatic event occurred that separated Emily from her real parents and twin brother only moments after she was born. What caused her to be so sickly when she was a babe? What happens to Dr. Dalton, her godfather, and the one who brought her from Acacia—last the reader knows, he is in captivity (courtesy of the US government)? What is so significant about ammolite, the gemstone after which the series is named? What about her budding “romance” with Luke—does she return to Earth to carry on with it? How do all those villains, earthly and Acacian, wind up: Samil, Cyril, Drogor, Maaca along with Droth, Malachi Hughes (adopted son of the president), and even the president of the US, William Hughes, himself, whose fascination with the supernatural seems suspicious. The US government’s intense interest in young teenaged Emily and her bondsmate, Doberman Xena, needs further development to make sense. Some scenes stretch credibility, such as the battles between government agents and Droth’s mercenaries for Emily’s capture. It is hard to imagine Emily going about her extracurricular activities so normally with such formidable foes working so tirelessly to snatch her.Fortunately this book has several sequels, so the reader can only hope that these questions will be answered. And undoubtedly more questions will arise as the plot thickens even more.At its core, this entertaining, original and imaginative novel layered with rich description is about the eternal battle between good and evil, innocence and corruption, pure vs selfish motives. And trudging ahead, making the best use of latent gifts and abilities, even when the battle seems hopeless. Which side will win? The reader will have to continue on in the series to find out.If this was a standalone novel, I would give it four stars for leaving the reader hanging out on the line at the end, with next to none of the different story plots resolved. But since the concurrent stories continue on in the sequels, presumably, I gave it five stars in recognition of the complex world and imaginary beings the author has created in Acacia. Pulling that off so well displays much more than just meager literary talent."}, {"userName": "Scott Spotson", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/19037198-scott-spotson", "userReview": "The beginning of the book was boring, it dragged on and I didn't care much for how the main character, Emily, arrived on Earth. Plus, the villain at the beginning, Samil, did not interest me, and seemed to disappear by the end of the book. The questions arose: why are decision makers from the parallel planet, Acacia, so interested in Earth and how does our planet meet their needs? And why are they so interested in Emily, since she is only a child?But around the point where Emily forms friendships at school, and is past the introduction with the mysterious and magical Dr. Dalton, the book started taking off and by the end, it had escalated into a rich, layered, and textured form of fantasy, and I enjoyed it. The juxtaposition between the sweet child's tale of magic and some of the gruesome atrocities (i.e. tormenting and ending the lives of innocent magicians, all young men, in order to harvest their magic, although the book conveniently has all deaths on Acacia end in a \"puff\" of metal particle smoke, as well as the running gun battles between clandestine agents of the U.S. Government and those of the otherworldly villain) seemed jarring at times. The author downplays these horrific events, but I as reader can fill in the blanks and imagine what is really happening. It also seemed strange and odd that Emily could lead pretty much a normal life, several times, after several attempts to abduct her. If such a situation happened in real life, Emily and her family would have been placed in a witness protection program, moved to a different state, and the family's identity altered. But! The joy of this book is infectious, and the magical system is enthralling and enticing. It's almost this book could have been written without villains or government spies on Earth, which detracted from the story, as Emily is so endearing, and so is her magical companion, a Doberman Pinscher. I really enjoyed it when Emily travels to her home, Acacia, and learning about this new planet. Some of the gun battles were silly, I thought. I didn't see the need for the U.S. President to be involved in the story... typically a President would be in office only four or eight years anyway, due to term limitations.The writing is wondrous, both being suitable for pre-teen reading level as well as elaborate enough for adult readers."}, {"userName": "Jarrod Cline", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/21483219-jarrod-cline", "userReview": "Emily, a teenage girl in Texas, is drawn towards her destiny in the first volume of C.E. Johnson’s thrilling adventure series, The Ammolite Adventures. Volume one begins with a mysterious stranger leaving a baby on the doorstep of an unsuspecting couple. They take the child in, and unable to find her family, raise her as their own.This is no ordinary child, though. With a gift for athletics, she soon becomes an expert swimmer, fencer, and horseback rider, among other things. Tutoring with her godfather Dr. Andrew Dalton, Emily soon learns that she has special abilities known only to the two of them - or so she thinks. With her trusty Doberman Xena almost always by her side, she is being tracked by a shadowy mage as well as a government agency.In an epic novel that sets the stage for what is surely a devastating clash between two worlds, the author transports you into an exciting tale of magicians, vampires, and dragons. As Emily comes into her own and journeys to her birth planet, she begins a search for information about her family.This is a fun story that you don’t want to put down. There are many interesting subplots that keep you invested in the different characters, and the main storyline feels as though it has just begun. Keeping the action moving at a quick pace, while never skimping on character development, the author has written a worthy addition to the action fantasy genre."}, {"userName": "Edward Sweeney", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/51581434-edward-sweeney", "userReview": "I purchased “The Ammolite Adventures” by C.E. Johnson after reading the summary for this very interesting book. I love reading well written science fiction and this story line looked like something that I would enjoy. After reading “The Ammolite Adventures” by C.E. Johnson I can officially say that this story did not disappoint and it was most definitely one fascinating and fun read! This story begins with Emily Whayne, who is fourteen years old, learning from her grandfather that she is from another world and that is not all, Emily also has magical powers. As the story continues Emily has the opportunity to travel to a parallel world and if she journeys to this parallel world she will be able to hone her magical powers. C.E. Johnson’s writing adds a real depth to the characters in this story and the conversations in this book feel very authentic & real. Also, the story line moves along swiftly thanks to a very strong plot which really kept me engaged in the story. If you’re a fan of well crafted fiction then you will have a hard time putting down “The Ammolite Adventures”. A highly recommend this book and I look forward to reading more books by this very talented author."}, {"userName": "Aammton", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/36471320-aammton", "userReview": "A fantastic sci-fi, fantasy, adventure story of 14 year old Emily Whayne who discovers her purpose using strange powers and travelling to parallel dimensional worlds. I would say this is appropriate for young adults readers. The story is exciting and well developed with a multitude of interesting characters. I love this book and I can't wait for the second book Highly recommended. I downloaded this book as Kindle ebook."}, {"userName": "Lauren Abbott", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/62751653-lauren-abbott", "userReview": "I enjoyed the first two books, they should be read together"}, {"userName": "William Collins", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/51116319-william-collins", "userReview": "4 starsThe writing in Bluestone is vivid, descriptive, and at times astonishing. I felt the story had a slow start and focused too much on explaining things than getting to the action. But that might just be my personal preferences. After the first five chapters, I found the book much more engaging. The magic system was intriguing and well imagined by C.E, what with the different colour magus and the magestones too. I particularly like the idea of wraith-spirits, although the detail of all this magic did get confusing sometimes. The world of Acacia was also thoroughly developed and I would’ve liked to see more of it in the book. I enjoyed reading the chapters from Samil’s pov more than Emily, they were my favourite parts of the novel actually, and I liked his character more than hers. But other, younger, readers will probably relate to Emily more than I did. As a dog lover I loved Emily’s almost constant companion, Xena, and the relationship Emily had with her.The glossaries at the back of the book would’ve really helped when the invented names got confusing, but I didn’t see said glossaries until I finished the book. Perhaps placing them at the start would’ve been better, although I can understand why the author would want to go straight into the story. Overall, Bluestone was a nice read. C.E showed great imagination and crisp writing. If you enjoy in-depth magic systems and fantasy worlds, you’ll enjoy this novel."}, {"userName": "Crystal", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/33546176-crystal", "userReview": "C.E. Johnson has created a truly unique and magical world. This is a pure fantasy novel, even though fourteen-year-old Emily begins her life here on Earth. From the first chapter we learn that she has other worldly origins, and several people from her home planet of Acacia come through to our world. I enjoyed learning about all of the rules of magic, types of magic, and watching Emily discover her own special abilities. I’ll admit, this novel is packed with details, colorful characters, and new vocabulary to digest, which at times was a bit overwhelming. However, there is a glossary at the back of the novel that I could refer to if needed.My favorite magical aspect of C.E. Johnson’s world was the bondsmates—animals that share a telepathic bond with their magician. I enjoyed the relationship between Emily and her bondsmate Doberman, Xena. Different magical factions are hunting Emily, and her presence on Earth is only putting her adopted family in jeopardy. As she grows stronger in her magic, she must ultimately return to her home planet, a place she has never been to before. The pacing of the novel picks up once Emily and Xena are in Acacia. Her adventures here were my favorite, and I was disappointed the story ended on a cliffhanger. I’m not a fan of cliffhangers, but C.E. Johnson is forgiven because the second novel, Redstone, is available. At least I don’t have to wait to find out what happened to Emily. I recommend this novel to anyone who enjoys reading about rich fantasy worlds, magical creatures, and grand adventures!"}, {"userName": "E.M. Swift-Hook", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/56474181-e-m-swift-hook", "userReview": "Mary Sue From Another World\"Don’t trust anyone except your parents and your close friends, and don’t let anyone else know about your magus … the government has been trying to locate individuals with psychic power for years.\"Emily is left with adoptive parents on Earth by those who think life for her on her own planet might be a bit hazardous. Fortunately, it just happens that the local hospital her adoptive parents take her to have a paediatrician from Emily’s home planet. Meanwhile the President also has an adopted child of mysterious origins… This is a book that has all the elements of a typical YA novel - the undefeatable heroine who is ‘special’ and who everyone adores (except the ‘bad’ people), a wise mentor, and evil enemy, school times, mental bonding with a pet (that just happens to be a ferocious dog), spells like in Harry Potter, horses - and endless attempts at said heroine being abducted. Oh, and a secret world in which she is, of course, a Very Important Person.Acacia, it turns out, is not just pretty shrub, it is really a hidden planet where magic is used the way we use technology - but not as effectively as they still live in the middle ages. There are also a few problems such as you can spend years there but you come back to earth and find only a few days have past and you are whatever age you were when you left. Pretty grim if you left earth as a baby grew up on Acacia and then came back! However, spend a few years on earth and centuries have slipped by in Acacia. ‘Feeling emboldened, she ran through the grass and vaulted into the air performing a double layout and finishing with a twist and then performed a series of gymnastics moves that only a handful of females in the world could dream of completing, all with a sword on her back.’The characters in the book are all quite well drawn and most manage to escape their trope ‘mentor’ ‘parent’ ‘friend’ ‘bad guy’ etc. to become individuals we can care about or despise. The pace is decent and the story moves along from crisis to crisis at a convincing clip. The strength is in the imaginative world-building (there are SEVEN glossaries at the back of the book).There are a lot of issues with the book, for me, though. The writing is very flat with little reader engagement. The quote above gives a typical example of how an action scene is handled - although in this case we are not even told what this display of athleticism was supposed to achieve. The ‘real world’ elements such as the behaviour of government agencies and Emily’s parents, stretched my credulity a few times beyond snap-point.‘Murmuring worriedly as the war horse stamped restlessly, a crowd gathered to watch her attempt to mount the beast.’But the biggest problem is Emily herself. She is too perfect. After one point when she meets the bad guy when she is still a baby (when there actually was a brief moment of wondering if he might do something nasty to her), there is never any sense that anything really bad will happen to her. Even in little things. The crowd might worry she won’t manage the scary warhorse, the reader has no such doubts. That means there is zero tension in the book.This is a typical YA style read and those who enjoy that kind of thing and don’t mind the writing style will thoroughly enjoy it as a result."}, {"userName": "Steve Pillinger", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/69086699-steve-pillinger", "userReview": "I thoroughly enjoyed this book. It was well plotted and grabbed my interest from the start. The characters are presented in a warm and sympathetic way (even the baddies!), which I found refreshing. A tribute to the quality of the writing is that even though I don't normally 'do' vampires and half-dead, I was able to suspend disbelief (or distaste) and enjoy even those parts of the story, though in a more muted way.There were a couple of places where I had reservations, so let me mention those. The first was the maps. I love maps in a fantasy/other-world story, so it was a huge plus for me that detailed maps both of Earth and Acacia were included. However that plus was wiped out by the fact that their resolution is so low they were barely readable. (This is on a normal-sized iPad.) On the Acacia map I could only decipher the largest names. And though there's a web link under each map (which is great), sadly the online maps were only slightly better, even on a 27-inch screen. I could read more names than on my iPad, but there were still many that were pixillated and indistinct. I would strongly recommend increasing the resolution of the map images.At a couple of places in the story I felt a disconnect—things relegated to a flashback that should have been described directly; behaviour that seemed inconsistent with the way a character's personality had been developed; things taken for granted that should have had some explanation; and occasionally a little too much telling rather than showing.There were also a number of cases of inappropriate word choices; but not enough to slow the reader down or spoil the story.The ending was a little sudden, and there was no cliff-hanger to hook you to the next book—though some might see that as a good thing!Moving back to the positives, the magic system is thoroughly worked out and convincingly described. I felt the 'bondsmate' concept was especially well done. The various 'extras' at the beginning and end were also useful: the various magic-related glossaries, the lists of characters and locations, and so on.As a linguist I also appreciated the fact that provision was made for the main character, Emily, to learn the Acacean language before she has to start communicating with Acaceans. It really chews me up in fantasy novels when characters arrive on an alien planet and immediately start a two-way conversation in English with the natives!All in all, a very good read. I can unhesitatingly recommend this book."}, {"userName": "L.N. Denison", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/41486482-l-n-denison", "userReview": "Good little read!Actual rating 3.5I story was decent enough. Well conceived and well written. I did find the beginning a bit of a trudge, but after that, everything seemed to fall into place. We watched as Emily Whayne came into her own, watched her grow as the story progressed.The author makes the effort, both beginning and end, to explain the different stone colours and what they mean, what each character's part is within the story, and all the many obstacles that Emily has to face throughout the story. If you like sci-fi/ fantasy, do take a look at this story. It's a good little read."}, {"userName": "Matt Cowper", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/59399340-matt-cowper", "userReview": "Johnson's fantasy world of Acacia is enchanting, with marvels and danger at every turn. Unfortunately, most of the novel is spent on a “normal” planet Earth, and that world is far less interesting.For much of the book, we follow Emily Whayne as she participates in various summer activities. Emily is a capable, kind-hearted teenager, and her foster parents care for her deeply. Her godfather is also a powerful ally, as he knows Emily's true origin and how to develop her magical talents. She has good friends, and of course a rival to keep her on her toes. It's all very wholesome – and not very engaging. I wanted more action, more consequences, but instead I had to read through what was basically a very long character introduction.There are some sinister forces on the periphery, but they don't really get moving until the latter half of the novel. There's a lot of setup, a lot of chess pieces being moved about, and an ultra-powerful, sultry vampire that's created, but all that could've been compressed into a few chapters. Even the shadowy government agency tailing Emily or the even-more-shadowy Acacian forces vying for her didn't grab me, because they spend too much time talking and – except for a memorable chase scene – not enough time doing something.Finally, though, the novel kicks into high gear when Emily transports herself to Acacia. The land is magical and lush, as is Johnson's prose. The trinkets sparkle and awe. The dangers are truly perilous. Our senses are as overwhelmed as Emily's. It's a well-done fantasy panorama. But, mainly, things now feel important, whereas they didn't earlier in the novel. Yes, Johnson had made some detours into Acacia before, but it was mostly to set things up for later use.If the entire novel was like Emily's jaunt into Acacia, it would probably be worthy of five stars. But the earlier plotting left me unfulfilled, and so three stars is my verdict."}, {"userName": "V.R. Craft", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/61037382-v-r-craft", "userReview": "This story had an interesting mixture of fantasy characters, politicians, and a girl with impressive powers.As an infant, Emily is left on the doorstep of the Whaynes, who become her adoptive parents. Her doctor, Dr. D, becomes her godfather and trains her in various martial arts and other skills. He also teaches her to use her magus, or magical powers, and eventually explains she and he both come from another planet, where time moves much slower than on Earth and magical powers are heightened. Emily's Doberman, Xena, becomes her bondsmate—an animal she can communicate with telepathically.By the time she is 14, Emily has several people after her—a group commissioned by the president, who is looking for people with magical powers for a pet program of his; a black magician who wants to hurt her to increase his own power; and a group of FBI agents who are after both the magician and Emily, who eventually end up working with the president's group.After the beginning, when Emily is left with the Whaynes, I thought the story moved a little slowly in some parts. I liked it more after Emily departs on a journey to her home world, and would have liked it if that took up more of the story. I did not find the scenes with the black magician especially interesting or sympathetic, but he is the villain, so maybe that's okay. I did think some of the scenes between the beginning and the main conflict that develops when Emily is a teenager could have been shortened or cut, speeding the story up and getting to the more interesting parts sooner. The book does end on a good cliffhanger that will lead you wanting more, and Emily's journey and her relationship with Xena are entertaining."}, {"userName": "Madison Diaz", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/52903756-madison-diaz", "userReview": "Intriguing StartI usually don't read fantasy as I'll have a hard time keeping track of different creatures and names, but this novel did a great job of keeping on track without overwhelming the reader with a million characters and creatures all at once.The characters for this story were very strong and I loved the subtly of their relationships with one another. There were very strong themes of love, trust, and respect between them. Even the villains in this novel were likeable in their own way.I loved the combination of using the real world and the fantasy world here. Emily's temporary journey is going to take much longer in her fantasy world than what will happen on earth and I'm excited to find out!!"}, {"userName": "Benedict Holmes", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/76673906-benedict-holmes", "userReview": "I had a hard time writing a review for this one, mostly because it was such a mixed bag of interesting ideas, but poor execution.On the whole, Bluestone has a lot of potential – but it stops short of achieving it. There are a couple of key features that deep-sixed the entire book for me, but at least one of those is a personal peccadillo, so take it with a grain of salt.As usual, there are spoilers ahead, so stop reading if you’re allergic. The rest of you grab some coffee.Here we go:1. The WritingI’m going to start here, because this has a bearing on everything else I want to say. The writing wasn’t very strong. I could go into individual detail, but the heart of the matter is that I wasn’t engaged with any of the places, the people, or (if I’m honest) what there was of the plot. The word that most comes to mind is shallow – the writing was shallow. Most of the story was told in the ‘and then she, and then she’ format. There was a bit, in the second half of the book, where it really picked up, but that was only temporary, and it went right back downhill after that.2. The CharactersLord, where do I even start? This was by far the worst part of the book. Not only were the characters themselves flat, they were also classic Mary Sues. All of them – every female. Are you a woman in Bluestone? Congratulations! You are the most amazingest, fabulous, prettiest, sexiest, athletic, strongest, agile, powerful, neatiest thing that ever has lived before, ever! Except for that other girl over there – she’s that way too. Oh, and you get a sword! There wasn’t a single real person in the book, at any time, and that really put me off. Plus, I hate Mary Sues – especially when the main Mary Sue spends a good portion of the time whining about how hard she has it. What, did you break a nail while performing the most amazingest flip ever while being the best at everything you do? With a sword? Poor thing. The life of a future elven princess, super-powerful mage, destined for greatness – and to be the most amazingest amazing thing ever in two worlds – is certainly fraught with peril. Honestly, the best character in the book was the bad guy, and he was ridiculous. I never thought I would see the day when I would be rooting for an effeminate skeleton of a history professor to win, but I sure was in this book. I guess you never know, huh?3. The PlotThe plot of Bluestone has serious potential, but it loses it through the bad writing and the poorly executed characters. Especially the characters. It’s pretty clear where things are going, but it would have been nice if the author had given me a better idea of the big picture by the end of the first book – at least then I might have had a reason to pick up the second. As it is, there isn’t one. 4. The MagicBonus section! There is magic in Bluestone – and werewolves, vampires, zombies, other types of undead, spirits of the underworld, and dragons. A very heady mixture that, unfortunately, suffers from the same lack of consistency as the rest of the story does. To put it simply, none of it really makes sense. Why do the people have auras? Is it related to their personalities? Shouldn’t they have personalities, if that were the case? What about the ki? Talk about Deus Ex machina – I want a super power that tells me exactly what to do, all the time, to bring about the best possible outcome. The thing is, mechanics that work in a video game (oooh, I can sense danger!), don’t work well in real life… or the literary world. Maybe some people won’t be as off-put by the whole thing as I was, but that’s their problem. Plus, even the female vampire is the most Mary Sue of all Mary Sues, except for the hero. So there’s that.The Take Away:The type of characters in this book drive me up the wall, and I can’t afford that kind of damage to my house. The story lacks any sort of consistency, in any individual aspect, and even if the writing had been top notch, it still wouldn’t have saved the crummy characters. The plot has some serious potential, but the story would be better served by being aimed at an older audience, as opposed to the drugged out sixteen year old girl market. Personally? Pass."}, {"userName": "Brin Murray", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/8358689-brin-murray", "userReview": "This story starts very well, with the intriguing scene of a mystery man bringing an infant to the doorstep of a Texas couple in a snowstorm, and abandoning the child there. Yes, it’s been done from Tom Jones to Harry Potter – but it always grabs you. Who is the child? Will it be cared for?The answer in this case is: Emily, from another world where she has been torn by some unknown catastrophe from her family and twin brother (another trope that never grows old: twins); and the Whaynes care for her very well indeed, providing her with every conceivable extracurricular activity as she grows older. Although in that they are helped by the paediatrician Andrew Dalton, who saves Emily’s life when she’s still a baby, and who becomes her devoted Godfather and mentor, and who also happens to be a magician from her home planet.So Emily races between fencing, martial arts, swimming and horseriding, and is naturally outstanding at every one. Plus she also has developing magical powers, and her godfather’s role is to train her in magic and lore, preparing her for the future and trials to come.So the story segues between high school type problems with boys and rivals, to times with Yoda-like godfather, to an increasingly engaging federal agency crowd looking out for Emily but maybe governed by sinister presidential motives (the president also has an adopted son with powers, hm), to an evil magician called Samil who is raising a gorgeous female warrior queen from the dead to become his half-dead vampire partner. And of course his henchman are also on earth, after Emily.I suppose the story builds quite slowly, and virtually nothing is resolved, but I was never bored. The author has a fluid, often incredibly vivid writing style that is overwhelmingly a pleasure to read, despite perhaps a little overwriting – saying the same thing twice, in this case, or over-attributing dialogue. I think authors generally should stop themselves using adverbs as qualifiers eg: he yelled angrily. Let the dialogue speak for itself, use stronger verbs, use beats of action. And avoid teased, joked, quipped as a general rule altogether: they stink. If someone tells a joke, it needs to be funny. We don’t need to be told he joked: that implies we wouldn’t know otherwise, ie he’s failed in the attempt. But that’s a personal pet peeve. This is a good link (random) for those interested in decent dialogue:http://www.writersdigest.com/editor-b...Even though it could have done with a tighter edit in that respect, it was still a pleasure to read. I enjoyed Emily’s evolving into a confident young warrior woman. She seems to have jumped from the frying pan into the fire –¬ from earth to her home planet Acacia, full of half-dead enemies, powerful magicians and fierce creatures. I’m rather anxious that she plans to go to Bashan to learn, and Bashan is the home of the evil Samir who uses students he doesn’t like as food for his half-deads. Silly students, that’ll learn you how to behave in class. Xena the bondmate Doberman is a highlight, and the world of Acacia, plus the magical system, is very well realized and beautifully described. If I’m going to pick – it seems a bit strange that Emily trots back to the stables after a running gun battle and multiple deaths on her horse-riding run, between opposing teams set to grab her. And she still goes happily about her extra-curricular activities while ever-increasing teams of agents sit in black vans outside on the street – but she can still stroll out the back door with her dog for a walk and no one notices. Numbers don’t seem to translate to vigilance in this case. So those parts strain credulity a little. But not enough to spoil the read, great fun.If you like fantasy, and not just YA fantasy, this one is a winner.For more of Brin's reviews, go to:http://www.brinmurray.com/"}, {"userName": "Gloria Piper", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/7613560-gloria-piper", "userReview": "Emily, born a magician in an unmagical world, realizes her potential only through the secret teachings of her godfather, pediatrician Dr. Dalton, who is also a magician. Throughout this book he prepares her for reentry into the world of her birth, while dark forces strive to discover who and what she is. Johnson graces us with maps of two worlds, one of Emily's ancestry and one of her residency. He also provides us with glossaries of magic and of characters. What is especially nice is that the author familiarizes us with characters and terms as we read, which prevents confusion. Indeed, the novel is well organized while revealing an impressively complex world of magic. The creation of so detailed a world is too great for a single book, so we know a series is coming. Here is an exciting, imaginative story that nevertheless needs editing to bring it to a masterful level.The writing has a poetic rhythm which is subtle but falls into the trap of wordiness, including redundancy. While main characters retain their strength, others suffer. For example, Emily's father seems fixated on watching hurricanes over TV. He seems to do nothing else. Most of Emily's friends and her foster parents are like a thin film, there only to showcase Emily's personality. It is summer, and Emily is immersed in martial arts and riding. Johnson provides us with authoritative detail of these multiple activities. Pacing poses a problem, however. Emily's rush to attend all these events--swim meet, tai chi tournament, fencing or riding lessons, makes my mind spin. The events appear crammed together, with hardly a breath in between. We get the impression Emily's time is consumed with sports lessons and meets. Description is adequate, often spare, and it keeps the story moving. But sometimes it is too spare and leaves holes. A mere reference to some event needs to be fleshed out because it otherwise is like a blip we can miss or be be left hanging. Other times it's just telling and too abrupt. When most appropriate, a description of the environment is so lush, it cries to my yearning to be there and experience the beauty. Johnson can use the senses, sight, hearing, touch, smell, taste, in full force. Description goes too far in regard to dialogue and accompanying emotions. Over explanation hits us hard when showing is compounded by unnecessary telling. It tends to slow the pace, lessen reader interest, and lessen character depth. As a result they become more like cartoon characters. A lot happens, but resolution is limited. The complexity of the magical environment, the number of characters, and the open ended events are a march in progress toward what may be a long series. Rather than ending the book in a cliff hanger, Johnson takes mercy on us by letting us know when we are approaching the novel's end. We meet with no surprises, no shattering disappointments. Johnson settles us gently on the completion of the first step in this series. This is in some respect a coming of age tale, and Emily's godfather has prepared her for her future role in the magical country of her birth."}, {"userName": "Heather Hayden", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/44764754-heather-hayden", "userReview": "[, because I knew she'd be able to survive and heal any injuries. And the trauma that she went through when things first started to happen faded quickly to barely mentioned nightmares...after a particularly dangerous battle. The shift felt too sudden to me. (hide spoiler)]"}, {"userName": "Alex Avrio", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/32432358-alex-avrio", "userReview": "The first chapter of this book was amazing and promised a great story. A warrior delivering a baby girl through a snow storm to the safe keeping of some earthly foster parents - a touch of the Harry Potters, but beautifully written, and had me hooked. This book contains a magical world, with wondrous creatures, evil villains, and many magic powers. A little frustratingly, though, I felt the following chapters didn’t quite keep up to the level of the first. The author has clearly spent a lot of time conceiving and polishing the rules of magic for this book, but many of the subsequent chapters felt as though I was reading a guidebook on the workings of the magic system, conveyed through the lead character attending lectures and lessons. I felt this slowed the pace of the plot development and I would have preferred the magical system to have become clearer more organically as the plot and the characters developed. I felt characters and came across as a little caricatured, particularly the villain, and I have to admit I struggled to warm to the protagonist. Things picked up once the story moved through the portal to the land of Acacia towards the end of the book, although in the climactic battle I did find myself rooting for the bad guys! The book had very few typos, with a professional polish, and clearly a lot of work has gone into preparing an error free manuscript. Action sequences and descriptions were well written, giving the reader a good feel for the world, and I rate the world-building highly. This book is firmly aimed at a young adult readership, and contains a magical world that the younger reader may love to become immersed in. If you like world of wonder and magic, weird and wonderful creatures, and evil villains, the remainder of this series might be for you."}, {"userName": "Ed Morawski", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/21214612-ed-morawski", "userReview": "This is a pretty entertaining tale of fantasy / magic set in modern day Austin, Texas of all places. I’ll give the author kudos for thinking outside the box in many respects. Like the villain that rides a Dodge Tomahawk motorcycle that most people never heard of (I had to look it up myself). And the angle of Project Stargate and government agents and even the President being involved.A few flaws prevented me from giving it five stars though. There are some odd story choices like Emily’s father has a severe allergy resulting in piles of snot filled tissues—the only problem is that it’s January! Nit picking? Well it took me right out of the story. There are scenes and characters that go nowhere and I’m not sure why they’re there. The most irritating for me as a reader though was the constant repetition of words. Some of that is minor but the word ‘magus’ must be used at least 500 times throughout the book. I was so tired of seeing that word it just drove me to distraction—and that’s not a good thing if you want people to enjoy reading your work.For my taste the book also suffered from too many characters, most of whom added nothing and went nowhere. Like Maaca, a marvelously sexy and evil vampire. I wished she had gone to earth and wrecked havoc there. She could be a book in herself. And finally, the book ended abruptly.All that being said I liked Emily and Dr Dalton and I’m sure fans of magic will love this."}, {"userName": "Mike", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/59073281-mike", "userReview": "2.5. Straight down the middle.This book was frustrating to me because some things were SO good. When C.E Johnson hits that zone, usually with simple heart things, it's always amazing.The dog, man. C.E took so much care in introducing Xana to us that I got emotional when Emily mentally said, \"I'm not leaving this building without you.\" There was so much inside information about dogs and horses, belts and stuff. That kind of trivia is my jam.My problem is that what the book does badly, it does really badly. The dialogue felt wooden, especially that between the parents, our POV keeps hopping all over the place (Emily, Dysis, Haedrian, Samil, Droth, Malach, the president, Maaca) and most of the things I should have gotten excited for fell flat and broke their noses.The fact is, I'm excited to find out if this was early in the author's career. If so, we can look forward to one heck of an evolution."}, {"userName": "Edwina Spencer", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/2596456-edwina-spencer", "userReview": "Good Book.A very good read. Some what similar to the early Green Rider book series. I can't wait to read the next book in this series."}, {"userName": "Tam", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/76515351-tam", "userReview": "Enjoyed it"}, {"userName": "LuCinda", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/52271728-lucinda", "userReview": "Emily is an independent teenager with a lot of determination, curiosity and talent including magical talent which she needs to develop but at the same time keep secret. C.E. Johnson sets the story in beautiful Austin, Texas where he weaves interesting information about all kinds of topics while establishing the details of an intricately developing plot that eventually takes you into a magical place. With the advent of a bondsmate, which is a human connection with an animal, it brings a mutually beneficial view of the world in a refreshing and creative way and helps protect Emily."}], "description": "Bluestone is the first book in The Ammolite Adventures, a series where fantasy and reality blend seamlessly in a rich tapestry woven from the many colors of magic.Although her training regimen was more suited to a warrior, Emily thought she was a normal teenager being raised by a typical family on Earth until one day everything that defined her past came crashing down. Her godfather sent her on a secretive hunt for clues and each discovery unraveled more of the puzzling otherworldly mysteries of her existence. She ultimately uncovers an astounding secret beyond her imagination, she is a blue mage, and her skills will lead her to a formidable ally, an animal bondsmate. However, instead of joy, the revelation of her magical talents has serious repercussions that include bloodshed and dark danger. As she is backed into a corner by vengeful forces intent on her destruction, Emily finds her budding gifts are the only truth that she can rely on. Thirsting for more knowledge and power, she reaches a precipice. She will have to decide whether to remain on Earth or embark on a perilous journey which involves plunging through a portal where travelers must trade in the modern world for swords and spells. This saga chronicles two planets, two times, brought together by pure passion, epic battles, and an ambitious struggle for supremacy filled with sharp steel and wonderful wizardry", "title": "Bluestone\n      \n          (The Ammolite Adventures #1)", "url": "http://www.goodreads.com/book/show/27837381-bluestone", "average": 4.54, "cover": "https://images.gr-assets.com/books/1447636889l/27837381.jpg", "reviews": 31, "authors": [{"url": "https://www.goodreads.com/author/show/13846794.C_E_Johnson", "name": "C.E.  Johnson"}], "type": ["Fantasy", "Young Adult", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/27837381-bluestone", "http://www.goodreads.com/book/show/27865800-bluestone", "http://www.goodreads.com/book/show/30150701-redstone", "http://www.goodreads.com/book/show/35251468-greenstone", "http://www.goodreads.com/book/show/38332472-blackstone", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}