{"ratings": 489, "userreviews": [{"userName": "Julie", "userReviewDate": "Feb 09, 2011", "userURL": "http://www.goodreads.com/user/show/876535-julie", "userReview": "I'm in love with North Muskegon Michigan, and I've never even been there. Reading this book makes the place seem like the coolest little lakeside town ever. The way this author weaves the fabric of life there is masterful. With the touch of a true Michigander, she plants us in the world of the solid midwestern citizen--the kind whose deadpan fortitude provides hilarious contrast to the main character, Jeannie, and her close but craziness-prone family.You can smell the damp, hot summer air and feel worn wood of the dock beneath your feet as you read about Jeannie's summer at the shore back at home with her family, who are both her biggest problem and her greatest asset. The antics that surround them are so appallingly entertaining, they remind us to appreciate family life for all its ridiculous and beautiful imperfections. Worth the read for the Grandma scene alone. I got so attached to my evenings with this book, I really missed them after I finished the read. I hope Dana Precious is planning on writing many more like this!"}, {"userName": "Dani Kollin", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/2214111-dani-kollin", "userReview": "This is the only book, out of the thousands my wife has read, where I can recall her laughing so hard that tears were streaming down her face. There were also numerous \"Awww\" moments as well. Does that make this a chick book? Probably, but I read it too as a favor to the author who happens to be a friend of mine. Now mind you, that's *always* a dicey situation. As a published author I've had friends ask me to read their books and have usually demurred. Problem is, what if it sucks? I've known Dana for over 20 years, \"your books sucks\" would certainly have put a damper on the friendship. Fortunately I was saved by the wise heads at Avon A who snatched it up (soon thereafter it also got optioned for a movie). So I figured, good enough for a Harper/Collins imprint, good enough for me.So the premise: The (mostly) true story of a precocious small town girl (the youngest of five kids) who makes it big as a Hollywood ad exec but can't seem to escape the wondrously destructive vortex that her family keeps dragging her into. The story is told as a series of flashbacks in which she very patiently explains to her would-be fiance why he might want to reconsider his offer. Both the present day scenes in which she deals with over-pampered starlets agents, studio, heads and directors as well as the flashback scenes in which she deals with the decidedly 'by the bootstrap to a fault' family members and townies are wonderfully revealing and expertly told. At first I found myself along for the ride with the first person voice that was disarmingly neutral. However, as the book progressed I found myself falling head over heals for the character and her seemingly impossible situations. In short this was an amazing read (made even more so by the fact that I had no expectations for it). I'm honored to get to be able to write the book's first-ever review and happier still that I get to make it a good one.It releases next in February 2011. Strong recommend to buy (guys, this is the one you get for your girlfriend/wife).DaniMerged review:This is the only book, out of the thousands my wife has read, where I can recall her laughing so hard that tears were streaming down her face. There were also numerous \"Awww\" moments as well. Does that make this a chick book? Probably, but I read it too as a favor to the author who happens to be a friend of mine. Now mind you, that's *always* a dicey situation. As a published author I've had friends ask me to read their books and have usually demurred. Problem is, what if it sucks? I've known Dana for over 20 years, \"your books sucks\" would certainly have put a damper on the friendship. Fortunately I was saved by the wise heads at Avon A who snatched it up (soon thereafter it also got optioned for a movie). So I figured, good enough for a Harper/Collins imprint, good enough for me.So the premise: The (mostly) true story of a precocious small town girl (the youngest of five kids) who makes it big as a Hollywood ad exec but can't seem to escape the wondrously destructive vortex that her family keeps dragging her into. The story is told as a series of flashbacks in which she very patiently explains to her would-be fiance why he might want to reconsider his offer. Both the present day scenes in which she deals with over-pampered starlets agents, studio, heads and directors as well as the flashback scenes in which she deals with the decidedly 'by the bootstrap to a fault' family members and townies are wonderfully revealing and expertly told. At first I found myself along for the ride with the first person voice that was disarmingly neutral. However, as the book progressed I found myself falling head over heals for the character and her seemingly impossible situations. In short this was an amazing read (made even more so by the fact that I had no expectations for it). I'm honored to get to be able to write the book's first-ever review and happier still that I get to make it a good one.It releases next in February 2011. Strong recommend to buy (guys, this is the one you get for your girlfriend/wife).Dani"}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Jul 02, 2011", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "Loved it....If you want to laugh and perhaps compare your family to the Thompson family, I would highly recommend this book. It is a really fun read and also about love.\"My family made him nervous. Being a highly disciplined sort, he did not view my family as a vibrant force but as a disorganized mess that needed cleaning up.\" Page 99 \"The entire town is buzzing about us. If this family ever moves out of town, no one will have anything to talk about.\" Page 148The Thompson family made everyone nervous...they had four daughters, one son, many dramatic events, hilarious things happening to them all the time, and they were the talk of the town.....ALWAYS. One sister was the organizer and one was the never-finish anything you started, but they all had a fun childhood and shared one bathroom and one mirror....this mirror was the scene for much of the fun that went on.The sisters were in predicaments over the years, but their mother and father took everything in stride. The current predicament was that Evan and Anna were getting married on Saturday...it was a planned one...and Lucy and Chuck were getting married on Sunday.....this was a wedding put together in a week. Lucy and Chuck didn't know about the wedding, and you can just imagine how that went. No wedding dress, no veil, no tuxedos, no caterer, and no flowers until the last minute.Last minute organizing seemed to be order of the day for the Thompsons, and most of the situations they got themselves in were funny. Things just seemed to happen to them. I laughed out loud at some parts of the book.The book is a perfect summer read....it gets you thinking about your relationship with your siblings and your entire family. The characters were a very loving, caring, but crazy family. They were always there supporting each other. \"The more love you give, the more you create.\" Page 393Funny things happened most of the time, but as in all families some bad situations occur as well. If this is the author's actual life's story, she is a lucky gal. It is a wonderful, fun read. I truly enjoyed it.You will also find out how to \"shake things out\" when you have a worry. 5/5 ENJOY!!! I hope you love it too."}, {"userName": "Danielle", "userReviewDate": "Feb 19, 2011", "userURL": "http://www.goodreads.com/user/show/2637089-danielle", "userReview": "Family relationships are difficult, sticky and often taken for granted. For Jeannie, her family comes with a few extra quirks that even the most generous person would have a hard time not finding fault with. With an erratic work schedule, demanding family life and an increasingly waning insomnia problem her own romantic life hangs in the balance. Even with her love life hanging by a thread though she's not convinced she can risk making the commitment to make it a permanent relationship. Why? Those she loves most dearly. Her family.Brilliant. I've been noticing a pattern in my reading since the beginning of the year and I'm quite happy with it. Nearly all the books I've been able to get my hands on have been exceedingly well written, have excellent character development and are just plain old enjoyable to read. Born Under A Lucky Moon is no exception. From beginning to end I kept reminding myself that I was reading this with other people around and needed to keep my giggling to a minimum noise level. Honestly, I could not stop laughing. Not only that, but I was instantly hooked.Dana Precious' writing had an almost Southern feel to it and within pages I couldn't help but feel absolutely at home in Jeannie's two worlds. The story alternated between the present time where Jeannie worked as a movie production executive and her life in 1986 back in her home town of Muskegon Michigan. Entirely different worlds in every way imaginable, one high-paced with action happening every minute of every day and the other just happy to watch the second hand click slowly and gently by. It creates an incredible shift as you rock between stories, but it's written just appropriately so that the pace of the story chucks along nicely.My absolute favorite part about this story was without a doubt, Jeannie's family. I couldn't help but be reminded of my own while reading the stories of Jeannie, her three sisters and one brother. Though I only have two younger sisters it was easy to relate to the kind of drama that can happen in a house filled with women. Not only drama, but something I've long known is that what one sister knows everyone knows. It's something my own father has long warned sons-in-laws about prior to joining the family; of course jokingly, but with a lingering truth. It was fun to see this dynamic played out through these incredible sisters and one lucky brother. The most enjoyable part about their relationship to one another though was their love for each other. With all of their family's quirky behavior and sometimes hurt feelings they still loved each other tremendously. Which is what family is all about.Born Under A Lucky Moon was an extremely delightful read. On almost every page I found something I could relate to and more often than not, giggle about. With the occasional grandmother streaking down main street and double wedding to add to the overall character of the family on a whole. Jeannie's life wasn't unlike many at some point or another; no, not all of us will be successful movie executives, but the vast majority of us have a family. In our own ways each family is different, quirky and exactly what we each need at the end of the day. And as Jeannie's mom would say, \"People need loving the most when they deserve it the least\" (p.211). We all have our faults, but it's those who can see past those faults and love us despite them that matter the most. An incredible book that I have no doubt you'll absolutely love!"}, {"userName": "Cheryl Malandrinos", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/1878810-cheryl-malandrinos", "userReview": "Jeannie Thompson's life has never been boring. Her family is filled with colorful, and often embarrassing, relatives who seem to be the victims of some of the oddest things; making them the talk of the little Michigan town where they live.It is 2006, and Jeannie's longtime boyfriend is thinking of taking their relationship to the next level. She's not sure they should rock the boat. Not only are they both busy in the entertainment industry, she knows how other boyfriends have felt about her less than normal family, and she's not sure Aidan will be any better.As Jeannie's past and present collide, she must reconsider her life growing up near the Great Lakes of Michigan, and the career she carved out that has alienated her from her family. Debut author Dana Precious pulls together a stellar plot, quirky characters, the love/hate relationship we can have with our family/stomping grounds, and a romance to come up with a major winner. I loved everything about this book. Once I started it, I couldn't put it down. I read it in one day. Born Under A Lucky Moon is filled with laughs and tears, unexpected twists, family, and down home charm. It's about the Thompson family, but it could be about any family.Born Under A Lucky Moon is the perfect book to choose if you want a great read that is funny, yet moving."}, {"userName": "Rebecca", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/1206117-rebecca", "userReview": "I was a goodreads winner for this book and I was very excited to read it. There were some moments in the book - particularly about the town she grew up in and the characters in it - that seemed very authentic and charming. They almost tricked me into thinking I liked the book. The problem is that the premise of the book made no sense to me - a girl who has a very loving, affectionate (if a bit crazy) family AND a man who she loves and who wants to marry her - just can't seem to get it together for reasons that are never really clear. She won't introduce him to her family, she won't give him an answer on his proposal, she won't prioritize anyone over work, and she never seems to have any sense of humor about the family stories that should be - at least in retrospect - pretty funny... It felt contrived and in the end I didn't like the main character enough. Although I did like all the characters she wouldn't prioritize."}, {"userName": "Karen", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/28053707-karen", "userReview": "I would give this book 10 stars if I could, and not just because it's set in my home State of Michigan! I loved this family, it reminds me so much of mine. Take the time to enjoy every minute of this book!"}, {"userName": "Anna", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/2834014-anna", "userReview": "I'd rate this more at a 3.5 if I could. I loved the ending. I appreciated the bonds of the family members. I laughed pretty often but also got frustrated with the main character at times for being such a stubborn and dramatic character. Overall, it was a pretty good read."}, {"userName": "Mindy Tysinger", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/31582860-mindy-tysinger", "userReview": "Light-hearted book about a bunch of weddings and a crazy family. Jeannie's boyfriend has asked her to marry her but she is sure her family will drive him away. What follows is the crazy stories of why. Laugh out loud funny! Great read."}, {"userName": "Marcia", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/4385058-marcia", "userReview": "Fun reading about familiar settings. A portion of this book takes place about ten years after my time, not much had changed in those ten years. I did not know the \"Thompson\" family but I sure wish I had."}, {"userName": "Luanne Stevenson", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/3211299-luanne-stevenson", "userReview": "Article first published as Book Review: Born Under A Lucky Moon by Dana Precious on Blogcritics.Susan Elizabeth Phillips, the respected New York Times bestselling author, was recently quoted; “Lucky the reader who picks up this funny, charming, and touching debut novel. I loved it.”I couldn't agree more. In fact, I didn't just love it, I bonded with it! I fell in love with its colorful characters and wacky to wonderful plot. The novel became a funny and fabulous friend, one I looked forward to spending my down-time with. Nestled on the couch with a comfy blanket and a small glass of my favorite French wine, I turned the pages quickly, anticipating great story.Once the final line was read, I closed the cover on its four- hundred- and nineteen –fast moving pages, smiled to myself, and whispered one word; “Wow…”Like a good friend, unforgettable and utterly endearing, our nightly conversations ( where I’d always play the intent listener) would be missed, but I predicted that somewhere, in the not- too- far- away- future, I'd rekindle the old friendship. Years from now, I pictured myself pulling it off an overcrowded, dusty library shelf, and reading it once again; Yes! It’s that good!It’s not just a chick- lit- novel either. Sure, the female reader will absolutely fall in love with the story and the main character but I’m betting it will leave its magical mark on the male population too.Why? (I can hear you asking.)Because how many novels have the power to move you or make you belly-laugh in public? (-It’s embarrassing but true!) Dana Precious’ new book, Born Under A Lucky Moon, to be released on February 8, 2011, isn’t just another smart story written by another witty writer - it’s an event!It’s a fast moving train ride, sweeping the reader into a world that’s richly entertaining and unpredictable. The pages have weight and contain interesting plot, filled with humor, twists and some surprises. Its original flavor is hard to describe but it's delicious from beginning to end; a cream de la cream that not only rises to the top, but leaves the reader wanting more from Dana Precious, one talented- tale- spinner.Born Under A Lucky Moon is fictional, but it’s also based on the author’s real life events. Told in first person narrative, we meet Jeannie, the lovable main character. In chapter one, she tries to explain to Aidan, her would –be-fiance, why he should reconsider his proposal.Quickly, the reader understands why Jeannie is hesitant to accept. Her past is layered with family drama and the icing is complicated, sprinkled with some sticky situations that mold the final masterpiece; a one of a kind love story- a family love story, that is.In a series of flashbacks, the reader travels to mid-west Americana. It's in the mid-eighties, where we meet the young, precocious Jeannie and her four older siblings who add the fun to family dysfunction and dynamics.In the present, Jeannie is a Hollywood ad exec, dealing with spoiled actors, Hollywood agents and executives; a sharp contrast to yesterday’s little Jeannie.If you visit Dana Precious’ website, Born Under A Lucky Moon, you’ll find a marvelous quote taken from Life Lessons from Lemony Snicket (via tobeshelved-one great blog about books and their covers): It reads: “Deciding whether or not to trust a person is like deciding whether or not to climb a tree, because you might get a wonderful view from the highest branch, or you might simply get covered in sap. For this reason, many people choose to spend their time alone and indoors, where it’s harder to get a splinter.”I’m so glad Dana Precious isn’t the kind of gal to run away from sticky sap or fear the sharp prick from one of life's unpredictable splinters. Like a master artist, using spectacular, bold color, she has successfully painted with words a unique impression or portrait of one family. It's a genuine article that might have been envied by the likes of Norman Rockwell; for Dana Precious has brilliantly captured and skillfully redefined his famous impression, \"Freedom From Want\".This is a feel-good, amazing read and ( just in case you haven't guessed it yet), I\"m highly recommending it.To learn more about Dana Precious, visit her website at http://bornunderaluckymoon.com/"}, {"userName": "April", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/1329728-april", "userReview": "Born Under a Lucky Moon is a book that pretty much covers all that can be covered within life: love, marriage, careers, humor, crazy family life, insecurities and, oh yeah - murder. I have to first off say that this author truly amazes me. Her writing voice and technique are insanely engaging and \"real\". Ms. Precious brings to life the story of one woman who has had an anything but normal life, since the day she was conceived. I was very quickly and easily absorbed within the story of Jeannie Thompson and her many trials and tribulations from youth through adulthood.Born Under a Lucky Moon is told in an alternating time frame between Jeannie's youth and her present-time adulthood. These transitions are smooth and incredible. The way in which Ms. Precious leaves the reader hanging right before making the transitions are painful - but in a way that left me not wanting to stop reading to see what the next thing that was going to happen was. The author's witty dialog is ingenious and left me laughing out loud several times. Just to give you a taste, here is a small piece from page 198: Grandma tipped her head down and looked at me over her bifocals. \"Oh, yes,\" she said, \"the fifth one. What in the world were your parents thinking?\" They probably weren't thinking, I thought. I was conceived a few years after the Pill hit the market. Mom had said she was too busy with the three little kids to get to the doctor for the prescription. That's when Lucy was born. Then Mom said that she got the birth control prescription but couldn't find the time to get to the pharmacy. That's when I was born. Dad got a vasectomy after that.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Yes, Jeannie has a crazy family, but don't we all? I found each and every family member to be lovable and wonderful. I just wanted to wrap them each up in a giant hug - well, except for the grandmother. Not so much feeling the love there.This is a story that delves into a family who is loving, caring and always there for one another. Things don't always go smoothly - okay, hardly ever go smoothly - but they are such an amazingly close family. Jeannie is scared to introduce her long-time boyfriend (who just recently popped the question to her) to her family, however, for fear that their zest for life will scare him off. This presents some major conflict and when her job begins to spiral out of control, Jeannie feels herself unraveling.Though I liked the character of Jeannie, there were times that I wanted to grab a hold of her and give her a good shake. She does everything imaginable to keep her boyfriend, Aidan, from any and all contact with any of her family members. Jeannie comes across as very ashamed of her family - though I don't think this is truly the case, she just harbors a ton of fear and is unable to trust in love completely. It probably doesn't help that she spent her entire life with people constantly commenting on her and her family's goings on. Family dynamics galore and a nosy town - complete with a very \"interesting\" minister, amazing love and support and true laugh-out-loud hilarity as well as touching moments that will warm the heart. Born Under a Lucky Moon is, simply put, an amazing and not-to-be-missed novel. Other than my irksomeness of Jeannie at times, there truly is nothing that I can say against this book. Even that has an important role within the story, so I can't complain about her, if she was all cheery, this would definitely be a different story.Do I recommend Born Under a Lucky Moon?! You are darned right I do!! This is the perfect story to lighten one's day and engage the reader from beginning to end. My personal experience with the ending of the story? A huge smile, as I closed the book after reading the final words."}, {"userName": "Margaret", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/10549695-margaret", "userReview": "Whenever I read a Jodi Picoult novel, I make sure I have a fun, light read to read when the tension of the Picoult book becomes too much. I chose this one as a relief between the pages of Picoult's The Storyteller and it was perfect! This book was laugh out loud, tears rolling down my cheeks funny. I don't know what was worse....reading it and laughing when people were around me who began to stare and then avert their eyes when I would look up or reading it when I was alone and having no one to share the laughter with.Born Under a Lucky Moon is a story about family and love and loyalty through the good times, bad times and the ugly times. At times the antics of this family were ridiculous. I would think: no way would that ever happen. It didn't matter. The message came through. Families stick together and accept each other even when they don't accept their decisions or behaviors. Jeannie Thompson is the youngest of 5 children. Her brother who is the oldest seems to be the only \"stable\" one, but he has his moments. The 4 girls are at times antagonists and at times staunch supporters of each other's behavior but the entire family closes around any one of them who needs unconditional love at the time. And that is often. If you enjoy laughing over \"surprise\" weddings, fireworks that go slightly (ok, greatly) awry, dogs that get arrested, grandmothers who take off down the street with no clothes on, sleeping accomodations that include sleeping under the ironing board when the entire family gets together, then you will love this book.Of course, the main plot is that Jeannie, once married to a man who couldn't take her family any longer; and the sad thing is, he grew up with Jeannie and knew what he would be getting into. So when Jeannie is proposed to by her long time boyfriend whom she adores, she can't take that leap. After nearly 8 years of dating, she has managed to keep him away from her family. She hasn't even told him about their escapades. Why rock the boat by introducing the family? He'll just run. Jeannie's best plan is to just keep things the way they are. But her guy ends up running anyway. Not because of her family, but because of her lack of trust that he can love her family as much as she does. Hmmmm. It's time for the family to take Jeannie's future into their own hands and they do it in the style they are best known for: outrageous.Being an only child myself, I live vicariously through books like this one, imagining what it could have been like if I had had siblings. Is it too late to be adopted by the Thompson family?"}, {"userName": "Alice Bola", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/5476774-alice-bola", "userReview": "Right off the bat, I want you all to know I loved this book. I loved the setting, the characters, the story. I love that Ms. Precious kicked it old school and set half the story in 1986. I love that it centered around a family, specifically sisters. I loved that I laughed out loud so many times, in public, on the train crowded with people giving me odd looks. I loved the title of the novel. I loved that it was about love. From the beginning, Ms. Precious lets us know where we’re going. I have to admit she had me at this: Like every relationship in every family, this story doesn’t reside in the black and white of right and wrong. It resides in the gray area called love. Yeah, I was hooked. I dived into the story of Jeannie and her sisters head first. I loved the wacky Thompson family adventures. From unintentional fires to a grandmother with devious intentions to the exasperated police officer, Marv who puts up with them, this story had everything.It bounces seamlessly from 2006 to 1986 without missing a step. I enjoyed how Ms. Precious revealed the past to explain the future. Truth be told, it was done so well the stories could have been told separately, one without the other would have made a great novel. There was so many nuggets of goodness in this novel. I loved Evan’s Milwaukee metaphor. You'll have to read that one for yourself. However I will leave you this from Rose Thompson, Jeannie's mom, about family and love...One thing I do know for certain is that no matter how much you kids complain about each other, you all drop everything to be there when someone in the family is in trouble. I think a family is measured by how it shows its love. Some people think that love is like a pie, that the more people you have to serve, the smaller everyone’s piece is. But that’s not the way it is. The more love you give, the more you create. My parents and your father’s parents poured their love into us. We poured that love into you. Elizabeth will pour that love into her baby and so on. Everyone has human weaknesses, and problems, but those will come and go during life. Love goes on nonstop forever.Born Under a Lucky Moon is the kind of novel I will go back to: to read again, to laugh with the Thomspons, to fall in love, to appreciate family in all their crazy looniness, even mine."}, {"userName": "Luanne Ollivier", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/1621569-luanne-ollivier", "userReview": "Born Under a Lucky Moon marks the debut novel of author Dana Precious. And I really hope she's at work on her second, because I loved this book! Jeannie Thompson and her four siblings grew up in the town of North Muskegon, Michigan. Jeannie is in her late thirties, very successful in the film industry and has a boyfriend, Aidan, that she loves very much. It is when Aidan asks her marry him, that Jeannie's tightly held life begins to unravel. How can she explain to Aidan that...\"My family isn't like your family. our family seems to have everything under control at all times. But stuff just happens to my family. I think of it as really funny, but apparently other people don't. Like Walker (Jeannie's ex-husband), or most of the other spouses in my family. A lot of them are ex-spouses now. My family seems to be very trying on the people we love.\"When Aidan asks for an example, she begins...\"This is just one story of my family. It starts with a long-planned wedding on a Saturday, followed by a surprise wedding on Sunday. It ends with a murder and a sex scandal. Like every relationship in every family, this story doesn't reside in the black and white of right and wrong, it resides in the gray area called love.\"Now really - how could you not want to delve into the pages of a book with an opening like that?Born Under a Lucky Moon alternates between 1986 and the present 2006. Each story is equally addicting, but the story of the 1986 weddings had me actually laughing out loud. Precious has created wonderfully warm, funny, loving, quirky characters that you can't help but love. As Tom the handyman says...\"I didn't say you weren't all crazy. But I've never seen a family pull for each other so much.\" And this is the part of the story that really shines. The love between the family members is tangible and incredibly heartwarming. Through thick and thin, crises and joys, each of them is there for the others. The present day tale in 1986 is just as charming. I found myself reading 'just one more chapter' late at night in order to get back to 'the other story'.A really strong debut novel, one I absolutely recommend! It's the perfect summer beach read."}, {"userName": "Kristine", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/4900654-kristine", "userReview": "Born Under a Lucky Moon by Dana Precious - a Goodreads First Read free giveaway book won on February 2nd, received on February 15th and previously made-aware-of through promotions on sheknows.com and womansday.comBorn Under a Lucky Moon is a novel told in the first-person in a back and forth, then-and-now prose of the teenage and middle-age life of Jeannie Thompson. The main theme of the book is her boyfriend, Aidan's, attempt to marry Jeannie and be introduced to her Midwestern, dysfunctional but very loving family (a bit like the Hepburns or the March's from Little Women, but somewhat more off-kilter) and is told in the style of Jeannie telling Aidan stories of her family to keep him at bay from the onslaught that is Them. The action and plot moves much in the style of the Thompson family - quickly and crisply. It had ended a little over the top, but given the context, it was to be expected and fairly apt.What I loved best were the aside/long-story-short stories about a family incident or a person's background, such as Jeannie's great-grandparents. I also really connected with the familiar quips about Midwest life: regional product brands, the Michigan map as being the palm of your hand, radio stations, squirrels, wedding traditions, and outdoor recreation.As Tom, a Thompson family friend, quips, family is like a \"warm and comforting curse.\" And, in looking at this book, it's a real and unabashed account of how careerwomen regard their families through memories both bitter and dear - no matter how you excuse or cope it away, your family is both the maker and cruelest judge of character."}, {"userName": "Melissa", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/1922992-melissa", "userReview": "The story is about a woman who believes she has an unusual family, so much so that no one will be able to accept it. She is proposed by her boyfriend whom she loves but is scared. She hasn't had the best luck with others accepting her family and so uses it as an excuse to put him off. She begins to tell him the tale of her crazy family to show him why she had good reason to say \"maybe\".As the story unfolds you find out how eccentric her family is within the small community in which she grew up. However, I didn't see what was so awful about the family and agreed with Aidan, her intended, that they were more entertaining than horrible. I kept thinking that this girl needed to get out of her own head and really look around at what a horrid family could entail. Might put some perspective on the situation. She also needed to trust Aidan to handle her family. Things she never thought could be possible in life. She still wore her small town blinders and her work which perpetuated blinders didn't help much either. I won't tell you how things worked or didn't work out, so you will have to read the book to find out for yourself. *evil laugh*I give this book 3 1/2 stars. If you are looking for a cute, funny book for the summer you will enjoy this book. Even though there were times I wanted to shake sense into Jeannie, you laugh and root for her and really hope for her HEA in the end."}, {"userName": "Teresa", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/3180-teresa", "userReview": "This one might look a bit familiar to you as I introduced it to you earlier this year with an Author Spotlight. Raise your hand if you think your family is nuts. Keep it raised if you love them anyway. Okay, now that we know who we are, you can put your hands down. Basically all of us think our families are completely crazy yet we wouldn’t want it any other way.This is Jeannie Thompson’s family. They are eccentric, nosy and bossy. They also are incredibly supportive, loving and always there for one another day or night. Like many families, they are terrible at communicating. So many of their follies (there are a lot of them) are a direct result of not talking to one another. I know that this is something that many of us can relate to (I certainly can.)The book alternates between two periods of time about 20 years apart to tell the story of Jeannie Thompson. The big thing about Jeannie is that she thinks that she is the only one with a family like this, so she hides them. There are things going on in her life that she is trying to explain through the recollection. There were several times that the story made me smile and appreciate my own crazy family. I thoroughly enjoyed Born Under A Lucky Moon, and I think you will too. Sense of humor and the ability to laugh at mistakes you might have made is a must with this one."}, {"userName": "Katherine", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/548241-katherine", "userReview": "I won this on a book blog. I loved the blurb and the idea of the story. But the way it was written was certainly not my cup of tea. I hated it, and after complaining about it to my friend, she convinced me I didn't need to finish it. On the surface, it is a clean book. As another reviewer stated, there is very little language and no bedroom scenes as far as I got. However, there is enough referring to body parts or body functions of both people and animals, unmarried couples doing things that should only be done after marriage, and general disrespect for religion and family to completely disgust me.Some of this I may have been able to overlook, had I loved the characters and the story. Sadly, there was very little there to hold my interest. I could not identify with the main character at all and thought that most of the events depicted were ludicrous, crazy, or stupid. I cannot recommend this book to anyone."}, {"userName": "Holly", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/1994638-holly", "userReview": "I do agree with this-\"Not unlike Divine Secrets of the Ya Ya Sisterhood and other beloved works of southern women’s fiction—except set in the American Midwest—Born Under a Lucky Moon is a story of family, love, murder, sex scandals, and new beginnings that is, at once, intelligent, endearing, and delightfully quirky.\" I loved the setting, the story, the characters! It goes back and forth between 2006 and 1986 blending past and present to tell the tale of the wonderfully wacky Thompson family from Michigan. Lots of laugh out loud moments. Jeannie is now living in LA and working in the movie business. Her boyfriend Aidan is a successful producer and he wants to get married but she won't marry him because her family is too crazy and she is convinced that would drive him away. She just knows that is what ended her first marriage. Jeannie won't even introduce him to her sisters who also live in the LA area!"}, {"userName": "Crystal Wachoski", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/4901068-crystal-wachoski", "userReview": "I loved this book. Not many things make me proud to be from Michigan, but this book sure does. It made me see that yes, there are other people out there that understand Michigan and see the beauty that I see. I loved reading about the many cities she talks about. She did a wonderful job describing my home state. The book was very well written, for her first book. It was funny, witty, and familiar. It described the typical American family with such charm. I had a feeling that she was describing her own life. So, Dana if you read this review, your family is normal. Ok, maybe we both have slightly abnormal familes, but that's what makes life so fun and interesting.I love to read, and lately nothing has caught my interest like this book. Thank you, for letting me escape into someone else's life for a little bit. I'm a honored to have read your first book."}, {"userName": "Kaijsa", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/139301-kaijsa", "userReview": "I really liked this book. It's been hanging around in my unread pile for a long time, and I'm kind of kicking myself for not getting to it sooner. The story is interesting from a few different angles. The protagonist, Jeanne, is the youngest of five children (four of which are daughters) and a film executive. Her family is close and complicated and she is a bundle of neuroses. At first, it seems like the story will be typical chick lit in which a couple (Jeanne has a serious boyfriend called Aiden) has problems and the action centers on their romantic drama. While that happens in this book, the real story is about family and work and relationships, and how hard it is to make all of them work together without pulling you apart. Everything worked for me in this book, from the story to the characters to the settings."}, {"userName": "Jeannie", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/24691-jeannie", "userReview": "I really liked this book a lot. It was a cute story about a loving, but dysfunctional family, from Michigan, some behind the scenes Hollywood drama and some romance. It is really sweet and fun. The protagonist is Jeannie Thompson, who is a high-powered marketing executive in the movie business. I fell in love with her family and all of their zaniness, as well as North Muskegon, MI (which is the setting for most of the book). It’s a touching story and is based on some real life events of the author that include a surprise wedding and, sadly (yet sort of fittingly...you'll have to read it!), a murder. It makes for a great beach read (available on e-book) and is perfect for a summer book club selection."}, {"userName": "Andrea", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/4234901-andrea", "userReview": "The story line was okay. I mainly bought it because much of it is set in Muskegon (well, North Muskegon)so the local flair intrigued me. A story line surrounding a big/dysfunctional family is one that should appeal to most readers but it was a struggle for me to find any redeeming or endearing qualities in some of the family members. But maybe that was the point the author was trying to make about large families...? I will freely admit that I am a character driven reader so this review might not be that helpful to other readers. However, if you are from West Michigan, this one is worth reading!"}, {"userName": "McGuffy Morris", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/2367393-mcguffy-morris", "userReview": "Written in chapters from past to present, back and forth, Jeannie Thompson tells her story…and quite a story it is. Her large family in Michigan is a close, albeit wild, bunch of characters. However, they always pull together for Jeannie and each other in all of life’s craziness.With a good career, Jeannie also finds a good man. Afraid to introduce him to her quirky family, out of fear they may overwhelm him, she tries to avoid it. She really need not worry, though. Their zest for life, easy way of dealing with things, and their ability to be true to themselves make them, and Jeannie, what and who a family should be. And that is what matters."}, {"userName": "Barbara Maguire", "userReviewDate": "Feb 16, 2011", "userURL": "http://www.goodreads.com/user/show/4285535-barbara-maguire", "userReview": "Every now and then while I was reading Born Under a Lucky Moon, it seemed I might be reading about my own family. As one of five somewhat crazy children, there have certainly been moments when I wondered if my friends would be able to handle the chaos that is my family--even now that we're all in our 40s and 50s. I loved the snapshots of my native Northern Michigan and the references to Michigan State and even Dooley's, a regular hang out when I was there. The book kept me thinking about the relationships in my family and how we all fall back into those childhood roles the minute we're together. I loved the trip down memory lane!"}, {"userName": "Becki Couch tompkins", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/14027814-becki-couch-tompkins", "userReview": "Born and raised in No. Muskegon, now a transplant of upstate NY. This novel was a breath of fresh air. I laughed at all my childhood memories being brought back to life. I was raised at the BLT where my mom worked and my dad's pictures on the walls. Swimming and fishing in all three lakes, picking blueberries and riding my Swing all over the four corners, sunsets and sunburns at the BIG lake.I felt like this loving family was my own crazy mess of three sisters. The antics with my cousins and trouble with my friends... Love and craziness........"}, {"userName": "Cindy", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/1280864-cindy", "userReview": "A delightful read that follows the life of lower Michigan native, Jeannie Thompson and her larger than life family. As an adult, Jeannie lives and works in LA. Her early life in Michigan and the family capers and chaos are woven into the current story of her (not so) glamorous film life as she regales her fiancée with the historical personal details. Jeannie tries frantically to keep her family separate from her love for Aidan because she worries he can't possibly accept what she considers their craziness. A well written, engaging novel that reminds us that in the end, family is everything."}, {"userName": "Lauren", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/9230914-lauren", "userReview": "Eh... I was not impressed by this novel. It vaguely reminded me of Divine Secrets of the Ya Ya Sisterhood, only not nearly as good. I had to laugh at the crazy grandmother a few times but then the last stunt she pulled was just very unrealistic. I was also disappointed with the way the author wrapped up the ending. She dragged out the story for 410 pages, then in the last 9 everything falls into place and everyone lives happily ever after? I hate that."}, {"userName": "Jennifer", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/988703-jennifer", "userReview": "I won this book on Goodreads and just got it the other day. Now I just need some quiet time to sit down and read.**********************I put everyone to bed quickly last night so I could finish this book. At times I was bursting out in laughter at the things that happened to this family. So crazy, but not that far fetched in my opinion. The craziness could actually happen. that's what I liked about it. And I loved the ending. It fit perfectly with Jeannie's life."}], "description": "Smart, touching, and utterly engaging, Born Under a Lucky Moon is a polished gem of contemporary women’s fiction—and it boldly announces the arrival of author Dana Precious, who immediately takes her place at the winner’s table beside Rebecca York, Jennifer Weiner, and Rebecca Wells. Not unlike Divine Secrets of the Ya Ya Sisterhood and other beloved works of southern women’s fiction—except set in the American Midwest—Born Under a Lucky Moon is a story of family, love, murder, sex scandals, and new beginnings that is, at once, intelligent, endearing, and delightfully quirky.", "title": "Born Under a Lucky Moon", "url": "https://www.goodreads.com/book/show/9816431-born-under-a-lucky-moon", "average": 3.55, "cover": "https://images.gr-assets.com/books/1348599355l/9816431.jpg", "reviews": 111, "authors": [{"url": "https://www.goodreads.com/author/show/2960066.Dana_Precious", "name": "Dana Precious"}], "type": ["Fiction", "Womens Fiction", "Adult Fiction", "Humor", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/9816431-born-under-a-lucky-moon", "http://www.goodreads.com/book/show/23497791-murder-in-malibu"]}