{"ratings": 6, "userreviews": [{"userName": "Kelly (and the Book Boar)", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/When I got a bad case of the giggles while picking this up I thought I was just being a dirty old lady with the mentality of a 12-year old. However, it turns out this book is about exactly what I thought it was going to be about. Bottoms is an art book that cuts out the middle man and focuses on the TRUE subject matter that is worthy of appreciation in pieces of art . . . \nObviously I had to buy it . . . \nNO! For science. Duh.Anywho, when I got home my husband was all like: \"nice - glad you took the kids with you to buy your pornography.\" And I was like . . . \n\"IT WAS FOR CHARITY!\" Because you can totally say that when you purchase your porn art at a thrift store who donates all of their money to children in need."}, {"userName": "Sarai Lillie", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/6144291-sarai-lillie", "userReview": "The subject matter was interesting, however, some of the terminology used by the author left much to be desired in terms of, not only aesthetic appeal, but in appropriate usage. Comments such as \"has spent too much time at the gym\" and \"in dire need of exercise\" were not only inappropriate for the subject at hand, but were completely useless in describing or appreciating the art.I was disappointed that the subjects of sexuality and the nude in art were turned into somewhat of a cheap joke... A \"thrill\" instead of what was hinted at in the introduction of a study of sexuality as it was meant by the original artists."}], "description": "Bottoms gives you a perspective on art that you may never have appreciated. Showing the fundamental aspects of well-known images, this cheeky book challenges you to identify the full picture behind the detail. Beautiful bottoms from the full spectrum of world art are shown in luscious close-up, uncluttered by text.", "title": "Bottoms", "url": "http://www.goodreads.com/book/show/13286419-bottoms", "average": 3.17, "cover": "https://images.gr-assets.com/books/1442204948l/13286419.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/28536.Edward_Lucie_Smith", "name": "Edward Lucie-Smith"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/13286419-bottoms", "http://www.goodreads.com/book/show/52657.Movements_in_Art_since_1945", "http://www.goodreads.com/book/show/94706.Symbolist_Art", "http://www.goodreads.com/book/show/361346.Art_Today", "http://www.goodreads.com/book/show/1232413.Sexuality_in_Western_Art", "http://www.goodreads.com/book/show/365211.Latin_American_Art_of_the_20th_Century"]}