{"ratings": 4474, "userreviews": [{"userName": "Noura W. Abou-Fadel", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/9866341-noura-w-abou-fadel", "userReview": "I just found out about this new e-novella!!! *runs around the house squealing*Okay. So, now we have to wait. Again. *sighs*I'm so excited! And it's 2a.m . Looks like I won't get any sleep tonight.. ~UPDATE~And the lucky character is..... Brooke. I mean, it's still going to be super-awesome, right? ...right? Oh who am I kidding!! WHY HER, WHY?!!!! I know I'll read it anyway, though that does not make me any less unhappy because it's not about Liv or Cinder or another character whom we don't know much about. A character we love, that is. But think about this! If it's not about Liv, then it's probably because the author wants to make her come-back more exciting in the final book! .... I hope. ~Update~AFTER READING  Welll... I have to admit, this was certainly refreshing. It's actually nice to read about secondary characters. You know, to be reminded that the story doesn't revolve around just 5 or 6 people. And it feels as though Veronica has expanded that fascinating world, and gave our imagination a larger place to wander through. At first, I wasn't really sure what to expect, I was also worried that I'd hate it. And I did hate it sometimes: when Brooke just couldn't get over Perry and felt lonely and all that nonesense we -humans- tend to put ourselves through when we're rejected or feeling discarded by the ones we love. Though, I'm so grateful that we got to know the other sides of her, that she's more than just the super-jealous ex. The parts I liked best were when her admirable sense of responsibility gave her the courage to do her duty towards her family and tribe, for she can be such a brave warrior when she puts her mind to it. But I really didn't like her new beginnings. When someone wants to heal a wound like hers, they should know that the less new beginnings they have, the less endings they have to deal with. Nonetheless, by the end of this novella.. I thought, hmmm.. not badMaybe I was wrong about her. Maybe there's still a chance for her to be loved by us fans, if she just let Aria and Perry in peace and become a kickass fighter. In short, I honestly enjoyed this novella, but reading it was like pouring oil on the blazing fire of anticipation, and now I'm left wanting more. I'm so excited about the final book, aaannd I'm going to fail my exam tomorrow because there'll be nothing on my mind other than this great series."}, {"userName": "Emer ", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/4629647-emer", "userReview": "Brooke is a very short and sweet novella in the Under The Never Sky series. It is designed to be read between books 2 and 3.\nPlease be advised that this review assumes that you have read books 1 and 2 and the short story 0.5 in this series and therefore contains spoilers for these. \n\n“We are all hurting and missing people. Everyone is scared, so you can’t talk about your worries because worries are everywhere. When everyone you know is on the verge of drowning, you don’t stop to tell the person next to you that you don’t like swimming.”\nBrooke is a member of The Tides and a Seer. She is Perry's former girlfriend and since their breakup and his new relationship with Aria she has been filled with a lot of hate and bitterness. She is not a character I have ever rooted for...I am all about Team Perry and Aria...Team Peria shall we say?!?!?!? I felt in the second novel, Through The Ever Night, that her character was grievously overlooked and therefore her storyline was underdeveloped. So it was nice to read all about her for a change. The novella explores Brooke's prejudices against the dwellers, her heartache over losing Perry and her sense of belonging to her tribe. \n“There are no words to describe the emotions colliding inside me. My friend is gone; my sister is back. I am scalding and yet I’m chilled to the bone. I am angry. I am sadder than I’ve ever been in my life. My emotions rise and fall like the stoop and soar of a hawk.I am scared. I am alone. I don’t know what I am, and I miss him, and he shouldn’t ask me that question, because he knows. He can scent it. He is living it. He is breathing my pain.”\nBrooke is utterly heartbroken. I don't think we ever saw that clearly enough in the first two books. She was portrayed almost as someone who manipulated her way into Perry's life and heart but it was more complicated than that. She loved Liv, Perry's sister. And when Liv and Roar became 'Liv and Roar' then to the young Brooke it made sense that she should love Perry. She wanted them to be friends forever, to be this unstoppable, unbreakable group, four best friends, two sets of soulmates...she didn't trick Perry into loving her, she just wanted to belong so badly that she almost willed their relationship into being. From this novella I felt angrier at Perry...if he never had the right sort of romantic feelings towards Brooke then what the heck was he doing with her???? He is not as blameless in their messy relationship as I originally thought. The novella shows Brooke attempting to understand her own heart better, get over Perry and move on and find new love. Brooke is fiercely loyal; she has a great love for her family even to her own detriment as she often does not share how she is truly feeling for fear of worrying them. She has a strong distrust of The Dwellers but this is understandable considering that her sister was sold to them for experiments. However now that her sister has returned to The Tides along with many Dwellers Brooke is forced to face these prejudices. This novella gives us a taster of what I hope will be a better developed relationship with a particular dweller, Soren; (yup *that* Soren!!! I know, I know...he's been ever so sneaky and was terrible in the first book....but I'm ALL about redemption!!) Anyway Brooke and Soren have a lovely playful banter and clearly some chemistry so I look forward to seeing what happens with them in book 3. All in all I enjoyed this little dip back into the world of the never sky. I liked learning more about Brooke and it has gotten me even more excited about reading the third and final book. Three stars."}, {"userName": "Jasmine", "userReviewDate": "Jul 04, 2015", "userURL": "http://www.goodreads.com/user/show/21803154-jasmine", "userReview": "I want to feel wanted and cherished and safe. I want to find someone who won't trade me for another. I want to find love that is visceral and life-sustaining.\n\nActual rating: 2.5/5 Unbelievably Ridiculous Brookie StarsOh, I'm so, so, so \ndisappointed\n about this one. :(Well, reasons are simple.1)I've hated Brooke from the moment she met Aria, wait, nope, from the moment she made her appearance in the first book and kept desiring for Perry in the beginning. Thus, this book is ALL about her and how she dealt with her loss when Perry made it really clear that his heart belonged to Aria no matter what.2)There is no specific necessity for those details regarding Brooke and her moody feelings. So in my opinion, this book is completely...unnecessary.3)I'm apparently biased here but Brooke wasn't my concern in this series so normally I didn't feel anything when it comes to her. However, she did piss me off when she kissed 3 guys, hold on, 3 BROTHERS in merely 3 days. Go figure.4)As my foreshadowing citation from Brooke above, it clearly indicated that she was going to find that visceral love of her life, the only one who won't discard her, and the only one who made her heart pound crazily; however, she found none. Just because she kissed those guys doesn't mean she took them seriously and gladly, there was no love-polygon, but sadly, it was a waste of time for me.5)That ending was awfully ridiculous, you know? I ended up sitting there, laughing bittersweetly, and trying to digest what I just read. Good for Haven(Straggle), boo for Brooke.*sigh*Time to cheer up!Well color me surprised, there's still some great quotes and good sides from other characters, aka the Six who've been loyal to their Blood Lord, Perry, for starters. Apart from Brooke, I did come across some of the members in the Six and they were pretty awesome. Moreover, they were also the one and only reason I kindly appreciated this book.\n\"What if it's not what you see, but how you see it? What if the magic is in your perspective?\" He gestures to the plateau that spreads in front of us. \"What if real magic is about having the right outlook? The right view on life?\"\nIn summary, though I disliked this novella so much that I wonder if it's really the novella for such an amazing series, I didn't lose my hope for the last book, Into the Still Blue so I'm curious about what'll happen to Perry and Aria AND at the same time, I am interested in who will be Brooke's ultimate love.***Highly recommend the series EXCEPT this novella.***"}, {"userName": "Jen ♥Star-Crossed Book Blog♥", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/28353412-jen-star-crossed-book-blog", "userReview": "*Spoilers for previous books*I was not a fan of Brooke in the previous books. They way she treated and spoke about Aria made me want to smack her. And while I did see redeeming qualities in her, like when she stepped up and helped protect the tribe, it was never enough to push me to want to like her. Those moments couldn't erase the ickiness I felt towards her. So when I saw this book was in Brooke's POV, I hesitated. Could I really endure listening to a woman I dislike? Ultimately my curiosity got the better of me and I dived right into this book.\nI can’t look into his worried eyes for another second, so I stare at the links of his chain. I want to wrap my fingers around it and pull his mouth down to mine. I want to feel his lips. His tongue. His body. It makes no sense. He broke my heart and I still want him so much. How is that possible?\nStarting out, I felt annoyed towards Brooke, which wasn't shocking. I viewed her as an inconvenience who I just wanted to go away. Which is harsh, if I'm being logical. This voice in my head kept reminding me that I'd probably act the same way, if I was in her shoes. Well, I'd most likely be worse than her. But I pushed that nagging voice aside and kept my dislike towards Brooke strongly in place.\nShe is everything I’m not. And Perry chose her. Over me.\nUntil I reached around 50%. I couldn't believe that Brooke won me over. When the realization hit, I actually cussed out loud. And I'm still upset at myself that I like her. But here's the thing, she has a good heart. And she is loyal and fierce. She contained qualities I absolutely love about a person. And even when her good heart went wayward a time or two, when she was thinking horrible thoughts about Aria, she still won me over. I can't believe it!\nI actually feel like trying to be nice.\nOne thing I was surprised to find in the pages, was that we got to learn more about the three brothers, Hyde, Hayden and Straggler. They're part of the group whom Perry trusts the most. I read about them in Through the Ever Night, but they didn't have a clear voice to me. They were always just part of the Six. But now they each stand out strong and clearly to me. These brothers were charming, funny and left me hoping that they'll have a bigger role in the final book!  But I will say that Brooke's \"interaction\" with them *rolls eyes*, see now this is one of the many reasons I struggle with her. Even if those last few pages left me wanting clap towards her in regards to Straggler.\nHer arm was shot, apparently. It’s becoming infected, apparently. I should feel bad for her, I suppose. I don’t.\nSo since I struggled with Brooke in the first half of the book, and rolled my eyes at her with the brothers, that's why I'm left having to rate this book 4 Stars. Even though the character development and the story that took place were a solid 5 Stars. I know I'm being immature when it comes to Brooke. Even though she won me over. But I'm definitely sticking to this rating. Ohhh before I forget, I want to throw out a guess. My way out of left field guess is that Brooke will end up with Soren. I know he's a dweller, and she loathes dwellers, but there's this spark between them. I'm really hoping my guess pans out!\nWhen everyone you know is on the verge of drowning, you don’t stop to tell the person next to you that you don’t like swimming. You just don’t.\nSo yes, definitely pick up this book. Even if you hate Brooke. You'll most likely feel stabby towards her in the beginning, but she could eventually win you over too. And there are HUGE events that you're going to want to know about! This book takes place the moment #2 ends, and you'll miss out if you just jump into #3.  So good luck with Brooke and I hope you enjoy!For more of my reviews, please visit:"}, {"userName": "Devyani", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/6250148-devyani", "userReview": "Before reading.\"Anyone up for another e-novella, like ROAR & LIV, based on one of the secondary characters?\"After reading.I was a bit apprehensive about this one, since the novella is from Brooke's point of view, but I think that in the course of about 70 pages, Brooke and I have come to an understanding. Also, there was an excerpt of the next book, so I'm bleedingly excited. BLEEDINGLY."}, {"userName": "Felicitia", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/8909566-felicitia", "userReview": "19/10/13*nothing to do**open goodreads*\"Oh my God... another novella! and the color of the cover was beautiful!!\" But then-I noticed \"Brooke\" on the coverSo I made this new shelf maybe-want-to-read just for this book. I mean, WHY BROOKE? I loved everyone else but Brooke. She's like... argh. I would love it better if it was about Cinder... or maybe Flea? lol.Really, what else do you want with Brooke? but if Veronica Rossi made this novella special for her then she's important right? *sigh*But... if she's important then that means she's the other young-girl-and-probably-protagonist-character other than Aria. And with Perry being lovey-dovey with Aria, then that means Brooke is single. And heartbroken. And they put 'romance' as one of the genres for this novella. But Brooke is single. The other person that I know, in this trilogy, that is currently single and miserable? Roar. Roar and Brooke?HELL NO. OVER MY DEAD BODY"}, {"userName": "Jenny", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/3192371-jenny", "userReview": "I don't know if I give any shits about Brooke, but I'll read it.3.5Still don't know if I give any shits about Brooke, but the ending was kinda cute."}, {"userName": "Ferdy", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "SpoilersBrooke was a right cow in Under the Never Sky and Through The Ever Night, I was hoping her novella would show her in a more positive light… And it kind of did, but yea, I still don't like her much.-There wasn't much of a plot, it was mostly just Brooke moaning, being jealous, and bitching about Perry and Aria's relationship. Her self-pity and attitude was rather boring.-I hated Brooke's attitude towards Aria, it was undeserved. I get that she was upset that Perry dumped her, but that was well before he met Aria, and it wasn't as if Aria even knew about Brooke or her relationship with Perry. Aria didn't steal Perry away from her, she was dumped well before Aria came into the picture. And Brooke had no right to act like Aria had done her wrong, she behaved like the typical mean girl who hated the heroine just because the hero showed an interest in her. Brooke was pathetic. Sure, she admitted at the end it was wrong to hate Aria but that was only after she realised that she never actually loved Perry in the first place. So yea, if Brooke had thought she was still in love with Perry then she would have still gone on treating Aria like rubbish. So she gets no points for no longer loathing Aria.-I had no sympathy to Brooke's hurt feelings about Perry/Aria. She knew from the get go that Perry wasn't in love with her, so why was she so shocked and indignant that he dumped her? She pushed for the relationship, she knew he wasn't as into her as she was with him… So yea, she shouldn't have been surprised and hurt when he left her.-I hated Perry. The girl he supposedly he loved was at death's door and he was barely with her, he spent all his time chilling with other people. Ugh.He was such a typical manslut, his past relationship and feelings for Brooke just made what he had with Aria seem less special. I really didn't like how he had intimate and heated moments with other girls — poor Aria, she has no idea how Perry behaves around other girls. I have no doubt that Perry will cheat on Aria in the future whenever things hit a rough patch and some girl flirts with him. He's definitely the cheating type. I honestly have no idea what Brooke or Aria see in the sleazy scum-bag. Hayden and Hyde were much better characters than Perry, actually everyone was better than him.-I loved how Brooke kissed three different guys who were all brothers, and then decided she didn't want to be with anyone, and instead wanted to concentrate on herself. It made a nice change from the usual YA heroine finding her twu wuv when she's not even out of her teen years.There was a bit of vibe between her and Soren, maybe they'll hook up in the third book.-Brooke's interactions with her little sister was sweet, it made her seem like less of a cow.-The Marron arc was resolved in a rushed way. But I was fine with that since he was crappy character to begin with.All in all, I wasn't impressed — the plot was dull, Brooke was still an insufferable, whiny cow but at least she had some redeeming qualities about her."}, {"userName": "Alaina Meserole", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "I kind of wish I didn't find out that this novella existed because it was kind of meh. I didn't really like Brooke or how she acted at all so I wasn't really excited to read it, at all. Brooke was just so god damn annoying. Pretty sure I still dislike her and I probably will still continue disliking her into the next book. Unfortunately, she wasn't the only annoying person in this book. It's sad to say but Perry was kind of annoying too. Especially with how he behaved around girls and then just how he acted in general.Again, I just wished I didn't read this book but I'm sort of okay that I did because that mean's I can move onto the next book now.."}, {"userName": "Mary ♥", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/37766180-mary", "userReview": "4.5/5 stars It's strange how you can know something -know the pointy, sharp truth- but still want to bend and blunt the edges so it fits better in your mind I have to admit, I was very hesitant to read this short story at first, because I did not like Brooke as a character at first and I believed my opinion wouldn't change. But oh boy, it totally did.Because  Brooke  is not just a character that wanted a romantic love and when she didn't have Perry, she started hating everything (and mostly Aria). She was in fact a character who wanted to feel loved, and hadn't realized that she first of all had to love herself. She did figure it out, though, and it made me connect so much with her self-admiration at the end, and the way she chose to be, first and foremost, her own soulmate.Ι also loved how we came to see three of Perry's team of Six, and how each of them developed in their own unique way ♥ Not only that, we also saw how the Tides took care of the Dwellers, and how, in the face of illness, all differences vanished, and everyone helped each other. This, by itself, brought such an important message of how humanity should work, and it made me tear up, if I have to be honest.The writing was absolutely stunning, best one so far in the series, and it was full of incredible metaphors. The novella itself was action packed, cute, full of family love, romance, self realization and magic, not in supenatural powers or anything, but mostly in how Brooke reached her point of self discovery ♥What I generally love about the Under The Never Sky novellas is that they are not exactly made to just dive into a sidekick's past and character, but are also full of twists and turns and explain more about both the world and the story in general.I also have to admit I sort of shipped Brooke and Sorren, and if Brooke decides she is ready to love someone romantically again (if not, it's totally okay ♥) , Ι'd really like to see them together, mostly because a bond between an (actual) Dweller and an Outsider would be something very, very interesting to see and explore ♥Overall, I loved it, as you can see, and the only reason it lost half a star was because I needed to see more of the new, powerful Brooke :)Despite my disappointment from the second book, I will still recommend this series because it has some wonderful unique elements that I really, really enjoy and I believe a lot of people will too ♥Until further news, Happy New Year ♥ May these new 365 pages be a joyous, incredible journey ♥~Mary"}, {"userName": "Jaime Arkin", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/5293701-jaime-arkin", "userReview": "A NEW NOVELLA... about Brooke...\nWe all hated Brooke right? I mean... okay, maybe hate isn't the right word, but we certainly didn't love her. At least I know I didn't. So when I heard Veronica Rossi was writing a novella in her point of view I won't lie, my face may have looked like this\nBut here's the thing.... when I turned the last page of this, I liked her, like, really liked her. So much of the rest of the series focuses on all the other main and secondary characters (Perry, Roar, Aria, Cinder... even Liv)that we never really get to know her, only glimpses of what those characters thought of her and how they react to her, but getting inside her head for this novella was the best thing that Rossi could have done for this character. Not only do we get to see everything from her point of view, but we get some explanation for how she feels, we can feel the loneliness and sadness and what exactly the Tides means to her. And I realized... she's not that bad. At least not as bad as I made her in my head. And like I said, I walked away from this novella really finding that I liked her character. Her loyalty and devotion to her family and friends, her desire to keep them safe and the budding friendships were all wonderfully written. I don't know how Rossi does it. Even in these novellas I find myself highlighting the beautiful words and sentences that she gives us... this was no exception. Some examples:The bright green of his unrelenting eyes. He is weathered and softened like a seashell. Beautiful in the exact opposite way of the plain perfectness of the Dwellers. orI can tell he's smiling. He's a happy kisser. A girl could fall in love with that, I think.If you haven't started this series, I beseech you - go get the books start them now, so you're all caught up by the time Into the Still Blue comes out because like the rest it is amazing and a wonderful conclusion to this series. And make sure you read the novellas. Not only will you get a bit more about some of the amazing secondary characters that Rossi has created but she definitely delivers the swoons as well.This has quickly moved to the top of my all-time favorite series - I know you'll feel the same way once you start! This review can be found on my blog, Fic Fare!"}, {"userName": "fennie", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/229164-fennie", "userReview": "i'm impressed, veronica rossi. i don't know how you did it, but you managed to make the girl everyone loves to hate relatable, and vulnerable, and dare i say, lovely. i'll admit that when i heard about this novella, i had the same reaction that i'm sure the masses had: brooke?! who wants to read about a childish, bratty girl who seems to think she has some claim on perry when clearly he's in love with (not to mention rendered to) aria?!oh but i was wrong. no, i don't love brooke with the same intensity that i love roar or perry or aria, but i've grown to care deeply about/for her and respect her. when it comes down to it, she's just another heartbroken girl trying to figure out her way in the crazy world of aether and cave-dwelling where her ex-lover is her blood lord. her situation isn't an easy one, yet she manages over time to handle herself with grace and maturity. she goes through a growth process throughout this novella and i'm thoroughly glad that i took this short journey with her. i actually completely understand why perry cares so much about her. she's very much like him: intensely passionate, fiercely protective, loyal to a fault, proud & strong & capable. and when i really think about, she had to have redeeming qualities; after all, she was liv's best friend and i loved liv for the short amount of time that i got to spend with her.this novella also allowed a glimpse into brooke's history with perry & how they began, as well as some heartbreaking descriptions of liv & roar's relationship. It was also nice to read an outsider's perspective of perry & aria together since we tend to get their viewpoints.at the end of this novella is an excerpt of \"into the still blue\" and dear god that book is likely going to kill me."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "Even though I have the galley, I went and put Into the Still Blue on hold, figuring I might want to read Brooke first, based on publish order.Eh. It wasn't all that necessary. Most of this short was about Brooke getting over Perry, and debating the hotness of two different guys. Not that I have complaints about reading anything from Rossi because she has a way with words that is always a pleasure to read, but I am sort of burned out on series with all of the extra short stories which don't actually need to be read.There were a few snippets about the other characters, but it was nothing all that new or exciting. If you're debating whether or not to read Brooke, but haven't yet read Roar and Liv, definitely go for R&L instead. At least that was a short story worth including, and is one you won't want to miss if you're invested in the series.(I still adore this series though)"}, {"userName": "Tania", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "Veronica Rossi understands that there are only a few reasons why you should be writing short stories to include in a series. This one was written as a quick reminder of where the previous book in the series left us. Very neccessary for me as I usually read these when they are published. Another good reason for a novella is to give us the perspective of one of the smaller characters in the big story. I liked getting to know Brooke, especially as she did not really feature in the previous books. I can't wait for book 3. This is without a doubt one of my favorite candyfloss series!"}, {"userName": "Dana", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/16702976-dana", "userReview": ""}, {"userName": "Sarah", "userReviewDate": "Jan 22, 2015", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "The events in this novella occur between Through the Ever Night and Into the Still Blue but I don't think it's essential to read this story if you don't want to. It does give a little insight into what's happening with Perry and Aria and it does resolve a plot thread with a certain group but it was mainly Brooke moaning and feeling sorry for herself.I've never particularly been a fan of Brooke's but I didn't dislike her either, she was Perry's ex girlfriend but I never felt there was a chance of her coming between Perry and Aria even though she obviously wanted to. I have to admit I did feel a little sorry for her but it's not like Perry ever lead her on or made promises that he didn't keep. She knew all along that he didn't love her and she pushed him into a relationship that she knew he didn't want but I guess that doesn't make her heartache any less and I expect most of us have been in a similar position to Brooke at some point. Although I could relate to Brooke's feelings I just didn't find myself enjoying spending time in her head, she is so obsessed with Perry and if I'm honest I found it boring listening to her constant complaining about pretty much everything. Add in the fact that when finally she decides to move on she jumps back and forth between two brothers and I just found myself rolling my eyes at her behaviour. Do all girls in YA have to have a boyfriend to feel good about themselves? Okay Brooke finally makes a good decision at the end but unfortunately it was too little too late for me.Unlike the previous novella, Roar and Liv, I didn't really think this had much to add to the series and I ended up being disappointed with Brooke's story. It's definitely one I'll be skipping on any future rereads of the series."}, {"userName": "Tamara", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/7466356-tamara", "userReview": "[She realized how much Perry loved Aria. She decided to move on. She realized she wasnt actually in love with Perry. She apologized to Aria (hide spoiler)]"}, {"userName": "Siiri (Little Pieces of Imagination)", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/7399193-siiri-little-pieces-of-imagination", "userReview": "What a gorgeous cover! These pinkish and purple-ish colors suit well with this novella. I thought I’d hate Brooke’s view on things, but I actually found myself enjoying it. Since I’m a huge Perry & Aria shipper, I naturally dislike anyone who tries to tear them apart, but Brooke’s reaction was normal and expected in Through the Ever Night and even in her novella. The realizations she has were natural, well-written and I’m really glad for her. Reading this will help you realize the sudden change in her in Into the Still Blue and I appreciated the glance into her mind. Also, SOREN!!! I hated his guts in Under the Never Sky, but slowly, he made his way into my heart and I became to root for him. I had two ships in this novella, though in all honesty I’m rooting for only one at this point. [Well, I was. Since I read Into the Still Blue right after and my review will be up tomorrow.] Who are they? Um. I ship Brooke with either Hayden or Soren. Yeah. These two would make great pairings with this female warrior and I like these possibilities. All in all, it wasn’t anything special, but I really appreciated this novella and I think it’s worth exploring. Plus, some really cute Aria and Perry moments even when she’s unconscious and fighting for her life:)Overall rating: 3.3 out of 5.0More of my reviews can be found on my blog."}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "[ Soren. (hide spoiler)]"}, {"userName": "katnissbraid.", "userReviewDate": "Dec 12, 2013", "userURL": "http://www.goodreads.com/user/show/6513938-katnissbraid", "userReview": "Brooke is a shallow character, I don't know if someone finds her funny, badass or whathever I just find her a petty girl who cannot understand what she truly wants. And goes around kissing boys (brothers!) for getting over Perry. Really this is the novella. I hope she gets with Soren. That would be a good couple."}, {"userName": "Natasha (books_n_dreams)", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/19836892-natasha-books-n-dreams", "userReview": "Brooke's story is very intense with emotions. There is quiet a bit of hatred which makes me not like it, but at the same time you see and understand why because of how strong she feels for Perry.It was nice getting to see Brooke but this wasn't one of my favorite novellas. Maybe it was because of her hate for Aria that really turned me off of it.When Brooke finally takes a change in direction my feelings towards her changed, but not 100%. I think Brooke is one of those characters you are unsure of how to feel, at the end I like who she is a lot better.Again this novella wasn't my favorite but it was definitely needed and had a lot happen in it."}, {"userName": "Nicola", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/8803703-nicola", "userReview": "I wasn't a huge fan of Brooke throughout the series but after reading this, I think she really redeemed herself. She's hung up on Perry, which is understandable, but it was nice to see her figure things out. When she finally understands that her relationship with Perry was never going to last, and moves on from her boiling rage and jealousy, she's actually a pretty decent person. I liked her interactions with the three brothers, her developing fondness for Soren and her acceptance of Aria."}, {"userName": "Raven", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/27175225-raven", "userReview": "I'm really certain that I don't like Brooke but this novella change my views about her. Argh. Honestly, I'm starting to like minor characters more than the main protagonists of this trilogy. Tell me, is this a good thing or not?"}, {"userName": "Anna", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/9418049-anna", "userReview": "I'm probably in minority because I liked Brooke as a character while reading Under The Never Sky trilogy. This novella made me like her even more- I loved the way her character developed throughout it."}, {"userName": "Julie", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/16529168-julie", "userReview": "Review up soon! Gah, can't wait to start my arc of Into The Still Blue."}, {"userName": "Scarlett", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/46710254-scarlett", "userReview": "I enjoyed this novella more than the other one. I felt like getting an idea of how Brooke and Perry were before made their characters make more sense. They were more serious than I had thought. I also liked getting to know Hyde, Hayden, and Straggler more in this one. There was also a decent amount of action which was one thing I felt was lacking in the original trilogy. And it answered some questions that had been left unanswered, such as what happened while Aria was unconscious and what happened to the people who abandoned the Tides in the second book. Overall it was a good addition to the story and I’m glad I read it."}, {"userName": "Books'N'Tracks", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/42738095-books-n-tracks", "userReview": "4.5 Stars I still don‘t like Brooke as a character, but the author has found the perfect combination of action, humor and emotion. Now I‘m more than ready for the third book. Perry, I‘m on my way! I‘m so in love with this series."}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "3.5 StarsMinor spoilers for Through the EvernightBrooke has never been my favorite character in this series and well she isn’t supposed to be since she is Peregrine’s ex-somethng. But this novella gives insight into what is happening right after Aria and Perry make it back to the cave with all the Dwellers. Brook is trying to come to terms with the love she sees Perry hold for Aria and the loss of her best friend Liv. Clara is returned at least so happiness is mixed in with all the sadness.My guess is that Brook will play a bigger part in the final book and that is why she gets how own novella. As she is chased by the 3 brothers in the 6 that Perry brought back with him she explores her past relationship with Perry and finds that maybe what they had wasn’t as strong as she once thought.The Brothers Hayden, Hyde and Straggler (Haven) were all cute in their semi-pursuit of Brooke competing with each other. All are very different in their approaches.\nI don’t want to ruin my chance to know you, Brooke. That’s why. I don’t want to ruin it by saying the wrong things.\nBrooke is strong though and a protector of her clan and family. There is a threat as Wyland trying to come back to the group that she and the 6 must help overcome.I really liked the ending of this novella, who says you need a man to be happy sometimes it is better to choose to be only until you are healed than choose something that isn’t exactly right. Brooke became much more likable by the end and has at least come to terms with the loss of her first boyfriend. I really think that later she will be a much stronger character.But, my favorite parts were still the glimpses I saw of what was going on with Aria and Perry. There are a few chapters of Into the Still Blue that are a great tease until the final book comes out."}, {"userName": "Brooke (The Cover Contessa)", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/7295635-brooke-the-cover-contessa", "userReview": "Holy crud, Veronica Rossi is MY GIRL! This short was totally and completely amazing! I loved every last word of it! I can' teen begin to tell you how much!Brooke is amazing. She's so not what you think she is. This short shows her growth in so many ways it's hard to express. She is so in love with Perry, at least she thinks she is. But as the story progresses, she begins to grow and understand what their relationship really was about. And she experiences these changes by watching the interactions of all the people who surround her.I think what I love about Brooke is that she's so strong, yet she's also vulnerable. But she doesn't want people to know she is vulnerable. And she cares, about everyone, even if she seems like she doesn't. She is so much more complex than you thought she was, believe me!So, you think you dislike Brooke, right? You think she only wants to come between Perry and Aria, yes? Well, read this and prepare to have your mind blown.I happened to get an ARC of Into the Still Blue and read it before this. I didn't understand the changes that took place with Brooke in the book. But now that I've read this novella I completely understand where she is coming from!So pick it up and give it a go before diving into book #3!"}, {"userName": "Nancy", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/6262033-nancy", "userReview": "2.5-3 STARS***\n\"He kisses like a poet. Like he's writing poems on my lips.\" \nI was a little hesitant to read this book since I am not the biggest Brooke fan. I mean, she hasn't exactly been the nicest person in the previous books, and she hasn't tried much either.Now...while I don't like her completely, I feel like it's a step in the right direction.We see more of what she's going through with her feeling toward Aria & Perry, Liv, as well as having her sister back. Knowing what she's going through doesn't really change much but it does help us understand her hostility much more and finding out that it's not mainly jealousy.\n\"He was opening his heart, but I couldn't because mine is closed. Mine is bruised and wailing and grasping to stay afloat.\"\nAs far as romance goes, I wasn't expecting what happened, at least, I don't remember anything leading up to it. That aside, it's definitely swoon-worthy and a bit of, \"You go, girl, but do you really want to do that?\"***4 STARS***We also got the first 3 chapters of \"INTO THE STILL BLUE\", and OhMYGOSH I seriously cannot wait!"}], "description": "Set just before the events of Into the Still Blue, the conclusion to Veronica Rossi's Under the Never Sky trilogy, this breathtaking novella is a satisfying stand-alone for new readers as well as an exciting glimpse at favorite characters from the trilogy. Pulsing with romance and danger, Brooke will leave readers desperate for the conclusion to this epic and unforgettable saga.The only fight she can't win is the one for Perry's heart. Following the stunning climax in Through the Ever Night, the Tides have been forced to seek shelter from the Aether storms in a dismal, secluded cave. But Brooke's memories of the cave go back much further, to when she and Perry used to come here together. That was before Perry fell in love with Aria and before Vale's dealings with the Dwellers altered the course of the Tides forever.Now, with her sister back from a haunting year in captivity and Aria lying unconscious in the sick bay, Brooke struggles to put the pieces of her life back together. Without Perry, who is she? And what is her role in this frightening new world? As these questions swirl about her, an old threat to the Tides resurfaces, and Brooke is forced to put the lives of her people before her own. But in taking this step outside of herself, Brooke may finally discover what she truly wants.", "title": "Brooke\n      \n          (Under the Never Sky #2.5)", "url": "http://www.goodreads.com/book/show/17616704-brooke", "average": 3.85, "cover": "https://images.gr-assets.com/books/1379876478l/17616704.jpg", "reviews": 436, "authors": [{"url": "https://www.goodreads.com/author/show/4637369.Veronica_Rossi", "name": "Veronica Rossi"}], "type": ["Young Adult", "Science Fiction", "Novella", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/17616704-brooke", "http://www.goodreads.com/book/show/17860222-brooke", "http://www.goodreads.com/book/show/11594257-under-the-never-sky", "http://www.goodreads.com/book/show/13253276-through-the-ever-night", "http://www.goodreads.com/book/show/14288998-into-the-still-blue", "http://www.goodreads.com/book/show/15754052-roar-and-liv", "http://www.goodreads.com/book/show/23430471-riders"]}