{"ratings": 211, "userreviews": [{"userName": "Mellisa Rock", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/50887895-mellisa-rock", "userReview": "Twelve year old Sophie had my heart! I just finished Bubbles by Abby Cooper & it was a delightful middle grade/YA! Sophie is struggling with the fact that she thinks she not only broke up her mom and her boyfriend but also caused her mom to lose her job. While it's pretty normal for kids to think things that aren't their fault are, she then has to deal with the fact that she starts to see thoughts bubbles above people's heads! I loved this take on kids learning to read other's thoughts based on body language & tone. I also loved how the author surrounded the main character with helpful adults including a motherly neighbor, teacher and therapist! I sadly have to pass this book along to the next reader but I'm purchasing a copy for my 5th grader! I was provided with a copy of this novel in exchange for an honest review thanks to @kidlitexchange"}, {"userName": "Patrick", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/5843194-patrick", "userReview": "How lucky am I? I was able to learn about Abby Cooper and her first novel called Sticks and Stones. I actually got to meet her at #NerdCampMI last July. We ran into each other again at one of her Barnes and Noble book signings. I picked her novel Sticks and Stones to read to my fourth graders. When we were done, she visited my class and answered all of our questions.On top of all this, she left my class with her upcoming novel Bubbles, that will be released next July 2017. This will be our next read aloud in my classroom. I couldn't wait to read it so I brought it home this weekend and read the whole book. When you read a first novel by an author and it is good, like Sticks & Stones, you can worry that the sophomore book might not measure up. That was NOT the case with this book. I loved it. Everything about it was so awesome. The new character of Sophie was endearing and warmed my heart. The plot was amazing with lots of energy and spirit. The supporting characters added greatly to Sophie's story. I actually could not put the book down once I started.I know my fourth graders are going to love it just as much as me. Thank you Abby Cooper for allowing us to experience this newest story of yours. We are honored. Once we finish, it will continue its journey and tour!!!"}, {"userName": "Brooks Benjamin", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/13086075-brooks-benjamin", "userReview": "I'm always intrigued by how an author follows up a debut, especially if I completely fall in love with it. Sometimes I'm worried that the second just won't hold up. Other times I'm blown away by how they pulled off another story with as much charm and heart.Abby Cooper's BUBBLES holds all the humor and every bit of the magic of her first book, all with a brand new character and concept that is equally original and fresh. Sophie's voice is just as wonderful, and her journey to figure out why she's seeing these bubbles, what's going to happen to her mother, and how she's going to pull of this seemingly impossible school project is so entertaining and thought provoking.BUBBLES will spark discussions of being open, being willing to communicate, and understanding that change can be a truly bittersweet concept. I hope this book finds a home in every classroom and in every library."}, {"userName": "Kate Olson", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Abby Cooper writes from and for the very core of the middle grade heart, and it is obvious to readers that she knows her audience well. In Bubbles, as in her debut \"Sticks and Stones\", Cooper infuses threads of magic into her storyline - magic that brings very real topics such as anxiety, depression and having a single parent into a format that tweens can easily read about and relate to. Sophie, like so many other 12-year-olds, often agonizes over problems and attempts to deal with them without ever actually talking about them with anyone - this leads her to misunderstand situations and cope with them in less than ideal ways....and those pesky BUBBLES over the heads of people showing their deepest thoughts don't help! Throughout the course of the book, she learns the hard lesson that talking about problems may not always solve the problem, but it will clear things up and make you feel a lot better. The triathlon storyline is a unique and welcome one in the world of middle grade, and the Chicago setting is as well. Sophie's world of family and friends is a diverse one, with no part of the story being a lesson about diversity - this is incredibly appreciated as kidlit tries to provide windows and mirrors for all readers, but doing so in an non-preachy way isn't always achieved in other works. How do I know tweens like these books? My 11 YO daughter has read Sticks and Stones at least 4 times, and after reading an advance copy of Bubbles, gave it a glowing 5 starts. My middle school students won't let Sticks and Stones stay on the shelf for even a day, and I know Bubbles will fly off the shelves as well once school starts again in the fall. Thanks so much to the publisher for an advance reader edition of this book for review purposes! All opinions are my own."}, {"userName": "Kimberly Mcdermid", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/27411946-kimberly-mcdermid", "userReview": "Abby Cooper has created another wonderful middle grade book! I had the pleasure to get an ARC of her most recent novel Bubbles. Bubbles is the story of Sophie who is trying to navigate middle school, with friendships, a sad mom, and a possible crush. But Sophie has started to see bubbles above people’s heads, letting her in on their inner thoughts. This causes a lot of confusion and problems for her. Although the possibility of seeing thinking bubbles above people’s heads is not reality, this book feels like it could be realistic fiction. The plot and storylines are easy to see happening in real life. I love how Abby captures what education is like now. In the book the teacher assigns the student’s a project where they have to take a risk, do something they are scared of or don’t normally do. Without any spoilers, Abby uses this storyline to help inspire the characters, which in turn inspired me to take a risk similar to Sophie’s the next day! I know readers of this book will look to Sophie for the encouragement to try something new! Great job again Abby! I highly recommend this book."}, {"userName": "Scott Fillner", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/52395337-scott-fillner", "userReview": "Abby Cooper demonstrates a clear strength and talent for writing. She is very strong in developing characters and tapping into the challenges of what it is like to be a middle school aged child.Her last concept in Sticks and Stones dealt with words spoken and the impact they may have on your self-concept, but this time Abby focuses on thoughts which may have impact on our perceptions. Those perceptions, as we will find can be locked on and accurate, or over analyzed and create challenging situations.I highly recommend this book to any MG reader."}, {"userName": "Lee Malone", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/85609-lee-malone", "userReview": "Charming and heartfelt, this book explores the idea of what would happen if you could see what people were thinking, and how would that change your relationships? The main character's voice is spot on perfect, and her real concerns mirror those of kids her age, even while she grapples with this strange, newfound ability. Definitely recommend.(I received an ARC of this book in exchange for an honest review)"}, {"userName": "Jenn Bishop", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/43980984-jenn-bishop", "userReview": "Some characters just worm their way into your heart . . . and stay there. I have a feeling that's what Sophie Mulvaney has done to me. This irrepressible twelve-year-old has had her home life shaken, with her mom depressed in an aftermath of her breakup with Pratik, a boyfriend that Sophie cherished as much as Mom. Worse: Sophie feels responsible for both the break-up and Mom losing her job. And then the strangest thing happens. Sophie starts seeing people's thoughts -- beginning with Pratik's -- displayed in bubbles over their head. What does it all mean? Is she going crazy? (She now has an appointment with a therapist, after all.) And moreover, what's she supposed to do with this new knowledge?In a totally accessible and enthusiastic first-person voice, Cooper sucks readers right into Sophie's world and her predicament. I loved getting to know Sophie's friends -- the anxious Kaya and the goofy Rafael, and even her frenemy Viv -- and following her navigate the treacherous waters of middle school. The runner in me (though, ha, never a tri-athlete, mark my words!) particularly enjoyed seeing Sophie and her friends test themselves by training for a triathlon. I was a huge fan of Cooper's debut STICKS AND STONES, but I think I might be an even bigger fan of BUBBLES. It's everything I want out of contemporary MG: a fun voice, realistic problems, and a heartwarming conclusion."}, {"userName": "Monica Tesler", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/35556485-monica-tesler", "userReview": "I adored Sticks and Stones, so I was eager to dive into Abby Cooper's second novel, Bubbles. It did not disappoint. A recent job loss and breakup has left Sophie Mulvaney's mom really depressed, and Sophie is on a mission to fix things, particularly since she thinks she's the cause of her mom's woes. To make matters worse-and a whole lot stranger-Sophie starts seeing bubbles above people's heads that reveal their personal thoughts. The road to cheering up her mom isn't smooth--Sophie's training for a triathlon is challenging, she wrestles with jealousy, and a mistake she makes threatens a grade for her and her friends. Despite Sophie's challenges, she discovers the strength of her friendships, the value of supportive adults, and how there's a lot more to a person than their thought bubbles.Bubbles is a delightful read with a good message and strong but flawed female characters. Fans of Sticks and Stones will love this book."}, {"userName": "Jennifer", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/4346565-jennifer", "userReview": "What a charming second novel from Abby Cooper! I was a big fan of her first book, STICKS & STONES, because of the vivid voice and awesome positive message, and BUBBLES has those same two winning elements. 12-year-old Sophie Mulvaney has begun to see bubbles above people's heads - you know, the kind you see in cartoons. These bubbles share their thoughts. Pretty cool right? Actually no - it's super stressful and Sophie is having trouble dealing with it. I loved Sophie's passion for history (and for pancakes), the triathlon, and Sophie's relationship with her mom. I think this book would be a perfect fit for kids in grades 4-6 and deserves a place in school and classroom libraries! Fans of Cooper's first book will not be disappointed!"}, {"userName": "Gail Nall", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/24824080-gail-nall", "userReview": "I'm a huge fan of Abby Cooper's STICKS & STONES, and her newest work, BUBBLES, didn't disappoint! 12-year-old Sophie is dealing with a lot -- a depressed mom, friends who might not want to be her friend anymore, a \"risk project\" she has to do for class, and now -- on top of all that -- she's seeing people's thoughts over their heads. Told with a fun, vivid voice, the plot moves along quickly even as the reader becomes more and more invested in Sophie's emotional world. Highly recommended."}, {"userName": "Paul Orsino", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/51000583-paul-orsino", "userReview": "Abby Cooper's second novel, Bubbles, establishes her as a master of writing middle grade voice. The insecurities, the new experiences - everything her characters go through ring true. This is a fantastic book about friendship and taking risks. Put Bubbles on your TBR list!"}, {"userName": "Wendy MacKnight", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/21824552-wendy-macknight", "userReview": "What a beautiful, thoughtful, book about the awkwardness, pain, and hope of navigating the middle grade world. Heroine Sophie is struggling: her mom is depressed after losing her job and boyfriend, her friendships seem suddenly fraught with peril, thanks to first crushes and the awful Viv, who's trying to edge Sophie out of her own group of friends. Worst of all? Sophie is seeing thought bubbles over people's' heads, something which is both upsetting and confusing. But is everything exactly as it seems? Kids are going to love this book, so perfectly does it capture the changes that occur as they begin to navigate more complicated relationships and feelings. A truly wonderful book!"}, {"userName": "Janet", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/12353992-janet", "userReview": "Sophie Mulvaney is a regular teen, wading through the struggles of life until one day she starts seeing bubbles . . . you know, the kind in cartoons that show you what the character is thinking? I really loved this concept! How many times have we wished to know what someone else is thinking? If you are like me, so many. But it's not as cool as you might think. I love how Sophie has to learn to trust herself, how she has to learn that people aren't always completely clear in their thoughts, and that most of the time, we are all just doing our best and muddling through life, hoping things will be okay.Outside appearances aren't always what they seem, and the kinder we are to others, the happier we will all be. Ms. Cooper has written another great book that teaches us all to be a little kinder both to ourselves and others. It's something the world can really use right now."}, {"userName": "America", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/62564199-america", "userReview": "Sophie worries. She worries about her mom and her exboyfriend. She worries that she ruined their lives. And her worries make bubbles pop out of people's heads, so she can read them. But can Sophie handle knowing more than she should?"}, {"userName": "Jessica Samuel", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/45538687-jessica-samuel", "userReview": "Another fabulous book from Abby Cooper. Her stories always hit home and really force the reader to consider others points of view and the power of words!"}, {"userName": "Amber", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/4372123-amber", "userReview": "Abby Cooper has done it again! Similar to the problem in her debut novel, Sticks and Stones, Sophie Mulvaney has a unique problem. She can see thought bubbles above people's heads and knows what they're thinking! Sounds good, right? Nope. This is a book about assumptions, perceptions and how to be a good friend. Definitely a book that will spur GREAT conversations with middle grade readers!"}, {"userName": "C. B. Whitaker", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/21608375-c-b-whitaker", "userReview": "Abby Cooper's BUBBLES is the follow-up to her strong debut and surprisingly takes every aspect to the next level. I was amazed, chapter by chapter, just how good Cooper’s new middle grade novel truly is. BUBBLES has all the humor, magical whimsy, and lovable characters that were notable in her first outing, but manages to exceed expectations in terms of style, voice, and concept. 12-year-old Sophie has a lot on her plate: her mother is single (again), unemployed and depressed, her teacher is making her do a challenging project on risk-taking, her best friends convince her to do a triathlon with them, and she’s getting a crush on her childhood friend Rafael. To make matters more interesting, Sophie starts to see other people’s thoughts in balloons over their heads and finds out there are definite pluses and minuses to knowing what on people’s minds.The concept works really well and draws the reader deeper into Sophie’s inner world with every revelation. Most of us can relate to thinking we can read other people’s minds at times, and it’s never more important than when in our young teens. The plot moves along nicely and gathers momentum with every relational complication. In the end, it comes down to learning about communication, and without saying too much more, the results are surprising, funny, and touching. I highly recommend this wonderful and inspiring novel."}, {"userName": "Angie Hull", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/61236303-angie-hull", "userReview": "I was sent an Advanced Reading Copy in order to give this review. Abby Cooper has another amazing story to tell! Sophie is transitioning through middle school, friendships, and life. She begins seeing thought bubbles above other people and makes choices based on those thoughts. This is a quick read that will be loved by all middle grade students and it is one that makes you truly wonder - what really is everyone around me thinking about at this exact moment?Wonderful, well written, and cannot wait to read it again!"}, {"userName": "Jill Diamond", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/53080969-jill-diamond", "userReview": "I love books that have a unique, interesting concept but to which middle grade readers can still totally relate. Like Cooper's first book, STICKS AND STONES, BUBBLES totally fits the bill. The characters are well-imagined, the story is engaging and the writing is great. An overall fantastic read!"}, {"userName": "Bridget Hodder", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/34056879-bridget-hodder", "userReview": "Review to come!"}, {"userName": "PictureBookPlaydate", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/10149808-picturebookplaydate", "userReview": "I thought this book was outstanding, a book I really wish I'd had when I was in middle grade. There's a lot of plot I could get into (which is all well paced) but what I wanted to focus this review on are the tough topics that this book handles head on. There are the typical middle school worries about friendships and crushes, and those are done superbly. But, in addition, this book really touches on depression, both at the adult and child level. And it talks about therapy as well, which I thought was amazing. SPOILER PART:.....Take this exchange between Sophie and her mother, about her mom's depression, which is a big theme throughout the book. This is toward the end of the book:\"You were so sad. You've been so sad all the time!\" (Sophie)\"I know. The truth is, Soph, sometimes I get really sad like this. It's something I've been dealing with for a lot of my life. I usually don't let you see it, but this time, I don't know...I just didn't have the energy to call someone.\"And then further on, when Sophie talks to Kaya, her friend who also sees a therapist (also at the end of the book):\"Isn't it weird that we're the only people in school who have seen them, but we never talk about it?\"I nodded. \"I was embarrassed at first. It felt like an embarrassing thing.\"\"Yeah, I get that. But it shouldn't be. I liked going to mine. Did you like yours?\"\"A lot.\"We sat quietly, looking up at all the people walking by. Maybe we were the only kids in our school who had gone to therapists, but I had a feeling that wasn't even close to being a fact.\"Any book that can help normalize going to therapy for kids is one that gets thumbs up in my book. Kudos to the author for handling these tough topics and making them accessible to kids who are most in need of the encouragement."}, {"userName": "Sam", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/1559491-sam", "userReview": "Huge thank you to Raincoast for this ARC!I will admit, I am unfamiliar with the works of Abby Cooper. She is well loved in the middle grade sphere for her first book Sticks & Stones (which after reading Bubbles I now want to read). I wasn't sure what I was going to get with Bubbles, but what is presented is a very sweet story of friendship with a pinch of magical realism. This is a book entirely looking at perceptions of others. Sophie, our heroine, can see thought bubbles over people's heads and she is instantly given an impression of the people that surround her. It's a pretty interesting concept for a middle grade novel, also given that this is a story about risk-taking and essentially trying to be the best version of yourself. There's some wonderful messages in this book that I feel will appeal to middle grade readers, as well as adults who love middle grade.My favourite aspects of this book were Sophie's relationships. She is constantly given reasons to pre-judge people with her 'bubbles' ability, and it's interesting to see her mind fight with the images that she sees. Sometimes she finds herself agree with what the bubbles show, and other times you see that she struggles to see the best in everyone. I think Abby Cooper does a good job of showing this balance, which I think can be hard to do given the novel concept of seeing thought bubbles.Bubbles is a very genuine novel. It's one of those stories where the author does a fantastic job of tapping into the insecurities and impressions that young children can often have as they are growing up. I definitely want to check out Cooper's first novel, but Bubbles definitely left me thinking long after I had closed the book."}, {"userName": "Cindy Mitchell *Kiss the Book*", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/19521241-cindy-mitchell-kiss-the-book", "userReview": "Cooper, Abby Bubbles, 262pgs. Farrar Straus Giroux (Macmillan), 2017. $17. Sophie has a mind that never stops and when things get complicated in her life, she starts to see thought clouds (like in comics) about the heads of people around her. In her home life, her mom has gone through a breakup and has become closed off and sad, making Sophie feel the same way, even her friends have noticed. At school they are given the assignment to do something that is a risk for them, so in an effort to get back to her old adventurous self Sophie (and her friends) decide to run a triathlon. But everything just gets more confusing and Sophie must find a way back to herself. Honestly I liked this book a lot, but it was just so chaotic. Being in the brain of Sophie is just exhausting, like ADD, jumping from one thought to the next. While it creates a very unique and well fleshed out character, I think some readers will relate to her and others will just feel confused and give up. I like that it features quite a few true to life themes, like single parenthood, parent/child relationships, depression, change, friendship, and perseverance. The ‘magical’ (or mental health issue) component of the bubbles is very much off in the sidelines as the day to day thought chaos of Sophie proceeds. I think this nonchalantness about the bubbles will disappoint many readers hoping she had gained a magical power, along with the fact that she doesn’t ever try to take advantage of it. 5-6 graders will be your choice audience.EL -OPTIONAL. Stephanie Elementary School Librarian & Authorhttps://kissthebook.blogspot.com/2017..."}, {"userName": "Barbara", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "Twelve-year-old Sophie Mulvaney feels helpless to fix the things that are wrong in her world. Not only is her mother moping over the loss of her job as a television reporter and her break-up with Pratik, who lives nearby, but Sophie feels responsible for both problems. Thank goodness she has her two best friends, Kaya and Rafael. But once the three youngsters become immersed in plans to participate in a triathlon as part of a school risk project, Sophie starts to realize that Kaya and Rafael just might like each other as more than friends. Things are further complicated by the fact that Sophie has suddenly developed the ability to see others' thought bubbles, many of which show their own fears and inadequacies, and her growing suspicions that classmate Viv Carlson is trying to steal away Sophie's two friends. Although the premise of the thought bubbles might be outlandish, the author nails the feelings of inadequacy that sweep through Sophie even while she watches her mother become increasingly distant and disengaged. Middle graders will enjoy watching Sophie draw from her inner reserves to get back on track and embrace life while serving as an example to others. The author has bravely also tackled a topic that is not often explored in books for middle graders--how the adults in their lives cope with depression. This title provides inspiration to others facing similar struggles while also opening up possible conversations about the topics it addresses, just as the author's earlier title, Sticks & Stones did. Abby Cooper is an author to watch because she writes from the heart and seems to know this territory so well."}, {"userName": "Mrs. Hornick", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/69999668-mrs-hornick", "userReview": "In the story Bubbles by Abby Cooper, Sophie is a very adventurous girl with a very special gift. Sophie is a twelve year old girl who lives with her mom and her moms boyfriend Pratik. Sophie is very adventurous loves to take risks especially with her mom.Also Sophie has her best friend Kaya, who has always been there for her. Sophie also can see bubbles above people's heads that say what their thinking. Although Sophie finds seeing bubbles above people's heads pretty stressful because she can see what other think about her and others. Also, her mom got fired from her job causing her mom to act depressed, therefore making Sophie less adventurous than she had ever been. To make things even worse, Sophie’s Mom broke up with Pratik sending Sophie deeper into sadeness. Lastly, Sophie has to do a project where she has to take a risk. Can she open up and do her project, or will she fall to the overwhelming stress, Find out by reading Bubbles.Some people that would love this book is adventurous people. This book is full of Sophie trying to overcome her sadness and open up to adventure. This book would also be a great read aloud. This is because this book can leave readers on a cliffhanger or have the students really get into the book, wanting to read more. Lastly this would be an amazing book for those who like seeing the character overcome a obstacle through the book, since Sophie is trying to get over the past events and keep moving on."}, {"userName": "AJ", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/69486164-aj", "userReview": "Sophie has a lot going on in her life right now. She's the main reason her mom lost her job, and she caused the argument that made her mom break up with her boyfriend. Now, her mom doesn't want to do anything but mope anymore. To make matters worse, now Sophie has started seeing bubbles over people's heads that tell her what they're thinking. However, Sophie's new project at school (having to try and accomplish a risk) gives her an idea to help her, her mom, and her friends. They're going to do a mini-triathlon. If they win, everything will go according to plan, and her life will be back on track to perfection.I'm really kind of torn about this book. There were some elements of it that were kind of interesting, but overall, it wasn't as good as I was expecting (or had hoped to expect.)I think the main problem was that there didn't seem to be a whole lot of consistency with the story. First, she's trying to help her mom, then she's dealing with magical bubbles, then it's troubles with her best friend, then she's in therapy, then she's trying to figure out her feelings for a boy in her class... It was kind of like \"poof\" all these problems. But then, at the end of the book (after she accomplished her risk goal), it was \"poof\" everything becomes magically better overnight. I didn't think that it made for a very dynamic storyline.And, really, her ability to know what people were thinking played a very, very minimal part of the story. It probably could have been eliminated entirely without too much rewriting. Unfortunately, that had been the part that I was really looking forward too. What I thought was going to be a funny, interesting adventure about knowing what really goes on in people's minds, turned out to be a (fairly predictable) story about a 12-year-old girl dealing with friendship problems. So saying, there was a good overall message tot he story that was about not being a doormat and making sure not to let other people's actions get you down. There were several other, smaller messages about the importance of friendship and family and the like. It might have been more enjoyable for an eleven or twelve-year-old, but it was pretty predictable and a little boring for an older teen. Swearing: NoneSexual Content: NoneViolence: NoneReligious/spiritual/magical content: None. The bubbles weren't portrayed as magical."}, {"userName": "Susan", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/8263607-susan", "userReview": "Thanks to the #kidlitexchange network for the review copy of this book - all opinions are my own.Sophie is in mourning, because four months ago she was not only the cause of her mom breaking up with her long time boyfriend, but she also caused her mom to lose her job. As a result, her mom either sits on the couch reading boring magazines or cries in her room, instead of sharing lots of adventures with Sophie as they’ve always done And now Sophie has a new problem. She sees speech bubbles, just like those in cartoons, above people’s heads. She can tell what everyone is thinking!Here are some of the many reasons that this book is definitely a 5 star review!Sophie’s strength and courage to share about the speech bubbles with her mom and her friendsSophie’s courage to talk to her counselor about her lifeSophie’s courage to creatively tackle her problems.Sophie relationships with the adults in the storySophie’s friendship with her two best friendsBubbles shows upper elementary and middle schoolers that struggling with friendships and self confidence, is very normal and it’s okay to be sad once in awhile. As Sophie said “...a sad thought every so often didn’t mean a sad life. ...And as long as I have my friends and family with me...I’d never have to deal with any of these things alone.”"}, {"userName": "Miss_Nelson", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/2293909-miss-nelson", "userReview": "Sophie isn’t the adventurous girl she used to be and neither is her mom. Her mom isn’t interested in much of anything, let alone adventure, since she and Pratik broke up. Even Sophie’s friends have noticed a difference, so when their teacher gives them the risk challenge, they enroll Sophie in a possible adventure. Little do they know that not only is Sophie avoiding anything scary, she is struggling with something even stranger. She is seeing bubbles - the kind they use in cartoons to show what a character is thinking. And all the people in her life are starting to reveal all the “sad, stressed-out things” they are thinking. With the help of a therapist, Sophie sets out to figure out the meaning behind these mysterious bubbles that only she can see. The saying: Everyone you meet is fighting a battle you know nothing about, starts to play out in Sophie’s life. As she works with her two best friends to prepare for their risk challenge, the bubbles reveal information that just might derail their plans. Bubbles is whimsical but genuine realistic fiction. Sophie is a smart, real, imaginative, sensitive strong-willed protagonist with a lot of heart. Cooper explores anxiety, depression, and how to find your way through (with help, of course). Grades 6 and up."}, {"userName": "Ro", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/4678429-ro", "userReview": "Realistic fiction sprinkled with a touch of supernatural will have readers transfixed in Sophie's story. The unexplainable is most believable, in my opinion, when the author allows the reader to just accept it as part of the reality they are sharing together, and that is exactly what Abby Cooper does when Sophie begins to see thought bubbles over people's heads, it just happens and Sophie must deal. Sophie tells us the story in all of the glory of a 12 year-old's mind, thinking fast, going of tangents, circling back to the original thought. As a librarian I know for a fact that this is the way conversation goes among kids this age, and it is delightful to listen to in the library, and to read in this story. This story also offers the beauty and sheer giddiness that waking up to new \"growing up\" feelings, those that develop from I'm-friends-with- everyone, to maybe \"like\" liking someone, feel like, offering readers a mirror to look at and understand these feelings in a comforting manner. The nuggets of wiseness Sophie discovers are presented to the reader as gifts, offered up for contemplation without judgement. Cooper is wonderful at giving readers closure, the last chapters offer a solid promise that Sophie, her friends, and mom will be all right, because they have each other."}], "description": "Twelve-year-old Sophie Mulvaney's world has been turned upside down. Mom lost her job at the TV station and broke up with Pratik, whom Sophie adored. Her teacher is making them do a special project about risk-taking, so Sophie gets roped into doing a triathlon. And to top it all off, she's started seeing bubbles above people's heads that tell her what these people are thinking. Seeing other people's thoughts seems like it should be cool, but it's actually just stressful. What does it mean that Pratik wishes she and Mom were with him to eat dinner? Is her best friend Kaya really going out with their other best friend, Rafael, whom Sophie also has a crush on? And can Sophie's mom ever go back to her old self? In this funny, heartwarming novel, Sophie comes to learn that people are more than what they seem—or what they think.", "title": "Bubbles", "url": "http://www.goodreads.com/book/show/31450699-bubbles", "average": 4.09, "cover": "https://images.gr-assets.com/books/1474386883l/31450699.jpg", "reviews": 69, "authors": [{"url": "https://www.goodreads.com/author/show/13132448.Abby_Cooper", "name": "Abby Cooper"}], "type": ["Childrens", "Fantasy", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/31450699-bubbles", "http://www.goodreads.com/book/show/25689007-sticks-stones", "http://www.goodreads.com/book/show/40126802-how-to-build-a-best-friend"]}