{"ratings": 181, "userreviews": [{"userName": "Sergio Frosini", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/4768530-sergio-frosini", "userReview": "Il BarLume è sempre il BarLume, ma quando Malvaldi si butta nei romanzi storici c'è da fare la ola. Speci se usa come special guest un personaggio come Ernesto Ragazzoni. finito in una sera"}, {"userName": "Luana", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/5860640-luana", "userReview": "\"Buchi nella sabbia\" è il primo romanzo di Malvaldi che leggo: ero convinta di passare prima dagli allegri vecchietti del Bar Lume, che mio padre tanto adora, ma ho poi optato per questo piccolo libro a metà tra giallo e romanzo storico.La vicenda si svolge a Pisa nel 1901 e si divide in tre atti: nel primo, vediamo radunarsi la compagnia teatrale che dovrà mettere in scena la \"Tosca\" alla presenza del nuovo re d'Italia Vittorio Emanuele III. Fin qui nulla di male, se non fosse che ci troviamo in un'epoca dove la tensione è sempre altissima e dove gli attentati messi a segno dagli anarchici a danni a teste coronate o figure di spicco sono quasi all'ordine del giorno...infatti, tra gli ultimi a cadere sotto i colpi delle pallottole, figura anche il nome di re Umberto I. Non mancano nemmeno le vittime tra le file anarchiche, visto che agli inizi del romanzo viene lasciato intendere che Gaetano Bresci, l'assassino del re, sia morto in carcere, in apparenza suicidandosi, ma più probabilmente a causa del pestaggio subito dai secondini. A questo poi si aggiunge il fatto che nella Tosca il potere costituito non ci fa certo una gran bella figura (e ad infiammare ancora di più gli animi ci pensa l'assenza del maestro Giacomo Puccini): insomma, ci sono tutti gli ingredienti necessari per far scatenare di nuovo lo scontro anarchici-monarchici, mettendo seriamente in pericolo la vita del nuovo sovrano. E quando la serata della rappresentazione sembra svolgersi senza difficoltà, ecco che ci scappa il morto...non in platea, ma direttamente sul palcoscenico. La vittima e Ruggero Balestrieri, tenore di indiscusso talento, anarchico militante, ma allo stesso tempo dannatamente egocentrico e pure un po' stronzo. E' morto per via delle sue opinioni politiche? Oppure il movente è un altro?Gli altri due atti del romanzo sono dedicati all'indagine e alla risoluzione della vicenda, oltre a mettere a confronto i due protagonisti, due personaggi agli antipodi che impareranno, se non a comprendersi, almeno a rispettarsi: da una parte c'è Ernesto Ragazzoni, poeta, giornalista de \"La Stampa\", amante della bottiglia e anarchico convinto (senza mai cedere alla violenza), dall'altra il giovane tenente delle Guardie Reali Gianfilippo Pellerey. Il primo, pur essendo raramente sobrio e poco avvezzo a farsi imbrigliare dai pregiudizi e dalle regole, è un ottimo ascoltatore oltre che osservatore, uomo estremamente sincero che non nasconde mai le sue opinioni; il secondo, grande amante della lirica, è molto razionale e si fa forte della disciplina marziale che gli è stata insegnata, pur facendosi fregare dalle sue reazioni. Quando sembra aver ormai perso il controllo dell'indagine, Pellerey potrà contare sull'aiuto inaspettato di Ragazzoni e trovare il colpevole.Non sono molto esperta del periodo storico in questione, ma mi sembra evidente che Malvaldi si sia documentato in maniera dettagliata, rendendo la lettura perfettamente comprensibile anche a chi non ne sa nulla. Lo stesso dicasi per il ritratto che ne esce dell'ambiente della lirica, con le sue rivalità, le paturnie di tenori, soprani e compagnia cantante, la terribile superstizione che permane ancora oggi (niente viola e quanti si fanno la nomea di iettatori, vedono la carriera andare in fumo): di fatto, un mondo a sé stante con le sue regole.Questo è un romanzo che si legge decisamente in poche ore, cosa ulteriormente facilitata dallo stile ironico, irriverente e a tratti spassoso dell'autore che spesso, per rendere più chiare certe usanze di inizio '900, crea dei paragoni con l'epoca contemporanea. Decisamente consigliato!"}, {"userName": "Cristina - Athenae Noctua", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/21213236-cristina---athenae-noctua", "userReview": "Giocando abilmente con l'arte teatrale, di cui mette a nudo meccanismi e vizi, e manipolando le pieghe della storia per farne emergere curiosità e aneddoti divertenti senza farsi mancare una buona dose dell'umorismo che lo ha fatto emergere nello scenario editoriale italiano, Malvaldi regala ai suoi lettori un giallo agile, arguto e piacevolissimo, che riproduce la classe di Odore di chiuso.http://athenaenoctua2013.blogspot.it/..."}, {"userName": "Pupottina", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/21008693-pupottina", "userReview": "1901: complotto anarchico da operettaMarco Malvaldi ha momentaneamente abbandonato l'allegra combriccola del Bar Lume, per dedicarsi ad una altra scenografia. Ha scelto come ambientazione storica la città di Pisa nel 1901. Un contesto storico particolarmente rilevante. La narrazione unisce elementi inventati a fatti e personaggi storici. La rappresentazione della \"Tosca\" a Pisa, con la rumorosa assenza del maestro Giacomo Puccini, fa molto parlare di sé finché non accade dell'altro: l'omicidio commesso sul palco del teatro, mentre ad assistervi vi è, niente di meno che, sua Maestà, il re Vittorio Emanuele III di Savoia. Questi ingredienti, uniti al solito umorismo, all'arguzia dell'intreccio e all'accuratezza con cui Malvaldi ricostruisce il momento storico (1901) e l'ambientazione pisana, decretano questo nuovo successo letterario. È un ottimo lavoro con un tocco di teatralità esplicita, ossia la suddivisione in tre atti. La vicenda narrata, in primo piano, è quella di una sgangherata, quanto improbabile, compagnia teatrale che mette in scena una delle opere liriche italiane più celebri, la \"La Tosca\" di Giacomo Puccini. Nell'atmosfera storica regna ancora l'inquietudine anarchica a seguito dell'attentato di Gaetano Bresci che, come tutti sappiamo, ha ucciso il re d'Italia, Umberto I. Molto probabilmente il destino misterioso dell'anarchico italiano, vittima forse della tecnica punitiva del santantonio, ha aggiunto un giallo storico al giallo teatrale. Mentre lo spettro di un nuovo attentato anarchico si propaga ovunque, anche nel teatro, c'è un bel daffare tra la grande emozione per l'ospite illustre e la paura di un nuovo insuccesso, con conseguente fermento e mobilitazione da parte delle forze dell'ordine e della stampa ufficiale. Essendo un giallo, com'è prevedibile, anche al culmine della rappresentazione teatrale, ci scappa il morto, tra una cerchia colorita e variegata di attori, più o meno improbabili. BUCHI NELLA SABBIA è un ottimo giallo che si legge scorrevolmente e divertendosi.La descrizione dei personaggi è così credibile che più volte viene da chiedersi se Malvaldi non stia raccontando, trasformando in letteratura d'intrattenimento, un fatto realmente accaduto. Malvaldi è tanto bravo che mi sono posta il dubbio ed ho rispolverato i miei vecchi e polverosi volumi di storia senza trovare riscontro. A fine romanzo, però, la finzione emerge con chiarezza, ma questo non cancella la sensazione che alla base della narrazione ci sia stato un accurato lavoro di documentazione. Anche la descrizione del mondo della lirica ai primi del Novecento è particolarmente meticolosa, avvalorata e comprovata, con citazioni e notizie disseminate lungo il racconto. È un libro spassosissimo, grazie all'ottima tecnica narrativa dove le scene si susseguono veloci come in una commedia brillante dai toni farseschi. Si ha la costante sensazione di essere seduti in poltrona a teatro ad assistere all'opera lirica, grazie allo stile intelligente e brioso, ma sapientemente magistrale, da narratore onnisciente di Malvaldi, che ha la capacità di rendere visivamente quello che racconta, confrontando la realtà storica con quella contemporanea."}, {"userName": "Atticus_jem_scout Angela", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/37522449-atticus-jem-scout-angela", "userReview": "Come sempre Malvaldi colpisce nel segno dell'ironia. Un racconto storico satirico ambientato nel mondo dell'opera italiana di inizio '900 con personaggi fittizi inframmezzati a personaggi reali, tutti presi a dialogar tra loro in commedia. La punta di giallo e di mistero è sempre presente e arguta. Gustosissima lettura!"}, {"userName": "Lorenza Alessandri", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/16634627-lorenza-alessandri", "userReview": "Sarà che a me Odore di chiuso non era poi piaciuto molto, sarà che il teatro è il mio grande amore e dovrei dedicarmici anima e corpo, sarà che dopo il libro della Oates avevo bisogno di leggerezza di contenuti e di prosa scorrevole, ma questo libro a me è piaciuto tantissimo."}, {"userName": "Antonella ", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/51389018-antonella", "userReview": "Buonissimo, questo libro! Malvaldi si è superato!"}, {"userName": "Orne", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/9771547-orne", "userReview": "Non un gran libro, anzi... ma gli va dato il merito di avermi fatto iniziare Gaetano Bresci tessitore, anarchico e uccisore di re di Massimo Ortalli, che stava rischiando di passare dallo scaffale dei 'non ancora letti' a quello dei 'senza speranza di essere letti un giorno'. E di avermi fatto cercare le poesie di Ernesto Ragazzoni. E altro ancora...Malvaldi, grazie."}, {"userName": "Vlad Copil", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/15421420-vlad-copil", "userReview": "Divertentissimo romanzo storico-poliziesco per gli appassionati di opera e non solo."}, {"userName": "Drusie's Biblio", "userReviewDate": "Sep 06, 2016", "userURL": "http://www.goodreads.com/user/show/21722993-drusie-s-biblio", "userReview": "You can translate this review on: http://labibliotecadidrusie.blogspot.it/Voto: 5/10Parlare di un libro che ti ha deluso non sarebbe un problema, capita, ma quando lo ha scritto uno dei tuoi autori preferiti, la cosa si complica. Perché se è uno dei tuoi autori preferiti, un motivo c'è e vorresti sempre parlarne bene; perché se continui a leggerlo, significa che è un porto sicuro, che ti aspetti di trovare determinati elementi e, se non ci sono, ti senti quasi tradito. Ed essere traditi non piace a nessuno.Non si tratta di un cambio di genere per Malvaldi, c'è sempre l'omicidio, ci sono sempre le indagini, c'è il giusto livello di intreccio. Ci sarebbero anche l'ironia e la leggerezza, che mi fanno amare la sua scrittura, solo che stavolta non hanno funzionato.La trama è carina: un attore di teatro deve morire per finta in una scena e invece lo fanno fuori davvero. E non per sbaglio.Da lì si dipana l'indagine del tenente regio Pellerey (il libro è ambientato nel 1901), con il vago aiuto di Ernesto Ragazzoni, qui più in veste di giornalista che anarchico.i due si contendono leggermente la scena, ma dal mio punto di vista , il vero protagonista è il tenente, uomo arguto e onesto, talvolta anche simpatico. Ciò che mi ha annoiata, sono stati i continui aneddoti inseriti nel racconto, su eventi accaduti in altri teatri e in altre occasioni. Se l'intento era vivacizzare e far sorridere, nel mio caso è fallito. Li ho trovati inutili e tediosi, buoni solo per allungare il brodo. Anche il modo in cui il caso viene risolto non mi ha soddisfatta: troppi i punti sospesi per buona parte del libro, chiusi poi con una sola botta finale.I personaggi sono sempre carini e ben caratterizzati, con particolare attenzione al tenente Pellerey, che forse è l'unico a cui viene dedicata un po' più di attenzione. Gli altri sono tratteggiati con poche abili frasi che li rendono comunque ben distinguibili l'uno dall'altro, ma secondo me sono troppi in un libro così piccolo. Ho dovuto di continuo far ricorso all'elenco iniziale per ricordarmi chi era cosa. Peccato invece per Ragazzoni, che doveva essere il protagonista (stando alla sinossi) e invece mi sembra relegato in un angolino, tenuto lì solo per fare la mossa risolutiva finale.lo stile è sempre quello, inconfondibile, di Malvaldi. Forse un po' meno toscaneggiante, ma sempre leggero, ironico e canzonatorio. Il fatto che con me stavolta non abbia funzionato, non dipende da un cambio di rotta."}, {"userName": "Alfonso D'agostino", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/37987382-alfonso-d-agostino", "userReview": "E’ definitivo: non fosse bastato “Odore di chiuso”, con un magnifico Pellegrino Artusi protagonista della vicenda, giunge la conferma del talento purissimo di uno scrittore noto per le vicende dell’ormai celebre “BarLume”, eternato anche da una doppia serie su SKY.Ok, sono pronto a sostenere dinnanzi a chiunque che Marco Malvaldi gode di una (quasi) miracolosa capacità di unire giallo, romanzo storico e divertimento letterario come pochi – direi pochissimo – sono mai stati in grado di fare.Con “Buchi nella sabbia” ci trasferiamo nella (sua amata) Pisa, anno 1901: sono ancora nell’aria gli echi delle esplosioni delle “bombe Orsini” nell’attentato a Napoleone III e, soprattutto, l’attentato dell’anarchico Bresci a Re Umberto I. E’ comprensibile dunque che la sicurezza attorno al nuovo sovrano sia ben più stringente, e che la presenza di Sua Altezza (si fa per dire) ad una rappresentazione della Tosca in una delle regioni più bakuniane d’Italia generi preoccupazione. Il Capitano dei Carabinieri Ulrico Dalmasso e il tenente Gianfilippo Pellerey dovranno confrontarsi con un omicidio, che non vedrà vittima il futuro Imperatore d’Etiopia ma una vera star del palcoscenico…Se si dovesse riuscire – e mi rendo conto di quanto sia complicato – a superare il purissimo divertimento nella lettura, sempre a livelli altissimi, sarebbe giusto riconoscere all’autore una impeccabile messa in scena storica: per un appassionato cultore del Novecento come il sottoscritto è quasi immediato, ma da scarso conoscitore del mondo dell’opera e dei suoi protagonisti confesso di essere rimasto assolutamente affascinato. Contribuisce enormemente al successo la figura di Ernesto Ragazzoni, poeta, anarchico anch’esso, alcolista non pentito, ingegno aguzzo e scarsissima capacità di adeguarsi all’ambiente e agli interlocutori. Davvero magnifico.Malvaldi non delude mai, e dico mai.--- http://capitolo23.com/2015/11/23/buch... ---"}, {"userName": "Nicola", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/39519919-nicola", "userReview": "Il secondo giallo storico di Malvaldi è un piccolo gioiello da conservare avidamente, capace di portarci con la mente in un Italia di inizio XX secolo. L'anno è il 1901, siamo al Teatro Nuovo di Pisa: va in scena la Tosca di Puccini, che ha l'equivalente impatto sociale di una partita di calcio ai giorni nostri: ergo, ci vanno tutti. Persino il Re d'Italia, Vittorio Emanuele III, ha deciso di assistere all'opera lirica.La morte del tenore che interpreta Cavaradossi, però, comporterà un'indagine da svolgere per le guardie reali di sua maestà...Dopo il personaggio di Pellegrino Artusi in Odore di Chiuso, qui il vero \"homo ex machina\" è Ernesto Ragazzoni, poeta e giornalista de La Stampa, tanto capace nel suo lavoro quanto sui tavoli delle taverne. Un personaggio intelligentissimo ma allo stesso tempo esilarante - marchio di fabbrica da sempre distintivo di Malvaldi - il personaggio principale di questa storia riuscirà a stupire i lettori alternando dei momenti di puro divertimento con altri di lucidità e risolutezza disarmante.Lo consiglio sicuramente a tutti i lettori di Malvaldi, ma anche a tutti quelli che non hanno mai letto niente del bravissimo scrittore pisano.P.S. A tutti i fan: Alla presentazione del libro, Malvaldi ha dichiarato che continuerà la saga dei Delitti del BarLume. Gioiamo!"}, {"userName": "Baba Bookswife", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/41348939-baba-bookswife", "userReview": "Non ho ancora compreso se Malvaldi abbia fatto un grande e grosso buco nella sabbia oppure abbia scritto un libro geniale: una cosa è certa, questa non è una lettura per tutti. Un linguaggio arcaico e ricercato, terminologie per esperti del settore, piccoli approfondimenti tecnici sull'opera, insomma è un libro che va letto con calma e sopratutto con la voglia di imparare qualche cosa di nuovo, perchè questa il Malvaldi, quel giovane volpone, ci impartisce una bella lezione culturale, oltre al solito giallo celato tra le pagine.Io onestamente ho faticato a portare a termine la lettura, nonostante i personaggi siano simpatici e accattivanti, nonostante la figura del Tenente Pellerey mi abbia colpito...non sono riuscita ad appassionarmi, anzi, ho proprio faticato a buttare giù il boccone. Ma c'è da dire anche una cosa, io e l'opera non siamo sulla stessa lunghezza d'onda, anche questo vorrà dire? Non lo so, io continuo ad amare incondizionatamente Massimo e i vecchietti del bar Lume e la Tosca la lascio agli amanti."}, {"userName": "Cristina Nozzi", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/47838019-cristina-nozzi", "userReview": "What a beautiful book! Malvaldi is a great writer, who charmed his readers with his giallii dialect, but then, he managed to keep the promise of his talent even venturing to the historical genre books like this. a book that entertains from the first page, which comquista, which clings to the reading, which meets from cover to cover. a story set in rinasciento, and who can fully convey the sense of time in which it takes place, without being unnecessarily posdatato. There are those books that you wonder why they have set in the past, that so much where they put it was still bad. This no. this is perfectly inserted in the era, from the feeling of the imminence of the facts mentioned, it adapts to the period. Read it. the first time in one breath, perhè goes down easily. the second slowly, enjoying every page. or do as I do, read it out loud to someone, to give prominence to the characters. He never fails to bring a smile."}, {"userName": "Federico Bonato", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/51009424-federico-bonato", "userReview": "Un bel romanzo , la scrittura è quella nota di Malvaldi: divertente, mai banale e ricca di spassose metafore . Il romanzo storico, dopo \"Odore di chiuso\", è un genere che pare divertire molto lo scrittore e anche il lettore. Un po' debole la struttura dell'indagine e del giallo, ho avuto l'impressione che stia un po' in piedi con le stampelle. Forse , e correttamente, è stato dedicato più tempo alla ricostruzione storica che al giallo in sé."}, {"userName": "Cristina", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/22024257-cristina", "userReview": "Divertente. Non straordinario forse, ma sicuramente divertente. A leggerlo sembra che si sia divertito pure l'autore nello scriverlo ed è sempre un plus.Purtroppo la parte gialla è davvero debole debole, ma dubito che questo romanzo possa passare per un giallo, e chi legge Malvaldi non credo lo faccia per l'investigazione ma per l'ambientazione e i personaggi che in questo caso sono davvero molto ben riusciti.Consigliato."}, {"userName": "Francyy Barontini", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/14489857-francyy-barontini", "userReview": "Non ho messo la quinta stella che ritengo vada concessa solo ai capolavori, ma si tratta comunque di un libro molto interessante, ben scritto, ironico, colto, variegato, originale. Il miglior libro di Malvaldi, di cui ho letto quasi tutto, ma che mi stava un po' annoiando con le storie del Bar Lume. In questo i messaggi non sono banali così come i personaggi. Da gustare fino all'ultima pagina."}, {"userName": "Barbara MrsTeapot B", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/13139293-barbara-mrsteapot-b", "userReview": "3 stelle e mezzo, in realtà.Malvaldi è sempre piacevole, scorrevole e divertente. Bella l'idea, ma la trama gialla in sé non è niente di particolare, anzi.Indispettita dalle continue spiegazioni del prevenuto autore a favore del - cito - \"lettore medio\". Malvaldi si è ben calato nel ruolo del maestrino.Nel complesso una piacevole lettura."}, {"userName": "Baldurian", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/20606755-baldurian", "userReview": "Nonostante i presupposti remassero contro questo romanzo (se c'è una cosa che odio è la lirica) devo ammettere che Malvaldi con Buchi nella sabbia ha confezionato un giallo più che discreto: buoni i personaggi (Ernesto Ragazzoni su tutti), indagine avvincente e più di un tocco umoristico ad alleggerire il tutto. Lettura piacevole."}, {"userName": "Elena", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/40149504-elena", "userReview": "A tratti sembra di leggere \"L'affare Vivaldi\" di F. M. Sardelli, ma a parte questa impressione di dejà vu, ci si tuffa volentieri in questa simpatica gazzarra di cantanti, impresari, anarchici e carabinieri. Il meccanismo del giallo viene comunque eclissato dall'esilarante carosello di tipi umani, ricostruito su basi storiche solide e accuratamente documentate."}, {"userName": "incipit mania", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/22017602-incipit-mania", "userReview": "IncipitNessuna situazione come l’opera è in grado di passare in un attimo dal commovente al ridicolo, se il destino ci si mette di mezzo........Buchi nella sabbia incipitmania.com"}, {"userName": "Barbara Valotto", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/27316425-barbara-valotto", "userReview": "Primo libro di Malvaldi che ho letto e devo dire che l'ho trovato esilarante e piacevolissimo, forse solo il finale non proprio all'altezza del resto della trama. Comunque lo consiglio e sicuramente leggerò altri testi di questo autore!"}, {"userName": "Cerlienkus", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/16671525-cerlienkus", "userReview": "Mi piace la scrittura di Malvaldi e come riesca ad intrattenere il lettore anche con storie a sfondo storico utilizzando personaggi realmente esistiti e personaggi fittizi mettendoli insieme e rendendo il tutto estremamente credibile."}, {"userName": "Valentina Accardi", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/31706522-valentina-accardi", "userReview": "Mi sono divertita un sacco, ma che ve lo dico a fare? :D"}, {"userName": "ao", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/13187988-ao", "userReview": "Storiella leggera, spensierata e ben documentata, ma che mi ha fatto pensare con nostalgia ai vecchietti del BarLume. In quei romanzi, sì, che le battute hanno un suono spontaneo."}, {"userName": "Nicoletta Giordana", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/34389963-nicoletta-giordana", "userReview": "Qualche battuta esilarante degna del solito Malvaldi ma la storia lenta e macchinosa...un po' una delusione!"}, {"userName": "61pat", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/4808104-61pat", "userReview": "Un simpatico siparietto ambientato all'inizio del novecento. Piacevole alla lettura, soprattutto per gli appassionati di opera (non sono tra quelli)."}, {"userName": "Agnese", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/10350400-agnese", "userReview": "Era dai tempi di \"A volte ritorno\" che non ridevo così di gusto leggendo un libro. Ci vorrebbe un libro di Malvaldi a settimana!"}], "description": "Come in 'Odore di chiuso', Malvaldi ci racconta a suo modo un grande personaggio della letteratura italiana. Lì Pellegrino Artusi, l’inventore della cucina italiana. Qui Ernesto Ragazzoni, anarchico poeta amante della bottiglia.Pisa, settembre 1900. Per festeggiare l’arrivo del nuovo Re d’Italia, Vittorio Emanuele III, il quale ha deciso di visitare per la prima volta la tenuta reale di San Rossore, viene deliberato di dare in suo onore, nel teatro della città, la nuova opera del Maestro Giacomo Puccini, il quale condivide con il Re la passione per la caccia nelle tenute dintorno a Massaciuccoli. Purtroppo, l’opera in questione è Tosca, melodramma franco italiano dai forti contenuti politici, che dileggia il potere costituito. Rappresentare Tosca in faccia a Sua Altezza, il quale è salito al trono dopo che Gaetano Bresci ha crivellato il suo augusto genitore, Umberto I, appena due mesi prima, potrebbe creare dei problemi: tanto più se il ruolo di Cavaradossi viene affidato a Ruggero Balestrieri, tenore dall’ugola d’oro e soprattutto noto come anarchico militante. A seguire l’evento, che rischia di accendere gli animi, viene mandato da Roma come corrispondente Ernesto Ragazzoni - poeta, traduttore, giornalista anticonformista dell’Italia umbertina, dotato di un umorismo trasgressivo e controcorrente -, dal bicchiere facile, il quale farà amicizia con vari membri della compagnia, con alcuni simpatici cavatori carrarini che, tra un capitello e l’altro, cacciano di frodo nella Reale Tenuta, e soprattutto con gli osti della zona, nell’attesa della prima rappresentazione. Rappresentazione nel corso della quale il tenore verrà fucilato sia come Cavaradossi che come Balestrieri: qualche ignoto, infatti, pare abbia caricato uno dei fucili di scena destinati all’esecuzione con proiettili non troppo a salve. La morte del Balestrieri, fucilato alla presenza del Re, rischia di far scoppiare una rivolta: se non fosse che il Ragazzoni è testimone di cose che porteranno alla soluzione del caso, come avviene in tutti i gialli che si rispettino.", "title": "Buchi nella sabbia", "url": "http://www.goodreads.com/book/show/27463592-buchi-nella-sabbia", "average": 3.67, "cover": "https://images.gr-assets.com/books/1446731771l/27463592.jpg", "reviews": 32, "authors": [{"url": "https://www.goodreads.com/author/show/4276587.Marco_Malvaldi", "name": "Marco Malvaldi"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27463592-buchi-nella-sabbia", "http://www.goodreads.com/book/show/27478830-buchi-nella-sabbia", "http://www.goodreads.com/book/show/9076862-la-briscola-in-cinque", "http://www.goodreads.com/book/show/9454013-il-gioco-delle-tre-carte", "http://www.goodreads.com/book/show/9549169-il-re-dei-giochi", "http://www.goodreads.com/book/show/13410752-la-carta-pi-alta", "http://www.goodreads.com/book/show/10443134-odore-di-chiuso"]}