{"ratings": 419, "userreviews": [{"userName": "Kathleen", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/891502-kathleen", "userReview": "My review for the Chicago Tribune: http://www.chicagotribune.com/lifesty...Most people probably know that the word “bunk” is short for “bunkum,” meaning insincere talk, claptrap or humbug. Fewer people are likely familiar with the word’s etymology, coined out of racial unrest in 1820 in relation to the Missouri Compromise, which admitted Missouri as a slave state. That year, on the floor of the 16th Congress, even though an immediate vote had been called, North Carolina Rep. Felix Walker insisted on filibustering in favor of Missouri’s slave state status in the name of Buncombe, his home county.If there’s bunk around, then it probably needs debunking, and Kevin Young does the job admirably in “Bunk: The Rise of Hoaxes, Humbug, Plagiarists, Phonies, Post-Facts, and Fake News.” Drawing on incidents and etymologies such as the one above, he anatomizes the lengthy American and international history of entertaining deceptions — from P.T. Barnum to Rachel Dolezal, from Edgar Allan Poe to Nasdijj, from the Hitler Diaries to Jerzy Kosinski — and does so in a way that reveals and critiques the racist underpinnings of many such notorious fabrications.Young acknowledges various European hoaxes while raising the central question: “Is there something especially American about the hoax?” Exploring the answers, he continually returns to the multifarious ways in which “an eighteenth-century Counter-Enlightenment, with its mistrust of science and history of hoaxes, could actually join with the Enlightenment and its love of systems to spawn the pseudosciences of the nineteenth century — particularly those that sought to create not just taxonomies but hierarchies between the races.”Young — the author of 11 collections of poetry, as well as the nonfiction book “The Grey Album: On the Blackness of Blackness” — serves as the poetry editor of The New Yorker and the director of the New York Public Library’s Schomburg Center for Research in Black Culture. His copious research, his talents in literary analysis and his associative skills as a poet are on acrobatic display as he argues convincingly that the hoax is all too often an underrecognized mechanism for maintaining white — and to a concurrent extent, male — supremacy.He writes, for instance, about Joice Heth, the black woman that P.T. Barnum exploited for an act in 1835 in which “she pretended to be George Washington’s nursemaid, which would have made her 161 years old,” and points out later how, “Simultaneously celebrated and denigrated, often through the very body she supposedly nurtured and wet-nursed with, Heth stands as one of a long line of black women forced to prove their womanity.”Throughout, Young makes elucidating comparisons across the ages, such as how the “penny press,” which fanned the flames of hucksterism in the 1800s, finds its parallel in the internet today insofar as “it too implements chaos as a going concern.” Or how the fraudulent “girl wonder” Opal Whiteley — who self-published “The Fairyland Around Us” at 22 and “dressed as an obligatory ‘Indian’ ” in the 1920s — has her parallel in the plagiarism case of novelist Kavya Viswanathan in the early 2000s.Admittedly, hoaxes are a shaggy subject, yet one wishes that Young’s book were a bit more trim, as he turns and returns to subjects across chapters in a nonlinear and at times perplexing and repetitive fashion. As a result, brilliant as its parts are, Young’s book as a whole comes off as less of a spotlight illuminating its dim-by-design subject in a cohesive glow and more of a sparser set of Christmas lights — bright spots placed along a strand with perhaps a bit too much murkiness in between for the pattern to come through as clearly as might be desirable.Nevertheless, his profound assertion that “the hoax changes history and also the future” shines through; he writes: “It’s the worst kind of twofer: the hoax is ultimately a matter of life and death.”Young’s groundbreaking study of spectacles and spectacular falsehoods reaches its audience roughly one year after the election of Donald Trump. Obviously, Young was hard at work on this book well before it became clear that a man who routinely denigrates minorities and women and blithely dismisses inconvenient aspects of reality would hold the highest office in the United States.Although the book doesn’t center on the Trump presidency, Young does analyze how significant portions of Melania Trump’s 2016 Republican National Convention speech were stolen from Michelle Obama’s 2008 speech at the Democratic National Convention, and how Mrs. Trump’s status as an immigrant from Solvenia was “championed in a way the candidate would explicitly deny Muslims and Mexicans.”As we enter the second year of the Trump administration — with its railing against “fake news,” its failure to unilaterally condemn white supremacists in Charlottesville and its assertion that climate change is itself a hoax perpetrated by the Chinese — this book could scarcely be more timely or useful."}, {"userName": "Audacia Ray", "userReviewDate": "Dec 16, 2017", "userURL": "http://www.goodreads.com/user/show/259202-audacia-ray", "userReview": "Kevin Young’s book is an exhaustive (and sometimes exhausting) chronicle of the American history of hoaxing. He details many, many hoaxes and highlights the racist dimensions embedded in many of them - because the history of American bad behavior is always a history of racism. The book is dense stuff, injected with Young’s humor, and sometimes I found myself wishing that his editors reeled him in a little, but then a chunk of pages later I would understand why he was including alllllll the things. Really worth the investment of time to work through."}, {"userName": "Tony", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "BUNK: The Rise of Hoaxes, Humbug, Plagiarists, Phonies, Post-Facts, and Fake News. (2017). Kevin Young. ***1/2.I have to admit up-front that I did a lot of skimming while reading this book. It was not that the book was poorly written or uninteresting, instead, it was caused by the determination of the author to get absolutely every example of all “Bunk” into his study. After a while, all of the examples began to sound the same. I have to admit that the author certainly did his homework, and presented enough examples to keep most all curious readers happy. As opposed to being a book for the general reader, this work falls into the category of An Encyclopedia of Bunk. It’s good to have at hand if, and when, the subject of Bunk in any of its forms arises. The author’s palette was wide; he was able to jump around in time and to a variety of “bunk performers.” After tens of examples of the various types of bunk, I found myself ready to push on to the next page."}, {"userName": "Stephanie", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/8370061-stephanie", "userReview": "Fascinating (and possibly reassuring) look at the American history of faking it when it comes to information. Definitely not for the casual reader -- the book is dense, full of footnotes, and delves deep -- it is nevertheless quite a ride into the unbelievable."}, {"userName": "Grace Tenkay", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/42272445-grace-tenkay", "userReview": "History, written in a fairly entertaining way."}, {"userName": "Peter Mcloughlin", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/16212136-peter-mcloughlin", "userReview": "Kaleidoscopic and wide-ranging but also rambling and unfocused. Young makes a myriad number of points and passing observations about hoaxes, race, history, otherness, conmen, hoaxing, default attitudes in America and elsewhere that play into hoaxers who tell us a story tailored to our preconceptions which revolve around ourselves, our place in the world, and the other. Young uses the idea of a hoax to talk about its place in our culture and its intersection with ideas about race and assumptions about whites and nonwhites. Often hoaxes are about exotic others (think PT Barnum or the wild west shows of the 19th century) who are funhouse mirrors of ourselves. The book offers many incites and even brings the reader up to date on the bunkum we swallow in the age of Trump. I gleaned many things from this although I wish it was a little less rambling."}, {"userName": "Mike", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/625994-mike", "userReview": "Our critical faculties seem neutralized by the lie we are ready to swallow. Bradlee said it: Beware of the lie you want to believe. The old ones are funny; the current ones are terrifying."}, {"userName": "Russell Fox", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/4729679-russell-fox", "userReview": "Kevin Young's Bunk isn't, itself, \"bunk,\" but there is a whole lot of posing and pretense in this long, ruminative, and ultimately unsatisfying study of \"hoaxes, humbug, plagiarism, phonies, post-facts, and fake news.\" Young is a poet, and so very often he gets caught away in waxing clever or lyrical about some act of fakery that he is recounting, rather than carefully explaining and critiquing it. The first several chapters work pretty well; for a while, it really seemed as though Young was developing an actual critical thesis, as he used P.T. Barnum and a plethora of 19th-century and early 20th-century examples of side-show attractions and carnivalesque nonsense to distinguish (as Barnum himself did) between \"humbug\" and outright lies, as well as tie the often-denied-yet-still-constant American affection for (and expectation of) fakes, outrage, and spin to our complicated (and just as frequently denied) racial and sexual suspicions and curiosities. But in order for this critical work to hold, Young would need to be stylistically consistent and thorough in his treatment of ridiculous tabloid stories, pretend mediums, and imposters of numerous sorts, and he wasn't, especially as the book went on. Frequently he'd jump from one con man to another act of forgery, and there wouldn't even be a minimally required amount of historical information to know who or what, exactly, we were talking about. In the end, Young's immense amount of research into this topic was obvious (the old playbills, news photographs, and drawings throughout the book are a delight), but while he obviously thought his presentation of it all added up to something, it didn't. Often--especially once he starts looking at literary plagiarists--it seems fairly event that Young is more interested in settling scores than anything else (his statement--for which he acknowledges his debt to Seinfeld--about Laura Albert, who punked much of America's sensationalist, low-brow literary set with her stories as \"JT Leroy,\" is probably the truest thing in the book: \"it offends me as a writer\"--pg. 214). I learned a lot of trivia from the book, but I would have preferred, instead of the giant info dump, he'd really honed his arguments--or, failing that, he scrapped the huge sprawling mess in favor of some free-form which touch on the topic in a personal way (his chapter on Rachel Dolezal, the white woman who has apparently convinced herself--and long convinced others--that she is black, \"Blacker than Thou,\" is written in this manner, and it's the best chapter in the book)."}, {"userName": "David", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/1532226-david", "userReview": "Required reading for anyone who reads critically, writes for publication and/or academic credit, or creates in any artistic genre and performs/exhibits her work for public audiences."}, {"userName": "Lance", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/20977929-lance", "userReview": "I really wanted to like this book. It seemed like something George Carlin might write if he had the inclination to become a conventional scholar rather than a stand-up comedian. But the more I read the book, the more aggravated I became. The book is split between insightful commentary and pretentious nonsense. Bunk has a great core idea: the way in which hoaxes play on our preconceptions, especially preconceptions about race, but muddles that idea with tortuous prose, pedantic digressions, and logic that is occasionally faulty and even hypocritical. Young’s prose—the first distraction one notices—is dense, and stuffed to the breaking point with plays on words, coinages, and taxonomies that Young means to reveal subtle shades of meaning, but these strategies prove pedantic and eye-roll-worthy slightly more often than insightful. I can understand this approach to a point, given that Young is a poet first and historian second, but when you’re writing a non-fiction book, the aim of which is to provide some hard-nosed Truth with a capital “T,” then your prose ought to be as lucid and direct as possible. As aggravating as this can be, I could stand it a whole lot better if the logic embedded in the prose were still solid, and sometimes it is, but other times Young obfuscates his point with meaningless digressions. My least favorite example occurs when Young weighs in on how to maintain the numerous bumps that journalistic integrity has suffered in the past few years. Young describes, among others, the scandal surrounding the “Jimmy’s World” story by Janet Cooke for The Washington Post—a story about a black teenager addicted to heroin who turned out to be a fabrication of Cooke’s. Young has several good things to say in this section about how good journalism can be cultivated and maintained. The argument flags, however, when he tries to offer an elaboration on the remarks Benjamin Bradlee—the famous Washington Post editor who oversaw Carl Bernstein’s and Bob Woodward’s coverage of the Watergate scandal—makes in his memoir: 'It should be said that this, like most journalistic hoaxes, was ultimately discovered by other journalists. As Bradlee says in his memoir, “The fact is that the truth does emerge, and its emergence is a normal, and vital, process of democracy. If readers are generally too impatient to wait for the truth to emerge, that is a problem. It is our problem in the press. It is far easier and more comfortable for them to accept as truth whatever fact fits their own particular bias, and dismiss whatever facts misfit their biases.” Such biases are why objectivity became a standard in the first place, and, inasmuch as they threaten the accuracy I would advocate instead, I can see why objectivity remains necessary.'Neither in the preceding nor subsequent paragraphs does Young clarify what the difference between accuracy and objectivity is. One can speculate that objectivity is merely a state of mind, and that accuracy is the desired result from objectivity. Maybe it makes sense to emphasize that objectivity is only desirable insofar as it produces results, but it pretty much goes without saying that accuracy is the desired result of objectivity anyway, so there was no need to make the distinction in the first place.Occasionally Young’s interpretations can even prove slightly hypocritical. Among the exhaustive set of terms Young uses to describe the false sense of reliability on which hoaxes hinge is the term, “truthiness,” which he borrows from Stephen Colbert. It’s a great way of stating the frame of mind that hoaxes prey on and reinforce. Not long after introducing this term, Young brings up Tim Barrus, who, under the pseudonym Nasdijj, published three memoirs that depicted his struggles as a Native American. Inquiries by real Spokane-Couer d’Alene-American writer Sherman Alexie would unmask Barruss as white, and his memoirs as not only fabricated, but largely plagiarized from Alexie’s work. Young then goes into a digression about Barruss’s plagiarizing the pain, not only of Native Americans, but of Vietnam War Veterans as well. HE comments on the long history of phony veterans as detailed in the book Stolen Valor, which points out how many of these pretend soldiers used the character of John Rambo as a template for their fabrications. On the subject of why Rambo would have special interest for Barruss specifically, Young has this to say: “Rambo is not only a lost warrior but a symbolic white-Indian survivalist, greased up in militant blackface, out for revenge.” This is the point where Young goes just a little too far, to the point where he himself falls prey to truthiness. Just because John Rambo greases up his face and hides out in the woods, does not automatically make him a symbolic white Indian. I can understand that a highly trained green beret and a nineteenth century Native American would have many overlapping survival skills, but knowing how to survive in the woods is not an exclusive Native American domain; it’s part and parcel of any special operative’s training, and helps to keep them alive in dangerous situations. I can also understand that the face camouflage Rambo uses might call up unfortunate associations with minstrelsy, but facial camouflage was likewise not created in order to ape blackface; facial camouflage is also a completely utilitarian practice designed to protect someone’s life in combat.Young delves even further into this misguided tangent, using the protagonist from Hunger Games, Katniss Everdeen as an example of a white-Indian. He cites the image of her running through the woods with a bow, and her olive-skinned complexion, as author Suzanne Collins describes her, as evidence. But olive skin isn’t used to describe Native Americans. It’s used to describe someone from the Mediterranean region, and given that Katniss is actually a name for a plant whose Latin genus comes from Sagittarius—the archer from Greco-Roman myth—a far more convincing argument could be made for her being Greek or Italian in heritage, though neither the books nor the films explicitly say. When Young fails to dig deep enough to make these distinctions one can’t help but feel that he has his own weakness for the truthiness that he condemns: jumping onto something that supports his argument simply because it feels like it could be true, and not necessarily because it stands up under dispassionate scrutiny. All these shortcomings are actually all the more aggravating not because the book contains nothing but drivel, but because there are actually some very insightful and persuasive passages. It just sucks having to wade through so many bad puns and illogical leaps in reasoning to get to them. The passages on Nasdijj, the fake Navajo—Rambo and Katniss drawbacks notwithstanding—has great comments on how Barruss’s dishonesty served his own financial gain partially by drawing attention away from real Native American experience. Another great section involves the “memoir” of Marlo Morgan, whose book, Mutant Message Down Under conveniently makes use of Aboriginal people as a means for the spiritual enlightenment and financial gain of a white author, while completely ignoring the activity of real Aboriginal Rights groups in Australia. It’s upsetting because Young’s shortcomings here don’t undermine his book so much as bury it under a mass of self-indulgent, under-edited bloat. There are topics here that are explored insightfully, and I can at least tip my hat to Young for the scale of the book’s ambition, and the several good book recommendations I got out of it from his bibliography. Plunge in if you dare, but be prepared for a frustrating read.Final Score: 4.5/10"}, {"userName": "Jason Diamond", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/3967512-jason-diamond", "userReview": "A masterpiece. How do you get this into the hands of every high school student?"}, {"userName": "Samantha", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/15900550-samantha", "userReview": "3.75 stars. A lot of mixed feelings here, but reading this was overall a very positive, thought-provoking experience. There is so much research here about the history of hoaxes, and the (not) surprising thing is how much all the fakery is steeped in race and racism. That this book looks at hoaxes through a racial lens really elevates it to the \"essential reading\" category and provokes a more nuanced discussion of the subject. I think there's something in here that will interest everybody...personally, I enjoyed the later chapters on journalism and literature.That said, Bunk is not at all a casual read. It caught my eye mostly because of my interest in Kevin Young's work as a poet...also because it's called Bunk, how can you not want to read a book with that kind of title? In any case, I kind of jumped into it on a whim and wasn't altogether prepared for the undertaking. The subject may suggest a fun, pop-psychology leaning, but this book is long and sort of dry and dense as hell. I'm never one to shy away from big books, but a stronger editorial hand would have benefited Bunk - cutting down on less relevant information, structuring it in a less scatterbrained way, and yes (sadly) correcting typos. It's painfully obvious, for instance, that the chapter on Rachel Dolezal was a last-minute addition, as it's stylistically and formally inconsistent with the rest of the book. Dolezal is definitely a vital addition to this conversation, and Young's commentary on her is otherwise on point.So, tl;dr, I enthusiastically recommend this book for its cultural and historical relevance and intrigue, but be prepared to commit to some heavy lifting."}, {"userName": "Christopher Saunders", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/13546014-christopher-saunders", "userReview": "Kevin Young's Bunk is an engaging, exhaustive, if somewhat overdone look at the history of American hoaxes and frauds. The book's scope and breadth are commendable; rather than the expected catalog of deceit and misdeeds, Young manages to weave a narrative from incidents as disparate as the Cardiff Giant, Feejee Mermaid and Cottingley Fairies through Jayson Blair, Rachel Dolezal and Donald Trump. Young leans very heavily on sociological analyses of his assorted hoaxes, especially how such swindles reflected and exploited the racial sentiments of their respective times, which works in some instances but seems farfetched in others, as if cramming disjointed things into his thesis (can you really say, for instance, that the Fairy photographs were embraced for exemplifying \"white innocence\"?). Still, the positives of his analysis outweigh the drawbacks, making for an enjoyable book."}, {"userName": "Andre", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/5321728-andre", "userReview": "I know it’s not a good way to start a new year, but I couldn’t maintain a consistent interest in reading this book. I was initially interested in learning about hoaxes, humbugs and such, but the dense ness of the material along with the bland presentation left me sapped Of energy and initiative and the end result is this is the second book to land on my did-not-finish list."}, {"userName": "Peter Landau", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/861304-peter-landau", "userReview": "America's fetish is having the wool pulled over its eyes. We love it. Kevin Young’s exhaustive study BUNK: THE TRUE STORY OF HOAXES, HUCKSTERS, HUMBUG, PLAGIARISTS, FORGERIES AND PHONIES begins with the more benign Barnum and ends with Trump, the real cancer on the presidency. In-between the history of a young country making up its own myths turns darker. Scratch America and you’ll find racism, which Young sees as the engine driving all the examples he cites, from the obvious to the obscure. It’s hard not to agree with his manifesto. Racism is as American as apple pie and the one founding father of our country who stands not wholly hidden in the shadows of our history. True as this might be, I’d have found it myopic if Young didn’t include other races, women and Jews in his book. The subject matter isn’t unique to the United States, of course -- pranks likely predate language -- but Young’s focus is on the New World, so it’s only right that race is the target of his investigation. Young is a fine writer, and even when he gets a bit punny, his point is never less than learned and insightful. Even when I found myself at odds with some of his conclusions, I had to step back and contemplate my own innate prejudices and if they were unconsciously guiding my decision. That’s young’s persuasive talent, and it ain’t no joke."}, {"userName": "Jennifer", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/1924321-jennifer", "userReview": "Kevin Young recounts a history of hoaxes in the United States from P. T. Barnum to the present day, delving deep to look at ways in which hoaxers have influenced events, ideas, and even society as a whole. It's a thoughtful, complex book, one that often points out hoaxes which reinforced racial, gender, and other forms of inequality. Young's work verges on the poetic at times, a book that would be worth a second or third read to really absorb all the details and ideas."}, {"userName": "Greg", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/39346323-greg", "userReview": "Hoaxes are \"like porn: the goal of the hoax is to see just how long you can keep it up\" writes Young. The author takes an encyclopedic approach (often long and dry passages) and gives us a catalogue of the biggest and best hoaxes ever: in other words, the ones we liked most. If you're looking for a rant against certain media outlets or today's politicians, you won't find it here. Young aims at those who \"collaborate with the hoax, and collude with it; the hoaxer just gets there first, making unwilling conspirators of us all.\" Young's final words are hopeful: \"The facts are on our side; let's hope the fictions once again will be too.\""}, {"userName": "Paul", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/2579781-paul", "userReview": "I decided to give up on this after a few chapters. There are a few interesting tid-bits, but this primarily feels like a book that re-interprets all hoaxes through the lens of race relations, which was not really what I signed up for, and doesn't seem amazingly elegantly done, to be honest. I may return to this later."}, {"userName": "Jon Pentecost", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/57920484-jon-pentecost", "userReview": "This book is a hoax.Or more properly, a humbug. A humbug was one of those circus sideshows (like a Feejee Mermaid, a missing link that was actually a black man from Chicago with his hair done strangely, or alien remains that were actually a cow fetus). A humbug claimed to be something other than what it was on the outside, in order to lure the crowds in. But even if you could spot the humbug, you were glad you came, because it was entertaining.In the same way, Young's book is presented as a history of hoaxes, plagiarism and the like. But it is more of a collection of meditations on different hoaxes and scams throughout the last couple hundred years. It is well researched, but it is markedly different in its feel and texture from a standard historical work. He is less concerned with full-orbed analysis as he is drawing out the implications of these events on two areas in particular that Young deeply cares about (race and perceptions of race, and writing and creativity). Young doesn't so much build arguments as his analysis of these events, but makes cleverly worded assertions. It is a book of poetry masquerading as prose.So it was not what I expected it to be. That said, I am glad I came for the show. Though Young didn't provide many answers in terms of cultural analysis, he did provoke many questions. I learned from his perspective on these issues. He provided a clear image of how institutions in America (even institutions of entertainment) feed off of racial stereotypes (though he didn't so much explain why that might be, as much as convey outrage at the fact). And he certainly ably conveyed the danger of a 'post-truth' society in his later chapters. Interesting book."}, {"userName": "Kathleen", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/47188780-kathleen", "userReview": "National Book Award for Nonfiction Longlist (2017). I want a gold star for finishing this book! It is written in what the Washington Post calls a “knotted, clotted style”. He seeks to include an almost encyclopedic litany of hoaxes starting with P.T. Barnum’s display of Joice Heath, claiming that she was the 161-year-old nursemaid to George Washington, and ending with some of President Trump’s biggest lies. The trouble is that Young’s writing circles back again and again to certain examples. He often expounds on various hoaxes with what I would refer to as “academeeze” that defies meaning altogether (eg., “Plagiarism is anxiety about anxiety”). Indeed, Young would have benefitted from some strong editing, [but likely difficult to enforce when the author is already a well-regarded poet].What Young does accomplish is to make me more skeptical and cynical than I already am. With fewer people keeping daily journals; autobiographies rely on faulty/reimagined memories. Reader beware! Authors of hoaxes often spin tales that can’t be fact-checked—they author tales in far-flung locations or in communities that fact-checkers have a difficult time entering. Or they steal their stories from others, and just do a better job of garnering publicity than the original author. There is often a racial tinge to hoaxes—remember Susan Smith’s claims that a black man killed her two children when he carjacked her car—when she was the actual murderer? What the hoax does do, is play on our existing predilections of belief; proving to be stronger than facts. A sorry state, indeed!"}, {"userName": "Nathan Dehoff", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/17551422-nathan-dehoff", "userReview": "This was a Christmas present that I just finished reading, and it's a fascinating read, but kind of all over the place in what it covers. That's not really bad, but it makes it difficult to sum up the whole thing. Young comments on various hoaxes throughout history, starting in the time of P.T. Barnum and continuing to the present. These include plagiarized works and falsified memoirs, including the Howard Hughes biography and the Hitler Diaries, as well as more recent fakes like James Frey and Rachel Dolezal. One theme running throughout is that of race, how many hoaxes of the sideshow variety were based around the notion of non-white people as mystical and exotic yet still lesser, and how more recently it's often a case of people making up stories that perpetuate racial stereotypes. It was interesting that the fake rumor that white people were beaten up just for going to the theater to see Black Panther came about as I was finishing this. Other people sold work by claiming to belong to minority groups that they really didn't, or just making up stories of encounters with exotic cultures. Young frequently comes back to the idea that, while it's easy to dismiss such forgeries as harmless fun (and, indeed, many of them are rebranded as fiction once the falsehood is uncovered), they can belittle the experiences of others. Another point made is how hoaxers often include clues in their work as if they really WANT to be found out, and are frequently quick to denounce or expose others doing the same basic thing. Barnum, for instance, wrote a book called The Humbugs of the World while still perpetuating his own humbug. But another part of Barnum's appeal, and that of others who have followed him, is that they make anyone who is able to see through the deception feel smart. Young considers this aspect to be less common in the modern age, with people like Donald Trump more or less suggesting that the truth is totally irrelevant, rather than just something that can be played with."}, {"userName": "Neil Griffin", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/4224212-neil-griffin", "userReview": "This is one of my favorite non-fiction books I've read in the past few years. It advances an original thesis about hoaxes, one which had been sitting in front of my face my whole life but I'd never really thought of, and elucidates it through entertaining examples and very impressive prose.His thesis that the history of the hoax and its cousins, like plagiary and fake memoirs, from Barnum to James Frey, have been one with race at its core. In example after example he shows the similiarities and patterns between these hoaxes so clearly that by the end the reader feels like she could be an expert dehoaxing a new huckster on the scene. Kevin Young obviously has fun with this book: as a fantastic poet he knows how to string together sentences on the micro level, but also shows the skills of a historian in putting together the book on a macro level. I have no idea how many years and how much research he had to do to put this together, but it had to be a crazy amount. But, although the book is fun, there is a sadness and tragic element that comes through it. The hoax, he shows, has done so much to advance the junk science of race and to steal perspective from disadvantaged populations by pretending to be them. Like the journalist who makes up characters to show how it is to live with crackheads or James Frey who invents an illiterate black inmate named Porterhouse, \"because he says he's big and juicy like a fine ass steak\" so that Frey can heroically teach him how to read through literature. These cliches and stereotypical characters are the bread and butter of the hoax and show no signs of abating. To sum up, read this book and then buy me a beer for making such a good recommendation."}, {"userName": "Dan", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/180438-dan", "userReview": "This is a dense read, but Young does excellent research throughout. He's a poet by nature so his prose and style of writing can be all over the place, but he finds ways to weave smaller examples and stories into his larger points. The chapters on Stephen Glass, Jayson Blair, and JT LeRoy are especially great. I would recommend reading this one slowly, a chapter at a time."}, {"userName": "Jazz Fan", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/42273227-jazz-fan", "userReview": "This was good, but too detailed. Exhaustive and thorough, I'll give it that. I give it four stars, could have been a five star with better editing."}, {"userName": "SibylM", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/1093736-sibylm", "userReview": "3.5 stars"}, {"userName": "Patrick Book", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/16384639-patrick-book", "userReview": "Easily one of the most thorough, fascinating cultural analyses I’ve ever read. Amazing!"}, {"userName": "Hannah N", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/40006334-hannah-n", "userReview": "This was a required book for my English class, but I found it fascinating. This book gives some context and history to our modern perception of fake news."}, {"userName": "NC Wilson", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/42358812-nc-wilson", "userReview": "A deep dive into American history through the lens of hoaxes and lies. Well-researched and dense, it could have benefited from more editing. Sometimes enough is better than plenty."}, {"userName": "Diogenes", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/31907708-diogenes", "userReview": "Fascinating essays on how we can all be susceptible to clever, appealing and seemingly magic ways to take advantage of the unsuspecting, the greedy, and the even the skeptical. Tends to be pedantic and moralistic with overly long commentaries that accompany the hoaxes and cons."}, {"userName": "Kathryn", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/56887286-kathryn", "userReview": "DNF. Made it through first section, skimmed a bit more just in case it was different. the premise sounds like fun, but I didn't enjoy the way it was written."}], "description": "Has the hoax now moved from the sideshow to take the center stage of American culture?Award-winning poet and critic Kevin Young tours us through a rogue s gallery of hoaxers, plagiarists, forgers, and fakers from the humbug of P. T. Barnum and Edgar Allan Poe to the unrepentant bunk of JT LeRoy and Donald J. Trump. Bunk traces the history of the hoax as a peculiarly American phenomenon, examining what motivates hucksters and makes the rest of us so gullible. Disturbingly, Young finds that fakery is woven from stereotype and suspicion, race being the most insidious American hoax of all. He chronicles how Barnum came to fame by displaying figures like Joice Heth, a black woman whom he pretended was the 161-year-old nursemaid to George Washington, and What Is It?, an African American man Barnum professed was a newly discovered missing link in evolution.Bunk then turns to the hoaxing of history and the ways that forgers, plagiarists, and journalistic fakers invent backstories and falsehoods to sell us lies about themselves and about the world in our own time, from pretend Native Americans Grey Owl and Nasdijj to the deadly imposture of Clark Rockefeller, from the made-up memoirs of James Frey to the identity theft of Rachel Dolezal. In this brilliant and timely work, Young asks what it means to live in a post-factual world of truthiness where everything is up for interpretation and everyone is subject to a pervasive cynicism that damages our ideas of reality, fact, and art.\"", "title": "Bunk: The True Story of Hoaxes, Hucksters, Humbug, Plagiarists, Forgeries, and Phonies", "url": "http://www.goodreads.com/book/show/33375625-bunk", "average": 3.22, "cover": "https://images.gr-assets.com/books/1495824708l/33375625.jpg", "reviews": 118, "authors": [{"url": "https://www.goodreads.com/author/show/44964.Kevin_Young", "name": "Kevin Young"}], "type": ["History", "Nonfiction", "Psychology", "Sociology", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/33375625-bunk", "http://www.goodreads.com/book/show/35867179-bunk", "http://www.goodreads.com/book/show/37689672-bunk", "http://www.goodreads.com/book/show/37535013-bunk", "http://www.goodreads.com/book/show/358515.Jelly_Roll", "http://www.goodreads.com/book/show/6535688-the-art-of-losing", "http://www.goodreads.com/book/show/18050043-book-of-hours", "http://www.goodreads.com/book/show/10106758-the-best-american-poetry-2011", "http://www.goodreads.com/book/show/2997082-dear-darkness"]}