{"ratings": 8953, "userreviews": [{"userName": "Angela", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/4255477-angela", "userReview": "[Wow. I've gotta re-read this.Burn Bright....hmm. What could that be in reference to?And it takes place in Aspen Creek - no travelling this book for Charles and Anna. NEED!!! (hide spoiler)]"}, {"userName": "Lila", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/6659789-lila", "userReview": "[Hester seemed amazing. And Devon as well. :( (hide spoiler)]"}, {"userName": "Jilly", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Me trying to figure shit out: Well, okay, I thought it was an okayish book, except for that one conversation that I highlighted because What the Fuck???? So, if I just ignore that conversation....... ugh, I can't! Because if Charles KNEW.... and said others KNEW... it changes the entire Mercy Thompson/Alpha Omega world.So, I'm frustrated! Not only do I HAVE to 1-star this book, but I HAVE to write a serious review as to why. You guys know how much I hate having to be serious! I'm against it 99.99% of the time! But, how do I joke around about a book that throws out some facts that turn one of my favorite characters into a pedophile, and then says some of the pack suspected it? Then, to kick me while I'm down, and rub some salt into my wounds, they started blaming the victim of pedo-bear for the bad behavior of those around her. Oh, well, of course a child should be abused by the mother if the father has sexual feelings for her. That kid was asking for it!I'm going to quote the conversation here because it was in the very beginning of the book and really has no relevance on the story here, even though it changes everything on a larger scale:\n(Charles): you know how Leah feels about anything that had to do with Mercy.\"\"I do,\" (Anna) said. \"I even understand it, much as it pains me to say so. Bran is funny about Mercy. If you were that funny about Mercy, I would feel the same way Leah does -- no matter how likable I might find her.\"\"Bran's not funny about her,\" he told Anna, feeling uncomfortable. \"He thinks of her as his daughter, and he doesn't have any other daughters still alive. There's nothing strange about it.\"\"Or so everyone is much happier believing,\" agreed Anna blandly. \"Including Bran. We'll leave it at that. So the musical evenings were a thing between Bran and Mercy?\"\"Not like that,\" Charle said, feeling defensive because Anna put her finger right on something that he'd been ignoring for a long time. He took a deep breath. \"All right. All right. You may have a point about Da and Mercy.\"She smiled, just a little.He threw up his hands. \"Okay. Yes. I saw it, of course I did. As did Leah. But my da would never have moved on Mercy. Say what you will about him -- but his wolf has accepted Leah as his mate, and he will not cheat on her. And Mercy has never seen him as anything except a father figure and her Alpha. That's what she needed, and that's what he gave her. I don't think Mercy has ever recognized that it could be more than that.\"\nOkay, so people knew that this guy, who is thousands of years old had a thing for a girl that was put into his care from the ages of 0-16 years old? And, not only did they turn a blind eye, but they (Leah) abused and mistreated the girl because of the man's inappropriate fixation? And, not only all of that - which sucks and is enough to piss me the hell off - but Anna also says that she understands why Leah hated Mercy and would have hated her too if she was in her shoes? So, Anna is also ruined now, because that is the stupidest, most ignorant attitude I have ever heard. And, she \"smiled, just a little\", when Charles admitted there was something inappropriate there? Like, she's happy to be right about pedophilia? Bitch, please! I wanted to smack the smug smile off of her face.I'm just. I can't even. Where's this going? I'm not sure I can go along for the ride."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "On sale now, as of March 6, 2018! A solid and enthusiastic four stars. Full review first posted on Fantasy Literature.Burn Bright is the fifth and latest novel in Patricia Briggs’ ALPHA AND OMEGA urban fantasy series … actually, it’s more mountainous wilderness fantasy, but it does involve werewolves and witches living amongst humans. Burn Bright, though it has different main characters, also intertwines nicely with the main MERCY THOMPSON series.Bran, the grand-Alpha or Marrok of most of the werewolf packs in North America, is still out of town due to the events in the last MERCY THOMPSON book, Silence Fallen. He phones home and tells his wife Leah and son Charles that he’s leaving them in charge while he takes a trip to Africa to see Samuel, his other son. In Bran’s rather mysterious absence, Charles and his wife Anna try to manage his pack of werewolves and the pack’s finances, and to not get into too many arguments with the irascible Leah.This effort gets a lot trickier when Charles gets an urgent phone call from Jonesy, one of the so-called wildings. These are a separate, outlier group of werewolves under Bran’s protection and leadership who live near but apart from the Marrok’s main pack. The wildings are broken beings, fragile and often particularly dangerous, and are rarely seen by anyone except Bran himself. Charles and Anna, an “Omega” werewolf with the helpful talent of calming dominant werewolves, head out to check on Jonesy.Jonesy turns out to be a powerful fae who lives in isolation with his werewolf mate, Hester. Hester has been captured by a secretive armed task force that is trying to kidnap ― or kill ― some of the wildings. And the evidence indicates that someone among the wildings or Bran’s main pack is a traitor who is working with these attackers. With Bran incommunicado for some reason, it’s up to Charles, Anna and other members of the Marrok’s pack to try to neutralize the invaders, warn the wildings of the danger they’re in, and find the traitor.The mystery in Burn Bright is distinctive, though ultimately it didn’t gel for me as well as in the best of Briggs’ books. The plot is somewhat disjointed, though the threads come together fairly well in the end. The logic is occasionally strained. For example, there’s a significant rule involving cell phones not being allowed in wilding territory, where the explanation simply didn’t make sense to me, and a key development involving eye color that seemed highly unlikely under the circumstances. The plot involves both extreme long-term planning by the villain and some improbably rushed action and coincidences. However, as Briggs has frequently done before, she pulls in plot threads from preceding books in the series, weaving in the consequences of earlier events and decisions made by the characters. Though it’s not necessary to have read all of the books in both interlocking series to understand and enjoy Burn Bright or any other particular book in these series, it’s certainly conducive to a greater appreciation.The highlight of Burn Bright is the characters and their interrelationships. Briggs creates well-rounded characters in a fantasy setting who are realistically flawed and believable. It was fascinating to get to know some of the members of Bran’s pack of misfit werewolves better, both characters we’ve met before as well as some new ones. Some poignant moments for several characters add to the depth of this urban fantasy. There was a fascinating aside in the form of an insight into Mercy and Bran’s relationship, and even the detested, hard-hearted Leah becomes a character that the reader develops more understanding and even sympathy for.Burn Bright is a solid entry in one of the better ongoing series in the urban fantasy genre. If you haven’t read the previous ALPHA AND OMEGA books, I would recommend starting at the beginning, with Alpha & Omega and Cry Wolf, but fans of Patricia Briggs and her werewolves will relish this new adventure.I received a free copy of this ebook from the publisher through NetGalley. Thanks!!Original post: I love Patricia Briggs' urban fantasies, and this Alpha and Omega series interlocks very closely with Mercy Thompson's. I'm having trouble keeping my mitts off this one (I got halfway through it last night in one long reading session that lasted until 1 am) even though there are other books I really need to read and review first. I should probably feel worse about that than I do. :D"}, {"userName": "katwiththehat", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/54835325-katwiththehat", "userReview": "[ Bran wasn't really feeling like a father when he followed Mercy to Europe. Or made the whole \"I love yous\" and \"mine since the moment I held you\" speech. It's a very creepy thing to look up at a man, trusting him as your father, while totally unaware if circumstances were different he really would like to undress you and sleep with you, but is holding back because you're both already mated. He's putting on a show of the father thing, fighting to give her away at her wedding, and one has to wonder about this Bran versus the one who professes to hate lies, even ones of omission. It just casts a very different feeling on those scenes, one I'm not sure I can stomach. And that makes me really sad, because I love Briggs' writing and would be sad to give up this series. But I'm not sure I can ever read a scene between Bran and Mercy again.Briggs has addressed uncomfortable topics before. Samuel tried to manipulate Mercy into mating with him when she was underage and he wanted her for her womb. Mercy was raped. Leah abused Mercy when she was a child. The difference here? All of those scenarios were clearly treated in the text, and by the reaction of the author as WRONG. But here we have in the text, behavior clearly spelled out as a very old man courting a child as young as 12, but the author defending him as \"Bran is not a pedophile.\" Saying he is honorable. We have that same man who helped raise the child and still acts as her father figure, FIGHTS to act as her father figure desiring that woman who is now mated to someone else, which everyone knows except her, and instead of the idea of those incestuous thoughts being a very creepy issue whether they are acted upon or not, he is described as \"noble.\" And \"Mercy will never find out.\"This book would have been loads better if Briggs had focused on redeeming Leah, rather than turning Bran into a creeper. Completely ruined it for me. (hide spoiler)]"}, {"userName": "Aisling Zena", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/18444439-aisling-zena", "userReview": "Expected publication 2018.  2018!!  Three years from the last book!  THREE YEARS!!  P.S. This was published 6 months before Mrs Briggs husband passed away. This was published with a tongue-in-cheek intention for the delays of our favourite books. Obviously after Mrs. Briggs loss I don't expect her to be whipping up books. My condolences and love and hope she has the support she needs to get over this difficult time."}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "Reviewed by: Rabid ReadsHOO boy.DEAD HEAT, the last book from the Anna and Charles portion of the MERCY THOMPSON universe, is probably my least favorite book in the combined series, so despite my slight preference for the ALPHA & OMEGA characters, I was a bit leery of BURN BRIGHT . . . And by \"leery\" I mean that I hesitated for a whole five seconds before accepting an ARC. I love Bran. I love everything about the concept of the Marrock. I love the tiny middle-of-nowhere town for misfit werewolves. And even if Bran isn’t a POV or the focus, his presence still saturates everything Charles and Anna do, b/c he’s the friggin’ Marrock. BUT.I hate Leah as intensely as I love Bran, so when my friend Steven told me that BURN BRIGHT was Leah-heavy, I really frowned and squinted. Me: *frowns and squints HARD*Steven: It’s not that bad.Me: How can it not be that bad?Steven I don’t like Leah either, but now I understand her better, and I’m even somewhat sympathetic to her situation.Me: Hmph. I don’t want to understand her. I like hating her.Steven: *rolls eyes* Just read it.So I did. I mean, Steven is way more forgiving than I am, but how could I not be curious about Leah—LEAH, whom I hate, loathe, despise, and abominate—being painted in a sympathetic light?Would I fall prey to that nonsense? Or was my hatred incorruptible? *smirks* Like the events of a single installment could negate years of animosity, justified animosity . . . Except based on Charles’ recollections of Mercy’s youth, Leah had all kinds of legit reasons to dislike her . . . And yeah, she is the Queen of Mean Girls, but she doesn’t actually do anything to endanger the Pack . . . Or does she?*laughs maniacally*BURN BRIGHT takes you deep into the quagmire of Aspen Creek, to places you didn't even know were there. Old, powerful wolves like Asil who walk an unsteady line between functional and dangerous aren’t the biggest threat facing those who belong directly to the Marrock. Lone wolves and . . . other things have settled the outskirts of Bran’s domain. But the outskirts still belong to the Marrock, and when one of his more solitary wolves is killed after an abduction-gone-wrong, it becomes obvious to Anna and Charles that someone in the Pack selling information to Outsiders. But who? And why?Read it and find out. *grins cheekily* Highly Recommended."}, {"userName": "Niki Hawkes - The Obsessive Bookseller", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/13396599-niki-hawkes---the-obsessive-bookseller", "userReview": "[3.5/5 stars] As Patricia Briggs is one of my favorite urban fantasy writers, I love that I have a new release from her to look forward to every year. Reading her books always feels like cuddling up with a warm fuzzy blanket when it’s snowing outside. Burn Bright was a nice installment in the Alpha & Omega series. Perhaps not quite as strong as the last couple of books, but still loads of fun all the same.The positives were abundant: an interesting mystery to solve (one which I’m sure we’ll see repercussions from in the next Mercy book), plenty of Anna and Charles awesomeness (because their relationship dynamic is still one of my favorites), Marrok werewolf pack politics (a topic of which I never tire reading), and an easy flow of writing that absorbs you for a good ride. Essentially, all of the basics I’ve come to expect from a Briggs novel in abundance.All that said, I wish the book could’ve had tighter pacing, most notably in the second half. The main story halted several times so other stories could be told and, while they were all interesting and completely relevant to the plot, they effectively killed any building momentum for me. It wasn’t a deal-breaker by any means (because the stories were good), but compared to the last two novels where the story practically careened towards the finish in a can’t-put-it-down-for-anything manner, Burn Bright was just okay in that regard.Overall, anything Briggs produces is a good read, and this wasn’t an exception. I delighted in learning more about the dynamics within the Marrok’s pack (and especially loved the inclusion of Asil – one of the most interesting side characters in the saga). I love enigmas in books, and Briggs has several she’s been slowing revealing more about for years. It keeps me coming back with gusto!Recommendations: I’m a huge fan of this series (and Patricia Briggs herself – you won’t meet a more gracious author) and would recommend them to both urban fantasy fans and those new to the genre. At this point, the link between the Alpha & Omega and Mercy Thompson books is strong enough that you should consider reading both series simultaneously by publication order to avoid major spoilers. Additionally, I would encourage you to pick up Shifting Shadows, a brilliant short story compilation, before diving in to Burn Bright.I’d like to say a big thank you to Berkley Publishing Group, Patricia Briggs, and Netgalley for the chance to read and review an early copy of Burn Bright!Via The Obsessive Bookseller at www.NikiHawkes.com Other books you might like:"}, {"userName": "♥Rachel♥", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/5481477-rachel", "userReview": "Charles and Anna are holding down the fort in Aspen Creek, while Bran, the Marrok is off on vacation. The story takes off quickly when one of the “wildling’s” (old wolves that are no longer safe to associate around Pack on a regular basis) mate calls for help. Anna and Charles go to investigate and find a lot more than they bargained for. There’s a lethal threat, assisted by a traitor in the Pack, and Anna and Charles must figure out if the traitor is one of the “wildlings”, or a closer Pack member. Either way, they must warn all the “wildlings” of the danger, and so begins the thrill ride!Got some surprising insight on Bran (never suspected that!), and his abilities, which clarified something he was able to pull off in Silence Fallen (the previous book in the Mercy Thompson series). Anna’s abilities as an Omega wolf get more awesome as the series progresses. Especially as she investigates and understands her power more. As usual, Charles and Anna face the conflicts and danger as a united front, lending power or support to each other whenever needed. Theirs is a mature romance, without unnecessary drama, or petty jealousies. There’s plenty of love and passion between the two of them, when they’re not battling for their lives, that is! A big betrayal, Pack dynamics, Asil and Sage, and a slightly different view of Leah all factor in, as well, in this exciting installment of the Alpha & Omega series. There’s never all dull moment, even when the action is a bit on hold, because trying to discover the culprit behind the attacks kept me guessing! Alpha & Omega continues to be one of my all-time favorite urban fantasy series’, so of course I gobbled Burn Bright up! Even though the mystery wraps up here, I’m already eagerly anticipating the next book! A copy was kindly provided by Ace Books via Netgalley in exchange for an honest review. This review is also posted at The Readers Den."}, {"userName": "Obsidian", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "[It was gross to read that Bran apparently had feelings or still has feelings apparently based on what Anna says for Mercy. Yes, Mercy. The same Mercy that Bran raised since she was 3 months old. The same Bran that sent Mercy away when she was 16 since she got involved with Bran's son Samuel. The same Mercy that he didn't even speak to for at least a decade until the first book in the Mercy Thompson series. I hated that Anna based on the discussion she had with Charles is also blaming Mercy for this and or for not realizing it. And then we get into the fact that this is why Leah always hated Mercy. So you are telling me that no one said to themselves that a man who had a hand in raising her should have been smacked down about this. And apparently this was an open secret in the Aspen Creek community though no one spoke about it. I just...my head hurts. This colors the entire series and now makes me feel squeamish about \"Silence Fallen.\" We had Bran making amends it felt like for abandoning Mercy twice and she was happy that her father came and got her. Now we find out that he's in love with her and Briggs does her best to make you feel sorry for Leah somewhere in there though she abused and we are told countless times would have killed Mercy if she could have.  (hide spoiler)]"}, {"userName": "Julia ♡ Sarcasm and Romance Addict ♡", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/48015437-julia-sarcasm-and-romance-addict", "userReview": "I'm so pumped! I could read a 100 book series dedicated to these two as long as there's no more mention of horses."}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life in Books.This book was amazingly good! I honestly loved every page of this story. It should probably come as no surprise to anyone who follows my reviews that I am a huge fan of Patricia Briggs. I was incredibly excited to get my hands on this book and went into it with really high expectations. This book exceeded every one of those expectations. Charles and Anna are back at home with the Marrock's pack but this time Bran is away. Charles has taken on some additional responsibilities with Bran's absence and he is working hard to keep the peace with Leah. When a call comes in from the mate of a wolf that lives in the wilderness on the outskirts of the pack, they are pulled into a much deeper mystery.I loved so many things about things about this book but the characters are really at the top of the list. Charles, Anna, and Brother Wolf are some of my favorite characters. I really liked getting to see the bond between Charles, Anna, and Brother Wolf. Yes, Brother Wolf is the wolf side of Charles but he really does see things differently at times and is a distinctly different character. I love how Briggs is able to define these parts of Charles so seamlessly. The secondary characters were also great. Asil has been a character that I really enjoy and he played a very large role in this book. He was so strong in this book and I love the way that he watches over and protects Anna. Leah has always been a character that I loved to hate. She has always seemed more difficult than anything else in previous installments and she still has her moments in this book. I feel like I understand Leah a lot more after reading this book and now that I know why she acts as she does it is a bit more forgivable. I also thought that the wildlings that live on the outskirts of Bran's pack were very interesting and added a nice touch to the book.The mystery in this book was very solid and kept me guessing. There were more than a few surprises along the way and I couldn't turn the pages fast enough. There were quite few action scenes and there were a few moments that I was worried about how things would work out. It really was an exciting story filled with much loved characters. I did miss Bran at times but I do think that his absence let others take a turn in the spotlight.I would highly recommend this series to others. This is the fifth book in the Alpha and Omega series and works best when read in order. This series takes place in the same world as the Mercy Thompson series with a lot of overlapping characters. This was a very solid installment in the series that I found to be incredibly entertaining. I cannot wait to read more from Patricia Briggs very soon.I received an advanced reader edition of this book from Berkley Publishing Group via NetGalley.Initial ThoughtsSo damn good. I loved every part of this book. It was just amazingly good. Some of the things I loved about this book:AnnaCharlesBrother WolfAsilLeah <-----yes, I said LeahMeeting some new charactersSolid mysteryAction scenesA few surprising momentsSo much to love about this book. I would say it was worth the wait."}, {"userName": "Steven", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/11855472-steven", "userReview": "Thanks to Netgalley and Berkley for providing me with a copy in exchange for an honest review.Patricia Briggs is one of my favorite authors. She consistently produces top-notch books, both in her Mercy Thompson series and in this one, the Alpha & Omega series, which is a spinoff of Mercy's stories and intertwines back and forth.This novel picks up right around the events of the most recent Mercy book, Silence Fallen, and follows Charles and Anna as they handle some events surrounding the wildlings of the Aspen Creek pack. To me, Briggs is at the top of her game when she's writing Charles and Anna stories. I'm not sure what it is, but just like with Faith Hunter and her Jane Yellowrock series and Nell Ingram spinoff, as much as I love the main series, the spinoff set in the same world really works for me in a much deeper and more satisfying way. I think I just love the connection between Charles and Anna and their wolves and how they balance each other out.As many of you may not know, Briggs lost her husband unexpectedly in early 2017, and this is the first book she's published since losing him. This book was very clearly influenced by this loss, and focuses heavily on the bonds between mates - Hester and Jonesy, Charles and Anna, Bran and Leah, even Asil and Wellesley and their lost mates. She also dedicated the book to her husband. It was an amazing book, and such a fitting tribute to the man who was, in fact, her own mate, and she couldn't have done a more beautiful job. \"But that is the dual gift of love, isn't it? The joy of greeting and the sorrow of good-bye.\" ~from Patricia Briggs' Dead Heat, the prior book in this series.If you haven't picked up Briggs and her Mercyverse, you're doing yourself a disservice. Start at the beginning and lose yourself in the beautiful, heartbreaking, heartwarming, deep world that Briggs has created. You won't regret it. (And if I may offer a tidbit of advice, follow this reading order: Moon Called, Alpha & Omega [short story], Cry Wolf, Hunting Ground, Blood Bound, Iron Kissed, Bone Crossed, Silver Borne, River Marked, Fair Game, Frost Burned, Dead Heat, Night Broken, Fire Touched, Silence Fallen, Burn Bright)---Review to be published on release date... but I will say, this book was a very fitting and beautiful tribute to her husband, Mike, who passed away in early 2017, and of course, another strong entry into the Charles and Anna series (which I love so much!)"}, {"userName": "Beth", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/5375148-beth", "userReview": "TOUR GIVEAWAY\n\nClick to Enter:Tome Tender Book Blog Giveaway1 Winner of a Mass Market copy ofCRY WOLFby Patricia BriggsBook 1 in the Alpha and Omega SeriesGiveaway Runs Feb. 2 - March 6, 2018Winners must have USA Mailing Address Only\nBran has left the pack to Charles while he heads to Europe to deal with an emergency with Mercy. Once that emergency is over Bran extends his absence from the pack by stating he is going to visit Samuel leaving Charles and his mate, Anna, to deal with an emergency call from a wilding’s fae mate.You’ve gotta love the bond between Charles and Anna and in Burn Bright Briggs shows not only that bond but the wildings, extremely unstable shifters, and even Charles and his bitch mate (yes, she is a bitch, but still his mate). These mate bonds come into play like never before making for some swoon worthy reading.Reading every book Briggs has published, I am still amazed, surprised and in awe of her imagination and unexpected machinations that she throughs our way and that is just a few factor why I love her writing. In the end, I flat out loved it! I don't think I can ever get enough of Briggs' storytelling! A re-read and a go to author for recommendations because I know everyone of those urban fantasy fans out there that picks up one of her works is going to enjoy it.I received this ARC copy of Burn Bright from Berkley Publishing Group - Ace. This is my honest and voluntary review. Burn Bright is set for publication March 6, 2018.My Rating: 5 starsWritten by: Patricia BriggsSeries: Alpha and Omega Sequence in Series: Book 5Hardcover: 320 pagesPublisher: Ace Publication Date: March 6, 2018Genre: Urban FantasyAmazon: https://www.amazon.com/Bright-Alpha-O...Barnes & Noble: https://www.barnesandnoble.com/w/burn...Itunes: https://itunes.apple.com/us/book/burn...For more reviews check out Tome Tender's Book Blog or find us on Facebook."}, {"userName": "Anne", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": ""}, {"userName": "Dani C. (Paulette's Papers)", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/2080218-dani-c-paulette-s-papers", "userReview": "I don’t read a lot of urban fantasy, but I do read everything that Patricia Briggs writes. After I read the first book in the Alpha and Omega series I was hooked, and Patricia Briggs became one of my favorite authors. Each of her books are a treat to read and enjoy. As soon as a new book comes out I make sure that the kids are in bed and I have no plans for the next day. Because I know I will be up all night until I read that last page…The Alpha and Omega series is about two werewolves (a mated couple) Charles and Anna. Charles is the son of Bran who is over all the werewolves in North America. Anna is a rare Omega wolf. She is special in many ways and one of them being that she is not a submissive wolf.In Burn Bright Bran is away on ’vacation’ so Charles is left to watch over everything. Of course, they get a message saying the one of their wolves are in trouble. Charles and Anna with the help of some of the pack begin to learn that this trouble could be because they have a traitor in their midst…Burn Bright is the fifth of the Alpha & Omega series and sure you could read as a standalone, but I really, strongly suggest you don’t. You will get so much more enjoyment of this book if you have started reading the series from the beginning. This is one of my favorite series to read so naturally I am waiting impatiently for the next book to come out."}, {"userName": "Kira", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/7247640-kira", "userReview": "[It didn't have much of an impact because it wasn't a character that meant anything to me. I would have loved it if that person was the suspect and the suspect had turned out to be the real threat. (hide spoiler)]"}, {"userName": "Yodamom", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/2905141-yodamom", "userReview": "Charles and Anna are left as heads of the pack while Bran is off on a vacation to Africa, without this mate. Yeh it something is weird, but I'll not tell you what. So Charles if left with his mate and Leah. with all their issues and snipping at each other. Talk about a rock and a hard place, ouch. I know you're thinking poor Charles, hah ! those were the easy times. There are some wolves who live on the edge, the windings, bare sane if at all, there are under the pack protection, aka his. One very old and very powerful wolf is captured, her mate who holds enormous power asks for help. This is were you should start feeling sorry for Charles and Anna because things go really bad and have many strings attached. Somebody has betrayed them, perhaps somebody close. But they are not alone, they have the pack, and my favorite big bad wolf is prominent, Asil, the Moor. Oh my, what a twisted knot. Charles and Anna , aww what a cute mated couple , blah blah blah. Asil, dark quiet mysterious and powerful is finally explored more in this book. His history, the glimpse allowed left me thirsty for more. He is such a tease. I want an Asil book, no I need one. The rest of the pack was interesting, and played well together.  I enjoyed it all, except Bran and... Bran went AWOL and acted out of character from what we've seen of him in the past. Something revealed about his possible motives for something way off base was sort of weird, I hope it doesn't lead anywhere. The mystery of who was pretty easy to figure out, the why wasn't. I was scratching my head going \"Hey Wolf ?!?!? Didn't you get that ??? Hello ?\" But they didn't hear me or Captain Obvious when he spoke to them."}, {"userName": "Holly", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/7383561-holly", "userReview": "[Anna basically says that she thinks Bran has/had feelings for Mercy that are romantic and not father-ly in nature and Charles admits that he sees it too but thinks Bran would have never acted on those feelings and Mercy would never figure it out. Now the context for this conversation is important because they are talking about Leah and Anna basically says that this is WHY Leah is such a bitch to Mercy. Since this is an observance by Anna, who has only met Mercy as an adult, the implication is that this revelation is only in regards to adult Mercy is the way I read this. This seems to have been slipped into the book only to set up a rewriting of history that makes Leah's bitchiness be somehow understandable. By the end of the book we see Leah acting decently, and Charles pointing out kind of obliquely that Bran really does love Leah, Leah and Bran just don't see it. To me that proves that this conversation between Anna and Charles was just a deus ex machina to get to that 'Leah isn't so bad afterall' and 'Bran really does love Leah and Leah really does love Bran' HEA we get at the end, which otherwise would have made zero sense given the background of other books in this spin-off series and the Mercy series. There's zero hints given previously that Bran had any kind of feelings towards Mercy that were not parental in nature and zero indications that Leah was anything other than a complete bitch. So this is seemingly just a very poorly thought out re-write of history to explain things away. Of course, it's all open to reader interpretation and if it turns out I am wrong and Bran really did have 'funny' feelings towards Mercy when she was a child I will be pretty disgusted and stop reading this series. But at this point in time I am not convinced that is what Briggs was trying to imply here. I think she is just making Mercy a mary sue where everyone loves adult Mercy, including Bran to make Leah more sympathetic, which while not ideal it's not a deal breaker since this was just one conversation about it and for the sole purpose of the conversation was setting up a Leah/Bran HEA. I might be wrong, I might be right. We'll see I guess.  (hide spoiler)]"}, {"userName": "Mlpmom (Book Reviewer)", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/3829694-mlpmom-book-reviewer", "userReview": "4.5 Stars!Oh how I have missed Charles and Anna!I love this series and the very fact that it coincides with my beloved Mercy Thompson series just makes it all the better. I loved being immersed back into this world and more importantly getting to see Charles and Anna together again. The bond and relationship they have it amazing and the love and understanding between them even more so. I love that they make each other stronger and while they want to protect each other, they also don't smother or hold the other one back from being the best they can be. It truly is one of my most favorite relationships in the genre and I adore them.The mystery in this was intriguing and again, I loved that it kind of went hand in hand with what is happening in her Mercy Thompson series without it feeling like it is the same story or the same exact drama. It's a separate situation with a mystery that is all tied together and I love it. It was so fascinating and so much fun. Getting to learn more about the wildings and their purpose and place in the pack was even more entertaining than I imagined it would be. I loved seeing Asil step up and help out so much. He really is one of my favorite misfit characters. Truly a wonderful story full of rich history, not only about the werewolves but about magic and Charles people, and just so much more. I truly loved it all, right up to the satisfying and thrilling end and was not ready for it to be over. I can't wait for the next book, I'm so ready for it!*ARC provided by the publisher in exchange for an honest review.*"}, {"userName": "Ian", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "There are some great ideas in this book.There are some great characters in this book. Unfortunately they take a back seat to Charles and Anna. Don't get me wrong, I like Charles and Anna. They're great characters. I've enjoyed their story. But maybe it's time to move on. Explore some different characters. If this book centred on Leah, Bran's wife / mate and the wildlings, I'm pretty sure it would have been a 5 Star book."}, {"userName": "Sarah", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "I've put off writing this review for weeks because every time I think about this book I get mad all over again. I honestly don't think I've ever been so disappointed in the direction an author has decided to take  a story and while I totally get that it is Patricia Briggs' right to do whatever she chooses with her characters and her world I don't have to continue investing my time and money in her series. I suppose I should probably point out that before Burn Bright I would have considered myself a Mercy Thompson / Alpha & Omega superfan. I reread all of the books and short stories in the MT world at least once a year with a friend and we have spent countless hours sending each other favourite quotes and discussing everything about these characters and this world. The reason I'm so upset and the reason I feel so betrayed by the author is because I feel like I know this series inside out and there was nothing, absolutely not one single hint to make revelations in this book seem even slightly plausible, let alone palatable.I can't really talk about my biggest issue with this book without giving spoilers so continue reading this review at your own risk, but since I'm reviewing this so long after the release date I expect most fans have either already read this book or at least seen others mention the controversy. The absolutely 100% series ending revelation for me is that Bran has always had romantic feelings for Mercy. This is the man who has raised her since she was eight months old, the man who is the only consistent father figure she's ever really had, the man she turns to for advice and the one she looks up to beyond all others. This is the same man who watched over her while she slept as she recovered from a sexual assault, the man who gave her away at her wedding and made Adam promise to protect her, the man who has ALWAYS, in all circumstances treated her like a daughter.And now we have Anna and Charles having a casual conversation about how Bran is \"funny\" about Mercy and Anna even saying she would hate Mercy as much as Leah does if Charles felt the same way about her that Bran does. Anna, who was herself a victim of rape and the worst kinds of treatments at the hands of her previous alpha is now blaming Mercy, who was a CHILD when this was all happening!  I'm sorry but in no circumstances is Mercy to blame no matter what Bran does or doesn't feel for her, Mercy has never led Bran on, she's never had an affair with him or tried to lure him away from Leah and even if she had that doesn't excuse Leah from child abuse. Because lets face it the way Leah treated Mercy, the way Bran has flat out stated in previous books that he couldn't adopt Mercy himself because Leah would have killed her, the way Leah attacked Mercy many times when she was a child and how the entire pack used to go out of their way to keep the two of them apart because they knew what would happen if they didn't. That's all because Leah is an abuser who would have happily KILLED A CHILD because she felt that child was competition for her mate.I get that Patricia Briggs has written herself into a corner, she's said many times and shown in many ways that Bran is bonded to Leah and I think she's left herself with no option of ending their relationship. That's a bit of a problem when fans have been screaming for years that Leah is an awful, awful character and begging to see Bran get a happily ever after with literally anyone else. Now, in my opinion, a skilled writer would have been able to turn around Bran and Leah's relationship. I've seen other authors do that in the past and I so badly want to see Bran happy that I probably would have forgiven Leah far quicker than she deserved. But I won't forgive Leah because Bran has been turned into someone that I can no longer respect or even like. That just makes me hate both of them, it makes me look at every single interaction between Bran and Mercy throughout the entire fifteen book series and feel physically sick because I can no longer see the loving father figure that has always wanted what is best for Mercy. Now all I can see is the sick pedophile who has been grooming her.This book contradicts itself in so many different ways when it comes to Leah. First it tries to make us feel sorry for her because her mate is in love with a child. Then Charles talks about how abusive she was to him when they first met too, how horrifically she treated him when he was also just a child who was just desperate for someone to love him, he specifically states that he would have adored her if she'd only been nice to him. So it wasn't just Mercy Leah abused then, this conversation also confirms that it was Charles too. So she's jealous of anyone that Bran gives love to and that shows what a petty and nasty person she is. To be honest you only have to look at the way she treated Anna the first time they met to see Leah's true colours! But then the book backtracks again and tries to show how nice she is because she saves Charles' life, I could have cheered for her at that point but only if we hadn't just been reminded about how awful she's been in the past.If Patricia Briggs hadn't turned Bran into a pedophile but had instead just had Leah saving Charles in this book I would have stared to warm to her. If she'd then had both Bran and Leah make some big changes over the next few books (because lets face it he's never treated her well really so neither of them are perfect and they're both to blame for their issues!) then I think in time I would have softened to them as a couple and might have been able to want to see them happy together. It could have been so easy, especially since we get a better idea of the fact that Bran does actually love her in this book. Unfortunately for me it's too little too late and the way Bran's character has been totally and utterly destroyed has ended any love I ever had for this series.The first time I read Burn Bright I was horrified by that conversation but I still had faith in PB and I was convinced that Anna and Charles had misread things and it was all going to be a horrible misunderstanding. I was positive that in the next book this would all be fixed with a few well placed revelations and that I could continue loving this world. I even went back and immediately reread the previous fourteen books specifically looking for signs that Bran felt anything but fatherly towards Mercy. I read fourteen books LOOKING for that and couldn't find a single thing that made me suspect it was true. Not one single word. Everything points to a father daughter relationship, every single interaction between them. Every single conversation with Samuel, Adam, any other character they always refer to Bran as Mercy's father. I actually managed to convince myself I'd read Burn Bright wrong and stressed myself over nothing.Then unfortunately Patricia Briggs made public comments about it confirming my worst fears were true, Bran does have romantic feelings for the child he raised. Oh, we're supposed to see him as noble because he didn't act on them, and we're supposed to ignore it because apparently Mercy will never know how he feels. But that doesn't sit well with me, especially when she's made it clear that everyone else knows this but Mercy, so not only is Bran lying to her but so is her husband Adam, so is her childhood love Samuel, so is her brother Charles and her sister-in-law Anna and so is the entire Aspen Creek Pack - people she grew up with and was raised by. That breaks my heart for Mercy and it makes me so angry with everyone else that I can't see straight.So that's the story of how Patricia Briggs destroyed the Mercy Thompson world for me, the series that I have loved for many, many years. The series that has been a huge comfort to me over the years. The series that I'm honestly not sure I'll ever be able to look at in the same way again. I hope that one day, in a few years time, I'll be able to forget that Burn Bright ever existed. And if I ever reach that point then perhaps I'll be able to reread the first 14 books again and remember how much I loved them but I will not be buying any new books in this world, and honestly I'm still more than a little heartbroken about that.I should also probably link to my friend Ange's reviewAnge's review because she goes into even more depth about the major issue I had and several other consistency problems with the story. She also includes quotes both from the book and from Patricia Briggs that further detail things I've mentioned above.____________________Full review to come but it won’t surprise anyone who saw my updates that a particular conversation has killed this series for me.I reread this series every year so it breaks my heart that I don’t think I’ll ever be able to read it again. I’m going to miss this world and these characters but I refuse to watch PB rewrite history. She can take her series in any direction she chooses but I don’t have to follow her while she does it."}, {"userName": "Corina☞BookTwinsReviews", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/8905971-corina-booktwinsreviews", "userReview": "Fantastic book, enthralling and captivating from beginning to end. Full review to come...For more of my reviews:My Blog: Book Twins ReviewsFacebook Blog PageTwitterSubscribe to Blog"}, {"userName": "☆★Tinja★✮ A Court of Pizza and Laziness", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/11904521-tinja-a-court-of-pizza-and-laziness", "userReview": "I had so many issues. So, so many. I'm disappointed with everyone. With some more than others. I'm actually really angry.I should have known. That cover looks too pretty.2.5 stars"}, {"userName": "Cathy (cathepsut)", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/978552-cathy-cathepsut", "userReview": "Very early in the book there is a brief conversation between Charles and Anna, that upset some of my goodreads friends quite a bit. It might cause them to stop reading this series and also Mercy Thompson. I was surprised when I read that conversation, mulled it over a little, but was not massively perturbed by it. It might or might not be a plot bunny for later books, we shall see. Unfortunately the comment thread of that review had spoiled me by revealing who the traitor in this story is. That obviously took some of the suspense out of the story.The plot as such was pretty straight forward and simple, the action was good, we get a deeper look into Anna‘s ever developing skills with her gift. Leah gets some page time that helps to make her a more interesting character. I liked it, solid addition to the series.Playlist:Johnny Cash, HurtBobby Dylan, Knockin‘ On Heaven‘s DoorWaylon Jennings, I‘ve Always Been CrazyJohnny Cash, Personal JesusPatsy Cline, CrazyDolly Parton, The Company You Keep"}, {"userName": "Ina", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/13594589-ina", "userReview": "[I mean, it's one thing to know that the man you live with doesn't love you and only tolerates you because he needs to calm down the monster inside of him. But knowing he has a thing for Mercy? No wonder Leah hates her, to be honest, I would probably want to kill her as well if I was in her place) (hide spoiler)]"}, {"userName": "Beanbag Love", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/2598237-beanbag-love", "userReview": "[Adam spends one second in the same room with Bran. (hide spoiler)]"}, {"userName": "RachelW (BamaGal)", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/31722634-rachelw-bamagal", "userReview": "3.5 Stars. I would like to say that I loved this book, but I didn’t…not quite. It had all the right ingredients – Bran’s wildlings, pack issues, favorite characters, and an intriguing mystery. There was even a side to Leah not seen before. Unfortunately, it was slow going. It was interesting, the investigation into the difficulties the wildlings were having and the pack issues that had risen; but it meandered along too leisurely for my tastes getting to the point. I had put it down and picked it up for the better part of three weeks trying to get through it. What kept me going (albeit slowly), was wondering why the heck Bran had disappeared and what his endgame was. I had to know what was going on, even if it was a bit laborious getting there.The last 20% made up for it for my early misgivings. It was fast paced, a revelation; and an amazing and riveting read. I thoroughly enjoyed the last portion of the book, when everything started coming together. Major props to Briggs for being able to even get this book out at such a difficult time in her life. I still prefer this series to ‘Mercy Thompson’; but that’s a strictly personal taste on my part. It was overall a good read, and others may not find it as slow a read as I did in the early to middle portions…"}, {"userName": "Lena", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/35645863-lena", "userReview": "[Oh Asil... Really happy with the Leah/Bran turn of events. Give me more! (hide spoiler)]"}, {"userName": "KatieV", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/18620847-katiev", "userReview": "[ The elephant in the room for anyone reading reviews and hubbub on this book - \"the conversation\". In the first chapter, as Charles and Anna are going up into the mountains to help the Wildlings, there is a conversation between the two about Mercy. It turns to a discussion of why Leah hates Mercy so much. Anna notes that it is because Bran is \"funny about her\". Charles doesn't like it, but eventually relents that 'yeah’, Anna has a point, ‘but Bran would NEVER make a move there'. From the conversation and what Briggs said in a FB posting, apparently Bran decides around the time Samuel is trying to run away with Mercy (when Mercy is 16) that maybe he has developed the hots for Mercy too. He decides it is best for everyone to ship Mercy off to her mother and cut off contact.Did I like this? No. It was a bit jarring and disappointing since Mercy sees Bran as a father figure. Then again, with all due respect, Briggs does seem to find it necessary for nearly every straight male within a mile of Mercy to have the hots for her. There is Stefan, Samuel, and obviously Adam. I would not be surprised if Ben is included eventually. In Briggs’ fantasy world - which she generously shares with us - Mercy is like catnip for males. It is what it is. I just roll my eyes and go with it. Granted, I thought the Bran thing was unnecessary and disappointing. Briggs says nothing will come of it and I tend to believe her. We are obviously being setup for a closer relationship between Bran and Leah.It is all about Leah being more sympathetic to the reader and explaining why she was so horrible to Mercy. She has always been nasty to Charles too and the explanation for him works just as well for Mercy and IMHO Briggs should have stuck with that. In this book, we learn Charles was 10 when Leah and Bran married. Leah hated Charles because Bran loved him - simple as that. He was a kid, desperate for attention from a father who was more often absent than not. Did that matter? No. She is jealous and petty about anything Bran loves. Mercy was a baby when she came and Bran loved her - therefore Leah hated her. Leah seems to hate most everyone. She is bitter and selfish and has the instincts of a jealous canine (more on that in a minute). My point is Leah’s hate is explainable without the addition of Bran’s unrequited love for Mercy. Many people are angry at Bran and/or Briggs. I think it was a poor and unnecessary decision, IMHO. BUT, I think we allow ourselves to forget that the wolves are monsters when Briggs tries to tell us quite often. They aren't humans, not entirely. With few exceptions they are constantly at war with their animal instincts. They also aren’t the friendly canines we keep in our homes, but feral pack wolves. Mostly we've seen them through Mercy's 1st person POV and Mercy is not a reliable narrator when it comes to the werewolves. She's not untruthful, she just isn't one herself. On one level she recognizes they are monsters, but she also doesn't quite get it even with all her experience. She often sees the ones she loves with rose colored glasses.At every opportunity, Briggs reminds us that the wolves do not see themselves as Mercy sees them. Any time one of the werewolves gets a POV, it is clear that they see themselves as monstrous and that Mercy doesn’t quite get it. Going all the way back to Moon Called when a newly turned Carter Wallace tells Mercy he was wrong about werewolves being no worse than any other predator, and continuing in this volume with a conversation between some pack members who disagree with Anna’s views re: an equivalency between racial injustice and the government’s view of werewolves. Asil obviously sees her views as naïve and cheerfully attests that the humans should be afraid. The point of this ramble is that Bran is THE monster. I like Bran, he is fascinating, mysterious, and charismatic, but he is also terrifying. There is a reason he can keep an entire continent of werewolves under his thumb. I am disappointed with Briggs’ choice here, but it is not inconsistent with Bran’s character to tarnish his “fatherly” image. Just look at how he uses his actual son, Charles, despite knowing that his forced role as deadly enforcer is tearing him up. One more thought and I’ll shut up. Briggs set a hard task for herself in having a traitor in Aspen Creek. We don’t really know the pack like we do the Columbia Basin. We know a handful of characters and only a couple well. The reveal was also unbelievable when you really think about it. Still, Briggs proved with Moon Called that the villain can have a ridiculous plot and many of us will be so drawn in that we’ll overlook it and reread. I admit I’d finished before I really reflected on how convoluted Jerry Wallace’s plot was. I was so drawn in by the characters and the world. I laughed out loud when Charles reflects on Jerry’s unnecessarily complicated plot in this volume - even Briggs acknowledges the silly. Who cares though? Not me. As long as she writes compelling characters and uses strong world building, she can throw in an overly complicated villainous plot here and there.  (hide spoiler)]"}], "description": "They are the wild and the broken. The werewolves too damaged to live safely among their own kind. For their own good, they have been exiled to the outskirts of Aspen Creek, Montana. Close enough to the Marrok’s pack to have its support; far enough away to not cause any harm.With their Alpha out of the country, Charles and Anna are on call when an SOS comes in from the fae mate of one such wildling. Heading into the mountainous wilderness, they interrupt the abduction of the wolf–but can’t stop blood from being shed. Now Charles and Anna must use their skills–his as enforcer, hers as peacemaker–to track down the attackers, reopening a painful chapter in the past that springs from the darkest magic of the witchborn…", "title": "Burn Bright\n      \n          (Alpha & Omega #5)", "url": "http://www.goodreads.com/book/show/35294265-burn-bright", "average": 4.29, "cover": "https://images.gr-assets.com/books/1516230706l/35294265.jpg", "reviews": 1242, "authors": [{"url": "https://www.goodreads.com/author/show/40563.Patricia_Briggs", "name": "Patricia Briggs"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/35294265-burn-bright", "http://www.goodreads.com/book/show/36194120-burn-bright", "http://www.goodreads.com/book/show/35839437-burn-bright", "http://www.goodreads.com/book/show/35992690-burn-bright", "http://www.goodreads.com/book/show/37121287-burn-bright", "http://www.goodreads.com/book/show/71811.Moon_Called", "http://www.goodreads.com/book/show/285205.Blood_Bound", "http://www.goodreads.com/book/show/1412138.Iron_Kissed", "http://www.goodreads.com/book/show/6587387-silver-borne", "http://www.goodreads.com/book/show/3128411-bone-crossed", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}