{"ratings": 16455, "userreviews": [{"userName": "Bill  Kerwin", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "This first George Smiley novel—also the first for John le Carre—is not a spy novel really, but more like a murder mystery with spies in it.You see, Smiley is ordered to conduct a routine security check on Samuel Fennan, and, since he sees no serious concerns in Fennan's past—just a little harmless wartime flirtation with communism—he reassures Fennan and they part in friendly fashion. But soon Fennan is pronounced a suicide, and Fennan's wife Elsa claims that, after his interview with Smiley, her husband was unusually despondent. The higher ups want to stick Smiley with the blame for a botched interview and move on, but Smiley, who is not convinced this is a sucide, becomes even less convinced when he answers the phone in Fennan's flat and receives a “reminder call” Fennan arranged with his service. It just doesn't make sense. Why would a person who intends to commit suicide one a specific night arrange for a reminder call for the morning after?Since this is a first novel, it has its flaws. For example, Smiley and Police Inspector Mendel are both used as third-person viewpoint characters, but Mendel's first appearance as viewpoint is disorienting, since it is far enough into the novel that we have identified ourselves with Smiley completely, and le Carre has not used any of the novelistic tricks that would make such a transition less confusing and more effective. Also, although le Carre's acerbic descriptions of many of the streets of London are precise and entertaining, they are sometimes too long, and thus retard the action and dissipate the suspense.Still, Smiley is an intriguing narrator, the characters of Elsa Fennan, Inspector Mendel, and the shady car dealer Adam Scarr are lifelike and convincing, and the final confrontation and chase, in a small London theatre and in the surrounding streets, is suspenseful and exciting."}, {"userName": "Jaline", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "“Call For the Dead” is the first of 8 books in John Le Carre’s series featuring George Smiley. Published in 1961, it is smart, the writing brisk and contained, and the story engaging. Espionage and counter-espionage – who is a spy? – who is being set up? This is a classic, and written by an author who knew the ins and outs of national Intelligence and Security first-hand. This book is a very impressive and intelligent initial offering from an author whose stories have been revered for years, and some of which made it onto the big screen as motion pictures. I’m not a big fan of spy books or movies . . . or, I wasn’t until I read John Le Carre. I think I will continue with the series to see what Mr. George Smiley gets mixed up in next!"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Call for the Dead = The Deadly Affair, John le Carré Call for the Dead is John le Carré's first novel, published in 1961. It introduces George Smiley, the most famous of le Carré's recurring characters, in a story about East German spies inside Great Britain. It also introduces a fictional version of British Intelligence, called \"the Circus\" because of its location in Cambridge Circus, that is apparently based on MI6 and that recurs throughout le Carré's spy novels. Call for the Dead was filmed as The Deadly Affair, released in 1966.Foreign Office civil servant Samuel Fennan apparently commits suicide after a routine security check by Circus agent George Smiley. Smiley had interviewed and cleared Fennan only days previously after an anonymous accusation; because of this, Circus head of service Maston sets up Smiley to be blamed for Fennan's death.While interviewing Fennan's wife Elsa in her home, Smiley answers the telephone, expecting the call to be for him. It is a requested 8:30 AM call from the telephone exchange. Inspector Mendel, a police officer on the verge of retirement who is investigating the Fennan case, finds out that the call had been requested by Fennan the night before. When Elsa later tells Smiley that she requested the call from the exchange, Smiley becomes suspicious of her. However, Maston unequivocally orders Smiley to refrain from any further investigation into Fennan's death. Back in his office, Smiley receives a letter posted by Fennan the night before, requesting an urgent meeting that day. Believing that Fennan was murdered to prevent the meeting, Smiley resigns from the Circus and attaches his resignation to Fennan's letter, which he forwards to Maston. ....تاریخ نخستین خوانش: سال 1994 میلادیعنوان: آوای مرگ؛ نویسنده: جان لوکاره؛ مترجم: خسرو سمیعی؛ تهران، طرح نو، 1373؛ در 191 ص؛ فروست: مجموعه کتابهای سیاه؛ چاپ دوم 1389؛ شابک: 9789644890741؛ موضوع: داستانهای نویسندگان انگلیسی قرن 20 موقتی لیدی آن سرکومب پس از پایان جنگ دوم جهانگیر با جرج اسمایلی ازدواج کردند، به دوستانش در میفر، که از ازدواج او به شدت شگفت زده شده بودند درباره ی شوهر خویش گفت که او آدمی است به طور غریبی معمولی. ... ؛نقل از مصاحبه جان لو کاره با مجله اکسپرس 1969 میلادی: دنیای جاسوسان در نظر من، ادامه ی دنیایی است که در آن زندگی میکنم، به همین جهت هم آن را با پرسوناژهای خود میآرایم. چون به هر حال، من رمان نویس هستم. با تخیل عمل میکنم. قصه تعریف میکنم. پایان نقل. ا. شربیانی"}, {"userName": "Susan", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This is the first George Smiley novel and introduces us to the characters which, as a reader, you will come to love. It is fair to say that Le Carre's spy novels are more Harry Palmer than 007; he aims for realism and not fantasy, which I find much more intriguing. Smiley is not attractive, or dashing. His ex wife, the beautiful Lady Ann Seacomb, caused surprise and gossip when they married - she nicknamed him 'Toad' and, unlike a Bond character, who always gets the girl, she leaves him for a Cuban motor racing driving.Despite Smiley's squat and unprepossing looks though, he has something far more attractive - intelligence in abundance, as well as great humanity and sensitivity to others. When asked to interview Samuel Fennan, at the Foreign Office, who has been anonymously accused of being a communist sympathiser, Smiley conducts the meeting with tact. He even goes so far as to tell Fennan not to worry, which is why he is so suprised when Fennan supposedly returns home devastated and later commits suicide. Something does not add up and Smiley sets out to find out what really happened. This is a world of real danger, where Smiley is almost killed and others murdered, where people are really hurt and suffer the consequences of their actions. A really intelligent novel and a great introduction to the Smiley books."}, {"userName": "Jason Koivu", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Some of the most elegant spy genre books I've ever read!"}, {"userName": "Jaksen", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/7233842-jaksen", "userReview": "Well I wanted to read 'some le Carre' so I went to the beginning, the first George Smiley book. Glad I did. I've been looking for a replacement for good old Reggie Wexford, the police inspector from Ruth Rendell's wonderful series, and here he is, sort of. Both George and Reggie are kind of old, grumpy, overweight men - and geniuses at their profession. Reggie does police investigations; George does spies. They both go after the bad guys and they always get'em.In this book Smiley interviews a fairly low-level clerk working in intelligence because an anonymous letter accuses the man of (possibly) being a double agent, of selling secrets, of trading information and what-have-you. Smiley clears the fellow; the fellow ends up committing suicide. Or does he? Now some reviewers have claimed this story is nothing more than a mystery with a few spies in it, but no, I so disagree! We have an East German operative who has a history with Smiley; there's also the dead man's wife, who's an odd duck if nothing else; there's a business in a warehouse which is KNOWN to harbor spies and which the authorities are keeping a close watch on. It's a short novel, but complex in its own right.I enjoyed Smiley's trucking about - I can see him plodding up the fogbound streets being ignored by everyone who passes by, with none realizing what a brain is under that old, hoary head - and figuring out what's going on and why. Most of his information is gathered the old-fashioned way: talk, talk, talk to someone until that someone lets drop a hint, or forgets a previous lie, or tells Smiley 'what happened' in a subtly different way. He notices things; he's a man of detail, which I rather enjoy. So overall, a very interesting and satisfying read.(One thing, I didn't get the idea of a 'phone exchange' even though I come from the era of dial phones, party lines, crossed lines and dialing 'O' for operator. My family's first phone number had FOUR digits. But I figured out what the 'exchange' was doing eventually.)Anyhow, I'm going to dive into the whole Smiley series and am already reading the second one.:D"}, {"userName": "Paul Curd", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5981794-paul-curd", "userReview": "George Smiley is arguably one of the best known fictional British spies. He made his first appearance in Call for the Dead in 1961. The book also launched John le Carré’s career as a novelist. So if you’re new to le Carré and/or George Smiley, this is definitely the place to start.In many ways, Call for the Dead is a book of its time. It opens with a chapter setting out ‘A Brief History of George Smiley’, something a modern novelist might find difficult to get away with. But the ‘backstory’ of Smiley is interesting and, in part, important to what follows. Smiley is described variously as ‘breathtakingly ordinary’, ‘short, fat and of a quiet disposition’, ‘a shrunken toad’ and so on (and that’s just on page one!). So, if it’s Bond or Bourne you’re after, you'd best look elsewhere.The story begins at chapter two. Set in a London I remember from my youth at the start of the Cold War, the novel still has half an eye on the Second World War, when Smiley was a field operative. Now confined to routine security clearance work, he is summoned to ‘the Circus’ to explain why a senior civil servant he recently interviewed should have committed suicide. Smiley felt the man posed no risk despite an anonymous tip-off to the contrary, so he is as puzzled as his superiors. With the help of a retired policeman, Smiley sets out to solve the mystery. In that respect, this is more a detective novel than a spy story.As with all Le Carré novels, there are twists and turns in the plot and, although I managed to guess the answer to the mystery a little sooner than I would have liked, I remained involved and interested enough to read to the very end to see if I was right. And I rewarded with an exciting set-piece climax on Battersea Bridge to round everything off.Set in a London of yellow fog and of a River Thames that smells of tar and coke, this is a novel that paints a brilliant picture of post-war Britain. I read this immediately after Sarah Waters’ latest, The Little Stranger, and Call for the Dead similarly has as much to say (albeit unconsciously, to a certain extent) about the nature of the class system as it was in this country, barely fifty years ago, as well as the murky world of post-war espionage. But it is also about the human condition, as all truly good books are. Overall, a very satisfying read."}, {"userName": "Bettie☯", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "http://www.bbc.co.uk/programmes/b0112csvDescription: John le Carré classic novels deftly navigate readers through the intricate shadow worlds of international espionage with unsurpassed skill and knowledge, and have earned him -- and his hero, British Secret Service Agent George Smiley, who is introduced in this, his first novel -- unprecedented worldwide acclaim.George Smiley had liked Samuel Fennan, and now Fennan was dead from an apparent suicide. But why? Fennan, a Foreign Office man, had been under investigation for alleged Communist Party activities, but Smiley had made it clear that the investigation -- little more than a routine security check -- was over and that the file on Fennan could be closed. The very next day, Fennan was found dead with a note by his body saying his career was finished and he couldn't go on. Smiley was puzzled...THE KARLA TRILOGY:3* Tinker, Tailor, Soldier, Spy(1974)3* The Honourable Schoolboy(1977)CR Smiley's People (The Karla Trilogy #3) (1979)GEORGE SMILEY:3* Call for the Dead(1961)CR A Murder of Quality3* The Spy Who Came In from the Cold(1963)The Looking Glass War3* Tinker, Tailor, Soldier, Spy(1974)3* The Honourable Schoolboy(1977)CR Smiley's People (The Karla Trilogy #3) (1979)TR The Secret Pilgrim3* The Constant Gardener3* A Delicate Truth5* The Night Manager"}, {"userName": "DeAnna Knippling", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/3166570-deanna-knippling", "userReview": "There has been a lot of blah-di-blah about who the literary successor for Jane Austin should be. Well, it's too late; it's John Le Carre. Just because he happens to write Cold-War thrillers doesn't mean that every word isn't infused with the same sense of humor, the same love of the ordinary, the same lovely tendency to linger with friends, whether they be seemingly-mundane characters or sentences themselves.\"When Lady Ann Sercomb married George Smiley towards the end of the war she described him to her astonished Mayfair friends as breathtakingly ordinary. When she left him two years later in favour of a Cuban motor racing driver, she announced enigmatically that if she hadn't left him then, she never could have done; and Viscount Sawley madde a special journey to his club to observe the cat was out of the bag.\"Tell me that this couldn't have been the start to a lost Jane Austen novel. Just try.An absolute gem."}, {"userName": "Mark", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/6755739-mark", "userReview": "\"take your hands off me! Do you think I'm yours because I don't belong to them? Go away! Go away and kill Freitag and Dieter, keep the game alive, Mr Smiley. But don't think I'm on your side, d'you hear? Because I'm the wandering Jewess, the no-man's land, the battlefield for your toy soldiers. You can kick me and trample on me, see, but never, never touch me, never tell me you're sorry, d'you hear? Now get out! Go away and kill\" The first novel by John le Carré is also the 1st novel with the iconic character George Smiley.le Carré described George Smiley in “Call for the Dead” (1961) this way: “Short, fat and of a quiet disposition, he appeared to spend a lot of money on really bad clothes, which hung about his squat frame like skin on a shrunken toad.” So a few years before the Ian Fleming creation graced the big screen for the first time his totally opposite started his life in this not so thick novel in a murder mystery & spy mystery. The by then already old employee George Smiley is send out to check out a civil servant after receiving an anonymus letter in which Samuel Arthur Fennan's communist history is told. However Smiley sees nothing but a youthful mistake and even lets the man know he should not be concerned.Of course Smiley is rather unpleasantly surprised when he is told that the man has killed himself and somewhat implicates Smiley in the reason why. When Smiley is send by his service to check out their possible involvement things do not seem to add up. And things get worse quickly including resignation and more murders.I have read Le Carré before, never this particular book, and found him interesting but far too intellectual for my taste. His books lacked the physical action that I found enjoyable in the Fleming novels. Now that I am older I find that I enjoy the human and intelligent style of writing by this particular writer a lot more. Le Carré gives a lot more real insight into the every day spy business than most writers will ever do probably because the man worked in the business himself. When he released this book he still worked for MI6 and they permitted him to release this novel as long as he did change his name to his well known pen-name, and the man responsible in MI6 for vetting the book loved it as well.A great little story that is well constructed and leaves the reader guessing until the end.The nice part about this particular edition of the book is the 10 pages in which John le Carré himself introduces the book himself, a nice bonus if I may add."}, {"userName": "Nigeyb", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/10301421-nigeyb", "userReview": "'Call for the Dead' is the first George Smiley novel and introduces Smiley, and other primary characters. Smiley is a wonderful creation: unattractive, seemingly ponderous, and introverted. A donnish figure completely out of time, and yet a brilliant thinker, empathetic and perceptive. He is also heartbroken. His unlikely and beautiful ex-wife, Lady Ann Seacomb, having left him for a Cuban motor racing driver. I've wanted to read the George Smiley books since watching the BBC adaptation of 'Tinker, Tailor, Soldier, Spy' back in the 1970s. I subsequently loved the 2011 film adaptation directed by Tomas Alfredson, which I saw in the cinema, and rewatched a few weeks ago. Everything I have heard about the source material suggests joy and wonder would await and, I’m pleased to report, that’s exactly what I found.Part of what is so marvellous about this book is how John le Carré allows the reader to enter Smiley’s mind and the slow, deliberate machinations as he grapples with complex problems. Frankly it’s wonderful. What a book. ‘If people tell me that I am a genre writer, I can only reply that spying was the genre of the cold war’ John le CarréLike many brilliant writers, John le Carré is often pigeonholed as a spy or espionage genre writer, and therefore somehow less worthy (this critical sniffiness is often levelled at other wonderful writers who focus their books on crime or science fiction).'Call for the Dead' is a really intelligent, beautifully written novel, and a great introduction to the Smiley books which I know will only get better and better. I don’t why it has taken me so long to start reading John le Carré’s work but better late than never eh?4/5"}, {"userName": "Blaine DeSantis", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/2994598-blaine-desantis", "userReview": "After having read some of Le Carre's more recent book, I decided to go back to the beginning and this is the first book that he wrote, and in which he introduced us to his leading character George Smiley. A nice, tight book that is well written and holds the attention it does a very good job of getting the reader into the initial Cold War espionage genre that Le Carre is a master of.Love the writing style and the characters - oh so very British! - and the way he leads us through the maze of the Spy vs. Spy world that had really just begun to occur in actuality when this book was written back in 1961. I want to read more by this author because I love the style of writing, the plotting and the mind games that Smiley is put through and takes us on. The next book featuring Smiley is quite different in that it has nothing to do with espionage and is the only one of Le Carre's books in which he has Smiley interacting outside of that genre. Why, oh why, did I take so long to join Le Carre's group of avid followers? No idea, but that seems to be a sad refrain that I keep coming to in that the older I get the more books and authors I realize that I have never read. Trying desperately to remedy this situation and Le Carre' is a thinking persons author - no wild chases, no multiple and unnecessary deaths, just George Smiley trying his best to outthink and outwit all of his Cold War enemies. Understated and underwhelming, George Smiley is a great character and I look forward to following more of his missions!"}, {"userName": "Brad Lyerla", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/4384303-brad-lyerla", "userReview": "CALL FOR THE DEAD is very good. It easily qualifies for five stars. I am now going to read le Carre's Smiley books in order. When I am done, I may review them as a group."}, {"userName": "Zoeytron", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "If I had known that LeCarre's Call for the Dead was the introduction of George Smiley, I would have read this book eons ago. This one was published in 1961, and the copy I came across is an ancient paperback that sold new for 95 cents. It had been languishing in one of our bookcases for decades, passed over time after time in favor of something else. More is the pity.One of the things that makes George Smiley stand out among the others of his ilk is his looks, oddly enough. He is a quiet, ordinary pudgy man with a world-weary face, pouches under his eyes, and thick glasses through which he peers in an owlish manner. It is a sad face, and a little bitter - his wife has left him for another man and Smiley has been robbed of his peace. He also happens to have a brilliant mind and is a key player for British Intelligence. He is able to recall a conversation word for word. Anyone who has read Tinker Tailor Soldier Spy and Smiley's People know the capabilities of this unprepossessing little man. We start off here with a supposed suicide that makes no sense to Smiley, even though there a suicide note conveniently left by the body. Simple enough, no? The police are satisfied, the British Intelligence Agency, as well, until Smiley rocks the boat. The dead man's widow, 'a slight fierce woman in her fifties with hair cut very short and dyed to the color of nicotine', muddies the waters and we are off to the races. Wonderful British-isms abound - 'this will put the cat among the pigeons', 'tuck into the grapes', and 'on the shelf'. LeCarre's writing is brilliant, even in this early effort. It was a pleasure to read. The final paragraph is superb. Dig out your copy and give it another go."}, {"userName": "Antonomasia", "userReviewDate": "Oct 10, 2013", "userURL": "http://www.goodreads.com/user/show/6249204-antonomasia", "userReview": "[4.5] Almost as good as The Spy Who Came in from the Cold, and only makes me look forward to reading more. The plot is simpler – as much a detective story (complete with Plod) as a spy thriller - occasional clunks in the writing, but still very good. This is the first in the George Smiley series and was Le Carré's first novel - more impressive than most of the recent début novels I've read this year. (Also such a relief to read something so straightforwardly enjoyable after Lolita.) I haven't yet got over my surprise that a thriller could contain such good understanding of emotional states - here especially wariness/ paranoia, trauma and fear, lost love, the wish not to be bothered - perhaps that's part of what distinguishes le Carré. I very much like the way he relates the emotional legacy of the Second World War and the contemporary effect of the Cold War on individuals and politics. Unlike some more literary books which can really put one through the wringer, evoking feelings and memories at great length, this acknowledges rather than dwelling on them: there's always a distraction, something happening - (and it’s sometimes quite loud.)BTW, why on earth did Penguin make their new covers for the George Smiley novels - like this one - pastiches of 1930s posters? The books are full of wonderful detail from their own times, the early sixties and onwards. Those picures look senselessly wrong and there's no shortage of enthusiasts for mid-twentieth century design in Britain. I love these books at least as much for the sense of the era as for the stories."}, {"userName": "Evan", "userReviewDate": "Dec 23, 2010", "userURL": "http://www.goodreads.com/user/show/3356232-evan", "userReview": "Le Carré is one of the greatest writers of thrillers of all time. At worst, he seems to produce a story that is merely entertaining and engaging.This book—which I believe was his first—reminded me a great deal of Graham Greene's work: It was short, fast-paced, and highly entertaining. But even in so short a book his talent for weaving intricately tangled webs of espionage asserts itself. He strings the reader along throughout the narrative dropping little clues here and there, slowly revealing the truth. Le Carré is an excellent storyteller, and I can whole-heartedly recommend this book to anyone that loves thrillers, and Cold War spy tales. Delightfully entertaining."}, {"userName": "Peter", "userReviewDate": "Apr 20, 2008", "userURL": "http://www.goodreads.com/user/show/1099454-peter", "userReview": "The first great George Smiley novel. I read Tinker Tailor a while back after seeing the Sir Alec Guinness Masterpiece Theater bit, and that lead me to want to read the other Smiley Novels. This is just great writing. Le Carre has a command of language and character that you don't generally see in this genre; his digs at class and society are priceless. It's no wonder he is seen almost without argument as the author of the greatest series of spy/thriller/espionage books ever written. Can't wait to read more."}, {"userName": "Emma", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/26734926-emma", "userReview": "This was my second John le Carre novel, having read Tinker Tailor Soldier Spy for a book club a few years ago. It is pretty short, at around 150 pages, and although that meant the plot moved rather quickly, it also made some of the novel appear rather superficial.The book follows spy George Smiley, as he investigates the apparent suicide of a man who was suspected of being a Communist sympathiser. It was more of a murder mystery than a spy novel, but this is not necessarily a bad thing. The characters created were lifelike and believable. I liked that Smiley was an ugly, overweight spy- touches like this made it more realistic than James Bond. Although this isn't a typical spy novel, and in my opinion doesn't really resemble Tinker Tailor Soldier Spy, I very much enjoyed it."}, {"userName": "Steven  Godin", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "First in the series for George Smiley, which doesn't live up to what would follow (has nothing on the brilliant 'The spy who came in from the cold'). It's very British, there is a suspicious death (isn't there always), and just who can you trust?. The tone of the book is very sombre, grey skies hanging over London, lots of frowning and general gloom, the cold war lingering in the background, and it's also intriguing rather than thrilling but never dull. Sits comfortably away from other crime/mystery novels. But that's a good thing. Le Carre stands alone like no other writer of the British spy genre."}, {"userName": "Susan", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This is the first George Smiley novel and introduces us to the characters which, as a reader, you will come to love. It is fair to say that Le Carre's spy novels are more Harry Palmer than 007; he aims for realism and not fantasy, which I find much more intriguing. Smiley is not attractive, or dashing. His ex wife, the beautiful Lady Ann Seacomb, caused surprise and gossip when they married - she nicknamed him 'Toad' and, unlike a Bond character, who always gets the girl, she leaves him for a Cuban motor racing driving.Despite Smiley's squat and unprepossing looks though, he has something far more attractive - intelligence in abundance, as well as great humanity and sensitivity to others. When asked to interview Samuel Fennan, at the Foreign Office, who has been anonymously accused of being a communist sympathiser, Smiley conducts the meeting with tact. He even goes so far as to tell Fennan not to worry, which is why he is so suprised when Fennan supposedly returns home devastated and later commits suicide. Something does not add up and Smiley sets out to find out what really happened. This is a world of real danger, where Smiley is almost killed and others murdered, where people are really hurt and suffer the consequences of their actions. A really intelligent novel and a great introduction to the Smiley books. The excellent, clear narration, helps bring the story alive, in this audible version."}, {"userName": "James", "userReviewDate": "Sep 12, 2011", "userURL": "http://www.goodreads.com/user/show/6022914-james", "userReview": "[Mrs Fennan (hide spoiler)]"}, {"userName": "Sean", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/5753689-sean", "userReview": "John Le Carre is often considered to be the master of spy fiction. Many of his novels are considered classics of the genre and appear in many best-of lists. Some have even been made into Hollywood films. The most recent was Tinker Taylor Soldier Spy. I have only read one of his novels, The Spy who Came in from the Cold, which many claim is Le Carre’s finest work. However, that book appears in the middle of a series of novels dealing with the British Intelligence Agency and its main protagonist George Smiley. I read that novel and felt that I was starting the story from the middle. Much of the background of “control” has already been developed and the characters have had many experiences that I have missed. Therefore, I decided to start the “George Smiley” series from the beginning.The first story is A Call for the Dead. This is nice short introduction to the series which introduces the main protagonist George Smiley and offers a bit of background of the character. It is also more of a detective novel than a spy novel. The plot is fairly simple. George Smiley is sent to investigate the suicide of the agent Samuel Fennan of the Foreign Office. As George conducts his inquiries he begins to suspect that Fennan’s death was not a suicide. This is pretty good place to start if you want to start the series. At only 125 pages, the reader can determine if Le Carre’s brand of espionage fiction is right for them."}, {"userName": "Laura", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "From BBC Radio 4 Extra:Dramatisation by Robert Forrest of John le Carre's first novel.London, the late 1950s, and a disenchanted George Smiley is engaged in the routine job of security vetting. When a Foreign Office civil servant commits suicide not long after being cleared of Communist sympathies, Smiley investigates and uncovers a deadly conspiracy with its roots in his own wartime past.George Smiley ...... Simon Russell BealeInspector Mendel ...... Kenneth Cranham Elsa Fennan ...... Eleanor BronAnn Smiley ...... Anna ChancellorPeter Guillam ...... Richard DillaneMaston ...... James LaurensonDieter Frey ...... Henry GoodmanAdam Starr/Mundt ...... Sam DaleLudo Oriel ...... Janice AcquahNursing Sister ...... Caroline GuthrieWith Benjamin Askew and Jonathan Tafler.http://www.bbc.co.uk/programmes/b0112csv"}, {"userName": "Nikki ", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Hmmm. I've heard so much about John le Carré; perhaps this wasn't a good place to start, but I have a thing about being chronological. (I read The Magician's Nephew first, in the Narnia series. Really.) It's a decent spy-thriller/mystery, but it didn't have anything else that got its hooks into me: Smiley was the only potentially interesting character, and he spent a lot of the time sick in bed... The other characters honestly blurred into each other.The mystery itself is straight-forward: I figured it out somewhere before page fifty. Not all the details, perhaps, but the basic outline.Overall, meh."}, {"userName": "Sketchbook", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/4708498-sketchbook", "userReview": "Why would a foreign office chap who killed himself ask Telephone Exchange for an early wake-up call ? Smiley, that rumpled bullfrog of an agent, is introduced in a forgotten (1961) cloak 'n dagger. Lean, taut, without highly-wrought subplots, this jolly good yarn bursts with vitality and scary plausibility. Along the way, le Carre explains how Smiley was recruited for the Secret Service (he was studying German Lit at Oxford in 1928) and we learn that Cold War spies, when seeking an urgent meeting, might send their contact a postcard with a religious image, like a Madonna or a church. At least in fiction. It's total fun at the Circus."}, {"userName": "Ed", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/1077703-ed", "userReview": "Call for the Dead is John le Carré's 1961 debut novel and introduces his recurring character George Smiley. It's a rather short book that moves right along. I enjoyed reading Smiley's encounter with East German spies operating inside England. Foreign Office agent Samuel Fennan's \"suicide\" after a security interview by Smiley kicks things off when he entertains doubts and believes it was actually a murder. Back in 1961, Germany was divided into sections. There are events from the Second World War in Nazi Germany included in the plot. All this seems so ancient now, but le Carré's story made for a gripping and relevant one during the Cold War years. I'm not a big spy and esponiage fiction fan, but I like reading one now and then for a change of pace. Smiley is hardly a 007 action-hero, but a middle-aged overweight man who possesses a sharp mind. He also has run-ins with his bosses, and his wife Ann is a bit less than loyal and faithful to him. Nevertheless he carries on with the good fight, and I like that about him."}, {"userName": "Mary Ronan Drew", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/2986995-mary-ronan-drew", "userReview": "In 1961 the first of John Le Carre's novels was published, introducing George Smiley, the British Secret Service Agent who over the next couple of decades was to become a household name. In Call for the Dead the story is only tangentially a spy novel; it's really a fairly straightforward murder mystery.Smiley is asked to interview a man in the Foreign Office, Samuel Fennan, in a routine security check. Fennan has been under suspicion of Communist sympathies but Smiley talks to him as they walk in the park and finds he likes the man and can clear him entirely.So when Fennan's body is found hung a few days later with a suicide note saying his career is over, Smiley is suspicious. He interviews the man's unassuming wife and doesn't really know what to think until he answers the phone at Fennan's house. It's a call for the dead man - a wake-up call. Who would leave a request for a wake-up call if he was about to commit suicide?"}, {"userName": "Randy", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/131730-randy", "userReview": "Le Carre's debut novel marks the first appearance of George Smiley, who will have a larger role in Le Carre's later works. Call for the Dead is an almost routine murder-mystery set apart by Le Carre's sensible style and the story's Cold War espionage trimmings. Pacing is a problem, with almost random action scenes separated by long dull stretches that felt odd for such a short book. Also, the last two or three chapters are devoted to a mind-numbing summary of all that came before, to the point that I expected the antagonist to enter and proclaim: \"and I would have gotten away with it, if it wasn't for you meddling kids!\" Zoinks!"}, {"userName": "Lyn Elliott", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/10312986-lyn-elliott", "userReview": "Who could imagine, reading this little book, that the dumpy, dowdy George Smiley would go on to be one of the great figures of the shadow world of espionage? The first chapter is a briefing on Smiley - how he came to be where and who he is - so he is immediately familiar. The period, in the years just after World War II, was one of turmoil in Europe, as its division into Communist and non-Communist blocs shook into place, and here Le Carre's focus is on the newly divided Germany, with East German villains. Threats of Smiley's war involvement in Germany are intrinsic to the story.A great, short read."}, {"userName": "Rob Kitchin", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/4579658-rob-kitchin", "userReview": "Call For The Dead was Le Carre's first book and also introduced George Smiley to the reading public. It's a moderately thin read (157 pages) and the plot is relatively straightforward, with no substantive subplots. What marks Le Carre out is his voice and the careful layering and rhythm of the prose. In many ways, the storytelling style of Call for the Dead reminded me of Maj Sjowall and Per Wahloo's Martin Beck series, which was first published a couple of years later, in that the style is social realism (rather than noirish style of American hardboiled or the more swashbuckling style of spy thrillers such as Ian Fleming) and the pace is quite sedate as the story works its way to a somewhat understated climax. Like Martin Beck, Smiley is a fairly ordinary character who works through a case patiently and dogmatically, though he is a little more impetuous and foolhardy, and shares the donnish qualities of Colin Dexter's Morse. I read a number of the Smiley books when I was a teenager and it was interesting to revisit him now, especially since the character I remember was slightly different to the one presented (I thought of him as more enigmatic and calculating). Having looked around on the internet it seems that Smiley's character did mutate a little and his back story and career timeline altered quite substantially between books. He nevertheless remains one of fiction's enduring spy characters."}], "description": "John le Carré classic novels deftly navigate readers through the intricate shadow worlds of international espionage with unsurpassed skill and knowledge, and have earned him -- and his hero, British Secret Service Agent George Smiley, who is introduced in this, his first novel -- unprecedented worldwide acclaim.George Smiley had liked Samuel Fennan, and now Fennan was dead from an apparent suicide. But why? Fennan, a Foreign Office man, had been under investigation for alleged Communist Party activities, but Smiley had made it clear that the investigation -- little more than a routine security check -- was over and that the file on Fennan could be closed. The very next day, Fennan was found dead with a note by his body saying his career was finished and he couldn't go on. Smiley was puzzled...", "title": "Call for the Dead\n      \n          (George Smiley)", "url": "http://www.goodreads.com/book/show/46460.Call_for_the_Dead", "average": 3.79, "cover": "https://images.gr-assets.com/books/1347597241l/46460.jpg", "reviews": 1111, "authors": [{"url": "https://www.goodreads.com/author/show/1411964.John_le_Carr_", "name": "John le Carré"}], "type": ["Fiction", "Mystery", "Spy Thriller", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/46460.Call_for_the_Dead", "http://www.goodreads.com/book/show/18715700-call-for-the-dead", "http://www.goodreads.com/book/show/7067478", "http://www.goodreads.com/book/show/6622802-call-for-the-dead", "http://www.goodreads.com/book/show/18710661-call-for-the-dead", "http://www.goodreads.com/book/show/18992.Call_for_the_Dead", "http://www.goodreads.com/book/show/403851.Call_For_The_Dead", "http://www.goodreads.com/book/show/82846.Call_for_the_Dead", "http://www.goodreads.com/book/show/17735048-call-for-the-dead", "http://www.goodreads.com/book/show/30188357-call-for-the-dead", "http://www.goodreads.com/book/show/12358271-call-for-the-dead", "http://www.goodreads.com/book/show/19494.The_Spy_Who_Came_In_from_the_Cold", "http://www.goodreads.com/book/show/10073506-tinker-tailor-soldier-spy", "http://www.goodreads.com/book/show/18999.Smiley_s_People", "http://www.goodreads.com/book/show/270521.The_Russia_House", "http://www.goodreads.com/book/show/19000.The_Constant_Gardener"]}