{"ratings": 353, "userreviews": [{"userName": "Maggie", "userReviewDate": "Feb 01, 2012", "userURL": "http://www.goodreads.com/user/show/147203-maggie", "userReview": "Pretty much everything you need to know about the Mets, the worst season in the history of baseball, greedy owners, and New York baseball fans. Breslin is at times hilarious, with an almost vaudevillian sense of timing. He's also very realistic and very true as to the nature of Mets fans, who know that their team is made up of bums, but cheer just as loud when someone makes second base as they would if it were a home run. On Mets Fans:\"You see, the Mets are losers, just like nearly everybody else in life. This is a team for the cab driver who gets held up and the guy who loses out on a promotion because he didn't maneuver himself to lunch with the boss enough. It is the team for every guy who has to get out of bed in the morning and go to work for short money on a job he does not like. And it is the team for every woman who looks up ten years later and sees her husband eating dinner in a T-shirt and wonders how the hell she ever let this guy talk her into getting married. The Yankees? Who does well enough to root for them, Laurence Rockefeller?\" (pp. 77)Pretty much."}, {"userName": "Jeff", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/5917744-jeff", "userReview": "This book is always listed among the top 50 or 100 books written about baseball. Frankly, I can't see what the fuss is about. The style is meandering. He goes off on tangents for three or four pages that only seem remotely connected to the theme. It had some very interesting points and made some interesting analyses about New York City and the effect the move of the Dodgers and the Giants and the arrival of the Mets had on the city. It is a short book and an easy read. It was an ok book, but having heard about this book for years as a baseball fan, I'm still not sure that all the fuss is about."}, {"userName": "Tatiana", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/613164-tatiana", "userReview": "\"This is a team for the cab driver who gets held up and the guy who loses out on a promotion because he didn't maneuver himself to lunch with the boss enough. It is the team for every guy who has to get a job he does not like. And it is the team for every woman who looks up ten years later and sees her husband eating dinner in a T-shirt and wonders how the hell she ever let this guy talk her into getting married. The Yankees? Who does well enough to root for them, Laurence Rockefeller?\"Amazingly, a lot of the gaffs and improbable losses noted in this book are familiar to someone like me who was born in the 80's, long after they should have disappeared. It's sort of comforting to know that the Mets were lovable losers from the beginning. And fascinating to get a glimpse of NYC in the 60's."}, {"userName": "Joe", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/5439793-joe", "userReview": "Book still stands up, almost 50 years later. I was at the game on that Sunday in May or June at the Polo Grounds when Marvelous Marv Thronberry made an error in the first inning to allow Cubs to score and then hit a triple in the bottom of the first to atone for his error. But then the Marvelous One was called out for missing second base. When Casey Stengel came out to argue, the ump held up his hands to ward Stengel off, explaining \"Forget it, Casey, he missed first base, too.\""}, {"userName": "Samuel", "userReviewDate": "Feb 14, 2009", "userURL": "http://www.goodreads.com/user/show/234788-samuel", "userReview": "I fucking hate the mets but this book is great- a baseball must. Breslin is hilarious and if you've ever loved a shitty team this book will definitely shed some insight into your hopelessness."}, {"userName": "John", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/5036642-john", "userReview": "I like Breslin's style (expect digressions), but this book is a bit of ancient history (1962) on baseball. His remarks about the increased commercialization of baseball is a bit quaint, given the great financial windfalls enjoyed by modern sports leagues today. But his description of the Mets' defensive ineptitude is still humorous today."}, {"userName": "Michael Ferraro", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/34535086-michael-ferraro", "userReview": "Lots of journalistic shoe-leather and awesome bar-room, connect-the-dots tangential anecdotes and asides from a young Jimmy Breslin (early 30s), flashing old-soul wit and wisdom alike as he chronicles and tries vainly to assess the universal appeal of the Marv Throneberry-centric historically bad stumblebum babies of 1962. From Casey Stengel and Choo Choo Coleman to Senators and cab drivers alike, Breslin talks to all the right sources and paints a hilariously pretty picture of a team set up to fail, which won the hearts of millions in process."}, {"userName": "Seamus Thompson", "userReviewDate": "Apr 28, 2011", "userURL": "http://www.goodreads.com/user/show/5266058-seamus-thompson", "userReview": "Amusing tribute to the '62 Mets -- the original lovable losers. And lose they did: 120 games. They lost nine straight to start the season and lost as many as 17 consecutive games later that year. They had two pitchers who *lost* twenty games. But that Mets team, formed to bring National League baseball back to NY, was beloved. Why? As Breslin puts it: \"You see, the Mets are losers, just like everybody else in life. This is a team for the cab driver who gets held up and the guy who loses out on a promotion because he didn't maneuver himself to lunch with the boss enough. It is the team for every guy who has to get out of bed in the morning and go to work for short money on a job he doesn't like. And it is the team for every woman who looks up ten years later and sees her husband eating dinner in a T-shirt and wonders how the hell she ever let this guy talk her into getting married. The Yankees? Who the hell does well enough to root for them, Laurence Rockefeller?\"Breslin's account of the '62 Mets encompasses the owners, backers, fans, and coaching staff but it is at its best when he describes the miraculously bad play on the field. My personal favorite was an agonizing (and hilarious) description of how the Mets defense managed to blow *four* consecutive double-play opportunities in a single inning (88-90)."}, {"userName": "Chris", "userReviewDate": "May 20, 2009", "userURL": "http://www.goodreads.com/user/show/36341-chris", "userReview": "I wasn't alive when the Loveable Losers were formed, but I'd like to think that if I lived in New York at the time, I would have been a Mets fan. I'm sure I would have, seeing that I loved the Tigers before they went to the series in '06 (just three years out of being one loss shy of tying the Mets 120 loss record) and I hate the Yankees. If you hate the Yankees in live in New York, you have to like the Mets for your NL team. (For the record, I also hate Boston, since they are just like the Yankees, only even more insufferable).Breslin's writing is classic, old-school sports journalism, and it reads like you're sitting down with him for a whisky at a sports-bar. You're both smoking Pal Malls, and the radio is carrying the races out at the Aqueduct. That's what this reads like, and he can spin out a bone-headed sports yarn like no bodies business. I think it would be hilarious even if you didn't like baseball; if you do, his timing is fantastic, and you sort of want to travel back to '62 so you can sit in the Polo Grounds with a T-Shirt reading VREM."}, {"userName": "Bill S.", "userReviewDate": "Oct 28, 2014", "userURL": "http://www.goodreads.com/user/show/4254735-bill-s", "userReview": "Here, back in print, is Jimmy Breslin's marvelous account of the improbable saga of the New York Mets' first year, as Bill Veeck notes in his Introduction, \"preserving for all time a remarkable tale of ineptitude, mediocrity, and abject failure.\" Indeed the 1962 Mets were the worst major league baseball team ever to take the field. (The title of the book is a quote from Casey Stengel, their manager at the time.) Breslin casts the Mets, who lost 120 games out of a possible 162 that year, as a lovable bunch of losers. And, he argues, they were good for baseball, coming as a welcome antidote to \"the era of the businessman in sports...as dry and agonizing a time as you would want to see.\" Although they were written forty years ago, many of Breslin's comments will strike a chord with today's sports fan, fed up with the growing commercialism of the games. Against this trend Breslin sets the exploits of \"Marvelous\" Marv Throneberry, Stengel, and the rest of the hapless Mets."}, {"userName": "Ceejay", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/16627480-ceejay", "userReview": "Here it is....the who, what, where, when, why, and how of the New York Mets first year as a team....the team that made them the worst in baseball history! It wasn't easy to lose 120 games, but the Mets did it. Jimmy Breslin was the perfect person to write this little saga.I really miss the guy.If you care about baseball, then this is the book for you.There are so many interesting stories in this book. One example. Stan Musial waited an extra year to retire because playing the Mets would help his stats! Even if baseball isn't your thing, reading this entertaining book will have you laughing out loud."}, {"userName": "Kenn Staub", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/17445820-kenn-staub", "userReview": "I've wanted to read this book about the first year of the New York Mets for a long time and finally had the opportunity to do so. I was not disappointed, as this book from the 1960s brought an old school journalistic/sports writing sensibility to the topic. Its a snapshot of a time, a place, a team, and some of the most iconoclastic individuals in baseball lore...Stengel, Thronberry, et al. My only complaint, and it is somewhat minor, is that the author has a tendency toward tangents (sometimes on topic, sometimes off)."}, {"userName": "Jay", "userReviewDate": "Feb 28, 2008", "userURL": "http://www.goodreads.com/user/show/895998-jay", "userReview": "a) breslin is a serious fucking journalist; he's the guy that the son of sam sent his \"hello from the gutters\" letter to at the daily news.b) this is fucking hilarious, heartwarming and why i could never be a yankee fan, 20 some-odd championships be damned.c) i wish i was alive to see this all happen so badly."}, {"userName": "Ray", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/2665801-ray", "userReview": "This is a very funny book about the Mets first season in 1962. Great stories about Casey Stengel, Marvelous Marv Throneberry, et al. They still hold the record for the most losses (120) in a season. The book was written in 1963 so the author had a first hand account of all the mishaps and oddities. Little did he know that in seven years they would become the Miracle Mets."}, {"userName": "Alan", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/1025126-alan", "userReview": "Good fun! Jimmy Breslin brings a snarky, sports columnists voice to the truly horrible 1962 New York Mets - arguably the worst, but yet most lovable team in baseball history. At times he's a one-trick pony (we get it, they are so bad they are good!), but his portrayal of early 60s New York and baseball at the time is worth the read."}, {"userName": "Paul Miller", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/51949098-paul-miller", "userReview": "A SF Chronicle columnist called this the \"best baseball book ever\". So I had to pick it up. A really fun find. It's from 1963 about the Mets first year - when they lost 120 games! Gives you a great view of the love affair of NYC w/baseball and the Mets in particular - the Yankees are too \"perfect\" while the Mets are more like 'us'. Very fun, quick read."}, {"userName": "B", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/6063018-b", "userReview": "Funny and sentimental without overdoing it. In fact, it could probably use even more zany Mets play-by-play to overcome the \"this is what time does\" and \"everyone is really a loser\" mawkishness. But the balances works. Short, funny, and actually a little meaningful."}, {"userName": "Nathan", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/1500217-nathan", "userReview": "this is a collection of a bunch of newspaper articles that made me think newspapers suck now."}, {"userName": "Luis Perez", "userReviewDate": "Jan 25, 2010", "userURL": "http://www.goodreads.com/user/show/2476300-luis-perez", "userReview": "A look at the New York Mets' first year of baseball. A comedy of errors -- the team, not the book. This is a fast-paced easily digestable tale of abject failure on the diamond."}, {"userName": "Steve Ponedal", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/23900095-steve-ponedal", "userReview": "Pulitzer-prize winner writes about the lovable loser '62 mets. Stories from the bar keeps, cabbies and wise guys on why they loved their mets. Good read for a mets fan. Cheap kindle book."}, {"userName": "Matt", "userReviewDate": "Aug 09, 2009", "userURL": "http://www.goodreads.com/user/show/147154-matt", "userReview": "This book effectively sums up why I am a Mets fan in both its description of the 1962 Mets and the wit with which Breslin writes."}, {"userName": "Phil", "userReviewDate": "Aug 15, 2015", "userURL": "http://www.goodreads.com/user/show/2039086-phil", "userReview": "My copy of this book is signed by the author, Jimmy Breslin, who wrote on the cover page, \"Why root for the Yankees? Anybody can do that.\" That pretty much sums it up."}, {"userName": "Edva", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/6897495-edva", "userReview": "Poorly written drivel."}, {"userName": "Sam", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/16728633-sam", "userReview": "This book was written in 1963, the year after the Mets came into the National League as an expansion team to replace the Dodgers and the Giants, who had moved to the West Coast. A period piece, you won't get any advanced stats, comparison to later Mets Team (for example, the Miracle Mets of '69), or sabermetrics. Instead, you'll get a honest appraisal of what National League baseball in general, and the Mets in particular, meant to the city of New York.In short, the Mets of 1962 reflected the lives of the majority of people everywhere: they were defined by failure. As such, they were incredibly relatable. You couldn't hate the Mets, because deep down, you knew you were the Mets. Far from getting disgusted at the foibles and folly of the team, the city embraced the team, its players, and its old, eclectic manager. This is a great, quick read for any baseball fan."}, {"userName": "Darren", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/4735503-darren", "userReview": "(My Spring training 9 innings of books read)3 StarsI normally would've given this 2.5 stars, but I cut it some slack since the book is older than I am. Many of the stories within the book are just absolutely hilarious - I loved the third baseman that ran towards short every time the ball was hit along the third base line, all of the Marvelous Marv stories, the time when the Mets managed to blunder 4 double plays in a row, the time they gave up 17 runs in the first four innings -and Breslin has a real way with words; who else would describe a pitcher's retirement as a disappointment to American League batters everywhere.But the book is also a bit of a disorganized ramble through the Mets adventures mixed with way too many stories about racing."}, {"userName": "Shawn MacDonald", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/7469195-shawn-macdonald", "userReview": "Just a quick, easy read by one of the all-time great sports reporters. This book should be required reading for all Detroit Tigers fans in 2018 because I think the Tigers have a long couple of years ahead of themselves, so finding some joy in bad baseball is going to be important. Paraphrasing Breslin, the Tigers really are the people's team because when the hell was the last time you won anything?"}, {"userName": "Brice Fuqua", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/69731752-brice-fuqua", "userReview": "Classic account of the worst baseball team in Major League history, the 1962 New York Mets. In spite of their incompetence, the Mets drew large crows of loyal fans. Breslin tells the story of how the team came about and why they were so bad. Recommended for anyone who loves baseball or the Big Apple."}, {"userName": "Melissa Miles", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/20636680-melissa-miles", "userReview": "Slapstick, screwball, and all wonderfully true. Jimmy Breslin is sorely missed, and the Mets still break our hearts year after year."}, {"userName": "Roger", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/804513-roger", "userReview": "Embarrassed to admit that I had not read this book before. Boy did the Mets stink. Breslin made it sound fun to witness somehow."}, {"userName": "RC", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/1793234-rc", "userReview": "Laugh-out-loud hilarious for the first half or so. Not quite as hilarious in the back half, but it's a quick, sweet, short read about the worst season any team has ever had in the history of major league baseball that gets to the heart of why Mets fan love their losers."}], "description": "Here, back in print, is Jimmy Breslin's marvelous account of the improbable saga of the New York Mets' first year, as Bill Veeck notes in his Introduction, \"preserving for all time a remarkable tale of ineptitude, mediocrity, and abject failure.\" Indeed the 1962 Mets were the worst major league baseball team ever to take the field. (The title of the book is a quote from Casey Stengel, their manager at the time.) Breslin casts the Mets, who lost 120 games out of a possible 162 that year, as a lovable bunch of losers. And, he argues, they were good for baseball, coming as a welcome antidote to \"the era of the businessman in sports...as dry and agonizing a time as you would want to see.\" Although they were written forty years ago, many of Breslin's comments will strike a chord with today's sports fan, fed up with the growing commercialism of the games. Against this trend Breslin sets the exploits of \"Marvelous\" Marv Throneberry, Stengel, and the rest of the hapless Mets. \"Wonderful.\" Charles Salzberg, New York Times. \"A touching, enjoyable, and interesting addition to anybody's sports reading list.\" Patrick Conway\"", "title": "Can't Anybody Here Play This Game?: The Improbable Saga of the New York Mets' First Year", "url": "https://www.goodreads.com/book/show/406591.Can_t_Anybody_Here_Play_This_Game_", "average": 3.9, "cover": "https://images.gr-assets.com/books/1388856620l/406591.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/53424.Jimmy_Breslin", "name": "Jimmy Breslin"}, {"url": "https://www.goodreads.com/author/show/185433.Bill_Veeck", "name": "Bill Veeck"}], "type": ["Sports", "Sports and Games", "Nonfiction", "New York"], "outlinks": ["http://www.goodreads.com/book/show/406591.Can_t_Anybody_Here_Play_This_Game_", "http://www.goodreads.com/book/show/10956460-can-t-anybody-here-play-this-game", "http://www.goodreads.com/book/show/13497410-can-t-anybody-here-play-this-game", "http://www.goodreads.com/book/show/13568144-can-t-anybody-here-play-this-game", "http://www.goodreads.com/book/show/2632562-can-t-anybody-here-play-this-game", "http://www.goodreads.com/book/show/1924935.The_Good_Rat", "http://www.goodreads.com/book/show/607124.The_Gang_That_Couldn_t_Shoot_Straight", "http://www.goodreads.com/book/show/10151616-branch-rickey", "http://www.goodreads.com/book/show/662206.The_Short_Sweet_Dream_of_Eduardo_Guti_rrez", "http://www.goodreads.com/book/show/720321.How_the_Good_Guys_Finally_Won"]}