{"ratings": 771, "userreviews": [{"userName": "Crista", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/3194546-crista", "userReview": "After finishing this book, I'm feel'in HOT, HOT, HOT! Holy smokes, this book certainly turns up the heat and for the most part, I whole-heartedly recommend it!This book features Luc's (from Can't Buy Me Love) sister Victoria and their sexy ranch foreman, Eli. In all honesty, I couldn't stand Victoria's character in the previous book, however, this author has an amazing ability to redeem even the most unlikable characters. Throughout this book, I ended up really liking Victoria and respecting her courage and heart.What was frustrating, yet appreciated about this book was the realism of the characters. In Can't Buy Me Love, Luc and Victoria's father remains a complete jerk throughout the book and never redeems himself. The same is true with this story. The unlikable characters remain unlikable and there is no \"perfect ending\" where everything is tied up in a nice pretty bow.Eli's mom took off and left he and his alcoholic father when Eli was only 8 years old. The abandonment that Eli faced from this event impacts every aspect of his life and how he relates to others. I love a tortured hero and Eli personifies this as he struggles with internal torment. He is a commitment-phobic and carefully protects his heart from anyone who could potentially cause him pain. Victoria and her adorable son sneak past all those defenses and remarkably, this detached man comes to terms with his feeling far before Victoria does.The sensuality in this book is scorching. The sex scenes are plentiful and very creative :-)! Victoria longs to explore her sexuality, and Eli is up for the task every. single. time.There was quite a lot going on this book, however there were a couple of aspects of this story that I felt could've been left out as they did nothing to further the story. Some of the minor characters almost became a distraction. There is a secondary love story happening in the background of the primary love story in this book, and the couple for the next book is introduced towards the end of the book. I must say I am very intrigued about their book as well. Ms. O'Keefe has a strong writing voice, almost reminiscent of Susan Elizabeth Phillips, a favorite author of mine. I am eager to start the next book in this series Crazy Thing Called Love!"}, {"userName": "Tina \"IRead2Escape\"", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/3082213-tina-iread2escape", "userReview": "4.5 StarsCan’t Hurry Love is the 2nd book in the Crooked Creek Ranch series by Molly O’Keefe and the best one, yet! I loved this book! It had it all, angst, overcoming the past, a kid, a very hot cowboy and great sex! Victoria Baker is taking back her life. She was under the thumb of her father for years and went straight from him to a husband that expected a society wife to do his bidding and keep her mouth shut. This fit her perfectly. She was never the brave one and was fine with her husband having that role. That is until he stole money from their friends and others and then killed himself in their den rather than face the world. Now, she’s back on the ranch that her father left to Victoria’s brother in his will. Luc told Victoria he would give her a year to make a go of things. If all is well she could have it all. This is a lot for a coward, but she has to do something for herself and her son. She decides to put her trust in the foreman whose always wanted the ranch and gets burned. Little does he know, he gave her the push she needed to finally be brave and explore a dream she’s always had. Now, if only she can use this new strength to keep her distance from that same foreman who is the center of her fantasies.\nStaring at his ass was inappropriate. She totally knew that. But part of her wanted to write a letter of appreciation to the Wrangler Denim Company, because honestly…\n Eli Turnbull has been the foreman of Crooked Creek Ranch for as long as he can remember. He’s always thought he’s paid his dues and when the old man died he would get first shot at buying the land, once owned by his family, back. He was blindsided and oh so angry when it was all left to the snot, nosed kids that had never looked back when they left years ago. He finds himself taking his anger out on Victoria. She knows nothing about a ranch, yet she has it and he doesn’t. With her permission, he sells most of the prized herd that the late Lyle Baker loved more than anything else on earth. This leaves Victoria holding land that she has no means of income. He pushes Victoria to the breaking point one day and she fires him. Little did she know, she saved his life when she issued those 2 words. He is finally able to let go of the ranch and start his own life. Unfortunately, that’s harder than you would think. He can’t get his mind off of the beautiful Victoria and he finds himself respecting her more and more. She makes him want things and feels things he thought he didn’t have in him. Now, he just has to make her overcome her fears and give them a chance to be a family.\n“You can be scared to love me. I get it, it’s scary. And I’m in no hurry.” His smile was so sweet, the sweetest thing she’d ever seen. “But don’t be scared to let me love you.”\nSeriously, you can’t not love this book! It was so much fun to see Victoria come to terms with the woman she was meant to be. I absolutely loved everything about Eli. He did a few mean things, but he always realized it and did his best to make it right. He was good to Victoria’s son and seemed to really like him. The sex was great and the banter was fun! The peripheral characters were just as fun. Read this book!You can find this review and others at http://tinar1121.blogspot.com"}, {"userName": "JoLee (Wickedly Delicious Book Blog)", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/5319767-jolee-wickedly-delicious-book-blog", "userReview": "I was curious about Eli from Can’t Buy Me Love #1 and my heart ached for him in Can’t Hurry Love. His mother left him and his dad when he was eight and never seen her since. His dad took it out on him by drinking, barely feeding him and never cared if he went to school. I went into Can’t Hurry Love knowing I did not like Victoria, but I was hoping she would turn out better than her spoiled brat character from Can’t Buy Me Love. Oh My Goodness she became just flat out evil and mean. She is turning the ranch into a spa and hires Eli’s mom as the architect, knowing that she left Eli when he was young and he was not going to be happy about it. I was enjoying Can’t Hurry Love until Victoria’s betrayal. I did not feel she redeemed herself from this. Kudos to Molly O’Keefe for writing an intense betrayal scene and loved the out come of it. It was nice to see Eli not take it too well. Eli’s character I adored and loved his relationship with Jacob. Even though I was not big on Victoria and Eli’s relationship and think he deserved better, the epilogue was sweet and sad. I really wanted to like this book more, but it is so hard when most of the characters are mean, unlikable and never redeem them selves.ARC provided by NetGalley for an honest review.Originally posted at Wickedly Delicious Book Blog"}, {"userName": "Michele", "userReviewDate": "Aug 03, 2012", "userURL": "http://www.goodreads.com/user/show/8464702-michele", "userReview": "Can’t Hurry Love is a sexy, emotionally gripping, complicated love story about two people who are deeply scarred by their pasts. It is a story about the struggles of two people trying to overcome the hurts and disappointments from previous relationships in order to be able to open up their hearts to one another. Molly O’ Keefe's characters are beautifully flawed and real. They are so fleshed out that they simply pop off the page. Eli and Victoria start off as characters that are not very likable, but as we learn more about their difficult past experiences, we begin to empathize with them and forgive them for their flaws.I loved watching Eli and Victoria transformed by the relationship building between them. They each had emotional baggage to deal with, but they eventually found that with the love and support of the other they were able to work through their issues. The dialogue in this book was excellent. It was emotional, realistic and purposeful. Ms. O' Keefe's stories suck me in to the point that I am unable to put her books down until I am done. Once I finish them though, I feel sad because I am not ready to let her characters go! I highly recommend this book to anyone who likes sexy, emotional stories that will tug at your heart strings."}, {"userName": "Dianne", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/1401819-dianne", "userReview": "Can’t Hurry Love Molly O'KeefeThis is the second book of Molly O’Keefe’s series, with a third book “CRAZY THING CALLED LOVE” – Coming January 28, 2013. This series all started with the death of Victoria’s father and the fact that Lyle Baker (her father) was using his death and wealth to lure his children back to the ranch and reunite them. So far, it has been working quite spectacularly. With this book, we find Victoria Baker, the ‘bastard’ daughter of Lyle helping her brother Luc out. Luc inherited the ranch and now Victoria is going to run it. She is a mousy little thing whose husband created a Ponzi scheme and then took the easy way out of his troubles by killing himself. Now she is up against Eli Turnbull the foreman of the ranch and he wants the land from the Baker family since Lyles family had taken advantage of Eli’s when they acquired the land years and years ago.Of course, tempers flare and sparks fly when Victoria and Eli meet. In fact, Eli and Victoria act like spoiled children over this ranch and its land. Soon they will come to an understanding of sorts, one that will be sexual in nature and quite hot at that.Victoria decides to turn the ranch into a spa and for me that is where the story went downhill. I can understand that fiction writers can and will take many liberties when writing. I can understand why, but the story of the remodel is, for anyone who has ever done something like a remodel, just too unbelievable.Eli is so damaged from his mother leaving and his bitterness with the Bakers that he nearly becomes a caricature. Yes, a lot of his hurt is understandable, but I think I’m just getting annoyed with books were both characters are dark, bleak, soul-searching, overly inner dialoguing and angsting people who are unsure of themselves and feel as if they don’t deserve to be happy or loved. I read for escape as most people do, and to read something that is at times depressing and angry when I am trying to lose myself in a book...it is just too much. That all they deserve is sex, a lot of spectacular sex to be sure, but empty nonetheless. It’s depressing. Then to get even luckier, we are treated with a secondary story of Luc’s mother and her quest for youth and coping with the changes a 65 years old has to eventually face with her looks. She too will be angsting and inner dialoguing to beat the band. She even has a younger and wildly handsome man lusting for her body and wanting her mind and she is still miserable and taking it out on everyone. I just couldn’t take the unhappiness of this book, even though I knew it had to have its ‘happily ever after’ I had to work too hard to finish it.. Too many things just seemed off about this book, especially after such a strong start to this series.The sex was smokin’ hot and I really wonder what Ms O’Keefe will do in her third book to top this escapade. The sex and sex scenes seemed to increase over the first book."}, {"userName": "Janga", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/1206531-janga", "userReview": "Reading Can’t Hurry Love, I was reminded of one of my favorite Flannery O’Connor quotations: “There is something in us, as storytellers and as listeners to stories, that demands the redemptive act, that demands that what falls at least be offered the chance to be restored.” Molly O’Keefe’s Crooked Creek books feature deeply flawed characters who need redemption. For Luc and Tara Jean in Can’t Buy Me Love, despite their real faults, I found something likeable in them early on. It took me much longer to like Victoria and Eli and even one of the secondary characters--Luc’s mother, Celeste. There is humor in the book, but at the heart of it, there is darkness because these are characters who dislike themselves. When Eli makes choices that will hurt Victoria, he dislikes the man he is becoming. Victoria hates the weak, needy woman that she has been. Celeste hates her coldness and snobbery. It was not until they began to change and their vulnerabilities were exposed that I began to care about their happiness.See full review at Just Janga:http://justjanga.blogspot.com/2012/07..."}, {"userName": "Lisarenee", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/2038272-lisarenee", "userReview": "They say once you hit rock bottom there's no way to go but back up. What they don't tell you is that sometimes when you're attempting to stand back up, you get knocked right back down again. That would pretty much sum up Victoria Baker Schulman's life. Every time she's hit bottom something or someone knocks her back down. Now she was attempting to get her life together once more and wouldn't you know it, Eli Turnbull, the ranch's sexy manager, was taking his turn at bat attempting to thwart her plans of running the ranch and getting her life back on track.Eli had a history with the Bakers. His whole family did. Years ago the Bakers and taken advantage of the Turnbulls and piece by piece stolen their land. Oh, everything had been done above board, but they'd taken advantage of the family at a desperate time, low balling on the price they'd snatched the land up for for less than what it was worth. When he heard Victoria declare she was keeping rather than selling the Crooked Creek Ranch, he decided turnabout was fair play. He was going to use every method available to get what he felt rightfully belonged to his family back._________________________________________________When I read Can't Buy Me Love I wondered if a romance would be in the works for Victoria and Eli. Eli was painted as such a nice guy in that book, and I thought the two would make a good match. In the beginning of Can't Hurry Love, however, we see a completely different side to Eli, one I didn't like. Thankfully it wasn't one he liked either, but it took me longer than Victoria to like him again.The Turnbulls have been upset with the Bakers for years. It seems with each generation the Turnbulls would pass their sense of being robbed of their family land and birthright to the next generation. While Eli's father and uncle may have had a better feeling of betrayal being as they still remember when the ranch was still in their family, Eli has only learned the sentiment from them. His initial plan was to wait patiently for the land to come back to him when Lyle died, but then Tori (Victoria) got it in her head to run the place. His dreams and plans for the last 10 years had all been for naught. Combine that with an Uncle who knew how to push his buttons and Eli, well, let's just say he acted in a way that would not be labeled as one of his finer moments. Victoria had been wasting away since her husband decided to commit suicide rather than face the consequences of his swindling a lot of people out of a lot of money including some of his closest friends. With his death, the burden of the blame had unjustly fallen onto Victoria's shoulders. Now she was determined that when push came to shove she'd shove right back. So when she found out Eli and basically sabotaged the ranch by selling off nearly all of their main source of income--her father's prized Angus heard, she got busy finding another means for the ranch to make money. She leased the land Eli so desperately wanted to get his hands on. Hey, all's fair in love and war and she was fighting for survival.This is definitely a more serious read than a lot of contemporary romances. The hero and heroine both have issues they need to come to terms with and deal with. Only then can the two truly be a couple. They may not be a perfect individuals, but in the end they are perfect for each other. I liked the fact that Victoria had to pick herself up, dust herself off, and realize she needed to change or nothing would change. I like seeing a heroine rise from the ashes of life because occasionally we do too. While their imperfections might take the fairy tale edge off the story, I find it can sometimes make the tale all that much more enjoyable.Overall, I gave this one 3 1/2 out of 5 roses. I liked how Victoria stood up for herself and faced her inner demons while finally figuring out who she was, what she wanted, and not backing down when things got uncomfortable. I liked how Eli stopped trying to please his uncle and left the family skeletons where they should be--buried. If I was Victoria, however, I don't think I could have trusted Eli enough to actually start a relationship with him. I'm chalking this up, however, to her knowing him well enough when she was younger to know that his one night of bad behavior was totally out of character for him. On the Lisarenee Romance Rating Scale, this one gets a STEAM rating--- too hot for a fan, but you still have a handle on things. You should use extreme caution when reading a book with this rating in public. People may inquire as to why you looked flustered and flushed.Order of series:\n\nTo see more of my reviews, please visit my blog at www.seducedbyabook.com I'd greatly appreciate it. :)"}, {"userName": "Dottie", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/7899652-dottie", "userReview": "A story you will not want to miss! Actually rated 4.5. Taken from my review at RomanceJunkies.com:After her financier husband became embroiled in a scandal and subsequently killed himself, single mother Victoria returned to her father’s ranch with her son Jacob. After her father’s death, the ranch is left to her brother Luc, who wants nothing to do with it. So he offers it to her, giving her a year on the ranch until the escrow runs out. Then she can purchase it from him. This is a dream come true for her, but she does not know how to run a ranch and she has failed in her past endeavors. To make a success of the ranch she needs the help of the foreman Eli. Unfortunately, Eli is upset about her father’s will.The ranch had once belonged in Eli’s family and he wants it back, feeling that Luc and Victoria’s father cheated his family out of it. So, after working for the man for many years, he is upset when all he is left is part interest in the stock. He had been willing to buy the ranch from Luc and had hoped to do so, until Victoria decided she wanted it. She knows absolutely nothing about running a ranch and now she expects him to teach her what she needs to know. But he figures that by selling the stock, Victoria will have no way to make money, although she doesn’t seem to realize that fact. It could also mean that she would sell him the land a little at a time, as she needed the money, the same way his family had lost the ranch to the Bakers over the years. He has his wealthy Uncle John to back him, but he has worked the Crooked Creek Ranch for years and is determined to do this on his own.However, just as Eli has a plan for the land, so does Victoria and she is just as determined as he is. She wants to turn the ranch into a spa with the help of her stepmother Celeste, her housekeeper Ruth and even Eli’s estranged mother. Despite all of this, it doesn’t take long for Eli and Victoria’s passion for the land to turn into a completely different kind of passion for each other. How long will it take before they realize that what they really want is right in front of them?An emotion-packed read, CAN’T HURRY LOVE, the latest book by RITA award winning author Molly O’Keefe, is a witty, passionate contemporary romance that will capture your interest from the very beginning. Most of Victoria’s past failures are due to lack of confidence thanks to her abusive husband. Add to that the scandal and all the attention it engendered and all she wants is to escape to the ranch. But as she starts taking care of problems around the ranch, she begins to gain confidence and stops second guessing herself. The spa has been her dream for a while and she is finally getting the chance to see it come to fruition, if Eli does not put a stop to it. The secondary characters add a great deal of appeal to this story. Filled with humor, sizzling situations, emotion, complex characters, clever banter, romance and second chances, this story is one you will not want to miss. Although this book can be read as a standalone, you will not want to miss CAN’T BUY ME LOVE for further insight into this story as well as additional enjoyment. I enjoyed this story immensely and look forward to seeing what Ms. O’Keefe comes up with next.Dottie, RomanceJunkies.com"}, {"userName": "FicTalk Blog", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/5032340-fictalk-blog", "userReview": "Reviewed by LisaI was going back and forth between rating this book 2 stars or 2.5 stars. I finally settled on 2 stars because, to be honest, this book drove me up a wall. Wait, let me be clear, the characters in this book drove me up a wall.I have to say that the heroine especially was the most annoying for me. She was too wishy-washy and couldn’t make good decisions about her life and her relationships. She flip-flopped around too much for my liking, and came off rather whine-y, and unlikable.The Hero, well, he wasn’t as bad, but he also wasn’t much better, either. I swear to all that is Holy, if I wasn’t reading this book on my kindle I would have thrown it against a freaking wall.I get that both characters had their issues. Victoria Baker, who just recently lost her scheming husband due to him offing himself because of all the people that he stole from, is back on Crooked Creek ranch after the death of her father and is trying to make a go at running the ranch and making something of herself, and not having to depend on a man for security.Eli Turnbull, is the ranch’s foreman, and has been working on the ranch for the past fifteen years, is trying to sabotage any and all of Victoria’s efforts at running the ranch by selling off more than half of the ranch’s livestock. And this is all because he wants what is owed to him and his family: The land now known as the Crooked Creek ranch that his grandfather sold of bit by bit whilst in a drunken stupor.He succeeds, but Victoria isn’t so easily cowed, or so she pretends to be. It isn’t until he does something that is so unforgivable, like bringing her seven year old son into the mix. I did agree with Victoria in that regard, if you want to mess with me, fine. But do not ever bring my son into your little game of revenge.The only time I started to actually feel and relate to these characters was at the 80% mark, not going to lie.So yes, overall, this book just wasn’t for me. It wasn’t as engaging as I’d have liked and while the storyline was what caught my attention it just didn’t deliver. It took too long to really develop, the characters made me want to pull my hair out of my head, and it just all felt too long and drawn out, then rushed at the ending with the happily-ever-after ending. Unrealistic, in my opinion."}, {"userName": "Franny (The Reader's Edge)", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/5328956-franny-the-reader-s-edge", "userReview": "In CAN'T HURRY LOVE, Victoria's husband Joel committed suicide after being caught running a ponzi scheme. Thrust out of her posh life in New York City, she begins the steps to start anew. Victoria asks her brother, Luc, if she can run the ranch left to him by their father until it is out of escrow and she can purchase it for herself and her son. She had never really felt she had accomplished much besides having a wonderful son who is now 7 years old. Eli, the ranch foreman, had been planning to buy the ranch from Luc, but his plans are thwarted by Victoria's desire to buy the ranch. He decides he has to run her off if he is to have a chance to own the ranch his family has worked for the past three generations.I wasn't sure what to expect from CAN'T HURRY LOVE. I had read the blurb and it had piqued my interest. It was reminiscent of a modern day Romeo and Juliet/The Hatfield vs. The McCoy's. In this case it was the Turnbull's and the Baker's. Eli's family has lost their land to the Bakers, bit by bit. All he wanted was to get it back. His dad spent his life bitter and unsuccessful in getting the land back. His legacy was passed to Eli to accomplish his father's wish. The attempts were making Eli bitter and hateful. It made him into someone he didn't want to be. Victoria was crapped on by her dad, then her husband, her boyfriend and finally by Eli. Eli's betrayal gave Victoria the push/courage to discover and live her dream. Victoria only wanted to accomplish something on her own, to mean something to someone besides the unconditional love of her son.I started out thinking Eli was a real jackhat. There was an evolution in many of the characters including Eli and Victoria. Eli went from jackhat to hero, swooping in to save the day. I went from sympathizing with Victoria to wishing she would get her head out if her petunia. I burned to read CAN'T HURRY LOVE, finish it, to find out what was next. I would have stayed up all night and skipped work if I didn't need a job to maintain a roof over my head. My gut was in knots at pivotal points. CAN'T HURRY LOVE is a solid Contemporary Romance with hot, sexy cowboy and a frumpy socialite turned sex fiend and deviant."}, {"userName": "Christi Snow", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/715656-christi-snow", "userReview": "My Review:When I read book #1 in this series, I hated Victoria's character, but was determined that I would still give this book a chance. Thank goodness that I did because I adore both her and Eli's characters in this book. These are two people who are so caught up in their own misery and bitterness that they have a hard time seeing anything else. That's what makes this book so good though because you see both their transformations as their relationship develops and they both get there in very different ways.For Victoria, she's had a really hard last few years. Her husband masterminded a ponzi scheme and then killed himself in their home when it all came out. While she was still reeling from all that, her 7 yo son, who suffers from asthma and allergies, almost died. She lost her home, her friends, all her money, and all the things that had made up her identity since she got married. She is determined that running this ranch is going to pull herself out of that misery. Standing in her way is Eli. He wants nothing more than the ranch to fail. If he can't have it, then no one else deserves it. Certainly not the spoiled little princess, Victoria. It's no secret that they get off to a really awful, vicious start as they attack and retaliate through the first few chapters of this book. Finally, their conflict hits a climax and it opens Eli's eyes to the person he's become. Like I said, there is a really nice character arc through this book. At the beginning neither one is a very good person and certainly not anyone that you would want to know. But watching their struggles and discoveries is a wonderful journey. I LIKED this book...a lot and I absolutely fell in love with both these characters. They are so wounded and scarred. For me, they both just simply touched my heart. I wanted to weep for both of them at different times throughout the book. Just a really incredible book!I received a complementary copy of this book in return for an honest review."}, {"userName": "Elisabeth", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/3878131-elisabeth", "userReview": "I've been sitting on this book for almost 5 months because I really want to write a review. It's one of few books that I finish reading and immediately start again.The main characters are just so f*cked up. We met both in the previous book of the series. Victoria was Lyle Baker's illegitimate daughter whose inheritance was contingent on her brother staying on the ranch. An unlikable character - she was the widower of a lawyer who had commited suicide after his ponzi scheme got found out, and a woman who simply didn't know how to carry on from there.Eli is Lyle Baker's foreman, like his dad before him and his dad's dad before him. Before that they owned the land before lousy decisions or drink lost them the land. His goal, his family's goal is to get back the land and that is all he lives for. After working all these years - Lyle leaves him 50% of the livestock so he is pissed.Through a turn of events - Victoria fires him and suddenly he is free. He realises all he needs is the land he lives on and a paddock for his horses that he intends to breed. Of course there's not much else to his life. He has no friends, he visits his father at a home (the dad suffers from Alzheimers) he doesn't have a relationship - his life is actually pretty empty.These 2 messed up people come together and have to really work for their happiness, they have to overcome their pasts and actually believe that they deserve a little happiness.There's a gorgeous secondary love story between Luc's mother, an elegant ex-model in her 60's, with a younger man - a contractor in his late 40's - Eric the Viking, that is just equally delicious. She obviously feels that she is too old for this Viking, as she thinks of him while he is completely on board with this sexy woman. And his son Thomas trying to help them along is just too much.I really loved this book and read it again immediately after finishing it."}, {"userName": "Cherri Porter", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/7857787-cherri-porter", "userReview": "Redemption for the characters in the eyes of the reader--that's tricky. One of my new favorite things is when I hate a character in the book where they first appear as a secondary, but then they bloom in the next as a primary and are redeemed for me. I'm unskilled enough yet as a reader and a write to know how this works, but Victoria Baker is one of those characters for me and I loved her and Ely's story. ...favorite lines...\"...he fought himself not to take advantage. Not to push this strange moment into shattering. He kept the kiss tender, her chapped lips all but breaking his heart\" (60).and the sweet humor\"She exploded. A thousand pieces of Victoria Schulman, like a thousand points of light, ricocheted around the cab of the truck\" 144.\"For an hour she'd dozed...and he'd stared up at the ceiling and counted the minutes until the regrets crept back, like hungry dogs around his back door, bringing with the the long, slow suffocation that came from being with another person\" (154).\"Women in particular seemed to like to make a game of him. Reading things into his silences that just weren't there. Practically guaranteeing their own disappointment\" (155).\"For two people who had engaged in wild monkey sex, the silence was very uncomfortable, just as God intended\" (156)."}, {"userName": "Nicole Helm", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/5339631-nicole-helm", "userReview": "I think I could go on and on about this book. It was just...wow, really good. Where the first book in the series I spent a lot of time in my \"writer mind\" wondering how O'Keefe managed to pull it off, mainly this book I spent as a reader, wallowing in Tori and Eli's total effed-uppedness and their slow, rocky climb to learning how to be themselves and learning how to communicate that to each other. I like how finding solace in each other allowed them to finally be the best version of themselves instead of the worst. Where in Can't Buy Me Love Tara Jean & Luc were these hard people hardened even further by their experiences, Eli and Victoria were the opposite to me. Softened and broken down by life, learning to be strong instead of learning to soften the hardness in them.Complicated with a hero and heroine who aren't always nice to each other (and not to \"save\" anybody but themselves) I love that this is where romance is going.Tell me romance is light, fluffy escapism. Mommy porn. Trash. What a laugh."}, {"userName": "Kari", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/101554-kari", "userReview": "I think I liked this one a bit more than the first. I can't quite put my finger on why. I think it might have to do with the fact the Tori and Eli have known each other a while. It could also be that I felt like they took more time to fall in love with each other. I also liked that there was an epilogue of sorts that gave me a greater sense of closure for the couple that I didn't get in the first one. Both Tori and Eli have abandonment issues. This makes it harder for them to trust each other and trust in their feelings. Tori's dead husband was involved in a Ponzi scheme that isolated her from everyone when he died. She feels responsible and takes a long time to get over her guilt. I have to say, I loved how she stands up for herself in the end. Eli and Tori were great together and I was really rooting for them. There is also a very sweet side romance involving Luc's mother, Celeste and a very handsome contractor."}, {"userName": "Kimberly", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/5692657-kimberly", "userReview": "Review written for www.books-n-kisses.comThere is a thin line between love and hate best describes this book. This is the second in the Crooked Creek Ranch series. And I will admit that I have not read the first one and based on this book I will not be picking it up anytime soon. I was very disappointed in this book. The characters are mean, hostile and dark. While I can handle the fighting in the beginning I expected the characters to have a change of heart that never happened. They fought on a constant basis. The characters never connected even during the “love” scenes.I do not read a book to live vicariously in a dysfunctional situation and that is what this story was. Having never read this author before I am not sure if this is how she normally writes but I will say this series is just too dark for a fan of the romance genre.Disclaimer:I received a complimentary copy of the book in exchange for an honest review."}, {"userName": "Linda", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/5403981-linda", "userReview": "Thanks to Goodreads first read and Random House for the GOOD READ! What can I say 4 stars for this one. Victoria Baker is a women who has allowed men to walk all over her all her life ; she has taken over the running of the family ranch after hers fathers death. Victoria is seeking a new life for herself and son Jacob after her husbands horrific and disgraceful death.Unfortunately , Victoria knows nothing about ranching . Victoria finds herself relying on Eli Turnball her fathers ranch Forman to teach her,however he has a hidden agenda of gaining the ranch for himself.Through the head butting between the two them a sexual tension and relationship develops, each of them drawing out parts of the other that they never expected.Victoria grows stronger and Eli opens up emotionally !Multiple sub plots with supporting characters weave this story all together."}, {"userName": "Barbara ★", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/1968285-barbara", "userReview": "This is a series that I really loved. Our hero, Eli Turnbull was one of those characters you want to smack upside his head. He was so mean and nasty to Victoria Schulman because she inherited the ranch he felt was owed to him. He did everything he could to make her fail and then some. Of course, she turned the tables on him and succeeded regardless of his shenanigans. This is a complicated love that shows how messed up families are and how much you really want to change can affect the results. Both Victoria and Eli had things in their past they were ashamed of (or felt guilty of) that needed to be overcome before love could survive between them. This is a truly romantic story of love and redemption."}, {"userName": "Stephanie E", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/1672506-stephanie-e", "userReview": "I skimmed thru this. From the moment she hired his absentee deadbeat mother as the architect for her project, I was done. What a bitch the heroine was. I wanted him to leave and her grovel even more. I am contemplating if I should read the next one."}, {"userName": "Jennifer", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/184500-jennifer", "userReview": "This book was fantastic. It was sexy, emotional, and I loved the pulsing, uncomfortable anger of the hero. It made the ending so satisfying."}, {"userName": "Elizabeth", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/12805345-elizabeth", "userReview": "I almost DNFed this a couple of times. The MCs had so many issues."}, {"userName": "Sarah", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/4096145-sarah", "userReview": "[An aside: I was recently discussing this with someone on Twitter, but this book reminded me of a question: why don't women in romances know about the morning after pill? I mean, geez... Anyway...  (hide spoiler)]"}, {"userName": "Jennifer Brown", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/1196968-jennifer-brown", "userReview": "I'm sorry, but I just can't give this book more than 2 stars. I absolutely hated Victoria. I was actually hoping for her downfall and didn't want her happy with Eli. I started this one and book one at the same time (listening to them) but didn't think it mattered since they were romances and we all know how they turn out anyways. I think had I finished the other one first, I would have never started this one. She was a b in the first one as well!"}, {"userName": "Alyssa Edmonds", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/7423456-alyssa-edmonds", "userReview": "This was a good story but it was very dry! I wasn't entertained enough to listen to (read it) in a shorter amount of time. Sometimes it felt I was completing a chore just to listen to it but at other times you couldn't break me away from the story for anything. All in all, worth the download but not worth the 20 days it took me to finish it. :("}, {"userName": "Phylisha Stone", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/32456286-phylisha-stone", "userReview": "3.5 starsOverall I liked the story, however there was a lot going on! Multiple character stories, a Ponzi scheme, a runaway mother, young troubled children, guilty mothers, etc. In spite of this I think I be reading the next book in this series, because there were characters introduced whose story will be delved into."}, {"userName": "Sheryl", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/29423067-sheryl", "userReview": "All I can say is I loved this book. I read it a long while ago so I don't remember all the details."}, {"userName": "Tressa", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/1541501-tressa", "userReview": "I liked the romances and the friendships in Can’t Hurry Love. I liked how Victoria, Celeste, and Ruby came together. I also liked how Eli created a different mindset and objective."}, {"userName": "Kat Latham", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/4739120-kat-latham", "userReview": "Victoria’s husband stole money from their friends then killed himself when he was found out, leaving her with a sick son, no house and friends who despised her. When her father dies and leaves his ranch to Victoria’s half-brother, her brother asks her to live at the ranch and run it.Liam’s family has worked on the ranch for generations. In fact, they used to own the land but lost it in a dodgy deal. So when city-girl Victoria shows up with no clue how to run the place, Liam takes immediate advantage and sells all the cattle.Needless to say, this does their relationship no favors. But as an inexplicable attraction draws them together, they both have to decide how much they’re willing to trust the other when they’ve both been betrayed by the people who should’ve loved them most. (Liam’s mother left when he was a boy and never contacted him.)Have you ever read a book that seeped into your soul while you read it, leaving you feeling both destroyed and elated when you finished? Can’t Hurry Love was that book for me.I’d never read any of Molly O’Keefe’s books before, but a couple of my blog readers had highly recommended this one so I bought it. Holy cow, this is exactly the kind of novel I love. I have a soft spot for heroines who start off with a critical lack of self-confidence, and Victoria certainly has a lot to learn about her own capabilities throughout the novel. All of the characters—not just Liam and Victoria—are driven to emotional hell and back, making their redemption all the sweeter.And Molly O’Keefe’s writing is sumptuous. She uses language beautifully to crank up the heat between Liam and Victoria, like in this scene where Victoria confides in Liam that she wants to turn the ranch into the kind of luxury spa and resort she used to visit when she was rich.”I happen to be an authority, Eli. And I can tell you without a shadow of a doubt that this resort will be a success. As long as I can get the money to have it done right.”“Why?” he asked as currents ran between them, slowly building speed and strength until the world fell away and it was just them in the twilight with this unreasonable connection. “Convince me.”“This land is beautiful. Wild and raw. Dynamic. Virile, in a way.” She was close, too close probably, but she’d been pushed here by a wind she didn’t want to fight. And she could see his heart pounding hard under a quarter-sized bit of skin in his brown neck. She wanted to lick him. Taste the skin over his blood.“And women like that sort of thing, but from a safe distance. Behind glass. Under control.” Yes. Oh Lord, yes. She wanted to control this wild, virile man in front of her. “They want to experience something unpredictable, while being cared for. While being petted and stroked and made to feel beautiful and womanly.”He blinked. “You’re…you’re talking a about a spa, right?”No! she wanted to scream. I’m talking about sex! Wild, crazy sex. With you!Another reason I loved this book was because of Molly O’Keefe’s unique descriptions. She draws out intriguing details and creates comparisons so vibrant that at several points I closed my eyes and smiled as I pictured the scene, like this description of Liam taking several very busy businessmen and their young sons horseback riding.The dogs ran ahead of the horses as if they couldn’t believe their luck to be out on a day like this. The boys were sort of like that, too, preening under their fathers’ attention.Their fathers, though—they handled their sons as though they were sticks of dynamite or talking frogs or some other kind of scary mystery. They kept looking at the boys like they’d never seen them before, like they’d just popped up riding alongside them.I said earlier that this book left me destroyed. When I put it down, it took me a full week to pick up another novel. I read some non-fiction instead, because Can’t Hurry Love was so perfect that I knew any other novel would pale in comparison."}, {"userName": "Joyfully Reviewed", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/5153777-joyfully-reviewed", "userReview": "Victoria Baker has been living her life relying on the men in it. Since the discovery of her husband’s illegal activity and his subsequent death, Tori and her son have been getting by with the help of her half-brother. She and her son return to her childhood home after hearing of her father’s deteriorating health. After his death Tori learns that Crooked Creek is hers. She decides that it’s finally time to do something without a man’s help but there is one man standing in her way.Eli Turnbull has lived and worked on Crooked Creek ranch his entire life with the expectation that one day the property that should have been his families would return to him. However, he discovers that will never happen as Crooked Creek has been left to the uppity, city-girl Victoria. If Eli has patience it shouldn’t take her that long to lose the place on her own. But will he be able to ignore the flames that rise between them in the meantime?Tori wants so bad to hate Eli but can’t seem to hang on to that emotion when he’s around. He awakens her long dead libido and she really wants to take it on a ride with him. Is it possible for these two opposites to get past their extreme differences and find a lasting happiness? Sometimes you simply Can’t Hurry Love. Find out what happens when the sparks start flying once again at Crooked Creek as Tori and Eli heat things up.Can’t Hurry Love is a powerfully romantic top-notch novel!! I can’t get enough of Molly O’Keefe’s Crooked Creek!! These stories are amazing!!Can’t Hurry Love is a breath of fresh air in the contemporary, western romance genre! They don’t all have to have gun-toting bad boys. Don’t get me wrong I love my gun-toting bad boys but once in a while it’s great to read a story that relies on the romance. One that tells an all-encompassing love story you won’t soon forget. Can’t Hurry Love is that story. Tori Baker is the epitome of a character that has been kicked while she’s down and it’s obvious at the beginning of this story that she is ready to pull herself up. Eli is a man that has been living for his family’s goals and he never made plans for himself. Can’t Hurry Love takes these two characters on a story of self-exploration. Both are forced to ask the hard questions and decide what’s best for them. Honestly, in the first book Can’t Buy Me Love I found Victoria to be a whiny, overindulged, self-imposed victim and I find it magical that Ms. O’Keefe has been able to give the reader such insight into a character and turn her into a woman that I will gladly root for. I found Tori to be brave and admirable in Can’t Hurry Love. When this woman gets her voice it is fierce. I love the moments where she stands up to Eli. He is a handsome cowboy with a heart of gold but dang does he make some big mistakes. He is a very closed-off character at the beginning but as the story progresses his layers get peeled back and getting a look at the full picture of Eli Turnbull is beautiful.Tori and Eli have passion in spades. These two are set to simmer but it doesn’t take long for them to realize that what lies between them is a whole lot more than a difference of opinion. If they would give each other a chance they may find that love is the greatest possession of all and once you have it you should never let it go.I absolutely love the secondary characters as well! I could not get enough of Celeste, Jacob and Ruby. I’m in awe of Ms. O’Keefe and how she handles the relationship between Celeste and Tori. After all, it was Tori’s mom that had an affair with Celeste’s husband. Celeste and Tori’s relationship is complex and compelling! I love their scenes together. I also love Celeste’s secondary story as well; it is perfect!Can’t Hurry Love is special. It’s that book that ten years from now you will still be recommending to everyone because it is undeniably great!Reviewed by Miranda for Joyfully Reviewed"}, {"userName": "Pam", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/3754183-pam", "userReview": "Victoria Schulman has become a shell of what she used to be, thanks to a husband who wanted a weaker woman to make him feel strong. She came home to claim her inheritance when her estranged father was dying and has decided to stay. She does not get the inheritance she wished for but her brother is willing to sell her the Crooked Creek Ranch after it comes out of escrow in a year. In the meantime she needs to pick herself up and learn how to run a ranch.Eli Turnbull has been the ranch foreman for years. He expected to get something when Lyle Baker died, since the Baker family slowly bought his family’s land over several decades when they were in need of money. But all Eli receives is the prized Angus herd that he intends to sell as soon as possible. Eli is an extremely angry man and takes it out on everyone, including Victoria. He has offered her 2 million dollars for the ranch but Victoria sees this ranch as her salvation and a future for her son.Selling most of the herd serves several purposes for Eli; it gives him money to buy the ranch (assuming Victoria will eventually sell), purchase some Stallions for the breeding operation he wants to start and takes away the monthly income for Victoria’s ranch, thereby hoping to force her to sell.Although Eli and Victoria do not see eye to eye, he stays on as foreman since he wants to use the space and equipment for his breeding program. However when things come to a head with Victoria she fires him leaving him with nothing to do but make some decisions about his future and find the reasons for his anger.Celeste Baker, Lyle’s ex-wife and mother of Luc (Victoria’s half brother) also decides to stick around after Lyle’s death although Victoria somewhat believes it is to see her fail since Celeste was never good to her while growing up. However as they spend time together, they form an alliance and start to become friends. Victoria throws out the idea of making the ranch a spa which Celeste loves and jumps to help with funding, they need additional funding so Victoria goes to Eli to see if he wants to buy some of the land he has coveted. He ends up purchasing several acres and as they work things out they become closer and find they have more things in common than they thought, they might even like each other.As the story unfolds, we see that Eli deals with some of his anger and Victoria grows a backbone, and on several different situations stands up for herself, their mutual respect and growing friendship develop into love. The story is very good and we see two very different people deal with outside forces that seem to decide their fate until they realize they can make their own decisions and forge their own way in life."}], "description": "From award-winning author Molly O’Keefe comes a wonderfully written contemporary romance about second chances at life and at love.   Victoria Baker, the penniless widow of a disgraced financier, is ready to stand up, be counted, and make a new life for herself and her beloved son in Texas. She’s taking over Crooked Creek ranch, her birthright, and turning it into something special. All that stands in her way is Eli Turnbull, a rugged, too-handsome cowboy who wants the land just as badly.    If Victoria wants a fight, Eli will give her one. He’s devoted his life to Crooked Creek, and he’s not about to let some pampered city girl—even one as brave and beautiful as Victoria—turn it into some silly spa. But Victoria’s and Eli’s burning anger and frustration only fuel heat of another kind: uncontrollable passion. And soon they each realize that the person standing in their way is the one they can never do without.", "title": "Can't Hurry Love\n      \n          (Crooked Creek Ranch #2)", "url": "http://www.goodreads.com/book/show/13154563-can-t-hurry-love", "average": 3.76, "cover": "https://images.gr-assets.com/books/1333577675l/13154563.jpg", "reviews": 108, "authors": [{"url": "https://www.goodreads.com/author/show/223845.Molly_O_Keefe", "name": "Molly O'Keefe"}], "type": ["Romance", "Romance", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/13154563-can-t-hurry-love", "http://www.goodreads.com/book/show/13067947-can-t-hurry-love", "http://www.goodreads.com/book/show/16368708-can-t-hurry-love", "http://www.goodreads.com/book/show/13530773-can-t-hurry-love", "http://www.goodreads.com/book/show/25387181-everything-i-left-unsaid", "http://www.goodreads.com/book/show/25387182-the-truth-about-him", "http://www.goodreads.com/book/show/32900938-bad-neighbor", "http://www.goodreads.com/book/show/15798603-crazy-thing-called-love", "http://www.goodreads.com/book/show/13151734-can-t-buy-me-love"]}