{"ratings": 7494, "userreviews": [{"userName": "Ruth Hill", "userReviewDate": "Nov 04, 2010", "userURL": "http://www.goodreads.com/user/show/2299424-ruth-hill", "userReview": "When I began this book, I was quite intrigued. After all, it is a Christian mystery. That is a genre I have never read. I grew up reading Erle Stanley Gardner and Agatha Christie where everyone jumped into bed with each other and used foul language right and left. How refreshing this book was in light of that!First of all, the author is a fantastic writer who certainly knows how to develop believable characters and plots with intriguing twists and turns. I was drawn into the book from the very beginning--which is quite refreshing. Furthermore, I absolutely loved that there were no bedroom scenes and no foul language! Yes! I could certainly handle reading more books like this. While the gospel was there, the reader did not feel as though he/she was being beat over the head with Christianity. And finally, I pride myself in the fact that I partially solved the crime. I could follow the author's clues, and that really was exhilarating. Rarely could I ever solve an Agatha Christie or Perry Mason case, but I have a chance with Terri Blackstock. I certainly look forward to reading more of her books. It looks as though this is the first in the series, and it would be nice to read the sequel."}, {"userName": "Jerry", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "A real page-turner."}, {"userName": " Marla", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/593597-marla", "userReview": "[identity theft, arson (hide spoiler)]"}, {"userName": "Sarita", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "Everything I read by Terri Blackstock I loved, this book was no exception.The owners of Hanover House, a house for ex-cons and strays are brutally murdered. Morgan and Blair is looking for their parents' killer, especially after Morgan's husband was arrested for the murder. With lack of evidence and multiple suspects, there is a lot to keep a reader guessing.The action started from the beginning, with loads of suspense and intrigue and kept on building. Terri did a great job of introducing the characters and to show the readers there is more to their story, without making it obvious. Loads of twists I didn't expect. For me a great suspense is where I still at the end do not know who the killer is - you have your suspects but it is only revealed when you finish the book. This was one of those books. I was on the right track with my suspicion of one person involved, however, did not expect the true killer at all.If you love Christian fiction, you will love this book. Morgan is a christian, but Blair is not. Both are trying to understand their parents' murder. Both have questions. Blair can't believe in a God who can allow such cruelty. Morgan trust God and know that He does not wish this on anyone, and will work it out for the best.I loved all the character. I especially liked Jonathan (Morgan's husband) and to see how he grows in his faith and trusting that God can truly change a person, even a ex-con with a horrible past.If you are a suspense/mystery lover, I recommend this book - it was a great suspense - especially the end."}, {"userName": "Lauren", "userReviewDate": "Oct 13, 2011", "userURL": "http://www.goodreads.com/user/show/5909573-lauren", "userReview": "I had a beautiful review and then lost it. Rats! I shall try again.This book was great. It was a cool fiction novel with a christian theme. The book is about a murder mystery that occurs on an island off the coast of Georgia. It's pretty captivating and I didn't see the twist coming until right at the very end which is a good tribute to the writer. The main character, Blair, is an atheist who is dealing with the murder of her parents and struggling with the issue of whether God is helpless or cruel during our greatest difficulties. I love that when she confronts this issue with her sister, who is a Christian like their parents were, she tells about the story of Joseph. God wasn't absent in Joseph's struggle. He was screaming for his brothers to not throw him in the pit. Yet the suffering was necessary in order to save the nation of Israel. It reminds me of Jesus and His suffering to save everyone. Oh, I can't even fathom the tears that were in heaven then. I mean God had to turn His face. But oh, how He loves us. Oh how He loves.I also like how the book ends. It doesn't really resolve Blair's unbelief and make everything look like a garden of Christian roses. She is still left with the struggle yet something changes. Something is pulling at her heart. That's what I think God's love is like. A constant tugging, a pull towards love. The constant beckoning."}, {"userName": "Tammy", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10336903-tammy", "userReview": "This the first book I have read by Terri Blackstock. It is a christian based murder mystery. I found I could not put it down. I am on the last book in this series and its only been four days. Well worth reading if you like a little mystery!"}, {"userName": "Jennifer Harrod", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/15004407-jennifer-harrod", "userReview": "Can't wait to read the second book in this series!!!!!"}, {"userName": "Amancay", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/4340707-amancay", "userReview": "This is honestly my first dive into Christian based mystery/thriller, I'm typically... admittedly, a die-hard romance fan when it comes to novelization (although back in the day, growing up I read quite a bit of EVERYTHING!) That being said, I picked this up as a Kindle read, thanks to the wonders of publishers releasing freebies here & there. Their plan/ploy worked, and I'm okay with that. Although I've just now read the first book, I immediately logged in to assure I have all three of the remaining titles in the series available & at the ready to read ASAP!I was easily enraptured by the variety of characters... had my suspicions of those I perceived to be shady, and rooted for some underdogs all along the way. I was happy to read through as folks struggled... with life, unforeseen circumstances, and simple forgiveness or faith... and I'll admit my heart raced with crazy anticipation as I hit the 75% mark and serious action/drama began to ensue at every click of the page/s!I'll leave you with those thoughts, and the endorsement that I'm determined to read the rest... and off to read I shall go!"}, {"userName": "Michelle Booth", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/14217400-michelle-booth", "userReview": "I hadn't read a Terri Blackstock for a few years and saw the Kindle version of this book on sale so picked it up. I had forgotten how addictive her writing is - I finished it way too quickly and dashed to Amazon to download the next in the series!I love her character creation. Enough information to make them appealing, not so much that you feel like you're reading their Who's Who entry. As this is a Christian book, there is a faith angle and it's really well done. Terri Blackstock is known for writing about real issues that people go through. It's never wishy-washy.I'd recommend this book to anyone who loves family dramas and/or Christian fiction. There's a little romance too."}, {"userName": "Nancy", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/20261476-nancy", "userReview": "Bookbub offering 4/6/18. .99"}, {"userName": "Lauren", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/44386577-lauren", "userReview": "Cape Refuge is a small island just off the coast of Georgia. Its a tight knit community, where everybody knows everybody and there are no strangers. Which leads us to Thelma and Wayne Owens, the owners of Hanover House.The Owens open their doors to ex cons wanting to change their lives. Hanover House has strict rules and ALL must follow them, if they want to stay that is. The Owens also minister a church that welcomes anyone willing to walk through the doors. So when Thelma and Wayne miss a city council meeting about Hanover House possible being closed down their daughters, Blair and Morgan, get really worried. But it's not until Cade, the towns Police Chief, burst into the room does it become serious.Jonathon, Morgan's husband, found Thelma and Wayne in their church murdered. Now the real problem? He was also seen arguing with his in laws that very morning. And of course, the murder weapon was also his... In the meantime Morgan takes over Hanover House and tries to keep it together while her husband is in jail and her sister wants nothing to do with it. While going through their parents things Blair finds something that might explain how she ended up getting those scars on her face and what really caused it.While all this was taking place a young girl was running from her abusive step father. Sadie was directed to Hanover House by a waitress knowing she was alone. When she arrived there, no one was home. That night she slept on the beach waking up to Chief Cade. He brought her to the doctors and paid to have a cast put on her broken arm. She was also warned not to sleep on the beach anymore. So that night she found a seemingly abandoned boat shed that looked as if it hadn't been used in a while. That's where Morgan found her a few days later. And of course, Morgan welcomed her into Hanover House and treated her just as family.After everyone in the house had been under suspicion Cade is finally getting close to the real killer. That's when everything spirals out of control. Sadie's step father somehow ends up in town and attempts to kill her. Will he succeed and what does he have to do with everything that's been going on around town? Who brought him here and why? There are a lot of questions needing answers and you will get a few of them...I loved this story, the town and all the characters. Terri Blackstock makes you feel as if you are a part of their lives and your there on the street or on the beautiful beach with them. Hope you enjoy this book as much as I did :)"}, {"userName": "Sheila Myers", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/28530856-sheila-myers", "userReview": "Wonderful characters and a suspenseful plot. Terri Blackstock never disappoints me."}, {"userName": "Lady_lit", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/8118637-lady-lit", "userReview": "TOTMI had often seen Blackstock on others' shelves and was intrigued both by the books and the author's story, but I battled to obtain her books. I had also been told that the Cape Refuge series is one which must be read in synchronicity and order - fortunately, I can dispel this. The plot line does form in such a way, that it is setting up character growth and stories for more books, although it is a satisfactory single title. The story isn't as Christian as I thought it would be, but if you're a complete secularist who finds the reference of the slightest references of God annoying, then Cape Refuge isn't for you.Her story was also more focused on the people dealing with the crime and how they go about solving it, as opposed to a major \"whodunit\" mystery. Blackstock's style was a pleasing hybrid of a slower-paced James Patterson and a maternal John Grisham. Overall, what I found disappointing was the rushed finale .It seemed as though suddenly everything was falling into place.Other than that, I enjoyed that it had no swear words or other things of a gratuitous nature ;Blackstock still managed to create a warmth and tone of the characters with their own \"vibes\". It also reads easily, as I read it sporadically over about a 6 week period and could always quickly work out where I was.I won't be rushing to read the next edition of the series and think I will rather read the single tiles of her that I can attain, as there is a story arc for the entire series. (I only have access to book 2). The books could be read as single titles in the series, I think."}, {"userName": "Elaine", "userReviewDate": "Nov 28, 2008", "userURL": "http://www.goodreads.com/user/show/1742519-elaine", "userReview": "Murder and corruption. Folks on the Island want Hanover House shut down. They're being told, among other things that some of the tenants living there are not good for the safety of the Island. Not all the Island residents feel that way however. Then there's Sadie who turns up and who appears to be a young runaway. The name Cape Refuge sounded like a good place to be. A place of safety. Then she hears of a double murder on the Island and the police want her off the beach. She can't very well get a job looking like she does. She can't afford her next meal. She needs a shower and a place to sleep. Cade doesn't want to put his long-time friend in jail for the murders but it was his weapon and he was seen by so many people just that morning in a heated discussion with them. Besides Jonathan has quite a temper. Then there's Gus who, not long ago, got out of prison. He's been living at Hanover House. There's also Rick. Things just don't add up with him. Where'd the scars come from on Blair's face. She was always told it was a small grease fire that caused them so many years ago. She's one to speak her mind. Sometimes to the dismay of her sister Morgan who wants to see Hanover House remain open."}, {"userName": "Tricia Leininger", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/63791038-tricia-leininger", "userReview": "Set in what is referred to as the “deep south” by most, Cape Refuge by Terri Blackstock is a captivating read. Depending on your reading speed, you may want to block out a few hours of your day, as, if you’re anything like me, you won’t be able to set the book down! This mystery novel is told by a few different characters in the book, but the primary voice is that of Morgan Cleary. She is the daughter of Thelma and Wayne Owens, the murder victims, who ran a half-way house for those in need of refuge and new or found again faith. Something I found really neat was that, as Blackstock navigates the characters from one destination to the next, you can refer to a map just before the title page to really help your imagination, and make you feel familiar with the small town setting, almost as if you were there! While this is a faith-based book, I feel anyone who enjoys a good mystery, can easily enjoy this book, the first in a four-part series. None of the author’s belief’s are shoved down your throat, but it’s also clear she has a deep belief and trust in God. So whether you have faith or not, if you enjoy being compelled by a good mystery, I would recommend giving this one a try!"}, {"userName": "Monica", "userReviewDate": "Sep 08, 2010", "userURL": "http://www.goodreads.com/user/show/2128705-monica", "userReview": "I finished this book over the weekend and have to say that I really enjoyed the story. This is a Christian Fiction book and not the first one I have read. Cape Refuge was well written and was able to keep my attention. I didn't feel like I was being preached to the whole time. The main characters were Blair and Morgan. Morgan has the faith and Blair questions the faith very often. When reading Cape Refuge I was able to understand how Blair could have doubts about God.The story is about Blair and Morgan's parents business of taking in the less fortunate. They could be ex-cons, people down on their luck, even runaways. The town of Cape Refuge want to close Hanover House, and Thelma and Wayne are murdered. Now a mystery is added."}, {"userName": "Wanda Hartzenberg", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/5663614-wanda-hartzenberg", "userReview": "Ok. Usually I prefer male over female narrators so keep that in mind when I tell you that I am not a fan of this narrator at all. Apart from the young girl and the two sisters almost everybody else sounded the same but!!!The story. I loved the story. Real people with real issues trying their best to live a good Christian life but gets tripped up by life, by their tempers, resentment and secrets. Not at all a preachy book but for all of that a show-me-how instead of let-me-tell-you how story. Yes, i am now a huge fan but Ill keep an eye out for a different narrator before I invest in the rest of the series on audio."}, {"userName": "Kelly", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/19523375-kelly", "userReview": "This book was terrible...I'm actually angry at how bad it was. The characters are so stupid, as in have zero intelligence stupid. You can tell there wasn't a lot of research done on how murder investigations work before the book was written, along with many other discrepancies, making the whole thing unbelievable. I could go on for awhile about all the things wrong with this book but I don't care to waste anymore time on it."}, {"userName": "Laura", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/676622-laura", "userReview": "I loved her \"Seasons\" books with Beverly LaHaye, so I thought I would try some books she wrote on her own. Nicely written, beautiful imagery. The only problem I had with the book is that I knew whodunnit before the second chapter. I kept hoping I was wrong, but nope. It was all too obvious. And that sheriff, the \"hunk\" in the book, has to be about the densest moron to ever wear a badge! I hope the rest of her books are better."}, {"userName": "Charity Yoder ", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/22629978-charity-yoder", "userReview": "i freakin love this book, but then again i like most of terri blackstock books to begin with. it's just so... fantastic. the ending you never see coming because it's that twisted. if you're ready to stay up all night and not be ready for the ending to such a great book: read. then re-read to make sure you got it all. big TWO THUMBS up!"}, {"userName": "Amberly Reilly", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/8814305-amberly-reilly", "userReview": "I've had this book for years and just now sat down to read it. Wonderful Christian fiction is what it is. Mrs. Blackstock kept me on the edge, in suspense, and circles as I tried solving the murder in my mind. A wonderful book that reminds us what faith and the bigger picture are all about. The afterword made me cry. I would recommend this book to any book lover out there."}, {"userName": "Shannah Mauney", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/21794737-shannah-mauney", "userReview": "This book was fantastic. An excellent blend of mystery and suspense. I can't wait to read the rest of the books in this series. View my full review here."}, {"userName": "Robynjolo", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/24377177-robynjolo", "userReview": "I was not convinced by this book at the beginning. It seemed a bit disjointed and was just not pulling me in. I will say it had a good message though, but still doesn't get 5 stars."}, {"userName": "Susan", "userReviewDate": "Dec 09, 2012", "userURL": "http://www.goodreads.com/user/show/2908494-susan", "userReview": "A Christian mystery. A good read, though I figured out who did it early on. I just didn't have all the details figured out."}, {"userName": "Elusive", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/21384199-elusive", "userReview": "In 'Cape Refuge', Thelma and Wayne Owens are saviours to released prisoners, thanks to their efforts in running Hanover House. Although the Owens are well-liked, not everyone is happy about having prisoners living amongst innocent people. Their son-in-law, Jonathan Cleary is adamant about getting his wife Morgan to move out. Shortly after he has an argument with them, they are found murdered hence making him the top suspect..The first chapter was well-written and engaging. The heated discussions and arguments at the City Council Meeting highlighted the residents' understandable concerns about Hanover House. They simultaneously showed how Thelma and Wayne's daughters, Morgan and Blair were united in ensuring that no one shut down the home. The ending of that chapter instantly led to the shocking murders. Unfortunately, everything went downhill beginning from chapter two.Despite the crime and mystery elements, this book was incredibly boring because the content was repetitive and uneventful. By the time I was close to the halfway point of the story, I could summarize the story as follows:Thelma and Wayne were murdered. Everyone is in disbelief. Who could kill such sweet, kind people? They would help anyone. They were such angels. Why would anybody harm them? Did I mention they were kind? Yes, but let me mention it again (since that's what the author did).Jonathan was immediately arrested because he owned the murder weapon. Never mind the fact that the stupid cop, Cade had little to no other supporting evidence. Jonathan: I didn't do it, Cade! You have to believe me!Cade: Sorry Jonathan but right now you look the most guilty.Jonathan: But I'm not! You're my best friend, how could you do this to me?Cade: I feel bad, okay. But it's my job to arrest you even though I don't want to.Morgan: How could you arrest my husband, Cade? You know he's innocent!Cade: Morgan, I wish I didn't have to but the weapon points to him.Morgan: He didn't do it. He'd never do such a thing. You're wrong, Cade!Cade: It's my job to arrest him, Morgan. Believe me, I don't want to.The entire police procedural was not only inaccurate; it was also unrealistic and laughable. More importantly, Morgan was an idiot for not getting a lawyer to help free Jonathan. It could have been accomplished so easily since Cade was unable to place Jonathan at the crime scene and to prove without a doubt that he was the killer. Throughout the story, Cade pretty much did little to no investigating and instead tossed several people into jail without ever getting into trouble. Another thing that bothered me was how all the suspects (with criminal records) had no problems answering Cade's questions. Really? Not a single \"I want my lawyer\"?Besides that, this sentence (among many) made it impossible not to roll my eyes: \"With her library skills and command of the Internet, Blair was usually able to come up with information as fast as he (Cade) could\". That sentence single-handedly dismissed police as utterly pointless because hey, all you need are \"library skills\" and internet access to solve crimes! To make things worse, there were numerous times where Blair relayed information (acquired through research via computer) to Cade. Who's the cop now??The revelation of the identity of the murderer wasn't even satisfying enough to justify plodding through page after page of nonsense. The motive wasn't wholly convincing and the crime didn't quite fit the motive either. In addition, I was only curious to learn more about what had caused Blair's facial scars only to get a mediocre delivery that went like this: Cade found a newspaper article. Read it and told Blair to do the same and voila, the mystery behind her scars was solved! Talk about underwhelming..Overall, 'Cape Refuge' should've been called 'Camp Disaster' considering the awful repetitive content, painfully flat characters and non-existent police procedural."}, {"userName": "Barb", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/2682283-barb", "userReview": "Two bodies, one spear gun, and a murder suspect. But did Morgan Cleary’s husband really kill her parents? The brutal double murder has struck fear into peaceful Cape Refuge. Police Chief Cade is unconvinced that his best friend took the lives of Thelma and Wayne Owens. The Owens’ halfway house shelters individuals far more questionable than Jonathan Cleary. Now, the villagers are concerned that it may house a murderer who could strike again.Thelma and Wayne Owens run a bed and breakfast in Cape Refuge, Georgia. They minister to the seamen on the nearby docks and prisoners just out of nearby jails, holding services in an old warehouse and taking many of the \"down-and-outers\" into their home. They have two daughters: the dutiful Morgan who is married to Jonathan, a fisherman, and helps them out at the B & B, and Blair, the still-single town librarian, who would be beautiful if it weren’t for the serious scar on the side of her face. After a heated, public argument with his in-laws, Jonathan discovers Thelma and Wayne murdered in the warehouse where they held their church services. Considered the prime suspect, Jonathan is arrested. Grief-stricken, Morgan and Blair launch their own investigation to help Matthew Cade, the town’s young police chief, find the real killer. Shady characters and a raft of suspects keep the plot twisting and the suspense building as we learn not only who murdered Thelma and Wayne, but also the secrets about their family’s past and the true reason for Blair’s disfigurement.I would have drove myself crazy wondering who would be next. Of all the 'bad guys' in this book it was a shock to find out who was really the bad guy. 5 stars."}, {"userName": "Victoria", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/43647401-victoria", "userReview": "Another great read by Mrs. Blackstock! The emotions were raw and so very real. This novel leaves you feeling sad, happy, and refreshed. I really liked this quote from the author's afterword at the end of the book: \"We cannot control God, and we cannot second-guess him, as much as we'd like to try. Our God has plans and purposes that are far beyond are understanding. Sometimes those plans and purposes break our hearts. Sometimes they require sacrifices we never agreed to make. Sometimes they stop us dead in our tracks, turn us upside down, inside out, and paralyze us with pain. But his comfort is never far behind.\"I loved all the characters but especially Blair, Sadie, and Cade. I'm looking forward to reading the next book in the series!"}, {"userName": "Alicia", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/21415950-alicia", "userReview": "A few things that bothered me: -None of the characters grew or changed. By the end of the book, Blair was still negative and skeptical of everything, Morgan still had the most positive attitude of any book character ever.... and still cried on nearly every page. -We never got any back story on the parents' lives before Cape Refuge. Why did they commit them? How did they come to Christ? Why did they keep this information such a secret? -It was slow. Facts were repeated over and over instead of giving us new thoughts and clues. I guess I can't complain too much because I still finished the book."}, {"userName": "Tia", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/35273178-tia", "userReview": "I really liked this book. It may not win any literary awards, but it’s rare that I like the books that do. In my opinion, they usually try too hard. I liked the Christian aspect, but it was not overdone. It was nice to not have to worry about explicit language, sex, or violence. But it was not bland. There were some violent acts, they just didn’t go into graphic detail. The characters were a little cliche but still interesting. It was definitely a page-turner - always a plus in my book!"}, {"userName": "Jan Locke", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/57916516-jan-locke", "userReview": "Powerful story An exciting story, filled with suspense, emotion, relationships, faith & doubts. I could feel the tension mount as the story continued & felt the actual fear of having someone manipulating & stalking you. I hope to read more of my favorite character, Cade, as the series continues."}], "description": "Thelma and Wayne Owens run a bed and breakfast in Cape Refuge, Georgia. They minister to the seamen on the nearby docks and prisoners just out of nearby jails, holding services in an old warehouse and taking many of the \"down-and-outers\" into their home. They have two daughters: the dutiful Morgan who is married to Jonathan, a fisherman, and helps them out at the B & B, and Blair, the still-single town librarian, who would be beautiful if it weren’t for the serious scar on the side of her face. After a heated, public argument with his in-laws, Jonathan discovers Thelma and Wayne murdered in the warehouse where they held their church services. Considered the prime suspect, Jonathan is arrested. Grief-stricken, Morgan and Blair launch their own investigation to help Matthew Cade, the town’s young police chief, find the real killer. Shady characters and a raft of suspects keep the plot twisting and the suspense building as we learn not only who murdered Thelma and Wayne, but also the secrets about their family’s past and the true reason for Blair’s disfigurement.", "title": "Cape Refuge\n      \n          (Cape Refuge #1)", "url": "https://www.goodreads.com/book/show/305438.Cape_Refuge", "average": 4.13, "cover": "https://images.gr-assets.com/books/1432335502l/305438.jpg", "reviews": 371, "authors": [{"url": "https://www.goodreads.com/author/show/19811.Terri_Blackstock", "name": "Terri Blackstock"}], "type": ["Christian Fiction", "Mystery", "Christian", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/305438.Cape_Refuge", "http://www.goodreads.com/book/show/8388502-cape-refuge", "http://www.goodreads.com/book/show/7631647-cape-refuge", "http://www.goodreads.com/book/show/9266666-cape-refuge", "http://www.goodreads.com/book/show/183092.Night_Light", "http://www.goodreads.com/book/show/593152.Last_Light", "http://www.goodreads.com/book/show/26263487-if-i-run", "http://www.goodreads.com/book/show/593155.Southern_Storm", "http://www.goodreads.com/book/show/305440.Breaker_s_Reef", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}