{"ratings": 3778, "userreviews": [{"userName": "~✡~Dαni(ela) ♥ ♂♂ love & semi-colons~✡~", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/7999417-d-ni-ela-love-semi-colons", "userReview": "Billions & billions of starsPrepare:- Watch \nCarly's Cafe\n. - Stream \nThe Blues Brothers\n (1980) movie with Dan Akroyd and John Belushi (available on Amazon and Comcast On Demand, but not on Netflix). This is Emmet's favorite movie, and we have to support Emmet. - Stock up on tissues (the soft kind). And wine.- Set aside several hours to read. Do NOT pass Go; do not collect $200. Give your partner/dog/kid/mother the Big Mean Stink Eye if they interrupt. This is a HOLY experience and should be treated as thus.\n\n ~ “No one is normal. Normal is a lie.” ~\n\nTold in Emmet and Jeremey's alternating, distinct, first-person POVs, Carry the Ocean is Heidi Cullinan’s most poignant book. It is evocative and REAL and brilliant. EMMET:\nI am normal. I belong. I have a friend who can kick ass from a wheelchair. I live independently and get good grades. I'm an excellent lover. Like I said. I'm awesome. I'm Emmet David Washington. Train Man. The best autistic Blues Brother on the block.\nJEREMEY:\nThis year I learned I'm good at feelings. Emmet calls these our superpowers--his are listening and seeing and math and remembering. Mine is feelings. I can tell what everyone is feeling all the time, and I almost feel it with them. So I have to be careful, because if there are too many feelings around me at once, I get overwhelmed . . . There is nothing wrong with me and who I am, but I do have depression and anxiety, and they're both pretty severe . . . They're real things. They're invisible to everyone but me . . . I have to fight every day, and some days I can't win.\nJeremey’s parents want to shove him into a box. They force him into loud places and yell at him in the aisle of Target until he panics and melts. They won’t let him get help and pretend everything is fine. Until it isn’t. Until Jeremey can’t do it anymore. Emmet has an incredibly supportive family. They let him be who he is, his own man, not a sheep.\n\n“I’m too different, Mom. I don’t want to be so different.”“Everyone’s different. Some people are more able to shove their differences into the dark, to blend in and be sheep, but that isn’t always a good thing.” “I’d rather be a sheep than be alone.”“But that’s the big secret. The sheep are more alone than everyone.”\n\nEmmet and Jeremey stole my heart. Cullinan does such an amazing amount of research for her books. She seeps them in pop culture, in music, in sights and sounds. Emmet also researches everything, but he really gets into researching sex. From the first awkward kiss to tentative (and NOT so tentative) sexual exploration, the boys are in it as one. \n\nI asked Jeremey if he wanted to try anal sex, and he said yes. I wasn't surprised. Jeremey always said yes to anything about sex . . . We'd ordered a dildo from a reputable online sex store, and he said it felt great. I tried it too, but I don't care for things in my butt. Jeremey does, which is good. I wanted to be in him that way.\n\nOf course the sex store was reputable! Emmet wouldn't have it any other way.Emmet and Jeremey are determined to build a life together. Neither is quite ready to live in the college dorms (what with the chaos and obnoxious frat boys), and despite his parents’ pressure, Jeremey doesn’t want to go to college. So with Emmet’s parents' support, they decide to move into their own flat at a new independent-living facility called the Roosevelt, built by a man for his quadriplegic son David. I ADORED David almost as much as I adored Emmet and Jeremey. Emmet is initially jealous of David. When Jeremey becomes David's assistant, Emmet worries David will take Jeremey away from him. \n\n\"He doesn't have autism. His spine is broken, but his brain is fine.\"\"So is yours.\"[Emmet] shut his eyes and put his hand over his heart . . . \"I love you, Emmet. I'll love you always. I'll love you always best.\"\n\nEmmet is one of the few people who SEES David as a man, not a crippled being in a wheelchair. Emmet, Jeremey, and David eventually become the best of friends, three men against the average bullies of the world. Emmet and Jeremey, at times overwhelmed by eye contact and noise, often talk by sign or text, even when they're right next to each other; this was so damn adorable, my heart melted. EVERY. SINGLE. TIME.Heidi Cullinan is a master. The prose here is flawless. Jeremey and Emmet are each given a VOICE to write their own story: a story about diverging from the mean and discovering a place where you belong; a story about finding the person who understands you, accepts you, COMPLETES you. And helps you conquer the greeting card section at Target! Emmet and Jeremey may be \"different,\" but they are perfect. They are more caring and tolerant of each other and more respectful of their relationship, the necessary ups and downs and compromises, than most of us on the mean. Carry the Ocean is so much more than an M/M romance. Everything is right in this book. EVERYTHING. HIT IT.__________________________________________Tried to write a review, broke down after four typed pages of notes and too many emotions to process; going for a run to gather my thoughts."}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "Are you ready to read Heidi Cullinan's best work to date? Are you ready to read something so special that you will have to devour it in one sitting? Are you ready to read something so captivating that it will broaden your scope of what M/M can be? This is my 11th book by Heidi, and it's the first one that I've given 5 stars. That should tell you something. I have a thing for atypical MCs. Give me a well-written book with a main character that is left from center, and I'm all in. I've read many books with characters that have all sorts of disabilities, ranging from blindness/deafness (I Can See For Miles) to below average intelligence (Muscling Through), to physical differences (All Strings Attached) and beyond. Some of my absolute favorite books have MCs that are different in some way (Forget Me Not, Truth in the Dark, The Mating of Michael). Carry the Ocean ranks up there with my all-time favorite books.With not just one, but two MCs that are off the mean (a term I learned from this book), the story had the potential to be disasterish. It could have been uncomfortable, felt forced, or been too dark for me to enjoy. Instead, Heidi struck the perfect balance between serious and light, respectful and fun, truthful and relatable. It was everything I wanted and more. I started this book at 10 pm, and I didn't put it down until 1:30 am. I was completely captivated by Jeremey (extra e) and Emmet. I loved the alternating POV and how it gave me great insight to each of them and their particular struggles. I felt CONNECTED to them, and I felt like a part of their relationship. These boys do not have it easy. I would caution readers who struggle with their own issues, either with depression or anxiety or an autism spectrum disorder, to think carefully before starting this book. It is intense, and might strike some readers close to home. But everything that these boys are fighting for, a taste of an independent life and a happily ever after for people who don't necessarily expect to get those things, makes the journey SO worth it.  Even through the serious and scary moments, this book made me feel hopeful. I loved this book simply for the romance, but also for the insight it gave me into the lives of those who struggle every day with things that I take for granted. It was a wonderful, special reading experience, and I think something Heidi Cullinan will be remember for. **Copy provided by the publisher in exchange for an honest review**"}, {"userName": "Lola  Reviewer", "userReviewDate": "Jun 27, 2015", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "Beautiful. Alternatively written from the point of view of an autistic boy and one suffering from depression, CARRY THE OCEAN, was both a gut-wrenchingly sad story and a heart-warming one. A very informative novel, too, shall I add! Now I know what it means for someone to have depression as mental illness, how an autistic boy around my age copes with the expectations of our dear society, and all of that thanks to a wonderful narration and immersion in the characters’ minds.The introduction of a brand new character along the way took me by surprise. I wasn’t expecting him. Definitely not. But do not worry; if you may at first balk at welcoming him into the story, I am adamant that your opinion will change after learning and seeing more of him. A fantastic asset to a fantastic story!Well done, Heidi Cullinan!"}, {"userName": "Baba  ", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/4669232-baba", "userReview": "4 stars. Rating clarification see below. Full review posted March 5, 2015Rating clarification5 stars for Emmet because, frankly, you can't not love the super-duper awesome Train Man and Blues Brothers impersonator Emmet David Washington.4 stars for the writing.2 stars for Jeremey with an extra 'e'. I'm sorry to say that I could not warm up to him.Average rating: 3.66666667. I gave the book a straight 4-star rating…because…Train Man Emmet, right?Emmet David Washington is nineteen. He’s studying computer science and applied physics at Iowa State University and he has autism spectrum disorder. Emmet loves trains, pizza, the sound of rain and the Blues Brothers. In Carry the Ocean, Emmet tells us his story; how he met Jeremey and fell in love with him. Carry the Ocean is told in alternating POVs and as much as it is Emmet's story, it is also Jeremey's.\nThe best summary I can give is to say I’m more sensitive than most people, and I don’t mean feelings getting hurt. My kind of sensitivity is if my socks have a seam on the inside of the toe it feels as if someone is scraping a trowel across my brain. A fan blowing on me can feel like ten million ants are crawling all over my skin.(…)\n\nI’ve read the website But You Don’t Look Sick seven times, but I still don’t understand why the friend is crying over silverware. Althea says it’s because my brain doesn’t get metaphors, which are representative stories to explain something instead of giving a literal answer. My brain is about as literal as brains get.\nEmmet made me smile all the time. He's open, simple, sincere, candid and sweet. He’s not good with people, he doesn’t understand subtleties either, i.e. vocal inflections or any other visual and/or facial cues for comprehension. That’s just impossible for Emmet. But what he is makes him as rich and deep and sweet as any other so-called \"normal\" individual.\nFirst of all, to be my boyfriend, he would have to be gay too. Data is unclear, but it’s estimated two to five percent of American men are homosexual. In standard circumstances, reciprocated attraction isn’t measurable as a potential percentage, but I didn’t need a case study to know autism wouldn’t help even if I beat the rest of the odds.\n\nJeremey\nI feel bad for admitting that I didn't like him. He suffers from major depressive disorder and clinical anxiety. So, while Emmet lightened the story with his special personality, all of Jeremey’s problems put an oppressive and somber damper on Carry the Ocean. Also, I think having to deal with a main protagonist who is on the autistic spectrum provided so much “meat” already, that his counterpart’s issues weighed too much and made for a very exhausting read. Jeremey, The Worrier, is surrounded with all kinds of issues. Constant negative thoughts stuck to him like super glue and depression and panic attacks were his permanent companion. As it was, I just couldn't deal with his crying jags and helplessness.\nI need to go make some phone calls. Can I have a hug, jujube?”I am not a fruit from China, which is what a jujube is, and I was too angry for hugs. But can I have a hug, jujube is my mom’s code for when she needs a hug. She’s a mom with lots of superpowers, but she says they’re powered by hugs.\nWe’re all different but at the same time we’re all the same. We want the same (or similar) things. A chance to be happy and accepted for who and what we are. We all seek respect, approval, friendship and love. That’s what this story is all about. Moreover, it’s about first love between two young and disabled people, superpowers and an impressive brain octopus which helped to explain Emmet’s personality. Even though the story is told in dual POVs, my heart solely beat for Emmet. I wanted his voice and thoughts; I was in his head--he clearly made the story for me.Carry the Ocean was my third book by Heidi Cullinan and certainly one that will stick with me like super glue. Recommended read.Expected publication: April 7th 2015All quotes are taken from the pre-published copy and may be altered or omitted in the final copy**ARC courtesy of Samhain Publishing via NetGalley in exchange for an honest review**"}, {"userName": "Arianna✦❋SteamyReadsBlog❋✦", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/23370948-arianna-steamyreadsblog", "userReview": "“Everyone is different. Nothing in the world is the same as anything else, so how can anyone be normal?”\n\nThis book like its two main characters was pure and simple special. It was emotional, at times intense and one of the best YA I’ve read so far. This book is not only for those who love M/M or for those who enjoy reading about first love. No! This book is for everyone who wants to read about something REAL. But “Carry the Ocean” is so much more than that. It’s more than realistic fiction. It’s an eye opening, informative read who will touch your heart and it will make you root not only for these two amazing characters, but for anyone who suffers from any kind of mental disorder. “Carry the Ocean” is a beautifully written story about love, friendship, acceptance and so much more. It’s a story that made me smile, but it’s also a story that moved me and made me sad; it’s a story written in dual POV (1st person) that will make you reflect.Emmet is nineteen years old. He’s a sophomore at Iowa State University and he studies computer science and applied physics. He enjoys puzzles and The Blue Brothers. He’s good at computers and anything to do with math. He loves pizza, trains and the sound of rain and he’s gay. He also has autism spectrum disorder. He knows he’s 'different' and he believes he’s not 'normal' because people treat him differently. As soon as they see him or hear him speak all they seem to care about is his disorder. \n\n“It’s like Elwood Blues says: everybody needs somebody to love. I’m an everybody. I get a somebody.”\n\nHe can’t maintain eye contact, he hums, he rocks and he counts to calm himself. He remembers almost everything he reads and sees. He has 'autism superpowers', like he calls them, but he’s a lonely boy. He doesn’t have any friends or a boyfriend, but he’s very interesting in dating Jeremey, a boy from across the train tracks. He wants to introduce himself, but he’s too shy, having a hard time interacting with others.Jeremey \"with extra ‘e’ in his name\" is eighteen and suffers from major depressive disorder and clinical anxiety. His parents pretend everything is just fine, so he doesn’t get any help. He’s quiet, gentle, lonely and he wants to have friends. In Emmet, Jeremey finds a great friend, finds someone who understands him, finds someone who accepts him and loves him for who he really is.\n\n“Nobody is normal. Life is hard for everybody, sometimes.” \t“Yes, but not everyone understands like you do, Emmet.”***“Nobody ever asked me what it’s like to have depression. Not Bart, not the school guidance counselor, not our doctor, not my parents. Everyone treated me like a freak and wrote me off.”\n\n“Carry the Ocean” was a wonderful reading experience. Like I mentioned it was different from any YA I’ve read so far. And it really was! It's a heartbreaking read and it’s told with tenderness in such a way that will make the reader empathize with these characters.The two main characters, Emmet and Jeremey are fantastic, complex and so endearing. I absolutely loved Emmet. He is simply awesome. No, scratch that. He is amazing. For who he is and for all he accomplished. He knows all about his disorder and the fact he is limited by it to do everything he wants and he realizes people are different, that some are mean and not so accepting as his family. He is sweet, kind, honest, direct, intense and so smart. I loved his personality, his strength and his determination. I lost count how many times he made me smile. The way he is with Jeremey warmed my heart. He’s caring as he can be, but he’s accepting and protective and I loved him to pieces. \n\n“When you have an invisible disease, your sickness isn’t your biggest problem. What you end up battling more than anything else, every single day, is other people.”\n\nMy heart broke for poor Jeremey. He was so alone and I just wanted to give him a hug. Unlike Emmet’s POV, his POV is more on the darker/somber side. It was sad and it was depressing. However, it felt real. He believes he’s not strong enough for the world, that he is stupid and broken, but Emmet will help him realize (more or less) that he’s not broken, just different, that it’s ok to be this way.\n\n“Everyone’s different. Some people are more able to shove their differences into the dark, to blend in and be sheep, but that isn’t always a good thing.”\n\nEmmet and Jeremey were perfect together as friends and as a couple. They work hard to be together and in the end they are stronger than many. They were real, they were believable and maybe even relatable as well. I loved how they are with each other. They were sweet and caring and at times even tender. The slow build relationship was perfectly done and perfect for them. Even this aspect of the story felt real to me. I liked the fact that they want to become independent, even if they knew it’s risky. Until reading this novel I didn’t know a whole lot about autism or about major depressive disorder. It was interesting to read about them, but at times it was gut-wrenching. I hated Jeremey’s parents with all of my being and I cringed every time they opened their mouth. I’m aware of the fact there are people exactly like them in RL – mean, stupid and ignorant and that society will always judge and condemned those who are different, but every time I come across such characters I get angry and frustrated. While I disliked Jeremey’s parents, I totally liked Emmet’s. They are loving, caring, supportive and most of all accepting. They are exactly how any parent should be with his child/children.All in all, “Carry the Ocean” was a wonderful realistic fiction, written very well with two exceptional, admirable main characters, solid plot and great message. \n\n“I am normal. I belong. I have a friend who can kick ass from a wheelchair. I live independently and get good grades. I’m an excellent lover. Like I said. I’m awesome. I’m Emmet David Washington. Train Man. The best autistic Blues Brother on the block.”"}, {"userName": "Nick Pageant", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/25561549-nick-pageant", "userReview": "There aren't enough stars in the sky or on Goodreads for this wonderful book! I'm bowled over and I'm crying nothing but happy tears.I've got nothing, people, nothing at all. I'm just buzzing and walking on the clouds. I want everyone to read this book!Dani wrote a great review if you need details.Also, I have to admit that I was entertained by a quadriplegic getting punched in the face - that's good writing!"}, {"userName": "Kaje Harper", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/5309738-kaje-harper", "userReview": "[The lullaby that Jeremy's mother sang to him was the same I sang to one of my kids, over and over, when stress was high and sleep was hard to accomplish. There was a sweet ache in seeing another mom do the same thing.  (hide spoiler)]"}, {"userName": "Jan  ", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/20856081-jan", "userReview": "What just happened here? I can’t wrap my head around the fact that the author gave us not ONE but TWO very distinct POVs representing Autism and Depression with a mind blowing result.Dear author, Thank you so much for this gift! Hats off for all research I believe you have done.Thank you also for giving us hope, showing that people with mental illness can also be happy.We could see it’s not easy but with family support, love and medical help it can be achieved. What a bunch of unique, captivating, lovable and precious characters you have created!I won’t forget this story any time soon!"}, {"userName": "P ", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "“Sometimes I feel like everyone else is carrying a bucket of water but I’m trying to carry an ocean. It's very hard. Sometimes I would rather not carry my ocean, even if it meant I couldn’t be alive.”\nThe second book of this series will be out this month, so I want to recap Carry the Ocean as if I read it for the first time. This book was exceptional, unexpectedly awesome in spite of that typical start. A story about two neighbours falling in love and conquering their lives isn't something new for me, but the author managed to pull out some emotional parts, and she did it very well. I'd fallen in love with Emmet since the first time I saw him, he's such a fantastic kid, and his love was very interesting I wanted to hugged him so bad when he makes a move on Jeremy.\n“Depression is having a crowd of dementors live in your head twenty-four/seven.” \nJeremy, on the other hand, is not an unlikable protagonist for me. His insecure manners annoyed me sometimes but when the two being together, the chemistry was just right there and my heart couldn't even stop beating loudly.I loved the novel with something more than just love, drama, and twist. Thus Carry the Ocean was just a right choice for me, and to be honest, I can tell you that this is the best of M/M romance I've ever read. The ending was perfect and I can't wait to see more about the other characters who are mentioned in this book. I'd love to see Emmet and Jeremy, too, for the story of their lives just start and there's much more to come.\n“Remember having a panic attack isn’t a failure, and not having one isn’t a success. Success is not letting the attacks run your life” \nI still remember that I had been a victim of depression once. It's the worst experience of my life for everything was just wrong and I couldn't stop crying all day. And reading this book made me feel like being in the darkest pit of my mind wasn't the end of the world, especially if you can crawl out and look back to what you've done, that's what really matters.https://goo.gl/ZZeOyH"}, {"userName": "Ingela", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/15589375-ingela", "userReview": "[ (hide spoiler)]"}, {"userName": "* Meli Mel *", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/10905711-meli-mel", "userReview": "♥♥♥ 5 STARS ♥♥♥\n●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●'There is no normal, not really. Not a right and a wrong way to be. But there is belonging.'●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\n Ahh...this story!! I loved it so freaking much!! I honestly don't even know how to write a review for this because I know whatever I say won't do this story justice.This story is about a young man named Emmet Washington. He is a very intelligent nineteen year old, who is studying at Iowa State University and very awesome. Oh, and he also is autistic. Emmet, with the help of his parents and his therapist, has learned how to keep calm at all times. Things that he struggles to understand, he finds modifications to make things easier for him. While Emmet has figured out how to deal with most things in his life, he still struggles with his social skills because of how people look at him when he rocks and hums. But, there is one person he is determined to meet, and that is his neighbor Jeremey. Emmet has a big crush on him and finally introduces himself to him at a neighborhood party.\n●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\"That's another something I learned this year: how to be a boyfriend. How to listen to someone else, what they need, how to give it to them. What I need. How to love them...How to make a life with someone. How to help someone else through struggles, and let them help me with mine...There's nothing wrong with me and who I am, but I do have depression and anxiety, and they're both pretty severe...They're real things. They're invisible to everyone but me...\"●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\n Jeremey may look like a healthy normal eighteen year old on the outside, but he is anything but on the inside. Jeremey suffers from depression and clinical anxiety. Unlike Emmett, Jeremey doesn't receive any support from his family. His parents insist that his sad behaviour will pass and that he must act \"normal\". The pressure of being told to be normal and go to college becomes too much for him. But, when Emmet enters his life something changes for Jeremey as they become best friends. Emmet helps him feel a little bit lighter and not so alone. Emmet and Emmet's parents become the support system that Jeremey so desperately needed.\n●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\"I love you, Emmet. I'll love you always. I'll love you always best.\"●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\n This book was so stunning, thought-provoking, emotional, and heart-warming. The characters were so genuine and pure. It was such a unique experience that I am so glad I got to read it. I can't tell you enough how I really appreciated all the research done by the author in order to make these characters as realistic as possible. I loved both of these characters a lot, but there was something so very special about Emmet. He stole my heart by how he loved Jeremey so completely and unconditionally. I hurt for Jeremey and how his parents disregarded his condition. I was so happy that he had Emmet in his life. I even really loved David, who was quadriplegic and became a friend to them both. It was absolutely so endearing watching Emmet and Jeremy fall in love. That innocence they both shared in how they explored all aspects of their relationship melted my heart.\n●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●'I belong. I have a friend who can kick ass from a wheelchair. I live independently and get good grades. I'm an excellent lover. Like I said. I'm awesome. I'm Emmet David Washington. Train Man. The best autistic Blues Brother on the block.'●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●\n The author did a wonderful job in how she wrote this story. It really hit me in the feels. I was a tearful mess at times. I learned so much about the conditions both the characters had. And it broke my heart with how insensitive some ignorant people can be to people that are just a bit different. It unfortunately happens a lot in real life because they forget that they are people with thoughts and feelings just like them. I applaud the author for bringing this subject to light and doing it in such a beautiful way. I loved the characters, the story, and the wonderful message this book conveyed. This book is definitely one I would HIGHLY recommend to everyone. You just have to experience this beautiful story for yourself."}, {"userName": "Catherine", "userReviewDate": "Oct 13, 2014", "userURL": "http://www.goodreads.com/user/show/24626621-catherine", "userReview": "When I was in teachers college, the instructor of my Introduction to Special Education course arranged for a guest speaker to come into our class for a presentation. This woman was the mother of not one, but two children with autism spectrum disorder. I remember that this mother gave a very informative and moving presentation, but the nugget that I'll always carry with me from that day was this: her children have autism; they are not autistic. To anyone else, this might seem like a case of semantics, but to her, this was everything. Her children were not defined by their disorder. Yes, it was a part of who they were, but not all of it. Not by a long shot.That's really what this story was about - two wonderfully complex characters, one of whom just happens to have autism, the other clinical depression. It's about how they meet, how they fall in love, and how they see, interpret, and interact with the world. And it's really something special."}, {"userName": "J *deep in the heart of Texas*", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/9072385-j-deep-in-the-heart-of-texas", "userReview": "4.5 Stars!Lots of great reviews for this one. I was hesitant to read this one because of it's heavier theme. This one definitely wasn't my \"preferred\" type of read. I spent the first half for sure just heart-broken over Jeremey and Emmet. And then I became more hopeful. And then I was just so damn happy for them. Fantastic writing. Two root-worthy main characters. Lots of tears. But some laughs and smiles too. Highly recommend."}, {"userName": ".Lili. ", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/8905618-lili", "userReview": "Let me begin by saying that there is nothing that I can write that would do justice to this book. This book is up there as an all time favorite- best of the best- unforgettable. This was as perfection. In this book we have two main characters who are dealing with heavy struggles in their lives. Emmet, has autism spectrum disorder, and Jeremey, has depression and anxiety. Subject matter...it's heavy and at times difficult to read. There was some ugly crying for me in this book. It was so heartbreaking.The thing is though- through the heartbreak Heidi Cullinan managed to also add lightness, caring, and love. This wasn't an angsty read that was all gloom and doom- there was so much hope throughout the story. What I loved:*It was told from an alternating POV.*There was an undertone of innocence.*Emmet. He made my heart melt. *Jeremey. I just wanted to love him and protect him.*The Washington's. Wish that every child had parents like them. *Dr. North*David! Heidi, please hurry with his book!*I love the uplifting feeling in the story even at the darkest of times. I knew that both the boys would be there for each other no matter the obstacle. *The romance. Talk about that feeling of warmth and happiness. *Triumph. Not only did I cry tears of heartbreak- but there were also tears of joy. I believe that EVERYONE should read this book. I, for one plan to have my daughters read it when they are age appropriate. As someone who fights depression and anxiety- I can't thank Heidi Cullinan enough for writing this book. There aren't enough stars to rate this one."}, {"userName": "Kat Kennedy", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "This book was so much and more. Other than kind of meandering toward the end, it was a near perfect read for me. Stunning, beautiful and so amazing to read. I highly recommend this book to other readers."}, {"userName": "Susan", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/4801837-susan", "userReview": "Re-read March 19 2016Still so good.Wow. This was awesome!I especially LOVED how it was emphasized over and over again that there is no normal. That is so true! What is normal? No such thing exists. Everyone is different, some just more than others.Emmet, autistic. Jeremey, depressed. And they were so good for each other.Emmet is autistic, he is also brilliant. When he sees his new neighbors he just knows he has to get to know Jeremey. Jeremey, who looks so sad all the time. They immediately hit it off and it is not long before they are best friends. Jeremey has no trouble with Emmet and his autism and Emmet doesn’t understand why people would have a problem with Jeremey and his depression and anxiety. It is just a part of who they are.Of course their road is not without trouble, and especially Jeremey’s parents are trying everything in their power to sabotage the relationship. But Emmet and Jeremey are so right for each other, there is no one that can stop them from being together. I have to admit there was a point halfway in the book where I wasn't sure Jeremey would ever be okay. But just when I was starting to drown in the depression that was Jeremey, David happened. Wonderful, wonderful David. David is paralyzed after a car accident and can only move his head and his left arm a little. He was just what Emmet and Jeremey needed. Something to spice things up a bit. I loved how their friendship developed after the rocky start.And the Blues brothers dancing scene in Target, wow, just wow. Emmet, Jeremey, David, they were awesome! I loved it.This is one of those books that will stay with me for a long time.\n Like I said. I’m awesome. I’m Emmet David Washington. Train Man. The best autistic Blues Brother on the block."}, {"userName": "Trisha Harrington", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/10383101-trisha-harrington", "userReview": "This is not my first book by Heidi Cullinan. I love Dance With Me and it's easily one of my favorite books. But this one is hands down my favorite of hers to date. I'm not sure I can properly describe how much I love this book, these characters and this story. It's amazing. Beautiful. Emotional. It made me feel.Jeremey broke my heart. He suffered so much. His parents didn't understand, they didn't want to understand either. They wanted him to be \"normal\". They wanted the perfect son. The son they could put in a box. And he tries. He tries to be what they want him to be. He does his best to get up every day and to do what they want him to do. Until he's no longer able to do that.sometimes I feel like everyone else is carrying a bucket of water but I'm trying to carry an ocean.Emmet has a supportive family behind him. They love him, support him and truly want the best for him. Sure, they don't always agree. But I never doubted how much they loved him. I had a soft spot for his dad. He was awesome. An amazing dad. His mom was great, too. She struggled for a while. But I know she only wanted the best for Emmet. Emmet is awesome in his own right. He's so lovable, as is Jeremey, and I fell for him straight away.I'm an everybody. I get a somebody.The relationship between these boys is heartbreaking and painful at times, but it's also beautiful. They are amazing together. And even though they have their issues, they work through everything. They communicate (most of the time) and nothing can stop their love. What helps you love them even more is getting both POVs. I loved seeing each MC through the others eyes. It was beautiful and it made my heart melt time and time again.\"I love you, Emmet. I'll love you always. I'll love you always best.\"I cannot recommend this book enough. There are so many things I love about it. It's perfect. Simply perfect. I'm really glad I read it because I do not regret it one bit."}, {"userName": "Emma Sea", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/5558652-emma-sea", "userReview": "couldn't put it down until i finished it. made me cry and laugh. Dani's review said it all."}, {"userName": "Bev", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/7981483-bev", "userReview": "Has gone straight onto my Awesome Audio Narration bookshelf, I think it's the best thing Iggy's done [that I've listened to]....other than Nowhere Ranch and the Love Lessons series. His interpretation of Emmet was spot on....slightly stilted, quirky and with underlying humour. Jeremey was also wonderful, softly spoken, tremulous at times when he got really nervous. David was exactly right....well, let's cut to the chase shall we??  Just everything about it was magnificent. An outstanding audio book for my #1 book of 2015!!  Congrats to all concerned."}, {"userName": "Macky", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/7500424-macky", "userReview": "Everybody, needs somebody/everybody needs somebody to love” The Blues Brothers.   Reading this amazing book I was always just a sniff away from a good cry. How I actually managed to see what I was reading I don't know, because for pretty much the entirety of the book my vision was blurred with tears constantly welling in my eyes, but as much as I was teetering on the edge, I also found myself grinning like a fool; delighting in the eccentricity and magnetism of 'Train Man' Emmet David Washington. \"My name is Emmet David Washington. I'm nineteen years old, and I'm a sophomore at Iowa State University studying computer science and applied physics. I got a perfect score on my ACT. I'm five feet nine inches tall with dark hair and blue-grey eyes. I enjoy puzzles and The Blues Brothers. I'm good at computers and anything to do with math. I remember almost anything I read and see. I'm gay. I love trains, pizza and the sound of rain. I also have autism spectrum disorder.\"  It's pretty obvious from the moment you meet him that this is going to be an emotionally uplifting story. He's an amazing, lovable character, meeting life head on despite the idiosyncrasies of his autism; the ones that tend to make some people nervous and wary of him. He rocks, hums and flaps his hands when he's upset or nervous, can't maintain eye contact, doesn't always like being touched, uses both language and visual signs when it's hard for him to vocalise his feelings, counts to calm himself and is sensitive to the general noises, smells and everyday life experiences that most of us take for granted. His world is 'loud' but not in the sense we know. He's also painfully honest, literal to the point of bluntness and off the scale smart. But he can also recite the whole of The Blues Brothers movie from memory, do the iconic Palace Hotel Ballroom dance that Jake and Elwood does at the end of the film ( I LOVE that scene), make beautiful animated patterns from computer codes and read or see anything that's in his peripheral vision. Emmet is a force to be reckoned with. An ingenuous genius with autism superpowers ...and I adored him!Jeremey is the quiet, sad looking boy from across the train tracks, who has caught Emmets fascination and interest. He wants to get to know him desperately, but more than that he has a major crush on the gentle boy with the extra 'e' in his name and wants him to be his boyfriend. When the opportunity finally comes around for them to meet face to face it's the beginning of a momentous life changing journey for both of them and a very special reading experience for anyone who has the pleasure to add this to their library. It had me emoting all over the place.. I swear to god I'm filling up now, just thinking about the two of them as I'm writing this review!...For rest of review follow Link: http://bit.ly/1GRC5GY"}, {"userName": "Tina", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/6015700-tina", "userReview": "I am normal. I belong. I have a friend who can kick ass from a wheelchair. I live independently and get good grades. I’m an excellent lover. Like I said. I’m awesome. I’m Emmet David Washington. Train Man. The best autistic Blues Brother on the block.\nThis was mind-blowing, tender, poignant, gut-wrenching beautiful, heart-breaking, emotionally satisfying,… I could go on and on until I’ll run out of adjectives.\n“It’s like Elwood Blues says: everybody needs somebody to love. I’m an everybody. I get a somebody.”\nMy reading-relationship with Heidi Cullinan’s books isn’t an easy one. I’m not a big fan of most of her previous books… but this one was pure awesomeness. I’m so glad I took the chance to read Carry The Ocean.Emmet is simply stunning, I was tempted to highlight every single quote! :)\nI shouldn’t have worried so much about it. Frankly, I’m awesome, and anybody who doesn’t agree should get out of my way.\nAfter reading Emmet and Jeremey's awesome story I can’t even imagine a world without those two. Emmet, Train Man and best autistic Blues Brother on the block, and Jeremey, with an extra e. The one Emmet has given a heartbeat pattern on his iPhone because Jeremey makes Emmet’s heartbeat go funny…\n“I love you, Emmet. I’ll love you always. I’ll love you always best.”\nLove those two with all my heart…Emmet’s parents, I don’t have any words… can parents be THAT awesome? Love them.((Marietta)) Can I have a hug, jujube?” I am not a fruit from China, which is what a jujube is, and I was too angry for hugs. But can I have a hug, jujube is my mom’s code for when she needs a hug. She’s a mom with lots of superpowers, but she says they’re powered by hugs.\nCan’t wait for the sequel. It’s David’s story… who can kick ass from a wheelchair. :)\nNormal is just a setting on the dryer.\n I hear ya, Emmet. :)"}, {"userName": "Mirjana **DTR - Down to Read**", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/3068938-mirjana-dtr---down-to-read", "userReview": "***5 Stars***Easily one of my FAVORITE reads of the year! If I can urge you to read any book this year, this would be it. I don't know how to adequately write a review that could even touch on the blinding beauty that is this hopeful and thought provoking book. \n\nEverybody needs somebody to love. I'm an everybody. I get a somebody.\n\nThis book deals with autism, severe depression and social anxiety in very real and honest ways. It could have been preachy, but it 100% is not. Heidi Cullinan handled Emmet, Jeremey, their journey, their love and their every day reality with respect, care and brutal honesty. As you can see, the topics and themes are serious and heavy, but the book doesn't feel that way. Not at all. It's hopeful, it's inspiring, it's funny and it's just downright sweet. Now, if you'll excuse me, I'm off to go and watch The Blues Brothers* for the first time and see if there's any way that I can learn to be as cool as Elwood Blues. *Yes, you read that right. I was born and raised in Chicago and have never seen The Blues Brothers. I wear my shame like a second skin."}, {"userName": "R * A Reader Obsessed *", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/21987508-r-a-reader-obsessed", "userReview": "5 Hearts!!Phenomenal in its scope, this was at times heartbreaking and difficult to read, while at the same time, inspiring and uplifting. Cullinan definitely knows how to bring tough topics to the fore and make them relatable - giving them a life of their own, a voice to be heard, and a right to be seen.Emmet is different to say the least. His autism renders him a mathematical savant but at the same time, he doesn’t quite process nor communicate as most people do, and thus he’s often mislabeled some very ugly things. One day, Emmet spies Jeremey from afar, and though he knows he has the cards stacked way against him, he bravely introduces himself, wanting to at least be friends with the handsome guy.Jeremey may look and act “right” on the outside, but on the inside he’s a roiling mess of paralyzingly anxiety and indecision. Simple, everyday tasks seem insurmountable, and guilt and worry drag him down into hopelessness, as he feels all he does is disappoint everyone in his life. When a strange, off putting guy says hello, Jeremey never imagines that it would turn his world upside down in all the best ways. This was a great friends to lovers story of how these two carve out - painful step by painful step - a safe place where they can be themselves and not always have to toe the line of normal. The struggle is definitely real, and I ached for both Emmet and Jeremey! Emmet knows his autism makes him special in so many ways, but it also inhibits him too, and it was a wonder how he adapted so he could have meaningful relationships and a rightful autonomy. Fortuitously, it’s those very differences that make Emmet perfect for Jeremey. His literal mindedness allows for no artifice, and Jeremey doesn’t have to worry about wading through a myriad of social expectations. Emmet tells it like it is, whether it’s nice or not. However, Jeremy is severely limited by his anxiety and depression, and he must learn acceptance of his disorder so he can develop healthy ways to cope instead of being conquered by such. Both these guys have to work at it and they work at it hard, always each other’s champion, always each other’s fail safe. So yes, this was a double win regarding the story and the audio. Iggy Toma brings to life Cullinan’s characters in such an amazing way, distinctly showing their differences and giving them heartfelt impact. By written word and by narration, portray and present a better understanding of probably little known disorders. Despite the challenges associated with them, the message that everyone deserves love and acceptance was wonderful. Just a great story all around! Rooting for the underdog never felt so good!Thank you to the author/publisher for the audio in exchange for an honest review"}, {"userName": "Heller", "userReviewDate": "Aug 28, 2014", "userURL": "http://www.goodreads.com/user/show/4975636-heller", "userReview": "Early ARC ReviewI really wasn’t sure when I started this read if it was going to be something that I was going to enjoy. I felt with it being both New Adult and one that focused on both autism and mental illness I would have a hard time connecting with the characters and their struggles but I couldn’t have been more wrong. This story just hit me on several levels. Educationally I learned so much about both what it is to have autism and what it’s like to deal with anxiety and depression. This wasn’t done in clinical way but a emotional and loving way that was realistic. There are no quick fixes here and I think that’s what really drew me in because I think I was worried we’d see a magical wand moment, we don’t and that really elevates this story for me from a good read to a stellar one. Emotionally reading about Jeremey’s everyday struggles with his illness was very difficult. Ironically it had me wishing for a magical wand moment to ease his pain but seeing him and Emmet as well both succeed and fail and succeed again was tremendously satisfying.The build up of the relationship between Jeremey and Emmet was one of the things that I really loved about this story. These young men work hard to understand each other and actively be good influences on each others lives. They build a strong loving relationship and I’m curious to see if book two will continue to follow them or if it will expand on the other residents of the Roosevelt. David’s story is waiting to be told and the friendship that the three of them built is another part of this read that worked so well.I loved this story and I loved the characters from the MC’s to the secondary ones and every and all in between. This was ugly and real but not grim. It’s hopeful with a hint of sexy and fun thrown in on the side. I can’t recommend it enough.**Copy provided by the publisher in exchange for an honest review**"}, {"userName": "Christelle", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/11766198-christelle", "userReview": "What a warm love story : how not to fall for Emmett and Jeremey, these 2 young men that want to belong and be happy. The description of their exchange of simple looks or touch was melting.It took me a while to go for this wonderful gift from my sweet Josy (Thank you so much, Josy : you know me so well : I loved it). Trust my GR friends (Yes, Jan, Ariana, Chris and Lorraine, I’m talking about you !!) to give me a gentle push. My fear : too much angst and hopelessness because the MCs have a lot of obstacles to deal with : Emmett to thrive through life despite the regards of people not understanding his autism and Jeremey, afflicted by severe depression and anxiety and with no support from his parents, crippling him even more.But it’s not that at all. On the contrary. Once Emmett decided that Jeremey will be his boyfriend because he’s just that awesome, and with the adequate help, nothing can stop them. And it’s beautiful to read. Even more so that the author chose for Jeremey to have the strength to look for help. It’s not yet ingrained that depression is a disease and has to be treated as such.Coincidence : I finished this book during the “Worl Autism awareness day”, with Hugo Horiot, French actor and writer, raising his voice about the French education system and institutionalized centers that are an hindrance for autists. Food for thoughts."}, {"userName": "☆ Todd", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/12415682-todd", "userReview": "Okay, so this time around, I'm \n\"that guy\"\n, so please hold off the flaming torches and pitch forks until the end. Thanks!\nI really \n*liked*\n this book. Quite a lot, actually.But...By the last page, I was fucking EXHAUSTED.During the first part of the book, we got some serious insight into what it was like for Emmet to live day to day with his autism. It was very enlightening and I'm a bit ashamed to admit that I laughed as often and as hard as I actually did.\nDuring the same part of the book, we meet Emmet's love interest, Jeremey, who suffers from severe depression and intense anxiety. I truly enjoyed learning more about his trials as well.\nWatching them fumble around one another was completely endearing and I fell in love with them both.\nBut...\nDuring the middle of the story, when Jeremey is in the hospital, then the halfway house, it was as if his lethargy began rubbing off on me and those pages just made me want to lie down and take a nap. I think I actually did at one point.\nThe story was still very good, so please don't get me wrong. These chapters were completely essential to the story, they just made my attention wander.\nBut...\nOnce Emmet and Jeremey were officially forging their lives together during the last part of the book, at The Roosevelt, I had made my way out of the quicksand and was all in again.Besides some mental fatigue on my part, here are a few things that I truly *LOVED* about this read: - Superpowers - Foam hammers - Emmet's blurting and his sex talk with his mom. - “Target practice” - Emmet's parents. No. Words. - David, the quadriplegic asshole housemate. Again... No. Words. But times 2: \n“So we can be friends now. Unless you’re a jerk.” “Please be my friend, even if I’m a jerk. Hit me. That will always get my attention.” “I can’t hit you. Hitting is wrong.” I hummed and flapped. “I could make a sign and teach you. A sign that means, David, you’re a jerk and need to stop right now.” “They have one of those already. It’s called your middle finger.”The middle finger is a rude gesture, and I’m not supposed to do it. But I decided that for David, a rude gesture was probably exactly what I needed. “Okay.”\n - The awkward as fuck 'sexy' scenes:I asked Jeremey if he wanted to try anal sex, and he said yes. I wasn’t surprised. Jeremey always said yes to anything about sex. He wasn’t nervous about anal penetration now. We’d ordered a dildo from a reputable online sex store, and he said it felt great. I tried it too, but I don’t care for things in my butt. Jeremey does, which is good. I wanted to be in him that way. - Emmet's well-deserved self-confidence:I am normal. I belong. I have a friend who can kick ass from a wheelchair. I live independently and get good grades. I’m an excellent lover. Like I said. I’m awesome. I’m Emmet David Washington. Train Man. The best autistic Blues Brother on the block.Yes, Emmet. You truly are awesome.4 *balloon-balloon-quicksand-balloon* stars for this gratifyingly-unique read."}, {"userName": "Elsa Bravante", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/43297890-elsa-bravante", "userReview": "Muy bonito, tierno. Emmet es autista, Jeremey sufre de depresión severa y ansiedad clínica, con que el libro esté medianamente bien escrito (que lo está) y con un poco de sensibilidad, es fácil que la historia te llegue y te emocione, imposible que no lo haga cuando ves a dos personas sufrir por algo que no pueden controlar y ves como trabajan para superarlo y conseguir tener una vida feliz. Muy interesante aquí la utilización de los dos POV, debido a la realidad de los dos personajes sería imposible entenderles sin \"escuchar\" sus pensamientos. Cada vez que Emmet habla notas su afán de superación, su cabezoneria y su lucha por conseguir sus objetivos, desde el más pequeño hasta uno que parecía imposible como tener novio. Cada vez que lo hace Jeremey se te rompe el corazón, me ha provocado angustia escucharle, sobre todo sabiendo que muchísimas personas sufren lo mismo con mucha incomprensión alrededor.Agradezco que la autora no haya caído en sentimentalismos demasiado fáciles, aunque el libro exuda un tono aleccionador sobre lo que está bien y lo que está mal, que aunque esté de acuerdo, no me gusta porque no me gusta que me den lecciones.Y aunque creo que las enfermedades están tratadas con seriedad y se nota que se ha documentado, a veces parece que nos están dando clases y la historia de amor de Emmet y Jeremey se pierde en ese adoctrinamiento.Recomendable."}, {"userName": "Sandra ", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/5034547-sandra", "userReview": "I don't have words to describe what this book did to me. Heidi Cullinan is a master story teller. I've devoured most everything she's published, and I was salivating for this book. I was also a little apprehensive about how she was going to pull off writing a character on the autism spectrum falling in love with a character who's been diagnosed with major depression and clinical anxiety.In the hands of another author, this might have been a disaster. In the extremely capable hands of Heidi Cullinan it became a masterfully written, carefully researched and exquisitely respectful master piece.I'm still struggling to find the right words to describe what I experienced when reading this book, so this is my pre-review:Pre-order this. Get your grabby hands on this book as soon as you can, and then savor it. Sit back, immerse yourself into this story. Keep the tissues nearby. You've never read anything like it. Actual review:I wish I had more stars to award...And I don't really have words to describe what this book did to me.I don't know a whole lot about autism, other than what I've been able to glean online, and there is such a wide spectrum that it would be difficult for anyone to really comprehend the range of this kind of normal.I do however know depression, having experienced it myself as a bout of post-partum that made the world look bleak and feel like a black hole, sucking every minuscule milligram of joy from my life. And even though I managed to climb out of that hole, it helped me understand just what Jeremey feels like.So, perhaps therefore I was able to more closely connect with Jeremey than with Emmet on a purely psychological level, but I adored them both.Emmet is analytical, straight-forward. He's kind, even if he can't make eye contact. He realizes his limitations, but his parents, especially his mother, have always been very supportive, and have encouraged him to live his life as fully as possible. Emmet loves trains, counting, and the Blues Brothers. And Jeremey.Jeremey, on the other hand, doesn't have supportive parents. His mother especially, a woman I loathed with a passion for most of the book, has made it extremely difficult for Jeremey to even function. She continuously forces him into situations that she knows will overwhelm him and then berates him for failing.Jeremey is much more in touch with his own feelings and those of others, which helps and hinders him both.But Emmet sees Jeremey and decides that they should be friends. And then boyfriends. And live together. Because Emmet believes in Jeremey more than anyone else believes in Jeremey, and together they succeed where they have individually failed.Of course, it's not without setbacks, and both Emmet and Jeremey have to reassess their limits, but their journey together - it made me weep and it made me smile.This book is an experience like no other, and I cannot think of anyone who would have been able to treat these very difficult subjects with such care and compassion, and such respect.The side characters, including David, who is a quadriplegic and a major catalyst in how Emmet and Jeremey communicate, were well done, even if I didn't like Jeremey's parents. David is wonderfully explored, and his character is given an important role by setting his physical disability in contrast to the psychological disabilities in this book, showcasing how differently he works with the hand fate has dealt him. It was also pointed out quite clearly that Emmet sees David as a man, and thus as a potential love interest for Jeremey, instead of just someone in a wheelchair, which causes a huge strife between the men, and is part of a very dark period in their lives, almost derailing them.This is still a love story at its core, and as such is presented in a loving, emotional way, showcasing how the two characters feel about each other, showing how connected they are, despite and because of their individual limitations.This was a master piece, and there is no way my review can even attempt to do it justice.It's still early in the year, but this book is easily going to be in my list of the top reads for 2015.Read it, I beg you.** I received an early review copy of this book for free from the publisher via Netgalley. A positive review was not promised in return. **My gratitude to Samhain for granting me a review copy, and my admiration to the author for writing such a beautifully crafted story."}, {"userName": "Martin", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/18709452-martin", "userReview": "I absolutely loved this story about Emmet who wants nothing more than a real-life boyfriend. Emmet is 19 and a physics student, but what prevents him from participating in the dating pool of teenaged gay men is his autism. He has troubles controlling his emotions sometimes and needs clear rules and schedules to feel confident and comfortable. He hates when people call him the R word. For him, his autism isn't an obstacle, but a fact of life that he learned to deal with. Still it makes dating hard and finding a steady boyfriend almost impossible.However, the handsome sad boy from the house across from Emmet's quickly befriends him and shares Emmet's feelings. Unfortunately Jeremey has to deal with a darkness that influences his life much more than Emmet's autism ever did.This was an excellent tale of love and acceptance. Emmet and Jeremey were the perfect couple, understanding and tolerating each other's problems. Growing up is never easy, but gaining independence for someone who simply cannot do certain things because his brain works differently must be the ultimate challenge. Still, Emmet and Jeremey managed life together in a way that none of them could have on their own - which is what every relationship is eventually about.5 stars for the message that everybody deserves to be loved and everybody has lots to offer to a boyfriend, not just appearances!"}, {"userName": "Chelsea", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/31223542-chelsea", "userReview": "Reread - April 2018 - This is one of my most favourite books! Will reread forever and ever!April 2017 -  I didn't think it would be possible but that was even better second time round!!!! I've struggled lately finding books that I want to block out the world for, but I surely do with this one and I absolutely did this them round!Ahhh.....Love!ReviewSo so so beautiful!!! This was such a lovely story about these two meeting, falling in love and learning how to live independent lives against the odds of having potentially debilitating disabilities.One of the things I loved most about this book was how it showed two very different severe disabilities and the effect support and education can have on how that person lives. Emmett with his autism (not so severe that he's non verbal, but definitely still severe), has had loving supportive parents and good medical care since childhood and is one of the most amazing men I've read about. He's so well adjusted and manages his autism so well... I loved his story. Then there's Jeremey and he has clinical anxiety and depression, his parents are ignorant to disabilities (some of the ways they interacted with Emmett... Argh I wanted to straggle them). They thought Jeremey would be able to just snap out of it and constantly lost patience with his panic attacks. Jeremey's depression is so out of control, being in his head was heartbreaking. Most of the story is about his adjustment to life with his new support system (Emmett) and learning to accept who he is.Its really not all serious and heart ache though. There's quite a bit of humour as well, Emmett doesn't understand metaphors and is very blunt, some of the things he said made me giggle alot. \"Sorry\". I sent it fast so he didn't worry. \"I was thinking about my cock in your anus, and it distracted me.\" But I loved it most when Jeremey said, \"I realized I was always this cool. I'd just been waiting to figure it out.\" Beautiful!!!"}], "description": "Normal is just a setting on the dryer.\nHigh school graduate Jeremey Samson is looking forward to burying his head under the covers and sleeping until it’s time to leave for college. Then a tornado named Emmet Washington enters his life. The double major in math and computer science is handsome, forward, wicked smart, interested in dating Jeremey—and he’s autistic.But Jeremey doesn’t judge him for that. He’s too busy judging himself, as are his parents, who don’t believe in things like clinical depression. When his untreated illness reaches a critical breaking point, Emmet is the white knight who rescues him and brings him along as a roommate to The Roosevelt, a quirky new assisted living facility nearby.As Jeremey finds his feet at The Roosevelt, Emmet slowly begins to believe he can be loved for the man he is behind the autism. But before he can trust enough to fall head over heels, he must trust his own conviction that friendship is a healing force, and love can overcome any obstacle.Warning: Contains characters obsessed with trains and counting, positive representations of autism and mental illness, a very dark moment, and Elwood Blues.", "title": "Carry the Ocean\n      \n          (The Roosevelt #1)", "url": "http://www.goodreads.com/book/show/23110300-carry-the-ocean", "average": 4.42, "cover": "https://images.gr-assets.com/books/1489167400l/23110300.jpg", "reviews": 792, "authors": [{"url": "https://www.goodreads.com/author/show/3173295.Heidi_Cullinan", "name": "Heidi Cullinan"}], "type": ["Romance", "Romance", "Contemporary", "Disability", "New Adult"], "outlinks": ["http://www.goodreads.com/book/show/23110300-carry-the-ocean", "http://www.goodreads.com/book/show/23429582-carry-the-ocean", "http://www.goodreads.com/book/show/35272194-carry-the-ocean", "http://www.goodreads.com/book/show/24837447-carry-the-ocean", "http://www.goodreads.com/book/show/17853573-love-lessons", "http://www.goodreads.com/book/show/26153131-dance-with-me", "http://www.goodreads.com/book/show/24979204-nowhere-ranch", "http://www.goodreads.com/book/show/17558204-family-man", "http://www.goodreads.com/book/show/16076072-dirty-laundry", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}