{"ratings": 50954, "userreviews": [{"userName": "Grace Tjan", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/1889855-grace-tjan", "userReview": "To: MFrom : Jane MoneypennySubject: An assessment of Agent 007's conduct during operation “Casino Royale”Dear Sir,I am aware of concerns raised by certain members of the Service regarding Agent 007’s performance during the abovementioned operation. Therefore, I would like to offer my personal assessment, based on the debriefing reports and my own long familiarity with the subject.It is true that Agent 007 had somewhat compromised the operation by letting himself getting caught by the Target, otherwise known as “Le Chiffre”. It is also undoubtedly true that he might have compromised the integrity of the valuable intelligence that we gathered by becoming an intimate of No. 3030, a.k.a. Vesper Lynd. However, despite all of that, he had managed to accomplish all of our objectives in the operation, as well as unmasking a potentially dangerous double agent.I can personally vouch that the ‘errors’ that Agent 007 had allegedly committed stemmed not from gross negligence or willful disobedience, but strictly from certain aspects of his character, which are regrettable but perfectly understandable in a man of his persuasion. The most obvious of these is his antipathy toward female operatives, best illustrated by these quotes from the debriefing report:“And there was this pest of a girl. Women were for recreation. On a job, they got in the way and fogged things up with sex and hurt feelings and all the emotional baggage they carried around. One had to look out for them and take care of them.”And also:“These blithering women who thought that they could do a man’s work. Why the hell couldn’t they stay at home and mind their pots and pans and stick to their frocks and gossip and leave men’s work to the men.”Isn’t it patently obvious, sir, that such preconceived notions caused him to fall for the Target’s devious trap? However, he had subsequently paid dearly for such deplorable misogyny by suffering the worst kind of torture known to the male of the species --- a ghastly affair that involved a cane chair with cut out seat, a 3 foot long carpet beater and Agent 007’s naked nether regions --- the details of which is available in the medical report attached to Head of S’s memorandum.Further on, his psychological condition during the long convalescence led him to develop certain feelings for Miss Lynd, to the extent that he was prepared to propose marriage to her. I can assure you that such feelings were genuine (even though he later rather callously repudiated them) and that he truly had honorable intentions toward her. It is obvious from Miss Lynd’s unfortunate reaction that the feeling was mutual.Based on the aforementioned reasons, I propose that we keep Agent 007 in active duty as he had proved that he was able to overcome his personal weaknesses for the good of the Service. Besides, we now have incontrovertible proof that Agent 007 is irresistible to enemy females, a quality that might come handy in future missions that might require such ability.Signed: Second Officer Jane Moneypenny, WRNS.P.S. : Please disregard any insinuation from certain members of the Service (you know who they are, sir) that I have a ‘crush’ on James Agent 007."}, {"userName": "Brina", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Bond, James Bond. Over the years I have enjoyed watching the action movies starring England's favorite 007 spy, yet, until now, I had not read any of Ian Fleming's classic books explaining Bond's origins. In Casino Royale, a tale of stealth, lust, and treachery, we see where Bond's 007 career begins. It is the years following World War II, and the Cold War has emerged from the ashes of Europe. The Russian intelligence agency SMERSH with backing of Arabian oil money has become a threat to take over the west. Spies and double agents abound, and newly minted 00 agent James Bond is sent to the Casino Royale to track agent Le Chiffre back to SMERSH and foil the Russian's plot. What ensues is high jinx and high money stakes that are sure to leave one on the edge of their seat. Alongside supposed ally Vesper Lynd and foreign friends Mathis and Leiter, Bond takes the case. Because this is Fleming's first Bond story, the novel is more about Bond's background in the service and less about chasing the villains across the globe, as fans of the movies are familiar with. We discover how Bond earned his 00 stripes, his role in the Service during the war, and that he is never without a drink or cigarette. The Bond in Fleming's novel is the same Bond who has appeared on the silver screen all these years and is a thrilling to read about. In the end there abound chases, girls, and double agents. Bond saves the world from the spread of communism, and his career as a 00 agent lives to see another day. There will be further tales of high jinx espionage, which Fleming gleaned from his own years in the British service. In a documentary, it has been revealed that the character James Bond was created as a composite of people Fleming came across while serving during the war; however, the real James Bond still remains shrouded in mystery. Casino Royale was a fun read for a gloomy Sunday afternoon. Knowing the cast of characters, it was fun to read about them in print form. I am looking forward to reading more of Ian Fleming's classic Bond tales to see if the films hold as true to them as they have this first one. James Bond will indeed be back, as I rate this introductory story a solid 4 stars."}, {"userName": "Julian Meynell", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/12278245-julian-meynell", "userReview": "SpoilersThis will be a review of not just Casino Royale, but of the James Bond books in general. I think that there is a good argument to be made, that the Bond books are the most misunderstood books of all prominent books, because the very subtext that accounts for their enduring appeal is buried so deeply that it just passes most people by.The best way to understand the James Bond books is to understand the heroines of the books. These heroines are often characterized as being glamorous women who it is Bond's role to save. This is completely and totally wrong. The whole key is that these women ALWAYS have short unpainted nails. They are actors and present an existential challenge to James Bond. In fact the best way to understand Bond is as a kind of existential literature.Fleming was a writer who had a message that he seemed not to be fully and consciously aware of. He says the same message in every book, and he says it in the same way (with the exceptions of The Spy Who Loved Me and the short story Quantum of Solace, where the same themes are approached from alternative directions).Fleming is often compared to Le Carre, almost always negatively. This is an unfair comparison in two ways. First of all, Fleming is a great writer and is, along with Lovecraft, one of the two greatest writers of Pulp in history, whereas Le Carre is merely a very good writer. Second, Fleming is not really writing spy literature, he is really writing fantasy in which the hero happens to have the occupation of a spy. As such, criticisms of a lack of realism are about as out of place as they would be for The Lord of the Rings or Alice in Wonderland. I would have thought, that the Bond books wear their status as fantasy more clearly than, say, the Latin American Magical Realists, but this point appears to pass people by.The next thing to notice about James Bond is that he is pretty clearly a broken person. The thing that I most love about Daniel Craig's interpretation of Bond is that he conveys this point clearly and repetitively in a way that has not been done before. Bond is a kind of broken Nietzchean superhero who has in a way arbitrarily and for what appear to be purely aesthetic reasons, taken on a specific set of values that we are meant to recognize intuitively as a priori superior to competing values. In this he is exactly the same as both the James Bond heroines and villains.If you read the Bond books critically, one of the things that is most striking about them is how similar in personality Bond is to both the heroines (with a few exceptions) and the villains (also with a few exceptions). Fleming will distinguish Bond from the villains not so much by their actions, which are often quite similar, but instead by things such as the cut of their suit or their taste in luxury watches. These aesthetic choices are meant to be inherently preferable, just as Bond's belief system and set of values is never defended as superior to communism or, ironically, to the vast accumulation of wealth and power that other figures such as Goldfinger are bent on accumulating, e.g. the values of capitalism.Bond, the villains, and the heroines of the books all have in common that they do not in any way feel bound by conventional morays, rules of decorum or value judgments. All of the major characters have in fact chosen a belief system and a set of values through force of their personal will alone. The other characters have not and this is why those characters are kinds of ghosts within the books and are in some sort of way not worthy of interacting with Bond.The villains have in fact chosen the wrong values. They are every bit as ruthlessly dedicated to them as Bond, and they will not in any way compromise them just as Bond will not. The women have either chosen the same set of values as Bond or at least a set of values that are not diametrically opposed. They are then worthy romantic interests (this goes only for the main female character in every book). However, Fleming is clear that the heroines Nietzchean superman status means that they are too independent to make the kind of long term bonds necessary for stable relationships. They are not in the next book and presumably, they, like Bond, have moved on unchanged. This is clearest in Casino Royale where the doomed nature of the genuine love that Bond has for Vesper Lynd is clearly spelled out in the events leading up to and following her death.Also, in this book, Bond fails in his mission in a way that he will not do so spectacularly again, but in staying true to the values that characterize him even at the expense of rejecting a genuine love, he maintains his status as a Nietzschean superhero. A status that Fleming clearly means to be a kind of idealization of how to live one's life and not an actually fully achievable ideal. It is by setting Bond in a fantastic world and not in a world where mundane limits can intrude on this ideal that Fleming can over and over again put forth this ideal in its pure form.Again, it is a world where the choice of a man's luggage is meant to say as much about him as the choice of his political ideals. It is a morality justified by its aesthete and not vice versa.But even though it is a fantasy world, it is still a world in which it is not possible to simply always force one's will onto that world. Bond may fail to save the woman, he may fail to stop the villain from getting away, his wife might die, his friend's legs might be eaten by a shark, he may be captured, he may be emotionally devastated by events. But it is still a world in which his maintenance of his own values and beliefs can be specifically maintained through every hardship and peril. In pretty much all the Fleming books, Bond is distracted by doubts, or by emotional weaknesses, and in every book Bond overcomes these by simply pushing them away.In other words the Bond books represent a kind of practical existential ideal. It is not an implausible solution to the practical problems of our world that Fleming is unconsciously advocating and it appears to be what he attempted to practice in real life. But it is a difficult solution that he advocates none-the-less."}, {"userName": "Carmen", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "[ Even though Bond wants to take a chance on Vesper (he considers retiring from the Service and toys with the idea of marrying her) she turns out to be a double agent. Her lover is a captive and they'll kill him if she doesn't obey. She ends up nobly killing herself in order to 'save' Bond, to which he responds with deep hatred for her and referring to her as a 'bitch' again. Charming.  (hide spoiler)]"}, {"userName": "Matthew", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[trading Texas Hold-Em for Baccarat (hide spoiler)]"}, {"userName": "Joe Valdez", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "[Bond's romantic duel with Vesper Lynd (hide spoiler)]"}, {"userName": "mark monday", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Ian Fleming has some poetry in his veins! I would never have guessed that. much of the prose in this spy thriller is basic and almost ostentatiously declarative. prose from and for a man's man, I suppose. but every so often, we have lines like:\nIn his mind he fingered the necklace of the days to come.The moonlight shone through the half-closed shutters and lapped at the secret shadows in the snow of her body...Bond awoke in his own room at dawn and for a time he lay and stroked his memories.\nso Bond is the man, a man's man. he's not a nice man, nor an empathetic one, but he get's the job done. Don Draper Bond? Walter White Bond? if the shoe fits. but he's more than a compelling anti-hero. he's a broken vessel, one who has convinced himself that he's whole. poor Bond. he just needs love. and until he finds it, he's going to convince himself that that's exactly what he doesn't need.SPOILERS AHEADI was really surprised at how much this book is about how Bond relates to women. it is practically a romance novel for anti-romantic men, one that also includes a lot of gambling and enjoyment of the finer things in life. by the end of the novel, Bond - who has been experiencing some existential angst and is questioning whether or not he wants to continue with his chosen profession - decides to stick with his job as a secret agent because he has had his heart broken.so here's what we know:- Bond is an old school sort, and has strong chauvinistic tendencies in his professional work. he is unsurprisingly a gender essentialist. I'm not sure if I'd call him a misogynist.- he's a caveman in his outlook on romance. he wants to have rough, rapey (\"rapey\" not actual rape) sex with a woman who wants to be ravished.- at one point in his life, a relationship ended badly for him. maybe more than one relationship. love died but the relationship lingered on, the results of which have made him tell himself repeatedly throughout the novel that romance is not for him. he just wants to hit it and quit it. or so he says.- he sees himself as a cold, brutal sort. the key part of that phrase for me is he sees himself as. there's a lot in this book that implies that Bond is creating the man he wants to be, that he's purposely hardening himself to the world - and specifically to women - but he's not quite there yet.- Bond meets one Vesper Lynd and is immediately attracted to her. his feelings towards her are an interesting stew of irritation at having to deal with a colleague who is a woman, basic sexual attraction, and admiration for her cool composure combined with an equally cool supportiveness towards Bond.- Bond is captured, tortured, freed. during his lengthy convalescence he experiences a lot of existential doubt about \"heroes\" and \"villains\" and how the two roles are interchangeable. a colleague mocks him when he brings this up. Vesper visits him and treats him with kindness and empathy, and no mockery. he slowly falls for her. it was a genuinely moving thing to read.- Bond and Vesper go off on a romantic vacation together. Bond is a walking hard-on when he thinks about what's to come:\nShe was thoughtful and full of consideration without being slavish and without compromising her arrogant spirit. And now he knew that she was profoundly, excitingly sensual, but that the conquest of her body, because of the central privacy in her, would each time have the sweet tang of rape. Loving her physically would each time be a thrilling voyage without the anticlimax of arrival. She would surrender herself avidly, he thought, and greedily enjoy all the intimacies of the bed without ever allowing herself to be possessed.\n- on the first night of their romantic getaway, Bond and Vesper finally hit it. it is just as amazing as he imagined it would be. Bond and Vesper are in love.- something weird and ambiguous comes between them and Bond becomes increasingly confused and depressed. he doesn't understand how and why the love of his life has become so strange and distant. he remains a gentleman throughout but assumes this affair will end like his past relationships... with a feeling of emptiness.- Vesper and Bond have a wonderful last night together full of drinks, lovemaking, and tears. she writes him a letter that describes how she is a double agent who has fallen in love with him. she kills herself.- Bond goes into a state of shock. then Bond goes into Efficient Agent Mode. Bond decides that he will remain a secret agent so he can destroy SMERSH (the agency that drove Vesper to kill herself). Bond cannot (or will not) process Vesper's complicated back story and the effect she has had on him, so he destroys the memory of his love for her. or at least he attempts to... Bond may be fooling himself but he hasn't fooled me. Vesper is a defining person in Bond's life, no matter how much he may want to discard his memory of her. the last sentence of the book is reserved for her, as is the actual last word... bitch. and so Bond degrades his memory of Vesper and compartmentalizes her away, and is one big step closer to becoming that cold, brutal man he's always envisioned himself to be. I guess that's what losing the love of your life can do to a person.this was an absorbing, surprising introduction into the world of 007. I'm not sure what I expected, but it certainly wasn't this."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "The first novel about James Bond, the 00 agent, takes place at the Casino Royale. He has to outplay a French/Russian operative to take money away from the communists.If Bond fails in his mission by losing at the card table, then British government will be directly funding communists. No pressure.I have a thing for Bond. Cool under pressure, fast cars, looks fabulous in a tux...I thought I would like this a lot, but I didn't. I don't think the story has aged well.The best parts of the tale took place in the casino itself, the bar or the dinner table.\"Bond had always been a gambler... above all, he like that whatever happened was always one's own fault. There was only oneself to praise or blame. Luck was a servant, not a master. Luck had to be accepted with a shrug or to be taken advantage of up to the hilt. But it had to be understood and recognized for what it was and not be confused with faulty appreciation of the odds. For, at gambling, the deadly sin is to mistake bad play for bad luck.\"Bond certainly knows how to order a drink:\"A dry martini,\" he said. \"One, in a deep champagne goblet... three measures of Gordon's, one of vodka, half a measure of Kina Lillet, shake it until its ice cold and then add a large thin slice of lemon peel. Got it? ... I hate small portions of anything, particularly when they taste bad. This drink is my own invention. I'm going to patent it when I can think of a good name.\"His attitudes about women were particularly depressing: \"As he drove, whipping the car faster and faster through the night, with the other half of his mind, he cursed Vespa and M for having sent her on the job. This was just what he had been afraid of. These blithering women who thought they could do a man's work. Why they hell couldn't they stay at home and mind their pots and pans and stick to their frocks and gossip and leave men's work to the men?\"This blithering woman is going to put down the book now and back away slowly...Recommended for... not blithering women?I believe I'll stick to the films from now on."}, {"userName": "Juli", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/38617426-juli", "userReview": "Casino Royale is the first book in the James Bond series. I've seen the movie -- the new and the old version -- many times, but this is the first time I've actually read the book. James Bond is a much more complex character than the way he is portrayed in the movies. Yes, he travels to exotic places to kill people and he has more than his share of liaisons with beautiful women....but the books include his thoughts on his job, his fear and apprehension during missions, and his considerations of retirement, settling down, forming a more lasting relationship with a woman, etc. The complexity of the character just doesn't come through in the movies. The movies are pretty much just action-packed fight scenes separated by drinking martinis and having sex. In Casino Royale, Bond infiltrates a high stakes baccarat game in order to bankrupt and ultimately ruin a Russian operative, Le Chiffre. With some help from an American CIA agent, Felix Leiter, and another British Agent, the beautiful Vesper Lynd, Bond manages to win a record amount of money at the baccarat table. But Le Chiffre is determined not to be ruined. He kidnaps Bond and Vesper Lynd, setting in motion events that might be the end of Bond. This book contains one of the most gruesome torture scenes I have ever experienced in a book. The movie starring Daniel Craig depicted the basics of the torture, but left out much of the psychological brutality of the entire scene. I thought the movie version was traumatic....but the book's description is so much more gruesome. It's an important scene that's integral to the plot of the book. It's not overdone and there is absolutely no detailed description of the event or in the injuries to Bond. The horror comes in the matter of fact manner in which Le Chiffre explains what he is doing and why, and the description of how he goes about it. The coldness, the violence, the unfeeling nature of a very evil man.....and the brutality yet simplistic nature of his attack on Bond. In the movie, a knotted rope is used for the attack. But in the book it's a simple household tool, a carpet beater. Le Chiffre comments that it is easy to cause extreme pain and suffering to a man with the simplest of tools if one knows just how to do it. The entire scene sent chills down my spine. It is definitely not for the feint of heart.The book has 3 distinct sections -- the baccarat game at the casino, the kidnapping and torture, and the aftermath. I didn't much care for the first section of the book. I have absolutely no interest in gambling and there is a lot of explanation about the game, the odds, what cards they are playing, etc. Plus Fleming uses a lot of French, German and Russian words and phrases sprinkled throughout. While that does help create atmosphere, after awhile it just gets old, especially when it's gourmet food, wines, liquors and other details I felt weren't all that important. For me, it was just a bit overdone. After the baccarat game, the action revved up considerably and the story became much more interesting for me. The ending is a bit abrupt, but it makes sense that it ends the way it does.After reading this first Bond book, I have a better understanding of the character and why he is the way he is. I want to read through the entire Bond series this year as part of my goal to read more books that I've always wanted to read, but never actually took the time. I'm glad I finally read Casino Royale. The book is so much more detailed than the movie. I listened to the audiobook version of Casino Royale from Audible. I'm glad I chose to listen to the audiobook as as I don't speak French, German or Russian and would have completely flubbed my way through a lot of wine, food, character and place names throughout the entire novel. At just over 5 hours long, it was a relatively quick listen. Dan Stevens narrates. Stevens reads at a nice even pace, and did an excellent job with all different accents and voices of characters. I have hearing loss but was easily able to understand and enjoy this audiobook."}, {"userName": "Jason Koivu", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "There is a time for every man and this man is of his time. I might go a step further and say, a profession for every man and this man is of his profession, for James Bond is a psychopath and one would need to be in order to do the things his job requires of him. He is a controllable psychopath. He's not the loner, loose cannon type. He's the loner, well-aimed cannon type. He's not going to fill up his closet with the severed limbs of his random victims, because the voices in his head told him to. He's going to fill up his closet with the severed limbs of his victims, because his boss told him to, and the victims won't be random. Bond objectifies women, often referring to them as \"bitch,\" seeing them only as a sexual commodity, and so many complain that they simply do not like this literary version of Bond. The movie versions of the books have conditioned people to like James Bond, portraying him as a dashing man's man who takes what he wants and discards the remains when he's done. It's cold-hearted, but we realize he's got a job to do...and gosh darn it, he's so dang handsome and charming! I can't deny the difference between the two. One is lovable, the other is loathsome. One is exciting to watch, but is otherwise a boring person. The other is exciting to watch and is an intensely interesting person. You watch the movies for fun and come away with a warm-fuzzy. You read the books for fun and come away leery of humanity.I'll put it simpler. Movie Bond likes to make ravaging love to his women. Book Bond has rape fantasies. I don't deny anyone's subjective tastes to like or dislike one over the other. I see good reason to hate Book Bond. But I wouldn't read Ian Fleming's work for pure fun. He's created a singular character type. In his work with Intelligence during WWII, Fleming must have come across numerous spies that fit Bond's description: cold and calculating cut-throats with anti-social tendencies and a warped world-view. James Bond is not a hero. He's a man paid to do a job. What you think of the man and your opinion of the job is entirely up to you. But real versions of these things have existed in our world and they are horribly fascinating."}, {"userName": "Will M.", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "I've been a huge fan of James Bond ever since Casino Royale(2006) was shown in theatres. I remember watching it with my family and my dream then was to become just like James Bond. I watched all the Bond movies that Daniel Craig starred in ever since that Royale movie. I haven't seen the older ones though, and I heard that this novel is similar to the older movies, and thankfully I haven't seen those. There's this scene in this novel wherein the villain tortured Bond by repeatedly striking his manhood, and I'm 100% sure that that scene is present in either Casino Royale or Quantum of Solace (more or less Royale). While reading the novel, I imagined Bond as Craig, and I don't think I can ever imagine him as someone else. The novel itself is very short, but substance filled. Is that a thing? Substance filled. I really enjoyed it, and it brought back a lot of memories. Not that much action I guess, but this is Bond, and I'm pretty biased about him. Deep inside, I'm sure I'd still want to be a spy if given the chance. I almost forgot, this novel explained why Bond got the 007 status, been wondering my whole life. Not sure if they told it in the movies, but I was 8 years old when I watched it, so I can't really remember much.Before I conclude, let me just say that the movies were not particular about Bond's vices/habits(?). He likes to smoke 70 cigarettes a day, take cold baths, and collect cool cars. I'm a huge car enthusiast, I hate cold baths, and I don't smoke, but one day, I still believe that I'll be just like James Bond. I'm a huge crime-mystery-thriller fan, and I'm a huge Bond fan, so this novel was quite enjoyable for me. I've been deciding between 4 or 5 stars, but I believe I didn't find any flaws that bothered me that much. Like I said though, I'm really biased when it comes to Bond. 5/5 stars, and I can't seem to not add this to my favorites list. Read this if you want a short but satisfying crime novel."}, {"userName": "Duane", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Everyone's heard of James Bond I'm guessing. I've seen a few of the movies over the years but can't say I'm a big fan; I can take them or leave them. But I thought I would add a few of the Fleming novels to my read list and I always like to read the debut novel of any author, especially if it's a series. Casino Royale is not considered one of the best of the novels by critics, and I can't say I concur because I haven't read any of the others yet, but I can understand after reading it. I gave it 4 stars, but 3.5 is closer to my thinking. About what I expected although there was more \"serious\" romance than I thought there would be. I think I'll read From Russia With Love next and see where to go from there."}, {"userName": "Chad", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/25388909-chad", "userReview": "Surprisingly most of the plot of the movie is in the book minus the parkour scenes in Africa. Bond is a cold ruthless bastard. It's hard to get past the sexism of the era (The book was written in 1953.), and there's a lot of it in here. The plot is slow and plodding in places, especially the beginning. The excitement picks up after the baccarat scene. It's definitely a cold war era spy novel with lots of double crosses and twists and turns. Definitely not the best Bond novel, but first books for a character rarely are."}, {"userName": "BrokenTune", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "\"Well, it was not too late. Here was a target for him, right to hand. He would take on SMERSH and hunt it down. Without SMERSH, without this cold weapon of death and revenge, the MWD would be just another bunch of civil servant spies, no better and no worse than any of the western services.\"And so begin the extraordinary adventures of the most famous of all spies. Had it not been for his involvement in bringing down the villain known as Le Chiffre, James Bond could just have been another one of such civil servant spies.Unfortunately, this is the only aspect of the Casino Royale story that I actually liked. The idea of James Bond and his mission is what draws me to the books, but not in fact the character of James Bond himself.James Bond, as a character, is an utterly unlikable, chauvinist, self-centered idiot, who happens to be good at playing cards but is otherwise pretty lucky to have anything go his way - whether it is his involvement with women or his actually staying alive.I first read Casino Royale some years ago, shortly before the film was released, and really liked it for the plot and the fact that a card game could pose more danger to the world's biggest villains than any attempts of arrest or assassination. Incredible! However, I enjoyed that the book dwelt on thinking through Bond's moves at the baccarat table more than on action scenes.However, on this particular re-read of the story, I felt more drawn to paying attention to the way Bond interacts with the world around him and was reminded why in some of the subsequent books I tend to root for the villains - I just can't stand James Bond.Would I still recommend this book? Yes. I think it is important to demystify the legend (and the franchise - even tho I do enjoy the films!) and acknowledge that there was a time when the most popular of books was based on a character that was a snob, a chauvinist, a racist, a misogynist, an egotist, and an utter idiot.2.5* rounded up."}, {"userName": "Councillor", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/40792319-councillor", "userReview": "Never before have I thought of myself specifically as a fan of the James Bond movies, although I did watch 13 out of overall 24 Bond films. However, along with the recent release date of \"Spectre\" (which I haven't seen yet), I wanted to discover how Ian Fleming's works influenced the successful movie adaptions and whether or not those movies lived up to the novel's expectations. \"Casino Royale\" has been one of the first Bond movies I thorougly enjoyed watching, so my expectations as to my reading experience with this first Bond novel were pretty high. Too high, I guess.Some amazing artwork originating from the movie can be found out there on the internet, and doesn't Casino Royale already sound pretty cool? Sexy double agents in suits with attractive girls surrounding them and villainous gangsters trying to take over the world who will probably end up being defeated after some sort of showdown - it's always the same procedure used in every film, yet all most of them become a huge success. In contrast to many other Bond movies, I can understand how this success came about since the adaption of \"Casino Royale\" was pretty well done, but after reading Ian Fleming's original, I am nothing but bored by even hearing the name James Bond. But who is this James Bond in the novel?Raymond Chandler once said that \"James Bond is what every man would like to be, and what every woman would like between her sheets\". So, if every man would like to be sexy, but tending to brutal, rapey behaviour, and protective with women, but degrading them, thinking of himself as superior to the other gender, and murdering numerous other people as a 'hobby' ... then I definitely don't want to be such a man. Never before did I encounter a character so unlikeable and abhorrent, and neither do I understand why people like those seem to have so much success with women. I'm not opposed to unlikeable characters - some of the most interesting protagonists I've read about are anything but likeable - but the image of men and women depicted by Fleming is simply unbearable.Ian Fleming's writing is certainly not awful. He included some interesting sections reflecting Bond's behaviour, giving his character time to think over his situation, but it did nothing to transform Bond into a character with depth. The double agent with a strong leaning towards sex with as many women as possible remains the only characteristic James Bond is allowed to have. But apart from that, the plot itself did not improve the novel's quality. Quite the contrary, the story of Casino Royale was boring. Yes, it was boring as hell. I caught myself skimming through the last chapters, being more annoyed by this book with every new sentence, and constantly struggling not to put it aside. (There's one advantage, however: I could use this as a bedtime story and thus avoid any potential problems with falling asleep.)This was definitely the last Fleming novel I've read. In conclusion, I can recommend watching the movie and just skipping the novels in order to not waste any time with this. It isn't worth the expenditure of time."}, {"userName": "Nandakishore Varma", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "I finally got to read a Bond novel...Yes, so far I had not read any of his books, but had religiously seen almost all the movies (especially the ones released during the late seventies and the early eighties - my teens and twenties). I enjoyed the movies for their goofy speed, silly plots, the imperturbability of Bond and all those lovely ladies (MMMMM!). But somehow, I never got around to the material where these films took off from.And now I realise that I am too late. There is absolutely no suspense: one has seen it all. The Soviet Union is long since defunct, so its demonisation is not even objectionable now, only laughable (especially when one considers what the \"good guys\" are doing nowadays). And Bond's attitude to women should have been objectionable even in those days - he is only interested in how to get them to bed. In fact, he is interested in finishing the mission quickly so as to get down to the serious business of sexually exploiting the pretty girls in the story.In this book, Bond comes as surprisingly naive. His only positive contribution is his luck at Baccarat (Ian Fleming somehow attributes it to his gambling prowess, but I failed to see the connection). He does not win a single fight, and lets himself be captured by acting like the hero of a third rate melodrama. In fact, the story moves on despite Bond, not because of him.However, I liked the human face of the character. James Bond is not the cool and super-efficient murderous automaton of the movies here - he is very human and vulnerable (too vulnerable where ladies are involved). Also, the novel is not entirely black and white with regard to heroes and villains: and the violence is graphic and the sex explicit for a book written in the fifties, which bespeaks boldness on part of the author.I have decided to read all the original stories one by one, if only to see how the movies compare with the written word."}, {"userName": "Richard Derus", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: well, why not? 3* of fiveOops! Forgot one. This is 1967's film version I'm discussing, not the book, which was *awful*. That's not fair...it's not horrid writing, it's just so very very very dated and not in a good way. Kind of a time capsule of what was wrong with 1954.Ya know...this film version was pretty damn lame, too. What redeems it is the sheer balls-out what-did-I-just-watch comedic pace of the thing. David Niven is LUDICROUS as Bond, but good as this character who isn't Bond but is called Bond. The return of Ursula Andress, this time as superspy Vesper Lynd (not to be mistaken for 2006's Vesper, completely different character), is notable; but the turn to the comedic and ridiculous is signalled by Bond having a child by Mata Hari, yclept Mata Bond. It was one of the many moments where I rolled my eyes so hard I think I saw my brain. There's a bit with a flying saucer in London that convinced me I was having an LSD flashback.Don't go into the film thinking it's a Bond flick and maybe it's okay...but frankly, it feels a little too Sixties-hip-via-Hollywood for me to do more than smile faintly.Why watch it, then? Because David Niven is very good at being urbanely nuts. It's a meta-performance. If he arched his eyebrow any higher, he's lose it in his receding hairline. Because Ursula Andress is classic as Vesper. Because Orson Welles is endearingly baffled as Le Chiffre, seeming not to have seen a script before being shoved in front of the camera. It's like a Warhol-movie moment. If you're a straight guy, Jacqueline Bisset and Barbara Bouchet are pneumatically endowed. But Peter Sellers was a major disappointment to me. Clouseau was his only character at that point, I guess. Blah.Fun. Not Bond, but fun. Sort of."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "My first James Bond novel which cements my opinion that Daniel Craig is the epitome of this steely MI man. When one reads these pages one is struck by the description of the character and his actions; he's cold, aloof, calculating, isolated. He's not a swaggering, macho, seducing machine. Don't get me wrong! Bond likes the ladies, but they have their uses. They are props and they are there for an affair once the case is solved. He's probably the most attractive man in the room. In Casino Royale Bond is after Le Chiffre, a money man for a communist organization who has embezzled. High stakes gambling ensues to recoup his losses. Bond challenges him at baccarat. This is a game I've never seen played. Bond's eventual capture and torture is spot-on the movie. There is also a Vesper, but her story follows a different trail. I'm looking forward to reading all 13 of this series."}, {"userName": "Mark", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/6755739-mark", "userReview": "Update 2018 - This is still a very well written book that introduced us to the world most famous secret agent. It is so well written by Ian Fleming his skill of descriptive writing have always been the best part of his writing. While I am no fan of a game of baccarat the man writes so well you can actually participating in the fun and games. Fleming as a writer deserves much more credit than he has been given. Always a pleasure re-reading a Fleming novel. They remain some of my favorite rereads. Nostalgic as well. My dad being in the claws of Dementia did recently tell me that is was alright that I took some books form his bookshelves, he did refer to Casino Royale among them. I still have that copy he bought as a young man. This is the book where the character of James Bond is being introduced to the world. The plot is essentially an idea that the writer Fleming had during the war when he was involved with the intelligence service, where he was involved in an idea to play in a casino against the opposition and make them lose all their money. Fleming did it not as well as his hero.Casino Royale is IMHO one of the better books with James Bond as main character. In 1953 with the movies still more than a decade away Fleming introduces his hero:The scent and smoke and sweat of a casino are nauseating at three in the morning. Then the soul-erosion produced by high gambling - a compost of greed and fear and nervous tension - becomes unbearable and the senses awake and revolt from it.James Bond suddenly knew that he was tired. He always knew when his body or his mind had had enough and he always acted on the knowledge. This helped him to avoid staleness and the sensual bluntness that breeds mistakes.The story is highly improbable but the very entertaining. It is a story about gambling, which is very aptly described by Ian Fleming and does transport you to the smokey casino where Bond plays for high stakes. (Fleming has the skill to write very good about card games and golf, no-one could ever interest me for these activities but Fleming).The plot is very simple but it is all about the gentleman hero/spy and how he plays the game. The mood is very well written by Fleming as are the actions of the secret agent.In my humble opinion this is one of the more exciting spy-novels written. And well worth a read before any of the modern day thrillers on that subject."}, {"userName": "K.D. Absolutely", "userReviewDate": "Sep 11, 2010", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "My name is Bond. James Bond.This is my first Ian Fleming's (1908-1964) novel about MI6 agent called James Bond. My dad used to bring us, his kids, to 007 movies when we were kids and I can still remember all the expensive cars exploding on the screen, shapely Bond girls in their bikinis, the high-powered guns and James Bond running, being chased by bad guys, escaping death in a millisecond precision.I am heartened to know that Casino Royale, first published in 1953, was the first James Bond book. So, it was the intro book to all Bond novels. It also explained his character: why did he become an agent and more importantly how he became tough. So, I would think that this book has the more human James Bond. In fact, there are fewer actions here compared to what I saw in his movies. Here he was tortured without any clothes on and I could not believe how he was able to escape death. He also fell in love with his gorgeous partner whose secret was revealed in the end that made my jaw dropped. So I kept reading till the last sentence that again made my jaw dropped. Yes, this book can make your jaw drop several times. Easy read. Action packed. Masculine. Tightly written. Great until the last word. I saw the 3rd movie adaptation several years ago and I liked it. Wiki says, however, that the original one was in 1954 and Bond was played by an actor called Barry Nelson. \n\nBut the 2006 most recent version was starring Daniel Craig. \n\nIt's amazing to see what 42 years can do to the character. Nelson looked plump, hairy, slightly cross-eyed and looks feeling cold while Craig is fit, buff, hairless, green-eyed and loves the sea. It could be the global warming!"}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "[Here I was, expecting that high-adrenaline ending with the heartbreaking loss of Vesper, and Bond going out to hunt down his next target, when it ended with Vesper committing suicide rather than the climactic fall of an ancient Venetian waterfront building. (hide spoiler)]"}, {"userName": "Inder", "userReviewDate": "Aug 14, 2008", "userURL": "http://www.goodreads.com/user/show/250817-inder", "userReview": "So. So. Bad. Also - incredibly, over-the-top offensive. Bond wants the somewhat-withholding Vesper because he knows that making love to her will always \"have the sweet tang of rape\"?? W.T.F.?Misogynist zingers aside, it's at least 70 pages too long. When it wasn't repulsive and offensive, it was really boring. I'm not saying it didn't have its fun moments, but they were surprisingly few and far between.Raymond Chandler is quoted on the back as saying, \"Bond is what every man would like to be and what every woman would like to have between her sheets.\" What I find sad is that Bond does represent a certain ideal manhood - brutal, misogynist, macho, emotionally distant, disrespectful towards and distrustful of women. Disturbing, to say the least.I want my morning back."}, {"userName": "Madeline", "userReviewDate": "May 28, 2008", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Call it a guilty pleasure, this book was just fun to read, mostly because I a) love Bond movies anyway and b) delight in sexist jokes, which made it easier for me to read Bond's anti-feminist rants and just giggle to myself. Here's one of my favorites, when Vesper Lynd gets herself kidnapped by the bad guys and Bond has to take the trouble to chase after them: \"This was just what he had been afraid of. These blithering women who thought they could do a man's work. Why the hell couldn't they just stay at home and mind their pots and pans and leave men's work to the men. And now for this to happen to him, just when the job had come off so beautifully. For Vesper to fall for an old trick like that and get herself snatched and probably held to ransom like some bloody heroine in a strip cartoon. The silly bitch.\" Mmm. I love the smell of misogyny in the morning. In Bond's defense, Vesper doesn't do much too much to change his opinion of women and their overall uselessness. She's supposed to be some kind of radio technician, but never gets to demonstrate any shred of intelligence that elevates her above the average 7th grade girl. Her only good bit of dialogue comes towards the end of the book, when she and Bond are safe and on vacation together: \"The bath had been filled for him and there was a new flask of some expensive pine bath-essence on a chair beside it with his towel.'Vesper,' he called.'Yes?''You really are the limit. You make me feel like an expensive gigolo.''I was told to look after you. I'm only doing what I was told.''Darling, the bath's absolutely right. Will you marry me?'She snorted. 'You need a slave, not a wife.''I want you.''Well, I want my lobster and champagne, so hurry up.' \"That's about as interesting as Vesper gets. The rest of the time she's busy running around after Bond, being referred to as \"the girl\" and saying things like, \"Do you mind if we go straight into dinner? ...I want to make a grand entrance and the truth is there's a horrible secret about black velvet. It marks when you sit down. And, by the way, if you hear me scream tonight, I shall have sat on a cane chair.\" Fascinating. Bond, for his part, didn't say anything especially intelligent either and made me thank god for Daniel Craig and his writers. I couldn't decide which was more annoying: Bond and Vesper during the assignment when they made banal small talk and Bond speculated on how soon he would sleep with her, or after they survive and decide they're in love and go on vacation together. (and don't look at me like I gave the plot away, you knew it was going to happen.) I think it's the latter - once Bond and Vesper survive the kidnapping, all potential of being cool vanishes as they become the most irritating couple ever. Having to read about them schmooping their way across France, eating caviar, and calling each other \"Darling,\" \"My love,\" and \"Dearest\" was enough to make me vow never to read another Ian Fleming book again. Anyway, point of review: movie version = awesome, book version = a delightful misogynist romp. Pick whichever you'd prefer."}, {"userName": "Fred Shaw", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/44212467-fred-shaw", "userReview": "Excellent spy novel, first of a long series. Fleming was a British Naval Intelligence officer in WW II. Bond and Bourne would make a great team."}, {"userName": "Alejandro", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "Bond began here...\n\nBOND, JAMES BOND\nI've fan of James Bond films all my life and I've seen them all. However I hadn't read any novel (at the moment of this review) so I thought that it was good idea if I'd read a first novel of James Bond has to be the first book where everything started. Hardly I was a newbie on Bond world as to need to read the first book, but I thought that it was the proper thing to do.I have clear that each story is self-contained, so I will read more Bond novels in the future but not in the publishing order.Well, it's clear that since it was the first novel, the character and his world is just starting to get into place and it's still in a heavy development.\nLICENSE TO KILL - BRAND NEW\nI feel that this book is not the best way to show the character.Since Bond doesn't do anything so extraordinaire and he is saved several times by others, when he got into troubles where he is unable to get out by himself.Hardly the scenario that one wants to read about of THE super spy, the most famous of all.Also the events are set in an odd way in the narrative, since the novel is titled Casino Royale, and while Bond was a lot of time there, a lot of happening in the story occured after of the events in the casino, and even there are a lot of happening after dealing with the main villain.So it's hard to understand where is the real climax of the story. One big merit is the dark tone of the novel, since there are a lot of gruesome events and situations that I think it wasn't so regular in novels in the 50's.The good thing is that it's short book, barely less than 200 pages, so you don't invest much time to read it."}, {"userName": "Roman Clodia", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "My first Fleming/Bond novel and it's far more interesting than I expected. Sure, it's 1950s pulp but Bond himself is portrayed as both super-cool and as more emotionally and psychologically vulnerable than we might expect. After an explosion, for example, which he dodges, 'Bond felt himself starting to vomit', so sickened is he by the bloody fragments of flesh surrounding him. It's fascinating, too, to witness his inner thoughts during that torture scene.There are, of course, objectionable moments but they, arguably, are attributed to Bond rather than necessarily to Fleming. For example, 'the conquest of her body... would each time have the sweet tang of rape' sounds hideous to modern ears, but Bond's inner monologue goes on to clarify that this feeling stems from Vesper's ultimate unpossessability: 'she would surrender herself avidly, he thought, and greedily enjoy all the intimacies of the bed without ever allowing herself to be possessed.' That it's Bond who falls in love and plans to propose after resigning from the service, while Vesper (admittedly also in love) is playing him made this book less misogynistic than I had expected. (She does, though, cry an awful lot!) It also feels like a kind of prologue to the rest of the series, giving us a backstory to what I presume will be Bond's psychological armour against women and emotional involvement. He's not, as one of his colleagues claims at the end, 'a machine'. Fleming keeps the whole plot sharp and short, no faffing about, and the casino scenes are genuinely tense. I found this a surprisingly engaging read and will certainly read on."}, {"userName": "Arwen56", "userReviewDate": "Nov 17, 2014", "userURL": "http://www.goodreads.com/user/show/9615245-arwen56", "userReview": "Ma che triste questo romanzo. :-(Vabbè, partiamo dall’inizio. Non avevo mai letto nessun libro di Ian Fleming, nonostante il fatto di aver visto moltissimi film tratti dalla serie di “007”. La molla è scattata due giorni fa, quando una conoscente mi ha prestato il DVD di “Casino Royale”, nel quale il celebre agente è interpretato da Daniel Craig, che sarebbe questo qui:Già un bel vedere di suo, direi. :-D[Arwen, per favore, ricomponiti.](Ok, ok, come non detto.)Dicevo … ho guardato “Casino Royale” e mi sono divertita una cifra. Era tanto tempo che non vedevo un film così genuinamente di svago, con situazioni esagerate e del tutto inverosimili, ma al contempo accattivanti. Avevo bisogno di tirare un po’ il fiato e non pensare. Anche se, alla fine, mi sono sentita un po’ stremata io al posto James Bond, che: 1) va su di corsa dalle impalcature da far invidia a una scimmia;2) salta da una trave all’altra meglio di un saltamartino;3) si arrampica su una gru come neanche King Kong avrebbe saputo fare;4) si catapulta giù da montacarichi, ascensori e scale tipo Tarzan;5) scavalca siepi e recinzioni più agile di un canguro;6) si scazzotta a ripetizione con chiunque, tanto che Cassius Clay gli fa un baffo, gli fa;7) ammazza come minimo una ventina di persone, ma questo è ovvio, perché lui ha la licenza di uccidere;8) viene avvelenato con la digitale, rianimato col defibrillatore e, fresco come una rosa, dopo dieci minuti torna a giocare a poker, puntando milioni di sterline, contro un delinquente che ha una espressione tanto serena e rassicurante quanto quella di una iena ridens;9) viene torturato in parti, diciamo così, un tantino sensibili sia per il corpo in generale, sia per l’orgoglio propriamente maschile in particolare, eppure lui niente … riesce a fare un sorrisino di quelli che ti fanno sentire una vera merda anche se sei sicuro di avere il coltello dalla parte del manico;10) nel bel mezzo di tutti questi casini, ha il tempo di “consolare” (eufemisticamente parlando) le belle di turno, in modo tale che a Casanova sarebbero venute le convulsioni per l’invidia.Ecco, il film è così, evidentemente poco credibile, come dicevo, ma comunque simpaticamente divertente. Perché lui è Bond … James Bond. E Daniel Craig è il primo “007” convincente dopo quello che è stato sicuramente il migliore, ossia Sean Connery, che sarebbe questo:Anche lui, indubbiamente un bel vedere. ;-)[Arwen, ancora?](Ok, ok, di nuovo come non detto.)Tornando in carreggiata, stranamente solo stavolta, per la prima volta, mi sono chiesta come potessero essere originariamente i romanzi del “papà” del famoso agente britannico. Intendo dire, dietro tutte le “americanate” dei film c’era qualcosa di diverso?Bé, in questo caso credo di sì. Gli altri non so come siano e quanto siano stati influenzati dal progressivo successo, ma il primo libro di Ian Fleming è molto amaro e percorso da un senso di struggente perdita. Non è che sia scritto particolarmente bene, ma si percepisce una specie di dolore di fondo che fa di questo Bond un essere molto più umano e molto meno supereroe di quanto si sia portati a pensare. E quel dolore deriva sicuramente da un disagio provato dal suo autore che, forse senza volerlo, lo ha comunicato lo stesso."}, {"userName": "DramaQueen", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/10087181-dramaqueen", "userReview": "I completely love the James Bond-movies; I've seen all of them and my boyfriend and I even went to the movie-exposition in Amsterdam last year (very awesome). When I came across a beautiful collection of all the books on the BookDepository, my interest was caught (yes, I'm a sucker for packaging thát much). As a bookworm, why not read the books by Ian Fleming, where the movies were originally based on? And so I did, starting with the first book in the series, published in 1953, Casino Royale.\"Mine’s Bond – James Bond.\" In Casino Royale we get introduced with the character of James Bond; a 00 agent (\"double o\"), namely 007, working for MI6. The 00 Section is the elite of the secret service with agents that hold a licence to kill. Bond receives an assignment: he is to out gamble Le Chiffre, an agent of SMERSH and the villain in this book, in the Casino Royale in France. To complete this mission, he gets assistance of Mathis, from the French secret service, and Vesper Lynd. \"The villains and heroes get all mixed up. Patriotism comes along and makes it seem fairly all right, but this country-right-or-wrong business is getting a little out-of-date. Today we are fighting communism. Okay. If I'd been alive fifty years ago, the brand of conservatism we have today would have been damn near called communism and we should have been told to go and fight that. History is moving pretty quickly these days and the heroes and villains keep on changing parts.\"For me, the beauty of Casino Royale was the atmosphere. Ian Fleming describes every detail in a scene; from the suit James wears, to the curtains hanging in the room, to the rules of the game of baccarat. I understand that for some people this seems really slow and boring, but for me this was a delight to read. I just absolutely loved the atmosphere. Also, all the little \"spy\"-details, which I doubt are based on true facts, are quite funny. Like the hair Bond lays over his drawers, so he can see if someone opens it when he is out. “A dry martini,' he said. 'One. In a deep champagne goblet.' ...Just a moment. Three measures of Gordon's, one of vodka, half a measure of Kina Lillet. Shake it very well until it's ice-cold, then add a large thin slice of lemon-peel. Got it?”What I didn't like, was the extreme sexism and women-unfriendly side of Bond. James has several rants in his head about the stupidity of women, especially Vesper. At one point, when she is kidnapped, he has a sort of conversation with himself stating that it is her own fault and that he will most definitely sacrifice her for the sake of the mission, if it would come to that. James Bond may seem like an charming womanizer in the movies; in the book(s) he is a harsh, cold and cruel sexist. Considering the fact this book was published sixty years ago and women weren't at the point they are now, I took the sexism for granted. But I can't say that I think that Ian Fleming was an enjoyable man. \"And then there was this pest of a girl. He sighed. Women were for recreation. On a job, they got in the way and fogged things up with sex and hurt feelings and all the emotional baggage they carried around. One had to look out for them and take care of them.\"Bitch,\" said Bond, and then remembering the Muntzes, he said \"bitch\" again more loudly and walked out of the room.\" Casino Royale was an enjoyable and easy to read book. I flew through it. I loved the atmosphere, the story was catchy and I'm definitely curious for the next part in the series. The torture scene that is also shown in the 2006 movie adaptation is absolutely epic. The only thing I disliked was the sexist side of Bond, which made me doubt the character of writer Ian Fleming himself. Yet, this remained a very fun read. \"People are islands. They don't really touch. However close they are, they're really quite separate.\""}, {"userName": "Evan Leach", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/7713825-evan-leach", "userReview": "[\"The bitch is dead now\" (hide spoiler)]"}, {"userName": "Robert", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/5537205-robert", "userReview": "James Bond is as much of a weapon as his Beretta 418, although he’s more of an agent by chance than by choice, a weapon as sleek as his 1933 Bentley convertible. He has his vices: gambling, martinis, cigarettes, and sex. Ian Fleming may not have painted women in the most favorable light, may have used a different writing style for a thriller than I’m accustomed to—the agency brief, plenty of inner dialogue and thoughts, and only a dusting of intense action sequences—but this was an enjoyable read for me from the first page to the last.Having watched and enjoyed all the Pierce Brosnan and Daniel Craig James Bond films, along with a few other films from previous James Bond actors, I wanted to look at the man behind the mask, and I must say I’m rather glad I did. This was a quick read, although I wouldn’t necessarily call it light, and while I won’t rush to read the rest of the Ian Fleming novels, I do want to see how both his main character and writing style develop.Cross-posted at Robert's Reads"}], "description": "‘Surround yourself with human beings, my dear James. They are easier to fight for than principles’In Casino Royale, the first of Fleming’s 007 adventures, a game of cards is James Bond's only chance to bring down the desperate SMERSH agent Le Chiffre. But Bond soon discovers that there is far more at stake than money.", "title": "Casino Royale\n      \n          (James Bond (Original Series) #1)", "url": "http://www.goodreads.com/book/show/15924401-casino-royale", "average": 3.74, "cover": "https://images.gr-assets.com/books/1347381389l/15924401.jpg", "reviews": 3380, "authors": [{"url": "https://www.goodreads.com/author/show/2565.Ian_Fleming", "name": "Ian Fleming"}], "type": ["Fiction", "Thriller", "Mystery", "Classics", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/15924401-casino-royale", "http://www.goodreads.com/book/show/3758.Casino_Royale", "http://www.goodreads.com/book/show/1798760.Casino_Royale", "http://www.goodreads.com/book/show/53944.Casino_Royale", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/25330646-casino-royale", "http://www.goodreads.com/book/show/15837770-casino-royale", "http://www.goodreads.com/book/show/28098322-casino-royale", "http://www.goodreads.com/book/show/851240.Casino_Royale", "http://www.goodreads.com/book/show/10491023-casino-royale", "http://www.goodreads.com/book/show/5821.Casino_Royale", "http://www.goodreads.com/book/show/15995489-casino-royal", "http://www.goodreads.com/book/show/7860808-casino-royale", "http://www.goodreads.com/book/show/15954464-casino-royale", "http://www.goodreads.com/book/show/3764.From_Russia_With_Love", "http://www.goodreads.com/book/show/3763.Live_and_Let_Die", "http://www.goodreads.com/book/show/3759.Goldfinger", "http://www.goodreads.com/book/show/3762.On_Her_Majesty_s_Secret_Service", "http://www.goodreads.com/book/show/3750.Moonraker", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}