{"ratings": 88, "userreviews": [{"userName": "Christen", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/5934526-christen", "userReview": "The illustrations are beautiful, but the story seemed bizarre."}, {"userName": "Lea Suesz", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/61779311-lea-suesz", "userReview": "This informational book was a great inspirational story about a real person. I would use it in the classroom to remind my students that they should not give up on their dreams. I would use it to teach a lesson about how boys and girls are both capable of anything. Girls can be tough and strong and boys can be creative."}, {"userName": "Diana Thomsen", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/6981490-diana-thomsen", "userReview": "Oh, it's pretty, I'll grant that, but this book is SO WEIRD!!! Thinking of it like a modern fairy tale helps, but it's still strange."}, {"userName": "David", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/3724927-david", "userReview": "Catching The Moon by Myla Goldberg, David Gassaway, illustrated by Chris Sheban, is the story of an old woman who uses an unusual, unorthodox approach to try to save her community from rising tides.Sheban's beautiful illustrations were created using watercolor and prismacolor pencils. My favorite illustrations are traveling hat, crashing wave, luminous footprints, china teacups, guffaws, thank you, and coral honey. I loved the hard-working mouse!Goldberg's and Gassaway's text uses wonderfully descriptive words, such as steaming, gleamed, luminous, shrieked, guffawed, quivered, greedygut, and clang-a-clanging. Fishing terms used include bait, crustacean, nightcrawler, sea-addled, angling, hooks and dock. This unique, quirky, clever story with rich language and an environmental theme for older picturebook fans should please many, as it did me. Reading it aloud to savor the language is recommended. 4 star rating. For ages 5 to 7.5, fishing, moon, fantasy, tides, and fans of Myla Goldberg, David Gassaway, and Chris Sheban."}, {"userName": "Harrison Yates", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/27750528-harrison-yates", "userReview": "Catching the Moon is an interesting story about an old lady who goes fishing every night trying to reel in the moon so she could fix the problem that her community was having with a high tide that comes in at night. The moon and the old lady become friends on the night where the moon is not in the sky each month. During these nights they have tea and talk about different things, such as the problem her community is having. The moon helps the old lady and her community with their issue. This book would be a great read aloud book for a kindergarten through second grade classroom. I would read this class with a lesson about tides and the ocean or about helping others when they are in trouble."}, {"userName": "Linda ", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/5574951-linda", "userReview": "You’ll need to read and look closely at this story because it has some surprises that aren’t revealed, exactly. One needs to guess, and decide what part is real and what part is magic. There is an old lady who lives by the sea who fishes each night with a mouse on the line, and we find toward the end that she is fishing for the moon. You see, the high tide is wrecking her home, and the neighbors’ homes, too, so the idea is to catch the moon to stop the tide. It’s an unusual book with beautiful illustrations that tell a whimsical story that turns out all right for all concerned."}, {"userName": "Maya", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/287905-maya", "userReview": "this is a charming story about an old woman and her relationship with the moon. And how she tries to help her little village by reigning him in. Really creative and I actually love it, but it's a little conceptual for Miles, who struggled to wrap his head around the fact that the moon affects the tides. At the same time, the illustrations are beautiful and the quirky moments (the moon sitting down for tea) keep him engaged."}, {"userName": "Dani Paiz", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/22142484-dani-paiz", "userReview": "A fisher woman only goes out a night and it's discovered she does this to catch the moon to keep high tide away. When the moon finds this out he gives the woman moon beam paint for her house and this keeps the tide away. The book is good for vocabulary and narrative skill. I'd recommend it for ages 1-5."}, {"userName": "Guin", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/4811817-guin", "userReview": "We read this tonight and while JK was really the only one who sat and listened to it, he really enjoyed the story and talking about it as we read it. It has great illustrations and after reading, we went back and picked out our favorite pages of the illustrations. I love the personification of the moon and his personality was very distinct from the illustrations."}, {"userName": "Malissa", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/2753115-malissa", "userReview": "Read this tonight when it came in bookdrop. The art really grabbed my attention (love it!), and I liked how the illustrations and text really worked together to tell the story. Neither alone would really make sense. Might have to put this one on my to own list!"}, {"userName": "Elizabeth", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/343908-elizabeth", "userReview": "This lovely picture book is really understood by more of a third to fifth grade range and above. Just why exactly is the woman fishing at night and with a mouse as bait? You will have to read the story to find out the wonderful conclusion. Whimsical, alluring, fantastical, and smart. Loved it!"}, {"userName": "Cheryl", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/1976749-cheryl", "userReview": "Softly colored watercolors add a quiet feel to the lovely story of an old fisherwoman who is angling for the moon. Very well written and imaginative, the calming nature of the tale makes this a great bedtime story."}, {"userName": "Kimberly", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/6171117-kimberly", "userReview": "This is a really good read. The illustrations are beautiful and the story is a bit magical."}, {"userName": "Tammy", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/622422-tammy", "userReview": "Cute story!!"}, {"userName": "Karen", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/12001280-karen", "userReview": "This book contained very lovely illustrations, but a very strange story."}, {"userName": "Anna", "userReviewDate": "Jan 19, 2008", "userURL": "http://www.goodreads.com/user/show/136584-anna", "userReview": "Cute story. It nicely affords the opportunity to explain the way the moon affects the tide but I would only use with older children."}, {"userName": "kari", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/420473-kari", "userReview": "children's literature: raime and i checked it out - a tender concept of being able to lure the moon - and wonderful illustrations...another myla goldberg fave."}, {"userName": "Heather", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/909830-heather", "userReview": "October 2016"}, {"userName": "Morgan", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/19135010-morgan", "userReview": "This is a good story that describes how a woman is being different and trying to overcome obstacles about the waves that keep ruining their homes."}, {"userName": "Kristin", "userReviewDate": "Jun 17, 2008", "userURL": "http://www.goodreads.com/user/show/977528-kristin", "userReview": "GREAT illustrations. Very muted, and soft, with amazing depictions of moonlight pouring into the house."}, {"userName": "Lynda Pires", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/15866108-lynda-pires", "userReview": "Beautiful illustrations and fine idea, but the story makes little sense to a little one (or adult reader)."}, {"userName": "Katie", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/22203893-katie", "userReview": "Lovely atmospheric story about tides and the moon.Too long to be a story time read aloud - perhaps for Y2-3 & older?"}], "description": "From the bestselling author of THE BEE SEASON, a memorable first book for children.When the old woman began to fish at night under the watching moon, the fishermen shook their heads - she'd never catch anything that way. But the old fisherwoman was wilier than they knew. The waves had risen to take bites out of all the fishing shacks, and what she was hoping to catch was the person who controlled the tides - the man in the moon. A book that explores the unlikely friendship between a salty old woman and the sweetest man in the night sky, CATCHING THE MOON shows the unexpected pleasures to be found when people come together.", "title": "Catching The Moon", "url": "http://www.goodreads.com/book/show/97916.Catching_The_Moon", "average": 3.83, "cover": "https://images.gr-assets.com/books/1328867858l/97916.jpg", "reviews": 22, "authors": [{"url": "https://www.goodreads.com/author/show/3445.Myla_Goldberg", "name": "Myla Goldberg"}, {"url": "https://www.goodreads.com/author/show/3889995.David_Gassaway", "name": "David Gassaway"}, {"url": "https://www.goodreads.com/author/show/443700.Chris_Sheban", "name": "Chris Sheban"}], "type": ["Childrens", "Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/97916.Catching_The_Moon", "http://www.goodreads.com/book/show/251762.Bee_Season", "http://www.goodreads.com/book/show/8008197-the-false-friend", "http://www.goodreads.com/book/show/19056.Wickett_s_Remedy", "http://www.goodreads.com/book/show/97915.Time_s_Magpie", "http://www.goodreads.com/book/show/5042.Bee_Season_Reading_Group_Guide"]}