{"ratings": 4721, "userreviews": [{"userName": "Emily May", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Reviewing Charm & Strange requires some seriously careful tiptoeing around the spoiler landmines - they are everywhere. Reading Charm & Strange requires a lot of patience and a reader who can be satisfied sitting through many pages of not having a clue what's going on just to make it to the excellent conclusion. The ending makes this book, it gives the story it's strength, and I foresee many DNFs on the horizon from readers who become restless waiting to find out what this weird little novel is working towards. But I really enjoyed it. It's not often I finish a young adult book and feel like I've read something completely different from anything I've read before.The story is split into two: a tale from the past and a tale of the present. Both stories are about the same guy - Andrew Winston Winters (Drew/Win) - but they paint two very different before and after pictures. An angry young boy (Drew) spending a summer with his family, and a lonely teenager (Win) at a New England boarding school who is hiding dark secrets about the truth of his childhood and perhaps even the person he is. Win is a weird, complicated and intriguing character from the very first page when he announces “I don’t feel the presence of God here” and he continued to simultaneously tug at my heart strings and drive me insane throughout. For me, the mysterious tone of the entire novel dragged me helplessly towards the end in my need to discover the underlying truths about Win and what happens at the full moon.What this story is, above all else, is a psychological mystery - and a compelling one, at that. You know something is seriously wrong with Win, but what? Is he simply insane? Or is something more sinister and possibly supernatural going on? What happened between him and his family to drive a wedge between them and make him the shell he is now? This book is full of questions and secrets, every corner you turn seems to lead you down an even more complex path with even bigger and darker questions begging to be answered. You'll either be forced to give up out of frustration, or the need to know will be too strong and you will carry on further and further on this strange journey (like me).I think this was an incredibly brave and exciting debut that constantly moves in unexpected directions. It will surely disappoint a fair few readers because it does not deliver the story that will be in many people's expectations. And I loved that. I've always found that I'm pretty good at guessing the twists when I know that they're coming but I think even if you're edging towards discovering some of the \"whats\" in this story, the \"whys\" will be sufficiently surprising enough to make it worth it.The phrase \"one to watch\" is thrown around all the time with new authors but I think the sheer imagination and creativity of this tale, not to mention the beautiful writing, makes Kuehn one truly worthy of those three little words. I look forward to seeing where she goes from here."}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "[the throat-glasses scene was pretty scary right? (hide spoiler)]"}, {"userName": "Debra", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "4.5 starsHoly Crap! What a brilliant debut novel!!! Did I see the ending coming???? Not until the end - and only when the Author wanted me to see the truth. Sheer Brilliancy (is that even a real word?)So how do I describe this book without spoilers....hmmmm....well first off..I would like to see everyone who has added this book to their \"to read\" list and actually start reading it as in TODAY...NOW!...do not pass go, do not wait until the full moon, stop what you are doing and read this brilliantly strange book already!I love a book that I can't figure out. The entire book I was trying to decide if Win/Andrew is mentally ill or if there was some supernatural elements at play. Do I suspend disbelief and accept that he will change or is there something else entirely else going on here? I was never really sure until the end when BLAM there it is...This was a really unique YA book. Sad, Heartbreaking, a psychological thriller and yet not a thriller at the same time. I dunno what to call it. The book is strange - strangely compelling. Don't try to figure anything out. Just go with the flow. DO NOT READ THE END OF THE BOOK FIRST SO YOU KNOW WHAT HAPPENED. DON'T READ SPOILERS. YOU WILL RUIN IT FOR YOURSELF. You have been forewarned this is not a happy go lucky YA book. Teens do not fall in love with vampires and live happily ever after. This book has dark elements. There is great sadness in this book. There are family secrets. There is also great writing, a great story and characters that feel real. One of the brilliant parts of this book is in how it is written. The book is written in two voices but with the same person doing the \"telling\". Andrew when he is younger and Win in current day as a teenager. As I mentioned several times, I liked that I did not figure this book out. It's not a big book. There are not too many pages so stay with it. Don't give up. As other reviewers have said the ending does make the book. So what are you waiting for? Pick up this book and start reading!See more of my reviews at www.openbookpost.com"}, {"userName": "Giselle", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "This book takes mind-fuck to a whole new level--and excuse my french, but there is really no calling this one any different. Charm and Strange is... well it is very definitely strange. This is probably one of the most baffling books I've read. I was unable to stop thinking and questioning and wondering about every single thing that was going on in this book. It felt like it was going to go one route, only to leave me completely bewildered by the direction it did take. While you will likely want to discuss this book the second you turn the last page, once the ending comes, so does clarity. The confusion is not an irritation while reading either, on the contrary, it's a fascinating and spellbinding confusion that keeps you absolutely unable to think about anything else until you have finally come to understand. There is a pro and a con side to this novel. The big secret of the plot--what dumbfounded and what made this book truly brilliant in my eyes--will unlikely not stay a secret very long. It's one of those spoilers that simply can't be avoided. I can't even tell you why, but by simply glancing at how this book is described in many reviews in the most general of terms could completely change how you'll take the story. However this is not necessarily a bad thing. What you expect from this novel, and what you get from it in the end, will decide what you take from it. If you're expecting a certain type or paranormal tale, or a certain style of storytelling, then you may or may not hate what it actually is. I am probably making absolutely no sense to you right now, eh? If you take only one thing from this review, it's that you should read this book with ZERO expectations of anything--which is how I experienced it. Do not read the book synopsis, do not check out its Goodreads page, don't even check what freaking genre it is, just read it. You will thank me! And PS- this review is 100% spoiler free of any kind! ;) With that said, it's obvious that this review can't go into very much plot details, so lets talk characters and writing. Both are exquisite. Our protagonist is one of the most complex character studies I have seen in YA literature. He's created with such fine threads that you're truly afraid his instability will crack at any second. We're taken into his past with alternating past/present chapters where we learn of his upbringing, how he became the broken individual we were introduced to. On one hand, this makes you understand his state of mind, turning any dislike for his bizarre, unlikeable personality into sympathy, but on the other hand it can be a little hard to keep track of two different stories. Yes the two stories are interconnected, and they ultimately merge into one, they still remain fairly separate until then; each having independent characters and settings. I think it was extremely important to disclose the story in this manner so I wouldn't want it to be any different, just that it did take me a bit to situate myself every time I picked up the book--as if I needed to feel more confused!As for the writing, it's unblemished with a prose that is sophisticated yet simple. It doesn't rush nor does it bore. Its prominent feature is its ambiguity. From the very first page everything is cryptically described, from the past, to the family members, to the relationships, to the wolves, and finally to the present. Nothing is freely given, yet everything is left for us to take, to decipher. While some might think this would be hard to get into it's the exact opposite. We're so starved for meaning that it becomes the oil that greases the wheels of this penetrating story. An exceptionally perplexing novel, Charm and Strange is the type of read where you do not want to move after you're done. You need time to sit and process what exactly you just got through reading. If you want a book that stands out from the rest, this one has its own playing field!--An advance copy was provided by the publisher for review.For more of my reviews, visit my blog at Xpresso Reads"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "I know two stars may be a bit cruel especially coming from me but I just couldn’t afford to rate this any higher. I didn’t hate it but I honestly didn’t like it either. Others thought this story was a breath of fresh air and was completely mindboggling. For me, it was suffocating and predictable.:/Please allow me to explain. I’m with everyone who says this YA psychological-mystery is unique. This is true because I’ve never read anything quite like this before although I’m hoping never to read anything like this ever again. :/ The story began with intrigue and the writing was undoubtedly compelling especially so because the story is told by an unreliable narrator, a 16 year old boy who has deep dark secrets and whose narrative shifts from his present life and that of his life as a ten year old boy. Regardless of his perspective, it is obvious that his mind is a complete mess.Considering that the main conflict is something within the character, there really isn’t a plot in the story- just an exhaustive look at the MC’s messed up mental state. Because of his intriguing state of mind, as a reader, I was automatically trapped inside the story as I patiently tread on the pages of the book to get to the big reveal. Unfortunately, the journey for me was tedious and the paths were misleading and disturbing like trekking on a dark, unfamiliar forest veiled with too much mystery and strenuous (sometimes unnecessary) backtracks.I appreciate the author’s purpose in weaving a dark mysterious story as this. Tackling sensitive social issues like sexual abuse, incest and dysfunctional families was a really bold and risky move and I commend the author for this. I just personally think heavy issues as these are better addressed head on instead of resorting to the supernatural (werewolves, no less!) and too much mystery because the more probable result to the reader is either misinterpretation or confusion. When the unveiling of the big mystery finally took place, it wasn’t really anything shocking. If anything, it was just saddening and it was only at that point that I started empathizing with the character which didn’t last very long because the story suddenly ended leaving very little hope to both the MC and the reader. :(One thing spot on about this book though is the title because either you get charmed by the story or you get completely estranged. Unfortunately for me, it was the latter.:( But if you’re looking for a charmingly positive review, do check out Sarah’s. It’s her review that convinced me to read the book in the first place."}, {"userName": "Delee", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/6168268-delee", "userReview": "[image error]"}, {"userName": "Kristalia ", "userReviewDate": "Jun 21, 2013", "userURL": "http://www.goodreads.com/user/show/5705623-kristalia", "userReview": "Buddy read with Nab & Vilda ♥ \n Final rating: 4.5/5 stars\n\n\"The story that was too big for me to tell, the one that grew to fill the depths of my being and the far corners of my mind. It’s how I lost my system of meaning… but I haven’t lost everything.\"\n\nThis is a difficult book to review. So, let me start with the \nrating\n. Why 4.5 stars? 4 stars is because it was \nconfusing \nat times and \nfrustrating \nbecause you have absolutely no idea what is going on, and extra half star is for \nuniqueness\n. And most of all - because in the end i cried. I cried for unfairness, cruelty and shocking truth. I cried because it was heartbreaking and because i finally understood the story.This book is different. It's \nunexpected \nand \nunpredictable\n. It will confuse the hell out of you but it will be worth it, if you can finish it - and not give up. This is not a long book, but i kept reading it because i had to know why all the \nmystery \nand why it was written how it was. I got my answer and\n i was not disappointed. \nBecause this book... it's FANTASTIC. And it's also \ndark AND twisted\n. If you love dark and twisted, you are going to love this one too. Even if you are not fan of paranormal, but you love dark and drama, you will love it.This book has another catch as well : It is split in two parts: the past (antimatter) and present (matter) and each one of them catches your attention, and you can't help but want to follow the both stories without stopping. And yet, it's constantly switching, and it was really well done. The less you know about this book, the better. Because, not knowing is why it was so shocking. And mostly because it is how it is. This book is completely \npsychological\n... and in a way, \nparanormal\n too. After all, it's a story about wolves.But, it's not a typical young adult werewolf story with the female protagonist having a good life.This book is about a troubled teenager, Win/ Drew (Andrew Winston Winters) who is bitter, angry and so completely weird. His mind is confused, he is confused, and he doesn't know anymore who he is or what he is. He is completely alone and abandoned. No one understands him, nor no one really wants to understand him and yet... as a reader, you can't understand him either.\n\n \"There are wants and needs in this world, I think. There are hopes and guarantees. There are the things that are true and the things we need to believe in. And I’ve seen enough in my life to know I don’t believe in much.\"\n\nAnd that is the magic of it - after a while, you start TO understand everything. And it will shock you (depending on how fast you understand the story, it may not shock you, but it was... breathtaking). \n \nWhich makes Win one of the most complex characters that i have ever read about. \nThere are so many other people in this book i really want to talk about, like Keith, Siobhan, Lex and Jordan, but saying anything would be spoilerish, and just a tiny bit of their stories would destroy the experience.____________________________________________\n\nOVERALL\n\n: ____________________________________________For a debut novel, this author sure knows how to deliver a unique and amazing story, but also heart wrenching and sad. This book is completely different and if you can make it till the end, it will be worth it. I loved it, because of it's complexity, weirdness and mystery and most of all, because of execution of it. \n This book is indeed Charm & Strange.\nThis review can be found on my blog: infinity-of-time.blogspot.com also known as..."}, {"userName": "Arianna✦❋SteamyReadsBlog❋✦", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/23370948-arianna-steamyreadsblog", "userReview": "4 Stars!!“Charm and Strange” was an intriguing mystery/realistic fiction that will leave you disturbed, but wanting more. It was a strange, confusing, frustrating read that totally kept my attention from start to finish. This was my second novel by this author and like the first one it was fantastically written, interesting even unique I could say. Mrs. Kuehn is a great storyteller and for sure know how to keep her readers interested. Her writing is simple, yet poignant and addictive and I have to say I enjoyed it very much. \n\n“There are wants and needs in this world, I think. There are hopes and guarantees. There are the things that are true and the things we need to believe in. And I've seen enough in my life to know I don't believe in much.”\n\nThe main character of this novel is Andrew Winston Winters and the story is told entirely from his POV. His POV was confusing, yet fascinating and I could say he’s an unreliable character, because from the beginning you will have questions, you will be confused, you will have no idea what’s going on. Andrew (Win/Drew) is a 16 years old student at a boarding school in Vermont. He doesn’t eat and he suffers from horrible motion sickness. He doesn’t have friends and he doesn’t know who and what he is anymore. He feels alone and lost. He knows he’s damaged as much as he knows he’s different. But different how? Like I mentioned above you don’t know what’s going on with Andrew or what happened with him to become so...weird. The story alternates between past and present – one chapter in the present, one chapter in the past – and the transition between them is really well done. Every chapter both in the present and in the past adds more mystery to the story and with every one of them you become more engrossed in this dark and raw tale. ‘In the past’ we meet Andrew as Drew, a 10 years old boy who is bitter and angry and who’s about to spend the summer with some family members. Andrew ‘from the present’ known as Win is lonely, confused and he clearly has a secret. As the story unfolds we get to know the truth about Andrew, about his family and his past.Andrew was a great, complicated, fantastic developed character. He’s a character who felt real and his voice was sad and honest. You can feel how tortured and conflicted he is and ‘see’ how lonely he became after ‘that incident’ that changed his entire life. I have to say I really felt for him. I was sad and angry seeing how unfair his world can be. This was a great debut novel and I really recommend it if you want something different from your usual romance novels like I did. My advice is to read this novel without reading too many spoiler-ish reviews, because you will want to experience this novel for yourself. Ahh...and keep in mind that nothing it is what it seems.\n\n“Something famished and sick tore at my skin, tore at me. I cried out. I felt pain. And fear. But I held tight to the fierce promise of the moon. I am not broken. I am savage. I endured.”"}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Apr 15, 2015", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "*4.5 Stars*\nWow. This is going to be a hard one to talk about. I mean, how do you explain a book that's shrouded in mystery? We don't know what's real, what's imagined, what happened...we are completely in the dark until all the pieces slowly start to fit together. Indeed this is a journey that I don't see everyone loving, but, for me, it was absolute perfection.There are wants and needs in this world, I think. There are hopes and guarantees. There are the things that are true and the things we need to believe in. And I've seen enough in my life to know I don't believe in much.Win's story is utterly devastating. Whether it's his past or his present-it doesn't matter-his life is a sad one. We get glimpses of his past as a ten year old child, always craving positive affirmation from those surrounding him. We can already see he is somewhat tainted in the way he sees the world, which, again, is tragic, and we know something isn't right. And I'm not just talking about the creatures.....What is there to say when what's inside of me is unspeakable?More and more we begin to see his flinching responses and urges to glare and defend, but we aren't sure why. And no, this isn't spoilery or giving too much up-we see in the first two chapters that something, whether it's easy to figure out or not (thanks a lot Goodreads users, for real), I had quite an easy time seeing what was coming. That's not to say I knew everything, but I guessed the main issue at hand, as I'm sure many of you will, too. But, and I couldn't say this any more perfectly than my wonderful blog buddy, Anna, did-It doesn't matter if you've seen spoilers galore, Win's journey stands on it's own. From the moment you pick up this story, you know it's going to be special-You just can't figure out why.I don't want to die and I don't think I can live.Win was a character that I will likely not forget for a long time. I can't explain the essence of Win without possibly spoiling the plot, but I can say that, without a doubt, I fell in love with him. His voice was one of a kind. His struggles, his loneliness, his self-deprecation....It was painful. And the whole time I felt his pain along with him. His stomach issues, his longing to belong as a child slowly slipping away as he becomes a teenager no longer wishing to fit in, but to push everyone away. I mean, it's just so difficult to read...yet you just can't stop.How can the same God that created all this beauty have created me?Like many books lately I am a tad disappointed in my lack of time to read. Reading in twenty minute intervals with my eyes barely staying open hardly bodes well for a shorter story and, like usual, it effected the flow of the story. This has been happening more frequently than I can handle and it's starting to really aggravate me. I get that life happens, but come on....this was just a short little book and good lord it annoyed me how little I could get done at once. All I can say is that, while the beginning 50% was disjointed for me (as it's supposed to be as to keep the reader on their toes, but I was even more disjointed with lack of time (See the bigger dilemma here?)), I got to finish the last 50% in one bug chunk and it made all the difference.From what I can tell, morality is a word. Nothing more. There're the things people do when others are watching and the things we do when they aren't.So, you know, I stand by what I've said. This story is wonderful and weird and it lets you go places rarely seen in such a light, but it is certainly not for everyone-not by a long shot. I think that, while this author is clever and unique, she isn't ever going to be a favorite of mine. I loved this story-I did-but something about her writing makes me side-eye her frequently. And I really do think I'd have rated this 5 if I'd have had the time to enjoy it. But after the monstrosity that is Delicate Monsters and now this one, I think it's safe to say she isn't easy to relate to (book wise). Anywho, that being said and slung to the side, I'd love for everyone to give this one a try. Win's story is unforgettable-you just have to open your mind.For more of my reviews, please visit:\n \n\n\n \n\n*********************Awwww look how cute the cover issssss....Said no one ever.Anna you know me so welllll >.<"}, {"userName": "Blythe", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/5206717-blythe", "userReview": "Words can't even begin to describe how incredibly impressed I am with this fantastically beautiful and incredibly powerful little novel. I feel like I get this across in each and every review for books I give five stars, but I am not a reviewer who gives five stars easily. In fact, Charm & Strange is the first book I've given five stars this entire year, and trust me when I say it deserves those five stars, and then some. Not only is this novel endlessly brilliant, but it's masterfully written with alternating chapters of past and present, with each timeframe melding seamlessly into the other by the end of the novel. Writing alternating chapters between two characters, let alone two entirely different timeframes, is something I've found not too many authors are fully capable of doing, but with Charm & Strange, Stephanie Kuehn's talent absolutely shines. As well as that, the main character, Win is one of the most complex characters I've ever read about in young adult--and even though he is a cold and standoffish character, what made the cold and standoffish nature of his character even more impressive was that we saw from the chapters told in the past how he became the person he is today, and the revelation by the end, while not entirely shocking, is completely and utterly breathtaking in how it's handled. This review is much shorter than most of my reviews, but I've said all that needs to be said about this novel, and anything left unsaid by me is left unsaid because I want future readers to go into Charm & Strange completely blind, so that they may find themselves amazed and shocked by each turn this novel took just like I found myself. Charm & Strange, while a bit slow moving, is an incredibly poignant, unforgettable, and beautifully haunting novel, and is unquestionably one of the most outstanding debuts I've ever had the pleasure to read in my entire life. It deals with multiple tough issues, but each and every one of those issues are met with the deft hand of an absolutely excellent and talented author whose works I will unquestionably be reading--and most likely loving--in the future."}, {"userName": "Sue (Hollywood News Source)", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/6511257-sue-hollywood-news-source", "userReview": "I heard so many rave reviews about Charm & Strange. I knew I had to buy myself a copy and I did. I bought it last May, but I cowardly chickened out all these months.I am very picky at reading books that have a male protagonist, particularly because their point of view were lacking. It come off as egregious. A book of vast void spaces. There are few exception of course, and Charm & Strange is one of that.This story follows the story of a teenage boy Win, who believes he is a werewolf, who can’t shift during full moon. The story is told from alternative POVs, split between present and past narrative.\n“Something famished and sick tore at my skin, tore at me. I cried out.I felt pain. And fear.But I held tight to the fierce promise of the moon.I am not broken.I am savage.I endured.”\nCharm & Strange is precisely what the book promises itself to be. It is charming, accompanied by luscious writing, and it is strange. The story's narration is something, a reader need to fully immerse and grasp before one can truly comprehend what is going on. It’s sad, brutal and unflinchingly honest.Like I said, at start it could be so confusing, but once you get the hang of it. You are hooked. The transition between chapters were handled perfectly. The tone is weirdly bizarre and mysterious as if the next moment, something catastrophic is going to happen.The writing is exquisite. This story is a chunk of metaphor. I simply devoured it. One of the three things that makes me want to finish a book area well written story, authentic characterization and the plot doesn’t have to make sense, but bonus points if it does. Charm & Strange delivered it all well.It’s so hard to get into the story without accidentally spilling the integral part of the plot.All I can say is, this is an exceptional psychological mystery. Kuehn brings new sentiment and refreshing narrative in the table. What makes this story far superior than its peers is-it’s unique. Intense. Raw. And. Honest. Charm & Strange tackled the story with so much humanity and anguish and were supplemented by depressing, sordid details. While I had seen the twists coming, I was still impressed how it was delivered.I cried so many tears at that ending. What an impressive debut from Kuehn. This won’t certainly be my last book by her.Full review also posted at Young Adult Hollywood."}, {"userName": "Reynje", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/5590906-reynje", "userReview": "“Love doesn’t always look nice.”\nFew books manage to make me feel this way: cut open and broken and completely overcome.It’s difficult to talk about Kuehn’s debut in detail without revealing significant plot points; and I do feel this is a book best experienced as it is structured, that is, allowing the story to unwind from Andrew/Win gradually. His narrative is one of violence and blood and glimpses in between shadows, trauma layered deep in shame and visceral pain. His story emerges in fragments between the past and present, reality and dreams, relentlessly gaining clarity until its devastating climax. Kuehn has written a brilliant novel. It is confronting, yet empathetic. Heartbreaking, but affirming. It’s not an easy story to tell - Kuehn delves deep into disturbing places – but it is compelling and evocative. Through the use of rich imagery, the symbolism of chemistry and Win’s distinct cognition, Kuehn has written a novel that spurns straightforward classification. It seems to be one thing, but becomes another – not because Kuehn is being purposefully evasive or coy, but because this is the story that is true to Win. We read it as he experiences it, as it emerges from the recesses of his mind and body: raw, dark, and animal.There are various forms of conflict in the novel, but the central source is from within Win himself, and what he believes to be inevitable. The present day thread of the story deals with Win’s acceptance of his imminent change: that his Ego and Superego will be devoured by his ferocious Id, that what is at his core is monstrous. It’s this internal wrestling of what a person believes themselves to be, and what they want to be, that forms the crux of the novel. For Win, his deep-seated convictions give this battle an element of finality, that his metamorphosis is not only brewing, but inescapable.For all its twisting decent into horror, Charm & Strange is a compassionate novel, and while it doesn’t offer all the answers, it does extend a glimpse of hope. Even more than that, it provides a voice of understanding. And for readers who can connect with Win’s experience, the importance of this can’t be overstated. Much has been made of “darkness” in YA, but (to paraphrase Patrick Ness), “not engaging with darkness in fiction is abandoning teens to face it alone.” Charm & Strange is an important book because it offers support and solace to those who may feel beyond reach.Kuehn’s writing is strong – she has created a complex, challenging novel in beautifully rendered language that is compelling and true to Win’s voice. There is a depth of emotion and pain articulated in the story without it feeling forced or consciously manipulative. The novel tackles serious content respectfully, while being authentic to the experience of its teenage characters, who are flawed and complicated. Although not a lengthy book, Kuehn develops her characters well, choosing to show (rather than tell) the reader who they are through powerful scenes and flashbacks. There is a lot covered here, even outside the central premise of the novel, much of which Kuehn chooses to allude to rather than explicitly state. This is particularly effective in the early stages of the novel, where the reader needs to tease out the meaning from passages that seem to take a nebulous form between contemporary and paranormal. Charm & Strange is an intense novel, darkly psychological and unsettling. It takes the reader on a troubling journey, and arrives in a profoundly moving place. An advance reader copy of Charm & Strange was provided by the publisher via Netgalley."}, {"userName": "Steph Sinclair", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "OMG. THIS BOOK. I held off reviewing Charm & Strange for one reason: I have no idea how to review a book like this. It’s a psychological thriller that leaves you completely confused until the very last pages. There were literally times where I thought, “Okay, this is dumb” or “WTF am I reading?” But wow. I was left in pieces by the end and I think I might have finished the entire book in one day, which is a feat for me with kids running around all day. I couldn’t tear myself away from it. I’d recommend this one for more mature YA readers, as it does cover a sensitive subject.----------There are so many feelings inside me right now, but I can't quite bring myself to mold them into anything else but giant SOBS."}, {"userName": "Lia Bonnibel  (pidgey) ", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/66222749-lia-bonnibel-pidgey", "userReview": "And suddenly, I understood everything.Everything. I knew what the moon had tried to tell me in the woods. I was not broken. I was savage.\nHave you ever received a hit to the stomach so hard that it left you breathless? In case you have, then you'll get what I mean. In case your answer is no, then read this book and you'll know. I'm dead, stripped of my emotions, empty inside. My Chemical Romance Defcon 3. In case you're wondering, yes, it was all this book's fault. This book, and its ending, oh God, especially the ending.Intense, powerful, raw, gut-wrenching, a story that covers hard and difficult subjects in the most intimate of ways, and gets you on the edge of your seat in the process. It's a book you eventually grow to fear, to feel with all yourself. The pain, the feelings, they crawl into your bones and dig into your brain. You read the words and you're able to taste the blood on your tongue. 'Everything is not what it seems' feels like an understatement, now. The whole plot revolves around a secret that is so well disguised in the paranormal element that you'll end up reconsidering the whole book when you're only a few pages away from the ending. I wish I could tell more, but I can't. It wouldn't be fair to this little, painful masterpiece. Hands down one of the best reads of the year. I hated it for its cruelty and loved it, loved it, loved it for the very same reason.You're a demon, Stephanie Kuehn *through clenched teeth* but I love you."}, {"userName": "Kathe L", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/25921490-kathe-l", "userReview": "Oh, God. You guys don't know how frustrating it is to want to read a book but not having the time to do it. And I needed to read this book but studying was always coming first and when I realized I had the time to read it, it was sleep time and I knew if I used that time to read I would be a walking zombie in the morning. So, when I discovered I didn't have classes today I decided to use the time to finally read. \"Then again, maybe she knows. Because blood is blood, and every family has its own force. Its own flavor. Its own charm and strange.\" This book was one of the weirdest, most amazing books I've ever read. I didn't know what was going on. I didn't even know who was who! It's really hard to explain, but this book grows on you. It starts different, slow, building the characters and the atmosphere. And then, bang! Something happens, but you don't have your answer yet. It goes back to other things, and all of sudden, you realize the pieces of the gigantic puzzle that is this book start fitting together and you have all the answers you need. When I realized I had all the answers, I was incredibly sad and the reasons was that this book had grown on me. And I was not ready to say goodbye, although from beginning to end, this book was precisely written to have a beginning and an end. \"The pact between us was never the problem. It was the answer.\" We meet our main character. I can't even tell you his name because everything about this boy was a question: his name, his past, his future, his family. He's a fantastic anti-hero. Kind of a villain, but one you care about, you know? You want to know what is going on through his head even though you are inside his head. There are so many questions, metaphors, problems, and eventually, \"solutions\". We meet Lex and Jordan, both part of his present. Lex a little bit in his past. And we meet Keith and Siobhan, characters that I was fascinated about and also the main cause of my frustration. I wanted to know all the facts, but this author builds everything up until she thinks we're ready to deal with everything that is this book. I thought I was ready too, but was I? I don't think we like to face the truth until it is shoved in our faces, and that's exactly what happened here. Until the author said the exact words, my mind was fooling itself in saying 'this can't be true, this can't be true.' \"I am of the sea. I am of instability. I am of harsh, choppy waves roiling with all the up-ness, down-ness, top-ness, bottom-ness contained within my being. I am of charm and strange. Annihilation. Creation.Annihilation.\" While reading this book, I found myself confused, sad, and astonished all at the same time. We have a thoughtful main character that reminded me of people I know in my life and reminded me of myself, at times. It was almost as if I was seeing how I think at certain situations and it was fascinating, because we can't control our logical thoughts, and neither can the main character. This is not exactly a happy book, but not a really sad, either. The author manages to do a perfect balance, you know? I am a very naive reader. And a naive person, for that matter. While I haven't seen all things in my 18 years of existence, sometimes I read books and the weight of everything I read helps me become a better human being. Or at least, a more thoughtful one. And after reading this, I definitely think I learned a lot. And if this main character hadn't had the personality, charm and that weirdness, this wouldn't have affected this much. But that's the thing: a book is defined by its characters, and because I loved this one, I loved this book. I found pieces of myself in him, and it showed me how the world can present people of only 16 years old with so much. It was a win for me, and although it wasn't perfect, I couldn't give it less stars. I liked this one a lot! \"Me? I don't think there is a reason for anything.Not anymore.\""}, {"userName": "Keertana", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "Frankly speaking, I am at a loss for words when it comes to Charm and Strange. On one hand, I think this book is brilliant. Its narrator is unreliable and by the end, you are just as shocked and confused and he himself is, I suspect, if not more. Furthermore, the ambiguous ending had my mind reeling with its realistic quality and the lack of romance was surprisingly refreshing. I have never seen the issue this book tackles expressed in this way before – or even thought to see it expressed this way, really – which makes Charm and Strange easily the most original and creative debut I've probably ever read. On the other hand, though, I have to admit to being slightly disappointed by the time this book neared the end. For chapters upon chapters, I was hooked, chilled to the bone and achingly afraid that my eyes were about to burst any time into the tears I could just feel in the back of my eyes, pushing against my skull, but they never came. Somehow, the transition between the two parts of this book – “Before” which makes up roughly 85% of the novel and “After” which makes up the ending - was too jarring and that last 15%, though still very good, was not what I expected. I wanted something to simply drive all that feeling home, despite my fear of it because I was so emotionally attached to this, but it didn't. Instead, that last part felt like an objective description of events instead of the intense psychological probing the first part of this book had been. And yet, I am in utter awe of Kuehn's ability. Charm and Strange follows the story of Win, a teenage boy who believes he may be a wolf. As Win’s story unravels, every chapter alternates between the present and a collection of past memories. At first, these memories seem disjointed and out of place, but as the novel continues, the harsh reality of the pages hit you in the gut. It is intense. It is scary. It is life. Kuehn is one of those few authors who is able to transition from past to present seamlessly and this only adds to the depth and beauty of her debut. From the beginning, she sets a dark tone, one that inspires curiosity, but also caution. And yet, despite this latter emotion, Kuehn ensures that her readers are well and truly sucked into her tale. I have never had a family like that of Win, never known anything in my life that is similar to his experiences, and yet it felt like I had. It felt like I had this older brother, this younger sister, these three cousins...it felt so real. And it is this ability of hers, to mold the uncertain past into a palpable reality that renders this novel so brilliant. If, like me, you ache for books to make you truly feel emotion, Kuehn is one of the few authors who succeeds extraordinarily well. Honestly, I am so, so impressed. Charm and Strange may not have been everything I wanted from it, but I went into it with high expectations, not knowing if this was contemporary or paranormal or something in-between, and it delivered. At this point, despite the ambiguity of my review (you will thank me later, I promise you), I can only tell you this: read it."}, {"userName": "Elyse", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "This is a Young Adult book! ..... Impossible to put down, a one-sit-hanging-by-a-thread-reading. ..... Gripping, dark themes....(not predictable...uncertain about what is going on until the end). ..... Very sad..... This story centers around Andrew. It's challenging for him to understand life. His past haunts him, and his future bedazzles him. ..... The storytelling is brilliant. The confusion for Andrew, and the reader, will slowly get revealed. The writing is powerful, character driven, and will emotionally resonate with you long after finishing the story. **This is a novel - ( powerful & so beautifully written), for 'mature' Teens....( and adults)!4.5 rating!"}, {"userName": "Molly", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/9077850-molly", "userReview": "This book seriously messed me up.It was a good book, even if not so good for my mental health. Not that I've never read nothing disturbing ... it's just that usually I see it coming way ahead. Only two or three times a year something messes me at this level.\n“When you’ve been kept caged in the dark, it’s impossible to see the forest for the trees. It’s impossible to see anything, really. Not without bars.”\nI'll be short. I won't write about the plot, it's a pretty short story, and I don't wont to spoil it for those that have yet to read it.The story goes back and forth, chapter after chapter, between the present and the past of the main character .... making us guess, and re-think, and second-guess everything.... page after page.Is it a urban fantasy? Is it realistic fiction. Is the character ripe for a permanent stay in a psychiatric ward or is he sane as they come? Did he kill or didn't he? Neither he is sure, so how can we. Are the people that surround him safe. He has taken every step necessary to alienate everybody, but there are still a couple of friends that stick around. Is he a werewolf or is he just delusional. It left my head spin ...... and when the answer finally came, I was unprepared. Even if I have contemplated that possibility, it was just one I swatted away and completely disregarded by that point .... I WASN'T READY!Maybe it wasn't what had happened as much as the way it was disclosed ... it still makes me jittery thinking about it.You broke my heart, book. That \"healing\" ending wasn't enough, but you were good, you little shit."}, {"userName": "Wendy Darling", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "This book is a wild, abstract beast that demands terrible pity--yet it's written with such unerring discipline that it never becomes unruly or mundane. Recommended for: fans of Black Helicopters, Brooklyn, Burning, Nova Ren Suma, and possibly If You Find Me.Full text of this review may be found The Midnight Garden. An advance copy was provided by the publisher."}, {"userName": "Nafia Zalal", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/55409395-nafia-zalal", "userReview": "Edited Review:\n\n“Because blood is blood, and every family has its own force. Its own flavor. Its own charm and strange.”\nSometimes I do nothing at all. I sit somewhere just to think until my brain gets tired. I think about this book often. I think about Andrew Winston. Is he OK now? Does he feel safe now? After all he went through I don't expect him to be on the top of the world. But I do want him to let go all his insecurities.See, I didn't like Drew at first. Thought he was just another arrogant kid with a disturbingly twisted mind. But now I just want to sit beside him and give him some false hope about finding happiness and some true hopes about his safety.I'll do anything to mend my wrecked heart. If that requires giving someone false hopes, I'll do it too. Believe me, after reading this book you'll do it too.There are many books about Drew's problem. But none of them are as haunting and raw as this one. Stephanie Kuehn brilliantly unfolds the mystery of Drew. She doesn't show the secret all at once. She cuts Drew down over and over until the ugly truth reveals itself. Thinking about it still gives me a bad headache. The truth isn't something really rare or exceptional. We all have Drews all around us. We just hide ourselves from them because it's much more easier than trying to understand them. Oh and also our disgusting society thinks it's their fault. But this is where the charm of this book lies. You'll simply try not to believe what's happening, but the mc will make sure that you feel every pain, every heartbreak and all the insecurities he feels. The characterization made those feelings so real that they will haunt you just like they are still haunting me.Yes, this book will break your heart in every possible way but the complex characters and the mystery will keep you on the edge of your sit. I would've loved to see more of some side characters but at the end of the day this book is not about them, this book is about Drew or Win (same person) and his past.I know this isn't a proper review. It's more of a reading experience than a review. But believe me, this book is worth your time. Just give it a try if you love mystery and suspense. This book won't be everyone's cup of tea.Some people might not even understand what's happening most of the time. That's why I'm recommending this book to only mystery lovers and fans of poetic writing style.The story develops in two parts, matter and antimatter. Matter is Drew's present and antimatter is Drew's past. It might get quiet confusing for some but I enjoyed it nonetheless."}, {"userName": "maymay❀", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "This book was recommended to me by the wonderful, Nafia and I’m so glad I read it. Thanks, girlie. <3 Me rn: Charm & Strange  *le sigh* what a delightfully raw, heartbreaking, and  strange  book I’ve just read. This story is about the constant internal war that Andrew Winston Winters faces on a daily basis. The book is broken up into two sections,   matter   and   antimatter,   which alternate in consecutive chapters.   Matter,   is the narration of his present life, living as Win, the passive, introverted teenager who lives in a boarding school and   antimatter,   is the story of his past as Andrew, the confused, frightened, violent boy. Andrew, to put it bluntly, is a psychologically messed up sixteen-year old boy. As you read the book, you are taken aback by his deep and dark thoughts – thinking,  there’s something seriously wrong with this kid.  From an initial glance, most would find him to be overly-aggressive, arrogant, and disobedient kid, but the truth is, he doesn’t know   how   to live. With all the pain he’s felt, all the times he’s been hurt, and the treacherous things he’s seen, channeling his emotions and pain is no easy task.  “Choosing to live can mean so much more than not dying.” For the first 90% of the book, I was so focused on solving the mystery, gathering and putting the puzzle pieces together that I didn’t fully feel the impact, nor did I understand the reality of Andrew’s childhood. Reading Andrew’s past from the perspective of an unaware, innocent child makes it all the more challenging to decode. This is because he himself is trying to make sense of the traumatizing events that take place and sometimes, the mind refuses to acknowledge the bitter, vicious, truth. Only in the last 10% where everything clicks together and all the theories are proven true, did I really feel the weight of what this young boy suffered. . . . and that’s when the tears start. You really have to read this to the end to understand the full magnitude and rawness of this book and this so very special character.  Because blood is blood, and every family has its own force.Its own flavor.Its own charm and strange.  4 stars!!"}, {"userName": "Mary ~Ravager of Tomes~", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/1452829-mary-ravager-of-tomes", "userReview": "Actual Rating: 4.5 Stars\"I don't feel the presence of God here.\"Charm & Strange is purely enticing. This is one of those stories that immediately sweeps you up into a whirlwind; it has you thinking about it before you sleep, while you make dinner, while you're at work... quietly sitting on the edges of your consciousness until you pick the book back up again. It forces you to consider and reconsider your speculations as it nudges you closer and closer to the truth.Kuehn has got a knack for dropping just enough information to keep you second guessing yourself and the characters. I had the feeling of being consistently off balance throughout the story, like stumbling, recovering, and then immediately stumbling again. I wasn't sure about anything until I was taking a deep breath and slowly closing the book. And this was exactly what made the adventure so enjoyable. It was intricate and concise with just enough self-awareness to conclude before the tension fizzled and became tedious.Not to mention Charm & Strange is full of vividly honest writing. It felt like sorting through a stack of old photographs that all wove together into a magnificently mysterious tale. I will certainly be keeping my eye out for any future publications from this author."}, {"userName": "Ivan", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/31294609-ivan", "userReview": "This is one of those stories that's best if you know as little as possible.We see story in two parallel timelines, past and present.It isn't easy ride, book keep you stumbling and guessing.Is this urban fantasy?Horror? Is everything product of troubled mind? Since narrator is very unreliable it can be confusing and you won't get whole picture and until the end at wich point you will be either frustrated or satisfied but heartbroken in either case."}, {"userName": "Dianne", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/2947323-dianne", "userReview": "Well, that was pretty intense. I went into this young adult book pretty much blind other than scanning the cryptic jacket blurb and seeing some positive reviews from trusted Goodreads friends. About half way through, I started to wonder if I had stumbled onto a teenage werewolf story but no.....this is something altogether different.I don't want to give away any spoilers since this book is all about the slow reveal - but it is sad and dark and beautifully written. If you like YA and/or if you are a fan of Rene Denfield, this may be for you."}, {"userName": "leni ", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/67631636-leni", "userReview": "god dammit, that was intense."}, {"userName": "Kelly", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/732347-kelly", "userReview": "[ It's not paranormal in the least, which is important to point out because the description could be misleading.  (hide spoiler)]"}, {"userName": "Swaye ", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/10675488-swaye", "userReview": "TRIGGER WARNINGPsychological and sexual abuse.\"It's the story that was too big for me to tell, the one that grew to fill the depths of my being and the far corners of my mind. It's how I lost my system of meaning.But I haven't lost everything.Somewhere, somehow, adrift in the sea and far from the stars, I've found faith.In myself. And that makes all the difference.\""}, {"userName": "Nina", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/7664770-nina", "userReview": "I have this giant banner with HOLY FUCK written on it in black block letters running through my head and I can't seem to muster up anything coherent to write.This book is a mindfuck. I think it's the first book I've read, ever, that literally confused the hell out of me. Everytime I thought I had it all figured out or was starting to understand, it just took me by the ankles and flipped me upside down.It's simply so... strange.It's a bit hard to get into in the beginning, because the writing style is uncommon and feels slightly distant (but then, that's Win for you), but at the same time it's exceptionally gripping from the very first chapter.It's dark, emotional and tense. Reading it feels a bit like hallucinating - I wasn't sure of what was really happening at any given moment, and half the time Win wasn't sure either, and still I needed to know. It is done in such a way that disorienting and confusing somehow go hand in hand with addictive and haunting, instead of being irritating or off-putting - and in the end, it all comes together and to light in a way that is horrifying and illuminating. Blinding.It's full of pain, but the pain is not delved into as such. The reader gets to see a transposition of it, a reflection, a distortion that's even more hard-hitting than a clean-cut exploration of the pain itself would be.Past and present are neatly separated and slotted in between each other as far as the narration is concerned, but observing the story as a whole they're intertwined so tightly they're hard to isolate.It's a story centred around a (complex, troubled, sympathetic, difficult) teenage character, but I would definitely not define it as YA - and since I promote freedom in reading at all ages, take me seriously when I say this. If I'd read this a couple years ago, it would have fucked with my brain for days.As it is, I'll probably just keep thinking about it and pondering and feeling gutted and angry and sad... for days.And since apparently I am an intellectual masochist, I think I'll pick this back up sooner rather than later, even though I'm not a rereader and never have been. I want to be able to appreciate all the shades and details I might not have picked up on this time, because I was too busy figuring the plot out. The writing is uncommon, but it has a certain shameless elegance that is no less good than the storyline and it deserves full attention as well.I'm mildly obsessive about proper shelving, so the fact that I'm holding back from ticking all the boxes this story fits into in order not to spoil is to be appreciated and taken into careful consideration, peeps. It means I think it deserves to be read and surprise the hell out of its readers, so go for it. Whether you end up loving it - like me - or not, it's definitely an enthralling and strikingly original experience that's going to hurt like a bitch (I could make a book-related joke here, but I'll refrain from doing so). It is. Let's not sugarcoat it. It's fucking horrible, and insanely intense in an unsettling, darkly dreamy way, all the more nightmarish because of those faint traces of tenderness.It made me really fucking wordy, too.I just want to sit and think and stop thinking about it."}, {"userName": "Maria (Big City Bookworm)", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/2567068-maria-big-city-bookworm", "userReview": "Well, Charm & Strange was definitely very different from anything I’ve ever read before. It almost felt like certain cult classic films in the sense that it felt off putting and made me a little uneasy, as did films like Fight Club and Trainspotting. It was dark, chilling and definitely very strange…and I enjoyed it quite a bit!Charm & Strange was written so well, especially for a novel containing themes that you don’t typically see in many novels period. Charm & Strange deals with topics that are so dark and disturbing that I was actually quite genuinely shocked while reading it. To have Ellen Hopkins, the queen of all things realistically dark and horrid, blurb a novel and call it twisted really means something.Charm & Strange tells the story of Andrew Winston Winters. It jumps between two time periods every other chapter, one being the past and one being the present. The past deals with Andrew and his troubled family, while the present takes place at a boarding school where Andrew, who now goes by the name Win, currently attends. We know there was an event that took place between these two time periods and as the story moves forward all of the details slowly start to unravel.It’s hard to talk about this novel and its complicated story without the risk of exposing those who haven’t read it yet to plot ruining spoilers, making this most likely one of the shortest reviews I have written. Even I wasn’t completely sure of what was going on until I got closer toward the end of the novel, when more concrete answers were provided.There were quite a few different characters throughout the novel which could have become confusing, but because they were separated by the separate time periods, they actually helped to differentiate them from one another. Each of the characters were disturbed in their own way, but nothing compared to Andrew and his family.What you should know going into this novel is that it is definitely dark, twisted and strange, but ultimately tells a complicated and difficult story with extreme skill. I will definitely be picking up more novels from Stephanie Kuehn, especially if they are as unique as Charm & Strange.-Initial post reading thoughts:This book was definitely dark, strange and creepy. It was very cryptic and slowly revealed secrets as the story went on. This story definitely dealt with some dark themes and I think Stephanie Kuehn did a fantastic job in writing it.Stay tuned for a full review coming soon."}, {"userName": "Silk", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/54101444-silk", "userReview": "This short novel is cynical and harrowing. The story is split between present and past, told from the POV of the main character Andrew Winston Winters who is at fever pitch about his past as much as regretful. What happened in his past is the biggest mystery and it is told segment-by-segment thus piecing everything together throughout the story. This a story of intense abuse and the outcome of it. \n\"There are wants and needs in this world, I think. There are hopes and guarantees. There are the things that are true and the things that we need to believe in. And I've seen enough in my life to know I don't believe in much.\"\nThis book is an excellent example of that fine line between delusion and reality, which is after all just a matter of perspective. It's truly hard for me to properly talk about this book without spoilers. It's a frustratingly confusing book that arouses a lot of speculation for its outcome. A tense and remarkably disturbing novel with an overall satisfying ending."}], "description": "When you’ve been kept caged in the dark, it’s impossible to see the forest for the trees. It’s impossible to see anything, really. Not without bars . . . Andrew Winston Winters is at war with himself. He’s part Win, the lonely teenager exiled to a remote Vermont boarding school in the wake of a family tragedy. The guy who shuts all his classmates out, no matter the cost.He’s part Drew, the angry young boy with violent impulses that control him. The boy who spent a fateful, long-ago summer with his brother and teenage cousins, only to endure a secret so monstrous it led three children to do the unthinkable. Over the course of one night, while stuck at a party deep in the New England woods, Andrew battles both the pain of his past and the isolation of his present. Before the sun rises, he’ll either surrender his sanity to the wild darkness inside his mind or make peace with the most elemental of truths—that choosing to live can mean so much more than not dying.", "title": "Charm and Strange", "url": "http://www.goodreads.com/book/show/21065382-charm-and-strange", "average": 3.78, "cover": "https://images.gr-assets.com/books/1436621797l/21065382.jpg", "reviews": 1059, "authors": [{"url": "https://www.goodreads.com/author/show/5762535.Stephanie_Kuehn", "name": "Stephanie Kuehn"}], "type": ["Young Adult", "Contemporary", "Mystery", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/21065382-charm-and-strange", "http://www.goodreads.com/book/show/16045088-charm-strange", "http://www.goodreads.com/book/show/17613591-charm-and-strange", "http://www.goodreads.com/book/show/20643825-charm-and-strange", "http://www.goodreads.com/book/show/17167251-charm-strange", "http://www.goodreads.com/book/show/17406309-charm-strange", "http://www.goodreads.com/book/show/18404326-charm-strange", "http://www.goodreads.com/book/show/18404113-complicit", "http://www.goodreads.com/book/show/23014725-delicate-monsters", "http://www.goodreads.com/book/show/32957193-when-i-am-through-with-you", "http://www.goodreads.com/book/show/27774725-the-smaller-evil", "http://www.goodreads.com/book/show/31556153-feral-youth"]}