{"ratings": 9904, "userreviews": [{"userName": "Ⓐlleskelle - teamSøren♗ ⊲I like big b00ks⊳", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/18387313-lleskelle---teams-ren-i-like-big-b00ks", "userReview": "⭐️⭐️⭐️⭐️4 STARS⭐️⭐️⭐️⭐️This was recommended to my by my good friend, Lana... She must have read all 90s CR out there... lolAnyway, this book was really what I was looking for, short, funny, and real dialogues along the way!"}, {"userName": "April Wood", "userReviewDate": "Dec 08, 2013", "userURL": "http://www.goodreads.com/user/show/16273240-april-wood", "userReview": "That moment when you realize what the title of the book means...Radio producer Allie has been dumped by her boyfriend, and demoted to the 10 pm - 2 am spot on the radio. When temporary DJ Charlie comes in, he awakens in her this go-getter attitude of making him famous, (and boosting her career in the process). What she wasn't expecting, was to fall in love... Too bad Charlie is only around for a short four weeks.Charlie isn't interested in being famous. As a matter of fact he isn't even a real DJ. He has been assigned to spy on one of the other DJ's who is suspected of giving marijuana to cancer patients, (oh the horror!). I liked Charlie up until I realized he was hell bent on arresting a peaceful old hippy who was helping cancer patients... I mean really Jennifer Crusie?? Couldn't you have made the \"crime\" a bit more serious? You managed to turn your \"hero\" into a \"villian\" and you didn't even realize it. You lost me. :(I love Jennifer Crusie's books but she lost me with this one. I gave it three stars because minus the pot bust, it was a nice little story."}, {"userName": "Willow Brook", "userReviewDate": "Apr 26, 2010", "userURL": "http://www.goodreads.com/user/show/2414879-willow-brook", "userReview": "I tried to give this 3 stars, but just couldn't. Crusie is one of my absolute favorites, but if this book hadn't been on my Kindle, I know I never would have finished it. It lacked Crusie's usual well-drawn characters, full of quirks and insecurities. It definitely lacked the fun and funny banter she is known for. The hero and heroine didn't have much chemistry whether they engaging in brand new lust or falling in love. Plus, they seemed to spend most of the story apart due to a silly \"celibate bet.\" Their motivations throughout the book were largely a mystery to me. The plot was slow and vague. By the end, I just wanted the story to be over. I've read a few other early books by this author and found them by and large to be fun and charming. Charlie All Night is more like a first draft in need of serious fleshing out, better dialogue and characters to care about."}, {"userName": "Juliana Philippa", "userReviewDate": "Dec 06, 2009", "userURL": "http://www.goodreads.com/user/show/1378820-juliana-philippa", "userReview": "(3.5 stars) Charlie All Night is not my favorite Jennifer Crusie book and like a few of her other earlier ones feels more like a novella than a full-length novel. Regardless, it is an enjoyable read and very entertaining. The chemistry between Allie and Charlie is great and they have some fantastic dialogue, there are several humorous scenes, and the secondary characters are wonderful - especially Joe, Allie's gay roommate. All in all, the book is definitely worth checking out from the library (which is what I did).In Charlie All Night, like in Anyone But You, Crusie features a heroine who is both older than usually found in the genre (Allie is 36) and than the hero (though only by two years here - not the ten that separates the hero and heroine of Anyone But You).My favorite Crusie books so far are: Bet Me (5 stars - amazing!!), Manhunting (4 stars), and Getting Rid Of Bradley (4 stars). They are all both read- and buy-worthy!"}, {"userName": "Katie", "userReviewDate": "Jul 12, 2015", "userURL": "http://www.goodreads.com/user/show/1710785-katie", "userReview": "[it felt like Joe kind of disappeared in the second half. And I felt like we didn't see enough of Allie and Charlie hanging out during their bet. I saw the connection, sure, but I still don't think they quite proved they were more than just sex. (hide spoiler)]"}, {"userName": "Elisabeth Lane", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/31526695-elisabeth-lane", "userReview": "Finally a Jennifer Crusie book I liked! I hated Bet Me so much that I never tried her again. She's such a beloved author in romance that I always hoped I'd find one that fit and it looks like Charlie All Night was the ticket. I loved the hero and heroine. The secondary characters all had personalities. Even though the plot was a little thin, I didn't mind. I even laughed out loud twice! Which is awesome because I'd never found her funny before. Anyway, Charlie All Night has emboldened me to try more. Welcome to Temptation awaits me at my local library.If I have one quibble (a completely unfair one) it's that there was a secondary character in this book that I loved so much I wanted him to have his own book. Now, that wasn't done in the mid-90s for gay characters in an m/f series, but I loved Joe so very desperately that I want to imagine him happily married to a man who loves flamin' hot Cheetos. He would be so horrified. More HEAs for 90s era gay BFFs!"}, {"userName": "Bree", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/3450701-bree", "userReview": "I've enjoyed a few of the more recent Crusie books and have been checking out her backlist now that it is in eBook form. Unfortunately, I think she was still finding her way in her early books. What I enjoy about her more recent books is the realistic, humorous voice of her characters, primary and secondary. That humor is still in evidence here, but she's also trying to mix in suspense, and I think it results in just too much going on. As a result, character development suffers.Allie is interesting - we meet her as she wakes up to her stupid decisions of the past, and she makes a few rash, uncharacteristic decisions that could go either way. Charlie is also interesting, but we don't get to delve into him as much as necessary to like him as a hero, because the suspense plot and ex-boyfriend take up too much of the story. In this case, the suspense provide the whole reason for the hero to meet the heroine, so it was integral to th eplot, but still a distraction. The other usual formulas of Crusie are present - snarky best friend (this time a gay man, rare in romance), forlorn dog, tight knit circle of small town people. I'm assuming this was written for one of the category suspense lines., but it's just one of those books that I think it could have been so much better with some careful pruning and losing the suspense."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "My first foray into romance wasn't a huge hit but I could sense this wouldn't be quite my thing. I actually read a few books by Crusie in the early 2000's, and they aligned with this one - light plot, lots of breathless throbbing desire, and a somewhat unique setting of a late night radio show. I would say Crusie saves her best writing for the sex scenes and she isn't nearly as descriptive in her writing about the radio station or the Chinese food, although those also make multiple appearances."}, {"userName": "Mireille", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/3006017-mireille", "userReview": "Ahhhh this was so good. Crusie at her best - it might actually be my favorite Crusie. I highlighted a bunch of lines - that first conversation in the bar, and then with Joe, and then with Mark, it's all so, so wonderful. I also liked the overall radio plot, even though obviously Allie and Charlie were the most compelling part. It's hilarious and also very sexy, way more than other Crusies. Really, a ton of fun.And now I'm sad because this was the last book in my \"Jennifer Crusie Book Bundle\" and I feel like I don't have enough Crusies left to read."}, {"userName": "Marina", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/4625279-marina", "userReview": "Well, I obviously didn't like that book. I do enjoy chick-lit, so it's not that I didn't know what I was getting into, but. But. What is this plot? I didn't like the main plot, which is their love-story but I'll get into this later... Because the \"subplots\" were even worst: 1) he, Charlie, is investigating some mystery, but I didn't understand if he was a detective or he was just doing it to make his father happy (which makes no sense because he hates him), and it's the most stupid mystery in the world (I know it's meant to be a light novel, but some real drugs or a murder or something would have spiced things up)... 2) a puppy, true story. There's a hole subplot that only exists to make Charlie more sexy. I-I-I-mean-WHAT? 3) the radio program making, which I couldn't care less.This novel is about telling you things and you believing them. They tell you that Allie is the best producer in town, but I have NO IDEA of what she does. They tell you Mark is a jerk, but he's the flattest character in the universe so that's the only thing I know about him. They also tell you not only that Joe is Allie's best friend (although he only appears when needed by the main love-story plot), but that Joe and Charlie become really really good friends... REALLY? WHEN?? WHY?? HOW??? After knowing each other for two weeks, they keep saying \"that's not your style\", or \"he's not like this\" or \"you know that's not my style\", \"grady's the best guy on earth\". WHAT. YOU DON'T KNOW EACH OTHER.I feel like the author doesn't know how to build up the climax, and for me the best part of romances is THE GETTING THERE. I may be too romantic and asexual for those books, I don't know. But the climax, that is the sex-scene and also de love-confession, always are more exciting when you've been waiting for them the whole book, and when, fighting against all odds, they take place in the end. But in this book they have amazing out-of-body-experience sex in the second page, and you know, and they know, they love each other in the third page, even if they don't say it. I think that even if I hadn't liked the book, the ending could've make up for it... but you have 40 end-worthy scenes prior to it, so no. It's not only in their romance that there's no building up though, it's the whole book. For example, that's an scene:\"Allie wanted to see Mark to talk about X. A wild Mark appears.-We have to talk.They are in the bar. They sit and order.-X -says Allie.End of scene.\"Something I hated a lot too was the bet. Charlie is only going to be in town for 1 month, and after 1 week of crazy unearthly sex, they make a bet ON AIR to see if they can live without sex for a month. I mean. REALLY? He is leaving IN A MONTH and you have fantastic sex, why would you do that?! I hate when in books the couple creates the odds they have to fight against themselves. WHYYY. But well, you think: at least I'm finally gonna get some scenes with UST. But no, because the narrator says \"one week later\". And they kiss. Then the narrator says \"Three weeks later\" and of course the month has passed and they can ~~make love again. Not only is all this premise stupid, but at the end they don't even talk about the bet on the program. The bet was highly popular and all the town was betting against them and the papers talked about it. But once they can have sex, all this doesn't matter anymore. PEOPLE HAD MONEY ON THIS!And I have left the WORST for last. And that is: ALLIE!! Why do we women keep writing women like these? I mean, I understand her emotions and feelings, even when they are silly and irrational, but her actions? the things she says? is she 12?! No, she is 36. She wants to have casual sex so much, and then she gets angry with Charlie because they only have sex and never talk (I though they did talk, I mean, they spent 1 week together and sometimes in public, so they must have talked). And the bet is \"perfect\" because as they don't have sex, they can finally talk (perfect sense). But as we don't actually see how these three weeks happen, we have to believe the narrator again. The narrator says: \"Now they talked all the time, about politics, about music...\". And you say: Okay, because you say so. I'll believe you. I'll also believe you when they say that Joe's jokes are the best, because he doesn't joke in the entire book, so...I don't know why my reviews are so much extensive and coherent (if you can call this coherent) when I don't like the book. I think that when I like it it's like: \"OMGG I LOVE ITTTT!! FEELS!!\", but when I don't, I try to rationalise it. So here you have it. I'm sorry for the rant.TL;DR: Don't read this book unless you like romances about stupid, horny and stupidly horny 36 year olds."}, {"userName": "Jacquie", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/5218458-jacquie", "userReview": "I first read this book in 2011 and enjoyed it as much then as now. Crusie has a talent for sarcastic, loveable heroes it’s impossible not to fall in love with!Charlie Tenniel rolls into small town, USA, to help his dad’s best friend who has received a distressing letter against his radio station. Charlie takes on the late-night DJ spot in order to check out the situation. And his new producer, Allie McGuffey.Allie has just been dumped by her primetime boyfriend and demoted to late-night with the new kid on the block. She’s bitter, hurt, and out for vengeance. Knowing the best way to get back at the ex is to create a star out of the new guy, she sets to work. With stunning success. Charlie is a born entertainer, and his lovemaking skills are even better!It doesn’t take long before she’s falling for him and he seems to feel the same way, but then trouble comes to the WBBB.Can Charlie solve the mystery and keep the girl? You’ll have to read the book to find out!I give Charlie All Night 5+ lovely kisses- This one is a keeper 🙂"}, {"userName": "Hazel", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/9198356-hazel", "userReview": "Cruise must be an animal lover. Of the books I've read from her they all contained dogs. This one isn't an exception. It's a lethal mix: cute animals, humour & a love story. Everything that a good rom com movie has which is what makes her books so addictive. I never used to read romance or chick lit books coz the ones my aunts used to read we're sooooo stupid! But thank god there are now writers like Crusie that can write intelligent & funny chick lit. So yeah I give this book a perfect score. When I was reading it I forget that these people aren't real. The dialogue is written well & the characters have normal every day sounding names. It's a pet peeve of mine that characters in books often have ridiculous outlandish names. I also like Crusie's sense of humour. And being an animal lover myself I love reading about animals as a character too. Another thing I liked was that the heroine of the story isn't some supermodel, high fashion skinny lady. Rather she sounds more like a real woman with curves. Kudos to Crusie for that!"}, {"userName": "Samantha", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/3150990-samantha", "userReview": "It got better when the radio show started, but it still didn't do it for me. I thought it wasn't plausible, which is hilarious, considering it's contemporary romance.I've had better."}, {"userName": "Jamie", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "[the bet for no sex means Allie and Charlie talk less without sex than they do with the sex, and that’s by far the best part, the talk with the sex (hide spoiler)]"}, {"userName": "Jess", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/6513370-jess", "userReview": "This might have been my favorite of this book bundle. Reread."}, {"userName": "Annette  Dahl \"Old Vicarious Reader\"", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/31556126-annette-dahl-old-vicarious-reader", "userReview": "Excellent story. Every once. in a while an avid reader stumples on a story that pulls them into the love of the couple. It catapults them into the characters. That was me, (The Old Vicarious Reader), this time. There was something about this couple that called to me. I was there laughing with them and falling in love. I was there, I was with them, and it felt real.Best line in a scene. . . “You know, it’s a shame you’re gay. You’re probably the perfect guy for her.” Joe grinned at him. “It’s a shame you’re not. You could be the perfect guy for me.”Best line in the book. . . “She would pick a month with thirty-one days.\"An author can't always hit the target for their reader. But, this story sure hit the target for me. Excellent read."}, {"userName": "Jacob Proffitt", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/1331641-jacob-proffitt", "userReview": "Wow. That was a nice upshift in quality. Still a 90s book (not even that late at 1996) but much closer to her 2000s in quality. I really liked both protagonists, not least because they fit so very well together (but maybe that's my crush on Charlie speaking). Crusie's strengths are all manifest here, if not in absolute top form, then at least firmly in their zone.A note about Steamy: In the mid range with three explicit scenes of moderate length (and that third is a doozy). Not a lot of fooling around, though."}, {"userName": "Amanda Westmont", "userReviewDate": "Sep 16, 2009", "userURL": "http://www.goodreads.com/user/show/2359677-amanda-westmont", "userReview": "I like just about anything by Crusie, but this wasn't my favorite. These earlier plots seemed to tip heavily around mis-communication between hero/heroine and I just NEVER buy it. She writes these strong, feisty protagonists who refuse to ask simple questions that any woman would ask on a first date, like, WHAT DO YOU WANT TO DO WHEN YOU GROW UP? Basically, the protagonist of this novel knows NOTHING about the hero and falls in love with him anyway. It's fun and cute and ridiculously difficult to put down, but flimsy when it comes to reality. Her later books are MUCH better."}, {"userName": "Caro", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/5177773-caro", "userReview": "This was a really good read. Interesting, fun, sweet and a good HEA. Good for an anytime read an something on the lighter side. Great (an varied) characters, a rollercoaster ride to read, bantering, friends, conspirators and pretty much intriguing. I enjoyed reading this and laughed a few times throughout. Totally Enjoy"}, {"userName": "Malin", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/3768439-malin", "userReview": "4.5 starsAlice \"Allie\" McGuffey is the best radio producer WBBB in Tuttle, Ohio has ever had and it's pretty much the unspoken truth that she's the reason the radio station runs as well as it does. She loves her job and thrives on it, so when the radio station's current Drivetime star, Mark King, who up until two months ago was her lover, tells her that she's been moved to a different time slot, and from now on, he'll be using Lisa, her former intern as his producer, Allie is not happy. It's not like Bill Bonner, the radio station's owner would be fool enough to fire her (the place would go under), but she's been relegated to the 10pm-2am slot, previously occupied by a conspiracy nut who ended his career at the station two weeks earlier by shooting up the console. Angry and hurt, she walks into the local bar, determined to pick up someone, anyone who can make her forget about Mark.Allie is not going to be broken. She has a plan. First she's going to find someone to sleep with, who will make her forget about Mark King once and for all. Then she's going to make her new DJ so famous that the station owner will beg her forgiveness and give her any choice producing gig she wants. Of course, the man she sits down next to and propositions is none other than Charlie Tenniel, the station's new DJ. Except, unbeknownst to anyone but Bill Bonner and his wife, Charlie has no radio experience whatsoever. He's there as a favour to Mr. Bonner because Charlie's father and Bill are old friends, and there have been some threatening letters sent to WBBB. Charlie is just going to pose as a DJ (borrowing the reputation of Ten Tenniel, his drug-dealing DJ brother) while he investigates the threats. He's unlikely to stay in Tuttle for more than about six weeks, and therefore isn't exactly looking to make an impression.Yet Allie is so charming and determined, and after being invited to dinner with her and her gay roommate Joe, Charlie goes against his better judgement and agrees to stay on their sofa. And when Allie later at night asks him to seduce her, he initially tries to refuse, but when she persists, he doesn't resist for long. She also tells him about her plan to make him a big name in Tuttle, something he adamantly refuses to agree to. Nevertheless, despite his continued attempts to make bad and boring radio broadcasts, he keeps getting more and more listeners, and despite promising himself he's not going to stay on the sofa and not keep ending up in Allie's bed every night, the two continue their trysts. That is, until they inadvertently reveal their fledgling relationship on air, and make a public bet to stay celibate, both determined to prove that their gender is better at going without sex. They will need to spend their days keeping their hands off each other and their nights sleeping apart.Of course, getting to know one another better, without allowing sex into the equation builds up the tension between them to an unbearable degree and makes them aware of how compatible they are on all sorts of other levels too. But Charlie was never meant to stay in Tuttle for too long, what will Allie do when and if he actually leaves?This is yet another romance I got in an e-book sale absolutely ages ago and never got round to reading. Jennifer Crusie tends to write really enjoyable and fast-paced contemporaries, and I have yet to come across one I didn't enjoy. For someone who's struggling with involuntary infertility, it's nice to read books where there is no pregnancy epilogues, and in several of her books, the heroines aren't interested in ever having children. Her heroine are always smart and capable, and frequently not in the first blush of youth. Allie is 36, and actually two years older than Charlie, the hero. She's extremely good at her job, but not to an unbelievable degree and it's clear that she's had to make sacrifices along the way and that her best friend and roommate, Joe, is actually worried about how much of her self-worth and identity is tied up in her job at the radio station. She's clearly never had a particularly satisfying romantic or sexual relationship, and seems more upset about losing her job as Mark King's producer than by the fact that he dumped her two months' earlier. A little bit too career driven, she needs some distractions.We're never given a clear back story for Charlie, except that he's not really one for settling down and seems never to stay in one place for too long. I don't think he's actually a detective, even though he's sent to Tuttle to help investigate a suspected threat, and it seems as if his nomadic lifestyle is quite a frustration to his parents. Strangely, his brother seems to be much more of a black sheep, having been arrested for drug-dealing and quite possibly also left a pregnant wife behind when he fled to whereabouts unknown. Quick to adapt and very charming, Charlie becomes a popular and proficient DJ, even though he tries his very best to remain unnoticed. He feels very protective of Allie and keeps doing his best to make Mark jealous, since the guy never appreciated her when he had her. As is also the case with a lot of Crusie novels, there is a dog as part of the plot, in this case a tiny runt of a puppy, near death, who has to be hand-reared back to health by various radio station employees. While Charlie initially believes the puppy, Samson, to be a goner, he sees how invested Allie is in making it eat and survive and through the determined efforts of most of the various night time DJs and hourly feedings over several weeks, the puppy pulls through and becomes something of a mascot for Charlie and the radio station. Crusie says in her introduction of the book that she wanted to see what a relationship that started with a one night stand and later became less physical might look like and in this book she basically has lovers to friends to lovers once more and manages it excellently. This is a really quick read, with a great main couple and a lot of fun and quirky supporting characters. I'm so glad I finally read it and really should do my best to chase down the rest of the books I have left unread in Crusie's back catalogue. Judging a book by its cover: This book has a pretty cute and fairly simple cover. Two sets of lower legs and feet, belonging to people who are clearly snuggling up together. I'm going to assume that they're on some sort of giant blanket on the floor, because no bed I've ever seen has that much room at the foot of the bed once two grown humans are lying down on it. I'd say that perhaps they were half sitting, but the angle of the legs is all wrong for that. Still, as romance covers go, not bad at all."}, {"userName": "Kristin Marie", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/76661184-kristin-marie", "userReview": "Jennifer Crusie does it again with \"Charlie All Night\" a story of a radio producer and her new DJ and their uniquely budding relationship.Crusie is a fast talker, giving her characters fire and unique personalities. The dialogue is snappy and the novel is full of perfect little laughs. She takes you to the edge of what could possibly be believable scenarios and then adds true heart.If I didn't start so late in the evening this book would have been finished in one sitting. Easy and fun as always.Happy Reading!"}, {"userName": "Hany Grace", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/56580820-hany-grace", "userReview": "So damn funny and adorable and everything that you could expect from reading a Jennifer Crusie book! I have almost laughed out loud in public places while reading this book while out and i ever did laughed out loud, i may not have regretted it! The good vibes that this book was able to emit really came in groups. Loved this book so much."}, {"userName": "Jen ", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/4983837-jen", "userReview": "This was a cute, one-sitting read. I did laugh out loud for a few parts, but I vaguely remember another book by Cruise that I read ages ago being funnier than this one. SPOILERS FOLLOWIt got a bit preachy with the whole \"legalize medicinal marijuana now\" theme and I don't really like spicy scenes, but they were pretty easy to skip and it did make reading the book faster. Not a bad book, but I suspect not her best. I have a copy of her book \"Bet Me\" and I'm looking forward to reading it. It's been sitting on my shelf for a while, but I didn't have a lot of time, so I picked up this one instead. I did enjoy the peek into the radio world and the characters were all interesting when they were \"on page\", but the secondary characters weren't shown much, just talked or thought about and I have to be honest, many of the female secondary characters kind of blended into one for me. I think if the characters were focused on a bit more, it would have made the book more enjoyable for me. I did enjoy Joe and Harry. Grady was cool too, but not enough of them. The ladies I don't even remember their names or descriptions. I guess I was skimming too quickly, but nothing really grabbed me about any of them. Final verdict, not a bad book, but one I probably won't be able to describe in much detail in a few months. Cute and sometimes funny contemporary romance with spicy scenes. 2.5 stars, rounded up because it was well written. If you enjoy contemporary romance with humor and a few scenes to get the blood racing, you will probably like this book."}, {"userName": "~KarenH~", "userReviewDate": "Jan 23, 2011", "userURL": "http://www.goodreads.com/user/show/4738105-karenh", "userReview": "3.5 starsI really enjoyed this book, it was just what I was needing since I've been reading a lot of very intense stuff lately. Light, funny, with just a small touch of a serious storyline (legalization of medical marijuana) to give it some substance, but not so much that it made the whole book too serious. I liked the fact that the main characters are both initially described as just kind of average - in fact at one point the hero is described as having \"the kind of face that the big, good-natured kids in the back of high-school English classes always have, slightly dopey and comfortable.\" But as the story continues both the hero and heroine are seen recognizing previously unnoticed qualities that make the other more and more attractive to them.The one thing that did bother me a bit was the timing - the book takes place over a period of about 5-6 weeks, but the first week takes up about 3/4 of the book. Then everything that goes on in next month or so is squeezed into the last 1/4 of the book, and it really feels like a lot of detail is left out. The first part is great, I wouldn't change the timing there, but I think the story would definitely have benefited from an additional 50 pages or so of detail in the last 2-3 chapters. Other than that it was a very enjoyable read."}, {"userName": "Andree", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/2863963-andree", "userReview": "[The Newsroom totally did the surprise proposal better though. For a start, it was actually surprising. Secondly, The Newsroom's proposal was better written. (hide spoiler)]"}, {"userName": "Julie", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/3855737-julie", "userReview": "I read this book in one sitting because it was so much fun. It's totally adorable. Allie is a radio producer, and she picks up this dude Charlie in a bar by getting him to pose as her boyfriend in front of her ex. Only she doesn't know at first that Charlie is the new DJ whose show she's producing. They have a one-night stand, which turns into a multiple night thing as they work together. Charlie just kind of moves in with Allie and her gay best friend/roommate, Joe (who needs his own book because he's wonderful), and there's lots of tension and banter.Oh, god, this book is everything I love about Jenny Crusie. I was not sold on the subplot involving the \"mysterious\" letter that brought Charlie to town, or the strange things that happen after he pisses off the mayor, but who cares. The rest of the book was thoroughly enjoyable and made me grin like an idiot.I mean, yes, it's predictable, and yes, the characters fall in love within a couple of months, but this is a romance novel. It's light, fun, and an easy read."}, {"userName": "Jeri", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/4038270-jeri", "userReview": "4.5 - Because it was so much fun. This book had me laughing out loud. I find myself wanting to quote favorite bits of dialogue, such as the conversation between the Allie (the heroine), Charlie (the man she has just met and with whom she is considering a fling), Joe (her gay roommate) and Mark (her ex-boyfriend): Mark looked from Charlie to Allie to Joe, evidently reading Allie's mind.\"So who is he sleeping with?\"\"Me.\" Allie held her hand like a polite child, her plan now in place. \"Joe gets him tomorrow.\"\"Very funny,\" Mark said.\"Not so funny for me,\" Joe said. \"I have to wait twenty-four hours.\"\"I don't think that's funny\", Mark said.\"Neither does Joe,\" Charlie said, and Allie laughed, delighted he was part of them.-------------------------------------------------------------------------I mostly avoid category romances, but was pleasantly surprised at home much I enjoyed this one."}, {"userName": "Izia", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/7231682-izia", "userReview": "Such a short and fun read. I really enjoyed reading this book. Reading Charlie All Night was like using heroine. You do it without much thinking, and you really don't benefit from it, but it's fun. The whole tone of the book is just light and very chic lit-ish.You can't deny that Jennifer Crusie is one of the best chic lit author out there. Her characters are fun to read and her stories are just light and perfect for off days.Sometimes, we readers, need a break from dark and deep novels that leave us with a bleeding Medulla right after reading them. And books such as  Charlie All Night  is a breath of fresh air.So what if the main character, Allie, is a bit dimwitted? She's still fun, and that's what really matters. And Charlie... I didn't expect to like him, but I did. The fact that I enjoyed this novel is a proof that I am not that hard to please. So I was wondering why I find many books today nothing but a piece of crap? hmmmm..."}, {"userName": "Kazen", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/12818720-kazen", "userReview": "Though I'm normally a paranormal romance reader Crusie came highly recommended for her characters' witty banter. There was some in Getting Rid of Bradley, but none here.Not only was the conversation dull, but sometimes it made no sense. Charlie says he's going to miss someone's jokes when I can't remember a single punchline being delivered. Allie reminds Charlie not to be controversial, then gets into a long discussion about sex on air with few reservations. It didn't add up.Nor did the hijinx at the radio station. I was taken out of the story multiple times when I asked myself, would that really happen? Are studios really set up that way? Why is the news on a cassette, wouldn't someone be reading that live? And so on.For leaving me frustrated, sometimes confused, and not entertained, one star."}, {"userName": "Rehab", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/2191214-rehab", "userReview": "I absolutely loved it ♡it's the whole package; sweet, funny, romantic but still down to earth, promotes nice ideas and morals and causes .... and it has many good people in it.the story is simple, predictable even, yet very interesting.the charachters are really well written, the plot is nicely weaven.In addition to Charlie and Allie; I loved every oneelse as much.Grady, and his mother, Harry, Karen and even Bill.I felt sorry for Lisa and really wanted to hit Mark.and I especially loved that the pupie Sam was there .. and that he servived against all odds, just like the love story did.I enjoyed every minuit of reading this book; laughed and cried and felt the love.Guess I'm hocked with Jennifer Cruise books for a while to come :)"}], "description": "A hilarious and heartfelt tale by the master of romantic comedy, Jennifer Crusie! Dumped by her boyfriend and demoted from WBBB's prime-time spot, radio producer Allie McGuffey has nowhere to go but up. She plans to make her comeback by turning temporary DJ Charlie Tenniel into a household name. And if he's willing to help cure her breakup blues with a rebound fling, that's an added bonus. Charlie just wants to kick back, play good tunes and eat Chinese food. He's not interested in becoming famous. But he is interested in Allie. And after all, what harm is a little chemistry between friends? But suddenly their one-night stand has become a four-week addiction. Night after night on the airwaves, his voice seduces her…and all the other women in town. He's a hit. It looks as if Charlie's solved all Allie's problems…except one. What is she going to do when he leaves?", "title": "Charlie All Night\n      \n          (Jennifer Crusie Bundle)", "url": "http://www.goodreads.com/book/show/33745.Charlie_All_Night", "average": 3.63, "cover": "https://images.gr-assets.com/books/1168463025l/33745.jpg", "reviews": 473, "authors": [{"url": "https://www.goodreads.com/author/show/19005.Jennifer_Crusie", "name": "Jennifer Crusie"}], "type": ["Romance", "Romance", "Womens Fiction", "Contemporary", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/33745.Charlie_All_Night", "http://www.goodreads.com/book/show/19052992-charlie-all-night", "http://www.goodreads.com/book/show/384458.Charlie_All_Night", "http://www.goodreads.com/book/show/10283931-charlie-all-night", "http://www.goodreads.com/book/show/7117358-charlie-all-night", "http://www.goodreads.com/book/show/8691401-charlie-all-night", "http://www.goodreads.com/book/show/854757.Bet_Me", "http://www.goodreads.com/book/show/33727.Welcome_to_Temptation", "http://www.goodreads.com/book/show/33732.Anyone_But_You", "http://www.goodreads.com/book/show/384457.Agnes_and_the_Hitman", "http://www.goodreads.com/book/show/33729.Faking_It", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}