{"ratings": 116, "userreviews": [{"userName": "Lesa", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/5915219-lesa", "userReview": "The first half really dragged, and I almost abandoned it. But the action really picked up around 60%, and it got better after that. I took me several days to get through the first 60%, but I finished the last 40% in one sitting. I didn't really like the main character. I thought she was kind of annoying, self-centered, and immature at times. I didn't think it was cute how she kept walking around in her skimpy underwear! I thought the family mystery was kind of interesting, but the \"who is stealing things/domestic abuse\" story line was pretty boring. I also didn't care for the whole psychic thing. That was pretty lame."}, {"userName": "Colleen Cross", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/5750647-colleen-cross", "userReview": "I thoroughly enjoyed Cheat the Hangman - so much so that I didn't want it to end. Lyris Pembroke inherits her great uncle Patrick's Hammersleigh house, but not without some baggage. Jacqueline the hell-poodle, a taxidermy menangerie, and a decades old mystery set the stage for an intruiging and fun mystery. Also along for the ride are an octogenerian butler, various Pembroke relations and a troublesome ex-husband. There's no shortage of intrigue as Lyris prepares for the annual Pembroke reunion, and the ending completely surprised me. I can't wait for Glora Ferris's next book!"}, {"userName": "Betty", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/1380729-betty", "userReview": "Kindle version published by Imajin BooksI completely immersed myself in this well-written book enjoying every minute. It was definitely deserving of being short-listed for the Crime Writers of Canada \"Unhanged Arthur\". Gloria Ferris' writing reminded me somewhat of one of my favourite authors, Donna Andrews, especially with the very large quirky extended family interaction and antics. She brings \"skeletons in the closet\" to a whole new level. Take a decades-old cold case of a missing child, a sudden unexpected inheritance of a huge fabulous and museum-like home to divorced grand-niece Lyris Pembroke, who must then quickly plan and host the annual Pembroke family reunion comprised of about 400 extended family members all too soon after moving into her new home. Throw in a good helping of the paranormal and hidden secrets, a headstone with no name, a fire, attacks on Lyris and you have a pretty good perception of what fun this book is going to be. Lyris definitely has her work cut out for her. Fortunately she has also inherited Conklin the butler, and is able to hire Caroline, an excellent cook and housekeeper. For the reunion, Lyris shows admirable organizational ability as she works her way through what must be done prior to the reunion.Not all is fun and games, though. There are also some dangerous intruders lurking about, not all of them necessarily human. Or perhaps otherworldly would be a better way to put it. Toss in a small dog with sharp teeth, soon joined by an oversized black cat, and the house begins to fill with more rooms occupied than the residents realize. Spanning so many decades, it would be strange if there were not romances, both current and decades old. Reignited passions, and reawakened love and trust with those who have suffered at the hands of their exes in the past and discover there is still a chance for happiness, even if it comes almost too late. The book is loaded with many different types of chaos and stress and yet it doesn't confuse the reader, it is just all a part of the whole. I loved the balance of the book, I laughed at the shenanigans, shed a few tears as the cold case is dealt with, worried with our heroine, relived the past with the few remaining WWII veterans even enjoying the singing of Vera Lynn in my mind, went through terror, thrills and chills, and loved the ending. This book certainly ran through a gamut of emotions, old and new. I am really looking forward to the further adventures to come."}, {"userName": "Ann Werner", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/5092906-ann-werner", "userReview": "Lyris Pembrooke inherits Hammersleigh House, a big old Victorian mansion, and immediately sets to making it a bit more palatable by removing some of the animal trophy heads adorning the place. While relocating one of the heads to the tower room, she makes a grisly discovery: the body of a long missing child. So begins her quest to solve a decades old mystery.This is a great whodunit, laced with a healthy dose of humor, a bit of the occult, a little romance and a lot of good writing. From her travails with Conklin, the butler who insists on addressing her as Madame, to dealing with an ex-husband who has a penchant for being unreasonable, to putting together a family reunion for hundreds of people, to her conflicted feelings about hunky police chief Marc Allaire, Lyris manages to deal with every situation, if not with aplomb, then at least with self deprecating wit. There is never a lag in the action, making this hard to put down. If you like your mysteries served up with a bit of cheekiness, then this is the book for you!"}, {"userName": "Linda", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/1846667-linda", "userReview": "Take A Thirty-Eight Year Old Divorced Woman Who Inherites A One Hundred Year Old Mansion With An Elderly Butler That Refuses To Give Her A Key To Her Own Door And Cooks As Badly As She Does, Plus She Discoveres A Dead Baby Who Was Locked Away In The Tower Room Of The Mansion More Than Sixty-Eight Years Ago!Lyris Pembrooke Lives In The Small Town Of Blackshore, Canada Where It Was Hard Not To Run Unto Other Pembrooke's Or Relations Twice Removed. Her Aunt Clem, A Retired School Teacher And Psychic Told Her That She Too Had The Ability If She Would Only Let Her Spirit Guide In, But She Vowed To Stay As For Away From It As Possible! She Had A Reunion To Plan And A Murder To Solve That Happened At The 1943 Reunion.........Gloria Ferris Spins A Griping Story Of Lyris Pembrooke Who Is So Much Like Pandora And Gets Into So Much Trouble When She Is Warned To Let Tommy's Death Go As Too Much Time Has Passed But She Refuses And Finally Hears And Sees Ghosts Then Argues With A Man With A Gun Pointed At HER!"}, {"userName": "Jennifer", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/10305193-jennifer", "userReview": "This book was a good read. It flowed nicely together and had enough humor added in for some chuckles. Lyris Pembrooke is a woman with a big problem. Her great uncle just left her his massive estate to live in and take care of, at least for the next 25 years. She is trying to hide a collection of stuffed and mounted animal head up in the estate's tower room. After stabbing her toe with a moose antler, she falls on her bum only to spot a hidden room in the tower. Of course, curiosity takes ahold and she pries the nails from it to open the thing. What she finds in there is jaw dropping and heart stopping. With a mystery decades old to solve, Lyris goes through a hill of additional queries and dramatic situations, with a little bit of supernatural fluff to boot.This book was captivating with it's plot line, keeping you guessing in some ways up til the very end. It's quirky characters help make this a very good story. I definitely recommend it."}, {"userName": "Tia", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/17282802-tia", "userReview": "Cheat the Hangman by Gloria Ferris was an interesting story about a woman named Lyris who inherits a historic house that comes along with its own mystery. 68 years ago during a family reunion a toddler disappeared without a trace only to be found in a box in a tower room. How did he get there and who killed him. Along with a paranormal essence that comes into play as the story unfolds. This was a great story and introduction to Gloria Ferris' books, she was added to my list of to be read authors for sure. I read this as part of the Deadly Dozen: 12 Mystery/Thrillers by Bestselling Imajin Authors and although the anthology is long each story has unique and enjoyable qualities that make this a great buy!"}, {"userName": "Newbee (JoAnn) Brown", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/5802735-newbee-joann-brown", "userReview": "I loved the charater in this story, shes a cross between currious george, nancey drew and calamity jane! If it could be be stepped in, she did, if your foot could be inserted in to mouth, she did! She was also hilariously funny! I thought I had the mystery solved several times... Only to change my mind again later on in the book. Tho I did guess some of it there where a whole lot of surprises at the end of the book!Well written and very entertaining. This was an easy fun read and I enjoyed it very much and I'm looking forward to more books about this family."}, {"userName": "Michelle Baldwin", "userReviewDate": "Sep 10, 2014", "userURL": "http://www.goodreads.com/user/show/32970814-michelle-baldwin", "userReview": "this book was amazing.... I really really enjoyed this book the story was fantastic but what I loved most was the wittiness it mad ma chuckle in so many places.... I'm praying there is more to.come in this series......"}, {"userName": "Janell Barney", "userReviewDate": "Oct 11, 2012", "userURL": "http://www.goodreads.com/user/show/6322956-janell-barney", "userReview": "I was going to give this a 3 star rating but them realized I thought about the characters when I wasn't reading the book, was anxious to get back to them and would like to read more about them so I bumped it up to a 4 star. Very entertaining read."}, {"userName": "Hsmith", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/1365629-hsmith", "userReview": "I really enjoyed reading it!"}, {"userName": "Leah Polcar", "userReviewDate": "Apr 28, 2014", "userURL": "http://www.goodreads.com/user/show/5963463-leah-polcar", "userReview": "A fun (and somewhat supernatural) myserty. A love story (that they didn't focus too heavily, thanks Jeebus). Fun characters."}, {"userName": "Adina", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/3231080-adina", "userReview": "I received a free copy of this eBook from Imajin Books."}, {"userName": "Maggie", "userReviewDate": "Nov 03, 2012", "userURL": "http://www.goodreads.com/user/show/8860718-maggie", "userReview": "I really enjoyed this it flowed beautifully"}, {"userName": "Melody", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/17823480-melody", "userReview": "slow starting, but very interesting book. more of a family saga than a mystery but I really enjoyed this read."}, {"userName": "akc", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/10735692-akc", "userReview": "Slow starter, but well worth reading. I am looking forward to the sequel to this book."}, {"userName": "Johanna", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/5353836-johanna", "userReview": "Not my usual read but a local author about a local area and the book was in a cottage I was at. Predictable but good read with a nice twist at the end. Family stories are never quite what they seem."}], "description": "Lyris Pembrooke unearths a terrible family secret in the old mansion she recently inherited. Investigating the tragedy, she delves into the psyche of a damaged WWII soldier, aided by her irrepressible spirit guide and the family psychic. After inheriting Hammersleigh House from her eccentric great-uncle Patrick, Lyris Pembrooke makes a grisly discovery in the tower room of the Georgian-style mansion--the mummified remains of a child. To uncover the mystery, Lyris is aided by family psychic Aunt Clematis and Leander, a spirit guide with an attitude, who prefers hanging out with Winston Churchill and John Lennon. While nurturing a new relationship with Blackshore’s Chief of Police, avoiding her controlling ex-husband’s demands, hosting this year’s family reunion and engaging in a psychological battle with the mansion's butler, Lyris is taxed to her limits. During an oppressive summer heat wave, a tear in the gossamer veil that separates past and present forces Lyris to finally accept her psychic destiny. Driven to find out who murdered little Tommy Pembrooke sixty-eight years ago, she begins a journey back in time.", "title": "Cheat the Hangman", "url": "https://www.goodreads.com/book/show/12955881-cheat-the-hangman", "average": 3.62, "cover": "https://images.gr-assets.com/books/1348653812l/12955881.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/5295615.Gloria_Ferris", "name": "Gloria Ferris"}], "type": ["Mystery", "Fantasy", "Fiction", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/12955881-cheat-the-hangman", "http://www.goodreads.com/book/show/12955947-cheat-the-hangman", "http://www.goodreads.com/book/show/17170906-corpse-flower", "http://www.goodreads.com/book/show/23222092-shroud-of-roses", "http://www.goodreads.com/book/show/18964314-corpse-flower---part-1", "http://www.goodreads.com/book/show/36187602-skull-garden", "http://www.goodreads.com/book/show/26384922-cornwall-and-redfern-mysteries-2-book-bundle", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}