{"ratings": 1148, "userreviews": [{"userName": "Kim", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/1519524-kim", "userReview": "This was a good story about private adoptions. Not always a happy ending but good it was told by several points of view."}, {"userName": "VLynch", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/3642482-vlynch", "userReview": "I give up. I really wanted to like this book, it sounded like a great read. But.....it's not that good, i do not feel a connection to any of the characters. And while I am 3/4 Into the book, and it's at an important part of the story I really do not care to finish it. I download books from the library and have limited time to read them. I am moving on to another book, instead of wasting any more time."}, {"userName": "Jenee Rager", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/6424448-jenee-rager", "userReview": "As someone who has both struggled with fertility, and adopted I should have been the prime audience for this book. Unfortunately by the time I got past the first 1/3 of the book I just simply didn't have my heart into it. The characters are SOOOO unlikeable. I didn't like, or sympathize with any of them, except Heather, a very minor character who is giving her 2nd child up for adoption because she loves BOTH her children too much to ever have to see them go without simple things like medication, and clothing because she can't afford it. The rest of the characters are written to be just awful people. Francie McAdoo is probably the worst offender, but I have a hard time that any person who has waited years to adopt, after failing to conceive, would be so concerned that their baby was exposed to nicotine in the womb. It's not crack, it's cigarettes, and the book already established that it was a large baby, so the low birth weight issue most people are concerned about with smoking, wasn't an issue. Then there is the ending of this book. Usually I'm all for happy endings. This one, while happy was just plain out unrealistic. There was absolutely no way that every one of those characters could have a happy ending with the way they set themselves up, and yet they did. I was just so disappointed in this book after the first third that I can't in all honesty recommend it to anyone else."}, {"userName": "Danielle", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/2637089-danielle", "userReview": "Chosen was one of those stories that gets under your skin. Having dealt with my share of infertility problems, not only personally but within my own family, it was heartbreaking to read of the struggles of both the adoptive parents and birth mothers in this story. Both Heather and Penny, birth mothers, seek to find consolation in the hopes that they are doing the “right thing.” Although, they aren’t sure, even months after their babies have been given to new homes and parents. On the other hand, the adoptive parents yearning for an infant of their own to comfort and care for is equally heart wrenching; their constant waiting with subsequent devastation at a changed decision. Both sides of the coin have their own burdens and suffering, but equally, joy when a resolution is happily met.There were instances in this book when I felt myself physically cringe. In one scene a mother physically strikes an infant repeatedly. The act is minute in comparison to the length of the book, only a couple of sentences, but even now – days after having completed it the scene still comes to mind. It was horrifying, but incredibly real. The couple with the infant not only were quite young, but they lived in a terrifying part of town, surrounded by criminals. The father, Jason, is crude and repulsive, but still filled with an overwhelming love for Penny, his girlfriend. Were it not for these characters, no matter how uncomfortable they often made me feel, the story would be completely different. Less compelling.It’s the struggle that each couple and individual goes through that make the book what it is. Especially Chloe, the heart of the situation – if you will, who feels she’s doing everything with the best interests off all in mind. At the beginning of the journey they each seem so firm, so unmovable in their decisions, but throughout the course of the book they learn there is often more than one way to look at the outcome that results. In the end it’s what their heart desires that takes them down the path they each go, some ending in completely different places they thought were possible.Overall, I really enjoyed Chosen. I’m not entirely sure it falls firmly in the “Chick Lit” category, but I would definitely compare it to the likes of Jodi Picoult and Jennifer Weiner. If I had any difficulty with it besides what I’ve already mentioned, it would be the number of points of view. With nearing on half dozen different characters speaking throughout the book, were it not for the beautiful writing of Chandra Hoffman I’m not sure I could have followed. Even with that detail, I’d still highly recommend Chosen."}, {"userName": "Laurel-Rain", "userReviewDate": "Sep 02, 2010", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "In Portland, Oregon, the (fictional) Chosen Child adoption agency operates with a specific mission in mind: families can be created. To the social workers who work there, including Chloe Pinter who directs the domestic adoption program, the mission is one that almost supersedes everything else in their lives. Their hours are unpredictable, interrupting many moments of personal interaction. Chloe's relationship with her fiancé Dan is precarious at times because of the demands of the job.But Chloe forges ahead, connecting birth parents to adoptive ones with a zeal that seemingly consumes her.In this tale about creating families, the alternating chapters focus on individual characters, from Chloe, to individual birth parents, and to a couple that once tried to adopt, but now has a birth child.Each exploration reveals the emotional drains as well as the eager anticipation of each character, whether that character is one waiting for an adoptive child or is a birth parent struggling with the pain of giving up a child. We come to empathize with the pain, the struggles, and finally the joy that comes when everyone achieves his/her goal.But the story does not end with the \"chosen family\" riding off into the sunset. We also see the regrets of the birth parents, the struggles of new parenthood for the adoptive ones, and even a case of postpartum depression that almost leads to disaster.Hoffman's portrayal of the birth/adoption process was realistic, delving into the flaws of all the characters with sensitivity. Social workers, as well as birth parents, are human and subject to errors in judgment. These insights added depth to \"Chosen: A Novel,\" which resulted in a five-star review from this reader."}, {"userName": "Natalie ", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/1167461-natalie", "userReview": "Awesome read! Riveting from start to finish. Chloe is the director of The Chosen Child. The Chosen Child is a non profit adoption agency and Chloe's job is to find mom's who need to give their child up for adoption and to match her with parents looking to adopt. Its a stressful job for Chloe and it gets in the way of her relationship with her boyfriend Dan. Dan decides to move to Hawaii to start up a business and wants Chloe to come with him but she is torn between the love of doing her job and Dan. There's also the Mcadoos. They were able to adopt thru The Chosen Child but the worst nightmare happens to them and it involves the birth mother and her boyfriend. Well I won't say anymore, you have to read this awesome debut novel!"}, {"userName": "Kristin", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/3031705-kristin", "userReview": "Three couples' lives, bound together in a world of failed fertility treatments and endless adoption papers, unravel throughout this debut novel, Chosen by Chandra Hoffman. Chloe, a tough as nails adoption caseworker, is torn between making the affluent McAdoos dreams come true while crushing the lives of Penny and Jason, the desperate parent's to be. Enter the Nova family, lucky to be expecting after years of heartbreak and failed processes. Happiness is just around the corner for each of these couples. Or, is it? A simple mistake, one desperate action and an impulsive abduction force each player to examine their true emotions with unexpected consequences. It turns out, things are not always as they appear."}, {"userName": "Alyssa Seely", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/6346501-alyssa-seely", "userReview": "Spoilers. This book is a feminist's worst nightmare. Throughout the entire book, the main character struggles with her hippie, bum of a boyfriend who doesn't seem to give a damn about her, but she is very passionate about her job because it creates families and gives babies loving homes. Of course, when she gets pregnant she gives up her job she loves so much to be with her ass-hat boyfriend, and work as a waitress so he can follow his dream, and rationalizes it by saying that as a mother, she can no longer do her job. Because now it feels wrong? I have no clue."}, {"userName": "Diana", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/4467222-diana", "userReview": "I always find books about adoption interesting. My husband and I have adopted three children and over the years we have met several others who have their own story. It is amazing that although we have all wanted the same thing, the route to get there was very different and unique. I thought this author did a great job of sharing information and feelings about adoption from various different viewpoints and socioeconomic backgrounds. The author also threw in some interesting twists that made the book a page turner for me."}, {"userName": "Amber Balash", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/139370-amber-balash", "userReview": "Wow... this was different than any book I've ever read. Definitely a rated \"R\" with a lot of crude language & descriptions, however, once you start the book, you have to finish it. I think that the story being told by a variety of characters really added a lot to the story. I enjoyed reading about the author, too, and feel like while it was fiction, it was very true to life and Hoffman definitely knows of what she writes. Not for the faint of heart, but if you're looking for a different kind of read that you can't put down, go with this."}, {"userName": "Ginny Shadnaw", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/62278372-ginny-shadnaw", "userReview": "I honestly did not mind this book when I first started reading it. It caught my attention & had build up, but that lasted way too long throughout the novel.The writing really got to me.... I know I have to re-read parts because I can get distracted while I read but I felt like I had to do this on every other page! The transitions and dialogue were sloppy and I found quite a few typos. Very infuriating and difficult to try to delve into the story."}, {"userName": "Rusane", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/1228172-rusane", "userReview": "A pretty graphic look at the business side of adoption. While I have never thought too much about it, was pretty disgusted with the idea that people, who are involved in an adoption arrangement (whether as a birth mother or an adopting parent) are at the mercy of (or perhaps even willingly/actively contribute to) a system of profitability - that there are people in this world that think it is okay to excessively profit from these situations and have so jaded the process that adoption is losing its true meaning - while intending to be in the best interest of children, adoption has become yet another avenue for individuals to exploit intentions - another case of someone profiting from an action that was never intended to be profit based. Because the book did a great job of painting this picture of profit (Judith is just about the most detestable character), it did a horrible job of promoting adoption as a life option. But, then, I suppose that was not the intent of this novel. The focus of this novel seemed to be spotlighting the business aspect and it's impact on those involved. There was no warm fuzzy that shows the true child benefits of adoption. Because of this, I can't say that I loved this book - meaning that it didn't make me feel good and it didn't make me happy. I don't feel like I am a better person for having read it. I also, however, don't feel like I wasted my time. The book was well written, very dark, and brought to light an issue that I had never thought much about. So, yes....well written, good book. But not a feel good or even an enlightening story. Depressing for sure."}, {"userName": "Cheryl", "userReviewDate": "Sep 01, 2010", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Chloe Pinter is the director of Chosen Child’s adoption program. Chloe loves her job, especially when she can put another file in her “Completed Adoptions” drawer. Chloe’s latest couple awaiting a baby is Mr. and Mrs. McAdoos. They will be adopting a baby boy from Jason and Penny. Jason and Penny are a young couple that are desperate for money. Then there are the Novas. They have been trying desperately to get pregnant. They finally have. When a baby is stolen, everyone including Chloe start thinking about what is really important in life. If you are adopted you have probably wondered at a time of two in your life…What would have happened if I hadn’t been adopted…Who were my birth parents like…Why did they give me up? Chosen by Chandra Hoffman is fictional but it is based on real experiences Mrs. Hoffman had. It was amazing that Chosen is Mrs. Hoffman’s debit novel. It feels like it is her fifth book. I was very impressed with this book. It had great depth, a strong storyline and good characters. I got to experience the adoption process from every angle…the people giving up the baby to the ones adopting the baby. In addition, to the ones that have been trying to have a baby of their own. This book will make you appreciate the family you have…whether it be, born into it or adopted like I was. My parents are great and I am lucky to have them. The only issue I had with this book was that I wished that Chloe had been a bit more assertive."}, {"userName": "Candy", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/2429736-candy", "userReview": "Every once in awhile you come across a book that just blows you away. After you've read the last page, you contemplate the plot, the characters, and wish that you hadn't read the book so quickly. Chosen is one of those books.Chandra Hoffman takes the very delicate subject of adoption and tackles it head on. Through out the book the reader gets 4 POVs. Chloe Pinter is the social worker for the adoption agency, who has been struggling to find her place in the world and feels that she has found her place now that she is in Portland. Francie and John McAdoo are the high maintenance couple who is looking to adopt from Chloe's agency. Paul and Eva Nova had been trying for years to have a child and had decided on adoption when Eva suddenly becomes pregnant. Jason and Penny, the down on their luck couple, fresh out of jail, looking to put their son up for adoption.This is not a fairy tale story about adoption and the process that couples have to go through to be selected. All of the characters hit rough spots in the story line. Just when you think that things are gong to work themselves out, something else happens to the characters, keeping the book extremely interesting.The ending was not what I expected either. For a few moments, I was ticked that it ended the way it did. However, because Hoffman chooses such a different resolution rather than the cliche standard it works. Anything less would have been a detraction from the story as a whole."}, {"userName": "Debra", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/2621512-debra", "userReview": "I just received notification that I won this book from Goodreads. I am so excited to get the book! It looks very good!Update: I enjoyed this \"most of the time\". First, I like books that have a different plot or premis to them and this didn't disappoint. Not the same old read. Secondly, I liked the way that Hoffman \"grew\" her characters from page one through the end of the book. We met them, may have liked, disliked or felt sorrow for them... but as they developed as people and the characters grew to know themselves, my opinions continually changed too. One minute, I was mad at a character and the next, I felt a little sorry for them. Or on one page, I was so happy for a character, and the next page - I was feeling angry. Each character seemed to grow in the book and I was satisfied when I closed the book at the end of the night.However, I felt that there may have been too many \"main\" characters so it was hard to follow at times and I also felt that Claire, the focus character, was quite wishy washy a lot of the time. I didn't agree with her own boyfriend decision at the end at all. I think that I would have enjoyed it a bit more had she been a stronger character."}, {"userName": "Helen", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/1292594-helen", "userReview": "Chloe Pinter loves helping families realize their dream of having children through her job at a private adoption agency. And she’s good at it. But as one family’s dreams come closer to fruition, another family’s dreams are shattered, and Chloe is left to pick up the pieces.In Chosen, Hoffman examines the motives of a private adoption agency and its staff, adoptive families, and birth mothers unable to care for their children. In some cases the situations are heart-wrenching, in others…well, in others it’s heart-wrenching.Each family, whether it is the Novas in persistent pursuit of a traditional family, the McAdoo’s with the wealth to support “happiness”, or Jason and Penny in their desperation; all suffer a palpable, undefined longing. While all is well that ends well, each is forever marked by what has been lost.Hoffman raises questions for which there are no good answers, making Chosen perfect for book discussion."}, {"userName": "Sarah", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/40147342-sarah", "userReview": "I saw this book in my library bookstore and thought it sounded good. I put it on hold and the problems started instantaneously. The writing style is weird (Chloe is trying to develop a taste for coffee. Chloe finds something when she walks in). Not the kind of style I'm used to reading, so it was a little jolting. In the first couple of pages, the author has already used Jesus' name in vain and then used the \"s\" word several times. I can put up with some swearing in books but not that many so early. I would have stuck with it longer if the only thing was the writing style, but with the language too, I put it down after only a few pages."}, {"userName": "Denise", "userReviewDate": "Nov 07, 2010", "userURL": "http://www.goodreads.com/user/show/1321103-denise", "userReview": "It is always exciting to read a terrific first novel like CHOSEN. Even though it was not the type of subject matter that would generally appeal to me (adoption), I really could not put it down. I am not great at writing book reviews and won't even attempt one now. I just want to recommend this book to anyone looking for great characters, plot and writing! I saw where this author/book was compared to Jodi Picoult as if she (Picoult) is the goddess of good fiction. Quite frankly, I like CHOSEN better than most of Picoult's books and look forward to more good books from Hoffman in the future."}, {"userName": "Michael", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/3680008-michael", "userReview": "I wish there was enough words to describe how boring this book was, but there is not much. The only thing that I got from this book are the three different families that is all expecting, adopting or dealing with babies. The characters were so weak and undeveloped, I kept waiting for something to happen but nothing was happening!It was not captivating by any means, sadly I do not plan to read anymore novels from this debut novel.The characters were easily forgettable, story was weak and did not have the energy to get through this.."}, {"userName": "Connie Borglin", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/3176059-connie-borglin", "userReview": "I was excited to win this book because I have had family members go through the adoption process and was looking forward to reading the book. I really enjoyed the different characters and the stories from all views. The characters were written very well and I could sympathize with so many of them. Loved the storylines and was glad to have read this book. Good book and would definitely recommend it."}, {"userName": "Nichole", "userReviewDate": "Sep 25, 2010", "userURL": "http://www.goodreads.com/user/show/2805759-nichole", "userReview": "I am thrilled for this new author! I enjoyed her style of writing, got emotionally involved in the book (even if that emotion was often anger, I still count that as a good thing), and was pleased and satisfied with the ending. The story has a harsh portrayal of the adoption reality, however it is obvious to me that these are just some of the things that happen. I am glad that I read this book and look forward to reading more from this author."}, {"userName": "Sarah", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/184651-sarah", "userReview": "It's been a long time since I've read a page turner, and this was finally one for me. I didn't put it down most of the weekend. I don't know much about adoption but felt like I learned something. As a social worker, I did feel it was a bit unrealistic with the lack of confidentiality Chole had without getting into any work trouble about it, but it made for a good story. I think that's probably the one thing that holds me back from giving it a 5. It was a nice surprise of a book."}, {"userName": "Robin", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/1496564-robin", "userReview": "Oh wow. I haven't yet decided if I liked this book or not but did find it intriguing and very readable but there were times that I found myself flinching. This is sometimes brutal and violent (men fantasize about murdering their partners and a baby is abused) but I have no doubt the author knows of what she writes since she worked as a director of an adoption program. I have to think about this before assigning a star rating."}, {"userName": "Colleen", "userReviewDate": "Oct 20, 2010", "userURL": "http://www.goodreads.com/user/show/1555609-colleen", "userReview": "This normally a book I wouldn't have ...chosen...on my own but I was asked to review it for a website and wow! I loved it. I can't believe this is her first novel. She spun the character's lives together so naturally and the story unfolded in a completely realistic way. I also loved that you could tell each character by their distinct voice. There's nothing more annoying then the speech patterns being the same for females and males, rich and poor so she really captured it well."}, {"userName": "Laura", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/1805608-laura", "userReview": "Chosen is a great mix of action, drama, romance, and realistic fiction. Hoffman brilliantly portrays both the birth mothers and the adopting parents with a multitude of perspectives, wide ranging emotions, and well written depth. Chosen, much like Lisa Scottoline's Look Again, is one of the few books that accurately portrays adoption as one of the many facets of parenthood."}, {"userName": "Joy", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/1862313-joy", "userReview": "A diverse cast of characters going through the baby thing, birth mothers, adoptive parents, adoption workers, drug addicts. The story is told from different perspectives, which works very well to give the reader the whole story. I had an impending sense of doom, and so finished the book during the daytime. It all works out in the end, although maybe not how any of them imagined."}, {"userName": "Sam", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/8009633-sam", "userReview": "I wanted to read this book. I wanted to know the story. However, the writing style was so atrociously all over the place I couldn't bare it. The split narrative usually doesn't bother me, but here it was frustrating. The thoughts and characteristics of each character is not at all what people are like and prevented me from being sucked into the story. Such a shame."}, {"userName": "Rachael", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/1034952-rachael", "userReview": "This is really an awful book. None of the characters are the slightest bit likeable or easy to sympathize with. The book is unnecessarily profane, and paints the world of adoption in a really terrible light."}, {"userName": "Maggie61", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/2304073-maggie61", "userReview": "Wish we could do half stars here, a lot of books I`d like to give the extra half star, this being one of them. Good book by a new author, wasn`t fussy on the ending but I love the way she writes, it was a good story line, pretty quick read, highly enjoyable. Look forward to more from her."}, {"userName": "Katie Jenkins", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/4259670-katie-jenkins", "userReview": "I think this book was absolutely amazing. It really shows the roles of social workers (case workers), adoptive parents, and even relationships. I loved how there were a few twists that you would not expect. I recommend this book to anyone. It was well written and had great descriptions."}], "description": "“Gritty and suspenseful, Chosen draws us into the obstacle-strewn path of domestic adoption.” —Juliette Fay, author of Shelter MeA young caseworker increasingly entangled in the lives of adoptive and birth parents faces life-altering choices when an extortion attempt goes horribly wrong in Chosen. Written in the spirit of Jodi Picoult and Anna Quindlen, Chosen is an extraordinary debut novel from Chandra Hoffman that deals with the controversial subject of adoption while providing a riveting read that will equally ensnare lovers of suspense, domestic drama, and literary fiction.", "title": "Chosen", "url": "https://www.goodreads.com/book/show/8096073-chosen", "average": 3.4, "cover": "https://images.gr-assets.com/books/1348159413l/8096073.jpg", "reviews": 169, "authors": [{"url": "https://www.goodreads.com/author/show/3503609.Chandra_Hoffman", "name": "Chandra Hoffman"}], "type": ["Fiction", "Parenting", "Contemporary", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/8096073-chosen", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}