{"ratings": 373, "userreviews": [{"userName": "Priya", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/45632842-priya", "userReview": "****3 stars****\nThis was a different book from the werewolf books that I have read in the past and it's okay I guess, it wasn't a big wow and it wasn't too bad. But I mean some parts were really damn cute...\nI just don’t get you,” I blurted. “Are you really interested in me, or is this all just a game? Because I’m not into games.” There, I’d said it. I’d admitted that I thought he liked me and opened myself up for ridicule. Still, I felt a bit relieved.Aiden stood there shell-shocked. “Really, a game? You think I’m playing some sort of game with you?”“Isn’t that what guys like you do? You have every girl in school eating out of your hand, so you want the one who isn’t standing in line waiting her turn to hang on your arm. That’s a game if I’ve ever seen one.”“It’s not like that. Why would it be like that?” He eyed me, and a new expression crossed his face. “Why is it so hard to believe that I like you? I, Aiden Wright, like you, Teagan Rhodes.”“Because life doesn’t work that way,” I snapped. Then I marched away without turning back.\nthen he middle of the story was good as well and how they were getting to know each other, which was adorable and how Aiden was doing his best to get any chance possible to develop their relationship and he would always take advantage of any opportunity that he may have. \nBreathe, goddammit.What in the world was wrong with me? This was so embarrassing. I stood outside of Alli’s room with my forehead resting on the closed door trying to calm myself down. First I’d been embarrassed to be shirtless, then I’d remembered that terrible scene with her father, then I’d been completely swept away by Teagan’s offer to rub the medicine on me. The feel of her hands had been—Alli came around the corner smiling. “Were you just in there with Teagan?”I took a deep breath and glared. “I walked in there to get you to help me and nearly gave her a heart attack.” I pointed to my shoulder.I knew she still blamed herself for what had happened to me, and Alli’s smile faded as she saw my scars. “It actually looks way better, Ad. Did you need me to put that on your back?”I looked down at the medicine in my hand and felt flushed all over again. The residual memory of Teagan’s soft hands on my skin was torture. Sweet torture.“No thanks,” I managed. “Teagan helped me out.”Alli smiled again. “I bet she did. You know, I think you’re blushing.” She opened the door and walked into her room.\nbut then it was too near the end of the book where Aiden found out that Teagan was his true mate, well I guess I don't blame him because he didn't he was a werewolf so how could he have known. Well I guess the book ended well and both of them looooovvveeeddd each other and sooooooo cute"}, {"userName": "Kathy Martin", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/3122948-kathy-martin", "userReview": "This sequel to PACK OF LIES focuses on Aiden but also includes the viewpoints of Teagan and Peter. Aiden and his family have moved to Red Ridge, New Mexico where he learns that he, his sister, and his mother are werewolves. Even more than that, he learns that his father Paul who is human is not his biological father. Marcus, who is the alpha of the werewolf pack, is his biological father. This rocks Aiden's world by changing everything he had ever believed about himself. This cocky, beautiful, woman-killing young man has to deal with things when life isn't easy anymore.Teagan has never had life easy. She lives with her alcoholic father who constantly promises to attend AA and change his life but who also constantly breaks his promises. Along the way he verbally abuses Teagan and helps destroy her self-confidence which already took a hit when her mother left the family. She had had run-ins with the pack kids and been used and betrayed by a young man who seduced her and dropped her. She certainly isn't looking for another relationship with a beautiful member of the pack. The third viewpoint belongs to Peter. Peter watched his uncle be killed by a werewolf but no one would believe that was what happened. He spent years institutionalized, medicated, and abused while still being determined to avenge his uncle and murder werewolves. Now released from the institution he finds his way to Red Ridge to track down possible werewolf sightings and recruit a team to kill werewolves. The story is woven between these very different people. The situation heats up when Aiden really notices Teagan who is his sister Alli's friend. In fact, he notices her in such a way that he believes that they are true mates. This is another case of insta-love which I usually hate in books but works because it has been established as a werewolf thing. Aiden has his work cut out for him though. He has to learn to control his being a werewolf, has to appease Marcus who wants him to be the next alpha and who really doesn't want him to spend time with human girls, and he has to convice Teagan to take a chance on having a relationship with him. I will have to admit that I really didn't like Aiden at the beginning of this story. I thought that he was too cocky and too sure of his attraction for \"the ladies\" — which struck me as a demeaning and dehumanizing way to label girls. However, as he struggled with both Marcus and Teagan, and as his real mating bond manifested, I got to like him a lot better. Teagan was my favorite character because I found her to be a survivor. She was smart and had goals for her life. She loved her father but didn't like him most of the time. She needed to be resilient and she was. I liked her caution around Teagan and I admired her for not letting him overwhelm her. My one complaint was the number of times that she was reduced to tears though they did make sense in this emotion-packed story.Fans of romance and fans of werewolf stories will enjoy this book."}, {"userName": "Christina (Ensconced in Lit)", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/3854740-christina-ensconced-in-lit", "userReview": "I was given this book by the publisher in exchange for an honest review.Circle of Lies by Sara Dailey and Staci Weber takes place right after Pack of Lies. The difference is we focus on different characters-- now we are in the heads of Aiden, Alli's brother, and Teagan, Alli's friend and likely Aiden's love interest. Teagan struggles with an alcoholic father and her burgeoning feelings for Aiden, who is part of the Beautiful, Untouchable crowd. Aiden, on the other hand, is struggling to even become a wolf for the first time and with the new politics that have erupted from the explosive secret that was revealed at the end of book one. At the same time, a werewolf hunter is determined to eliminate the entire pack. Can Aiden and Teagan work through their differences to ultimately be together?Here's my difficulty. If this book were stand alone, I would have seriously considered a 3.5 star, rounding up to four stars. The book is much more polished than the first one in editing and prose flow. The authors and their editors have definitely improved. In addition, Aiden and Teagan are much more interesting and likeable protagonists. That said, I'm not sure that this book brings that much more to the table because the similarities between the plots of the two books are pretty striking. We still have an alcoholic parent. We still have a love story that dominates the pages. We still have a True Mate twist. We still have the Alpha of the pack being a complete douchebag that wants his son to bow to his will and become the next Alpha-- makes me wonder, 1) why his awesome wife sticks with him 2) why anyone would be okay with him being Alpha in the first place. There is NOTHING nice about him. I would have liked him to be a much more three dimensional character.Overall, a much improved effort from these two authors, but they need to dig in deep to come up with something unique in the plot that will grab readers to stick around."}, {"userName": "Emily", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/4365117-emily", "userReview": "When Aiden Wright moved with his family to New Mexico, everything changed. His sister ended up mated and his life almost ended. Having survived Aiden is dealing with his wound which is healing slow even for a shifter, but finding out his father is really head alpha Marcus and father to Cade has him reeling. He can’t seem to shake his anger, until he meets human Teagan Rhodes.Teagan knows all about boys like Aiden and she has no plans to fall into this pattern again. Having separated herself from the other kids who she has named the “Beautiful People” in school, Teagan rebuffs the interest Aiden is showing in her. What she had not taken into account was that Aiden would be persistent and that every moment she is with him she finds herself falling harder.Number two in the Red Ridge Pack series. I thought this was a creative story that I thoroughly enjoyed. Aiden doesn’t know what is driving his attachment to Teagan, but he knows he feels most at ease when she is in his company. Excellent read."}, {"userName": "Cassandra", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/4699157-cassandra", "userReview": "My Thoughts - 5 out of 5 stars - I loved it!!!!Okay this is a YA Werewolf Romance, and the 2nd book in the series. I absolutely loved this book as much as the first. This book focuses on Aidan. Again, it is written in the perspective of 3 different people: Aidan, Teagan, and Peter. This book is packed with lies, intrigue, craziness, more family drama, high school drama, and young love. The authors do a fantastic job of pulling you into the Pack. The characters are like real high school students with typical problems you might encounter but with a paranormal twist. If you liked the first book, you will love this one too! Much like the cliffhanger at the end of book 1, book 2 has one too! The only thing I hate is that I have to wait for the next book. I would definitely start with book 1 if you have not yet read it before reading this book, or you will be missing key history. Come join the Red Ridge Pack, you will enjoy the journey."}, {"userName": "Nova Zaiden", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/12835394-nova-zaiden", "userReview": "When I first heard that this was a werewolf book, I expected something really action packed, witty, courageous and something that described the bond of a pack. This book? Well... It didn't cut it for me.See, I spend some of my time of wattpad reading their eBooks. I also have to say that some of the are werewolf and they're amazing. Amazing in the sense that they kept on on my feet and I couldn't put my iTouch down! Maybe it was just that one set of stories because this book was actually quite mundane and I don't think it should've been described as \"werewolf\".Don't get me wrong. it's much better than a LOT of books I've read, considering I don't... like... werewolf... The way it was written was captivating, but what was being written... wasn't.It was kind of like saying: A boy meets girl. Boy likes girl, girl is too secretive. Boy does all he can to love the girl, but has to deal with the girl's father. Oh yeah, and he's a werewolf.For me, the werewolf part was unimportant. They were barely wolves, the girl didn't know until the end, and some schizophrenic guy is trying to kill all werewolves because his \"uncle\" (the voice) supposedly died at the hands of a werewolf. See, that's another thing!! There isn't enough info in some spots and sufficient in the next.So, let's talk about something else... How about our lovely MC?Miss. Teagan Rhodes is another STUPID, ANNOYING, UNOBSERVANT, teen who I could really love to stab... with a fork... while it's on fire...So back story of Teagan (don't read if you don't like spoilers):She was a victim of the \"Use and Lose\" term, the \"Hump and Dump\", the \"Kiss and Diss\". Catch my drift? Anyway, she's really closed off from the world (Bella Swan, anyone?) and kind of hates the \"Beautiful People\" at her school... they are the werewolves. Aiden is her mate and she pushes him away 5000000000 times. She also has an alcoholic father and how could her life get any worse??NOW, back to review.So another thing about Teagan is why I think she's stupid. I don't know how a guy could do so much and then you just stop believing he's genuine because of a girl (you'll have to read the book for that one...). She's actually forcing herself to believe that Aiden is evil and my question is \"Why?\" \"What does that accomplish?\" Most guys don't even put that much effort, yet Teagan still believes that Aiden is only trying to get in her pants (for lack of a better term.)The only thing I enjoyed was the schizophrenic guy. (in terms of characters). He seemed like a killer (that's because he was...) and I thought that was interesting because he hears voices. When I say he's schizophrenic, I say it with a laugh because it really isn't all that true.This book had it's ups and downs, but something possessed me to keep reading. Now, usually i can tell if a book is a debut novel, but this one I can't. It's written in a way that the author(s) are experienced, but still lack something. The something would probably be interest in characters.For the full post and exccerpt, click here!"}, {"userName": "Laura Hartley", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/5898609-laura-hartley", "userReview": "Circle of lies is pretty similar to Pack of lies, the first book, except this time the main focus is Aiden, Alli's brother. At the end of Circle of lies, We found out that Aiden is actually Marcus' son which just makes everything more complicated because Aiden's half sister, Alli, is mated to his (new) half brother, Cade. Talk about incestuous. Anyways, that's not really the focal point of this story. Circle of lies revolves around Aiden and the human girl, Teagan, who we saw a bit of in book one. The love story is really similar to book one in that this is a pair that shouldn't be together, but because of their undeniable chemistry they have no choice. It was a little too similar to the fort book for my liking and had there not been another dimension o the story, I would've complained about this repetitiveness. In this book, we are introduced to a new character, Peter, a human who seems to be clued up on werewolves and how to identify them. Peter befriends Teagan's drunken father and at the climax of this story the two plot strands collide.I was a little surprised to find that Alli and Cade weren't the focus of this novel, but I actually think that this was a good thing. It was really refreshing to see the old story revamped from the perspective of different characters and I enjoyed getting to know Teagan, Aiden and Peter through their thoughts. As far as I can remember, these are the only three perspectives that we see, but they're the only three we really need in this story. I much preferred Teagan and Aiden's perspectives to Alli and Cade's though I can't really pinpoint why. Although there was also a sort of 'insta-love' between this new pair, their relationship was developed a lot better and there was a build up before they jumped into a relationship. Even though insta-love really bothers me, I accepted it in this novel because there was a sense of real chemistry between the pair. I liked that this story wasn't entirely focused on their relationship, but there were also details about Teagan's home life and the pack. The new guy Peter does sort of appear out of the blue and I feel that his background could've been developed a lot more but he did bring some drama to this novel. This novel ends on cliffhanger so I'm excited for book three and I'm wondering if its going to come from a new perspective. I still can't figure out why the titles of this books in this series are called 'Pack of Lies' and 'Circle of Lies' because I don't think lying is a particularly major part of these stories but oh well. This was an excellent book that I flew through in one sitting and despite it's similarities to book one of this series I still greatly enjoyed it.http://whats--hot.com"}, {"userName": "Jonel Boyko", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/15432163-jonel-boyko", "userReview": "I love that this book picked up exactly where the first book in the series left off without missing a beat. The authors also switched perspective while doing this. Not only did they switch perspectives between books but also within the book itself. They also managed to keep everything very clear. There was no confusion as to whose perspective was being portrayed within each chapter. I also appreciate the fact that, although while switching perspectives they may not necessarily jump forward in time, they also do not replay the same event from each character’s perspective. Because of this, the storyline was continuously progressing forward rather than simply rehashing the same events over and over.Consistency is the key when writing a series and the Red Ridge Pack series is definitely consistent. The writing style employed by the authors is consistent between the first and second novels in the series. As are the characters portrayed within the story. No one miraculously changes from one page to the next or from one novel to the next. Also, while reading this novel you cannot tell that it was written by two authors rather than just one. There are no inconsistencies in writing style or word usage. It is seamlessly put together.This book was a bit of an emotional roller coaster. The emotions were all portrayed to naturally that you couldn’t help but feel for the characters and their situations. It was extremely well done. Not only did the authors do a phenomenal job on the emotions of the characters, but the characters themselves were also quite well developed. The authors took the same characters that they had in the first novel and continued to develop them. Those who went from main characters in the first novel to supporting characters in this one are still the same people. Nothing has changed in their personalities or appearances. The same goes for those who went from being supporting characters to main characters. They were the same people (or wolves), just more fully developed.This was a very interesting and captivating read that I couldn’t put down. It was an amazing addition to the series. And although the actions and events of this novel were completed within the book, it leaves you perfectly poised for the sequel. And it is a much awaited sequel on my part.Please note that I received this book from the author in exchange for an honest review."}, {"userName": "ReadingToTheStarsAndBack", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/8256508-readingtothestarsandback", "userReview": "Originally posted at my blog: ReadingToTheStarsAndBackNow, this book is the second in a series as you may have noticed, I haven’t read the first book, so I’m not familiar with the characters. That can be a good thing or a bad thing. If the author constantly refers to characters from the first book, then the reader won’t be able to get along with the story and be left wondering what went wrong. You geddit? I feel like this book didn’t overdo it, but it couldn’t have been a standalone book. I don’t think the authors would have wanted that anyway so it’s all cool! Except that I still don’t really know who Kendall is. Old girlfriend? Deluded girl? And the announcement of Aiden having a different father to the one that he grew up with was a bit sudden. Like, in the first chapter. I felt like we needed to be re-introduced to the characters a bit and then the announcement could be made! The chapters were very small! When I first opened it and saw that it had 60+ chapters I was dreading it! But, the chapters are only a page or so, don’t let that intimidate you! I liked the character of Teagan’s dad. He was written very well, so believable! Relatable. Just wish that we knew more about Teagans Mum. Did we even know her name? Yes, I think they did. You’ll have to read the book to find out! The love scenes where written very well, but the wolves where lacking. More wolves, more wolves! Although, Teagan did mention Jacob Black so that was a bonus :PSome parts of this were a little cheesy, and sometimes the dialogue was a little...forced, and the part with Baby Got Back was cringe-worthy. (You just need to dial 1900 Mix-A-Lot...oh I’m grooving!) It’s always interesting to read a book written by two authors, instead of just one, but Sara and Staci seem like close friends, and get on a lot :) Also, you wouldn’t have been able to tell that this book was written by two people. That takes skill. Hats off, ladies! Overall I enjoyed this book and would be interested in reading the third book in the series, and possibly the first  but I probably wouldn’t buy them especially. Star xx"}, {"userName": "Brianna Maddox", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/21528283-brianna-maddox", "userReview": "Full Review on Brianna's Bookish Confessions.We now follow Aidan– whom is Allison’s older brother. He is trying to figure out who he is and what he’s going to do with his life. Things start to get a little crazy after finding someone that makes him happy. He meets Teagan– who is Alison’s friend from school and immediately likes her.Teagan hasn’t had the best of luck throughout her life. She has had many hard life decisions and is basically living on her own. Her dad is an alcoholic and her mom disappeared and never came back. Her dad always promised that he would change and sober up, but she knew it was never true. She hasn’t had the best of luck with guys either. She had her heart shattered into a million pieces and humiliated in front of the whole school body.There is a psychotic werewolf hunter plotting to kill werewolves and revenge death of a family member. Out for blood, he won’t stop no matter the cost. Who comes in his way?My Thoughts: Okay, I didn’t enjoy this one as much as I did Pack of Lies. The majority of this story (in my opinion) was solely based on Aidan trying to ask out Teagan and constantly trying. It wasn’t until about 80-90 pages towards the end (according to my iPad) that things really took off and it wasn’t just about their relationship. I think they (the authors) could have cut out some parts of Aidan trying to ask Teagan out and the story wouldn’t have been centered around their relationship.We didn’t get to see much of Alison and Cade. :( I was excited to see more about their relationship and everything, but sadly their were no chapters (that I can remember) that were in their point of views. I don’t think I’m as much of a fan of Aidan/Tegan as I am Alison/Cade.The characters however, really did develop a lot more as the story went on. While switching perspectives we weren’t re-told what just happened from the other character. It went immediately after what that last character thought. Make sense? :)Some of the ending felt rushed to me. I’m not sure what it was, but it felt rushed. The ending.. Wow. PLOT TWIST! Was not expecting that at all! Definitely reading Web of Lies!"}, {"userName": "Kacii", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/5784472-kacii", "userReview": "The first thing I thought when I began reading CIRCLE OF LIES was that Teagan and Aidan are really suited for each other. They seem like the perfect match. They balance each other out. The second thing I thought was yikes, Peter is a nutshell. Way worse then Kendall.Let's back up a bit. I'll give you the rundown on the book. It's from three different people's point of view: Teagan (she's human), Aidan (werewolf), and Peter (he's lost his marbles). Aidan meet's Taegan for the first time, and whadaya know. He's hooked. Teagan, unfortunately, has been burned by a hot guy before, and has lost the ability to trust most people. Her home life makes some people's look like royalty.For a big part of this book Aidan is trying to woo Taegan because hey, he's all about this girl. Teagan is a skeptic when it comes to love and hot guys. Who can blame her? And then there's Peter. His uncle died in front of him after being torn to pieces by a werewolf. And Peter went off the deep end, losing his marbles along the way. Now he wants to wipe out all werewolves.If you haven't read PACK OF LIES, the first book, then I'd sugest you do that before continuing to read. If you have read PACK OF LIES, you know a) Marcus is an ass and b) Cade and Aidan are brothers. Now that causes for some series drama. Everyone of these characters carries around some serious baggage.I guess the things that I loved about this book were the way the authors made you both love and hate some of the characters. At some points in the book I just wanted to shake Teagan. And Aidan, please, as my friend would say 'Put your big girl panties on and move on.' Peter gave me the chills. I don't think I ever loved his character, though I could understand where he was coming from and pitied him more than hated him. When you read this book you'll see all of the dynamics involving the characters, and the way the story is put together. You can appriciate that. The characters from the previous book and this one were one and the same, but now you ge to meet the other characters and see things from their points of view, and their minds eye. I really hope you consider reading this book. I know it was a joyous read that I loved and I can't wait for the next one."}, {"userName": "Lissette", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/4008232-lissette", "userReview": "Aiden Wright's life has taken a different turn. Recovering from an unexpected accident, he's still in the process of making sense of the events that have landed him where he is now. He knows that things aren't what they seem, and that his parent's have been keeping something from all along. Yet when the moment they reveal the secrets he needs to know arrives, he's not exactly prepared for what they have to say.His family's move to New Mexico is supposed to be good for him. It should allow him to accept his new role as a werewolf. Unfortunately, that's not the case. Aiden is still reeling from the implications of what he's been made privy to. Not to mention that there are those who aren't happy with the family's sudden presence in the small community. Never-the-less, he knows they're there for the duration, so he'll need to learn what he needs to learn and fast.When Teagan Rhodes enters his line of sight, Aiden's world takes a different turn. There's something about her that draws his interest, and he's not willing to allow anyone else to stake a claim on her. Sadly, she wants nothing to do with him. In her eyes, he's not a part of the world she lives in, and she'd rather do without the feelings he's begun to evoke in her.Aiden refuses to believe that Teagan wants to stay away from him. There's something that feels so right whenever they're together. Something he knows she feels. He knows he;ll need to make her see that they definitely belong together. Unfortunately, that doesn't seem likely. If they're to succeed in making things work between them, they'll need to first get past the differences and insecurities that surround them.This was another lovely addition to the Red Ridge Pack series. I enjoyed the story very much. While this one doesn't continue with Allie and Cade's storyline, it certainly is refreshing. We get to see Aiden and Teagan mature along the way, as well as deal with a slew of difficulties that threaten to upsurp the love they now share between them. Definitely a heart-warming and intriguing read, I look forward to what comes next for this series."}, {"userName": "Erin Maurer", "userReviewDate": "Mar 08, 2013", "userURL": "http://www.goodreads.com/user/show/5362069-erin-maurer", "userReview": "Circle of Lies is a delightful YA paranormal romance by Sara Daily and Staci Weber. The second in the Red Ridge Pack, Circle of Lies follows brand-new werewolf Adien Wright. Adien is having one heck of a time. In the past few weeks, he has found out his true identity, moved to New Mexico, been involved in a vicious right to save his sister and uncovered some major family secrets. Now, unsuspecting Teagan Rhodes has wandered into his life. Teagan resists advances from Adien based upon his involvement with the popular crowd. Dubbed \"The Beautiful People,\" the popular kids have hurt Teagan before. The problem is Adien and Teagan are meant to be, and alone their secrets threaten to destroy. This book was fantastic! While I adore fun, YA paranormal series, I haven't gotten into one about werewolves. Weber and Daily have crafted this lush world, with a community of complex, believable characters. I had no trouble believing in the pack dynamics. Adien is my favorite type of romantic hero. He is sexy, strong but flawed, vulnerable. Teagan is the perfect foil for his ladies man attitude. With her, he breaks down, he allows real emotions to lead his heart and his actions. Teagan is strong, witty, kind abs as little scared. The characters are what made this story so wonderful. Daily and Weber write with such clarity and poise, you can't help but cheer for them. The authors also capture the frenetic pace of high school romance. It is full of action, emotion and juicy details that keep you coming back for more. While romance is at the forefront of Circle of Lies, the novel is rich and layered. As if falling in love in high school was not dangerous enough, Teagan has to deal with the fact that her boyfriend is a werewolf and being stalked by a psycho killer. Fans of paranormal romance will love this book. I, for one, cannot wait to go by the first Red Ridge Pack novel.Disclaimer: I was gifted a copy of this book in exchange for an honest review. All opinions are my own."}, {"userName": "Kirsty Vizard", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/3203304-kirsty-vizard", "userReview": "****BLOGGERS NOTE******Previous to reading 'Circle of Lies I did read 'Pack of Lies' (also 5 wings!!!) because I am a bit OCD when it comes to reading a series of books!!! Although in the case of 'Circle of Lies reading #1 is not necessary I do feel that I had an introduction to the pack and the back ground to Red Ridge.Last year I read several bad werewolf/shapeshifter books and I have found myself avoiding them since. However when the opportunity arose to review 'Circle of Lies' I thought it may be time to put aside my prejudice, and I have a feeling the Red Ridge pack have cured me!Unlike other shapeshifter books I found 'Circle of Lies' focussed more on the human aspect of the story, and the wolf was merely a byproduct.'Circle of Lies' is Aiden, Teagan and Peter's story. Aiden being the shifter, Teagan the human and Peter the crazy wolf-hunter. The story is told from the three differing perspectives, but Sara Dailey and Staci Weber avoid confusion by heading their chapters with the name of the narrator.Aiden is coming to terms with being a werewolf, his first change, finding love and his real parentage. Teagan is dealing with her alcoholic and abusive father, her self-image, first love and the issues that surround that. Peter is coping with his uncle's death, his time spent in a psychiatric hospital, the fact that no-one believes in the existence of werewolves and his deteriorating mental health. These three stories intertwine in the most beautiful, explosive and heartbreaking way. Sara Dailey and Staci Weber tell a YA story concentrated on human emotions and relationships, whilst maintaining a paranormal element.This book would appeal to fans of YA romance, as well as shapeshifter fiction. I admit I was blown away by it and can't wait for #3!!!"}, {"userName": "Claire", "userReviewDate": "Jan 14, 2014", "userURL": "http://www.goodreads.com/user/show/7126225-claire", "userReview": "Another great book in the series!This one centres on Aiden, Allie's brother. And also, a werewolf hunter, Peter, that has been thought of as crazy and institutionalized because of it. He stumbles across Red Ridge and in his head he speaks to his (dead) uncle who was mauled to death by a werewolf.A lot of revelations shock Aiden. Turns his life into something hes not sure of, and certainly not ready to accept!He's finally had has first change and realises that anger is what triggers it off, and loves the feeling of being so free and finally feels at home in his skin.Allies first friend that she met in Red Ridge, Teagan has suddenly caught Aidens attention and he cant get her out of his mind.Teagan however has no idea why someone as gorgeous as Aiden wants in HER. Shes had a bad time in the past when a gorgeous boy showed interest in her, slept with her and then dumped her, so shes not quick to jump in with Aiden.And of course, shes a \"domestic\" - what werewolves call humans.Marcus the Alpha, is less than pleased when he discovers Aiden is dating her. And actually tries to stop it. Unsuccessfully.But will Teagan give in to her feelings, that are growing more for Aiden everyday?Will Aiden be as persistent do get her attention?How can a were date a human with Marcus's stand?Will Peter the hunter get to fulfil his uncles revenge?I'm not gonna tell you the answers to these, but its such a great book to read, and is one of those ones that are hard to put down!And awaiting the next!!"}, {"userName": "Andrea Heltsley", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/6600922-andrea-heltsley", "userReview": "I really enjoy this series. It's a fresh YA take on werewolves. The story in these are romantic yet clean. They also have a simple yet well executed plot. The book didn't have a dull spot in it. I had to keep reading to know what was going to happen. I wasn't so sure I was going to have the same attachment to this one since the main characters were not Allison and Cade.I found that I liked the main characters just as much. Teegan was troubled yet a strong individual considering how her life had been. Aiden even showed a side of himself that surprised me. It was also great that they kept Allison and Cade in the main part of the story. I like the interwoven characters.My only complaint about the whole book was the extra point of view of Peter. I just had trouble settling into his parts when I only really cared about Teegan and Aiden's point of views.The lies...oh the lies. I really expected a lot of things to be resolved in book 2. While they did reveal quite a bit, it's obvious that we will get more out of this series. I hope book 3 comes out soon so I can get some more answers:)If you're a werewolf fan or just a paranormal romance fan, this is a great series. It's a YA series that's suitable for all teens, while still being romantic. I highly recommend you give Pack of Lies (Red Ridge Pack #1) a read to decide if this series is for you. This book gets five stars because I loved it!"}, {"userName": "Annette M Guerriero Nishimoto", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/3619095-annette-m-guerriero-nishimoto", "userReview": "Today's review is on circle of Lies by Sara Dailey & Staci WeberI was hoping there would be some growth with this second installment of the Red Ridge Pack series, and while there were no inconsistencies like the first it still needs a little work. In fact, I feel that this one seriously lacked some originality. In the first book we learn that Allison and Aiden's mother is a werewolf and that they are too. While book one focuses on Allison finding her true mate, this book focuses on Aiden doing the same. The only real difference between the two is that Aiden's true mate is a human. Sound like what happened with his mom and dad? Exactly!! Not to original.We also learn that Marcus is actually Aiden's father, not the man who raised him. And as the eldest son of the Alpha, Aiden is expected to become the next in line. What does that mean for Cade? What happens now? Well we don't really find out until the very last sentence that pretty much tells you what is going to happen in book three. Talk about giving to much away.The crisis of this story does have some merit but not very much. It lacks any real substance and falls apart to easily. Don't get me wrong, it did pique my interest if only for one chapter. Perhaps if the authors spent less time on copying almost the exact events from book one and more on the \"bad guy reveals that werewolves are real\" part, the overall book would have been better. I guess we'll never know.2.5 of 5 starsAvailable at Amazon"}, {"userName": "Lettee", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/9593819-lettee", "userReview": "I really enjoyed reading this second installment on the Red Ridge Pack series. You will find a mix of things going on in this book that is really entertaining and attention getting. I actually read this in one day. (I had a hard time putting it down.) You can't help but fall in love with Aiden. There is a part in this where Aiden is at his back door and is doing something, (NOT going to give a Spoiler!!), that will make you Laugh Out Loud. I literally couldn't read for a couple minutes because I was laughing so hard. The way this one part alone was written, you can actually picture it happening. Expressions, actions, everything. It was awesome!! One part I really have to disagree with in this book is:***SPOILER:***Teenagers, that are \"IN\" High School, \"thinking\" they are in Love and then have sex? I know it is common, but to encourage it in a book as being not a big deal and written about like it should be done, I GREATLY disagree. I also didn't really care for the ending. At first Cade is \"okay\" with what is going on. But the ending says something altogether different and without warning. What?!***END OF SPOILER.***BUT, it isn't enough to steer me away from recommending this book. If you like shifters, humor, laughter, love story and some action? You will love this story. I am definitely looking forward to the next one to come out."}, {"userName": "NaNa", "userReviewDate": "Feb 28, 2013", "userURL": "http://www.goodreads.com/user/show/9297043-nana", "userReview": "This book is pretty similar to the first book, Pack of Lies, but with different POVs. The main focus is Aiden, Teagan and Peter. I gave this book a 4 stars because I was really disappointed with this new character Peter. I really didn’t think his POV was necessary. I would’ve loved to have read about any other character from the first book instead. This book still had it’s shock moments filled with love, death, action and drama. It was a little rough in the beginning of the book but all in all it was a pretty good sequel. I did say that the first book needed more of Aiden’s character and this book delivers. It was filled with lots of drama and unexpected twist that really get you emotionally involved. The true mate story in this book was not that believable to me as much as the one in the first book. I did enjoy every aspect of Aiden’s story but I was a little turned off by Aiden in the beginning just because he seem a little to cocky and self absorbed. I don’t know why Aiden had to be this werewolf womanizer. I am happy to say that this sequel does leave you wanting more and it has such a great ending. I recommend this book just because the first book is so amazing and you get to see how the Red Ridge Pack family becomes a united."}, {"userName": "Jasmyn", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/2940845-jasmyn", "userReview": "Circle of Lies picks up right where Pack of Lies leaves off - only this time focusing on Allison's brother, Aiden. The book starts off with Aiden dealing with a very big personal dilemma that I don't want to say too much about since it may give away more that I should. To top it all off, he finds himself suddenly attracted to a human girl named Teagan, a friend of his sister's.The pack is dead set against Aiden's new love interest, and to top it all off she doesn't even know that he's not completely human. She's so in the dark that even when a werewolf-hunter begins to use her as bait to trap Aiden, she doesn't even realize it.Much more fast paced than the first book, Circle of Lies held my attention much better. I think the dynamic between Teagan, Aiden and both of their families was perfectly written. I think Teagan's father and his relationship with the crazy werewolf hunter were a little far fetched. I don't think anyone would have believed the story as easily as her father did. A little more doubt would have been great.All in all, an amazing second book.*Review copy received from IO Book Tours in exchange for my honest opinion*"}, {"userName": "Mindy", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/7190668-mindy", "userReview": "Okay, so this is a case of the sequel being better than the first book. When I first got the book for the review I wasn’t sure it could live up to the first book…and there is nothing worse than a second rate book in a series (and you know every series has a book that isn’t as good as the others…yes, even Harry Potter). But I liked this one so much better.\tCade (book 1) was arrogant, but Aiden is sweet, sensitive, (yes a bit of a ladies man, but never serious), and doesn’t like to hurt anyone. He’s just never really been in love before. And the kicker is, she’s been seriously hurt and thinks he’s just a little too good looking and upper crust for her. But of course they are true mates…and boy, does that piss the alpha off…a wolf in love with a measly human. Yum.\tI give this book 5 out of 5 clouds. If you only read one in the series…read this one.This product or book may have been distributed for review; this in no way affects my opinions or reviews."}, {"userName": "Becky Price", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/5399044-becky-price", "userReview": "Circle of Lies is a great addition to the series. I absolutely loved that it followed Allison's brother, Aiden. I adore his character and loved reading every minute of his life. I didn't agree with everything that Teagan did, but I understood where she was coming from and forgave her by the end. I love that Staci and Sara have their novels set up to tell alternating perspectives through out the book. It gives the story so much more depth and gives the reader a better overall experience. I think the story line was awesome and definitely had multiple plots to follow from each character having their own personal drama to add to the story. Overall the story was very well told and I think the ending was fantastic. I cannot wait to see what lies ahead in this series and whose perspectives will be told next."}, {"userName": "Melissa Robles", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/6383562-melissa-robles", "userReview": "After Reading Pack of Lies, the first book in the Red Ridge Pack series, I was overly enthusiastic to start right away with the second installment, Circle of Lies which now features Aiden Wright, brother of the kick ass heroin Allison from the first book. I absolutely loved this one even more than the first, the main characters Allison, Caden and Kendall move over to give the spotlight to Aiden, Teagan and Peter, managing not only to take part in a very interesting story filled with action and true love, but they on their own speak volumes with their personalities.For the rest of the review, please visit Cuzinlogic:http://cuzinlogic.com/2013/03/circle-..."}, {"userName": "Melanie Ramey", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/5643266-melanie-ramey", "userReview": "This book was just as good as the first one! This book focused more on Alli's brother Aiden and all the drama high school kids can have. It kept the book young while still giving in a grown up twist. Aiden's a shifter but why hasn't he shifted yet but his sister has. hmmmm...guess you will have to read the book to find out why.Oh in this book Aiden meets Teagan. Will their relationship be a fling or the real deal? Such a great book. It had me wanting to know what would happen next! The plot was consistent and then characters each gave a little something to make a great overall wonderful book! I would definitely read this series again in the future! I can't wait for more!"}, {"userName": "Bella Swann", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/26504871-bella-swann", "userReview": "Overall, a good story. I liked the depth that Aiden shows here and Teagan is a strong character. I thought Peter while clearly dealing with mental issues could have been explored in greater detail as he did have a real motive for becoming a werewolf hunter. I found the portrayal of Teagan's dad to be almost unnecessarily negative. This seems to be a common theme in the books that single parents are somehow over-the-top damaged re: Kendall's mom in the first book Pack of Lies. Perhaps it's a YA trope. Good story but definitely a lot of teenage drama."}, {"userName": "Nicole/Books Complete Me", "userReviewDate": "Feb 28, 2013", "userURL": "http://www.goodreads.com/user/show/3012503-nicole-books-complete-me", "userReview": "LOVED this book! There wasn’t a beat missed between this book, and Pack of Lies (the first book). Aiden learns a shocking truth, one that will shake up everything for the whole pack even! And then there’s Teagan. She’s fallen for one of the “beautiful” people. Again, we get a couple different point of views, which I love, because we’re able to see into their thoughts.There's a lot of action going on in this book! And I know there has to be a book 3!!! Because when it ends, there's more to this pack's story!! Can't wait to see what happens to Aiden, Teagan, Ali and Cade."}, {"userName": " Patches Braz", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/1454416-patches-braz", "userReview": "Aiden Wright has recently learned that his mother is a wolf and they are now living with the pack. His sister has had the change , he is still waiting. He meets Teagan at school he knows something about her is different. Not sure what it is he gets his sisters help in getting her to go out with him. Then all hell breaks loose and they must fight for their lives.This story was great. Characters were well developed and the plot was great. I look forward to reading more of this series!5 STARSPatches"}, {"userName": "Leah", "userReviewDate": "May 28, 2014", "userURL": "http://www.goodreads.com/user/show/11443928-leah", "userReview": "I really enjoyed this book, I would reccommend it to any fantacy/shifter book lover. Part of me wishes that this series stuck to just being from Al and Cades point of view, but it was still a really great story in the end. Massive cliff hanger! Going to have to find out what happens next!If you want tell me anything, discuss anything with me, ask me anything about any of my books or any random question, please do! Comment or send me a private message if you'd rather. I really don't mind and I love hearing from people! :)"}, {"userName": "Jessica", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/2036312-jessica", "userReview": "Is it so hard to ask for a good werewolf book? The writing is not the best. The characters aren't that much better. I hate Mrs. Wright. She's not the strong, protective mom I wish she was. I hate Marcus for being an asshole dad to both kids. I feel bad for Cade. It's like he doesn't matter anymore now that Aiden came into the picture. And than he turns on both of them when Aiden mates with a human. For some reason werewolf books, the really good ones, are hard to find. I somewhat liked the first one, but I don't know anymore… My patience with this series is thin."}, {"userName": "Susan", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/5114331-susan", "userReview": "\"Circle of Lies\" is the sequel to \"Pack of Lies\" in the 'Red Ridge Pack Series'. Picking up where the first book ends, it is filled with shifters, humor, romance, twists, turns and action. This book will keep you turning the pages until the end. A captivating read that I recommended to all readers, but I do suggest reading the series in order so you know exactly what is happening. I can't wait to see what happens in the next installment of the series.This review is based on a complimentary copy from the author which was provided for an honest review."}], "description": "Aiden Wright is trying to figure out who he really is, but the truth could cost him his true mate—or his life.Life has always been easy for Aiden Wright. He’s smart, athletic, funny, and the ladies adore him. But when tragedy strikes, Aiden discovers the truth about who he really is and his whole world comes crashing down around him. Aiden thought that being a teenage werewolf was going to be awesome, but it might just cost him the one girl who could make him whole.Since her mother’s disappearance, Teagan Rhodes’s life has been littered with her father’s empty beer cans and his hollow promises to change. Convinced that others would only let her down, she keeps everyone at arm’s length—but resisting Aiden’s charm is proving to be more difficult than she thought. Throw in a psychotic werewolf hunter out to terminate the species and one wrong move, one wrong decision could destroy everything.", "title": "Circle of Lies\n      \n          (Red Ridge Pack #2)", "url": "https://www.goodreads.com/book/show/17188539-circle-of-lies", "average": 3.87, "cover": "https://images.gr-assets.com/books/1356786735l/17188539.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/4341954.Sara_Dailey", "name": "Sara Dailey"}, {"url": "https://www.goodreads.com/author/show/6871482.Staci_Weber", "name": "Staci Weber"}], "type": ["Young Adult", "Shapeshifters", "Fantasy", "Animals", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/17188539-circle-of-lies", "http://www.goodreads.com/book/show/13596882-pack-of-lies", "http://www.goodreads.com/book/show/18621410-born-of-lies", "http://www.goodreads.com/book/show/20447185-web-of-lies", "http://www.goodreads.com/book/show/22174432-end-of-lies", "http://www.goodreads.com/book/show/9274485-sinful"]}