{"ratings": 34397, "userreviews": [{"userName": "James", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Review\n\n4 of 5 stars to C is for Corpse. Another fun adventure with Kinsey Millhone. But this time, she's got a case that's twice as hard because the person who's hired her has a bit of amnesia from a recent accident. But he's certain someone's trying to kill him. What's always interesting about Kinsey is how she charges for her cases, and when she chooses to work or not work. For example... she gets an upfront retainer which will keep her paid for a week's work. But then when the person who hired her actually dies in another accident, she's got money left. Should she give it back to the next of kin and abandon the case, letting the cops handle it. It is their job, right? No... not for Kinsey. She will use up the retainer and then either donate what's left or keep it if it's small enough to justify hazard pay! :)The third entry in the \"Kinsey Millhone\" mystery series by Sue Grafton is a complex mystery, especially when she only has certain info from the client before he bites the dust. But his family just thinks he's losing his mind and almost want to give up on him. Sort of like Kinsey feels about Henry dating... and he's found someone this time, but Kinsey's not sure how she feels about it. A necessary fun side-story to keep us entertained above and beyond the actual mystery itself. And how can you go wrong with a title containing the word \"corpse.\"\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators.[polldaddy poll=9729544]\t[polldaddy poll=9719251]"}, {"userName": "Phrynne", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "The best out of the three I have read so far but the first two were slightly spoiled by the fact that I listened to them on audio and felt that the narrator gave Kinsey a very unfortunate voice. This time I read a paper copy and Kinsey's voice was much nicer:)So far this is a very easy to read series with interesting mysteries which can be solved by an alert reader. Or you can just sit back and enjoy it and let Kinsey do the work. She is very capable and so far at least is not prone to try and get herself killed at every opportunity.Thoroughly enjoyable and I intend to keep on reading the alphabet."}, {"userName": "Marwan", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/49765318-marwan", "userReview": "Sue Grafton never failed to impress me before, and this time is no exception. It was an entertaining fast-reading book, and once again, I couldn't guess who's the killer till the end.Kinsey Millhone is hired by Bobby Callahan, a young man who had a car accident which caused him heavy injuries and a partial amnesia. Yet he's convinced that it was not an accident, and someone was trying to kill him, and he asks Kinsey to find out who. A few days later, however, her client ends up dead. So Kinsey take it upon herself to avenge Bobby and find out the truth."}, {"userName": "Claire Grasse", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/2177985-claire-grasse", "userReview": "This was the first of the \"alphabet\" books that I read, and I remember vividly staying up until 3 am reading it, and then being unable to sleep! Kinsey's voice and personality really resonated with me, which is pretty disheartening since so many reviewers seem to find her unlikeable. I love Grafton's use of words. I love pretty much everything about her writing style. Her characters are 3-dimensional and quirky. She doesn't \"cheat\" and pull a killer out of the hat on the second-to-last chapter as so many bigger-name authors do. We nearly always meet Grafton's killers in the first chapter or two. Kinsey is resourceful and smart, kind of like a hard-boiled Nancy Drew. She's also (unlike Nancy) riddled with faults, which is probably why I relate to her so well. I love that she doesn't need a deus ex machina to rescue her... she handles things just fine on her own, thank you very much. I feel oddly protective of her."}, {"userName": "Ace", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/23405868-ace", "userReview": "This is so far the best of the A and B and C that I have read of Kinsey. It's fuller and less of Kinsey in her down time ruminating over details that sometimes are not necessary, but they do round her out and give you a nice complete picture of just who she is and where her strengths and weakness are. I love the landlord backstory in this one too. I might be falling for him a bit myself.At the end, I knew it would get frantic as she fought to save her own life from the clutches of the nasty one, I did imagine a much more gruesome ending and I am really glad that Grafton's imagination didn't go in the same way as mine. Enough said.Having said that, I do need a break from this series which I think I will pick up down the track when I have fewer 'urgent' books calling out to me and much more time on my hands."}, {"userName": "Emma", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "Absolutely brilliant. The investigation was a good one and we see a more vulnerable and emotional side to her. I loved the way she dealt with Henry’s case! The end denouement was pretty creepy as well as exciting. Best one yet."}, {"userName": "Denise", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/8887111-denise", "userReview": "“I hope, wherever he may be, that he sails among the angels, untethered and at peace.”This is the third book in the series and my favourite so far. Kinsey's personality is softened and likeable. I liked Henry's subplot and liked Bobby's story too. This book was entertaining, a fast read and kept me engaged to the last page. Looking forward to the next book in the series."}, {"userName": "Chance Lee", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/2355889-chance-lee", "userReview": "\"C\" is for Corpse finds Kinsey investigating the claim of an injured young man that his car accident was actually a murder attempt. Working for Bobby Callahan draws Kinsey into a tangled mix of life insurance claims, cold-case murder, and prescription drug abuse. For some reason, the case hits Kinsey hard, and it's very sad. Grafton illustrates Kinsey's emotions strongly. To balance out the sad storyline, there's a semi-comical subplot involving a golddigger taking advantage of Kinsey's hunky octagenarian landlord, Henry. These books continue to feel quintessential 1980s for me in its gender dynamics. Bobby Callahan is portrayed as the ultimate tragic American figure -- a hunky privileged white man who, thanks to his injuries, no longer has a blessed life. Kinsey is an equal-opportunity slanderer, though, when it comes to weight. One male character is mentally lambasted for being overweight. Another female character is vocally chastised for being anorexic, even though it's pretty apparent she's being drugged by a trusted family doctor. As judgmental as Kinsey is toward people -- she judges random folks for being \"poor\" at the supermarket -- Grafton writes some fantastic scene descriptions in this book. She also crafts a suspenseful scene when Kinsey sneaks into the golddigger's room to hunt for clues. However, the climax, which also involves Kinsey sneaking somewhere for clues, drags. Also, the baddie just pops out to kill Kinsey, and it doesn't feel like she actually solves the case as opposed to just stumbling into the villain's lair. At one point Kinsey calls a woman \"ass eyes,\" an insult I don't even understand, but I kind of love it. I tried listening to this on audio, but the reader's voice for a major male character -- an awkward mix of \"macho\" and \"stupid\" -- turned me off."}, {"userName": "Obsidian", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "Wow. This book was great. Great writing, better development with characters, a nice side plot involving Henry and Rosie, and a great ending. Kinsey in book number three I think finally gives you enough yo want to stick with her. You hear about the accident that left her orphaned. Other characters like Rosie and Henry are given more to do. And we have Kinsey doing what she does best, not quitting til she finds out the answer to who tried to kill her client months ago. C is for Corpse is told in the first person. Kinsey gives you her particulars and goes into how she was hired by a young man (Bobby Callahan) to try to find out who tried to kill him several months earlier. Bobby was left with injuries, and his best friend ended up dead. Initially Kinsey wonders if Bobby could be wrong, but enough evidence is found for her to realize that Bobby was doing something that caused someone to strike out to take him out.Grafton gives you more information on Kinsey in this one. It's the first book that goes into the accident that leaves Kinsey orphaned. She doesn't use their names yet. However, we hear how she was raised by her aunt who was cold, but did love Kinsey. We also get more development with Henry in this one, Kinsey's landlord and probably the closet person to our detective. I do love Henry in these earlier books, but geez, this book certainly shows his pattern of getting taken by people. Henry meets a woman that is not all she seems and Kinsey investigates. We get additional characters that I don't recall being mentioned in future books. I'll have to double-check. I do like how Grafton has characters from earlier books show up in the later ones.The writing was great and flow smooth. We have a death touch Kinsey and her doing what she can to get to the truth in this one. I don't know if I found the why to the case believable, but it was fun getting there anyway.The ending leaves Kinsey providing a prologue that has some good news in it. I forgot how much I loved the earlier books that included a succinct prologue."}, {"userName": "Jenn", "userReviewDate": "Dec 21, 2010", "userURL": "http://www.goodreads.com/user/show/1433417-jenn", "userReview": "This book was great. It was a fast, funny read full of just enough twists that I really had no idea who the final killer was going to be -- but I should have known all along. Along the way, there were some striking lines, some fast dialogue, and not too much guns-blazing action (which is a relief). The author moves from witty little snips of flirtatious dialogue to observations of the surrounding town that cross the border into literature. There's more than a trace of Chandler and even a little Carver in the way she deals with her well-known but completely made up California town and its crazy, ritzy inhabitants.There are two mysteries afoot: one, the investigation of a near-fatal crash that's left the son of a rich family a shell of his former self; two, the not-for-profit mystery of where her landlord's new girlfriend has come from (and what she may want). The first leads detective Kinsey into a world of wealth and disfunction. The best part of this book is that not everything is better at the end; not everything is resolved neatly. People are hurt and stay hurt. That's a strange thing to root for, but in a mystery book, I do."}, {"userName": "Beth Peninger", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/4850999-beth-peninger", "userReview": "Kinsey Millhone manages to get herself mixed up in death and drama again. Surprise, surprise. In this case she gets hired and four days later her client is dead. Of course she can't let it go, I'm not actually saying she should, and eventually solves the crime. This time she manages to solve two very different crimes. Her landlord gets himself wrapped up with a suspicious character so Grafton includes another kind of crime as a side to the main. I'm only on \"C\" of Grafton's alphabet and Kinsey Millhone series and already going from 3 stars to 2. It's just not that impressive and already predictable. I do give kudos to Grafton for managing to make the killer unsuspecting for the majority of the book. Kinsey, the P.I. star of the series, is already wearing thin on my nerves. But I'm a glutton for punishment apparently as I'm probably going to continue through the alphabet until I just can't stand it any longer - it's easy and mindless reading and a good way to break up the heavier, weightier books I read."}, {"userName": "Christine (KizzieReads)", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/44218982-christine-kizziereads", "userReview": "Loved it!! I never see the twists or turns and it was a real page turner. I love Kinsey and her no nonsense attitude. I felt sorry for Henry, but glad about that part of the story."}, {"userName": "William", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/36549125-william", "userReview": "The prose and pacing are pretty good, the characters are a bit thin, dialogue okay, the mystery adequate, but the book feels heavily padded by descriptive passages (although nicely observed and written). I'll try another by Grafton, but I'm not optimistic."}, {"userName": "Book Concierge", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "Book on CD read by Mary Peiffer3***Book three in the series starring private investigator, and former police officer, Kinsey Millhone, has her investigating two cases simultaneously. For one, she’s hired to look into the attempted murder of Bobby Callahan. The problem is that there is no proof that someone purposely drove him off the canyon road, and the result of his injuries is some brain damage and memory loss, so he can’t remember what information he had that put his life in danger. And then there is her landlord’s new girlfriend. Henry is smitten with Lila, who has just moved to town and seems to have quickly wormed her way into Henry’s life, and his bank account. I love Kinsey; she’s smart, determined, hard-working, loyal to her friends, and strong in mind and body. I also like that Grafton occasionally gives us a little humor to ease the tension of some very dark situations. But make no mistake, she can craft a suspenseful scene where the outcome is not at all certain, and she kept me guessing for quite a while. I also like that Grafton has set these books in a time period where Kinsey has to do quite a bit of old-fashioned leg work – going to the library or city hall to comb through old records, calling a friend to find out about a license plate, etc. Sure, today’s detective would rely more heavily on a computer and state-of-the-art technology, but I like watching Kinsey use her brain.Mary Peiffer does a fine job narrating the audio version. She has good pacing, and tries to give each character a unique voice. I wasn’t a fan of the voice she used for Bobby, but that’s a small quibble. It’s an entertaining series, and I’ll keep reading it."}, {"userName": "Darinda", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/5465462-darinda", "userReview": "Kinsey is hired by Bobby, a guy who thinks someone is trying to kill him, and he wants to know who. Bobby had been in an accident that left him disfigured, but he's convinced it was not an accident and whoever tried to kill him still wants him dead. Unfortunately, the accident also caused Bobby to lose some of his memory, which makes it difficult for him to try to figure out who wants him dead. Kinsey takes the case, buy Bobby ends up dead a few days later. Kinsey doesn't leave cases unsolved, so she keeps working to find out who wanted Bobby dead.The 3rd book in the Kinsey Millhone series. A good, fast-paced mystery. Kinsey got herself into some kind of stupid situations, especially at the end, but still a fun read. I listened to an audio version of this book."}, {"userName": "Fiona", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/8641338-fiona", "userReview": "Good stuff. An intelligent, exciting whodunnit that I didn't start figuring out until the last couple of chapters. The language is very dated now - why is that the 1980s can sound more dated than the 1950s? - but it doesn't really matter. A good story is a good story."}, {"userName": "Annie (Under the Covers Book Blog)", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/2489554-annie-under-the-covers-book-blog", "userReview": "I’m just loving these books right now. C IS FOR CORPSE is another book in the Kinsey Millhone Alphabet Mystery series by Sue Grafton. In this one, we get a little more of a gritter story. Kinsey is hired by twenty-two-year-old Bobby Callahan who has just survived a near fatal car crash when his Porsche is forced over a bridge and into a canyon. Bobby has lost a large portion of his memory, but he can’t help but shake the feeling that he knew something before and that the crash wasn’t an accident. Someone tried to kill him.Kinsey is now trying to figure out what happened before another attempt of Bobby’s life occurs. But just three days after Bobby hires her, he dies in another crash. This puts Kinsey on high alert because now she knows Bobby was right in his hunch that someone was out to get him. Now she is on the hunt to find out what was so conveniently wiped from his mind from the first crash? This is no doubt Kinsey’s most juiciest mystery yet!I’ve mentioned this before already, but I just love these books. Now I’m a Romance reader at heart, but there’s something about these Mystery novels that gets me going. I’m always trying to piece out the puzzle before Kinsey can and evaluating everyone as if I’m the PI sent on the case. It puts my brain in a different mindset and I think that’s a wonderful thing to break up the Romances that I read so much of.As I read each book, I’m falling more and more in love with Kinsey’s character. She’s definitely my type of girl, the one that’s more than capable of doing things on her own. She has this focus and determination that is admirable, because I am the same way when I’m placed with a task so I find her very relatable. Kinsey doesn’t have a smartass sidekick or a man in her life to help her when things get rough, and there’s something about that makes me respect her so much more. He intuition and intelligence is what gets her through case to case and I don’t think there are many other heroines out there that can do what she does."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "Another good solid read from Sue Grafton.Kinsey Millhone is hired by Bobby Callahan just days before his death. He had been involved in a horrific motor accident that left his best friend dead. Only Bobby is convinced it was no accident, he is sure it was an almost successful attempt on his life.The problem is Bobby lost large chunks of his memory in the accident. All he can remember is being pushed off the road, and that he needs to find a little red address book. And then he is dead. But Kinsey is determined to complete the task Bobby hired her for."}, {"userName": "Lisa B.", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/1869506-lisa-b", "userReview": "I continue to enjoy this series."}, {"userName": "Pauline Barlow", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/41741784-pauline-barlow", "userReview": "Another great ending for this book by Sue Grafton. She is still learning to to build plots. I did not think anyone of the the victim's family or friends had caused hid death. It was a quick read, only 190 pages."}, {"userName": "Mary Ronan Drew", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/2986995-mary-ronan-drew", "userReview": "Sue Grafton's books get a little better with each letter. Here's what Amazon says about this one:\"How do you go about solving an attempted murder when the victim has lost a good part of his memory? It's one of Kinsey's toughest cases yet, but she never backs down from a challenge. Twenty-three-year-old Bobby Callahan is lucky to be alive after a car forced his Porsche over a bridge and into a canyon. The crash left Bobby with a clouded memory. But he can't shake the feeling it was no random accident and that he's still in danger…The only clues Kinsey has to go on are a little red address book and the name \"Blackman.\" Bobby can't remember who he gave the address book to for safekeeping. And any chances of Bobby regaining his memory are dashed when he's killed in another automobile accident just three days after he hires Kinsey. As Kinsey digs deeper into her investigation, she discovers Bobby had a secret worth killing for--and unearthing that secret could send Kinsey to her own early death…\"2011 No 147"}, {"userName": "Mark Baker", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/4545420-mark-baker", "userReview": "While working out at the gym, PI Kinsey Millhone is approached by a young man who was in a horrific accident 10 months ago take took part of his memory. He doesn’t think it was an accident but attempted murder and he wants Kinsey to find out why someone would want to kill him. She just begun when tragedy strikes. Can she solve this 10 month old puzzle?Another strong entry makes it easy to see why this long running series is so popular. The characters are sharp; in fact, it is a pleasure to see how easily the author creates characters with just a few sentences. The plot moves along well, although I did figure things out a bit before Kinsey did. That’s a minor issue in this enjoyable novel.Read my full review at Carstairs Considers."}, {"userName": "Laura Radniecki", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/19261992-laura-radniecki", "userReview": "Three books into the series and I am loving Kinsey Millhone!! I loved this book and would have given it 5 stars except I liked the character Bobby too much and was too sad when he died. It wasn't a surprise and that's not a spoiler as it says this on the back of the book.But Bobby was so likable and I really wanted him to find his way to thrive in his new reality post accident. I wish the storyline hadn't involved him dying.All that aside, I loved this book and can't wait to start on \"D is for Deadbeat\"!"}, {"userName": "Dianne", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/2728895-dianne", "userReview": "This is my first Sue Grafton book, and I think I may be a fan. Having just had to bail on another mystery writer (Janet Evanovich) who just didn't appeal to me, it was a pleasant surprise to discover Ms. Grafton...writes well, is amusing without being silly, and writes interesting, engaging characters. Well plotted, good pacing and fun to read...what's not to like?"}, {"userName": "Kristen", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/1071692-kristen", "userReview": "In Sue Grafton's C is for Corpse, the third installment in the Kinsey Millhone mystery series, this caper has some twists and turns with a shocking ending. When Kinsey met Bobby Callahan at the gym to do rehab for her wrist, he hired her to work on the case. Other than he's rich, he's been injured in a near-fatal car crash and believes someone's after him. She agrees to sign on and learns more about Bobby's life, including knowing the people he worked with, friends, and family. And thing aren't what he seems, when his half-sister's an anorexic and binges on drugs and alcohol, wasting away her life. As she digs deeper into his life, she also deals with an issue with her neighbors as this woman named Lila Sams came into the scene. She becomes suspicious of her and what she's up to and snoops around into her background. At the same time, Kinsey learns that Bobby died in a car accident. While she finishes what she started for her late client, she stumbles onto some hard-core truth on what he's been up to and who wanted to do him in. In the end, she had nipped two complicated cases in the double-edged bud with a shocking climax."}, {"userName": "Cecily Kyle", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/19467200-cecily-kyle", "userReview": "I love the way Sue Grafton tells a story, I get sucked right into the case and don't want to put it down. I love that these books are a bit outdated now as well because some of these older technologies Kinsey uses to investigate, gives great reminiscent visuals :) I will definitely keep reading the series, I enjoy the story telling. Good Read!"}, {"userName": "Paula Dembeck", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/15166873-paula-dembeck", "userReview": "I am continuing with this “alphabet series” which has been popular for a long time but which I only recently started.Kinsey meets Booby Callahan, a young man who works out at her gym on a punishing regime. He was obviously once handsome, a young man with the blond good looks of a California surfer, but a horrific accident has left him with a partially collapsed face, a crippled left arm and a marked limp. Bobby shares his story with Kinsey and asks for her help. He tells her he had been driving one night with his good friend Rick Berman when a car tail gaiting from behind, rammed his Porsche and sent him off the road and down into the canyon at the bottom of a steep cliff. The car hurtled into the air, flipped several times and landed on Rick who was killed instantly. Bobby lived, but it took months to recover from his massive injuries and the insult to his brain has left him with slurred speech and memory loss. There were no witnesses and not much evidence at the scene, which is unusual. Bobby knows he was once very smart, an A student on his way to med school. But that is one of the few things he remembers, as huge chunks of his past memories are missing. It has now been nine months since the accident and Bobby has been seeing Dr Kleinhert a psychiatrist, trying to come to terms with it all. Bobby believes it was not just a prankster or a drunk that ran him off the road but that the accident was actually an attempt on his life. He thinks he knows something that has put him in danger and because he has survived, another attack may be made on his life. His family think he is imagining things and do not give much credence to his fears, but he is wary of everyone around him. He is banged up, bewildered and scared to death.Kinsey likes Bobby. She admires his dogged determination to overcome his physical disabilities and his brave attitude toward his changed life, so she takes on the case. Three days later, Bobby is dead, killed in an automobile accident. Kinsey stays on the case, believing Bobby’s story even more since his death.This investigation sends Kinsey into a world of wealth and privilege where huge mansions serve as home and every need is attended to by house staff. She meets Glen, Bobby’s cool but devoted mother, her third husband Derek, a man who manipulates circumstances to his advantage and Derek’s daughter Kitty, a starving anorexic teenager who acts tough but is killing herself with drugs. In a secondary plot, Kinsey’s kindly landlord Henry Pitts is besotted with an elderly lady who has recently arrived in town. Henry’s life seems to have taken a turn for the good as this new relationship has lifted his spirits and he seems to be enjoying life more than ever. But Kinsey is wary of this new arrival who she suspects may not be who she says she is and who could be taking Henry for a long and costly ride. As the case unfolds we learn more of Kinsey’s personal past, how her parents were killed and why her first marriage failed. These details round out her character and help the reader enjoy this independent, spunky lady even more. It is also nice to have Jonah reappear from the last book.Once again, Kinsey is almost killed once she has solved the case. It is certainly a bang-up way to end a book. Hopefully they don’t all end this way and the series becomes formulaic.This plot is a little far-fetched, but is still an enjoyable read. I like to break up my reading this way, interspersing the heavier volumes with lighter reads and I will definitely continue with the series."}, {"userName": "Quenya", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/56299073-quenya", "userReview": "So, in the first case of the series where Kinsey has a personal connection to who she is working for C is for Corpse shows us how emotional Kinsey can get when she becomes personally involved in a case. As a reader, you observe the ease and relaxed nature of Kinsey’s relationship with Bobby and it’s understandable how they became friends. I also enjoyed watching Kinsey show her anger when other characters couldn’t understand why solving this case is so important to Kinsey. My only critique of the book is the author throws out some side story information and after reading the first two, you realize there is no extraneous information given – all information in the book comes full circle. As the story progresses you are as a reader waiting for the point it all connects and you kind of wish it would hurry up. Sue Grafton continues to write Kinsey and the supporting characters like Jonah, Rosie and Henry very consistently. Not only Sue Grafton but also the narrator Judy Kaye who has developed these characters voices to the point it is easy to recognize which character voice is speaking. *Side Note* - Kinsey was definitely ahead of her time when it comes to adopting the tiny house method of living."}, {"userName": "Under the Covers Book Blog", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/35433419-under-the-covers-book-blog", "userReview": "I’m just loving these books right now. C IS FOR CORPSE is another book in the Kinsey Millhone Alphabet Mystery series by Sue Grafton. In this one, we get a little more of a gritter story. Kinsey is hired by twenty-two-year-old Bobby Callahan who has just survived a near fatal car crash when his Porsche is forced over a bridge and into a canyon. Bobby has lost a large portion of his memory, but he can’t help but shake the feeling that he knew something before and that the crash wasn’t an accident. Someone tried to kill him.Kinsey is now trying to figure out what happened before another attempt of Bobby’s life occurs. But just three days after Bobby hires her, he dies in another crash. This puts Kinsey on high alert because now she knows Bobby was right in his hunch that someone was out to get him. Now she is on the hunt to find out what was so conveniently wiped from his mind from the first crash? This is no doubt Kinsey’s most juiciest mystery yet! I’ve mentioned this before already, but I just love these books. Now I’m a Romance reader at heart, but there’s something about these Mystery novels that gets me going. I’m always trying to piece out the puzzle before Kinsey can and evaluating everyone as if I’m the PI sent on the case. It puts my brain in a different mindset and I think that’s a wonderful thing to break up the Romances that I read so much of.As I read each book, I’m falling more and more in love with Kinsey’s character. She’s definitely my type of girl, the one that’s more than capable of doing things on her own. She has this focus and determination that is admirable, because I am the same way when I’m placed with a task so I find her very relatable. Kinsey doesn’t have a smartass sidekick or a man in her life to help her when things get rough, and there’s something about that makes me respect her so much more. He intuition and intelligence is what gets her through case to case and I don’t think there are many other heroines out there that can do what she does.*Reviewed by Annie❤ ♡ Don't want to miss any of our posts? Subscribe to our blog by email! ♡ ❤"}, {"userName": "Diana", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/28386638-diana", "userReview": "I looked at this book on the shelf for I kid you not, 30 years and never thought to read it. My mother bought it from some book club or another during her Let's Explore Book Genres phase (which was awesome because I mean, how many people get the opportunity to embark on a quest to Read All The Things?) and it sat on a shelf in the house I grew up in, alongside other books I grew to know and love, but I never picked it up. I could tell you who wrote it and what it looked like because it was a beloved piece of scenery, but that's about it. A month ago, my mom gave me a huge pile of books to paperbackswap, and this was one of them. I listed it with a wistful sigh and stuck it in a box. A week ago, someone ordered it, so I pulled it from the box, and flipped through the first few pages... then I canceled the order and inhaled the book. This book now lives on my shelves permanently. Murder mysteries are not my favorite genre, but I like them well enough now and again. Published in 1986, this book seems to have been in the vanguard of tough, no nonsense badass female private investigators who drink a little too much, have hard luck backstories and no luck with men. The heroine here is a loner; terse, highly-observant, capable, and stuborn, and recovering from an injury we assume has been sustained in a previous volume. She can also be hard-headed, though she seems to know when to listen rather than speak in the service of her investigations. She's unafraid of voicing unladylike opinions and loyal to a fault. That I just told you more about her that I know about some of my friends tells you that this character was beautifully drawn.The mystery was fun(if tragic), the story was short, supporting characters believable. not all likeable. My main complaint was that the end was somewhat abrupt, but that's a very small complaint. I may not hunt down the rest of the books in this series right now, but if I ever feel the need for another murder mystery helmed by a hard-boiled female detective, I may indeed come back to it.Of note, the very 1986 references to aerobics and leotards and \"health food restaurants\" (and HA, Telex) are not so overpowering as to render the story hopelessly unrelatable, and instead serve as amusing reminders of a time before cel phones and under armour. :)"}], "description": "He was young-maybe twenty or so-and he must once have been a good-looking kid. Kinsey could see that. But now his body was covered in scars, his face half-collapsed. It saddened Kinsey and made her curious. She could see he was in a lot of pain. But for three weeks, as Kinsey'd watched him him doggedly working out at the local gym, putting himself through a grueling exercise routine, he never spoke.Then one Monday morning when there was no one else in the gym, Bobby Callahan approached her. His story was hard to credit: a murderous assault by a tailgating car on a lonely rural road, a roadside smash into a canyon 400 feet below, his Porsche a bare ruin, his best friend dead. The doctors had managed to put his body back together again-sort of. His mother's money had seen to that. What they couldn't fix was his mind, couldn't restore the huge chunks of memory wiped out by the crash. Bobby knew someone had tried to kill him, but he didn't know why. He knew he had the key to something that made him dangerous to the killer, but he didn't know what it was. And he sensed that someone was still out there, ready to pounce at the first sign his memory was coming back. He'd been to the cops, but they'd shrugged off his story. His family thought he had a screw loose. But he was scared-scared to death. He wanted to hire Kinsey.His case didn't have a whole lot going for it, but he was hard to resist: young, brave, hurt. She took him on. And three days later, Bobby Callahan was dead.Kinsey Millhone never welshed a deal. She'd been hired to stop a killing. Now she'd find the killer.", "title": "C is for Corpse\n      \n          (Kinsey Millhone #3)", "url": "http://www.goodreads.com/book/show/7323919-c-is-for-corpse", "average": 3.88, "cover": "https://images.gr-assets.com/books/1320385143l/7323919.jpg", "reviews": 1053, "authors": [{"url": "https://www.goodreads.com/author/show/9559.Sue_Grafton", "name": "Sue Grafton"}], "type": ["Mystery", "Fiction", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/7323919-c-is-for-corpse", "http://www.goodreads.com/book/show/89656.C_is_for_Corpse", "http://www.goodreads.com/book/show/15005657-c-is-for-corpse", "http://www.goodreads.com/book/show/841353.C_is_for_Corpse", "http://www.goodreads.com/book/show/12049253-c-is-for-corpse", "http://www.goodreads.com/book/show/1827858.C_is_for_Corpse", "http://www.goodreads.com/book/show/6658813-c-is-for-corpse", "http://www.goodreads.com/book/show/23899146-c-is-for-corpse", "http://www.goodreads.com/book/show/659479.C_is_for_Corpse", "http://www.goodreads.com/book/show/64863.A_is_for_Alibi", "http://www.goodreads.com/book/show/64854.M_is_for_Malice", "http://www.goodreads.com/book/show/89165.J_is_for_Judgment", "http://www.goodreads.com/book/show/64865.B_is_for_Burglar", "http://www.goodreads.com/book/show/380975.K_is_for_Killer", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}