{"ratings": 3967, "userreviews": [{"userName": "Lyn", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "City of Illusions by Ursula K. Le Guin is a part of her Hainish cycle of books. This work involves an alien traveler who has arrived in a forest region of what was once the eastern United States with amnesia. His journey across the continent allows Le Guin to describe a dystopian landscape that could compliment the future as described by Walter M. Miller, Jr’s A Canticle for Leibowitz. The book is highlighted by Le Guin’s remarkable imagination and her sparse but descriptive prose. The subject matter lags some and her vision is sometimes difficult to follow but for a fan of Le Guin this is a good read."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "A strong 4 stars. I really enjoyed this 1967 novel, set on a far-future version of Earth. A man stumbles through the forest, his mind a complete blank slate, his eyes alien, golden cat's eyes. He's taken in and taught by a small group of humans, who teach him their language and give him the name of Falk, but eventually he is encouraged to leave and go find out who he really is.And so a dangerous, cross-country journey begins. Earth is sparsely populated by humans who live very simply, reportedly enforced by a conquering group (the Shing) from another planet. But there are layers upon layers of misunderstanding and deception, and it's not clear to Falk (or the reader) until very late in the novel where the truth lies. The ending was great fun, but I really wanted to know What Happened After. And what exactly was up with the cat's eyes?While this novel works fine as a stand-alone read, it shares a history with Planet of Exile, and my appreciation for it was definitely enhanced by having read that short novel right before this one. I also had fun trying to parse out where exactly Falk was in his travels through what used to be the United States, based on clues like \"Mzurra\" and \"Arksa\" and \"Inland River.\" (Kansas, for whatever reason, has proudly hung onto its name.)More to come."}, {"userName": "J.G. Keely", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "Like the rest of the early books in the Hainish series, this one has a very familiar tone and plot. We have our isolated, alienated protagonist on his quest for one single goal through an unpredictable world which he cannot comprehend, making strangely disconnected romantic liaisons on the way, and constantly lost in thought about how human relationships are supposed to work.But of all the series, this book uses these recurrent themes in the most interesting and naturalistic ways. The first half of the book, where the post-apocalyptic theme is most prominent, is the stronger portion. LeGuin gives us many brief vignettes of our protagonist's journey across the world, each one different in tone, each one modifying the character's overall experience and giving new insight to his fundamental quest of self-discovery.Every encounter seems to reveal some aspect of the madness of humanity, but always remembering that in our mad obsessions and unpredictability lie also our wisdom, our unique experiences--something to be learned. It seems telling that LeGuin's standard character psychology of an emotionally stunted paranoid works best in a story about a complete amnesiac lost in a post-apocalyptic world of deadly dangers, but kudos to her for writing to suit her habits; it's a trick more writers should use.The dystopian aspect comes on rather suddenly and completely changes the tone of the story, almost as if each half were a separate short piece loosely connected, except that the first half does not have a conclusion without the second to cap it. The dystopia of hidden psychics bears a definite resemblance to Slan, though LeGuin's is a more subtle and practised hand.This latter arc is fairly exciting and interesting, but has less of the unique vision. Its tone of oppressive confusion is also somewhat repetitive, and might have benefited from the character actively switching between options rather than sitting inactively avoiding either one. The character does eventually come to a conclusion, but it would have helped the depth of the conflict if the character had more actively explored the sides rather than sitting and ruminating.Then again, a lot of LeGuin's conflicts play out internally as struggles within the characters' minds. This is not a bad method, but I think such conflicts play out better when such conflicts are clearly demonstrated by the character's actions and patterns of speech and behavior, bolstered here and there by a thought, rather than descending entirely into the character and leaving the plot behind for the period of digression.But despite these caveats, I found this the most varied and imaginative of LeGuin's books, with a truly engrossing combination of verisimilitude and hallucinatory imagery from the cusp of madness. I look forward to more LeGuin in the future, especially if this work is an indication of her evolution as a writer, who here seems almost to have found her ideal voice, if sometimes fleetingly."}, {"userName": "Zanna", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "[Their city, Es Toch, is lifeless; its description reminded me of London's giant shopping malls, which very quickly sap all my morale and give me a sick headache with their soullessness. It is a shopping mall designed by Gaudi perhaps: gaudy, sumptuous, unwholesome in its sterile decadence.Zove was right that Falk was an intelligent man before his mind was 'razed'. The section where he regains his memory as Ramarren could be excruciating, since the character we have been relating too has been forcibly excised, but Ramarren is a powerful mind able to respond to the crisis. However, the true brilliance of the ending is that Zove and Parth become heroes as the personality they have cultivated, Falk, is indispensable to Ramarren. Le Guin affirms both personalities: the mature and disciplined, highly trained and educated adult of the rigid, hierarchical, scientific society, and the impulsive, childish mind nurtured by cultured, sophisticated, cautious exiles hiding their anarchic enclaves in the forest, lost to time. (hide spoiler)]"}, {"userName": "Jim", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "[- Dropping Orry's bracelet into a gorge. Why not just drop it on the path & walk on a ways?- Falk not knowing what he wanted to tell Orry, deciding on 'Read the first page', giving in & THEN he finally figures out how to make the pages work. His telepathic capabilities were just too poor, especially considering how he regained his memories & how powerful he was at the end. It just doesn't make sense.- The line, \"you didn't commit suicide\" was way over the top. - 'These are the exact same settings used to raze your mind' was never brought up as proof of lies.  (hide spoiler)]"}, {"userName": "Cristian", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/9493520-cristian", "userReview": "Interesanta.Multe descrieri de locuri, de personaje, de ginduri.Cartea este compusa din 3 povesti care se leaga pe o durata de citeva mii de ani.Are ceva actiune, te pune pe ginduri, te face sa cauti diverse scenarii.E ok."}, {"userName": "Emily", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/1353392-emily", "userReview": "A man wanders out of the forest with a severe case of amnesia. The locals take him in and try to teach him their ways, as it is obvious that he is not of their world. When he has learned all he can from them, he must set out across the vast continent toward the city of Es Toch, hopefully to figure out where he came from, why he is there and what happened to his memory. The most important lesson imparted to him from the forest people is to trust no one, particularly the Shing. Three quarters of the book tells of this man’s journey to Es Toch, and as such is a sort of average questing tale with friends and foes along the way. It is up to our hero to figure out which is which. The ultimate answer he seeks is quite the interesting revelation, as is also what happens after he figures this out. For me, the book really didn’t get good until that final part, and the rest was fair to average. I wish we could have skipped a hunk of the journey and gotten more of the what-happens-next as the ending is just a tad abrupt. Very evocative writing, though, throughout."}, {"userName": "Mitticus", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/4765800-mitticus", "userReview": "[\nEl concepto total de restricción era fundamental en la cultura wereliana, y la estratificación de la sociedad wereliana estaba regida por la convicción de que el conocimiento y la técnica debían de permanecer bajo control inteligente. Detalles, como el Verdadero nombre del Sol eran formales y simbólicos, pero el formalismo se tomaba en serio... con seriedad trascendental, pues en Kelshy el conocimiento era religión, la religión conocimiento. Para conservar los intangibles lugares santos en las mentes de los hombres se habían inventado defensas intangibles e invulnerables. Excepto que se encontrara en uno de los Lugares de Silencio y fuera interrogado de cierta manera estipulada por un iniciado de su propio Nivel, Ramarren estaba totalmente incapacitado para comunicar, de palabra o por escrito o telepáticamente, el Verdadero Nombre del sol de su mundo.\n\n(hide spoiler)]"}, {"userName": "Cynamonka", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/4150341-cynamonka", "userReview": "Właściwie to mocne 4,5. Ta książka zostawiła mnie z potężnym uczuciem pozytywnego niedosytu i bardzo chciałbym wiedzieć \"co było dalej\". Ba, bardzo mnie zafascynowało to, jaka kultura rozwinęła się na Werel po \"Planecie wygnania\". Naprawdę polubiłam głownego bohatera. I nie wiem czemu, ale Dom Zove bardzo kojarzy mi się z Rivendel."}, {"userName": "Davut", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/45654881-davut", "userReview": "Oldukça sürükleyici, her seferinde beklediğimi aldığım, alıştığım LeGuin tarzı bir hikaye daha. Werelli Ramarrenin Dünyalı Falka dönüşümü ve sonunda Falk-Ramarren olarak Werele dönüşü. Sıkılmadan okudum."}, {"userName": "Charles Dee Mitchell", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/2272557-charles-dee-mitchell", "userReview": "Other reviewers emphasize that there is no need to read La Guin's Hainish series in any particular order. But I do not know what I would have made of City of Illusions had I not read Planet of Exile first. When this novel came out, there had been three Hainish novels published in two years, and so readers did not have the eight novels we have now to choose from. It's more likely that readers came to this work with the first two under their readers' belts. Writing about City of Illusions opens up the field of possible spoilers, but they are spoilers in reverse related to a previous novel. Does any of that make sense? Well, after all, the book is titled City of Illusions.Le Guin brings us back to Terra for this story. The hero staggers naked and filthy out of a forest, his mind a blank and his eyes amber as a cat's. He stumbles into the clearing of the House of Zove, and we cannot appreciate his luck until we encounter with him much less savory remnants of humanity later in the story. These clannish people care for him, educate him, and incorporate him into their social world. They name him Falk, a reference to his amber eyes. But questions remain. Is he human or alien? The eyes are problem and his five-year relationship with one of Zove's daughters remains childless. This sterility with a human argues for his own alien origin. Zove dismisses him from the house, sending him west to the Es Toch, the fabled city of the Shing, the Enemy who now hold dominion over Earth. The novel is Falk's journey west, across a North America we recognize by geographical landmarks and traces of a civilization wiped out a millennium before. The people he meets may be kind or cruel, savage or delusional. His quandary is his knowledge that while knowing he can trust no one he knows he must constantly trust some one to go further on his quest. When he reaches Es Toch, the matter is further complicated by his encounter with the Shing. Are they the humans they claim to be or the intergalactic raiders he suspects them of being. As in all Le Guin's novels, telepathy, or mind speaking, plays a role. It is an honored, direct means of speaking truthfully and intimately with another. Falk suspects that the Shing have mastered mind lying.This is a novel about power and what people, or aliens, are willing to do to acquire it and hang desperately onto it, whether they control a clearing in the forest or an entire planet."}, {"userName": "David (דוד) ", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/5431286-david", "userReview": "A decent book. Great imagination of imagery, surroundings and ideas; loved this part the most. Liked the first half more than the other. Bleak dystopian landscape. Various factions of Terrans displaying different expert abilities, was nice. Interesting ideas, like Mindspeech, Talking animals (a slightly disturbing idea), lying and mind-lies, etc. Overall story was okay/good. The journey of the Quest was interesting. Perhaps not amongst one of Le Guin's finest books.A one-time-read certainly recommended. :)"}, {"userName": "Arax Miltiadous", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/4945472-arax-miltiadous", "userReview": "\" στα χρόνια που ταξίδευαν ανάμεσα στα αστέρια,ποιος ήταν ο ονειρευόμενος και πιο το όνειρο?\"Πολύ μου άρεσε το βιβλίο αυτό. Οι περιγραφές της Le Guin τόσο πλούσιες και περίτεχνες που με βάλανε εντελώς μέσα στο βιβλίο. Δηλαδή πραγματικά, έβλεπα τα κίτρινα γατίσια μάτια του Φαλκ να με ακολουθούν παντού και νόμιζα πως όλοι μου λέγανε ψέματα.Τι είναι ψευδαίσθηση τελικά αν όχι η παρερμήνευση της πραγματικότητας? Συνιστώ ανεπιφύλακτα.Υ.Γ: ΑΛΛΟ ΕΝΑ ΕΥΣΤΟΧΑ ΕΠΙΛΕΓΜΕΝΟ ΒΙΒΛΙΟ ΤΟΥ ΑΥΓΟΥΣΤΟΥ."}, {"userName": "Arnis", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/6257859-arnis", "userReview": "https://poseidons99.wordpress.com/201..."}, {"userName": "Kat  Hooper", "userReviewDate": "Oct 25, 2011", "userURL": "http://www.goodreads.com/user/show/2177891-kat-hooper", "userReview": "Originally published at FanLithttp://www.fantasyliterature.com/revi...“You go to the place of the lie to find out the truth?”Ursula K. Le Guin’s HAINISH CYCLE continues with City of Illusions, which I liked better than its predecessors, Rocannon’s World and Planet of Exile. City of Illusions takes place on Earth sometimes in the far future after an alien invasion has killed off most of the people and has completely changed the Earth’s ecology, infrastructure, and geopolitical arrangement. There’s a large capital city run by an alien race called the Shing, but most of the humans are spread out and divided into small clusters in the hinterlands which have gone back to their natural state after Earth’s cities were destroyed. While there are futuristic technologies in the capital, the rest of the people live off the land without technological help and with only occasional glimpses of the advanced society that their ancestors knew before it decayed.To prevent takeovers, the Shing do not allow the people to organize or even to communicate over long distances. If anyone attempts anything that threatens the government, they are arrested and, since the Shing do not allow the taking of human lives, they are “razed,” meaning their memories are wiped out. To keep humans subjugated, the Shing also use their powers to cast illusions and to lie with their minds, which is why their capitol city is called the City of Illusions.Our story begins as a man with cat-like eyes wakes up in the wilderness and doesn’t know who or where he is. In fact, he doesn’t know anything — his mind is blank. His only potential clue is a gold ring he wears which tells him that he once belonged somewhere. When a wilderness family takes him in, they name him Falk and teach him how to be a man again (if he ever was a man — his eyes suggest at least some non-human genes). After several years, Falk decides to set out for the City of Illusions to find out who he is. Along the way he meets other types of people, experiences different cultures, and has some scary adventures. By the time he gets to the city, he has made a new life for himself, has made friends, has fallen in love, and has learned a lot about the world he lives in, but not any clues about himself.When Falk meets the Shing in the City of Illusions, he discovers who he is, but he learns that he must choose between his old mostly unknown life and the new life he has been living for several years. He also learns that the aliens have a different story about what happened to Earth than the stories he has previously heard. It’s not easy to separate truth from lies or to know who can be trusted. Falk has some major dilemmas to resolve and some major choices to make.The setting of City of Illusions — America’s ruined cities being gradually overtaken by forests — is appealing (reminds me of Gene Wolfe’s NEW SUN books) and so is Falk (especially when we find out who he is) who is developed better than the protagonists in the previous HAINISH CYCLE novels. It helps that Falk doesn’t need a backstory, so we’re not really expecting much there. Unfortunately, none of the other characters are particularly engaging and the villains seem inconsistent (e.g., their insistence that life is sacred doesn’t fit with their other beliefs and actions), but I enjoyed Falk’s travels and dilemmas nonetheless and I liked the ambiguous ending and how this story fills in some information we were left wondering about at the end of Planet of Exile. City of Illusions is short and fast-paced with Le Guin’s usual economy of words which I’ve always admired and which becomes more appreciated the more epic fantasy I read.I listened to Blackstone Audio’s excellent production narrated by Stefan Rudnicki. City of Illusions refers to events that occurred in Planet of Exile and is sort of a sequel. It’s not necessary, but it’d be helpful to read that book first."}, {"userName": "Brian", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/1938805-brian", "userReview": "Le Guin is a master at taking a workaday story of a protagonist suffering from acute amnesia (sound familiar?) and turning it into a focused think-piece on self awareness and discovery of who we really are. It took a long time in the narrative to get to the core premise, but when it was revealed, it made me put the book down for a minute to really contemplate Le Guin's theme.In one of Joan Didion's essays she opines, \"We are well advised to keep on nodding terms with the people we used to be - whether or not we find them attractive company.\" As we age, and our memory of our former selves goes through a constant revision, it can become difficult to relate to that other manifestation of ourselves. So if we have all the memory of our old self removed, and we are told by a third person about the individual that we used to be (and that \"person\" sounds like someone we wouldn't necessarily like) - how do we know who we really are, anyway? Is this starting to sound like The Fixx's song \"Are We Ourselves?\" I'm feeling that, too. So I suggest reading this short book, enjoy where Le Guin takes you on the introspection, and then watch this old-school video and remember where your old self was when you watched it for the first time:http://www.youtube.com/watch?v=mP8Pe8..."}, {"userName": "Darwin8u", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"There's always more than one way towards the truth. Strap yourself in.\"- Ursula K. Le Guin, City of Illusions\"Truth, as ever, avoids the stranger.\"- Ursula K. Le Guin, City of Illusions'City of Illusions' is the third book in LOA's  Ursula K. Le Guin: Hainish Novels and Stories, Vol. 1. It was originally published in 1967. It has two main narrators Falk and Ramarren. It is infused with anthropology, philosophical speculations on the nature of truth, time, lies, patterns, knowledge, mortality, isolation, the alien and the self. It is also heavily influenced by Taoism (Thurro-dowism; the Old Canon).The book started off probably a 3-star book. A bit slow, heavy, unwieldy. But the last couple chapters were definitely 5-stars. Perhaps, it is just my preference for the philosophical twistings and lint-picking that happens at the end: the explanation and unwinding of the story. Who knows? I also rather liked the taoist chessplayer aspects; mind-against-mind, playing for worlds.**I'm being purposefully opaque here not wanting to give away the ending."}, {"userName": "Zübeyir", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/34288023-z-beyir", "userReview": "Uzak gelecekte geçen bir benlik arayışı macerası, sürükleyici bir yol hikayesi. Yalın, durağan ama merak uyandırıcı. Le Guin severleri tatmin edecektir. Le Guin'in yazdığı üçüncü roman. Hainish'e dahil ama kurgusal evren henüz Hainish ismiyle anılmıyor. \"Dünyalar Birliği\" var burada. İlk üç kitapta Hainish vurgusu yok zaten. Hainish ve/veya Ekumen sonradan kavramlaştırılıyor ama aynı şey aslında.Çok şart olmasa da okuma sırasına dikkat etmek iyi olur. Yanılsamalar Kenti'nde özellikle Sürgün Gezegeni'ne yönelik anlamlı göndermeler mevcut. Hatta bu kitabın tabanını onun oluşturduğunu söyleyebilirim. Bu nedenle Rocannon'un Dünyası, Sürgün Gezegeni, Yanılsamalar Kenti sıralamasıyla okunması daha anlamlı olacaktır. Ayrıca daha önceden Bağışlanmanın Dört Yolu okunduysa oradaki Werel Gezegeni'yle Sürgün Gezegeni ve Yanılsamalar Kenti'ndeki Werel gezegeni farklı gezegenler."}, {"userName": "Mazzy", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/9522514-mazzy", "userReview": "[Earth being colonized by an alien race, about deception, manipulation, and control (hide spoiler)]"}, {"userName": "Vladimir Ivanov", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/15584153-vladimir-ivanov", "userReview": "Неожиданно Вэнсовский роман, где потерявший память молодой герой путешествует по потерявшей память древней планете, которой правят то ли анонимные пастыри, то ли тайные тираны, и за каждым лицом прячется маска, и каждая фраза скрывает интригу.Очень неплохо, но совсем непохоже на ту Ле Гуин, которую мы все знаем и любим."}, {"userName": "Zeynep Atakır", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/25797663-zeynep-atak-r", "userReview": "İyi ki okumuşum seneye bir daha okuyacağım 😇"}, {"userName": "Samantha", "userReviewDate": "Aug 13, 2013", "userURL": "http://www.goodreads.com/user/show/18432982-samantha", "userReview": "City of Illusions was my favorite of the trilogy (Rocannon's World and Planet of Exile.) Like the others, it's about a journey of sorts, and starts off slow and gradually builds in intensity. But to me it was also the most mature work of the three, dealing with themes of illusion, dissolution, and dystopia. We begin with a madman, or child-man, in the woods who has no memory of his past, and who is taken in and cared for by a forest family. After he recuperates, the patriarch of the family has an inkling that this yellow-eyed stranger has a Destiny to fulfill, and indeed he does. Setting off across what is probably a dissolved and broken USA, he seeks the city of Es Toch, the capitol of humans' enemy, the Shing.In other reviews I've seen some discussion that Le Guin's characters are not relatable or likeable, and that they bear some resemblance to LotR. Indeed Tolkein wrote in much a similar style of emotional distance, and like countless other stories, the Hero's Journey is reenacted here (see Joseph Campbell for a fuller discussion). But I also think that the fact that you have to scratch under the surface for the characters' emotions makes it more interesting, not less. And for me, the formalism lends the story an epic quality, almost more high-fantasy than sci-fi.Le Guin's best work? Likely not. There's a reason The Left Hand of Darkness is the classic. But definitely worth a read. Like the other Hainish cycle novels, this one can be read as a stand-alone for those not wishing to toil through Rocannon's World or Planet of Exile, which are certainly less polished."}, {"userName": "Josh", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/844382-josh", "userReview": "Ursula Le Guin sure is interested in putting people from an advanced civilizations into primitive ones and seeing how they deal with a radically new set of customs. But she's such a fantastic writer, and is exceptionally good at using these situations to examine multiple cultures at once. City of Illusions changes things up a bit from the first two books in there is also something of a mystery element: our protagonist actually may or may not be from an advanced civilization. We don't know, and neither does he, because his memory's been wiped. He's resultingly more sympathetic than his counterparts in the earlier novels, and I came away definitively sadder for him. He has very little control over all the forces affecting him (and wow does he have to go through a lot of crap) and he just wants to be home, only he's not sure where that is. Wraps up the third of three books in a \"Three Hainish Novels\" omnibus. Not a trilogy really, though set in the same universe (with later books making tangential references to the earlier), and similar in tone and themes. Really enjoyed the three as a whole, and each in turn. Very worthwhile to have filled out my Le Guin reading."}, {"userName": "Panagiotis", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/11994371-panagiotis", "userReview": "The book ''City of Illusions'' was a really nice surprise for me.Small in size,very easy to read and with a very interesting main character,the book has a really good pace and a lot of suspense.The fact that the Shing race' domination on Earth was based not in weapons but in their extremelly unique ability to play mind games and lie,made the main hero's task extremely difficult.However once more Le Guin's ability to make her heroes outreach their problems and triupmh,not through violence but mostly through self awareness and completion,appears in this book once again.Once more, Le Guin shows us that faith,awareness,wisdom,sincerity and believing in your self are virtues that help you find your way in the dark."}, {"userName": "Pyza Wędrowniczka", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/50868920-pyza-w-drowniczka", "userReview": "Po dwóch pierwszych powieściach z cyklu Hain czytelnik myśli sobie, że wie, czego może się spodziewać. A jednak, chociaż osnute wokół podobnych wzorców fabularnych, „Miasto złudzeń” rozbija to nastawienie. http://pierogipruskie.blogspot.com/20..."}, {"userName": "Elizabeth", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/8287397-elizabeth", "userReview": "Beautiful writing (as ever) but not quite as compelling as some of her other works."}, {"userName": "Amelia", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/65403736-amelia", "userReview": "[ When Falk reaches his destination he is betrayed by the woman who led him there, beaten, and again kidnapped by the \"Enemy\" he has been warned about over and over. I suppose Falk's naïveté in trusting the woman and again allowing himself to be captured is meant to follow from his limited life experience, as he still only remembers the previous six years. However, he has been through a lot in the journey and it just doesn't make sense that he should be so naive. The last part of the book, after he had been captured, was completely disjointed from the rest. The tone and subject matter changed, and it really had no connection to the beginning of the book at all. Falk all of a sudden became responsible for saving two planets, Earth and his own, and had to figure out how to do so while saving his own life. He could have saved the planets by committing suicide, but that did not occur to him although another character pointed it out to him afterwards, when it was too late. I found that really strange, as it would have made a fitting end to the story if Falk had sacrificed himself. Instead there was a cockamamie \"best possible scenario\" ending which honestly was not believable.  (hide spoiler)]"}, {"userName": "Juushika", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/616321-juushika", "userReview": "A man awakens without memory in an enclave on far-future earth, and sets out to discover his origins. That section--the slow journey through various dystopic human settlements--is this book's weakness: none of the settlements are especially convincing, and as satisfying as Le Guin's travelogues are (and they are; her descriptions of natural landscapes and the solitude of travel are precise and immersive) the plot here stagnates. But the end comes together beautifully. It's an introspective book--the most significant developments occur within the protagonist's mind, as he considers his situation, life experience, identity--but the results are profound, clever, and tie nicely into the series's shared universe. It rewards active engagement and it's a satisfying testimony to Le Guin's strengths; a lesser author couldn't make that interior narrative so compelling, but Le Guin excels at the personal ramifications of speculative concepts. A pleasure to read; I recommend it."}, {"userName": "A Librería", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/56673098-a-librer-a", "userReview": "Este universo del ciclo de Ekumen me ha recordado vagamente a la Tierra Media de Tolkien, aunque sea muy diferente en temática, pues Le Guin crea un mundo propio muy rico en detalles y con toques de fantasía. Las costumbres de la gente, sus maneras de hablar, de relacionarse, de vivir en definitiva; están muy logradas y desarrolladas en sus obras. Algo en su manera de narrar me evoca a esas novelas de fantasía con magia, hechiceros y héroes. La propia personalidad de Falk parece sacada de un libro de caballerías o una ópera espacial de la era dorada de la ciencia ficción. Se trata de una mezcla arriesgada entre elementos del futuro y del pasado con la que, en mi opinión, se crea una historia fascinante.Crítica completa en: https://alibreria.com/2017/03/28/crit..."}, {"userName": "Septimus Brown", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/49894850-septimus-brown", "userReview": "The League of All Worlds has fallen to the devious Shing--an alien civilization with the ability to lie in mindspeech, but that forbids killing. The Shing have relegated humanity to small, isolated populations with limited technologies. That, at least, is what Falk is told by the Terrans who rescue him, naked but for a gold ring on his finger, and wandering the far-future forests of Earth with his mind all but erased. Falk must set out to discover who he is and why his memories were razed. In doing so, he must also confront the truth of what happened to this planet, and what the implications are for his own people.I recommend reading this after Planet of Exile. They are both great books, and though the plots and characters are unrelated, there is a long-term chronology at work here. The reveal of what has happened within the Hainish Universe works best in this order."}], "description": "Scattered here and there, small isolated groups of humanity lived in a state of semi-barbarity. Lost were the skills and science, the knowledge that had been Earth's in the golden age of the League of Worlds. ~ ~~ ~ Each time a colony of Earthmen began to stir the ashes of half-forgotten technology, the Shing, mindlying ravagers of Terra, would crush them like insects. ~ ~~ ~ Only one man dared to stand against the Shing's hunger for Earth conquest, and that man - the alien with the amber eyes - would first have to prove to a lie-tormented humanity that he himself was not a tool of the enemy!Cover Artist: Alex Ebel", "title": "City of Illusions\n      \n          (Hainish Cycle #5)", "url": "http://www.goodreads.com/book/show/7939266-city-of-illusions", "average": 3.83, "cover": "https://images.gr-assets.com/books/1391116626l/7939266.jpg", "reviews": 320, "authors": [{"url": "https://www.goodreads.com/author/show/874602.Ursula_K_Le_Guin", "name": "Ursula K. Le Guin"}], "type": ["Science Fiction", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/7939266-city-of-illusions", "http://www.goodreads.com/book/show/201889.City_of_Illusions", "http://www.goodreads.com/book/show/1598015.City_of_Illusions", "http://www.goodreads.com/book/show/12184492-city-of-illusions", "http://www.goodreads.com/book/show/30353059-orasul-iluziilor", "http://www.goodreads.com/book/show/25970097-ciudad-de-ilusiones", "http://www.goodreads.com/book/show/7134037-miasto-z-udze", "http://www.goodreads.com/book/show/13342441-yan-lsamalar-kenti", "http://www.goodreads.com/book/show/17159562", "http://www.goodreads.com/book/show/6365932-la-ciudad-de-las-ilusiones", "http://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "http://www.goodreads.com/book/show/13667.The_Farthest_Shore", "http://www.goodreads.com/book/show/18423.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/13662.The_Tombs_of_Atuan", "http://www.goodreads.com/book/show/13651.The_Dispossessed", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}