{"ratings": 7818, "userreviews": [{"userName": "Glenn Sumi", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "One of the best Canadian novels of the millennium (so far!)When it was published in 2001, Clara Callan swept Canada’s book awards, including the Governor General’s Award and the Giller Prize (a feat I don’t think has been duplicated). No wonder. This novel is that rare thing: a literary page-turner.It tells the story of two Canadian sisters living vastly different lives in the mid-1930s: the eponymous, 30-something Clara is a schoolteacher in a small Ontario town (about two hours from Toronto), and, as the book begins, younger sister Nora heads down to New York City to enter the exciting new world of radio acting.The book consists of letters – mostly between the two siblings – as well as Clara’s diary entries. Clara, living alone now that her school principal father has died, has a poet’s eye, and her observations about life – her reading, her attempts at poetry, her unmarried state (she calls herself a “spinster”), the gossiping neighbours, the stern new minister, her students – are astute; Nora, despite her glamorous environs, is much more conventional, but also hard-working, kind-hearted and devout.As Nora climbs her way up the industry, starting with ads and minor voice roles until finally landing a lead in a day-time radio soap opera, Clara’s life remains relatively uneventful – with one exception. A single event affects the rest of her life. There’s a strong sense of place, from the claustrophobia of small-town life (all those neighbours peeking through curtains, listening in on party line phone conversations) to the chilly anonymity of urban life. We get the sisters’ comments on events, from things like the Dionne quintuplets and the movies of the day to more profound shifts, like the lingering Depression and the lead-up to World War 2. The unrest in Europe comes into sharp focus when Nora and Clara visit Italy and two events – one brutally violent, the other quite lovely and inspiring – stick out.And there are some vivid, memorable characters, including a feisty, lesbian scriptwriter named Evelyn Dowling, and a pompous, Edmund Wilson-type essayist whom Nora dates for a time. Clara meets a man, too, but I don’t want to say anything about him, because the way they meet – and the arc that relationship takes – needs to be discovered by you.There’s no real plot, to speak of. The things that occur are things that happen in any town, big or small, or to any person, famous or not, but that often go unnoticed. So, too, people like Clara Callan tend to go unnoticed. The unmarried schoolteacher.* Plays a bit of piano. So proper, so presentable. You think you know her. You don’t. But thanks to Wright and this beautifully written, humane and richly textured novel, now you can begin to imagine her depths.*Canadian readers will also recognize Margaret Laurence’s Rachel Cameron (from A Jest Of God) in this archetype."}, {"userName": "Megan Baxter", "userReviewDate": "May 14, 2013", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "I very much enjoyed this book. It mixes diary entries with letters in a hybrid epistolary novel, but does it very well. I complained because Jo Walton's Among Other was in a diary format but didn't use it as well as I would have liked. This is how to do it well. There is a narrative here, related by Clara to her sister, Nora, her friend, Evelyn, or, much of it, to herself alone. And it is compelling.Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Iris P", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "Clara CallanGreat story-telling and characters, love the historical background and the strong but complicated female characters.Couldn't stop listening to this audiobook and the journal entries/epistolary structured works very well in audio.Highly recommend it if you are looking a well written historical fiction that's also a page-turner."}, {"userName": "Bethany", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/4314582-bethany", "userReview": "As I mentioned, I had mixed feelings about this one... The beginning was great; I was enchanted! Clara Callan, the main character, was a poetess and I quite identified with her and the way she viewed life. I was delighted with the letters sent between the two sisters and I liked the contrast of the two voices: the reserved, pensive voice of Clara and the more exuberant one of Nora.Actually, I spent almost the whole book thinking I really liked Clara and Nora, but by the end I realized my feelings of endearment had faded and I was left with a sense of disappointment and confusion.Possible reasons for disappointment: I was sorry to see religion and religious people portrayed in such a poor light, and I was also sorry to see the almost double standards concerning abortion. I hesitate to use that phrase, though: it's a tough (and saddening) subject - plus, I'm not sure the phrase can be used that way, but it was the only way I could think of putting it.I originally identified with Clara, but eventually I noticed that she seemed to often focus on and return to sordid things. The way she recounted her own experiences and various other stories came off as a bit morbid and made me feel a little uneasy. (Of course, I was already on edge when I started reading because I had just had a traumatic experience that started with a CorningWare dish and ended with seven stitches. But that is another story...)The characters. Did they develop? I'd have to say no, they didn't. They kept lackadaisically wandering (and stumbling) through life and didn't stop until the text ended... Which leads to possible reasons for confusion: Was there a point to all this? (The book, that is. Not the review. I know there's no point to this review.) I don't need a definite conclusion at the end of a book, but when the characters and plot are stagnating and my smile has faded I want something definite! The bottom line is, while I did enjoy reading [most of] this book, it did not satisfy me like I had hoped it would."}, {"userName": "Bonnie", "userReviewDate": "Aug 14, 2008", "userURL": "http://www.goodreads.com/user/show/1424859-bonnie", "userReview": "Originally borrowed from the library. Loved the book so much, I bought my own copy. I'm not alone: it won 5 prizes, two of which were the GG's Award for Fiction & the Giller Prize."}, {"userName": "Friederike Knabe", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "Clara Callan, the protagonist of Wright's novel, is a small town spinster in the 1930s. She lives a reasonably comfortable life thanks to the inheritance of her father's house and a job as a local schoolteacher. Through her diary entries and exchanges of letters, mainly with her more glamorous younger sister Nora, Clara reveals herself to the reader. Wright has created a believable character that \"grows on you\" as her personality emerges little by little. Life's difficulties during the Depression years, in particular for a single woman in rural Southern Ontario become apparent through the description of daily events. However, a very dramatic personal incident and its aftermath force Clara to confront her new circumstances in a very direct manner. While she was accustomed to express her daily experiences and reflections in poems, events interfere and poetry becomes impossible. She recognizes \"how suddenly a life can become misshapen, divided brutally into before and after a dire event.\" Her beliefs are challenged and so is her self-contained whole-ness as a person.Clara's personal story is embedded in the realities of the mid-thirties where unemployment is rife and poverty spreading. Although at the periphery of the main thrust of the book, Wright alludes to the emerging pre-war anxieties. He touches on the contrasts between city and rural living, utilizing Clara's reluctance to accept such innovations as the telephone, as an example. Yet, the regular Saturday trips to Toronto, perceived by her as a necessary escape from the village, lead to a new, important phase in her personal development, giving her also a new taste of independence. She visits her sister in New York, although in rather difficult time in her life. Cleverly, Wright lets her visit pre-war Italy as a third party to her sister's vacation. It allows the author to add impressions of the growing political conflicts in Europe as a backdrop without losing the focus of the story.The counterweight to Clara is Nora, who could not bear small-town Ontario and leaves for New York to \"make it in radio\". She becomes successful as a radio voice in daytime \"soaps\" and her personal life seems to take on some aspects of a soap opera itself. Nora is privileged in finding a solid rock in a glamorous female friend, Evelyn, while her on and off affairs are far less successful. Clara, always concerned about her sister and her superficial lifestyle, attempts to remain the firm family base for her sister, but her own life story places her more and more on a shaky ground. She finds advice and empathy through her correspondence with Evelyn.Clara Callan is a very engaging story indeed. Wright successfully places himself into the mind of a woman: Clara's personality quietly and gently takes hold of the reader as one follows her in the exploration of the multifaceted realities of her time and place."}, {"userName": "Shélah", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5833458-sh-lah", "userReview": "FYI: This edition of the book actually has over 400 pages, Goodreads.I didn’t feel this was a strong novel. I wanted to like it (truly), but I just couldn’t care. The characters were largely underdeveloped on the page, and the forward motion was jumpy and jarring. The set-up was also poor with no real conflict until 50 pages in. Additionally, people raving over Wright’s ability to write women well is exaggerated: any man can write women just as any woman can write men, and there was nothing astonishing about any of his representations – I actually found Nora to be far too flighty to be taken seriously, and his propensity to have Clara be sentimental and not say anything in order to appear non-sentimental was just bizarre.I was happy that he didn't linger over her abortion - too many people sit around thinking that all women regret such things. But. It was just as annoying for her to have zero reaction to it. Perhaps it wasn't unrealistic, but one would think she would think about it and have SOME feeling towards it. The rape was also bizarre: who is brutally raped in a field and goes home to journal about it IN DETAIL?! I can't imagine, although maybe it's possible. I think it would have been more poignant to not have that scene, and for us to only suspect the circumstances surrounding her pregnancy given what she had says in later entries until the year anniversary where she \"writes\" Charlie a letter. I think that ultimately, I found this story unbelievable, and the jacket did not accurately describe the novel, so my expectations were far from filled. This is not a story about the 1930s - you barely notice the depression, and most of the other events are piteously underrepresented. It could have happened today. Perhaps this is part of the appeal for some, but I just found it sloppy and dull."}, {"userName": "Roisin", "userReviewDate": "Jan 15, 2008", "userURL": "http://www.goodreads.com/user/show/39856-roisin", "userReview": "I did enjoy this book. It was an easy, page turner that really didn't need any thinking about. Yet another book that I would never have picked up myself but was sent as a present.However I really struggle to see what the author was trying to convey in the novel. In many ways it seems haphazard and completely lacking in direction. There is no build up and not really even a proper ending. I can see how this [and seemingly mundane details such as details of trips to the dentist] makes it all the more believable as a collection of diary entries and letters but I just don't understand why you would write the two most dramatic events of the novel into the first quarter of it leaving the reader amused but floundering for the remaining duration.Without meaning to sound preoccupied with gender, what interested me most about this novel was why a male author had chosen to write such an explicitly feminine novel. All the voices apart from one are female and, although it is not PC to say so, so are the areas of interest. Don't get me wrong, he does feminine incredible well but I was intrigued.Nice though it is I found this book completely un-exceptional. Struggling to see why it won the prizes it did."}, {"userName": "Marlee Pinsker", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/648562-marlee-pinsker", "userReview": "My library copy of Clara Callan came with the wavy pages of water damage and the cracked spine of heavy usage. While I read the book I felt I was sharing the experience with the people who had read it before me.Since there are many summaries of the book already written I will skip going over the details and just say this:A woman is raped, and that experience implies hurt, long lasting damage, and cries out for redress in some way. A pregnancy results. I was sad for her and quite anxious that she find a way to set her life right. Clara's subsequent life journey is about her own individual response to this crime, with the options afforded her by the society she lives in. It is told calmly, for the most part, through letters and journal entries, but it is anything but dry. I felt deeply involved and sympathetic. At the same time, I was surprised by how well Clara kept her life secrets. My surprise was confirmed by her daughter's comments at the end.What do you say about a woman who writes that she wants to share all the truths of her life with her tiny baby, but whose baby grows up and reveals that her mother was so secretive that she never finds a time to share the most basic facts of her former life? The sweet fact to me was that there is a lesbian character in the book who is always lonely, and her solitary life is redeemed by the last sentence of the book. It pulled it together for me. The book needs that afterword and in that sense, it is not an after word but the real ending of a beautifully imagined book."}, {"userName": "Allegra Swanson", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/5952080-allegra-swanson", "userReview": "\"Clara Callan\" by Richard B. Wright was a fantastic read for my recent trip to Whitehorse. I had been dying for some uninterrupted reading time for a while now, and it was the perfect length, (415 pages), to fly me to Vancouver, distract me through my 3 hour layover, then fly me to Whitehorse. No - I wasn't finished when I got there, but I was close, and that's because this Giller prize winner is hard to predict.(I included the cover above that I wish I had for my book. Mine was unfortunately more dowdy.)This story takes place in the thirties, and follows the lives of Clara and Nora Callan in small town Ontario and New York, respectively. Clara is a somewhat of a reserved school marm who teaches at the local two-room school house. She lives in her recently deceased father's home and finds joy in occasionally playing the piano. Nora, on the other hand, has just moved to New York and begun a career as a radio actress. The two sisters' lives couldn't be more different. The story is told through a series of letters, much like \"The Guernsey Literary and Potato Peel Pie Society\", if any of you have read it. (Those who haven't, should. It is a quick read that's extremely difficult to put down.) Throughout the book, I found myself enjoying what I was reading yet always wondering when the real story was going to begin; when something was going to happen that would engulf the lives of the two sisters and change them forever. It was only when I read the final pages of the novel that I realized that had happened, but in much less of a traditional way than I thought.In addition to the story being told through letters, Clara also writes in her diary, which shows up intermittently between the letters and really helps us to get to know our narrator. Above all, Clara is honest. She wants to be more modern, more forward-thinking, yet she finds it difficult when she feels she has already been pigeon holed by her small town to fill a certain roll in her community of somewhat of an outcast. There's a story arc part way through this book that makes me want to write this sentence in this review: \"Then something terrible happened that changed Clara's life forever...\" but I can't really do that. Though there is a seemingly life-changing event, I feel as though the book continued on at its homely pace. I don't think of that as a bad thing, but I wouldn't exactly describe \"Clara Callan\" as a page turner. I will say, however, that the language used is right out of the thirties in not only the vocabulary, but also the tone, and the sensibility of women towards certain issues, which I not only noticed, but really appreciated.No, this wasn't the best book I've read so far on my Canada Reads top 40 list, but that doesn't make it any less special. As they say in the Wizard of Oz, \"Clara Callan\" is \"a horse of a different colour\". I was reading and reading and waiting for the real story to start and when it never did, I realized, as I did about \"Galore\", that the main story isn't about something happening. It's about people existing. I mean, when you think about it, isn't it always? Stories exist to prove a point that certain people existed - had certain experiences. \"Clara Callan\" isn't a Dan Brown novel , but rather a slice of life. Again, it was one of those books that once I turned the last page I thought, \"Oh. Right. That's totally it.\" Wright made me take a step back and remember that stories didn't need to be driven by unbelievable plot lines and intense action, but human experience. There are some really touching moments in \"Clara Callan\" that make it a must read for me. That and the fact that you can practically hear her sister Nora's voice jump out of the pages. She's a radio personality, and her writing is so consistent and so utterly different than her sisters' that it provides a really fresh perspective when her character writes letters throughout the book.TurndownsSo I only have one turndown in this book, which is odd as I when I finished I was sure I would have more. Here's the wonderfully simplistic sentence that made me fold over the bottom corner of the page:I had been reading a book slowly, for it is one of those books that you don't want to end.I know it's a simple sentiment, but I'm sure we can all appreciate that feeling. Where you're almost physically forcing yourself to put the book down so you don't read anymore because even when you're rereading something, there's absolutely nothing like the feeling of reading it for the first time. I know that when I read Phillip Pullman's novel, \"The Amber Spyglass\" years and years ago, I thought I would die when I closed the last page because I knew that at that point, there was nothing more I would ever experience about the characters.Isn't this why we read? Isn't it truly unbelievable that an author can take us so completely into their world that we're absolutely terrified for when it ceases to exist?"}, {"userName": "Jane", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/793087-jane", "userReview": "Two decals on the cover, one for being a 2001 Giller Prize winner, and the other, for a Canada Council Governor General Award, I was certain this would be a book worth reading.I am not sure what it takes to get a Giller Prize. Was it how the author dropped many Canadiana details into the story? Was it just a creative way to write a book, including only journal entries and letters? It's not really a pleasant read, many difficult parts, so I began to think there would be a fantastic twist at the end and there wasn't."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : Clara Callan - Nevisande : Richard B. Wright - ISBN : 60506075 - ISBN13 : 9780060506070 - Dar 432 Safhe - Saal e Chap : 2001"}, {"userName": "Lori", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/4987113-lori", "userReview": "“I want so badly to help you realize, Elizabeth Ann, how difficult and puzzling and full of wonder it all is: some day I will tell you how I learned to watch the shifting light of autumn days or smelled the earth through snow in March; how one winter morning God vanished from my life and how one summer evening I sat in a Ferris wheel, looking down at a man who had hurt me badly; I will tell you how I once travelled to Rome and saw all the soldiers in that city of dead poets; I will tell you how I met your father outside a movie house in Toronto, and how you came to be. Perhaps that is where I will begin. On a winter afternoon when we turn lights on early, or perhaps a summer day of leaves and sky., I will begin by conjugating the elemental verb. I am. You are. It is.” Clara Callan’s story is captivating in its mundaneness. Hers is an empty life in many ways and yet there’s a richness in her storytelling that grabs the reader and makes you care how it all turns out for her. Told through letters between Clara, her sister Nora and others and Clara’s own thoughts and experiences in her diary, Richard B. Wright as a male, effectively grasps the challenges facing a single woman in the late 1930’s in a small Canadian town. Clara’s take on the tenseness and uncertainty of these pre-war times including her visit to Mussolini’s fascist Italy is extremely effective, informing and engaging the reader throughout. As brilliant as this book is, it lost something for me in the middle when Clara was in the throes of her illicit affair with a married man. Her independent thinking and broad perspective of the world was lost for a time diminishing the strength of her character in my mind. However her decision to raise her child on her own spoke to the woman I was led to believe Clara was,and I felt vindicated in embracing her at the end as I had in the first third of the book. A strong novel over all and certainly deserving of the Giller Prize and Governor General’s award it won in 2002."}, {"userName": "Charli Winking", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/56293642-charli-winking", "userReview": "Great book! Wright is really successful at writing in women's voices. The story of 3 single women during the 1930s leading very different lives: a single schoolteacher in small town Ontario, her sister a radio actress in NYC, and their friend a lesbian radio/movie writer in NYC and LA. It is a very interesting description of the lives of women in another time and the issues they dealt with-pregnancy, abortion, rape, careers, politics. I really enjoyed their journeys."}, {"userName": "Ann", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/11787979-ann", "userReview": "The best book I've read this year. Love the historical background and the strong female characters."}, {"userName": "Hilary G", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/15167899-hilary-g", "userReview": "Ex Bookworm group review:I'm not sure whether I liked Clara Callan or not.I quite like the episolatory novel - 84 Charing Cross Road is a great favourite from my soppy adolescence, and I have fond memories of Humphrey Clinker by Tobias Smollett, which I studied in school. I don't suppose youcould do it now, really, as all those exchanges would probably be done over the phone, hence Clara's objection to getting a phone? It would have made Richard B Wright's job a lot harder! I can't say I found the lettersparticularly realistic in terms of exchanges between two sisters. They are certainly nothing like anything I would write to either of my sisters Perhaps their slight stiffness or formality is a reflection of the times but more likely it's because Mr Wright doesn't really have much idea of what \"girl talk\" is really like. I 'd really rather not say this, but I can't help it. I don't think Mr Wright has much idea of what girls are really like. I'd also prefer not to say that I think it's because he's a bloke, but I'm afraid I think that's true. If that means men can't write about women and women can't write about men I'd think that's terribly sad. I hope it's just that Mr Wright is, in fact, Mr Wrong in this particular regard. \"Pitch-perfect\" it says on the cover, but for me there were a few discords [why isn't that spelt dischords?]First of all, I know men think periods are a huge factor of women's lives, but I'm not sure they are in the way they think. OK, so they become quite relevant if you think you might be pregnant and I suppose a few of us are atad hard to live with at such times, but I couldn't get over the feeling that the monthlies were thrown in here every now and then for local colour (ugh!)Then... I am not at all sure that Clara's response to the rape was true to life. I suppose here Richard B and I are even steven because I doubt he's been raped and I definitely haven't, but I wasn't at all convinced by Clara's reaction. I feel sure she would be far more traumatised. I was also quite disturbed by the \"you'll like it missus....\" which may be the sort of thing rapists say (I don't think I know any) but is quite worrying, especially in the context of my next point.Which is .... are there REALLY such schizophrenic women as Clara Callan, highly intelligent, artistic, pragmatic, phlegmatic, self sufficient, who one minute say things like \"I am sure there are many advantages to life in the married state... but then you have to put up with someone else in the house, don't you? I see a husband and children as always being underfoot. I wouldn't know where to go to be by myself when I needed to be\" and the next minute pathetic, throwing convention and her inhibitions to the wind, drooling and snivelling over the first bloke that chats her up outside the pictures? I can't help wondering whether Richard Wright (I'm tired of the B.) thinks that lonely spinsters will be transformed by a good seeing to. Clara did say she might like a man like her father, but I did not get the impression that he was as cheap, charmless and obvious as Frank. Funnily enough, though, I really liked Clara Callan. I mean Clara Callan, the person. I liked her the best when she was being herself all by herself without reference to anyone else. The schoolteacher. The aspirational poet. The non-believer. I liked Clara the rapee, and Clara the lover and mother much less. There was a very nice symmetry to the book. Nora went to New York and became a radio actress, yet believed in \"the House on Chestnut Street\" sort of ideal that she had left behind. Clara stayed in her Canadian hamlet, yet was the one who really rejected everything it represented. I thought that was neatly done. I liked the contemporary gossip about things that later became history (like Wallis Spencer and the war).I think the source of my confusion is that I thoroughly enjoyed reading Clara Callan. I found it easy to read and it held my attention. It was only afterwards when some of its themes became permeate through my psyche that I got a bit annoyed with certain aspects. I think that's good actually. I like books which annoy me!"}, {"userName": "Jenny", "userReviewDate": "Apr 24, 2008", "userURL": "http://www.goodreads.com/user/show/630066-jenny", "userReview": "I stumbled upon this book on a table of \"prize winning novels\" in the Princeton NJ public library. It had won several prestigious Canadian prizes for fiction. It's the story of two sisters in the 1930s. Clara, the central character, and older sister lives and teaches school in a small Ontario town. Her younger sister has moved to NYC, where she's a successful radio star. The story is told through letters that they exchange over the years and through letters between Clara and Evelyn, one of Nora's good city friends, a charismatic and very smart writer for her radio program. The characters are so well developed -- I feel like I could sit down with Clara and Evelyn, particularly, and just know them so well. They have all sorts of rough edges, but are so human and believable. I enjoyed the glimpse of the those years as the Depression waned and WWII was in the wings; and it was interesting to see it from the eyes of a Canadian and the eyes of a Canadian in the U.S.. These women were all in a way alone, fiercely independent, and strong. I found them resilient and brave as they faced a range of challenges and disappointments. I found the rapport between the sisters to be very believable. It's an intimate story -- just three real characters writing to each other -- and one that I relished."}, {"userName": "Louise", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "Clara, a quiet woman, lives in the house she inherited from her father. A spinster school teacher who remains in her town of Whitfield. Her younger sister Nora sets off for New York to advance her career in radio.For four years (1934-1938) Clara and Nora write letters to each other. For Clara, life is difficult being a single woman during the Depression and things are not easy. Clara has a very personal and dramatic incident which forces her to confront her new circumstances in a very direct manner. Through this experience Clara realizes how quickly lives can become disordered and divided. Her beliefs are challenged and so is her self-contained wholeness as a person. Eventually Clara visits her sister in New York during a difficult time in her life.Nora in New York becomes a successful daytime soap voice and her personal life takes on some aspects of a soap opera itself. Nora enjoys a rock solid friendship with Evelyn who is glamorous but is less successful in her own on and off affairs.Throughout, Clara tries to remain the firm family base for Nora and her superficial lifestyle.Clara Callan is an engaging story indeed but I don't like novels that are written in the style of letters and diary/journal entries."}, {"userName": "Violette Stepaniuk", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/46634356-violette-stepaniuk", "userReview": "Clara Callan started so promising. Two unmarried sisters from a small Ontario town pursue independent lives in the 1930s. Clara, a respected school teacher, in her early thirties, suddenly discovers she no longer believes in God and tests the expectations of her traditional community. Nora, the younger of the two, heads for New York to pursue a glamorous career as a radio actress. Through their letters and journal entries, we follow their very different lives.I loved the first half of the book, but then the story line just stalled, as if Wright suddenly drew a blank trying to imagine what an independent-minded woman such as Clara might do. Not only was the second half disappointingly predictable, but I find it hard to believe that a clever woman like Clara, who dares to question God and religion, could be so easily influenced in other ways. Yes, in the end Clara does follow her own path and make some tough and unpopular choices, but I did expect more.Clara Callan is a good and easy read, but it could have been so much more."}, {"userName": "Renee Boucher", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/4909732-renee-boucher", "userReview": "I have been wanting to read this book for the past 10 years now. When my first child was a baby I would walk in the afternoons and listen to a CBC program that read this story. I didn't hear the whole story at the time but enough to keep me interrested. When it was over I made a mental note to pick up the book and read it....and here we are 10 years later. It was good, slow to begin, but once the story picked up I was engaged and wanted to keep up with the characters to find out what happens. Nothing grand happens, no obvious climax to the story, but yet the everyday nuances of these two sisters lives was touching. I felt the writer's ability to write from a woman's perspective was excellent. Loved the epilogue, perfect touch!"}, {"userName": "Henrietta", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/5612497-henrietta", "userReview": "In a small town in Canada, Clara Callan reluctantly takes leave of her sister, Nora, who is bound for New York. It's a time when the growing threat of fascism in Europe is a constant worry, and people escape from reality through radio and the movies. Meanwhile, the two sisters -- vastly different in personality, yet inextricably linked by a shared past -- try to find their places within the complex web of social expectations for young women in the 1930s.While Nora embarks on a glamorous career as a radio-soap opera star, Clara, a strong and independent-minded woman, struggles to observe the traditional boundaries of a small and tight-knit community without relinqReco by Marian Glasgow"}, {"userName": "Laurie Gough", "userReviewDate": "Sep 01, 2015", "userURL": "http://www.goodreads.com/user/show/38816349-laurie-gough", "userReview": "I loved this book from the very first page onwards. I identified with the main character and found her to be so real and well-developed she seemed like an actual person I'd want to know. It was also a fascinating glimpse into the 1930s in small town Canada and New York City. The other characters, the hilariously cynical and witty lesbian radio scriptwriter Evelyn is unforgettable, as is the pompous narcissistic author Lewis Mills. I felt lost when this book ended, so engrossed I was with these people's lives. Highly recommended!"}, {"userName": "Sara", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Much of this book is epistemological, but so well done that it adds to the flow and personality of the book. Both Clara and Nora are well drawn and believable and even though Clara react quite differently to the situations she finds herself in than I would think normal, we are given enough of her unique character to find the reactions consistent with who she is.I didn't want to put this down until I reached the end. I was rooting for Clara all the way. Nothing pleases more than characters about whom you really care."}, {"userName": "Diane", "userReviewDate": "Dec 09, 2012", "userURL": "http://www.goodreads.com/user/show/4324873-diane", "userReview": "Not sure about this one. The two sisters were very different, leading different lives but i found the book little boring, the book is set up where the two sisters write letters back and forth throughout the book, so it is a type of book for me that you can put it down for a long period of time and still be able to follow what goeson. It is an okay book but not one of the best i have read."}, {"userName": "LizG", "userReviewDate": "Nov 19, 2008", "userURL": "http://www.goodreads.com/user/show/1734352-lizg", "userReview": "I enjoyed the snapshot into the day-to-day life and attitudes of the era. The characters were a bit weak and the lack of depth of emotion that the main character showed in light of a significant life event (I don't want to spoil the story) tipped me off that the author was male. I hadn't noticed initially, but that was a dead give away."}, {"userName": "Karen Hogan", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/7861140-karen-hogan", "userReview": "I know this won so many awards, but it didnt compel me enough to keep reading it. If a book doesnt capture me in the first 50 pages, I give it up. Because my mantra is \" So many books, so little time\"."}, {"userName": "Talie", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/28053718-talie", "userReview": "This book is made up of correspondence between three very strong women in the 30s. I absolutely fell in love with Evelyn (she reminds me of the costume designer Jenny Beavan). There are references to so many great books in the letters between Clara and Evelyn I wish I'd taken better notes."}, {"userName": "EP", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/12315800-ep", "userReview": "I'm a bit puzzled at why this book is lauded in the manner it is. I've seen it referred to as a Canadian classic. It is an interesting book. The condition of women in the period leading to the Second World War was thoughtful but I didn't find this compelling in any way."}, {"userName": "Caty Clifton", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/2361056-caty-clifton", "userReview": "Interesting story cleverly constructed, but not swept away."}, {"userName": "Alarie", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/2587533-alarie", "userReview": "I like epistolary novels and really enjoyed this one. Wright improved the format by filling in the secret thoughts, feelings, and shocking events in Clara’s life with her diary entries. Except for an Afterword, the book takes place from 1934-38. Their father has recently died, and their mother died when they were little. We enter the story as Nora, the kid sister, leaves for NYC to seek her fame and fortune or at least self-sufficiency, not an easy goal for a single woman at that time. Sister Clara stays behind, an elementary school teacher in a small town in Canada. There was one scene that was difficult for me to read (but I won’t give a spoiler), and there were times I wanted to shake Clara to her senses. For the most part, though, I enjoyed this book. There’s a lot more drama than you’ll expect from the early pages. You’ll also meet a wider cast of characters, take a cruise to Europe as tension mounts there, and get a peek at Hollywood."}], "description": "Two sisters, small-town Ontario, 1934. Canadian author Richard Wright tells their story, from the ordinary to the extraordinary, with an eye for the commonplace and poignant sense of the larger undercurrents that change people's lives.Letters and journal entries form a portal into the desires and passions of two very different women, underscoring the larger tableau of an era stirring with great events--the Depression, rumblings of another world war, and the infancy of radio and show business entertainment. Love and betrayal, friendship and family, hope and deception are the forces that temper the lives of Clara, the spinster schoolteacher, and her sister Nora, \"whose enter life is a performance.\"Wright, a master of revealing the drama of seemingly unremarkable lives, constructs a powerful, mesmerizing narrative. Clara Callan is a deeply moving portrait of two women and of an age heralding seismic changes that will alter the fabric of their inner lives and the world as they once knew it.", "title": "Clara Callan", "url": "http://www.goodreads.com/book/show/7428690-clara-callan", "average": 3.86, "cover": "", "reviews": 286, "authors": [{"url": "https://www.goodreads.com/author/show/91558.Richard_B_Wright", "name": "Richard B. Wright"}, {"url": "https://www.goodreads.com/author/show/1145326.Anne_Twomey", "name": "Anne Twomey"}, {"url": "https://www.goodreads.com/author/show/127505.Joanna_R_Adler", "name": "Joanna R. Adler"}], "type": ["Fiction", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/7428690-clara-callan", "http://www.goodreads.com/book/show/969335.Clara_Callan", "http://www.goodreads.com/book/show/241664.Clara_Callan", "http://www.goodreads.com/book/show/969334.Clara_Callan", "http://www.goodreads.com/book/show/2878168-clara-callan", "http://www.goodreads.com/book/show/10215643-clara-callan", "http://www.goodreads.com/book/show/940974.Clara_Callan", "http://www.goodreads.com/book/show/4132427-clara-callan", "http://www.goodreads.com/book/show/1265245.October", "http://www.goodreads.com/book/show/1265228.Adultery", "http://www.goodreads.com/book/show/8584832-mr-shakespeare-s-bastard", "http://www.goodreads.com/book/show/26113983-nightfall", "http://www.goodreads.com/book/show/1265233.The_Age_Of_Longing"]}