{"ratings": 10, "userreviews": [{"userName": "M", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/604863-m", "userReview": "p. 347 -356 East side, North Africa"}, {"userName": "Mills College Library", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/14996177-mills-college-library", "userReview": "Fiction B787c 2017"}], "description": "In a brilliant handful of works, Jane Bowles (1917–1973) fashioned an uninhibited avant-garde style, a dazzling compound of spare prose and vivid dialogue that has enjoyed an outsized literary influence. Tennessee Williams called her “the most important writer of prose fiction in modern American letters”; Truman Capote said she was a “modern legend”; and for John Ashbery she was “one of the finest modern writers of fiction in any language.”To celebrate her centenary, Library of America presents the definitive collected edition of Bowles’s incomparable fiction, supplemented with an extensive selection of her frank, funny, and often devastating letters. The modernist classic Two Serious Ladies (1943), a novel inspired by the author’s honeymoon in Mexico with her husband, the writer and composer Paul Bowles, follows two bourgeois American women in Panama as they jettison sexual and cultural norms in search of happiness and liberation: newlywed Frieda Copperfield, who seeks love and comfort in the arms of a young Panamanian girl, and Christina Goering, a wealthy spinster whose unorthodox pursuit of salvation leads her into a world of shiftless men and seedy bars. Witty, moving, and bizarre, Two Serious Ladies is a landmark work that retains its capacity to mesmerize.In the Summer House (1954), a play about two mothers, one selfish and ruthless, despising her dreamy daughter, the other gentle and dominated by her strong-minded daughter, was performed on Broadway in 1953 and reflects Bowles’s complicated relationship with her own mother. Tennessee Williams considered it “not only the most original play I have ever read, I think it is also the oddest and funniest and one of the most touching. It is one of those rare plays which are not tested by the theater but by which the theater is tested.”These major works are joined by an unprecedented collection of Bowles’s shorter writings, including all the published stories, never-before-published song lyrics, a section of Two Serious Ladies cut from an earlier draft, four abandoned stories, and an unfinished play. Also included is the nonfiction sketch “East Side: North Africa,” which Paul Bowles refashioned into a short story, “Everything Is Nice,” published under Jane’s name in 1966; the story is presented here as an appendix.Rounding out the volume are 133 letters, introduced with headnotes by editor Millicent Dillon, offering candid portraits of such friends and acquaintances as John Ashbery, William Burroughs, Truman Capote, Aaron Copland, Ira Gershwin, Allen Ginsberg, Carson McCullers, Sylvia Plath, Paul Robeson, Susan Sontag, Gertrude Stein, Virgil Thomson, Alice Toklas, Carl Van Vechten, Gore Vidal, Eudora Welty, and Tennessee Williams.", "title": "Collected Writings: Two Serious Ladies / In the Summer House / Stories & Other Writings / Letters", "url": "http://www.goodreads.com/book/show/30220506-collected-writings", "average": 4.1, "cover": "https://images.gr-assets.com/books/1483439360l/30220506.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/100439.Jane_Bowles", "name": "Jane Bowles"}, {"url": "https://www.goodreads.com/author/show/2591.Millicent_Dillon", "name": "Millicent Dillon"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/30220506-collected-writings", "http://www.goodreads.com/book/show/215262.Two_Serious_Ladies", "http://www.goodreads.com/book/show/183332.My_Sister_s_Hand_in_Mine", "http://www.goodreads.com/book/show/625222.Plain_Pleasures", "http://www.goodreads.com/book/show/215258.Out_in_the_World", "http://www.goodreads.com/book/show/16694840-everything-is-nice"]}