{"ratings": 56347, "userreviews": [{"userName": "Michael Martin", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/3096654-michael-martin", "userReview": "The disclaimers \"I imagine\", \"perhaps\", \"possibly\", \"it could be that\" appear in this NON-FICTION book far more times than they should. While I liked the content of about three-quarters of the book, it infuriated me at times when the author would suddenly start presenting the material through the eyes of a character, \"imagining\" their experiences, travels, and accomplishments. This first rears its head around page 81, when the tone of her book changes to speculate about an imaginary Corinthian artist. I quote...\"But what if she became tired of using just one variety of paint material? Perhaps, I thought, she may have tried out new blacks and browns. Would she, given the chance to try out charcoal's successors, have preferred lead pencils or India ink? Would she have dyed her clothes deepest black, or was it only in the palest of classical robes that she wanted to be seen? And if her boyfriend ever returned to Greece between voyages, would she have used her new knowledge of pigments to decorate her own face for the occasion? I imagined our heroine experimenting idly with mascaras and liners.\"At this point, I threw the book across the room.WHAT THE HELL. It's mean to be a scholarly book about color... and I'm reading a bullshit paragraph leading me into speculation about \"this Corinthian woman's\" dating and make-up?I felt the same way about her handling of the character of Martinengo in the \"Orange\" chapter. On one two page spread, I think I counted \"I imagine\", \"perhaps\", \"possibly\", \"if\", about ten or twelve times.This is an irresponsibly stupid way to write nonfiction. Two stars (and I never want to read anything else by her)."}, {"userName": "Maura", "userReviewDate": "Apr 21, 2008", "userURL": "http://www.goodreads.com/user/show/1061106-maura", "userReview": "Funny story with this book - got to page 112 and discovered that pages 113 to 146 were missing! Thankfully, Random House (publisher) came to the rescue and sent me a replacement copy. Until it came I was in suspense about how ladies used to poison themselves (by accident) with white cosmetics that were made from lead.This book was interesting not only for the information about colors, but also for the author's travels. She went to great lengths to get to the source of some colors, and along the way educates the reader about old customs and cultures. Fascinating book that will fill your head with lots of information that will seem useless unless you appear on Jeopardy some day. It made me look at everything around me a little more attentively, though, really noticing the color (Is that blue, indigo or violet?) and thinking about where that color source may have been aquired."}, {"userName": "Kiwiflora", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/2356893-kiwiflora", "userReview": "I remember when I was a child getting a box of paints in small tubes. I was fascinated by the names of the colours, words I had never heard of before - vermillion, magenta, aquamarine, cochineal, carmine. They might have been only shades of orange, purple, blue and red, but those exotic names gave those paints just a little more magic. Didn't do much for my art work, but never mind. Victoria Finlay would appear to have had a similar early interest in colour when her father took her to Chartres Cathedral. She noticed the beauty of the stained glass window crafted some 800 years ago, only to be gob smacked when her father told her that no one actually knows how to make that beautiful blue in the window anymore. And so began her interest in discovering where colours come from and ultimately this book. Part travelogue, part science text, part art history, part general history, the author has brought together a huge number and variety of facts and experiences and people into this rather large book of 440 pages, not including bibliography, notes and index which together run to another 60 pages! It could be very easy to have complete confusion in amalgamating all this material into a readable book. Probably the only way to do it with a subject such is colour is to organise it by colour. So she starts at the beginning with the colour of the earth - ochre - the first colour used for art and decoration. She goes to Australia, to an Aborigine community where ochre has been used continuously for 40,000 years. Imagine. She then moves onto black and brown made from soot, coal, fish excretions, graphite rock, wasps, as well as giving us snippets about mummification and the history of printing. The next chapter, white, is mostly about lead which was used to make white paint, and especially make-up resulting in the early and painful deaths of many fashionable ladies. Following the colours of the rainbow, the next seven chapters take us all over the world. From cochineal bugs on cactus plants in Chile (red), to Stradivarius violins in Cremona (orange), to urine gathering in India and wars over saffron (yellow), to exploring caves in China (green), visiting the Bamiyan Buddhas not long before they were blown up (blue), harvesting indigo plants in India and Mexico (indigo) and going to Lebanon to search for the source of the power of purple in ancient Rome and Egypt (violet). And these are only a few of the stories that the author crams into her book.If there is any criticism of the book it is perhaps that there is too much information, too many stories and adventures, making it hard to catagorise exactly what type of book it is. I would say, quite simply, it is a personal journey of a subject close to her heart that she wants to share with as many people as possible. It is an absolute treasure trove of action and inquiry and I learnt so much about all sorts of stuff! So glad I picked this book up from the shelf of a second hand book shop!"}, {"userName": "Jenny", "userReviewDate": "Oct 10, 2007", "userURL": "http://www.goodreads.com/user/show/529039-jenny", "userReview": "Having an affinity for all things color, I was attracted to the cover of Color: A Natural History of the Palette while visiting the Met one afternoon about a year ago. I bought it and have been reading it for the past year. I'm sad to say that I found the cover to be the best part of this book. The book wasn't bad, but it also was nowhere near great. Finlay sets about the task of researching the origins of the pigments of the paintbox: Ochre, Black & Brown, White, Red, Orange, Yellow, Green, Blue, Indigo & Violet. For each color, she researches the historical beginnings of the colors, specifically trying to illuminate why each color is named the way it is (eg, Tyrian Purple, Indian Yellow, etc.). She does this by trekking across the globe to the points of interest in hopes of discovering the histories (and, sometimes, secrets) of the colors from the indigenous people who, in some cases, still use the time-honored traditions. In some regards this book elaborates upon colors. In some regards this book is a travelogue. In yet other regards this book is part imagination: when Finlay is unable to find hard and fast facts about her subject, she will often say, \"I imagine [this to be true]...\"I think, if I could, I would rate this book 2.5 stars. It is mildly interesting but, perhaps, a bit too long."}, {"userName": "Nancy McClure", "userReviewDate": "Aug 16, 2008", "userURL": "http://www.goodreads.com/user/show/991603-nancy-mcclure", "userReview": "LOVE me a book where I can pick a chapter and read up on what's been taunting my mind - thus I love anthologies and various other collections.in Color, I found a fantastic historical recounting of the who/where/why/what of much of our commonly accepted color palette. And that alone means something, because there is a surprisingly low ratio of 'general citizens' who knows REALLY what color is about, how it's made, how we wrestled/negotiated/bullied our ways into being enjoyers/purveyors of it. Lot's of lessons to be learned...."}, {"userName": "LuAnn", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/12487991-luann", "userReview": "I’d call this a travelogue on the origin of pigments and dyes of each rainbow color, and, I believe, the only book to really tackle the history of color. This book had been on my radar a while, but I had decided not to read it, yet a class on color finally compelled me to read it. Through it I’ve come to appreciate just how complex getting pigment mix with a medium of the right consistency and translucency to stick to a surface and dry without fading or changing color over time or to dissolve in water to dye cloth, and again, to stick and not fade. At times the author’s hunt for colors, such as for ochre in Australia or violet in Tyre, that start with all the drama of quest for unknown secrets, fizzle because the secrets remain unknown in the end. The origin and history of each color is presented here is interesting but feels incomplete as I would prefer a more broad history rather than the in-depth travel stories presented which leaves me with mixed feelings about this book."}, {"userName": "Tracey", "userReviewDate": "Nov 21, 2007", "userURL": "http://www.goodreads.com/user/show/349264-tracey", "userReview": "In an impressive mix of history, science and travelogue. Ms. Finlay shares with her readers the results of her worldwide search for the pigments and dyes and that humankind has used over the ages. Each color (including black and white) is represented in a separate section, where she weaves stories of fictional and real-life people into her research with entertaining results. From Australian sacred ochers to Phoenician royal purple; from Incan reds to Chinese imperial greens - this book literally covers a rainbow of topics. The narrative thread is spider-silk thin for most of the book, and occasionally the reader is overwhelmed with the amount of information presented; but the overarching theme of the discovery and use of color is carried well throughout. Not only is this book accessible to the general reader, there is considerable scholarship in its pages. The bibliography covers 6 pages, with the notes section (broken down by chapter) another 13. She also includes a list of illustrations, credits and an index. I found myself filling a notecard with my comments, as well as noting some Further Reading references. Recommended to anyone with an interest in the artistic side of history and science. Notes On Colors"}, {"userName": "Kiersten", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/20626935-kiersten", "userReview": "Oh, this book had so much promise! And yet, it fell flat... I was expecting to read more of a history book, but it turned out to be a travelogue/memoir, and a tad too self-involved for my tastes. Moreover, the author does a lot of \"imagining\" for a work of non-fiction. Damn."}, {"userName": "Miles", "userReviewDate": "Oct 22, 2008", "userURL": "http://www.goodreads.com/user/show/1634136-miles", "userReview": "This was an enjoyable book to read, but ultimately more of a travel book than a book about color. The adventures of the author tend to be given rather more weight than the subject."}, {"userName": "Velvetink", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/454255-velvetink", "userReview": "Be seduced by the history of pigments. Basically about the author's travels while seeking out the origins of ancient colours. I loved this and gladdened by the extensive notes and bibliography."}, {"userName": "Alex", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "Doesn't this look cool? JG is into it. She says it's a fun and engaging read."}, {"userName": "Fredrika", "userReviewDate": "Apr 06, 2010", "userURL": "http://www.goodreads.com/user/show/841122-fredrika", "userReview": "I really liked this book, and I checked it out from the library but I'm going to buy it. I didn't mind the format or the fact that she spoke about her modern-day expeditions for the colors. According to the Torah, Gold told Moses to tell the Israelites to make \"fringes on the borders of their garments and put upon the fringe of each corner a thread of blue.\" The Talmud went farther to specify that the blue had to come from a sea creature that had a shell. The tsitsit shawl and fringe remind Jewish men of their responsibilities. The process to create this blue has been lost and rediscovered, many times over. between 1913 and 1980, all experiments done revealed purple, not blue, and usually involved the wrong sea creature. Then in 1980 an chemist called Otto Elsner who experimented with woad dyes noticed something extraordinary, that dying on a sunny day came out blue, while on cloudy days it was purple. This however did not solve the problem of how the Ancients made the pigment into a dye. \"The Israelites sent him a vial of pigment from Murex trunculus and some wool. He was excited by the opportunity to test his theory that if Tyrian purple contains indigo, then perhaps, like woad and indigo, it needs to have the oxygen removed from the vat before it can become a dye. And what more convenient ingredient for achieving this than the rotting meat of the mollusk (which would cause the bacteria to putrefy and use up the oxygen)?\" He added some pickled cockles, which are similar to the murex that had supplied the pigment, after he washed off the vinegar. His solution turned from purple to green, and \"the first time he dipped a cloth into the liquor it turned purple. But later he found that if the dissolved greenish liquor was exposed to light, any cloth he put into it turned green and then - in the air - turned blue. This process has the theological neatness of embracing something holy, born of light. and like the blue thread, was on the fringe of the garment and metaphorically on the fringe of what is allowed in Jewish traditions. The Tyrian blue is one of the least kosher colors; Shellfish are as anathema to Jews as pork.and then here are some other little tidbits:*the first artist was a Corinthian woman*ochre is the oldest color, in all its variations*pencils were painted yellow to imitate the Chinese Manchu robes*Joseph Lovibond invented the first system to judge the quality of beer by comparing it against shades of brown stained glass*after the 18th century, brown ink was made from sepia, the dark liquor secreted by cuttlefish when they are afraid*Red was originally made from the blood of cochineal bugs, found on cacti *In the production of red in the 17th century, alum was the agent that gave the dye its teeth. it's rumored that King Henry VIII of England only married Ann of Cleves to get his hands on her alum*Turkish Miniatures were actually named after the orange that was prevalent*Saffron is really tricky to harvest. The romantic Spanish do not grow very much and they deal with the mice by smoking them out, while in Iran, they are killed with motorcycle smoke*Cleopatra used to take a saffron bath before inviting a man to her boudoir *In China, green porcelain, or mi se, pronounced \"mee-ser\" was a big secret reserved for the wealthy and holy. it was admired for its unusual and rare beauty. the color would crackle slightly on the surface, making it perfectly imperfect*Green wallpaper was made with arsenic, and might have led to the premature death of Napolean at St. Helena*Green cloth was a sign of wealth in Robin Hood's time, so the fact that his garb was green was another example of stealing from the rich to give to the poor*Cennino's third green was often referred to as van Eyck green because he used it so well, especially in The Arnolfini Marriage. This painting may be an allegory to sexual abuse rather than a celebration of marital bliss*Blue is made from Lapis Lazuli, which is a rock that contains speckles of iron pyrite, fool's gold, and is mined in Afghanistan *John Herschel invented the \"blueprint\" in 1842*woad was used to make Indigo dye in the time of England's Braveheart, and was used to paint the warriors. it was also an extraordinary astringent, so they were also setting up a primitive field hospital while they were bathing in vats of woad*it was Newton that added orange and indigo to the spectrum. he decided there would be seven colors, because seven was a divine number. at the time there were only seven known planets, seven days of the week, seven musical notes. The Chinese use the number five; five elements, five tastes, five musical notes, and five colors: black, white, red, yellow and blue*In Hindu India, blue is often a lucky color, the color of Krishna, the god who dances around the world making both love and fun*As recently as 1952, Violet (or more like Mauve) was a color of mourning. when King George VI died in '52, \"black and mauve knickers were solemnly placed in haberdashers' windows\" *Phoenicians from Lebanon arrived from the Arabian peninsula in the third millennium B.C. Their name derives from the Greed word for Purple, phoinis. They made violet from the shells of mollusks that live along their rocky coast*Violet is made in Costa Rica by squeezing a shellfish until it barfs up the dye which reacts to air by first being a neon green, then yellow, and finally purple"}, {"userName": "Tracey Allen at Carpe Librum", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/4986986-tracey-allen-at-carpe-librum", "userReview": "I've always been fascinated about the origins of colour, and in Color - A Natural History of the Palette, author Victoria Finlay travels the world in her search for the origin and birthplace of colors and dyes.I wasn't interested in the author's personal travelogue, so I initially had the intention of skipping over any boring parts and jumping straight to the facts about the colours which are conveniently broken down into the following chapter headings:1. Ochre2. Black and Brown3. White4. Red5. Orange6. Yellow7. Green8. Blue9. Indigo10. VioletWhat I found surprising was that there were no boring bits! Finlay has managed to keep herself out of the book for the most part, and the stories that were included were historically relevant to the colour being discussed and I didn't end up skipping a single paragraph.Finlay's passion for color and dyes are clear early on, but far from boring the reader her enthusiasm is infectious and I found myself becoming quite excited when she found her first indigo plant or saw a purple field of saffron crocus (used for the color yellow) for the first time.Some of my favourite facts include:- Red was made from the blood of the Cochineal insect, which lives on a cactus leaf- The colour yellow was made from saffron, harvested from the saffron crocus flower, however only 3 strands of saffron are collected from each flower.- In 1775, arsenic was used to create a color called Scheele's Green. It took until 1880 for people to realise that the wallpapers and paints using this green (and other paints containing arsenic) were killing people and making others very sick. e.g. a cat had become covered with pustules after being locked in a green room.- Purple is the colour that has been most legislated about over the longest time in history.- Purple has been a regal colour for centuries and one form of purple was made from shellfish and worn by emperors of Ancient Rome. Finlay writes that those who wore it \"probably left a cloud of garlicky, fishy smells in their wake,\" and that perhaps it was the \"scent of power\" at the time. What a thought!I learned so much about the history of colour, dyes, art, art forgery, culture, events in history and trade across many countries and different time periods in the world's history. Everything from a secret green used on ancient Chinese porcelain to the colour blue used to dye English police uniforms in the 1960s was covered, all of which I found fascinating and easy to digest in Finlay's conversational writing style.I thoroughly recommend Color - A Natural History of the Palette to readers who enjoy art, culture, history, non fiction and have a natural curiosity about the colours around us; great for trivia nights too!"}, {"userName": "Rachel", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/7374146-rachel", "userReview": "I love color. I've often said that I get the same pleasure out of looking at color that my friends seem to get from listening to music. It's a visceral feeling of joy that I can't describe particularly well with words. Also, since I'm a painter, this book has all the makings of a seven star review. Yet you notice it's only four stars, what gives?Okay here's the deal. When the subtitle of your book is \"A Natural History of the Palette,\" that implies history, as in truth (or the best we can make of it). Non-fiction. For the most part this is how the book is written, there are great stories about pigments and their origins, HOWEVER, there are several dozen little bits snuck into the text that all start, \"I like to imagine that...\" Well, guess what lady, I don't want to know about how you IMAGINE historical events to have played out. It's often not clear when we emerge back from imagination-land and back into facts, so now my brain is mishmashing true things with what Victoria Finlay wishes were true. As a somewhat sidenote, this is what I don't like about historical fiction, it generally results in me at a party disclosing some mindboggling facts about something I read, only to realize later when my ass (or brain, rather) is being handed to me on a plate, that it's not true and I had conflated the \"historical\" with the \"fiction\".All in all, I still would recommend this book to people who are interested in this topic, I just wish it never strayed from the already interesting stories about the origin of pigments/dyes."}, {"userName": "Bandit", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "This book too me an inordinate amount of time to get through. And although I'm not primarily a nonfiction reader, this time it had nothing to do with the book itself or really nothing to do with the quality of the book. The quality was awesome. Finlay's writing was engaging and humorous and her journeys around the world to some of the most random and strange in an out of the way sort of places to discover the history of color were enlightening, educating and very entertaining. The reason it took me so long to get through the book is because it's just crammed with information, variety of information, from historical to cultural, that it takes a brain some time to process. Color is something that surrounds us on daily basis and yet receives barely a thought outside of matching, but after reading this book you won't look at it the same way again. In a way this was like taking a terrific class, because learning should optimally change the way we see the world. Interesting, clever, endlessly fascinating, this was a great read. Highly recommended."}, {"userName": "Gigi", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/1493550-gigi", "userReview": "This was an interesting book, but it was more a travel memoir than \"a natural history of the palette.\" Another book by the author, THE BRILLIANT HISTORY OF COLOR IN ART, is a far more informative book for learning about the history of color in art."}, {"userName": "Amy Beth", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/3096896-amy-beth", "userReview": "Finlay travels all around the world trying to find out the history of colors (she travels so much you wonder how her publisher could have afforded all that airfare and travel expenses). The funny thing is, much of the history is lost or inaccessible. She goes to Australia and decides not to try to find out more about the Aboriginal spiritual meanings of ochre out of respect for the culture. Many times she goes to a place only to be disappointed to find nothing left or even--as in the case of Indian Yellow--a wild goose chase resulting from a story in a newspaper. The book seems as much about how much of our history is missing; I don't know many books either that embrace so many failings. While it is more like our own quests for understanding and finding of knowledge, it's hard not to want a published book to be the example of success. The interweaving of culture and history and color is good and even sometimes great. One of my favorite descriptions is the visit to the Afghanistan lapis lazuri mines; perhaps because this is one of the colors I have actually heard of combined with the area's standout against the Taliban. Yet, I kept comparing her to Simon Schama and finding her ability to make the history emotional relevant for me sub par."}, {"userName": "Cathy", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/27982423-cathy", "userReview": "A mass of information about the natural dyes and pigments used for the seven colours of the rainbow, plus black, white and ochre. Finlay journeys around the world to find the origins of the colours, tracing them through myth, art and history to find out how and where the colours were produced. Each story is fascinating, and she writes in a lively and accessible style. Her research is presented as a quest or adventure, and while this sometimes comes across as slightly overdone, in the chapter on blue the sense of risk and something very precious being at state really becomes apparent. Searching for the main source of lapis lazuli in the world, the mines in Afghanistan, she travels through the Taliban-run country and is able to visit the Buddhas of Bamiyan, whose painted blue auras are the earliest known use of ultramarine, the paint made from lapis lazuli. Just months later, the two giant Buddhas are destroyed by the Taliban. Finlay is clearly a natural storyteller, and weaves her personal anecdotes together with scientific fact and historical information to create a vivid and - of course - colourful tale. Highly recommended."}, {"userName": "Andrew", "userReviewDate": "May 04, 2014", "userURL": "http://www.goodreads.com/user/show/800291-andrew", "userReview": "This is an impressive book with an innocuous title. The folio edition is as you would expect impressively bound and comes with its own box sleeve. However the contents are the same as the other editions just in a more impressive binding (I was lucky to pick this us second hand, there is no way I could afford such a book brand new ) the book after a short introduction to colours how they were incentivised and discovered then breaks up in to a number of chapters ingeniously named after a specific colour. These chapters cover a colour, it's source and in some cases discovery and where it was used. In many cases it can be seen that not only socially where these colour important but also financially and politically. As a result the book fires off ideas and other erasing suggestions all over the place to looking up the impressionist painters to discovering archeological cave paintings. The book is a fascinating read which I will admit I would not have normally gone for but I am very pleased I did (and on a side note any folio book is worth owning purely for the quality and sheer beauty of the binding )"}, {"userName": "Gale", "userReviewDate": "Jun 18, 2010", "userURL": "http://www.goodreads.com/user/show/706136-gale", "userReview": "I've always been interested in color and have previous read The Anthropology of Turquoise: Reflections on Desert, Sea, Stone, and Sky (****) by Ellen Meloy and Mauve: How One Man Invented a Color That Changed the World (*****) by Simon Garfield. Those books are very different, one being about natural history and the other about chemistry influencing fashion and ultimately changing a national industry.Finlay's book is also unique; it's a travelogue where she searches for the historical origin of individual colors. The history of the development and use of each color takes readers on paths through various civilizations, economies, and sometimes wars. If you are interested in color, I suggest you read it a chapter (or color) at a time. Some chapters drag on while others pass more quickly, but almost every chapter has some very interesting tidbits so don't give up- scan a bit :-)"}, {"userName": "Sarah", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/990218-sarah", "userReview": "I learned so much from this book, like . . . the formula for Red is relatively unchanged from the beginning of its existance, searching for the origin of Orange can teach you a lot about violins, Yellow and White are the deadlyest colors, and Green, although the most prevelent in nature, is the hardest color to replicate in paint. This book is also a travel journal, so I felt like I was getting to visit a lot of unusual places as I read. Unusual places, unusual facts, and a broud scope of information. This book was perfect for me."}, {"userName": "Stacey", "userReviewDate": "Nov 08, 2010", "userURL": "http://www.goodreads.com/user/show/4314802-stacey", "userReview": "I have read this book cover to cover TWICE, and recommended it not only to art students but to friends and family as well. Anyone interested in art materials and their origins will truly enjoy. Also, the reading of this book drove m to want to learn even more and so I have read certain books in the bibliography as well (most notable, \"The Art Forger's Handbook\" by the late great forger Eric Hebborn)."}, {"userName": "T", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/7501215-t", "userReview": "If I were a history buff, I'm sure I'd have found it at least a little bit lovely. But a history buff I am not, and the first 28 pages were some pretty dry reading and gives non-fiction a bad name."}, {"userName": "Karyl", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/1462387-karyl", "userReview": "I picked this up on a whim at my local library, as it sat on a display of rainbow colors. (I have to plug my amazing local library here for a moment -- they always have the most engaging displays, some books chosen for their subject matter and others for their aesthetic.) I made sure that it was okay that I was \"ruining\" the librarian's display, and she of course told me I was welcome to check out the book. On her very first page, she recounts the story of when she was taken to Chartres Cathedral as a child and being fascinated by the light streaming through the gorgeous stained glass windows. Her father told her then that the knowledge to make the blue in that stained glass had been lost to history, and she was utterly gobsmacked that such a thing could happen (spoiler alert: it didn't, not in this case). From then on, I was hooked.Finlay takes us along with her on her travels to find the origins of the colors of the paintbox, from Ochre to Black and Brown to White and on to Red, Orange, Yellow, Green, Blue, Indigo, and Violet. Quite a few colors had long, involved, and frequently smelly methods of preparation, and some were discovered quite by accident. Some of Finlay's stories made me want to weep, especially the tale of the two huge Buddha statues in a valley of Afghanistan that had stood for 14 and 15 centuries, and that were destroyed by the Taliban six months after Finlay was able to see them. Her travels are fascinating and always give us the human element of where these colors have come from, so this book can be shelved almost as a travelogue and less as a scholarly paper on the preparation of color for artists' purposes. I was fascinated by the origins of each color name, some familiar from my childhood set of Crayola crayons (burnt sienna being named after a shade that had to be heated to achieve that color, and it supposedly having originated in Siena, Italy).My only regret with this book is when I started it, the week before my birthday. I had no idea I was going to have surprise houseguests for over a week, and so this book did not receive the attention it deserves. I may have to re-read it at some point to absorb more of the information.I found this book to be reminiscent of the works of Mary Roach in its accessibility and engaging writing style. The author is definitely part of the story, but for me, it lent a human aspect and interest that may otherwise have been lacking. Highly recommended."}, {"userName": "Erika Mulvenna", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/605711-erika-mulvenna", "userReview": "I agree with many other reviewers who didn't like the fiction inserted into this \"non-fiction\" book. A few bits were interesting, the rest was not so much."}, {"userName": "Deborah Ideiosepius", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/4802663-deborah-ideiosepius", "userReview": "I found this book fascinating, absorbing and exquisitely researched. In it the author takes us on a journey of discovery to look at dyes and pigments from before our current aniline dyes were invented. The chapters are named after the colour, and in each one we look at the historical basis of the colour, where it came from, what it was used for how it was described in the past. So a great deal of many of the things I love best feature in this book:The great artists and their artwork are characters in this book; Van Gough, who 'knew the value of good paint'. Turner, who I find out, was careless of choosing good quality pigments, which is why so many of his paintings discoloured so fast. Michaelangelo, who could not wait for blue pigment to arrive from the east and never finished his painting since the virgin mary could only be painted in that particular blue.Then there is the travel element, another thing I love. Victoria visited so many places in this novel; she visited the mines in Afghanistan where Michaelangelo's blue never arrived in time from. Mexico, to look at the indigo violet colour of skirts, after first searching for indigo in India. We also stop by China and its porcelain, in an exploration of glazes, archaeology and history. Victoria also describes how she was lucky enough to see several amazing structures that have since been destroyed by islamic culture terrorists. She is lucky, too late for me to ever see them now, the extent of her journeys in the book is remarkable.There is heaps of history, some of it I already knew some of; the incredible history of lead white, the fashion of using it until you died, still fashionable. Only one thing puzzled me somewhat; in the chapter where Victoria goes to the Lebanon searching for the murax shell that was the source of the Phoenicians purple dye, and their wealth.... They have been renamed Hexaplex for quite a while and the dye producing gastropods are small, muddy looking and insignificant, they bear no resemblance to the elegant spiky shells Victoria described which are the 'modernly named' Murex. Also I am pretty sure (not %100, but at least 70-80) that the source of the dye was kept secret and expensive for so long because it had to be harvested on the Atlantic side of the pillars of Hercules, you couldn't just pick it up on any Mediterranean beach you happened to be wandering on. That was why it was so rare, and why the Phoenician empire was so secretive and exclusive about it. You had to have exceptional boats and seamanship to get to the harvesting grounds.Anyhow, I loved this book but I won't recap it all here, if you like art, travel, history, anecdotes and knowing more about the world around us, you should read it.If you, like me, love knowing about art, pigments, how colour is made then you must read it!"}, {"userName": "Rebecca", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/5649720-rebecca", "userReview": "A meditation on the origins of different dyes and paints through human history, this book seems mostly to be an excuse for the author to travel to exotic lands and harass the people living there. It's interesting, for the most part. She talks to Aborigines about ochre, Mexican fishermen about purple, experts in Chinese pottery and Incan textiles and Spanish crocus growing. There's a lot of painful history, including poisonous paints and slave-grown indigo. A lot of cool factoids, as well.But at the same time, I had the growing sense that the author was being self-indulgent. She interviews a man who tried to help the Aborigines and failed and whose life is blighted as a result. She gets a guy to take her out to look for sea snails in life-threatening conditions. She bullies her way into Afghanistan during the height of the Taliban's reign so she can see the mine where lapis lazuli comes from. And it's not like she's some investigative reporter who will bring home a story to open people's eyes to the plight of the people who she talks to. She's writing about paint. And I couldn't help but wonder if maybe the poor folk at the embassy had something better to do with their time than help her get in with the UN workers.That said, it's a diverting little book that's informative and entertaining, if not enthralling and earth-shattering."}, {"userName": "Ape", "userReviewDate": "Jan 24, 2011", "userURL": "http://www.goodreads.com/user/show/3091902-ape", "userReview": "2009 bookcrossing reviewI started reading this sometime last year. I got half way through then put it down for some reason. It got piled over other bits and I kind of forgot about it. I was tidying up last week and found it again and decided I needed to finish it.This was a really interesting read. It's a mix of history, culture, travel, geology etc etc - a lot of interesting anecdotes and facts, so you travel the world with her discovering the story of colour. The last few chapters that I read this week stick in my mind the most right now, and some of her travels are a little mind boggling - bearing in mind that they were research for a book about colour. She literally travelled the globe. She went to Iran to see the saffran cultivation. She went into Afghanistan (yes, after the terrorist attacks on the US) to see lapis lazuli mines in the mountains.As with her book on jewels, there is a lot in here and by the time you get to the end, you've forgotten a lot of it even though it was interesting at the time. So I think this is one of those books that will stand multiple readings. Really good, although maybe a little more rambling that the Jewel book. Still really worth reading though."}, {"userName": "Amy", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/680056-amy", "userReview": "This is not just a history of color, but a bustling travelogue of the world; Victoria Finlay is just my type of traveler-- she has a plan but she doesn't. She hears of a place where a color was developed and she goes, and hopefully, just hopefully, she meets the right people and finds what she is looking for. It's all very serendipitous. The book is categorized by colors; beginning with the earth tones (which, oddly enough, come from the earth) and moves on to my favorites of green, blues, and violet. While this is fun global romp searching for the origins of color, it is laced with the nostalgia of understanding of how people before us lived, where creating art was in fact creation: from preparing the piece to be painted to crushing, mixing, blending the paint to understanding how different mediums react to each other. Finlay also reaffirms that it is in the pieces imperfections that make them beautiful, and she explains how many beautiful colors relied on shit to be so.Color is an interesting read, and Finlay is an irreverent, speculative, and open tour guide through the palette."}, {"userName": "Artur Coelho", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/3865852-artur-coelho", "userReview": "Um dos aspectos mais interessantes da teoria da cor é a história dos pigmentos, como são obtidos os materiais que nos dão as cores que nos fascinam. Hoje, representados virtualmente em pixeis ou produtos da indústria química, mas ao longo da história um sinal de profunda sabedoria de técnicas e materiais inusitados, bem como de relações comerciais intercontinentais. Hoje, é fácil e acessível obter as cores mais esotéricas numa qualquer superfície comercial, mas houve tempos que os pigmentos obrigavam a esforços agora impensáveis. Este livro conta algumas dessas histórias, num misto de jornada pessoal de uma jornalista viajante que calcorreou o planeta em busca das fontes mais antigas dos pigmentos. Desde as minas de lápis-lazuli de um Afeganistão sob domínio talibã, aos museus italianos, mercados orientais, ruínas libanesas, campos indianos, até ao interior australiano, procurando na arte aborígene os indícios dos primeiros usos registados de pigmentos com intenção artística no neolítico."}], "description": "Discover the tantalizing true stories behind your favorite colors.For example: Cleopatra used saffron—a source of the color yellow—for seduction. Extracted from an Afghan mine, the blue “ultramarine” paint used by Michelangelo was so expensive he couldn’t afford to buy it himself. Since ancient times, carmine red—still found in lipsticks and Cherry Coke today—has come from the blood of insects.", "title": "Color: A Natural History of the Palette", "url": "http://www.goodreads.com/book/show/19596.Color", "average": 3.79, "cover": "https://images.gr-assets.com/books/1427998243l/19596.jpg", "reviews": 543, "authors": [{"url": "https://www.goodreads.com/author/show/11729.Victoria_Finlay", "name": "Victoria Finlay"}], "type": ["Nonfiction", "Art", "History", "Science", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/19596.Color", "http://www.goodreads.com/book/show/1405173.Color", "http://www.goodreads.com/book/show/11024819-colour", "http://www.goodreads.com/book/show/1650926.Jewels", "http://www.goodreads.com/book/show/22223609-the-brilliant-history-of-color-in-art", "http://www.goodreads.com/book/show/36149228-black", "http://www.goodreads.com/book/show/16410220-faith-in-conservation", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}