{"ratings": 252, "userreviews": [{"userName": "Felicia A", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/1739957-felicia-a", "userReview": "Definitely starts out with a bloody, gory bang, and continues that way throughout. I won't rehash the plot....others on Amazon have done it well....check it out if you are interested. This debut novel from Patrick D'Orazio has a lot of things going for it. 1. He lets you know UP FRONT AND CENTER that it is the first of a trilogy. COOL. I absolutely hate getting sucked into a book, the universe, the characters, and then winding up on some sick, blood-drenched cliffhanger, and then having to wait a year or two for the follow up, which YOU have to track because no one calls you and lets you know it's out.2. He knows the genre. He knows the \"rules\" and follows them. There are no superpowers, mind control, extraordinary capabilities attributed to his zombies. Not that there's anything wrong with that, but I do like my zombies mindless and shambling.3. His characters are not sterotyped or cliched. The main character, Jeff, is kind of an idiot. At least at the beginning. He is a stumbling, fumbling, graceless, suburban guy who has survived an ongoing traumatic situation and is figuring it out as he goes along. I like that he doesn't have all the answers; I like that he's not a gun-toting he-man out to dominate the world; I like that, even though he is hell bent on revenge, he retains his humanity.While I enjoy reading they military-focused zombie books, the technical and/or scientific ones, and even some with bazooka-toting macho brutes as the hero, the characters in this book were real people. They were our neighbors, our friends, they were US.Terrific debut effort, and I am looking forward to the sequel(s)."}, {"userName": "Eva Leger", "userReviewDate": "Oct 08, 2010", "userURL": "http://www.goodreads.com/user/show/1336770-eva-leger", "userReview": "A friend of mine let me borrow this because she knows much more about the zombie genre than I do. She got me started on \"zombie\" and \"end-of-the-world\" books and even though I have quite a few under my belt I'm still eager to hear her recommendations. This took me longer to read than it usually would have and I'm still not sure why. That's not to say it's bad, it's not. I liked it a lot. I loved how \"realistic\" it was. The characters were just like you would imagine yourself being. Not everything happens perfectly, or perfectly wrong like in some books, it happens like you would think it might happen. The actions in the book aren't forced (unlike these other \"reviews\") and flow along great.The characters are ones that I didn't just love or hate - it went both ways. And then back again. And THAT makes dor a good character with a story like this. The fact that the reader knows right up front that this is the first of a trilogy goes a loooong way with me also. I'm looking forward to reading the following books. Oh and Patrick, you don't \"need\" the forced \"reviews\" on PBS - just hand a few zombie lovers the book and ask them to review. You'll get much more honest, more heartfelt, more REAL reviews. ;-)"}, {"userName": "Alexis Winning", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/6192649-alexis-winning", "userReview": "I'm on a cheap/free E Book kick right now, mostly because I'm broke (hahah), but also to give some new names a chance. I decided to start reading some zombie books as if they were all part of the same event-just different people in different places. The best thing about Comes the Dark is how Patrick D'Orazio captures his characters in a natural way. There is an organic flow to their personalities and development which makes it very readable. Having said that, I felt as though there was something missing, and I hate to say that I can't put my finger on what exactly that is. At times I felt incredibly disengaged. This is part of a series, so go into this book knowing that. Will I read the sequel? probably. All in all, a nice quick read, but nothing new is really offered. It's not necessarily a bad thing, I just always look for it. As I said, it's interesting to \"read\" a book of this genre as if it were all the same event. Kind of puts a different spin on the whole zombapocalypse literary genre."}, {"userName": "Craig DiLouie", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/5230065-craig-dilouie", "userReview": "Just finished COMES THE DARK, a survival horror novel by Patrick D’Orazio. I had fun with it. It reminded me of David Moody’s AUTUMN in that the zombies are literally rotting off the page. The world is realistic, lived in, smashed to pieces and almost hopeless. With its basic survival plot and extreme gore and violence, it serves as excellent meat and potatoes zombie fiction for fans who like their read bloody."}, {"userName": "Joan Sigmon", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/9156743-joan-sigmon", "userReview": "Excellent zombie fiction! Worthy of the company of the Walking Dead series. Good cliffhanger ending! Bought on Amazon.com. This is the first book of the Dark Trilogy. Book 2 and 3 I got on Smashwords.com."}, {"userName": "Matt Nord", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/5100706-matt-nord", "userReview": "OK, let me preface this review by saying the same thing I have and will say before most of the reviews I have and will be doing. I had never read anything by Patrick D'Orazio in the past. Not even a short story. I suppose that would be as opposed to say reading something by Stephen King or Clive Barker. They may do some different things from book to book, by you kind of know their style and for the most part what to expect.I had read some of Patrick's posts on forums and his blog and some of his book reviews on Amazon. Other than that, when I got my hands on this book, it was the first time I'd read anything by this author.And here's the part where I start gushing. Let me assure everyone that I am not in any way related to Patrick: he's not my cousin or brother or anything like that.I will try to remain objective...That may be hard, though, because I really have to say that this book was one of, if not the, best zombie outbreak/apocalypse novels I have ever read. I don't say that lightly, as I've read some pretty great books, including WWZ and the As the World Dies trilogy. So, am I saying that this book is better? ...I'll let that question hang in the air.The story starts after the outbreak has already run rampant for a short amount of time. Short as in several weeks, so zombies everywhere, kind of like Dawn of the Dead.The only thing I hate about doing reviews is that if I talk about too much, I'll inevitably give away a lot about the story that should only be found out by the reader as they are reading it, so...****FOLLOWING ARE SOME SPOILERS - SPOILER ALERT!!!****The book starts off with the main character returning home from a scavenging mission only to find that the undead have broken into his house and murdered his wife and kids. Not a very happy opener, but we are talking about a freaking zombie outbreak, here, so you wouldn't expect that, anyway.Jeff, the main character, nearly has a breakdown after this (who wouldn't) but manages to pull out of it and escape from his house after it's attacked by a mob of the undead. Things go downhill from there.The rest of the book consists of Jeff finding a survivor in his neighborhood and they try to escape. Later they are saved by a team up with a couple other survivors.The thing I really noticed is that the characters aren't stereotyped. They all have a very \"real-life\" feel to them, like they could easily be members of your neighborhood. The young kid they meet up with, with his moodiness and unwillingness to open up, reminds me a lot of a certain 13 year old I happen to live with.Another thing that I really appreciated was the attention to detail, especially when concerning the use of military weapons and terminology. Being prior service Army, one thing I can't stand is seeing a movie or reading a book and having them completely screw up the names of weapons, equipment or vehicles or the ranking structure and who outranks who. It drives me nuts, so this was a nice surprise. Either Patrick is prior service or he took the time to do the research.The tension was just right in the situations with attacks and with interactions with other survivors. The first house Jeff and Megan tried to stay in had a scene in it that was just freaking crazy. (Again, I don't want to give away too much in case those who haven't read the book didn't heed my earlier warning) There was another scene with two survivors in particular that they ran into that just escalated perfectly. You could really see a little misunderstanding turning into a shitstorm.There was some gore, but it wasn't over the top. Sometimes you are reading a book and that's what you are expecting and looking for, but it's not always needed, even in zombie fiction. It's like the less is more type thing. You know, like coming home and your wife is wearing one of your long, button-up shirts. You can't see everything, but what you do see is just enough to let you use your imagination...Another note about this book: it's only the first in a trilogy! So, of course, you have to know that there is going to be a cliffhanger at the end! I'm looking forward to seeing where the story progresses and how the whole thing ends.Library of the Living Dead Press definitely has a winner on their hands hear. I'm not trying to insult any of the other books I've read or reviewed, but to answer the above question, \"Is the book better?\" To put it simply, yes."}, {"userName": "Heather Faville", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/2697506-heather-faville", "userReview": "You must be strong now. You must never give up. And when people make you cry and you are afraid of the dark, don't forget the light is always there.Comes the Dark: A Zombie Novel is the first in a trilogy written by Patrick D'Orazio. It is the tale of Jeff Blaine, your normal everyday Joe (or Jeff as the case happens to be) dealing with the recent end of the world. Six weeks have passed and the population of survivors appears to be nearly void. The only things that appear to be out and about are the never-ending hordes of rotting corpses that are only interested in eating the flesh of any survivor they manage to come upon. Our protagonist has lost everything including his interest in continuing to survive in this frakked up world. (Sorry, just finished watching all of Battlestar Galatica) Jeff holds on to his last remaining bit of sanity by wreaking havoc on the monsters that took his life away. Not long after he starts his rampage Jeff learns that he is not alone, other survivors he comes in contact with force him to rethink the path of destruction he was setting upon. Jeff has a decision to make as the darkness threatens to consume him, either sit back and allow the pain that has overtaken his soul destroy him or stand up and continue to fight alongside these other survivors and to live.Comes the Dark is a very grab you by the seat of your pants and drag you through the mud look at the life of a normal every man during the aftermath of a zombie outbreak. Seriously, Jeff is the guy next door...you know the one with no military background and no significant survival training who, may be out to shoot pool with the guys Saturday night and goes to church with his family on Sunday morning. The guy who has maybe done a bit of shooting with his dad as a kid, but has no real training and is learning on the fly what his best options are for defending himself from the undead. For this reviewer, this was a fantastic change of pace. So many times in a zombie novel the main characters are either in or have been in the military or they just magically have sharpshooter capabilities. Where are the main characters who miss their shot and end up having to wrestle a zombie off of him/her in order to get away and then try that shot again or break out the melee weapon? RIGHT HERE in Comes the Dark!We also meet Megan, Jason and George who also seem to have this neighbor down the street feel to them. The moments of tension between the survivors are completely believable, in my opinion, although I could have dealt with a bit less. There were times where the cause of bickering was so ridiculous that I wanted to toss Megan and/or Jeff out of the van and into the arms of the zeds. That being said, consider some of the things we choose to argue about in our \"normal\" world, now add the stress of a zombie biting at your heels...I can kind of understand.Now I can't do a proper review of a zombie tale without mentioning our favorite pus_bags. The zombs in Comes the Dark are not running zombies...they are of the shambling variety with no real signs of thinking ability. There is gore but, for me, the gore is detailed enough to give you a good image of what is going on, but not enough to completely gross out the reader.Overall, I thoroughly enjoyed Comes the Dark: A Zombie Novel and I greatly look forward to getting my hands on Into the Dark."}, {"userName": "T.W. Brown", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/3234548-t-w-brown", "userReview": "Patrick D'Orazio's \"Comes the Dark\" is one of the newer novel releases from The Library of The Living Dead. We in the genre of zombie fiction are a rather close knit community. We suffer from a rather high school-esque syndrome of cliques. So let me put it on the table, Patrick has reviewed some of my work very positively and has submitted to my anthologies over at May December Publications. Well, I'm not dealing with Patrick. I am reviewing a book by Mr. D'Orazio. Comes the Dark announces itself as the first of a trilogy. I will say honestly that the first half of the book seemed very standard. We meet Jeff Blaine; he is discovering that his wife and children were attacked while he was out searching for food. I didn't feel sadness as I read. Instead, it was a sense of numbness. The grief-card has been overplayed in our genre at times. I did feel the streams of action to be a bit confusing and hard to follow at times. But I always feel criticism and praise must go hand in hand. All praise is disingenuous while all criticism is mean and pointless. So, my criticism is simple, the action scenes get a little muddled and there was one instance where supplies were being loaded into the van while it was surrounded. Having read some of Mr. D'Orazio's work I have high expectations, that's why I have no doubt that his sequels will only get better.There, that's out of the way. You may think I didn't like the book by what I've said up to this point. You would be wrong. There is a story building here that will have me adding the next title to my shopping cart the day it is released. But? But? Yes, I've withheld my praise until now because, like Mr. D'Orazio's Comes the Dark, if you don't push past the beginning, you will miss the good stuff. When Jeff Blaine meets a young woman after escaping his house, I held my breath. I actually read a story where the central character was going on about just losing his beloved wife, fought through a hellish zombie escape to retrieve a necklace that was a gift from her, rescued a woman at the scene and had sex with her with the dead corpses still littering the room. Bravo! Mr. D'Orazio. What a spectacular relationship dynamic between the two central figures. Their interactions are realistic and very well done. And an excellent job is done establishing the personalities of not just the main character(s), but also those he brings in as supporting cast. D'Orazio takes his time letting you get to know these people, preventing them from just being names on a page. Each one gets established with a genuine identity. The two-dimensional, generic characters that tend to dot the zombie landscape is not a problem here. Comes the Dark is a worthy read. The descriptive ability of Mr. D'Orazio plays against him early on, but levels off and finally is able to showcase the talent of a man known for short stories as an up-and-coming name to watch in the novel realm. I anxiously await the next entry in the series and applaud the cliffhanger ending."}, {"userName": "Vincenzo Bilof", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/12076643-vincenzo-bilof", "userReview": "While reading D’Orazio’s zombie novel, I kept thinking about the classic zombie films that form the foundation of this beloved genre; well-designed zombies and gore that still put CGI cartoon films to shame are the highlights of the classic Romero and Fulci films. Memorable scenes are ingrained in the consciousness of those who still enjoy them; with D’Orazio’s Comes the Dark, we’re treated to a zombie tale that Tom Savini would be proud of. The imagery is paramount to the novel’s progression; the details underscore characterization and allow for the story to come alive. Our two principle characters are Jeff and Megan; “average Joe” types who struggle with the emotional cost of their new world. This seems like a rather simple and over-used premise; however, the interaction between the characters is well-articulated and their evolution throughout the story is a testament to D’Orazio’s skill as a storyteller. Is this a story where two people from different worlds, who are both coping with loss, end up falling in love with each other? That sounds predictable and done to death, doesn’t it? From the unsettling opening chapter, we learn that we have no ability to make predictions based on what we’ve read before. This is a work that stands alone; when we’re introduced to Megan, we have no expectations, and the intrigue that drives the story forward through the devastated landscape and its variety of well-developed characters allows a reader to feel both uncomfortable and invested; these people are US. The method by which D’Orazio delivers his narrative is the focal point; you won’t find video game zombies in this book. No war against a bunch of anonymous looking “things” that are getting their heads blown off. D’Orazio is a zombie designer; nightmarish undead cannibals are painted with words, as is the gore. The tone in the novel isn’t nihilistic, which is important to note, considering the amount of detail that goes into the descriptions. Make no mistake—the book is dark—but we don’t feel hopeless; Jeff is willing to do what it takes to survive, and his courage can be inspiring, considering the circumstances. We can believe in Jeff—and Megan—because they’re victims; just because they survived the initial outbreak doesn’t mean they’re better off, emotionally or physically. I daresay the book does a better job with the emotional toll than the Lori-Rick fiasco in everyone’s favorite zombie television show…I’ve read a number of zombie books that I don’t review; one of the most important things they’re lacking is the substance that fills the pages of D’Orazio’s story: zombies that reach out from the pages, and a beautiful American wasteland. For post-apocalyptic thrills, this is a zombie classic. I could see the zombies coming for me, and I could feel the desperation of our protagonists. If you enjoy zombie fiction, this is a must-read"}, {"userName": "Shana Festa", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "Suburban mini van driving, dad, Jeff Blaine, is coming home from a post-apocalyptic jaunt to the local Piggly Wiggly to get his wife and kids a post-apocalyptic Slim Jim and Big Gulp. You see, a few weeks earlier, the world ended when a “virus” reduced the world’s population to a bunch of undead, flesh-eating, moaning and groaning ghouls, leaving what was left of the world to shelter in place and try to survive. Jeff comes home from his trip to the store and gets a heck of a surprise when he finds that oddly enough, the thumb latch to his side door isn't enough to withstand the roving bands of undead. Needless to say, Jeff finds his entire life, or what is left of it, swallowed up by the apocalypse [see what I did there]. In his grief, Jeff sets out on a path to survive and along the way, meets up with some people. You remember what Pete from Muppets Take Manhattan said, “Peoples is peoples.” Jeff rescues some, kills some and even plays board games with some. Together, Jeff and his group live day to day to day and well, by the end of the book they have made it three days.D’Orazio has a descriptive manner that I was nearly horrified by. If Eli Roth had a typewriter, he might have written some scenes in Comes the Dark. At the outset of Jeff’s family problems with the Apocalypse, I found myself having to skim ahead as D’Orazio’s descriptions of the situation and Jeff’s solutions were a tad intense. The detail of the horrors that Jeff and his band of not so merry survivors endure, is enough to make your nether regions pucker, until they become old hat and just get to be words. You can only describe the explosion of the undead's organs in so many ways, you understand.While I enjoyed Jeff's journey, I did find it rather short and thin. Jeff starts out a broken man because, well the whole family and zombie thing. After telling us that his family was his life, Jeff then goes into the old, gotta survive and can't dwell on the past mode and that is pretty much the last we hear of them. Jeff then starts his journey to survival, with a twist of revenge-driven, undead killing spree thrown in. The survivors Jeff gathers just so happens to include the dreamy-eyed housewife from down the street, 'cuz evn through it's the end of the world, you never know... Actually, the rest of the survivors gather around Jeff all have really nice back stories, but they are presented after the fact, like a coda to the main story. I'm not sure how much I like that and think that had their stories been brought out in the overall narrative, rather than an appendix, it might have fleshed out the story more.In the end, the book is like its ending, quick and sharp, but certainly left me wanting more."}, {"userName": "Rebecca Besser", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/4717868-rebecca-besser", "userReview": "Comes The Dark is the first in a zombie apocalyptic series by Patrick D’Orazio.Patrick D’Orazio knows how to suck you into his characters, so that you feel like you’re seeing life, and death, through their eyes.Comes The Dark starts with Jeff, a man returning to his home and family from a foraging trip, after the zombie apocalypse has ravaged the Earth. What he finds changes his life, his existence, and his soul. He makes the hard decisions necessary to shut out his past and continue his existence in the future.A journey begins, and along the way an eclectic array of companions are collected, all suffering from the effects of the world as it is now: full of zombies. They struggle with their humanity as they fight against the endless horde of undead shamblers.Every turn, every town, brings a new challenge and another battle to stay alive. They strive to make the right choices, but every move they make seems to lead them to more trouble.Will they make it to see the next day? Or the next after that?This novel was very scrupulous in keeping things ‘real’. So much so, that nothing takes you out of the story, wondering or thinking something might not be possible. The characters are all unique in their own way and compel you to believe they’re real, despite the fiction aspects of the book. I give it a 4 stars rating for characterization and realism.Read more of my reviews at RB Reviews: http://www.rebeccabesser.com/rb_revie..."}, {"userName": "Geoff", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/2802754-geoff", "userReview": "This was an okay read, but I didn't like the fact that the story just stopped at a crucial point, without resolution or any decisive story arc, meaning that anyone interested enough now has to go and buy the next book to find out. Trilogies should have an overarching story, yes, but each book should also be a complete tale within that story.It would have been a three-star review if this hadn't happened."}, {"userName": "Chris Gaida", "userReviewDate": "Sep 21, 2010", "userURL": "http://www.goodreads.com/user/show/682624-chris-gaida", "userReview": "I liked this book. Comes the Dark spends most of it's time on the run. You never know who or what they might meet on the road. I enjoyed the characters, and how they each persevere through problems. One problem I had with it is that it was way too short of a read. You get into a groove and then it suddenly stops. I am also not a fan of the cover art."}, {"userName": "Felicia A", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/1739957-felicia-a", "userReview": "YAYYYYYYYYYYYYYYYYYYYYY!!! Another editing project is now a published book! I did read the original, self published version, which was great, and was lucky enough to have a chance to edit the Permuted Press version of Patrick D'Orazio's COMES THE DARK. Books two and three will be published by Permuted as well."}, {"userName": "Jennifer Daniel", "userReviewDate": "Nov 14, 2010", "userURL": "http://www.goodreads.com/user/show/1650869-jennifer-daniel", "userReview": "Pretty typical as far as zombie fare goes, but it was made more fun for me since I bought the book at a Horror conventiona and got to chat up the author as I was signing my copy. I supppose I will have to read the next installment of the trilogy if I want to know the fate of the survivors!"}, {"userName": "Katherine", "userReviewDate": "Feb 20, 2012", "userURL": "http://www.goodreads.com/user/show/3812507-katherine", "userReview": "One of the best zombie triologies out there."}, {"userName": "Mathew", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/6116458-mathew", "userReview": "Good quality, average zombie novel."}, {"userName": "Frank", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/3916152-frank", "userReview": "This is going to be a great series. Watch as two suburban schlubs survive the undead. I love stories that don't include the super prepper and the bad ass girl. The characters in this book are everyday people without a clue on how to survive. I look forward to the rest of the trilogy. Love the back stories of the main characters as well."}, {"userName": "Justin", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "In Comes the Dark, the first volume in Patrick D'Orazio's The Dark trilogy, we're thrust right into the heat of a zombie apocalypse as main character Jeff, your average suburban dad, comes home from a supply run to find his wife and kids dead (and about to be undead) at the hands and teeth of the ghouls that have overrun the world. It's a dramatic and moving introduction to the character, but it's very effective as well, as you watch Jeff progress from grief to rage to cold and calculating. Yes, he's interested in survival and does end up hooking up with others, but this is a guy who really wants to make the zombies pay, and it's going to be fun to see how he goes about that.Zombie 411 - For the most part, these are your basic Romero-style zombies, at least in terms of basic biology and means of infection. They run and scream though, which may put off a few purists.I have to give D'Orazio credit for a couple of things right off the bat, like the fact that this book isn't told in first person perspective or in a diary format. I also LOVE that he starts the book while the zombie apocalypse is in full swing and doesn't bother to explain how or why it happened. Unless you're willing to do the scientific heavy lifting (see Mira Grant's Feed (The Newsflesh Trilogy)), don't even try. Just give me some compelling characters in a very dire situation and go from there. D'Orazio seems to get this, and the book is more enjoyable as a result. He also sets up and choreographs some pretty terrific action sequences.I did have a couple of issues with the book, but in the end they're relatively minor. The dialogue was pretty unbelievable at times, and I get that the author was trying to illustrate the characters' emotional states, but it just didn't seem natural. Also, the end was a bit abrupt, though that's something that seems to plague (no pun intended) a lot of zombie trilogies. The first two books seem to end when a certain page count is reached.Aside from a couple of minor issues, Comes the Dark was a totally enjoyable zombie novel, and a great introduction to this series. I'll definitely be checking out the remaining two books in the trilogy to see where D'Orazio takes these characters.PS - There is a novella's worth of additional stories dealing with the supporting cast tacked onto the end of this ebook. I thought that was a nice addition, and agree with the author that they would have wrecked the pace had they been included in the main book."}, {"userName": "Michelle", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/7957821-michelle", "userReview": "I love Zombie novels. I don't like cookie cutter zombie novels. I especially don't enjoy cookie cutter zombie novels that are painful to read. If you remove the penis and add some breasts to this author you have Joyce Carol Oates. Well that is unless she is writing under a pen name and actually wrote this novel. I don't like her writing. I despise it so bad that when I come across any of her books, I hiss. This book was written just like she writes her books....Over descriptive. I like detail just as much as the next person, but when it gets tedious and you start to drift off that's when you know it's been over done. Comes the Dark is unoriginal (hence cookie cutter reference) and exhausting. Nothing in this novel made me go \"Wow\" or \"OMG\". Jeff was a serious suburban douche who I was hoping would have been eaten. His companion Megan was written so girly like I was expecting to her get the vapors. Her personality was non existent and if she was as malnourished as she was described to be, she wouldn't have been able to do much of anything especially be able to get all up in the face of George who outweighed her probably by a good 200 lbs. The one thing I couldn't understand was why Jeff and Megan did not want to drive George home. Neither one of them had any hot dates scheduled for the next century. They had the gas and a vehicle. How hard would it have been to drive up there and see if his wife and kids were holed up in the house like he said they were. He stated he was less than an hour away from home when he got stuck. This book has way too many unrealistic actions taking place. I know there are a few more books after this, but in all honesty I have zero desire to read them."}, {"userName": "Joe Stamber", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/4900418-joe-stamber", "userReview": "The narrator of an audio book can bring it to life and give it an extra dimension that the printed word alone doesn't always do. Unfortunately, that isn't the case here. Comes the Dark is read by a man with a hoarse voice, as if he's suffering from a sore throat. To make matters worse, he makes the main male character hoarse which is even more annoying. Add in the perpertual whine of the leading female character and it becomes a battle to keep going.I can't say whether or not reading Comes the Dark in print would have squeezed an extra star out. I do like Apocalyptic tales, and although the zombie genre isn't my favourite I can usually get along with it. The problem is, the reader needs to want the main characters to win through. I didn't. I just wanted their irritating voices to be silenced.Like many PA novels, Comes the Dark is a bit of a road trip. We go somewhere, zombies turn up, the protagonist(s) escape, we go somewhere else... You get the idea. Many authors have made this kind of routine exciting enough for it not to become routine, if, er, that makes sense. D'Orazio does vary things with other survivors and different locations, but it never really got going well enough for me.I'm wondering whether to carry on as Comes the Dark is the first third of a greater (in length) work, maybe things will improve. This first volume does stand out for having one of the most ridiculous dialogue tags I've read, \"he replied in an even tone\", so perhaps it will be worth continuing in case there are any more hidden gems."}, {"userName": "Jeremy Dyson", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/11296958-jeremy-dyson", "userReview": "Not a bad debut novel, but don't expect to be blown away. The writing shows some real potential, but the novel really lacks much in the way of plot structure. The beginning was very slow, and for a while the characters are literally going nowhere. I kept expecting the story to take off, but it never really does until the final pages. The characters seem to still be meandering aimlessly, and their personalities are about as vague at the end of the book as they are initially. very little is done to develop any of the main characters along the way.Where the author succeeds, mainly at the end of the novel, is in creating scenes that have some intensity and action. The zombie sequences are okay, but the interactions with other dangerous groups of survivors is where the author finally begins to hit his stride.Hopefully some things are set up for the author to do a little more in the next installment. While this book didn't do as much for me as some others, I think the writer has done some good things and will look forward to checking out some more."}, {"userName": "Thalarctos", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/1317474-thalarctos", "userReview": "I couldn't finish it. I have to say that the writing was interesting and the pacing was great. The author is very good at his craft.Which makes it even more a pity that the main female character is so stereotypical. When you're tempted to write the word \"hysterical\" about any female character, you really should think twice about whether that character is really fleshed out, or just a two dimensional spazzy woman who is there for the main character to rescue.I kept reading far past the point where I might otherwise have stopped because the writing and action was good. But after the \"WIMMEN DRIVERS AM I RITE\" scene and the \"BITCHES BE CRAZY, WANT ME TO APOLOGIZE BEFORE WE CAN RUN FROM THE ZOMBIES\" scenes, I had to give up.Pity."}, {"userName": "Kathy", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/30678524-kathy", "userReview": "I've read ALOT of zombie books and this one started out really good, got my interest from the first page, and kept my interest despite the \"too much detail\" on the gore. I try not to do trilogy's unless the book is just that good, ad this one is....almost. At the end of the book, the writer just stops, like there's a page missing stop. THEN, the next chapter, which in my opinion should've been at the beginning, is the background info on the characters! WHAT?? I was too angry to even read any of that and I doubt I'll read any more of his books if this is how he writes. I like when books make some sense."}, {"userName": "Lorre", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/6349980-lorre", "userReview": "I really liked Comes the Dark!Lot's of action, a good amount of gore, likeable charachters... What I didn't like was the sometimes overdone details and descriptions. I like extensive descriptions because they help visualize the world but when they get too long and too many insignificant details are given it hinders the flow of the story.The story was cut off very abruptly, I'm glad the next book is already out cause I would've been pissed off with an ending like that without the next book.The Dark Stories at the end, back stories of the charachters, were a nice extra!"}, {"userName": "Liquid Frost", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/1231979-liquid-frost", "userReview": "This is a tale of the zombie apocalypse and how ordinary folks do their best to survive. There are no special-ops, sword-wielding, 20 versions of black-belt, type heroes in this tale. The pace of the story is good and the author includes loads of character back-story at the end of the book, which if it had been included in the body of this first book - well, it would have been skim-city. Although this book didn't hook me into actively pursuing the following books in the trilogy, I found it to be a pleasant read."}, {"userName": "Rachel Aukes", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/20070212-rachel-aukes", "userReview": "This book easily makes it onto my top 3 list for favorite zombie books. The action starts on page one and never lets the characters catch their breath. I loved the sense of realism. Each character had their own personality and it fits. Some zombie books give you superheroes... in this book, these are real people stuck in a world I'd hate to be. I never knew what was coming next, so I couldn't stop until I'd read the entire book late last night. Without a doubt, the next book in my to-be-read pile to get read is book 2 in this trilogy!"}, {"userName": "Darren Dilnott", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/24963189-darren-dilnott", "userReview": "This started off brilliantly with a high level of excitement, horror, and chaos. A man finds his wife being eaten by a Z and when she reanimates he has the heartbreaking task of putting her down for good. He finds his children savaged. He has lost everything that has ever been important. Yet within a short period of time he is joking, and messing with Megan like a couple of flirting teenagers. I couldn't get this and it spoilt an amazingly written story."}, {"userName": "Joe Amber", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/19739968-joe-amber", "userReview": "Love this series, love this author. Read the Kindle version with some added history that I was just so happy with. Story takes place outside of Cincinnati Ohio, and me being from Southwest Ohio I am just enthralled with these works. Author even invited me to set up a meeting to have my books signed, but I'm seeking new unread copies before I take him up on the offer. Great books, great author, great guy."}, {"userName": "Jeanette", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/31528104-jeanette", "userReview": "Zombies...I have been looking for a new zombie series when I happened across this book in someone's blog. And I'm so glad I did ! The characters are fleshed out really well. The storyline is good...can't wait to see where they call home.If you enjoy lots of gore and lots of nasty, stinky zombies then this book is found you!Nice job Mr. D'Orazio...."}], "description": "The end came with a whimper, not a bang. The virus engulfed the world in a matter of days. The infected die…and then rise again. Governments collapsed, armies disappeared, and entire civilizations turned to dust as the human race tore itself to pieces.Jeff Blaine had a good life: a beautiful wife, adorable children, and a nice house in the suburbs. He liked his job, loved his family, and spent his lazy suburban Sundays out on the deck, barbecuing with the neighbors. Things were perfect, until everything fell apart. And no matter how hard Jeff tried, he could not spare his family from the horrors scratching at the door.Now, with his family gone and his life in ruins, the only thing left is raw anger and pain. As the world continues to sink into darkness, Jeff does as well. So he ventures out into the desolation with no better plan than to destroy as many of the monsters that stole his life away before they destroy him as well.But soon Jeff will discover other survivors unwilling to give up. They will force him to decide whether or not to give in to the venom that gnaws at his soul. Should he continue to fight to survive, or succumb to the things that come with the dark?", "title": "Comes the Dark\n      \n          (The Dark Trilogy #1)", "url": "https://www.goodreads.com/book/show/17721551-comes-the-dark", "average": 3.52, "cover": "https://images.gr-assets.com/books/1364842752l/17721551.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/4214808.Patrick_D_Orazio", "name": "Patrick D'Orazio"}], "type": ["Horror", "Horror", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/17721551-comes-the-dark", "http://www.goodreads.com/book/show/8925926-comes-the-dark", "http://www.goodreads.com/book/show/17410853-comes-the-dark", "http://www.goodreads.com/book/show/11482399-the-dark-trilogy", "http://www.goodreads.com/book/show/9779888-into-the-dark", "http://www.goodreads.com/book/show/11408563-beyond-the-dark", "http://www.goodreads.com/book/show/10835685-a-soldiers-lament", "http://www.goodreads.com/book/show/21222118-zombie"]}