{"ratings": 7176, "userreviews": [{"userName": "Nancy", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/763271-nancy", "userReview": "Posted at Shelf InflictedI recently read Kathryn Stockett’s The Help and while I enjoyed this story tremendously, I wanted to read something that was less uplifting, more realistic, and told from the perspective of an African-American. Anne Moody’s powerful memoir was the perfect choice. This is a well-told and fascinating story about the author's life growing up in rural Mississippi, and her fight against racism. Her story is chronologically told, from the author's youth in rural Mississippi, her education, family relationships, poverty, racism, violence and finally, her involvement with the Civil Rights Movement. The last section of the book devoted to Moody’s activism was riveting and deeply disturbing. She participated in the heavily publicized Woolworth sit-in, which was known for its violence, and was deeply shaken by the deaths of four black girls in the 1963 bombing of the 16th Street Baptist Church in Birmingham, Alabama. 1963 Woolworth Sit-in, Jackson, MississippiOnce a religious child, she questioned her faith in God. \n“Now talk to me, God. Come on down and talk to me. You know, I used to go to Sunday school, church, and B.T.U. every Sunday. We were taught how merciful and forgiving you are. Mama used to tell us that you would forgive us twenty-seven times a day and I believed in you. I bet you those girls in Sunday school were being taught the same as I was when I was their age. Is that teaching wrong? Are you going to forgive their killers? You not gonna answer me, God, hmm? Well if you don’t want to talk, then listen to me. As long as I live, I’ll never be beaten by a white man again. Not like in Woolworth’s. Not anymore. That’s out. You know something else, God? Nonviolence is out. I have a good idea Martin Luther King is talking to you too. If he is, tell him that nonviolence has served its purpose. Tell him that for me, God, and for a lot of other Negroes who must be thinking it today. If you don’t believe that, then I know you must be white, too. And if I ever find out you are white, then I’m through with you. And if I find out you are black, I’ll try my best to kill you when I get to heaven.” \nMoody provided details about intimidation, beatings, shootings, and other acts of violence enacted by the Ku Klux Klan against African Americans and their white supporters and about the institutionalized racism that kept many black families mired in poverty. I just wish that Moody had spent more time with the story of her activism and the efforts and sacrifices of Martin Luther King, Medgar Evers, and others, rather than mundane details about childhood. I am thankful to Anne Moody and all the other young people who sacrificed their jobs, safety, and lives to make a stand against injustice and change the course of our history and for their stories that keep them alive in our minds and hearts."}, {"userName": "Thomas", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "3.5 starsLove Anne Moody's fierceness. I feel like we sometimes idealize activists in society without realizing that they too have doubts and flaws. Moody's memoir blends strength and vulnerability, showcasing her thirst for change as well as the frustrations she faced as a poor black woman who grew up in the south. I appreciated reading about the development of her passion for activism and her experiences working with racial justice groups such as SNCC, NAACP, and CORE. Above all else, Moody's personality shines: an unapologetic, motivated spirit who works to get what she wants, no matter which boy or bigot stands in her way.While the first 200-250 pages of Coming of Age in Mississippi felt discursive and muddled, I would still recommend this book to anyone interested in civil rights, coming of age tales, or memoirs written by people of color. What Moody lacks in finesse, she makes up for in conviction."}, {"userName": "Larry Bassett", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "Coming of Age in Mississippi was first published in 1968. The author, born in 1940, is six years older than I am so her life is relatively contemporaneous with mine, a factor that intrigues me although our lives are not at all the same other than that calendar years overlap. In 1968: the war in Vietnam is fully underway and politically divisive in the U.S.; Martin Luther King Jr. is assassinated in Memphis; Robert Kennedy is assassinated in San Francisco; Black power salute of raised fist at Olympics medal ceremony; Richard Nixon wins the presidential election, George Wallace gets 13.5%; Apollo 8 circles the moon.The book covers two decades of the life of Anne Moody from the time she was four years old until she graduated from Tougaloo College in Jackson, Mississippi. She was the oldest of nine children and was working by the time she was nine to earn money to help support her family. At first she mostly worked as a mother’s helper with household chores and children. They called them maids back then and it was almost always black women/girls working for white women. The minimum wage was $1.25/hour in 1965. But they mostly didn’t get minimum wage. Lucky to get a dollar a day.The first part of the book is titled Childhood and is about 30% of the book. It is about Anne until she finished eighth grade. This section is really about living a life of poverty more than about being a Negro, as they called themselves then. Plenty of meals were beans and bread, clothing for school was often used, Essie often could bring home leftover food from the homes she worked in. And she had to work to help the family. There was a new baby just about every year. In spite of a life with material need the family was strong and Essie was a good student. Some of the women who employed her helped expand her universe and helped her with her school work. Her parents had very limited education and were not much help for Essie with school. She was the 8th grade homecoming queen foreshadowing that she would achieve great things in her life! Now she was ready for high school.The second section is about 25% of the book and is titled High School. Emmett Till, a fourteen year old black boy, was murdered in Mississippi for whistling at a white woman about the time school started. Annie was fourteen. She heard about this from another student while walking home from school. Because Annie had been working as well as being a fulltime student, she had not kept up with current events. Discussion of racial issues in school was nonexistent. There was no newspaper at home. But this killing emphasized to her that she could be in danger simply for being a Negro.Working in a white home, she heard a group of women talking about the NAACP. Although she made an effort to find out what the letters meant and what the organization stood for, her mother was hesitant to give her much information since she was used to keeping in her “place” as a Negro. Annie was able to find a woman teacher who spent time with her outside of school telling her about Negro issues. Teachers could not talk about this in school; they would be fired if they did. The teacher who helped her was fired at the end of the year although Annie never knew why and never saw her again.The third section is titled College and is about 10% of the book. She attended Natchez Junior College for two years on a basketball scholarship. She then transferred to and graduated from Tougaloo College. During college she joined the NAACP.  I thought of Reverend Dupree and his family who had been run out of Woodville when I was a senior in high school, and all he had done was to get up and mention NAACP in a sermon. The more I remembered the killings, beatings, and intimidations, the more I worried about what might happen to me or my family if I joined the NAACP. But I knew I was going to join, anyway. I had wanted to for a long time. As a result of her activities in NAACP, Anne cut off most contact with her mother and family in Centreville so there would be no retaliation against them. She also was involved with SNCC (Student NonViolent Coordinating Committee) while she was in school. The final third of the book is titled The Movement and is about Anne’s work in the civil rights movement. After college Anne began working for CORE (Congress of Racial Equality) full time in Canton, Mississippi, mostly on black voter registration. The monthly pay was $25, when she was paid which was not all the time. During this period black activist Medgar Evers was shot and killed in front of his home, four young black girls at church were killed by a bomb and President Kennedy was assassinated in Dallas. Anne also went to the March on Washington for Peace and Freedom, where Martin Luther King Jr. gave the I Have a Dream speech. Her dedication to be out front in the movement was costly to her health due to lack of resources for nutritious food and incredible stress. The book concludes with Anne boarding a Greyhound bus for Washington to tell about the conditions in Mississippi. She sits on the bus: I sat there listening to “We Shall Overcome,” looking out the window at the passing Mississippi landscape. Images of all that had happened kept crossing my mind: the Taplin burning, the Birmingham church bombing, Medgar Evers’ murder, the blood gushing out of McKinley’s head, and all the other murders. I saw the face of Mrs. Chinn as she said, “We ain’t big enough to do it by ourselves,” C.O.’s face when he gave me that pitiful wave from the chain gang. I could feel the tears welling up in my eyes. Anne Moody is not a polished professional writer. This book helped me once again to remember and honor the sacrifice that so many have made to bring what we have of freedom and justice to this country, and particularly to the South.From the back cover of the market paperback: Written without a trace of sentimentality or apology, this is an unforgettable personal story – the truth as a remarkable young woman named Anne Moody lived it. To read her book is to know what it is to have grown up black in Mississippi in the forties and fifties – to have survived with pride and courage intact. In the now classic autobiography, she details the sights, smells, and suffering of growing up in a racist society and candidly reveals the soul of the black girl who had the courage to challenge it. The result is a touchstone work: an accurate, authoritative portrait of black family life in the rural South and a moving account of a woman’s indomitable heart. Somehow I learned and internalized that SparkNotes and similar books are not OK to refer to and use. I guess that was because I was taught and experienced that people used them to cheat in school or to avoid doing the actual reading of a book. They were the same as the interlinear Latin/English textbook that was passed around by the kids in the back row of my high school Latin class. More recently as I have dealt with some reading and memory disabilities I have found that SparkNotes and audio books and movies based on books can all help me to have a better experience with books. I no longer have any formal academic need to read so all of my reading these days is done for pleasure or personal betterment. Even though SparkNotes and the like still have a negative emotional connotation or gut feeling for me, I am trying to get by those feelings to approach them as an occasional resource when they are available. I have found some of these resources are available online for free. I am trying to feel comfortable using various tactics to remove or lower barriers to reading comprehension. SparkNotes for this book are available online at http://www.sparknotes.com/lit/comingo...Another common helping resource for me is to read GR reviews for a book as I read the book. As I have drifted into reading more mysteries, I try to avoid spoilers. However, I have found that knowing an outcome simply changes the reading experience for me rather than ruining it. I lived through the national events of this book so there were no spoilers!I had Coming of Age in Mississippi on my bookshelf and was encouraged to read it at this time by reading the very popular book The Help. A GR review put that idea in my mind:  I recently read Kathryn Stockett’s The Help and while I enjoyed this story tremendously, I wanted to read something that was less uplifting, more realistic, and told from the perspective of an African-American. Anne Moody’s powerful memoir was the perfect choice. This is a well-told and fascinating story about the author's life growing up in rural Mississippi, and her fight against racism. Her story is chronologically told, from the author's youth in rural Mississippi, her education, family relationships, poverty, racism, violence and finally, her involvement with the Civil Rights Movement.Source: http://www.goodreads.com/review/show/... This book gets an extra star from me because it covers a time and events that were important to my growing up. I admired and was amazed by the willingness of people in the civil rights movement as well as regular black people to risk their lives and livelihoods in the struggle for justice. As a high school junior, I watched the 200,000 person March on Washington on TV and was moved to make my own contributions to social change in the 1960s and 1970s.Four stars to experience the life of one young black girl becoming a woman in a tumultuous time and place."}, {"userName": "Doreen", "userReviewDate": "Apr 27, 2012", "userURL": "http://www.goodreads.com/user/show/8083149-doreen", "userReview": "A friend returned from a trip to Mississippi and bought me this book during her visit there. I looked forward to reading it because it promised an interesting first-hand perspective, that of Anne Moody, an insider in the civil rights movement or, as Sen. Edward Kennedy stated, \"A history of our time, seen from the bottom up.\" I was greatly disappointed because it offered little insight.The autobiography often read like a catalogue of events: I did this and then I did this and then. . . From my studies and readings, I'm familiar with the facts of what happened; I expected to read about the impact of the events. It would have been interesting to read about how she felt, especially during events like the Woolworth's lunch counter sit-in. Only 3 1/2 pages are devoted to this protest, and the focus is on what everyone did, not on her feelings at the time. Being a participant, Moody could have added to the historical record by describing personal reactions, thereby increasing the reader's understanding and arousing his/her empathy. Her account is the equivalent of a newspaper story.When there is an attempt to describe her feelings, it is not very revealing. She does faint a lot: \"Everything around me went black\" (387) and \"my head began to spin\" (402). Other reactions to situations are to move slowly or not at all: \"It took me about an hour to change my uniform\" (388) and \"I sat there for a while with my face buried in my hands\" (414). There are many contradictions in the book. She makes statements like, \"if [the white teachers] were at all like the whites I had previously known, I would leave the school immediately\" (267). This statement totally ignores previous comments: \"I thought of how nice these [white] people were to us . . . [They] treated me like I was their daughter. They were always giving me things and encouraging me . . . \" (59). Summarizing her first experiences at working for whites, she says, \"The five I had worked for so far had been good to me\" (118). Her treatment of her family is likewise contradictory. With her sister she moves into an apartment and then leaves her to cover the costs: \"We had just moved into that apartment, we owed at least one hundred dollars on the furniture, and she couldn't take care of those bills alone\" (399). She admits to \"hat[ing] to run out on Adline\" (399), but she does it nonetheless. Then, when Adline does not attend Anne's graduation, Anne says, \"She had lied and said that she would come to the graduation\" (419), although Adline had made no such promise when she spoke about attending the ceremony (400). \"Publisher's Weekly\" praised Moody for telling her story \"without a trace of see-what-a-martyr-am-I\" but I found she could be full of self-pity. She talks about her exhaustion and having to wear the same clothes all day and losing \"'about fifteen pounds in a week'\" (324). She is upset that no family member attends her college graduation: \"'Here I am,' I thought, 'alone, all alone as I have been for a long time'\" (415 - 416). She repeatedly bemoans the fact that she can't go home, totally disregarding the fact that she was the one who chose to sever ties with her family: \"'These people just ain't no damn good! Everybody in this fuckin' town ain't no good. I'm gonna leave this goddamn town right now'\" (210). Incidentally, after this tirade, she complains that her stepfather is \"'running around the house cursing all the time'\" (214). Moody can be admired for some candor in the book. Blacks are not viewed as totally innocent; for example, she decries the treatment her mother receives from her second husband's family \"for no reason at all than the fact that she was a couple of shades darker than the other members of their family. Yet they were Negroes and we were also Negroes. I just didn't see Negroes hating each other so much\" (59). Several times she mentions her frustration with the apathy of the people she is trying to register for the vote. She is present for Martin Luther King's speech in Washington, but she dismisses it: \"I sat on the grass and listened to the speakers, to discover we had 'dreamers' instead of leaders leading us. Just about every one of them stood up there dreaming. Martin Luther King went on and on talking about his dream. I sat there thinking that in Canton we never had time to sleep, much less to dream\" (335). There is no doubt that Blacks suffered under the Jim Crow laws, but some of Moody's descriptions seem over-the-top. The arrest of protesters in Jackson and the presence of police dogs, though they \"were not used\" (298), prompt her to compare the situation to Nazi Germany. Policemen are compared to Nazi soldiers (305) and a fairgrounds detention centre is called a \"concentration camp\" (360).The writing style is tedious to say the least. The repeated use of short, simple sentences becomes very monotonous: \"I was there from the very beginning. Jackie Robinson was asked to serve as moderator. This was the first time I had seen him in person. . . . Jackie was a good moderator, I thought. He kept smiling and joking. People felt relaxed and proud\" (285). Where did Publisher's Weekly find \"good writing\"?!Moody has a story worthy of telling, but it could have been more effectively told. As is, it is a tedious read which details mundane events and omits the personal emotions that would have made the book a very compelling read.Please check out my blog (http://schatjesshelves.blogspot.ca/) and follow me on Twitter (@DCYakabuski)."}, {"userName": "Christy", "userReviewDate": "Sep 27, 2007", "userURL": "http://www.goodreads.com/user/show/248667-christy", "userReview": "Anne Moody's autobiography is a very matter-of-factly told tale of, as the title indicates, growing up in Mississippi. Particularly, Moody reveals the difficulties inherent in growing up poor and black in Mississippi in the mid-twentieth century. The first half of the book is devoted to her childhood and high school years and is at times somewehat uninteresting (I don't really care about her winning Homecoming Queen, for instance), but it does show really clearly the depths of poverty that many African American families descended to in the absence of real freedom and real jobs. Despite my hesitations about the first half of the book, those personal elements that I find less than interesting are not unimportant to the development of the latter part of the book. Because of the audience's knowledge of Anne Moody's inner life and personal trials and triumphs, readers are better able to identify with her and to see her struggles as real, rather than exaggerated or specific to her alone.The second half of the book is much more interesting. When she goes away to college, she gets involved with the NAACP, CORE, and the SNCC and begins her political work. During and after college, she takes part in sit-ins, helps to organize voter registration drives, and spends a year working in Mississippi despite poverty, hunger, and continual death threats. The chapters that tell this part of her story serve as a valuable document of the practical elements of the Civil Rights movement. It's easy to hear of Martin Luther King, Jr., and to read Malcolm X's autobiography and to get caught up in the grand ideas of the Civil Rights movement, meanwhile forgetting about the grassroots organization required to support those big ideas and overlooking all the other people involved in the movement. The courage of those willing to risk their lives and their sanity in order to help create a better world is undeniable, and Anne Moody proves herself to be one of those courageous people who give hope to the rest of us.However, the book does not end on an optimistic note. Published in 1968, Moody's autobiography only reaches 1964. This is significant because at the end of the book Malcolm X and Martin Luther King, Jr., are still alive, but by the time the book was published, Malcolm X had been assassinated and Martin Luther King, Jr., had been recently assassinated or would be soon (depending on when in 1968 the book was published). This reflects a significant change in the political climate and in the tone of the Civil Rights movement between the events described and the publication of the book. Moody uses this shift to help make her political argument. She has said that she saw herself as an activist, not a writer, when she wrote this book, and the conclusion of the autobiography proves this. The Anne Moody of 1964 speaks to the audience of 1968 to question the efficacy of nonviolent methods and the value of appealing to the federal government for help (when their policies and practices have caused many of the problems and continued to cause social and economic inequities even when the laws regarding segregation were changed) and to call attention to the necessity for all people to keep working toward a solution (not just public figures or middle-class blacks). The final lines are filled with doubt and, in their doubt and disillusionment, force the reader to evaluate his or her own confidence or doubt. Is Moody right to doubt the movement? Is she right to wonder whether going to Washington to protest will create change? And if she is right, then what should be done? Her book is a blunt reminder of the people who live in poverty and suffer the most from racism (whether that racism comes from individuals or the government) and a call to action that insists that talk is not enough."}, {"userName": "Judy", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "Words that come to mind after reading this book....compelling, fascinating, obsessively drawn into, ultra-honest. Coming of Age in Mississippi published in 1968, but it could have been published 2008 as far as I'm concerned because I felt like I was there with Anne Moody. Outhouses, walking to school, riding buses from town to town, beehive hairdos, who cares? I was there and hardly noticed those things. I found this book to be a motivating story of how a poor woman rose above her circumstances to speak out for her people. Anne Moody was one of the students who staged the sit-in at the Woolworth lunch counter in Jackson, Mississippi. From there, she went on to help lead other passive activism. Skip the history textbooks, I think this should be a must-read for all U.S. high school students. Every American needs to know what is in these pages.Moody records the dialogue the way it was spoken. I felt this added a cultural dimension to the memoir increasing the you-are-there feel of the book. Shonuff, I liked this one enough to give it 4 stars."}, {"userName": "nettebuecherkiste", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/5279356-nettebuecherkiste", "userReview": "Anne Moody wird 1940 als Essie May Moody in Centreville, Mississippi geboren. Ihre Kindheit ist geprägt von tiefer Armut und der langsamen Erkenntnis, was es heißt, Mitte des vergangenen Jahrhunderts eine Schwarzafrikanerin im Süden der USA zu sein. Wie viele Schwarze muss Moody früh Geld verdienen, um überhaupt zur Schule gehen zu können, was die meisten Weißen gnadenlos ausnutzen, die die Schwarzen für wenig Geld hart arbeiten lassen. Die Ausnahmen lässt Moody jedoch keineswegs unerwähnt, sie soll während ihrer Ausbildungszeit auch viel Unterstützung durch wohlwollende Weiße erfahren.Moodys Autobiografie ist in vier Teile gegliedert, „Kindheit“, „High-School“, „College“ und „Die Bewegung“. Im ersten Teil erzählt Moody von prägenden Ereignissen, der Erkenntnis, dass Weiße anders sind, anders essen können als die Schwarzen, oder die Begegnung mit zwei Onkeln im Kindesalter, die eine weiße Hautfarbe und einen weißen Vater haben, aber dennoch niemals als Weiße „anerkannt“ werden können, und die Absurdität des Rassismus verdeutlicht:„Now I was more confused than before. If it wasn’t the straight hair and the white skin that made you white, then what was it?“ (Seite 35)Besonders bitter ist die Erfahrung, die Essie May bzw. Anne mit der Familie des neuen Freundes ihrer Mutter machen muss, mit dem Rassismus unter Farbigen:„Then I began to think about Miss Pearl and Raymond’s people and how they hated Mama and for no reason at all than the fact that she was a couple of shades darker than the other members of their family. Yet they were Negroes and we were also Negroes. I just didn’t see Negroes hating each other so much“. (S. 59)Vor allem dieser erste Teil des Buchs liest sich flüssig wie ein Roman.Anne Moody erweist sich als begabte Schülerin und geht nach der Grundschule zur High-School, wo sie weiterhin große schulische Erfolg erzielt, auch im Sport. Mit ihrem Eintritt in die High-School und ihrer zunehmenden Erfahrung mit weißen Arbeitgebern beginnt sie, sich für die Bürgerrechtsbewegung zu interessieren. Harte Arbeit bringt sie aufs College, und nun beginnt Moody ernsthaft, sich für die Rechte schwarzer Bürger zu engagieren. Dies bleibt in ihrer Heimatstadt nicht unbemerkt, was so weit geht, dass es zu gefährlich für sie wird, ihre Familie zu besuchen, die sie eindringlich bittet, ihre Arbeit für die Bürgerrechtsorganisation einzustellen. Auch wenn ich mich schon ein wenig mit der Bürgerrechtsbewegung beschäftigt habe, war es mir vor der Lektüre dieses Buchs nicht klar, wie gefährlich nicht nur ein solches Engagement für die Rechte schwarzer Bürger, sondern schon die bloße Existenz als Afroamerikaner in den Südstaaten war. Dies führte auch zu Konflikten innerhalb der schwarzen Bevölkerung, was sich in folgender Aussage Moodys spiegelt:„I think I had a stronger resentment toward Negroes for letting the whites kill them than toward the whites.“ (S. 136)Anne Moodys Autobiografie ist ein eindrucksvolles und sehr zugängliches Zeugnis über das Leben als Afroamerikaner im Süden der USA. Das Buch ist angesichts der Übergriffe der US-Polizei auf schwarze Bürger, die Schwarze grundsätzlich für verdächtig zu halten scheint, aktueller denn je. Anne Moody ist leider 2015 verstorben, trotz aller Erfolge der Bürgerrechtsbewegung hat sie es nicht mehr erleben dürfen, dass Afroamerikaner nicht mehr diskriminiert werden."}, {"userName": "Diane ", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/143168-diane", "userReview": "A first-hand and painfully honest account of what it was really like to grow up poor in rural Mississippi and then to ‘come of age’ and be a part of the onset of America’s Civil Rights Movement.Told in first person narrative, this book is like having a conversation with the author, Anne Moody. In fact, if there were audios when this book was published (1968) it would have been a treasure to have had Anne Moody narrate this book. But that’s not to be. If you’ve read fictionalized accounts of this time period in the South (1940’s to 1960’s), I would highly recommend reading this book, because there is just no comparison. In Anne Moody’s autobiography, you will read of the struggles, the brutality, the sit-ins, the killings, the prejudices, the shear and constant exhaustion, will and determination of those involved in the movement paved the way for change from someone who lived it. It is not a pretty story.It is still hard for me to comprehend that this blemish on our history was not at all that long ago. In my opinion, this should be required reading for high schools."}, {"userName": "Kressel Housman", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/575806-kressel-housman", "userReview": "My interest in the civil rights movement was piqued recently from Remembering America, the memoir of JFK’s and LBJ’s speechwriter. Since that book gave a top-down look at the origin of civil rights legislation, I wanted the bottom-up viewpoint of someone who participated in the movement. I knew of this book because it was recommended (though not assigned) in a History of the Sixties class I took back in college. The professor praised it so highly, I was able to remember the name “Anne Moody” these twenty-odd years later. To borrow a slogan from a different 1960’s movement, “The personal is political,” so it’s fitting that this is a personal memoir. For the first 250 pages, Ms. Moody tells about her childhood and adolescence in the segregated south. Her personal story may not have been typical, but it does exemplify one young girl’s struggle to rise above poverty and prejudice in order to get an education. Ms. Moody was smart, hard-working, and determined. It’s impossible to read this without admiring her.The last quarter of the book is all about the movement. Among other things, Ms. Moody participated in the famous sit-in at Woolworth’s in Jackson (see picture below) and was beaten up for it. If there’s anything that this book made clear, it was the violence of the white backlash. I’m amazed that so many civil rights activists, black and white alike, had the courage to go on fighting in the face of death threats, beatings, lynchings, and bombings. I was sympathetic to her family members who begged her to stop. After all, she wasn’t just putting herself in danger, but them, too. And yet, on the other side, I could see why Ms. Moody questioned Dr. King’s teachings of non-violence. Who wouldn’t be enraged at the bombing of a church that killed four innocent black girls? And those are just the well-known murders. I was a little disappointed that the book did not mention the Civil Rights Act of 1964 at all. It did mention JFK’s assassination. But LBJ was at the nadir of his disfavor with the public when the book was published, so perhaps Ms. Moody had nothing good to say about him at that point. I wonder what she’d say today.This book was a fast, absorbing, and informative read, though I would not say it is the definitive book on the civil rights movement. It is exactly what I was looking for initially: the perspective of one person on the ground. Nor is it a rose-colored account; at times, it is downright raw. But the personal is political, and for that reason it’s simultaneously a slice of history and a lesson in the values of bravery and self-discipline."}, {"userName": "Trish", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/17025129-trish", "userReview": "As much as I respect Anne Moody and all that she accomplished and experienced in her life, this autobiography didn't really touch my heart or my soul in any way. Perhaps Moody is stoic by nature, I don't know. To be fair, I also blame the writing. Moody writes in a very systematic, detached, expressionless style that made it difficult for me to feel what she's feeling or to do more than sympathize for a few moments before I was forced to move on to the next notable event in her life. This book reads almost like a text book. It was missing the personal touches of emotion that I expected from a book like this. I also found it strange that, despite having 6-8 siblings, Moody hardly mentions any of them throughout her childhood, high school, or college years. We barely get a glimpse of Adline and Junior (Moody's real siblings) and that too, only when Anne is 23 and grown. I don't know, I just wasn't as impressed with this autobiography as I expected to be. Last semester we read The Killer Angels by Michael Shaara for our history class and I liked it... more than I thought I would. It was emotional and sentimental and heartbreaking... I guess I just wanted to be moved by this story. I kept waiting for the emotions to hit me, but they never did."}, {"userName": "Aubrey", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "The more I thought about it, the more it seemed that the federal government was directly or indirectly responsible for most of the segregation, discrimination, and poverty in the South.\nI've noticed a tendency towards One Memoir to Rule Them All when it comes to times of turmoil, whether 1960's US civil rights or the Shoah or Guantanamo Bay. Thus, it is likely an uncomfortable shock for some to realize that there aren't only multiple survivors of German concentration camps living in their country, but that they mostly live in poverty, and aren't nearly as safely tucked away in death or international recognition as readers of \"Schindler's List\" would like to think. Brutal as recently reviewed Twelve Years a Slave is, its story happened long ago, and it isn't nearly as uncomfortably familiar as the 1940s-1960s events of Mississippian Anne Moody, what with its former slave catcher and now military industrial complex cops and questions of blackness, gender, blackness and gender, nonviolent protest, active resistance, gun use, gun control, federal vs state, federal hand in hand with state, the KKK (still legal, by the way), government conspiracies, education, child labor, and other singularly US twists on the concept of your money or your life. This isn't a happy read by far, but it is a true one, and it gives the reader no sense of \"progress\" being anything more than the long, hard, depression inducing, terrorized slog that it is. If, upon reading this, you can stand to call the US police force anything other than the most powerful terrorist organization ever known. you are a liar and a fool.If you made a plot diagram of 'Coming of Age in Mississippi', you wouldn't get anything near to what is expected of a bildungsroman. You can make CoAiM fit if you strip enough of the context away and leave the bare bones of schools attended, grades received, and year of college degree accomplished, but you would miss the entire point of a four year old black girl escaping a burning house and charging into a life of endless child labor fenced in by scams, segregation, and terrorism, the reality of which hits Anne Moody right the around the age the average white kid is getting bored of Chuck E. Cheese and starting to fool around a little too much around the tenets of abstinence. Moody's life is the incontestable record of the origins of gun control (always becomes an issue when black people get louder about rights to self defense), the War on Drugs (when the fear wore off in the '60's, narcotics had to step in), and Black Lives Matter, all of which makes sense if one doesn't cling to one's bad faith and see the US as anything but the antiblack settler state that has merely evolved with the times rather than progressed. If one gets frustrated with Moody's lack of denoument and repeated mental breakdowns, you're not getting it, but that won't stop you from unconsciously benefiting from her trials and tribulations.Moody's memoir is definitely one of the more cynical ones out there regarding civil rights and black people existing as human beings, and considering how, just the other day, I had to listen to some nonblack individual saying black people weren't actually empowered by 'Black Panther', I don't think Moody would be impressed with the current situation. Still, this instance of nonblack people explaining how black people actually feel is a perfect example of why Moody's writing is important, coming as it does from a young black woman in an age when probably the most easily acquirable text coming from that demographic was a slave narrative, if that. It's amazing how much has changed (the beginning of 'Selma' is recorded in this text), and unforgivable how much has remained the same. So long as the whites of the US permit high school age survivors of mass shootings to be terrorized by the alt-right, all that change for the better will go to waste.\n\"As long as I live, I'll never be beaten by a white man again. Not like in Woolworth's. Not any more. That's out. You know something else, God? Nonviolence is out. I have a good idea Martin Luther King is talking to you, too. If he is, tell him that nonviolence has serve its purpose. Tell him that for me, God, and for a lot of other Negroes who must be thinking it today. If you don't believe that, then I know you must be white, too. And if I ever find out you are white, then I'm throughout with you. And if I find out you are black. I'll try my best to kill you when I get to heaven."}, {"userName": "Andy", "userReviewDate": "Mar 29, 2008", "userURL": "http://www.goodreads.com/user/show/690315-andy", "userReview": "“The revolution will put you in the driver's seat” (Gil Scott-Heron).As a child in the United States, I was confronted every single February with what I thought was considered to be the civil rights movement. Through various novels I learned about slavery and the conditions on plantations around the world. I was taught that African-American's were given the right to vote in the United States in 1870 with the Fifteenth amendment but faced endless struggles actually making it to the ballots for the next 80+ years. I was taught that on August 28, 1963 a huge rally took place in Washington DC and with the phrase “I have a dream” America suddenly woke up and men were made equal. Most libraries and bookstores have entire sections dedicated to the civil rights movement and African-American literature, so when given the task to read another book on the civil rights, this one an autobiography, I found myself saying “So what? How is this going to be any different?” Coming Of Age in Mississippi is brutal, that's how. It's not brutal in the way of painting startling images in my mind, hoping and praying they aren't as graphic as I picture them. Instead it's filled with brutal commentary, the likes of which has never been shown to me. Anne Moody remembers her time growing up with great detail and she intends to retell this time exactly how it occurred, even at the risk of alienating herself from the civil rights movement the rest of us are taught.One of the reasons that Coming Of Age In Mississippi succeeds the way it does is because it operates like a story. Anne Moody keeps her tones truthful and real throughout her time growing up and well up into her participation within the civil rights movement. Though her description of her time in Canton, Mississippi are the most telling and effective parts of her story, it is the events that lead her to Canton that perhaps bring a light to the Civil Rights Movement as well or better than other literature I have read. However, the thing that I took away from Moody's story of her early life in Mississippi was not the divide between blacks and whites, but between blacks and other blacks, especially seen from her step-father's family towards her and her mother, “I just didn't see Negroes hating each other so much” (Moody 60). It is through this feeling that Moody especially feels from the “Yellows” that I begin to see the Civil Rights Movement in a bit of a new light. It did not come to be with everyone on the same page, to fight against the oppression at the hands of whites. The Civil Rights Movement illustrates an event that came to be because it was a chance for these same African-Americans to finally unite. Anne tells the stories of her mother trying to please her mother-in-law Miss Pearl, and failing time and again because she was “just a couple shades darker” (60). This spurs more than anything Moody's leap headfirst into the Movement. She is tired of blacks hating blacks, and more than anything wants to change that. Tired of the jealousy that runs through those who have nothing to grab onto, Moody realizes that is not only the whites who are sick, but her black brothers and sisters as well.Throughout the pages of Coming Of Age In Mississippi Anne Moody keeps the reader engaged through her miraculous life story. She paints herself in an accurate mode as a woman to be admired, someone we can all learn from. However, it is towards the end of the book when Moody makes a sudden realization that is going to make the biggest difference in the Civil Rights Movement yet. When speaking to teen-agers back in Canton, she sees something in them that she has been looking for in the older folks she had been working with for years. When she makes this realization that “They felt the power to change things was in themselves” (371), Anne realizes that everything she has worked for looks like it is going to pay off soon. It is the next step in the story, to be continued. More than anything, Coming Of Age In Mississippi is a story about a society in the midst of evolution, not revolution. It was a long time coming for Anne Moody and though she might not be a part of the change that is about to occur, she helped lead people to that step. If anything is to be learned from Moody's story it is that if we can make a difference as individuals, we will then learn to make a difference as communities. The revolution came because of the evolution of thousands of other Anne Moody's around the country, thousands who “put themselves in the driver's seat.”"}, {"userName": "Emma Deplores Goodreads Censorship", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/5229326-emma-deplores-goodreads-censorship", "userReview": "I first heard this book recommended as an alternative to The Help: a memoir about the segregated South and the civil rights movement, written by a black woman who became an activist. After reading it, I consider it an excellent alternative to all those books about the segregated South written by white people – you know the ones, with their cardboard too-good-to-be-true characters who exist to be victims. You get much more texture and nuance, a far more credible picture of individuals and their communities, from someone who came from that world than from an outsider.Anne Moody was born to a poor family in rural Mississippi, where she grew up caring for many younger siblings and started work cleaning houses at a young age. The early part of this book is less about segregation than growing up poor – tellingly, Moody remembers exactly how much she made at every job she had, and as a teenager she had some pretty awful ones. Apparently she’s called herself an activist rather than a writer, but don’t believe it. First, even when the subject matter is mundane, her writing keeps it interesting: simple but clear and very readable, and she takes creative license in writing scenes and dialogue (this may annoy some purists, but didn’t bother me). Second, the book never feels like an op-ed piece; Moody writes about events as she experienced them at the time, so, for instance, even though later she comes to despise all the white people in her hometown, this doesn’t stop her from writing positively about early employers in the first section of the book.In college Moody became involved with the civil rights movement, which forms the focus of the later part of the book. She participates in some sit-ins, which get ugly, but her main activity is trying to sign black people up to vote, which in rural Mississippi at the time was a dangerous occupation: the workers regularly get threats from the white community, they’re harassed by police, and for several years Moody is unable to visit home for fear of harm to her family. It’s no surprise when by the end of the book she’s burned out and disillusioned; one of the things this book shows is the far-reaching effect of even a small amount of violence and intimidation. You don’t need the KKK beating everyone up, as they do in the more melodramatic novels set in this period, to explain the system of social control that existed. Moody and others showed extraordinary courage in standing up to that system, and if some elements of her story seem foreign to us now (all right, y’all, we’re driving across the South in an integrated car! I hope we make it), it’s because of the brave people who took risks to change society. Sometimes I think we forget that the civil rights movement wasn’t just marches and the “I Have a Dream” speech (ironically, Moody was not a fan of that speech. She didn’t think the movement needed dreamers).At any rate, I consider this memoir well worth reading, especially for Americans interested in how much our country has changed (and how much it hasn’t) in the last 50 years. It grabbed my attention right away and proved to be an enthralling read, and I’m only sorry Moody hasn’t published more since this came out in 1968; I’m sure she has more to say."}, {"userName": "Ashley", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/2077101-ashley", "userReview": "EVERYONE needs to read this book. It's a true story of a young civil-rights activist. After she wrote the book, which you will not be able to put down once you start, she went into seclusion because many people bashed her for writing her story. It's heart-wrenching and hopeful. Anne Moody's courage is obvious and she never asks for your sympathy. You will learn so much from this book."}, {"userName": "Mississippi Library Commission", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/6193041-mississippi-library-commission", "userReview": "Completely forthright and never sentimental, Anne Moody's autobiography is an eye opening experience. Moody, who was the same age as Emmett Till, was deeply affected by his kidnapping and murder and a fiery determination to fight for justice and equality was born. This book is a must read. Highly recommended."}, {"userName": "Emily", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/413694-emily", "userReview": "I knew nothing about this book before I randomly picked it off the shelf at the library......But I'm pleasantly surprised that it's an easy and interesting read. As Moody matter-of-factly recounts her childhood experiences in the deep south, starting from age six or so; as her understanding of her environment grows, so does her discontent, idealism and determination to work for change. Portions devoted to describing how her own physical beauty, intelligence, courage and athletic skill was greater than those around her seem out of place and unnecessary, but this is an autobiography, so the author can tell her own story as she pleases.The book ends in 1964, at a point when Moody finds herself exhausted and struggling with fatalism after several years of involvement with the Civil Rights Movement. She is swept up with a crowd and onto a bus headed for Washington, D.C. As they sing \"We Shall Overcome,\" she despairingly wonders if there is any truth in the lyrics.Forty years later, I sometimes feel the same way. It is difficult to believe such an environment as 1960s Mississippi ever existed, and it is sad to see some of the same layers of racism, sexism, and (more than the others) the culture of poverty that remain all over the U.S."}, {"userName": "Jenny.p", "userReviewDate": "Oct 14, 2007", "userURL": "http://www.goodreads.com/user/show/141432-jenny-p", "userReview": "I recently re-read this book, remembering it as one of the most important books in my life and the book that ultimately led to my decision to major in history in undergrad. and focus on Southern history. While it is hard to criticize this book because Moody's life trials are so profound, I found myself growing annoyed with this Moody on this second read; she is consistently self-absorbed and narcissistic throughout. To the point where her stories of activist work in the Civil Rights struggle took a backseat descriptions of how great she looked in her new dress, how all the boys thought she was the prettiest, and how she was the prettiest. I tried to be forgiving, but there are so many others of her generation who have managed to tell their stories without obsessing over these sorts of details. Moody makes herself likable and real, and it is a very quick read. While this will remain a standard requirement on all History 7B reading lists in universities, and I believe it should stay there, it is important this isn't the only memoir used to illustrate the struggle of the times..."}, {"userName": "Orinoco Womble (tidy bag and all)", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/20738920-orinoco-womble-tidy-bag-and-all", "userReview": "I was curious to read this book. Born white and working class in the Midwest in 1962, the Civil Rights struggle didn't really affect me personally, and we heard little about it. \"Demonstrations\" and sit-ins were held in other places--pretty far away, when you live in a small rural town. It was something \"college kids\" did on weekends \"to make trouble\" according to my southern-born father. I never saw a black person close enough to speak to until I was in middle school. There simply weren't any around where I lived. On the surface, her experience would appear alien to anything I lived.However, Anne Moody tells her story in a way I could relate to: feeling like an outsider in her own family, deeply marked by poverty and emotional isolation growing up. She desperately wants her family to be a supportive network, but unfortunately it isn't; her father and mother split when she is a small child, and her mother's common-law husband dislikes Moody. I wonder, though, about the passages that describe how he turned against her when she was in her teens. Did he really not touch her? As an abuse survivor myself, my inner radar tingled when reading these passages; perhaps she wrote it this way to avoid hurting her mother? That's what it seemed like to me. Even her extended family (grandmother, aunts etc) tend to turn away from her, seeing her as a \"troublemaker\" or simply unreasonable in her demands for a different life. She is, after all, black and a woman in 1950s Mississippi (and later New Orleans). For the adults around her, her expectations can reach no farther than domestic service, marriage (or not) and babies.No wonder, then, that Moody threw herself heart and soul into the Civil Rights Movement. She needed a cause, a purpose to her life that could make her feel she was making a difference, not just for herself but for the larger community. The people involved in the Movement become her \"family\", as described toward the end of the narrative, providing what little support she had. The end of her story feels cut short, as the members of her cell join others on the way to another march, but by this time Moody's physical and emotional health were flagging after months of short food and sleep and overexertion. She felt jaded and cynical, and then berated herself with feelings of guilt--guilt that her efforts weren't making a difference to the beatings and killings, and guilt that she was so tired she just wanted to quit. But where could she go but on?The narrative ends with the phrase: \"I wonder. I wonder.\"So do I."}, {"userName": "Jennifer (aka EM)", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/1393336-jennifer-aka-em", "userReview": "caveat - I stopped about 2/3rds of the way. The style was so emotionally flat that it \"evened out\" the horror of the racism she was enduring, and the events she was witnessing, with the effect of almost sanitizing them. This was compounded by Moody coming across as self-centred (at least) and arrogant (at worst). The reconciliation scene with her mother was a case in point: she acknowledged she had behaved horribly but then ... kept behaving horribly, and with the shallowest, most egotistical excuse. Also, she described things from such a distance that it was kind of hard to get connected to them - and very hard to get connected to her, since she was so cut off from her own emotions.Now, of course, that kind of affectless response to horror in the re-telling s a classic product of trauma, but here's where I say to every memoirist: yeah, but ... the story needs you to tell it. I couldn't even keep going to the point where she becomes an activist. Maybe something would have clicked for me then, but really, at the most it would have meant a strong finish to a book that was inconsistent, slow, poorly-written and unengaging despite its massive potential to be exactly the opposite."}, {"userName": "529_Quincy Owens", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/4861955-529-quincy-owens", "userReview": "Coming of Age in Mississippi, the autobiography of Anne Moody is a long journey full of coincidental brushes with many moments that have shaped American history during the Civil Rights Movement. As such, Anne Moody’s story symbolically stands as evidence that there would have been no “movement” without the millions of people who marched, protested, and fought for their rights. Later in the book, Anne remarks about a march in Washington that drew millions of people; she was surprised to find she had “dreamers” instead of “leaders” in the movement. This was an obvious reference to Martin Luther King’s “I have a Dream,” which forces the reader to individually consider the various viewpoints of each person we have seen featured staring at MLK from the crowd the day he gave the speech. Maybe, you can try and dismiss Anne’s sentiment as unique, but her involvement in SNCC and college places her squarely among the people you would expect to follow MLK’s every word. Moody, starts her story as a young child growing up. As she grows older, more mature and more knowledgeable her diction changes as well. It was a pleasant detail to examine once she was an adult. She tells her story in a very “matter the fact” manner devoid of most figurative language accept when used in dialogue. It is also very interesting to note how afraid she was at speaking up as a child. Considering her involvement in the Civil Rights Movement later in life, I assumed she would have always been outspoken. As Moody grows older she makes many hard decisions despite the danger, alienation, and disapproval she would meet with. I must admit, that the book offers an abundance of mundane details about her life which can only be appreciated by considering the path from cowardice to bravery. In considering this question, the comments about indoor plumbing, moving from home to home, job to job, new clothes to old clothes, and organizations to organization becomes the unexpected proving grounds for a courageous critical woman."}, {"userName": "Lillian", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/7356972-lillian", "userReview": "There are many levels and layers to this book. Firstly, it is a story of a young African American girl and her early childhood and the poverty and struggles of her family in Mississippi. It is also a story of a fiery intelligent young women dealing with the racism, poverty and hatred that she encountered growing up in such a G-d forsaken place, the author's own struggles with her family ,and her search for autonomy. Most importantly it covers a portion of the history of the civil rights movement , freedom summer, and the heroes who participated in it, sacrificing their lives and sense of security for justice. It is well written, and honest, the author is unabashed in her opinions . She does not mince words , sentiments or emotions. When I compare this story to The American Ghost, a recent novel, American Ghost pails in its insipid, view of the south and the consequences of it's terrible hate filled racist history and it's made up love story and fabrications. American Ghost never deals on a real level with the problems engendered by a a racist society.An incredible memoir, this book should be mandatory reading for all those interested in studying this sad, brutal period of American History."}, {"userName": "Rachel N", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/724269-rachel-n", "userReview": "A sad, sobering, down-to-earth look at the Civil Rights movement. The author does not claim to be a \"writer,\" but an activist who wanted to tell her own story. With that in mind, this story was truly one that needed to be told. This book is required reading in some colleges. It provides us with an inside look at growing up in the south in the 50s and 60s - a painful aspect of American history that cannot be ignored. The author was a part of the famous sit-in at a Woolworth's lunch counter in Mississippi and was severely mistreated. Criticisms: 1) An unreasonable amount of coarse language was a downside; the story would have been equally impacting without the swearing. 2) I was saddened by the author's incessant lack of hope. She lived a very tough life and seemed unable to ever pull herself up and out. Her story ends on a bitter tone and she discontinued her work in the Movement. I'm glad I read the book as it painted such a vivid picture of what \"regular people\" in the South have been through, but I can't help but wonder if the author still lives in sadness and bitterness today. I would like to know that she lives in spiritual freedom, but she has chosen to live in seclusion from the public eye."}, {"userName": "Julie", "userReviewDate": "Nov 03, 2008", "userURL": "http://www.goodreads.com/user/show/229919-julie", "userReview": "This was a pretty remarkable book, one that truly grows on you as you follow Annie Moody through her life. What works about Coming Of Age is the juxtaposition of writing style and storyline. Moody lets her story unfold using an unsentimental, no-nonsense tone. While her early years growing up in a small rural Mississippi town in the '40s were not marked by violence, the early stirrings of the Civil Rights movement prompted a rapid and ruthless white repression of black civil rights. The spare nature of her prose made the frustrations and hopelessness of Civil Rights Workers and average black folks all the more poignant. This was the kind of book that should be required reading for any American, especially considering the truly vile racism that this year's election has unearthed in some of those \"pro-America\" parts of our country - and, sadly, in some blue states, too."}, {"userName": "Em", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/1793382-em", "userReview": "This is what I wanted The Help to be. I feel uncomfortable with fictional books on racism that become popular because the main character is a white person that heroically saves the African Americans. I prefer to hear about racism from an African American perspective. This is a true story about Anne Moody growing up in rural Mississippi and the institutionalized racism that keeps her family in poverty. She ends up being bravely involved in the Civil Rights Movement. This book is gritty and real. She tells her story without embellishment and it is raw and horrifying. It should be required reading in schools. One of the best books I've read on the Civil Rights movement. I loved it!"}, {"userName": "Elisabeth", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/1372331-elisabeth", "userReview": "I finished this book over a month ago. I wanted to think about it a bit before I wrote a review, but I am still mulling it over. So here is my review, mostly consisting of quotes that I want to remember, but I know I'll re-read this book several times in the years to come.One thing I really appreciated about this autobiography was Anne Moody's perspective on events I consider seminal to the civil rights movement in Mississippi. On Emmett Till's kidnapping and murder:\"Before Emmett Till's murder, I had known the fear of hunger, hell, and the Devil. But now there was a new fear known to me-the fear of being killed just because I was black. This was the worst of my fears. I knew once I got food, the fear of starving to death would leave. I also was told that if I were a good girl, I wouldn't have to fear the Devil or hell. But I didn't know what one had to do or not do as a Negro not to be killed. Probably just being a Negro period was enough, I thought.\"Black Lives Matter, anyone?On the integration of the Woolworth's in Jackson:\"After the sit-in, all I could think of was how sick Mississippi whites were. They believed so much in the segregated Southern way of life, they would kill to preserve it. I sat there in the NAACP office and thought of how many times they had killed when this way of life was threatened. 'Maybe more will die before it is over with,' I thought. Before the sit-in, I had always hated the whites in Mississippi. Now I knew it was impossible for me to hate sickness. The whites had a disease, an incurable disease in its final stage. What were our chances against such a disease?\"On the push to protest so much that the Mississippi jails would overflow:\"The fairgrounds were everything I had heard they were. The compounds they put us in were two large buildings used to auction off cattle during the annual state fair. They were about a block long, with large openings about twenty feet wide on both ends where the cattle were driven in. The openings had been closed up with wire. It reminded me of a concentration camp. It was hot and sticky and the girls were walking around half dressed all the time. We were guarded by four policemen. They had rifles and kept an eye on us through the wired sides of the building. As I looked through the wire at them, I imagined myself in Nazi Germany, the policemen Nazi soldiers. They couldn't have been any rougher than these cops. Yet this was America, 'the land of the free and the home of the brave.'\"I had chills most of the time I was reading this, which in Mississippi's July and August heat was an unusual experience. I got them again typing these quotes. All I can say about this book is that it is one of the most powerful autobiographies I've ever read and that it should be required reading for everyone. Everyone."}, {"userName": "Steven", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/1988467-steven", "userReview": "Wow! Amazing, tragic, heart warming and righteous. Really helps you understand what the Front lines of the freedom movement went through."}, {"userName": "Melanie Page", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/1519649-melanie-page", "userReview": "You'll be emotional from page one to page done. Here is a snippet of my review on Grab the Lapels:Moody’s book also taught me details of the Civil Rights Movement of which I was not aware, even though I’ve studied and taught the time period. For instance, when a house full of activists hear through the grapevine that a group of whites are going to kill them that night and block all the roads out of town, the young men and women lay out in the yard all night in long grass. It’s wet, hard, and they’re all shaking in terror. I felt like I was there with them. Moody’s family also turns on her quickly so they won’t be killed. Her favorite grandma treats her like a stranger. Later, I learned that in one town where Moody leads a group of activists that black people have most of the land and make up most of the population. However, land and crop contracts are only given to white farmers, so the black farmers sit on cropless land and nearly starve to death. Furthermore, I knew that activists were constantly arrested, but Moody explains that they were packed into a truck and locked in, after which the driver would crank up the heat on a 100+ degree day and leave them in their for hours until people freaked out or nearly died. When a headless black body is found, the colleges do room checks to see if it’s one of their students. The Klan shared pamphlets door-to-door with a blacklist of certain people (Moody’s picture appears on their list). This is the stuff you don’t get in your history textbook."}, {"userName": "The Charmer: Lets Talk About Books", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/4739538-the-charmer-lets-talk-about-books", "userReview": "Wow! I loved it. This is the best book I've read in 2017. I had no idea that an autobiography could be this good. I laughed so much at Essie Mae. She was so smart and brave at such a young age. Her first job was at age nine. I couldn't stand her mother. I thought she was useless. All she did was yell and talk down to her. And she made me mad having all those children with no money.I think I connected with Essie Mae. Her perspective and the way she responded to people, even when she was very little, might as well have been me. And what a life she had. The work she did for the Movement was inspiring, especially in the light of current events and our constant reminders of the importance of staying woke and speak truth to power. I was mad at her for her fight in the Movement and I was cheering her on. I was mad at her because I was afraid for her and her family and her community. Again, I loved this book. Lisa Renee Pitts(narrator) was awesome. I want to hear her voice more.  She was Essie Mae to me."}, {"userName": "Janice Ellis", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/72712795-janice-ellis", "userReview": "As a native daughter of Mississippi, and after finishing my own memoir, I sat down to read Anne Moody's, Coming of Age in Mississippi. I found it to be authentic, unvarnished and described life as it was for blacks and whites during the 1940s, 1950s and early 1960s in rural Mississippi. As I became immersed in the book, I realized that Anne Moody had grown up and came of age in the county adjacent to the one in which I grew up and also came of age. She and I even attended the same college, Tougaloo College. I learned that she was one of the students who participated in the Civil Rights march in Jackson, Mississippi that caused an incident at the Woolworth store. Their treatment gain national attention.Moody's description of life in Mississippi during that time brings history to life."}, {"userName": "Hannah Williams", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/8847049-hannah-williams", "userReview": "In the novel , \"Coming Of Age In Mississippi \" written by Anne Moody , tells the first person account of a young african american girl growing up and learning that she was considered to be inferior to an individual with white skin. The author does a really good job of telling us of the time when she truly understood segregation. This novel is a inspiring story about a young lady that grew up and realized that she wasnt going to just be complacent and accept the way that her people were treated. Instead, at a young age, she decided that she would join as many organizations as possible to make a conscious effort to do her part in bettering the conditions for blacks at her time. Although i did enjoy reading this book, i would only rate it four stars. I didnt like that the author spent so much of the beginning of the novel on her childhood. I do realize that the background is important but i would have liked to read more information on her high school years. In my opinion, that was the most inspiring part of the story. That is the part that makes the book as interesting as it is. A very well- known incident that ocurred and changed Anne , the main character's, outlook on life was the lynching of Emmet Till. He was young man accused of whistling a a white woman and he was immediately arrested and lynched. In her words , this is the impact that that incident had on her life:\"known the fear of hunger, hell, and the Devil. But now there was…the fear of being killed just because I was black.\" This is the exact moment when she decided that was going to fight for freedom. I would recommend this book to anyone that is interested in learning about the mistreatment of blacks during before the civil rights movement. Moody does an outstanding job in portraying a vivid picture in the minds of her readers of what it would be like to grow up during this era. From her relationship with her family, to her struggling to go to school and then rush to work each day or even just the racism. I admire the author because she was courageous enough to get involved with a movement despite the advisement of her family members. What i learned from this book was that sometimes you ahve to make decisions and your family wont always agree. Especially in this era, most African Americans are afraid of challenging the system even though they dont agree with it but the author decided that she couldnt just sit around and allow the mistreatment. If there werent individuals like her , or Martin Luther King , Jr ; then the afro-american community would still be facing injustices everyday."}], "description": "Written without a trace of sentimentality or apology, this is an unforgettable personal story -- the truth as a remarkable young woman named Anne Moody lived it. To read her book is to know what it is to have grown up black in Mississippi in the forties an fifties -- and to have survived with pride and courage intact. In this now classic autobiography, she details the sights, smells, and suffering of growing up in a racist society and candidily reveals the soul of a black girl who had the courage to challenge it. The result is a touchstone work: an accurate, authoritative portrait of black family life in the rural South and a moving account of a woman's indomitable heart.", "title": "Coming of Age in Mississippi", "url": "http://www.goodreads.com/book/show/862181.Coming_of_Age_in_Mississippi", "average": 4.12, "cover": "https://images.gr-assets.com/books/1348071214l/862181.jpg", "reviews": 472, "authors": [{"url": "https://www.goodreads.com/author/show/3906.Anne_Moody", "name": "Anne Moody"}], "type": ["Nonfiction", "History", "Autobiography", "Biography", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/862181.Coming_of_Age_in_Mississippi", "http://www.goodreads.com/book/show/5736.Coming_of_Age_in_Mississippi", "http://www.goodreads.com/book/show/497165.Coming_of_Age_in_Mississippi", "http://www.goodreads.com/book/show/862179.Coming_of_Age_in_Mississippi", "http://www.goodreads.com/book/show/25828053-coming-of-age-in-mississippi", "http://www.goodreads.com/book/show/23213442-coming-of-age-in-mississippi", "http://www.goodreads.com/book/show/16129123-coming-of-age-in-mississippi", "http://www.goodreads.com/book/show/16129078-coming-of-age-in-mississippi", "http://www.goodreads.com/book/show/819083.Mr_Death", "http://www.goodreads.com/book/show/819085.Famous_People_Stories", "http://www.goodreads.com/book/show/2277215.Famous_People_Stories", "http://www.goodreads.com/book/show/597941.Growing_Up_in_the_South", "http://www.goodreads.com/book/show/9626381-coming-of-age-in-mississippi"]}