{"ratings": 314, "userreviews": [{"userName": "Edward", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/5895486-edward", "userReview": "PrefaceIntroductionChronology Plays --Danton's Death--Leonce and Lena--Woyzeck Fiction --Lenz Non-Fiction --The Hessian Messenger--On Cranial Nerves--Selected LettersNotes and Background to TextsSelect Bibliography"}, {"userName": "Count Duckula", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/558616-count-duckula", "userReview": "'one coarse hide rubs against another' and other astonishingly modern cynical desperate gems from the 1830s"}, {"userName": "Charlie", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/1265196-charlie", "userReview": "Wozzeck is definitely the best of these three plays, but the other two are worth reading if you liked that.One of my favourite things about Büchner is that no matter the social standing of a character he always puts extremely eloquent poetic musings on life and death in their mouths. You are quite quickly forced to give up any question of whether this is realistic or not, and are given the chance of hearing what these characters would say had they the means to express it.It does also mean that it makes for pretty heavy reading, and this along with the fact it is a 50's translation of early 19th century text was at times enough to leave me feeling a bit lost.I really enjoyed Geoffrey Dunlop's introduction, I so much prefer translators introductions to critics any day. Büchner's story is fascinating and the historical background that Dunlop gives is lovingly handled if at times a bit overly wordy.The Breadth Büchner covers with these three plays is impressive, Leonce & Lena is a comedy in an almost Shakespearean vein, Danton's death is political in that it reflects Büchner's cynical outlook on the politics of his time and the french revolution but at heart is more of a social commentary, and then Wozzeck portraits the stifling hardship of the working classes. But all through these he manages to perfectly fit in his poetic musings on life and death. Throughout all of these stories there is a very definite sympathy with working classes.The thing that is really going to get you with Büchner is the sheer quality of prose: his stories seem at times a little fragmented but the phrases, reflections and analogies are often astounding. It seems to me in one way a huge loss that Büchner wrote all of his plays in such a rush and under such stressful circumstances: Leonce & Lena could perhaps be made clearer in order to become the light comedy it should be; Danton's death could be a much more cohesive well rounded story, but perhaps they would not have had nearly the energy had they been crafted over a longer duration.Tempted to give this 5 hmmmmmmmm........."}, {"userName": "Kristy", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/340252-kristy", "userReview": "I started this collection of Büchner's work for his play Woyzeck, and read everything except Danton's Death (which I'm saving for later). Considering that Büchner died when he was 23, this collection of three plays, a novella, a revolutionary political treatise, a scientific lecture, and a bunch of letters is rather impressive. What is even more impressive is how modern Büchner seems considering that he was writing 180 years ago. This collection has crisp translations and interesting introductory material."}, {"userName": "rosalind", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/2989778-rosalind", "userReview": "a good translation"}, {"userName": "Keith", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/4873736-keith", "userReview": "Woyzeck ***** – What a lyrically haunting play. It is little more than fragments of story, song and poetry with an unresolved – or unclear – ending. When I say “fragments”, I mean that each scene is brief, but almost complete in itself. The story/plot itself is not necessarily fragmented. The arc of it is rather clear and unremarkable (at least by today’s standards). A woman cheats on a troubled man, who kills her when he finds out. But it is told in short, poignant scenes – some no more than a single line of dialogue. Like Danton’s Death, the language reveals Buchner’s admiration for Shakespeare. It is lyrical, imaginative, heightened, and unnatural. The characters are reflective and philosophical. Folk songs abound. Along with the short, tightly focused scenes, this dialogue creates a sense that each scene is more like a song, lending it an operatic feel.Yet the play is frustratingly incomplete. That’s either its greatest flaw or greatest strength. In this translation by Richard Mueller, Woyzeck is captured alive. The translator believes Buchner would have had a trial scene if he had lived. (No drafts exist that I’m aware of.) The translation by Victor Price, on the other hand, has Woyzeck drown himself when he goes back in the lake to throw away the knife. To him, the play is nearly complete. (https://www.goodreads.com/review/show...)That’s quite a variation in interpretation. I don’t think Buchner would have added a trial scene. Or, if there were a trial, it would have been offstage. I don’t see how you could stage something like a trial and maintain the same tone and style. Additionally, it would have been too pat of an ending. There’s a sense of shame and degradation throughout the play that seems to argue against a final reckoning or resolution. But who knows. Buchner claimed the play was almost done before he became ill and died. At this point we can only presume what he meant and what he ultimately wanted. (We can, however, make it mean what we want.) Yet there is a greatness in this play, a haunting sense of evil, disintegration and humiliation. It’s unlike any play I’ve read. I strongly recommend it."}, {"userName": "Brendan Shea", "userReviewDate": "May 14, 2007", "userURL": "http://www.goodreads.com/user/show/79268-brendan-shea", "userReview": "The best translation out there of the first modern tragedian. Includes all Buchner's works, one of which is a heartbreaking translation of the short story/essay \"Lenz,\" the reading of which is key to understanding Buchner's aesthetic. Mueller captures the frantic, desperate poetry of \"Woyzeck\" unlike any other translation I've read. Top notch."}, {"userName": "l.", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/3065234-l", "userReview": "Read Danton's Death, Woyzeck, Lenz and the letters.I like his writing but I think that his age shows. Woyzeck is very good (four stars for it!) but the other works, I wouldn't think especially remarkable. But of course, my knowledge of theatre, and german lit is incredibly, unbelievably limited."}, {"userName": "Kadri", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/4860280-kadri", "userReview": "Nii veider raamat, et sellele võib vastavalt tujust suvalise hulga tähti anda. Tõlge on võrratu."}, {"userName": "Christian", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/50954057-christian", "userReview": "Die Kunst, Mitmenschlichkeit zu lernen in vier Stücken.I. Dantons Tod - wie wir siegenII. Lenz - wie wir alleine sindIII. Leonce und Lena - wie wir liebenIV. Woyzeck - wie wir scheitern"}, {"userName": "Aras", "userReviewDate": "Nov 11, 2007", "userURL": "http://www.goodreads.com/user/show/614857-aras", "userReview": "http://electric-pages.livejournal.com..."}, {"userName": "Charles", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/10835235-charles", "userReview": "Danton's Death is on my not so short list of plays I'd like to stage. I did a couple of cuttings from it for scene workshops and they went over well. Too many plays, not enough time."}, {"userName": "Erika S", "userReviewDate": "Sep 04, 2009", "userURL": "http://www.goodreads.com/user/show/2176438-erika-s", "userReview": "I've technically only read the first play so far, but I'll be reading the others soon for class."}, {"userName": "Ksenia", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/825809-ksenia", "userReview": "Read for grad school: Danton's Death, Leonce and Lena, Woyzeck."}, {"userName": "A. Ozbay", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/4276048-a-ozbay", "userReview": "3 great games (drama) in his short life of the great German writer."}, {"userName": "Joshua Thornton", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/38216082-joshua-thornton", "userReview": "A very odd collection of writings from some semi-unknown writer. Bucher has a specific tone to his work that is rare and hard to come by."}, {"userName": "Ian Mathers", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/1340482-ian-mathers", "userReview": "It's a kind of omnibus, but Woyzeck, Lenz, and much of what else is here is terrifyingly good. My favourite discovery from those German literature classes I took."}, {"userName": "Brendan Shea", "userReviewDate": "May 14, 2007", "userURL": "http://www.goodreads.com/user/show/79268-brendan-shea", "userReview": "Pretty similar to the OUP."}], "description": "The life of Georg Buchner was short, intense, and tragic—and extremely significant for the development of modern drama. His three plays, Danton’s Death, Leonce and Lena, and Woyzeck, were greatly ahead of their time in their penetrating dramatic and psychological treatment. They served as an impetus for contemporary schools of drama as different as the Theatre of the Absurd of Ionesco and the Epic Theatre of Brecht. lso presented in this only complete volume of Buchner in English are his two powerful prose pieces, The Hessian Courier and his short story, Lenz.", "title": "Complete Plays and Prose", "url": "https://www.goodreads.com/book/show/255687.Complete_Plays_and_Prose", "average": 4.21, "cover": "https://images.gr-assets.com/books/1312058611l/255687.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/94147.Georg_B_chner", "name": "Georg Büchner"}, {"url": "https://www.goodreads.com/author/show/3947738.Carl_Richard_Mueller", "name": "Carl Richard Mueller"}], "type": ["Drama", "Plays", "Fiction", "Classics", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/255687.Complete_Plays_and_Prose", "http://www.goodreads.com/book/show/17211456-complete-plays-lenz-and-other-writings", "http://www.goodreads.com/book/show/255688.The_Plays_of_George_B_chner", "http://www.goodreads.com/book/show/162323.Buchner", "http://www.goodreads.com/book/show/255689.Complete_Plays_Lenz_and_Other_Writings", "http://www.goodreads.com/book/show/21492032-dantoni-surm-woyzeck-lenz", "http://www.goodreads.com/book/show/31217528-werke", "http://www.goodreads.com/book/show/13321264-georg-b-chner", "http://www.goodreads.com/book/show/22717398-complete-plays-lenz-and-other-writings", "http://www.goodreads.com/book/show/571938.Woyzeck", "http://www.goodreads.com/book/show/1870638.Dantons_Tod", "http://www.goodreads.com/book/show/162326.Woyzeck_Leonce_und_Lena", "http://www.goodreads.com/book/show/287510.Lenz", "http://www.goodreads.com/book/show/1690781.Leonce_und_Lena"]}