{"ratings": 945, "userreviews": [{"userName": "John Culuris", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/55859990-john-culuris", "userReview": "★ ★ ★ ★ 1/2Sometimes plans go awry for the better. In a quick one-line comment on John D. MacDonald’s Murder in the Wind, I compared it to this novel. The conversation that followed led me to write a more detailed summary of Condominium, and upon reflection I felt it summed up my opinion well enough that I could re-purpose it as review. The plan? Dig out the book the first chance I got and fact check my memory. Where the plan went wrong? I ended up reading the whole damn thing. 478 pages, the second half narrative-heavy with a minimal amount of dialogue, and I got sucked right in. How did that happen? Well, I know how it happened. But first, my original thoughts:Condominium was not a completely successful novel but at the same time it was a Master Class in the craft of writing. If I had to guess, the reason it is generally remembered fondly is that its faults were erased by the end of the book. Initially there were too many characters, some of whom were not doing much of interest (or were not particularly interesting themselves.) But a little past the halfway point MacDonald ends each chapter following the gradual formation of a hurricane, starting as a mere pressure system an ocean away and continuing until it batters the Florida coast in all its fury. This was not self-indulgence of the kind that anyone who reads regularly has been subjected to many times over, where a writer spends pages describing an oilfield in Oklahoma or a Colorado mountain range or a winding coastal highway in the Pacific Northwest; images readers already know too well from exposure to other media. All that is needed to put us in the scene is a couple of intimate details that makes this particular version unique. In Condominium the storm is the point. That MacDonald can follow its progression without the presence of flesh-and-blood characters and not bore the reader is a major accomplishment in itself. But it also serves to magnify the impact once we do get to experience the devastation through the eyes of various characters. It is amazing work.My last line above. Well, that’s how I ended up rereading the book in whole. It is amazing work. And for the most part my comments proved correct. My memory only failed me in two respects. The first was, yes, there were too many nonessential characters--and yet they had not extended as deeply into the novel as I’d remembered. Their effect was negligible. My other mistake was in forgetting the scope of MacDonald’s prowess. It was not just the sheer power of his narrative that made Condominium work. It was his ability to show facets and effects of the storm by dropping in on previously unmet characters and giving us quick, vivid snapshots of their lives. In experiencing their reactions and responses, their fears and regrets, one after the other after the next, MacDonald built a picture of a community under siege. He had turned unbridled destruction into a majestic tapestry.It was an amazing piece of work. And I will not forget it again."}, {"userName": "Joe Valdez", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "John D. MacDonald is one of my favorite authors, but this 1977 novel is an info dump of real estate development, structural engineering and homeowner's associations, perhaps piled high for his Travis McGee series. I had hoped to continue that series with Nightmare In Pink, but my library didn't have it, so I settled on this. I abandoned it after 120 pages. I will note my reasons:1. MacDonald keeps introducing characters and characters and more characters. So many characters, there would be no way to remember who's who when they come together without a tree chart.2. None of the characters stand out. I know this is Florida, but everyone resembles a professional wrestling personality, if not \"Hacksaw\" Jim Dugan then a manager like Jimmy Hart or Miss Elizabeth.3. MacDonald claimed Florida as his home turf long before Carl Hiaasen or Rick Barry, but this sort of sleazy comic thriller with sixty characters is done much better by those authors.4. Also no fault of the author, but I need to get away from sleazy comics who can't keep their flies zipped up. There's been little else in the news since the acting president was sworn in. The news out of Washington these days is more tabloid than anything in this novel.5. When I've read 100 pages and there is barely any prose I want to scribble down, I can tell I'm not really digging what the author is doing."}, {"userName": "Sarah Sammis", "userReviewDate": "Jul 04, 2007", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "I can remember the opening shot of Barbara Eden (playing Barbara Messenger) floating in the middle of the vast ocean (in a row boat?) of the made for TV movie Condominium (1980). So when I saw a copy of John D. MacDonald's novel of the same name, I had to read it.Condominium was a departure for MacDonald, who is best known for his Travis McGee series. The book opens with a dedication: \"This book is dedicated to these people who were part of the good years in Sarasota and were washed away:\"and continues on with a long list of names. From the timeline of the book, I'm guessing these people were victims of hurricane Donna (1960).Condominium is not a novelization of actual events. It does however paint a realistic enough picture of the sorts of things that can go wrong to contribute to as massive a disaster as described in the final pages of this novel. MacDonald doesn't point the finger at just one person making mistakes or cutting corners as the cause. Instead he builds suspense on the knowledge that little mistakes and efforts to cut corners in the interest of saving money add up.In the middle of all of this are the families, mostly retirees on fixed incomes, who have maxed out their budgets to buy a retire home. With Ian on the board of our local HOA, I sympathized with the HOAs in this novel who struggled to undo the mess the developers left them with on their limited budgets.Condominium the novel predates the TV movie by three years and is as exciting to read as the film was to watch. I ended up staying up an hour and a half beyond my normal bedtime to finish it. Then I was afraid I'd have nightmares!"}, {"userName": "Lee Thompson", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/2312773-lee-thompson", "userReview": "Could have used a lot of trimming, despite that it's still damn brilliant."}, {"userName": "Craig Pittman", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/4640029-craig-pittman", "userReview": "WOW. I've read a lot of John D. MacDonald's thrillers over the years, including all of his Travis McGee series, but this one is his masterpiece. Everyone in Florida should read this at least once. The book -- about the lives and loves of the denizens of one condominium on a Southwest Florida island -- takes a long time to build a picture of how corrupt politicians, shady bankers, corner-cutting construction crews, greedy real estate salespeople and crooked developers set the stage for disaster, but you don't mind because MacDonald's research shows in every line. Then, once he's shown you how vulnerable the place is, and how foolish the people are, he shows you the worst-case scenario for disaster: a Category 5 hurricane that barrels in. He does a great job of foreshadowing how awful it will be, and a masterful job of explaining just exactly how awesomely deadly it could be given the right circumstances. MacDonald builds the suspense perfectly, cutting back and forth between scenes of the storm building its strength and scenes showing why some people would choose to ride out such a storm instead of evacuating to higher ground. By the time the hurricane hits the key, you won't want to put the book down because the horror of it is so compelling. Not everything goes the way you expect, either -- a villain gets a bit of grace at the end, and someone you think is a hero turns out to be more of a bystander. All in all, it was a terrific read -- albeit not a great one to gulp down right before the start of hurricane season on June 1."}, {"userName": "Virginia", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/640397-virginia", "userReview": "I had to slog through some of the schemey real estate intrigue bits, but the characterization is decent (despite not always having the most likable of characters) and the book became hard to put down around the point you realize the hurricane is going to be a big one. Not exactly the most uplifting read, and it will give you second thoughts about buying property on the coast."}, {"userName": "Sarah Sammis", "userReviewDate": "Jun 14, 2007", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "I can remember the opening shot of Barbara Eden (playing Barbara Messenger) floating in the middle of the vast ocean (in a row boat?) of the made for TV movie Condominium (1980). So when I saw a copy of John D. MacDonald's novel of the same name, I had to read it.Condominium was a departure for MacDonald, who is best known for his Travis McGee series. The book opens with a dedication: \"This book is dedicated to these people who were part of the good years in Sarasota and were washed away:\"and continues on with a long list of names. From the timeline of the book, I'm guessing these people were victims of hurricane Donna (1960).Condominium is not a novelization of actual events. It does however paint a realistic enough picture of the sorts of things that can go wrong to contribute to as massive a disaster as described in the final pages of this novel. MacDonald doesn't point the finger at just one person making mistakes or cutting corners as the cause. Instead he builds suspense on the knowledge that little mistakes and efforts to cut corners in the interest of saving money add up.In the middle of all of this are the families, mostly retirees on fixed incomes, who have maxed out their budgets to buy a retire home. With Ian on the board of our local HOA, I sympathized with the HOAs in this novel who struggled to undo the mess the developers left them with on their limited budgets.Condominium the novel predates the TV movie by three years and is as exciting to read as the film was to watch. I ended up staying up an hour and a half beyond my normal bedtime to finish it. Then I was afraid I'd have nightmares!"}, {"userName": "Tex", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/2330510-tex", "userReview": "The beginning was a slog, but as the storm was born and strengthened, so did the pace of the book until I was lifted almost out of my chair by waves of description. It's probably not the best book to read when you already live within 10 miles of the Atlantic and are attempting to move closer still the the southeastern Florida coast. I'm happy that i read it outside fo hurricane season, but I know for certain that certain images will stay with me come August."}, {"userName": "Ben", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/824532-ben", "userReview": "Good read, a bit confusing and with the massive number of characters in the book. By the time you hit the middle of the book, your sure that Marty Liss is the bad guy, but pretty much the only one I found myself rooting for. Thank goodness for Gus and Sam, all the sudden the story picks up it's foreshadowing and boom. On a side note, reading this fictional tale reminded me of seeing and reading \"The Big Short\". WOuld love to see this as a movie, but someone would f it up."}, {"userName": "Tim", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/4089319-tim", "userReview": "JDM got more expansive as he got older, and this is a book, multilayered book set in one of the new condominium complexes in S. Florida in the 1980s. It didn't have Travis McGee but it was classic John D. Macdonald."}, {"userName": "Ruth", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/7857376-ruth", "userReview": "Perhaps as applicable now as then... a classic of greed, corruption, sex in the building industry in Florida. MacDonald does 1950’s characters wonderfully!"}, {"userName": "Noreen", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/11749438-noreen", "userReview": "Update: September 9, 2017 Wonder what John D MacDonald would say about hurricane Irma in Florida at the end of the week?Michael Lewis organizational dynamics in fiction form written in 1977. Impressive. John D MacDonald's books are a zoology manual for different types and varieties of American men.pg 73 He vowed to take it very slowly with Henry, to bring him along step by step until at last he was clear-eyed:conscious of the reasons for the porn manuals in the best bookstores, for the weakening of all religions, for the collapse of marriage , for the corruption of children through the hidden messages in the textbooks provided by corrupt and venal state governments.pg 124 Sherman Grome was tall. He was very tan. He had a hard protruding shelf of brow above deep-set eyes. His hairdo was spray-shaped to cover his ears and most of his forehead. His nose was imperial. He wore a brushed denim leisure suit and a blue work shirt open at the throat. His manner was one of total indolent assurance and half-concealed amusement. He wore oval sunglasses with blue lenses. The rental girls glanced at him, came to attention and stared. Sherm had the celebrity look.pg 19 After long deliberation Gus had told her one evening that if he couldn't put up a better building using only toad shit and wax paper, he'd resign from the profession. But this upset her so badly and obviously, he convinced her he was only kidding and vowed to himself not to mention his doubts to her again.pg 129 I'd say that what he is doing is like a fellow taking timbers off his foundations to patch his leaky roof. After he takes away enough support, the whole thing comes down. If he is going to make himself look like a dummy, there has to be compensations. If he can give away a million dollars to you, Marty, then he has to have a way of giving a lot more than that to himself.The thing about condominium living, was the difference between the brochures and the reality. In the brochures there were smiling friendly people in groupts, having swimming parties and steak roasts and making shell ashtrays together , happy as clams, always smiling and hugging. And they all looked about forty. Move in and you were in the middle of a batch of suspicious, testy, cantankerous old folks, their faces pursed into permanent expressions of distaste, anxiety and hidden alarm.pg 26. Three types of builders. The first type can't hack it, for all the reasons known to man, and so you ease them out before they kill themselves or, worse, kill somebody else who is worth their wages. The second type you look for, because you can keep them a long time. The are competent, loyal, diligent and quite happy to have somebody else take the career risks and the money risks. Sam Harrison was the third variety. At first you think they belong in the number two class. But then you slowly learn they re doing just a little bit more than you asked for, and doing it a little better than you thought possible. Then, feet on solid ground, they start coming to you with innovative ways of doing things more easily and quickly, and some you approve and some you don't. Then you know what you have on your hands. So you make an extra effort to keep them on the team as long as you can, knowing you are going to lose them. The Sam Harrisons always get restive. They have to run their own store. It is the only way for them. Jay Forrester 1918-2016 is a non-fiction version of the Sam Harrison character. Jay Forrester, an MIT professor switched careers to study corporate management and systems was unimpressed. See Obit WSJ Dec 3-4, 2016 A5."}, {"userName": "Lee Barckmann", "userReviewDate": "Jul 11, 2016", "userURL": "http://www.goodreads.com/user/show/3119300-lee-barckmann", "userReview": "McDonald's novel Condominium was written in the late 70's so most of the residents are from the World War II generation, and have had some success in life, but are still filled with angst about the threat of losing all their investments: Most of their wealth is in their condominium. Condominium life in Florida in the 70s, was a bizarre scene, where the newly minted geezers were stored in giant concrete chests of drawers, with little balconies, that (in the good one's) overlooked the water. The novel is set on the West Coast, near a city like Tampa, called Fiddler Key. It could be St. Pete Beach, a place I know because my parents spent their 'mid-retirement' years there.The story is set around the shoddy construction and shady business practices of the phony corporations that 'owned” the Condos, (the real owner was a shaky bank). The tragedies of falling condo resale prices are juxtaposed against a coming Hurricane. The people are so familiar and yet so different than their children, (me), who are retiring today that it struck me as worth examining. McDonald catches people in the act of getting old. Some are getting sick, and some are finally beginning to live when it is almost too late. Sex is tacky, usually in the afternoon when the spouse is taking a nap, and dark conspiracies are hatched over poolside card games, plotting the overthrow of condo board members who proposed new rules that are denounced as stupid if not communistic. Antisemitism is rampant, and blacks are nearly non-existent except as cleaning crews. The maintenance superintendent is feared by all, as he has to power to decide when and how much repair to the units gets done. When I would make my Christmas pilgrimages to visit my retired condominium dwelling parents, it was always a trip down the rabbit hole. The rules of the nuclear family were out the window because Mom and Dad were now part of a community where the greatest sin imaginable was to leave your wet bathing suit hanging over the balcony. Many had grown up in tenements during the 30s and the sight of clothes drying on the fire escape was a terrible memory, one that brought back the poverty of their Depression Era upbringing. You don't fuck with the Condo Board.No flip-flops in the clubhouse. Nixon got a raw deal. Six-month CDs (certificates of deposit) paid a 12-15%. You could set your watch to the 4 PM afternoon thunderstorm. Somebody's been drinking my scotch! I secretly prayed for a hurricane during my summer visits.McDonald's Condominium was made into a TV movie with lots of B-actors. McDonald was a brilliant man, who analysis the financial structure of condominium construction and the engineering of building them was worth the read for me. But like the Condos themselves, he had too many characters in this novel. The part that detracted the read for me was the lives he illustrated were too close to real life, an affluent version of Hobbes' dictum that life is nasty, brutish and short. Unless you are looking for some old-people-in-the-seventies nostalgia, I would not recommend this novel as a fun read – any of McDonald's Travis McGee books are better, even if the fiction is more fictitious."}, {"userName": "Joe Kraus", "userReviewDate": "Oct 18, 2015", "userURL": "http://www.goodreads.com/user/show/2422229-joe-kraus", "userReview": "If you look just past your peripheral vision while you’re reading this, you can almost see someone changing the television dial (by hand) from a Dan Rather report on Jimmy Carter to a new episode of The Rockford Files. That’s largely a compliment; this is one of those books that seems really to capture its moment. It virtually smells of the mid-1970s.In other words, this is analogue fiction. You can hear the pops on the LP as the needle works the grooves, and you can see the deep professionalism of the writer. If there’s a clear descendent of this work (not necessarily of MacDonald’s better-known work) it isn’t fiction so much as the consistently excellent Law and Order or CSI episodes, the ones where you see competent writers creating scenes efficiently as part of stories that, however near the formula they are, still bring surprises.The trouble with this, though, is that it really comes across as a series of impressive scenes rather than a compelling story. To its credit, it takes as old news that the world is corrupt, and it avoids the easy move of casting someone in the role of villain-in-chief. Everyone is at least a little guilty, and even the most reprehensible are multi-dimensional characters with decent motives and a measure of concern for others.The price of that virtue, though, is that there isn’t much to get invested in. Will the tenants be on the hook for the doubled monthly assessments? Will the shady developer wind up having to confront the people he’s wronged? Will the middle-aged realtor regret getting involved with the hunky guys she’s attracted? Those separate concerns are what’s at stake for the whole, and they aren’t especially compelling as a collection. The dozen or more micro-dramas are – will this character come to terms with what retirement has cost him in terms of self-identification, will that one find a way to reconcile his work for the communal good with his personal happiness – but they flash by too quickly through the method of the novel.I’ll come clean: I stopped reading around a quarter of the way through. It isn’t quite that I got bored by it. Any scene I chose to slow down and focus on brought fresh evidence of MacDonald’s skill; there are always a handful of key details that establish character and context, and the language never gets cold. It’s just that there are a lot of other things I want to read (including some of MacDonald’s Travis McGee novels) and there’s only so much time I can indulge in my 1970s nostalgia. So, I am lifting up the tone arm in the middle of the song, and I am sliding the album back into its paper sleeve. Now if only I could find where I put that Yes record…"}, {"userName": "Henri Moreaux", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/5238614-henri-moreaux", "userReview": "I picked this book up about 6 years ago when someone recommended it having liked a few of Arthur Hailey's works. Recently I've read all the Travis McGee series by McDonald and when I noticed Condominium was also by him I figured now would be a good time to actually read it.I'm glad I did, whilst the vast array of characters initially seems a bit overwhelming once you're into the story things fall into place and I found it wasn't difficult to picture each of the characters in their settings.It's hard to say what this book really is about as there's a lot about the people so it's not really just a business (or shady business) book, and the huge disaster that occurs comes much too late in the narrative to call it a disaster book. I guess you could say its a book about ageing and life in the 1970s Condominium boom, how business cut corners, how that affected people and in the end how badly they were placed at risk by those decisions.Overall it's quite an epic tale although those wanting to diving into an action packed adventure should be warned it's more of a relaxing afternoon chat than rip roaring page turner."}, {"userName": "Kendra", "userReviewDate": "Mar 02, 2012", "userURL": "http://www.goodreads.com/user/show/741334-kendra", "userReview": "Condominium appeared on a booklist of influential Florida themed books, so I decided to give it a read. Perhaps I should have thought twice about reading a 447 page book about Florida condo dwellers in the lead up to a giant hurricane. This was not an uplifting book. It tackles the issues of corporate greed, unfulfilled retirement living, and the effects of natural disasters. I liked gaining a fresh perspective on topics I have not given much thought to before (such as why a lot of retired people flock to Florida), but this was a hard book to pick up and just read. There were too many characters for me to keep track of, and I became discouraged trying to remember all the backstories. I would also have liked to have seen a more balanced cast in terms of happy to tragic characters. John D. MacDonald is a very well-known author, and for that reason I am glad I read this popular book of his. I am going to pick up a mystery in his more popular series before I fully form my opinion on his writing."}, {"userName": "Betsy", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/8355999-betsy", "userReview": "I began reading this, coincidentally, at about the same time as hurricane Matthew was beginning to strengthen. Condominium is about shady political deals, substandard building and shaky finances that go into the growth of the Florida keys. It also is about the people who decide to make Florida their retirement home and the effect a huge hurricane has on all their lives. Although it was written in 1977 it is surprisingly up to date. This is a re-read for me. I read it when it first came out almost 40 years ago, never forgot it and enjoyed it just as much the second time around."}, {"userName": "Kim", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/19091800-kim", "userReview": "This book had a lot of potential with its plot lines and the writing was done well. However, there were entirely too many characters. I literally started taking notes on who was who, but gave up after I filled 2 sheets of paper. When the hurricane finally hits about 90% into the book and you learn the fate of the various characters, you really don't care because you can't remember who this person was in the story line. The hurricane should have come earlier in the book so that there could be more development of the aftermath. It just seems to abruptly end."}, {"userName": "Hunter Daughtrey", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/10193182-hunter-daughtrey", "userReview": "The Travis McGee books were favorite summer beach reads before I discovered Carl Hiaasen. I read Condominium right after I had pulled a term as President of out homeowners' association. The description of the contentious annual meeting rand really true for me. I had also dealt with a developer whose practices barely met code. The most memorable scene was the martini olive on the fireplace mantle at a hurricane party. It was a fun read with sleazy villains."}, {"userName": "Kyle", "userReviewDate": "Dec 16, 2010", "userURL": "http://www.goodreads.com/user/show/80674-kyle", "userReview": "This is really a disaster thriller about a hurricane hitting a Florida Key and what would happen to some of those cheaply designed condos if the perfect storm came at the wrong time. High August tides, too much clearing of trees and structural deficiencies combine to topple the hideous behemoth. Good riddance I say. Capably written by MacDonald with lots of detailed description of constuction and scheming bankers and real estate developers."}, {"userName": "Leon Story", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/4851383-leon-story", "userReview": "This novel probably has John D. MacDonald's most complex plot, and certainly has the largest cast of significant characters. It's a difficult read, is not his usual \"genre fiction\", and thus won't please every Travis McGee fan out there. Nonetheless it probably inspired Carl Hiaasen's many fine satires of Florida commerce and government, and is one of MacDonald's finest works. Of the non-Travis McGee books I would only rate \"One More Sunday\" ahead of it."}, {"userName": "Jim", "userReviewDate": "Aug 03, 2012", "userURL": "http://www.goodreads.com/user/show/9676355-jim", "userReview": "MacDonald cashed in bigtime on the 70s disaster craze with this 1977 novel about a big condominium project, shoddily built by corrupt developers, that falls apart during a hurricane. Think The Towering Inferno, The Poseidon Adventure, Earthquake, etc. In those days of the Watergate scandal, there was a widespread feeling that everything was falling apart. This is a big novel with a large cast of characters, and it's an above-average example of the genre, from a master."}, {"userName": "Rhett", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/763867-rhett", "userReview": "Direct frontal assault on the rape of the South Florida coast by hotel/condo/resort developers. MacDonald harbored a romantic attachment to the Florida coast cira 1940-1960 and wishes it were still so. Although, usually a part of his Travis Magee series, this really lets us know how he feels. The only subplot is how the coast extracts revenge."}, {"userName": "Dee Hanner", "userReviewDate": "May 12, 2008", "userURL": "http://www.goodreads.com/user/show/1157479-dee-hanner", "userReview": "This book was written in my home town Sarasota Fl, shortly after the first massive condo was built on Siesta Key. We all hated the Condo, and hoped it had the same fate as this book. Reading John MacDonald's books are like returning to my childhood -"}, {"userName": "Karen", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/3531511-karen", "userReview": "This is the third time I have read this book. It is one of the best on Florida ever. It should be read by every Floridian...especially those who were born and lived elsewhere before they came to Florida to live."}, {"userName": "Nick Stewart", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/20112072-nick-stewart", "userReview": "Author MacDonald assembles a thoroughly wretched group of retirees and real estate swindlers, then concocts really gruesome ways for them to die. Considering the novel's Florida sun belt locale and hurricane climax, I wouldn't recommend this for beach reading."}, {"userName": "Andy", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/9849832-andy", "userReview": "Florida, distilled in 478 pages.Third time reading this; it never gets old. MacDonald nails the state's populations, shifting/shiftless as its sandy islands."}, {"userName": "Ken Ficara", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/2521968-ken-ficara", "userReview": "A cut above the average disaster novel, thanks to MacDonaLd's anger and his feel for Florida.[return][return]http://kenficara.net/books/2007/05/co..."}, {"userName": "Charles", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/8297294-charles", "userReview": "John D. MacDonald books have never been my cup of tea, but I do seem to pick one up each summer for a few days in Florida. The fast pace and the setting (60s South Florida, usually) make for easy beach reading.I had higher expectations than usual for this one because   1. it isn't part of a mystery series \n    2. it was published relatively late in his career (1977) \n   3. it covers topics that seem to be right in MacDonald's wheelhouse: namely corrupt politicians and real estate developers. \n   All told, however, this is the worst of the MacDonald books I've read. The story overall is a good one and feels surprisingly current...not unlike a story set in the housing bubble of the early 2000s. But the huge cast of characters makes it impossible to follow all of the moving parts. The character who seems to most resemble a protagonist appears with the same frequency as the rest of the characters, and then he is absent for several chapters at a time. This makes the book tedious, despite what should have been a pretty strong plot.If you can muddle through the disparate storylines with even a slight grasp of the characters, the payoff at the end is pretty spectacular. In fact, I would argue that the closing chapters show MacDonald at his best. It just takes too much work to get there."}, {"userName": "Terri Weitze", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/31862722-terri-weitze", "userReview": "This book was not at all what I expected. John D. MacDonald is the kind of writer that other writers refer to in their books, which made me very interested. But I thought his books were all mysteries. Not this one. It is about the real estate/condo building trade on the Florida Gulf coast. Fascinating. All the ins and outs and interrelationships of developers, real estate sales, management, politicians, etc. And what can happen if it goes wrong. Obviously meticulously researched (engineering, weather development and tracking, geology, etc.). Beautifully written. Apparently a made-for-TV movie was done based on this book - doubt it is as great as the book, but I can see where it would lend itself to being a disaster movie. And the everybody having sex with everybody is clearly of the pre-AIDS 70s era."}], "description": "Condominium: A Novel, by MacDonald, John D.", "title": "Condominium", "url": "http://www.goodreads.com/book/show/1156459.Condominium", "average": 3.71, "cover": "https://images.gr-assets.com/books/1362527995l/1156459.jpg", "reviews": 87, "authors": [{"url": "https://www.goodreads.com/author/show/24690.John_D_MacDonald", "name": "John D. MacDonald"}], "type": ["Fiction", "Mystery", "Thriller", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/1156459.Condominium", "http://www.goodreads.com/book/show/36808441-condominium", "http://www.goodreads.com/book/show/937723.Condominium", "http://www.goodreads.com/book/show/1150197.Condominium", "http://www.goodreads.com/book/show/18240333-condominium", "http://www.goodreads.com/book/show/18209464-condominium", "http://www.goodreads.com/book/show/434229.Cape_Fear", "http://www.goodreads.com/book/show/269362.The_Deep_Blue_Good_By", "http://www.goodreads.com/book/show/434231.Nightmare_in_Pink", "http://www.goodreads.com/book/show/527873.A_Deadly_Shade_of_Gold", "http://www.goodreads.com/book/show/571397.A_Purple_Place_for_Dying"]}