{"ratings": 280, "userreviews": [{"userName": "Sharon Barrow Wilfong", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/16212447-sharon-barrow-wilfong", "userReview": "This book was not exactly what I was expecting but it still had its merit.As you've probably read in the blurb. A woman who lives in a Cape Cod house on, where else? Cape Cod sees an advertisement for a colony of vacation cottage homes for sale. For a mere three thousand dollars she could own one of them. She visits the colony, falls in love with one particular cottage, and buys it.The next several hundred pages contain her adventure in the world of conquering burocrats, getting permission to travel with a cottage, getting it to her property, but promising not to disturb the wetlands, which her property borders, arguing that she will not have more than three bedrooms because the cottage is going to serve as her office and what difference does it make anyway?She also has trying adventures with the various contracters to move, build, paint, pour cement and what not.In the end it all comes together, a rougher ride than she expected but who can predict these things?Whouley's writing style is engaging and she makes what must have been a tedious process sound interesting.My only complaints are that she could have developed the characters more. I realize this was non-fiction and one can only know so much about men who work on your house, but she never really lets us know her friends and family, either. One particular person, Barbara, whose family owned the property, had a lot of potential and I would very much have liked to have gotten to know her better but we only get a glimpse of her in the beginning and at the end when she is bedridden. It seems an entire story took place while we were attaching the cottage, but we never get to learn of it.The other complaint I have is that the author writes everything in present tense. I cannot emphasize enough how much I hate reading a story in present tense. If you are not writing in second person you have no business writing in the present tense. It drains any color or rhythm her writing might otherwise have had. All the sentences limp along: subject verb. subject verb. subject verb. It's like listening to someone with one of those ugly monotone voices. A voice with no lilt, no lift, no melodic line. As a musician, I cannot tolerate voices of people who refuse to listen to themselves. As a reader, I feel the same way about tone deaf sentences.On a positive note, I found her yearning for male relationships entertaining, but only because, being single after an ugly divorce, I was that person. With so many males crawling all over your house, surely one of them is The One. I won't tell you in case you like to be surprised.I could comment on the unrealistic expectations of a forty-something woman who has never married and perhaps that is why she has never married, but you may want to draw your own conclusions.Is the book worth reading? It's not War and Peace, but it was a fun, if small, rollick."}, {"userName": "Kate", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/2130215-kate", "userReview": "\"When Kate Whouley saw the classified ad for an abandoned vacation cottage, she began to dream. Transport the cottage through four Cape Cod towns. Attach it to my three-room house. Create more space for my work and life. Smart, single, and self-employed, Kate was used to fending for herself. But she wasn’t prepared for half the surprises, complications, and self-discoveries of her house-moving adventure.Supported by friends and family, and egged on by Egypt, her bossy gray cat, Kate encountered a parade of town officials, a small convoy of State Police, and an eccentric band of house-movers, carpenters, and tradesmen. She found herself dancing on the edge of the gender divide–infatuated with trucks, cranes, tools, construction terms, and a dreamy mason who teaches her the history of concrete.Sketched with a deft hand and told with an open heart, Cottage for Sale is a deeply personal story that captivates, inspires, and delights. In one remarkable year, Kate moved a cottage and created a home. Once you cross the threshold, you’ll never want to leave.\"~~back coverI loved this book! It was a fascinating combination of the actual nuts and bolts of moving a house and Kate's growth into a competent, more confident woman as she dealt with \"the surprises, complications, and self-discoveries of her house-moving adventure.\" It was fascinating!"}, {"userName": "John", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/290848-john", "userReview": "I wasn't sure whether I'd be able to get into this one with all of the construction-related detail, but in the end that didn't really matter. There's enough observation of Cape Cod life, along with glimpses into the author's own background, to see what an interesting person she can be. Now that I know Whouley's writing is so solid, I'm really looking forward to reading (listening to actually) her recent book on being a caregiver for her mother's Alzheimer's: Remembering the Music, Forgetting the Words: Travels with Mom in the Land of Dementia."}, {"userName": "Joanne", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/26956015-joanne", "userReview": "Overall a little underwhelming. I was drawn to this book because I like memoir and I enjoy reading about places I have lived. This one at its core is a story of home renovation. Really, it's not that exciting. My edition included an interview with the author at the end of the book in which she states her motivation for writing the book was to extend/capture the joy of the renovation. I can totally understand her enthusiasm for expanding her home, but really who wants to hear a lot about someone else's building project? Laying down floor boards for a new hallway isn't the most exciting topic. Once the cottage was moved and there was still half a book left, I wondered in exasperation, \"Is she really just going to detail her renovation?\" Unfortunately, she does. There are occasional bits of her personal life that kept me engaged and thinking perhaps there is more to this, but really there is not. Although the personal details kept me trying to connect to the writer, they really don't go anywhere."}, {"userName": "Barb", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/14527721-barb", "userReview": "There is something about the genre of books about people building their own homes or cottages or cabins that I simply adore. This one was solid -- the author is an engaging writer and I got a nice sense of the people involved in her project and the work being done. Even her cat's personality came through (and I hate cats). The other aspect that I appreciated was her go-for-it attitude throughout the process. As a more cautious, belts & suspenders person myself, I'm energized by someone else's risk taking, especially when it doesn't seem out-of-reach. Overall, a very enjoyable and inspiring read for the new year."}, {"userName": "Ellen", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/3352272-ellen", "userReview": "It took a while for this book to take hold for me, due in large part to the subject matter. The project of moving a cottage and attaching it to a house, navigating contractors and paint colors, didn't feel significant enough. But the author's writing style, her observations about things bigger than her own life and house project, and the appreciation for all the people in her life made me want to see this project through to the end."}, {"userName": "Becky Horton", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/2026904-becky-horton", "userReview": "I don't know how it would be possible to read this and not love Kate, her cat, her friends, the guys who worked on the house, Cape Cod, and, well, maybe the whole world. It was a glorious escape from all that is ugly and contentious. Kate, you're welcome to stop by for a cup of tea any time you're in the neighborhood."}, {"userName": "Jan Stone", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/22816111-jan-stone", "userReview": "an okay read--not spectacular"}, {"userName": "Rogue Reader", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/2610419-rogue-reader", "userReview": "Kate Whouley's Cottage for Sale takes my vote as one of the best books I've read on residential architecture and the relationship between home and heart. It was a serendipitous find, browsing the Ashland Public Library's shelves on residential architecture. Wholey's marriage metaphor aptly describes the complicated, deliberate, craftsman union of Whouley's small Cape Code home to an old-new cottage moved to the site - combining what I see as the best of measured, considered thought, and a beautiful, extravagant, certain passion.Whouley's cat looks on as Whouley chronicles her thorough and painstaking negotiation of details involved in land use permits, the talents of craftsmen and the progression of the project. I love her careful extravagance to create a perfect space, a space of dreams and vision. I think she must be a remarkable woman, caring so much about the work at hand, and communicating so well its personal importance to those in her life. Every detail is so carefully thought out, and I find it marvelous that the builders Whouley works with are so able, and so capable of both trusting her vision, and sharing their own perspective. It's a flexibility of construction that I didn't think existed in real life.The other aspects of this work that I loved were the use of space and perception of light. The need to expand into new space was constrained for so long, that when it finally occured, Whouley's discomfort was almost comical. A conversation later, and resulting furniture rearrangement resolved the difficulty. Her bedroom too, a bed centrally placed to see the sky and the trees gave peace and freedom. How the two buildings were made into one showed how clearly Whouley understood the relationship of the structures to each other and to herself. Light was central to the work too, from neighbor Barbara Dowe's dark bedroom to Whouley's understanding that skylights, windows and doors, the flow from old to new, from inside to outside, to being in a place of light and with a view - I can wholeheartedly consent to placing these as a priority of place and in life. This place, this home is wholley and entirely Kate's.I hope never to have to build, or to renovate but if I do, Whouley's work leaves me optimistic that it is possible with the right skills, the right outlook, and the right people on your side.Thank you Kate Whouley for writing Cottage for Sale, Must be Moved. There's so much more to think of in your work, thoughts that I consider private and personal, and so I am grateful for your expression of them. I wish to see more of your independent bookstore design work, more photos of your home. I so look forward to reading Remembering the Music and learning from your perspective and your narrative.\n--Ashland Mystery"}, {"userName": "Charlene", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/7333141-charlene", "userReview": "I finished it and overall likes it, but feel like the same story could've been written in half the pages. Not sure I needed to know about every baseboard window as the cottage went it. By the last 50 pages I was just ready to be done. Cute story that made me kinda glad my tiny house never made it further than it did."}, {"userName": "Judy", "userReviewDate": "Mar 19, 2012", "userURL": "http://www.goodreads.com/user/show/2421939-judy", "userReview": "My neighbor passed this book to me because she thought I would be interested in a local Cape Cod woman's story and it was fun to read. Not everyone is willing to wade through the paperwork and other obstacles in order to add on to your house by buying and moving an abandoned vacation cottage, but that's what single woman Kate Whouley did. Being the handy woman in my house, it was interesting to read about how she handled all the workMEN she depended on to get the job done, along with those local agencies, like the conservation commission, whose permission must be obtained. Being a former cat owner, I enjoyed her descriptions of Egypt's comings and goings. I appreciate visuals so I liked the photos she included. I admire anyone who can cash in on sharing stories about the passions in their life."}, {"userName": "David Jay", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/86169-david-jay", "userReview": "Kate Whouley is a middle aged, single woman who lives in a one bed house on Cape Cod. She finds a cottage for sale (which must be moved) and makes plan to attach it to her own house. Whouley is a lovely writer and a charming character. I loved spending time in her company. The book details, from start to finish, the process of finding, securing, moving and attaching the cottage to her home. I lost interest at various parts. I just didn't think the particulars of how the hallway was going to be created, or what type of flooring would go in the new bathroom was particularly interesting. But a sweet read nonetheless."}, {"userName": "Deborah Joyner", "userReviewDate": "Aug 16, 2007", "userURL": "http://www.goodreads.com/user/show/284568-deborah-joyner", "userReview": "If you've ever wondered what it would be like to live through a re-model or construction project - if you've wanted to take your home with you when you moved, if you're just curious about buildings in general, Kate has a story for you! Her home was lovely, just a little too small - when what should she see in Pennysaver but five little cottages for sale! There was just one catch - she had to move the cottage herself! Through the paperwork, the cranes, the construction, and the search for self and romance, we watch Kate marry her lovely little house with the cottage and make for herself a home."}, {"userName": "Virginia", "userReviewDate": "Jun 08, 2009", "userURL": "http://www.goodreads.com/user/show/244516-virginia", "userReview": "A friend gave me this book...it was one of two friends...and I blamed the one, but I think it was the other! Never have I tried to mull through such a boring book. I quit on page 159. The emotional tone doesn't change. The story is not at all interesting. Perhaps because I have overseen several construction projects, including building a separate house on my property, I just don't see what the big deal is about her having moved a trailor...and every excruciating detail, including what her cat was doing. (Pardon me, cat lovers...)"}, {"userName": "Janet", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/9680312-janet", "userReview": "Cottage for Sale, Must Be Moved is delightful memoir about Whouley purchasing an old cottage on Cape Cod and having it moved and joined to the cottage she was already living in. You will get to know a lot of quirky Cape Codders who help her out along the way - contractors, neighbors and family members. Glimpses into her longings for love are also revealed. This story could easily have ended up a litany of construction details, but it doesn't. Instead, Whouley gives us a lively and charming beach read."}, {"userName": "Kathy", "userReviewDate": "Aug 04, 2008", "userURL": "http://www.goodreads.com/user/show/1022271-kathy", "userReview": "What a delightful book! It's the true story of author Kate Whouley's 6-month adventure as she purchases an unwanted beach cottage and has it moved and attached to the side of her tiny 3-room home on Cape Cod. Throughout her funny AND not-so-funny experiences with house moving and construction, she skillfully weaves her life story and also does a great job of including the opinions of her cat, Egypt :) Egypt was not originally very happy about the new cottage attachment. I almost didn't buy this book because I thought it wopuld be too construction-oriented but I'm glad I did!"}, {"userName": "Julie", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/4560183-julie", "userReview": "I enjoyed this chronicle of the author's year long journey to purchase a Cape Cod cottage and move it to her property next to her home where it was then \"married\" to her existing small home. Having previously worked for a home builder, I was comfortable with the heavy use of construction jargon. I could sense her excitement with each step of progress made and would love to see more photos than those included in the book. Might not be for everyone, but I really liked it!"}, {"userName": "Sherry (sethurner)", "userReviewDate": "Oct 31, 2008", "userURL": "http://www.goodreads.com/user/show/1663390-sherry-sethurner", "userReview": "I read this one because WPR was featuring it on their Chapter a Day program. I didn't have time to listen, but I did find time to read this charming memoir. The author buys a Cape Cod cottage to move and use as an addition to her house. Sounds fine, except that nothing involving moving and attaching a house is simple. I was charmed by story and the author's attitude toward the whole project."}, {"userName": "Mary", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/736684-mary", "userReview": "Kate Whouley needed more room in her home on Cape Cod. She found a cluster of little beach houses for sale and bought one to make an addition to her home. This is a friendly tale about the process of turning an impulse to a charming addition to her home. We are allowed to meet all the people who came to work on the addition, from putting the house on wheels to the final coat of paint. Her cast of characters is as charming as her new cottage."}, {"userName": "Holly", "userReviewDate": "Oct 03, 2009", "userURL": "http://www.goodreads.com/user/show/2306905-holly", "userReview": "a guy at work recommended this to me as we were in the process of trying to move a cottage - needless to say i loved the book and laughed out loud many times during reading it as we came across the same exact things along the way in dealing with permits, septic system approvals etc. highly recommended"}, {"userName": "Donna", "userReviewDate": "Oct 10, 2008", "userURL": "http://www.goodreads.com/user/show/1247561-donna", "userReview": "Since I've always wanted to move a house I thought I would really like this. Not so much. I didn't hate it, I just didn't love it. Lots about marrying the cottage and the house. Lots about her femaleness. Lots about her singleness. Not whiney, but it took forever to read because I just didn't care."}, {"userName": "Teresa Lin", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/6976790-teresa-lin", "userReview": "I enjoyed getting to the writer and her cast of friends and contractors (who become her friends). Her voice is so real. The number of times I nodded in knowing agreement about the highs and lows of home improvement were numerous. I'm curious to read more of her work. I ranked it a bit low though because I wouldn't go back and read it again."}, {"userName": "Linda", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/9844514-linda", "userReview": "I could not get past the beginning pages. I was hoping for a book full of insights into the human condition, but the parts I read were just details of the building/construction process, and I was bogged down.This book might be better than I found it to be, given other reviews I've read. But I could not get into it."}, {"userName": "Paula", "userReviewDate": "Aug 23, 2014", "userURL": "http://www.goodreads.com/user/show/12192203-paula", "userReview": "This was a wonderful book. I love the problem solving that goes into home renovation and have always wanted to be involved in moving a house. Ms. Whouley has a very readable writing style and the fact that she included pictures and a map of the site made it perfect."}, {"userName": "Gary Turner", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/11565316-gary-turner", "userReview": "I very much enjoyed this book. Kate Whouley brings one right into the experience. If you like to read books about various subjects, this book is excellent. I read this book on someones advice and i am very glad i did."}, {"userName": "Sandy", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/1226722-sandy", "userReview": "Cape Cod - my life-blood. Contemporary narrative about attaching a classic vacation rental cottage to a Cape Cod cottage as an alternative to building a new addition. Not high quality reading but definitely entertaining."}, {"userName": "Deadra", "userReviewDate": "Jun 20, 2009", "userURL": "http://www.goodreads.com/user/show/2438316-deadra", "userReview": "I loved this book as it was a fascinating story of the process of obtaining and moving this cottage, then attaching it to her existing home. I enjoyed her descriptive writing style, as well as the relationships she developed with her workmen."}, {"userName": "Tracy", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/8021721-tracy", "userReview": "An interesting account of one woman's unconventional home expansion project.The hoops that were needing to be jumped to achieve her goal were no doubt ringing with self satisfaction upon completion."}, {"userName": "Genevieve", "userReviewDate": "Dec 14, 2008", "userURL": "http://www.goodreads.com/user/show/1294034-genevieve", "userReview": "Picked this up in a used bookstore in Boston Commons, and felt an instant connection with the author when she said she loved to read the classifieds because they were like \"reading stories, or maybe the skeletons of stories, waiting for me to invent their skins\".So far, so good."}, {"userName": "Sari Lynn", "userReviewDate": "Aug 04, 2009", "userURL": "http://www.goodreads.com/user/show/607109-sari-lynn", "userReview": "An enjoyable memoir about a woman who \"marries\" her house to a cottage, to create a live/work space. Whouley writes well, and the cast of characters - her friends and the various contractors, plumbers and electricians come to life as the story u nfolds."}], "description": "When Kate Whouley saw the classified ad for an abandoned vacation cottage, she began to dream. Transport the cottage through four Cape Cod towns. Attach it to my three-room house. Create more space for my work and life. Smart, single, and self-employed, Kate was used to fending for herself. But she wasn’t prepared for half the surprises, complications, and self-discoveries of her house-moving adventure.Supported by friends and family, and egged on by Egypt, her bossy gray cat, Kate encountered a parade of town officials, a small convoy of State Police, and an eccentric band of house-movers, carpenters, and tradesmen. She found herself dancing on the edge of the gender divide–infatuated with trucks, cranes, tools, construction terms, and a dreamy mason who teaches her the history of concrete.Sketched with a deft hand and told with an open heart, Cottage for Sale is a deeply personal story that captivates, inspires, and delights. In one remarkable year, Kate moved a cottage and created a home. Once you cross the threshold, you’ll never want to leave.", "title": "Cottage for Sale, Must Be Moved: A Woman Moves a House to Make a Home", "url": "https://www.goodreads.com/book/show/652823.Cottage_for_Sale_Must_Be_Moved", "average": 3.56, "cover": "https://images.gr-assets.com/books/1320454237l/652823.jpg", "reviews": 49, "authors": [{"url": "https://www.goodreads.com/author/show/350977.Kate_Whouley", "name": "Kate Whouley"}], "type": ["Autobiography", "Nonfiction", "Humor", "Architecture"], "outlinks": ["http://www.goodreads.com/book/show/652823.Cottage_for_Sale_Must_Be_Moved", "http://www.goodreads.com/book/show/12609775-cottage-for-sale-must-be-moved", "http://www.goodreads.com/book/show/949346.Cottage_for_Sale_Must_Be_Moved", "http://www.goodreads.com/book/show/10725231-remembering-the-music-forgetting-the-words", "http://www.goodreads.com/book/show/2150945.Manual_on_Bookselling"]}