{"ratings": 5627, "userreviews": [{"userName": "Lola  Reviewer", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "**5 ENTIRELY DESERVED AND BRIGHT STARS.** I’m going to be VERY honest with you guys:I want to eat this book. Nom nom.I want to devour every word and every chapter slowly and taste its flavours because, if it’s as amazing as the reading was, it may be even better than pizza. Or sushi. Or ice cream… Nom nom.Yes, believe it or not, it’s the truth.Cracked is the most entertaining book I’ve read so far in 2014. Even more than Rebel Belle which I didn’t think possible because that book is so much fun!Cracked is the kind of book you don’t want to let go because there is always something interesting and surprising in it and it has a hold on you. There were so many things I was hoping to do yesterday, such as watching Once Upon A Time, Hit The Floor or clean dishes. Oh, and I was looking forward to seeing this movie called How to Train Your Dragon 2 at the cinema. But no, Eliza Crewe had to write a fantastic novel to keep me off doing all those enjoyable things I planned to. Did you hear that? It’s called being sarcastic. I’m warning you, if you want to read this book and like it (or love it!), you better get used to it. *winks*Meda, can I kiss you? Maybe shouldn’t have said that publicly, sigh. I feel so connected to that character. It’s not because I have the same personality as her, no, but mostly because she’s so… real. She is honest with us readers even if, yeah, sometimes you may thing she isn’t. Again, she’s really sarcastic. And I loved that so much about her. It’s pretty rare that I actually laugh out loud while reading a book but Cracked simply succeeded to make me giggle and smile and bite my nails because, yes, it is not only rainbows and sunshine. Let's not forget that there are demons envolved so don't expect this to be to die for funny.The story, wow. The story is unpredictable and, again, WOW. When I started reading this book, I was expecting it to be good because of the rave reviews and the hype, but I’m always a bit suspicious when I see a lot of 5 stars. I’m not the kind to give 5 stars all the time and very easily so I’m as surprised as maybe you are. There are so many twists and, yes, secrets but it was actually interesting and I always wondered if the characters would or not discover the truth. Either way, I was excited and couldn’t wait to see what was going to happen next!There is some romance but not in fact including the main character a lot. My GR friends know that I could read a book only if there is a little romance in it. In Cracked, there was some indeed and just the perfect amount to keep me hooked. Plus, I just love love/hate relationships. Don’t you?I love/adore this book so much that (yes I know I already have it in digital copy duh but…) I ordered Cracked in paperback so I could eat it…I mean…read it, of course.Highly recommended series."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "I really, really fucking hate it when a character in a book refers to a character in another book and exclaims \"She's just like me!\" No, beeyotch, you are not Elizabeth Bennet *snaps fingers*. No, you are not Juliet. Do you even realize how stupidly the characters in Romeo & Juliet behaved? Nuh uh. Don't you dare make that claim.Therefore, it is with the greatest amount of shame and hypocritical horror when I found myself laughing as I read this book, \"MEDA IS JUST LIKE ME.\" I don't know how Ms. Eliza Crewe managed to capture my personality so well without ever having known me, without having met me, without knowing of my existence in any conceivable way, but bravo, Ms. Crewe, BRAVO.Fine. There are some discrepancies between us, ok? I can't fight, and I'm more inclined to run (seriously, I am a fast little mofo), and I used to sleep with the blankets tucked up all around me, particularly around my feet so that monsters wouldn't eat my toes while I cowered in bed. And Meda, while fantastically snarky sometimes, never has a profanity-laden vocabulary. But it's all good. Meda is a teenager! I was a squeaky clean teenager once. But I can see the potential in Meda as she grows up to be more like me. Ah, Meda, my dear. You have much to learn as you grow into your twenties. Your mind and mouth will no longer censor itself, and Meda, my love...the fucks will fly. ^________^I should probably go back to the actual review and talk about stuff that's relevant to this book. I will try to tone down my narcissism meanwhile...In short: Interesting (though imperfect) plot. Likeable main character. Above all else: the characters are fantastically conceptualized, the dynamics within the group are absolutely brilliant.Summary: Meda Melange isn't exactly human. She knows she's half human...but the other half certainly ain't anything remotely angelic. Why? Um, one clue may be the fact that SHE EATS SOULS. Here's where Meda and I differ: I crave chocolate, Meda craves souls. She's not all bad, though, she only munches on a soul every, say, month or so. Me, on the other hand *snorts*.Meda is pretty much indestructible to the average human. Her skin is like fucking steel. She almost cannot be hurt. Until she runs into a group of demons and realizes that...well, fuck, she's not so indestructible after all. Well, shit happens, and Meda lucked out and gets her ass saved (and eats a huge dose of humble pie in the process) by a group of Crusaders. No, not the ones in the 12th century who traipse to the Holy Land. These are oh-so-righteous people whose destiny is to protect humans with special destinies who will make a contribution to mankind called Beacons. They think Meda is a Beacon. Meda doesn't want to die. Meda lies her ass off. She pretends to be a Beacon in order to:1. Infiltrate the Crusaders and figure out their super special secrets!2. Survive (she did almost get her ass handed to her, after all, girl's gotta live)One thing leads to another, and Meda and her very disorganized group of Crusaders find themselves on the run from a bunch of bloodthirsty demons who wants Meda's ass handed to them on a silver platter. Meda seriously lucked out, because these Crusaders are good-hearted and are so convinced that she is a Beacon that they will risk their life to save her.Meda also slowly uncovers the truth about her past. There are secrets! Lies! A sexy half-demon in a dungeon! (Another way Meda and I differ, she ignores him, whereas I would have kept him imprisoned in my bedroom. It's understandable, though, Meda's not even legal yet.)Needless to say: this book is a lot of action, and a lot of fun.The Characters: The best thing about this book.Meda Melange is one of the funniest, most kick-ass character in YA paranormal that I have read in a long time. She is truly kick-ass. She can FIGHT, man. If Rose Hathaway  and Charley Davidson were to have a daughter together, I like to think she would turn out to be just like Meda. Let's just conveniently ignore the fact that two females cannot have a child containing both their DNA. Because, as we all know, scientific facts have no place in YA literature. As a Soul Eater, Meda has twice the kick-assing potential of Rose Hathaway, and half of Charley Davidson's snark (and for many people, that's a good thing. Charley can be way too much sometimes.)Not everyone likes me. Not everyone likes my sense of humor, my snarkiness, my personality. That's fine. As such, not everyone will like Meda. There is a fine, fine line between humor and bitchiness, and as it turns out, Meda is a character I can relate to, a character I understand, a character whose personality I love. If you don't like her, if you hate her, if she grates on your nerves, it is completely within reason and I will not judge you for it.Meda has a hilarious inner monologue. The first few chapters are particularly brilliant examples of it. We get to see her bad-assedness firsthand as she ruthlessly kills a murderer and eats his soul. Truthfully, I would have liked to see her fight more instead of suppressing her inner demon and pretending to be a normal human girl.We get to see her internal weakness and her guilt at what she's done. We get to see her use her feminine charms and tears (she is not beyond fake-crying if it gets her out of a tough spot) to manipulate a very naive, starry-eyed Crusader boy:\nI consider the many tools at my disposal, eyeing his large blood-splattered frame, and settle on my weapon of choice – one so infrequently used I need to dust it off first.My eyes fill with tears. “Wha–” I swallow hard “– what were those things?”“Demons.” Thanks, Einstein. I got that part. I let a tear trickle over.He hurries to reassure me. “Don’t cry – I’ll protect you.”Humiliating. Absolutely humiliating.\n*snickers*Meda uses whatever she needs to lie, trick her way into the group to earn their trust. It doesn't always work---particularly when there's a fellow bad-assed girl in the Crusader group who's just not into her crap.\nCue innocence! My sweet lashes flutter against my helpless cheeks, my useless hands wring the edge of my guiltless, blood-soaked nightgown. My lovely lips quiver over my pearly white teeth.Jo isn’t buying...Damn, that gimp bitch is a hard sell.\nMeda is not perfect. She feels guilt. She makes some discovery that blows her world apart. Her trust has been betrayed, her life has been a lie. She has to come to terms with that, as well as her own dark nature. She kills out of necessity, but she hates herself for it, when her base nature isn't rejoicing in the darkness.\nI’m ashamed of my wickedness – when I’m not reveling in it.\nCertain books completely ignore the side characters: this book does not. The side characters---namely, Jo, Chi (Malachi), and Uri, are all equally well drawn. The dynamics of their relationship are spectacular. Jo and Meda, and Jo and Chi in particular.Jo and Meda do not start off well. Jo is a really, really tough kick-ass girl. She is truly a match for Meda---except for the fact that she has lost one leg in a fight years ago. Meda and Jo start off on the wrong foot (no pun intended, I swear on my grandmother's grave, I would not be so callous D:). They distrust each other, Jo knows Meda isn't who she seems, she knows Meda's just putting on an act of innocence. In turn, Meda looks down on Jo, calls her a \"gimp,\" because of her disability, and hates her tough-girl personality. Slowly, they learn to trust each other, they learn that each has her strengths and her underlying weakness, they come to trust each other, they develop an odd sort of friendship. The developing relationship between Meda and Jo is a beautifully written one. Jo is such a complex character, she hates herself, she hates her disability, she hates her helplessness.\n“I just get so mad sometimes. I’m never going to be a Crusader, never get married, never do anything. But who do I get to be angry at? The demons? They’re constantly trying to destroy mankind and, if at all possible, Heaven too. There’s enough reasons to be angry at them – my leg’s superfluous. The other students, the Crusaders for how they treat me? They’re not trying to be cruel, I am damaged. They’re so very kind, so full of pity. I’d rather they hate me than feel sorry for me.”\nMeda never sees Jo as helpless, and Jo appreciates her for that. Their friendship builds on top of that.Jo and Chi...wow. They were best friends, until the incident where Jo lost her leg. Chi feels guilty, and they both pull away from each other.\n“You don’t deserve to be a Crusader – and it isn’t because you don’t have the legs, but because you don’t have the heart.”\nTheir hurt, their anger, their tense relationship is so intensely well done.The Romance: Um, what romance? Throw away your expectations of romance, of love. There's no insta-love, there's no love triangle, there's none of that shit here. Can I get a \"Fuck yeah?\" FUCK YEAH.\nThe new attendee, a man, crouches in the doorway. Well, not really a man, a human teenager. One of God’s most misbegotten creatures – big like grown-ups and yet dumb like children. Selfish, moody, reckless, with a tendency to sleep too much and complain too often.\nThis book is tremendously fun. It is not without its faults. There are elements in the book that I tend to frown upon (death of a parent, a special destiny), etc., but it is also wholly original in other. It takes quite a few YA tropes and throws it out the window to a bloody death, and I found it absolutely admirable. The book is action-driven, plot-driven. I would have liked this book to be less fast-paced. It felt like some scenes were glossed over far too fast, and I would have liked to know more about Meda's past. Not a perfect book, but still quite enjoyable. Because Meda is the main character. And Meda is so me, man!"}, {"userName": "Navessa", "userReviewDate": "Jan 14, 2014", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "Yes. Fuck yes. This was fucking awesome. How awesome, you ask? Well, the last YA book that gave me these kinds of feels was Angelfall. THAT WAS OVER THREE YEARS AGO.If you look at Crewe’s author page, you’ll learn that she’s an avid reader. It shows. Only a true devourer of literature would know how to avoid so many tropes and themes. There were none in this book. At least none of the ones that piss me off. And if you know me even in the least, you know how rare that is. This MC is an unapologetic sociopath. The cast of miscreants (who are supposed to be the good guys, BTW) that surround her are equally imperfect and yet equally lovable. The plot contains one twist after another. The world is richly imagined and flawlessly fleshed out. And the grand finale, my very favorite part of this book. Drum roll, please!THIS IS NOT SOME CHEESY ROMANCE MASQUERADING AS ACTION/ADVENTURE. THIS IS THE REAL FUCKING DEAL, PEOPLE.*cue applause*In short, why the hell haven’t more of you read this?! Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Anne", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Fuck yeah! Can I give the book 5 stars and give Meda 10?! Is that possible?Love her. Just...Meda..ALL THE STARS! Just take them, you snarky little bitch! She is, hands down, the best female protagonist I have ever had the privilege to read about.It's not that she's really evil, per say. I mean, she does sort of eat people occasionally, but most of them deserved it. *cough*But what really impressed me was her inner dialogue. Crewe has created a young female character who thinks exactly the way I wish every young female character would think! When I rolled my eyes at something the inspirational boy-hero said, so did Meda! When I thought, \"She should probably just eat that nice idiot and make a run for it.\", wouldn't you know she was thinking the same thing?! I mean, sure, he seemed nice and all, but a girl's gotta do what a girl's gotta do!And yes, I realize I'm overusing exclamation points! I just can't help myself right now!It's taken me forever to write this review, and I still can't process the right words to say how much I loved this book. I have nothing. NOTHING!{insert mindless squealing here}Ok.Meda...is so AWESOME!Wait! Stop! Come back! I swear I'll think of something...*deep breath*What I'm trying to say, I guess, is that it's not the journey you take with the plot, so much as it is the journey inside Meda's mind that makes this one so much fun to read.Also, there's no romance for our main character. But there is a romance. The one between the other two characters. In fact, those guys are the traditional hero & heroine we're used to seeing in young adult novels.The guy is handsome, strong, talented, and good. The ladies want him, and the men want to be him.He is...The Golden Boy.Or as Meda calls him...The Idiot.The girl is tough, self-sacrificing, and smarter than everyone else in the room. She has an injury that makes everyone else feel the need to protect her, but she just wants to prove that she can fight alongside the other hunters.She is...The Wounded Warrior.Or as Meda calls her...The Gimp.And these geeks are who Meda gets stuck with while she's trying to figure out who what she is, and why she does the things she does.How does she get stuck with them, you ask?Well, she ate the wrong bad guy, got jumped by some demons, rescued by Golden Boy, interrogated by Wounded Warrior, and sort of passes herself off as a victim to gain access to this group of demon hunters with all their knowledge about soul-suckers like herself.'Cause she's sorta in the dark about who she is, and why she does the things she does. Her mom was the only one who knew about her appetite, and (quite rightly) kept her away from the other people. But her mom died without explaining much of anything to her, and she's been on her own for a while now. And the only thing keeping her from going full-on chompy is the conscience she borrowed from her mother.M'kay. There were SECRETS regarding her mother that I figured out fairly early on. I think they were supposed to be revelations. Alas, no...Did that lessen my enjoyment of the story, you ask?Were you skimming this review?! I mean, did you not read the first bits where I was all screaming, and fainting, and flailing around?!Sheesh!Come on, people! Keep up! Again, it's the trip within Meda's mind that's the real draw to Cracked. The plot is almost a parody of all the other young adult books out there. I mean, it's not that it's uninteresting, it's just wouldn't be anything special without Meda pointing out all the inconsistencies and plot holes in her head.In other words, Meda is AWESOME!Ok, ok! I'm done!Also reviewed for:"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "[ Oh, Uri!!! *cries*  (hide spoiler)]"}, {"userName": "l a i n e y", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/10752235-l-a-i-n-e-y", "userReview": "My morality is almost a contortionist\n\nIt wasn't so much the plot as it was E-V-E-R-Y-T-H-I-N-G. It was the characters (oh my god Meda! [and Jo]), the writing, the humor, the adventures, the innocents and the evils. It was basically every single thing that made up one hell of an awesomely pure entertainment of a book.» if you want to write a story about the 'chosen one', this is the way you do it. Otherwise I don't think you should bother.» The writing was extremely refreshing, it's extremely well-clipped and precised. You won't find long-winded, unnecessary sentences here. The author had such solid authority: she never got side-tracked and her characters, especially the downright fabulous Meda, had extraordinary presence throughout the book. What I loved loved loved was that this never weavered. It held through to the last page.\nThey creep forward in smooth, slithery steps. That's fine, I like my food delivered - especially when I don't have to tip the driver\n» How I loved Meda! She had this kind of snarky humor that was just so effing clever. I absolutely adored it.» I was so content with the dynamic of their little group - Meda, Jo, Chi and little Uri. \nThey were teens who were real teens,\n they were 'excellent' students but they were not capable of all things - not like in your typical YA novels where teens can just about run the world by themselves and be way more efficient than adults. So because of that fact, the suspence was real and I was so scared for their well-beings the entire time.» Meda and Jo's friendship. (Is there not a 'combine word' for that? Do we only have 'bromance'? Well ok then) \nJoe turned towards me. She doesn't want to die, but she will, for what she believes in.I need new friends\nEliza Crewe managed to ease the dynamic of these two from open animosity to best friends status with such realistic situations, you can't do anything except root for this amazing female friendship. Which I did, I definitely do.I'm so ready for book 2 to see what kind of havoc Meda and the gang will wreck next!PS. I swear I hadn't teared up at all.... until that last paragraph.."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Ok, hang on a minute.\nNow I'm back.This book!\nMeda is a bad girl..well she sometimes is. She is human souls. Just the bad guys so relax. I fricking loved her. I think I liked most of the characters in this book. All of them are fleshed out and are great on their own. (JO!!!) Put them all together and you have SHAZAM!! I wanted to quote this whole book but that would stop you from reading and you so want to read it. Run don't walk to get it.Oh and yes this:\nEverytime I smell or eat popcorn for the rest of my life I'm going to think about this book.Psst get this..my cheap/broke ass actually bought this book. I know huh?"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "I was just going to follow along the discussion thread at Buddies Books and Baubles but then I re-read the first chapter and screw it I'm all in again.Buddy Read with V!cky, , Catherine, Jessica (maybe?), Kerry, Sandra, Liz, Tanya, Tandie, Sh3lly and a few stalkers to be named later when I figure out who they are sneaky stalkers and their capesWas it as good as the first time I read it?Well not quite - I noticed some of the silly high school stuff that a few others have mentioned.Did I care?Not at all because.....MEDA!!!!MEDA ROCKS AND GETS ALL THE STARS!!!Original review May 2014You’ve read how many different stories about the same nice girl who learns she is special and goes off on a journey to grow into her abilities This is not that story Meda is a monster, she is not a good girl, her sense of morality is borrowed from her mother and at times is very flexible. \n… there are some people you shouldn’t anger that you don’t know about, because no one ever survived to warn you. I’m the third kind. I eat souls.\nMeda led a very sheltered life up until the time her mother died. Her mother did the best that she could with the monster Meda was and tried to teach her all the values a human should have, but not everything stuck. Meda’s sense of humor is dark and self-deprecating but hilarious non-the-less. I loved reading her inner dialogue in all situations as she tries to play nice with the humans.\nMom only wanted me to kill people who deserved it, and my morality’s flexible enough to toss in self-defense (and everyone know the best defense is a good offense…my morality is almost a contortionist).\nShe doesn’t know a lot about herself or where she came from but through a few twists of fate she ends up with the people who are trying to kill her kind. When she is discovered by a few members of the Knights Templar she decides to play along and see if she can’t find out any information from the enemy. But as she is playing a dangerous game, if they find out who she is they will probably just kill her. Chi, is the heroic boy who found Meda and is determined to save her, he is also her best source of information. Meda is not above using a few feminine wiles to separate him from Jo, a girl that definitely likes him and hates her, in order to get that information.\nChi likes all the attention, but I can’t help notice his eyes sliding over to Jo when I do something particularly outrageous – like stroke his abs.Yes I did, and they are amazing.\nI loved this book. It was so nice to have a different kind of main character and see her transformation throughout the book as she discovers more about her past. Meda was so funny, she was never pouty or fell apart and some of the best times are when she is disgusted with herself for playing the part of a weaker girl in need of saving, because she is definitely not that.The story was super-fast paced. It starts out fast and just keeps on going. Fights with Demons, discoveries about who Meda truly is and why she is here and the building of friendships and bonds. There were so many great moments that I loved and the humor really carried throughout. I can’t remember the last time I read a book this fun.In all fairness there are some heavy moments, but I totally loved the wrap up to the story and I can’t wait to see what happens next. If like me you are tired of most of the YA books out there I recommend you give this one a try. it is so refreshing to read something in YA without a love triangle or relationship angst that is just a great plot and a lot of action."}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "[ (hide spoiler)]"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/4.5 Stars\n\"I eat souls. The packaging can be tricky, but fortunately I am blessed with special skills to pry my meals from their pesky shells. My teeth rip skin; my jaws snap bones. I am fast, lightning-fast, snuff - oh-was-that-your-life? - fast.\"\nHoly f&*^! What did I just read?!?!?!?!?!\nPermission denied. Keep your s*&t together, Mitchell! This soooooooo should not have been a success for Kelly and the Book Boar. YA fantasy is NOT our bag. You're talking about a genre filled with a bunch of mamby pambies and terrible world building and overuse/abuse of the same tired out themes over and over and over again. What just happened?!?!?!?!?To put it in a nutshell, Meda happened. Meda isn't your ordinary YA heroine. She has a little something different hiding under her surface . . . .\nShe's just a teensie bit demonic. And it was AWESOME. While other girls spend their time chasing after vampires and werewolves and falling into instalove with anyone who has a peen, Meda goes around sucking the souls out of bad guys (well, mostly bad guys). You see, in addition to Meda being a soul eater, she has another little secret . . . \nand spends her free time nom-nomming the bad guys on behalf of the ghosts who seek her help.\n\"I suspect they never really feel guilt, but I make sure they drown in regret. Red, sticky regret.\"\nNot only did Meda totally kick ass, but she did it with the absolute BEST voice of a YA female MC I've ever read and a most delicious dry wit. And after all the butt kicking and being badly good were over, Cracked went where no other paranormal book has been able to go . . . \nDear Meda, please ignore the gaggle of screaming fangirls. I’m fairly certain we’ll both be happiest if you choose me . . . the middle-aged chubbo with a collection of dead critters . . . to be your bestie. Anyone who can make this grumpy cat fart rainbows is the one I should split a BFF necklace with . . . \nBlame Credit for this review goes to Liz. Although I now see about a jillion of my GR friends have read this/have it on their TBR, it was her review that made me finally break down."}, {"userName": "☆☽Erica☾☆", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/41218534-erica", "userReview": "What a fantastic book.The story is crisp, clear, and direct. It is about a half-demon girl who discovers the secrets of her past while also managing to be fierce and hilarious. And the main character, Meda's, narration is absolutely spectacular. She combines snarkiness with vulnerability to the point of perfection. Her voice is distinct and extremely memorable. Also her friendship with the other main female character, Jo, was simply amazeballs. They are true friends that trust and care for one another through all their flaws, instead of a forced persona by either of them. This and \"Truthwitch\" both are some of the best female friendships in books I've seen. I REALLY, STRONGLY recommend this. It has made my all-time-favorites list.I'm gonna peer pressure you into reading this.DO IT. >:D"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "Unpopular Opinion Time.This was a Buddy Read with Buddies Books and Baubles Group.This book got a lot of hype and a LOT of my friends love it. I understand. This book is written well and does not have all the typical annoying YA tropes. Meda is awesome. I love the humor. I just think I am getting too old for YA. Most of the book involved going to a \"school\" where the up-and-coming \"Crusaders\" (demon hunters/killers) trained. So most of the book was about Meda trying to be in this school and not get noticed while she tried to spy and find out more about herself (she's a half-demon - and more, but you can find out about that yourself, I don't want to say too much).It reminded me a LOT of City of Bones and even Harry Potter a little. Meda was original. She is not your typical special snowflake Mary Sue. I loved that. But it wasn't enough to keep me engaged in the story. As supporting characters go, Jo was cool, but I felt absolutely nothing for Chi. And what's up with all the digs on crippled and handicapped people? It seemed excessive, even if it was just due to us being in Meda's head and her being socially inept. There's a lot of potential here, and I would still recommend this. For YA, this is great. I think I am just not the target age group for this and I could tell. But, it's probably just me. So read it. It's worth the price of the book. If you liked this, you should check out City of Bones (if you haven't already) and also These Broken Stars and Blood Crown. They aren't the same, but for some reason remind me of each other a bit.Oh well."}, {"userName": "Rachel E. Carter", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/29482005-rachel-e-carter", "userReview": "4 out of 5. Honestly felt like it would be a 3 for a while there, but it is definitely a 4 after that ending.What I loved:* Meda. So sarcastic and awesome, like Joss Whedon's Buffy on crack. I love, love, loooved her narration. I honestly am not sure I have read better sarcasm from a main character in any book. Period.* Meda & Jo. These two. I ship them as BFF's. They are feisty brats who don't trust each other and alienate everyone around them and I just love how their friendship builds throughout the book.* Jo & Chi. I did root for them, and that ending was just adorable. * the ending. DAMN. Did not see that much happening in the first book of a series. Color me impressed. I could give 5-stars for that ending alone.What I didn't love:* the story seemed to drag a lot after the first chapter up until the last 1/4 of the book -that said, I just kept looking for romance and the school/ghost bit bored me, but it wasn't ever boring because we had Meda's narrationWhat I want to know more about:* Armand. We only had a glimpse but he felt very curious. I think there is more to him then meets the eye, his being down in the prisons was a bit too convenient. That said, he was hot.* Meda's mom & father. I have a feeling I'll get more in the sequels.To help go through my TBR faster, I am going to try and write shorter reviews:)"}, {"userName": "Inge", "userReviewDate": "Jun 10, 2014", "userURL": "http://www.goodreads.com/user/show/6278820-inge", "userReview": "4.5 starsI’ve heard so many good things about Cracked, I don’t know what kept me from reading it for so long. Maybe I was afraid of being the only one not to like it again, but I should’ve known that wasn’t an issue. This was every bit as amazing as everyone said it would be.Meda eats people. No, really. She eats souls, so I guess gingers are safe from her. But she only eats the bad guys – the ones the ghosts tell her to kill. She’s half-demon. Her mother told her she was special; a special snowflake, but it turns out there are more like her out there. Full demons, too. And they’re out to get her. Luckily, there are the Templars – people who are trained to kill demons. Meda pretends to be a helpless girl and finds herself in the Crusaders’ school. But should they ever find out what she truly is, they’d be out to get her, too. So basically, she’s fucked.Let’s start with one of the best main characters of all time. Move over, whiny protagonists. Give me Meda any day. I feel kind of bad for saying I could relate to her because she’s supposed to be evil, but man, I relate to her. Her snark and sarcasm made me laugh out loud on several occasions. She was awesome, quick, and witty, and I loved seeing things from her twisted point of view. It’s also different because she starts out as the bad guy, which makes for an interesting perspective on things.\nI could always just leave her behind. What is that old adage about outrunning a bear? You don't have to run faster than the bear, just faster than the other people you're running with.\nShe also knows what’s important:\nThe Teenage Mutant Ninja Turtles lied to me. The sewer is emphatically not somewhere you want to live, let alone eat pizza in.Uri and I are stashed in a cheap motel with the important task of sleeping. It's the kind of division of labor I can really get behind.\nThis girl knows her priorities. If she wasn’t a soul-eating monster, I would totally be down to have her as my best friend.I also really liked the side characters – the Templars protecting Meda from the demons. I especially liked Jo. For some reason, I immediately pictured her as Leslie Winkle from The Big Bang Theory. She has a fake leg, but don’t let that fool you into thinking she can’t handle her own. Jo is badass and will take none of your shit.Then there’s the sense of humour in this book. I will always appreciate a good, healthy dose of humour in books. Seeing things from Meda’s perspective, laced with an endless stream of sarcastic comments, is one of the best things ever. It immediately reminded me of the humour in Croak, which I also loved to bits. I think it’s time that we shove these angsty protagonists aside and make room for more awesome people, like Meda and Lex.I recommend this book to any lover of Young Adult and Fantasy who wants something original and different. Cracked is a delicious mix of fantasy and humour, and I can’t wait to devour (haha, get it) Crushed."}, {"userName": "Poonam", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/17656456-poonam", "userReview": "After having a dry spell with books I finally picked this one up and I am glad I did.Meda the main protagonist came off as really creepy at the start.\n\"His eyes are wide and panicked, and I pause to enjoy that perfect moment when the hunter realizes he's become the hunted, when he tries to reconcile what he knows to be true with what just happened.\"\nMeda is also devious.\n\"I don't want to jump in with an alternative plan- I'd rather they do it. It's usually a good idea to let other people think my plan is their plan. I have enough brilliant ones that I don't mind missing out on the credit.\"\nAnd then she became one of the funniest main protagonist I have read in a long time!\n\"Fortunately the nearest couple are in a heated debate concerning each other's lineage and don't care about a pack of high-school students. The way they're going at it, we might get lucky and get dinner and a show.\"\nWe have some very interesting side characters and the fantasy angle of the story was interesting to me from start to end!The twists at the end and the note on which this story ended made me love it even more...I really hope Meda does not change in this series and in the last few pages I was like"}, {"userName": "Melissa (Ever So Mela)", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/28640648-melissa-ever-so-mela", "userReview": "Remember how I said \"review to come\"?...Well, this is a review...just...one that's going to direct to you to more awesome reviews ^_^My main girl Brit Chester, you deserve Ansel for this ♥ ♥Anna, I wanna send you Captain Hook for this ♥♥Super duper sweetie, AJ :PKat from What's on Kat's mind :)Shelby and her flying monkeys. Don't mess with the monkeysAnd I can't forget Sarah, cause if she read YA and LIKED it, it's gotta mean something.Pre review:So Anna and Chester were right ^_^ Apparently they have good taste. Who woulda thought? :P"}, {"userName": "Natalie Monroe", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "EDIT 29/9/2014: Crushed, the sequel to this confetti of badassery has been published! Eliza went through hell and back to wrangle the rights back after her publisher folded and let me tell you, it is worth the wait. But before you can bask in its greatness, you must first taste the awesomeness that is this book.If the mangas D-Gray Man and Soul Eater had a love-child, it would be Cracked.Reading this book was akin to reading those first few volumes of a random Shounen manga, where the concept is fresh, the humor is proportionate to the action, and the plot is logical. You know, before it all inevitably goes downhill and we get arc after arc of crap because the author is torn between dragging out the series and actually having a overall plot. Not you though, Fullmetal Alchemist, you were fantastic all the way to the end.Cracked never got old though. The snarky humor, the action, the plot...it all stayed consistent throughout the story. And we have manga elements too. I'm convinced Eliza Crewe is secretly an otaku because I spotted so many familiar ideas from different Shounen series. We have the demon-hunting institution and the half-demon thing going on from D-Gray man, Meda eating souls just like the weapons in Soul Eater do and Meda's name sounding very similar to the protagonist of Soul Eater, Maka. The series name is called Soul Eater, for crying out loud!I even saw Naruto in there:\n\"I bite down on my finger until I feel the pop and burn of torn skin, then press the welling spot of blood to the pad. The door opens with a click and hiss.\"\nDoor-opening no Justu!As you can probably tell from the above quote, Meda isn't squeamish about blood. In fact, she's most likely the one spilling it. She eats souls and the only way she can get at that tasty morsel is to rip her victim apart. Anna Dressed in Blood, who?It's refreshing to have an evil heroine who doesn't angst on about morality. Meda embraces her monstrosity. It's like when Soul gets infected by black blood in Soul Eater and went mad. Or Lector Hannibal from Hannibal. She's brilliant, deadly, and completely cuckoo—but only to the outside world.And if strength fails, she relies on her wits. She's not above using her, ahem, feminine wiles to save her skin from demon-hunters. \n\"'Just go look at it!' I snap, then cough and bring my order down to a whimper, placing a hand on his arm. I look up through my lashes, then bat them a few times for good measure. 'I'm sorry, I just want to make sure it can't comeback and get me.' He smiles like a boy asked to stomp on a spider for silly girl and I know I've won.\"\nPoor dude never had a chance.Not that Meda doesn't have a conscience. She only kills bad guys as directed by their ghostly victims, but when the shit hits the fan, she will always choose to save her own ass. There's this scene where her demon-hunting comrades are arguing over something superfluous and Meda stops it by saying, \"Hello, can we get back to the real problem at hand? Me!\"Slytherin, through and through.Her observations are delightfully snarky too.\n\"The Teenage Mutant Turtles lied to me. The sewer is emphatically not somewhere you want to live, let alone eat pizza in.\"\nThough Meda is my favorite character, Jo comes a close second. Call it woman's intuition or just plain old brains, but she was only one of the demon-hunters not to fall all over Meda when they encounter her. Their friendship is gradual and very believable. At first, they hate each other's guts; Meda because Jo's presence stops her from manipulating the boys for answers regarding her lineage, and Jo hates her because, well, Meda's a demon, though she doesn't know for sure at first. However, as the story goes on, they grow closer and begin to respect the other. Jo calls her out on her faux damsel-in-distress act, but in a playful way. And Meda acknowledges Jo's fighting skills and doesn't coddle her just because she's disabled.Oh, did I mention how awesome it is to have a butt-kicking disabled character? Jo had her leg ripped off in a demon attack a couple years ago and she walks with a limp because of her prosthetic leg. That doesn't stop her from being a fantastic demon-hunter though, no matter what the institution thinks. She may not be fast as the others (gimme an A for authenticity), but she can fight just as well. Maybe even better.Also, the characters in this book know of this magnificent invention called the Internet. They need to find someone, and one of the characters, a kid no less, immediately suggested Google. I wanted to kiss him for it.To wrap things up, Cracked is a brilliant, action-packed read filled to the brim with sarcastic goodness. I'll definitely be reading the sequel though the blurb sounds eerily like Victoria Scott's The Liberator. Quotes taken from an uncorrected galley proof and may be subject to change. ARC obtained from Netgalley"}, {"userName": "Nasom", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/67824881-nasom", "userReview": "[ from Meda being half Templar, to Uri dying, to her dad being really important, to her killing her mum  (hide spoiler)]"}, {"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "Well, well, those Strange Chemistry people just keep throwing these little gems at us! It’s the only imprint that has yet to disappoint me in any way and Cracked is another one of their successes waiting to happen – funny, thought provoking, surprising and surprisingly heartbreaking, it is a great beginning to what promises to be a fabulous new series.So many YA authors avoid taking risks at all costs, choosing to rely on tested recipes and roads well-traveled instead, but Eliza Crewe cannot be counted among them. The opening scene of Cracked, with Meda in an asylum preparing to eat the soul of a vicious murderer, sets the tone for the rest of the book. Cracked is bold and daring and above all, different, all due to Meda’s distinctive voice and her moral ambiguity. Meda has hardly any redeeming qualities. She is blood-thirsty, self-centered and just a tiny bit evil, but somehow Crewe made her likeable anyway so that, even when her actions make us cringe, we can’t help but laugh at her antics and her witty comments. \nI’ve always known I’m a monster. My skin is as tough as sheet metal, my bones are almost impossible to break. I can run faster and jump higher than any Olympian. My strength is unreal. And let’s not forget, I eat people…\nCrewe has the teen language down to a T, which gives Meda’s voice additional authenticity and spark. She cannot be mistaken for an older character, and her sarcasm combined with the typical teen wit and sharpness give her an original voice that will cause you to laugh yourself into stitches.Demons and Templars aren’t new in YA, but Crewe offers a slightly different take. Although just a touch too juvenile at times, the worldbuilding is well structured and rich enough to give the story a very distinctive flavor. Cracked hides quite a few surprises along the way, things I never saw coming and some I suspected but was unsure of. In addition, Crewe has a talent for making pretty standard characters seem new and fully fleshed-out. All this makes Cracked a must read; while it doesn’t offer astounding depth, the entertainment value is practically immeasurable. Eliza Crewe is a promising young writer who dares to take risks, already a force to be reckoned with. Read Cracked, and then join me in comfort-eating muffins and desperately begging for the sequel. Not because Cracked ends with a cliffhanger – it doesn’t – but because it’s just so darn fun."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "Book rating: 3 - Meda rating: 5“Meet Meeda. She eats people.”Meet Meeda. She's hilarious and snarky as hell. Her conversations to herself are just insanely funny. She is a reluctant heroine who keeps trying to manipulate people but fails miserably most of the time. Still, she does eat people (well their souls anyway) and she’s quite the butt-kicking heroine, albeit a reluctant one. Meda is possibly one of my favourite MC so far year. The problem with Cracked is that Meda is such an overpowering character that there isn’t room for much else in the book. The other characters aren’t very well-developed. I guess Jo is alright (I don’t like her very much though, she can be quite annoying and her friendship with Meda feels a bit forced) but Chi has no personality whatsoever and adds little to the story. The interaction between Jo & Chi is simply boring. As far as the other characters go, they’re pretty much non-existent.The plot is alright but not fantastic. Although the premise of the book is excellent and it all starts off with a bang (the hospital!), it’s all pretty much downhill from there as far as plot construction is concerned. Cracked focuses on Meda’s character so much that the book lacks in terms of plot development and it falls flat. There is nothing I actually disliked about the plot but it just felt meh. Meda is both the strength and weakness of this book. Because of her character, Cracked is worth reading despite its many flaws. Were it not for Meda I wouldn’t even be considering reading Crushed, the second instalment in the series. I don’t think I will be able to resist her crazy inner dialogues and will probably give the book a try when it is released."}, {"userName": "Dilinna", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/57406193-dilinna", "userReview": "Hiba darling...wherever you are i am going to find you and give u a bone crushing hug!!!! That was such an awesome book....like i am still reeling...At the beginning i felt the humour was forced and over the top but as it continued i found myself getting sucked into the whole world that made up this book. It was soo good!!! I had some little things that upset me along the way but the way the story unfolded jst made up for it...i really cant explain it because my heart is so full and happy right now.My ship....oh my ship...got me giggling like a damn schl girl.....😍😍😍😍😍 i love hw it all played out...i really did. I didnt expect this book to be as emotional and touching as it turned out to be...it really surprised me.Pls go and read this book!! I really hope the next book blows me away like this book did. Pls for a more comprehensive, well taught out and awesome review....check my darling hibas review https://www.goodreads.com/review/show..."}, {"userName": "Kat Kennedy", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "Review to come."}, {"userName": "Brigid ", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/8169059-brigid", "userReview": "Cracked by Eliza Crewe Review\nPOP THE CHAMPAGNE! or in my case tequila. What can I say, champagne is way too light for my tastes. A heroine to root for. She'll suck your soul out. This book made my heart go \"thump thump\" after all the years of dead silence. I've been so tired lately of Young Adult heroines lately. So many TSTL (too stupid to live) heroines makes me want to have a bonfire. All the slut shaming and obsessions over boys and body image gets really sickening. It's so fucking refreshing to find a book that I'm proud to put on my shelf next to Richelle Mead and Rae Carson. This book may have even contaminated those books in comparison. The heroine's snark and humor is so much more relatable than all of that fake humor writers try to emulate to make the reader like the heroine. Crewe is one of those authors that actually understands realistic dialogue and humor. The snark, the humor, the twisted heroine! I love this book to pieces. \nSummary:\n The story starts with Meda describing the cracked walls on the ceiling of the asylum where she casually plans a dead little girl’s revenge. Meda our evil heroine eats people’s souls, but not ghosts. She kills for souls. Oh yes, the asylum nurse who murdered the little annoying dead girl gets what’s coming to him; thy name is Meda. Two men in business suits arrive at the asylum and start to question her with all sorts of confusing questions, thus we learn about Meda’s demon kin. A boy conveniently shows up and assumes our heroine actually needs his help; but she prefers this since she’s not a TSTL heroine. Meda, unlike most heroines, wants to live. His name is Malachi, but he prefers Chi. Almost sounds like Chai tea, doesn’t it?Anyways Chi and his good friend Jo (who’s a girl by the way), Jo smartly doesn’t believe that Meda is an innocent for one second, and takes Meda back to their school for Crusaders. Crusaders have always existed since the medieval Templars. They’ve just continued their belief to protect the innocent from demons in secret. Meda follows along with their idea that she’s a beacon because she wants to discover their base and secrets. But more conveniently, demons are after her:\nBut a strong dose of self-preservation holds me back. I’ve already learnt the hard way that the demons are stronger than me – or at least a lot more accustomed to fighting people who can fight back.\n But let’s think about it, either she could just resist and resist their silly ideas. Or she can have protection and learn knowledge about those who would normally kill her for what she is. Please, it’s a no brainer. Follow the idiot boy and the smart badass chick for your own self-preservation Luckily for us, Meda's a smart girl. She learns that her life isn’t what she thought. She gets fucking pissed off. I would too if I learned my family and heritage isn't what I thought. She wants revenge. What I loved is how close Chi, Jo, and Meda become. Meda eventually learns to trust and yes even understand what it means to have feelings. Let me be clear: emotions confuse the shit out of her. She’s evil, at least according to her. I don’t fucking blame her. Emotions confuse and scare the shit out of me too. Eliza Crewe created a heroine and a story that I don’t think I will ever get over. This will be a book I’ll re-read over and over and over and over and over. It’s that good. Oh and Crewe? If you’re reading this: I blame you for ruining all other YA heroines for me.\nPlot:\nThe plot actually makes sense in this novel. Crewe even puts little clues along the way that you don’t recognize until you’ve reached the end of the story. It’s like Blues Clues only a thousand times harder and not as fucking cutsie. The plot doesn’t slow down. There’s always something the reader’s discovering through character development, dialogue, or description. Crewe creates a secret society that didn’t become annoying or seem unrealistic. She has the good guys as motorcycle riding demon killers and the bad guys as business suit wearing demons. By the way, there's actually a motorcycle club called the Templar Knights:The plot might scare away some readers who are a little hesitant to read books with a slightly religious theme. I’ll reassure you that there isn’t a religious theme. There may be demons and Templars, but religion doesn’t become a big issue in this book. It’s all about the characters relationships mixed in with the plot. Crewe wrote a fast paced plot that had my eyes widening continuously as each page passed by.\nCharacters:\nMeda, actual name Andromeda, now defines the most kickass heroine I’ve ever read: R.I.P. Rose Hathaway. Open the scene for evil soul sucking Andromeda Melange. She’s snarky, witty, and a smart self-preserving girl. Screw courage if it’s going to kill you, defines the type of heroine Meda is. Who says smart isn’t kickass? Would you rather have the TSTL heroine who walks down a dark alley without any idea what she's getting herself into or would you prefer a smart heroine who actually thinks about her situation before she jumps into the blazing fire? Meda’s also pro-girl power and she doesn’t obsess about her looks. She doesn’t go on describing one girl’s outfit and then describes herself. No, Crewe doesn’t do that shit. She gives us a smart and realistic heroine who plans out her decisions and thinks about her situation. Meda doesn’t look at every girl and think “slut”. But there’s one incident that I feel I should address. Theres one girl who Meda does slut shame:\n...the girl asks, leaning in and flashing some cleavage. I didn’t even know they made low-cut sports bras.\nThen she goes on calling her a “tramp” which really disappointed me. It’s one time, which is considerably better than most Young Adult novels. This girl is hilarious. She makes fun of Chi and his willingness to just except and trust everyone around him:\nThis boy might have answers; I just have to take them from him. I consider the many tools at my disposal…and settle on my weapon of choice – one so infrequently used I need to dust it off first. My eyes fill with tears. “Wha-“ I swallow hard “- what were those things?”\nShe acts like a complete damsel in distress to trick him. She’s hilarious in the way she snarkily remarks about Chi’s big ego. She’s no damsel:\n“It’s OK. You don’t have to be scared, I’ll protect you.”Big brawny man, protect his damsel! I try to look angelic and helpless – Beacon-ish. The haircut and the blood can’t be helping. Fortunately he seems particularly thick.\nShe’s the one who will betray and kill her savior.Jo hates that she can never truly be a crusader. She’s wants to fight the demons. She’s angry, frustrated, and also a little depressed. She wishes people would treat her with respect, without thinking the word “cripple”. People don't like Jo. They think she's a freak because she can no longer be a crusader. More than anything she wishes her best friend Chi wouldn’t see her as an inept. Jo isn’t innocent or weak; she even kicks some demon ass. She see’s through Meda’s fake story of the innocent girl who needs Chi to protect her. She’s a leather wearing, motorcycle riding, girl with the mouth of a sailor (you don't actually get to read her swearing damn it) who fights for her right to fight beside her best friend Chi. \nRelationships:\nOne of the best parts of Eliza Crewe’s novel is the relationship between Meda and Jo. They don’t start out as friends. Jo hates Meda’s guts at the beginning, but Meda always sort of reluctantly like Jo. Meda refers to Jo as \"gimp\" at the beginning of the novel. Meda doesn’t see Jo as inferior to any other crusader. There's a great scene where they really start to become friends. Most people would dislike what Media says to Jo. But I feel that it shows that Meda doesn't care that Jo has a leg that doesn't work correctly. She doesn't treat Jo as fragile and she doesn't feel sad for her either. This makes it a wonderful friendship because they see each other as equals: \nI don’t care that your life is ruined. You’d be an idiot if you weren’t. Hell, I don’t even like you and I’m angry a bout it. I’m just saying you’re stupid for being angry for being angry-that’s ridiculous.\nThey aren’t forced to get along, but they slowly start to like each other when each starts to reveal more about who they are. Jo and Meda’s friendship grows realistically and develops without any fake circumstances. Chi, Jo, and Meda become the best of friends by the end of the novel. Their close friendship develops into something where even when they discover each other’s secrets, they still overcome the drama without making it seem unrealistic. This book becomes about trust, friendship, and betrayal. My meaning: romance is not the focus of this novel. Eliza Crewe is just that fucking awesome. I can’t imagine a more fucking entertaining, hilarious, snarky, and wonderful book. August is too long to wait for the next book.*nudge nudge* ;p"}, {"userName": "Annika", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/39023148-annika", "userReview": "[no romance for the heroine, though setup for possible future romance - no indication for love triangle (hide spoiler)]"}, {"userName": "Brandi", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/4765786-brandi", "userReview": "[image error]"}, {"userName": "Kainat 《HUFFLEPUFF & PROUD》", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/14717996-kainat-hufflepuff-proud", "userReview": "We all have encountered Vampires, Werewolves, Demons, Fairies, Valkyries, ghosts, now let's find out what is this soul eating business all about.Seriously, what is this book? MC sounds like Dani from Fever series."}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "May 30, 2014", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "Sometimes bad things need to be reminded they're not the only ones who can bite.\nFun, witty, and surprisingly deep and heartfelt, this story was a page-turner from beginning to end. Meda was a character that will be impossible to forget-if not because of her devious habits, then because of her snarky and hilarious humor. A fun cast of characters makes this book easy to devour and there's no character you don't have strong feelings for. Like any fatherless child, I've wondered about the man responsible for the glory that is me. Needless to say, it's disappointing to learn he's the kind who'd probably eat his young.More than once I found myself tearing up and fighting back tears-this story wasn't without it's tragedies, despite the hilarious undertones. I was, admittedly, a little shocked that my heart strings were starting to fray by the end of this story....from the beginning I knew that this was going to be deeper than I thought, but not once did I believe it would bring tears to my eyes. The mocking narrative took away from the harshness of what Meda really does, but it's not so easily forgotten when surrounded with her brethren.They claim revenge is a dish best served cold, but I've found it to be equally delicious hot-not unlike fried chicken. Dark, gritty, and fast-paced, I found this one hard to put down. Not often does a romance not including the main character (yet) pull me in, but I was addicted to Jo and Chi's story. So cute and a little desperate, we get all the action and a slab of romance on the side. I can't wait to see where Meda and Armand's story goes (what? I'm ALL about the romance, sorry lol) in the next story. He seems to be a dark little soul...Come to mama. \nOh, and did I mention the peril was through the roof near the end?? Points to Crewe! I LOVED that. *Sorry-my review reflects my mood-dark and dry....I don't normally flub or write such short/drab stuff, but I just can't write right now. I had lots of funny quotes and quite a bit to say but...Oh well.*For more of my reviews, please visit:"}, {"userName": "Jo ★The Book Sloth★", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/13870608-jo-the-book-sloth", "userReview": "Paused at 30%This book is great, it really is because Meda is one of the best heroines I've seen in a YA book. BUT I have serious problems getting into it because I have to pause it every dozen pages. First it was an ARC that I needed to review, then it was a BR, then it was another BR and then one more ARC, etc...I'll definitely be picking it up again in the future but if I try to force it now I'll not give it the rating it deserves."}, {"userName": "Eliza Crewe", "userReviewDate": "Aug 15, 2014", "userURL": "http://www.goodreads.com/user/show/12975225-eliza-crewe", "userReview": "Hey all,Cracked ebook is now available on Kindle (http://amzn.to/1wxNOWc), Kobo (http://bit.ly/1xwIPIx), Barnes & Noble (http://bit.ly/YM3dGr), ibooks (http://bit.ly/1opTQ6i), and Smashwords (https://www.smashwords.com/books/view...)UPDATE 4/28/2015:The print book is back up for sale: https://www.createspace.com/5385965. It will be on Amazon, too, within a few days."}, {"userName": "Kathe L", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/25921490-kathe-l", "userReview": "Actual rating: 4,5 starsYou know, you read reviews, you see people talking about a book and still, you don't know how right people are and how good a book is until you picked it up. I've always liked the bad guys. Let's watch a movie and who do I like? The villain. Show me this adorable, cute main girl and do I like her? No, I like the friend of the main girl who uses his weirdly way to hide his feelings. Or is just the villain. And then, I started this book and I met Meda. Starting by her amazing name, she was... she was special. She was incredible, bitchy, funny and yeah, cruel and smart. She eats souls because she's half demon, but she doesn't know a thing about her nature until he meets her true enemies, the Templars, and pretends to be one of the good guys to seek information. Clever, huh?\"I'm soul-drunk. The world's too bright; I feel too strong. A soul doesn't sit heavy in the gut, but bubbles through the veins like champagne, tingling the nerve endings. For at least an hour it cocoons my brain in cotton, protecting it from the talons of shame and worry. Later they'll dive back down and dig in their beaks, but for now they can only circle uselessly above. I laugh and sneer, able to forget for now that they'll have their revenge.\"Meda infiltrates herself in 'enemy' territory and we see her journey, the things she finds out, the way she interacts with Chi, Jo and Uri. She says something to them, and thinks another. While Uri is the sweetest thing, and Chi also buys her 'good' and 'naive' attitude, Jo doesn't. Jo is another character I simply loved, because she was tough, calculating, and still, had the softest of hearts. Meda is this dangerous person with secrets behind her and Jo seems to see that, too. Meda is sarcastic, funny in the way she thinks, selfish in most of the book: she's the 'villain.' And still, you can't not like her. She's real, and trying to figure things out. You know things are going to end badly, you know people will get hurt, but you want Meda to succeed. You want her to be open with her soon-to-be-friends because you know Meda is bad, but you like her so much already that you know she is bad but you also know she isn't. You know? \"Hypocrite,\" I murmur for her earls only. Jo looks at me blankly. \"You hate pets.\" She quirks a brow. \"Well, I didn't comfort the fish, now, did I?\"Touché. Sometimes she makes it hard to hate her.\"This book is filled with action, too. There are people fighting here, there, then running away, then finding secrets, fighting again. I was surprised at how things turned out at the end and also by the things Meda finds out along the way. We root for her, but also for Chi, hopeful Chi. Jo, with her ass-kick behavior and Uri, I'm not even going there. Uri is the youngest and such a sweet, cute guy. \"No regrets\". We don't quite have romance. Like, it is there, but not how you expected it. I think Armand is going to be on the second book though, isn't he? I liked him, with all his bad-guy vibe. Made me definitely curious. Or he was just a character that will never show up again, who knows? LOLSo, for those of you that want to read a paranormal, demon book, but is quite disappointed and tired of the 'famous' books out there, you have to give this a try! It's way better than you expect it to be, and you will read it so fast you won't even realize you're already at the end of it. At least it was that way with me haha  I can't wait to read the next ones!"}], "description": "Meet Meda. She eats people. Well, technically, she eats their soul. But she totally promises to only go for people who deserve it. She’s special. It’s not her fault she enjoys it. She can’t help being a bad guy. Besides, what else can she do? Her mother was killed and it’s not like there are any other “soul-eaters” around to show her how to be different. That is, until the three men in suits show up. They can do what she can do. They’re like her. Meda might finally have a chance to figure out what she is. The problem? They kind of want to kill her. Before they get the chance Meda is rescued by crusaders, members of an elite group dedicated to wiping out Meda’s kind. This is her chance! Play along with the “good guys” and she’ll finally figure out what, exactly, her ‘kind’ is. Be careful what you wish for. Playing capture the flag with her mortal enemies, babysitting a teenage boy with a hero complex, and trying to keep one step ahead of a too-clever girl are bad enough. But the Hunger is gaining on her. The more she learns, the worse it gets. And when Meda uncovers a shocking secret about her mother, her past, and her destiny… she may finally give into it.", "title": "Cracked\n      \n          (Soul Eaters #1)", "url": "http://www.goodreads.com/book/show/23365221-cracked", "average": 3.94, "cover": "https://images.gr-assets.com/books/1425478496l/23365221.jpg", "reviews": 853, "authors": [{"url": "https://www.goodreads.com/author/show/6559113.Eliza_Crewe", "name": "Eliza Crewe"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/23365221-cracked", "http://www.goodreads.com/book/show/17345314-cracked", "http://www.goodreads.com/book/show/16093908-cracked", "http://www.goodreads.com/book/show/20221092-cracked", "http://www.goodreads.com/book/show/18484905-cracked", "http://www.goodreads.com/book/show/17910836-cracked", "http://www.goodreads.com/book/show/20256261-crushed", "http://www.goodreads.com/book/show/23164707-crossed"]}