{"ratings": 610, "userreviews": [{"userName": "Ted Gault", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/4306495-ted-gault", "userReview": "Full disclosure, I only read the first 16 chapters provided free on Amazon. But I feel like I was given a fairly good sample of Bradberry's writing style and plot direction. Especially since that is the whole point of the sample - it's supposed to make you want to buy the book. If you have a kindle, save yourself some risk and check out the sample first. :)In short, this book is terrible if A) you like original, interesting characters B) you like plot plausibility. The protagonist is a stereotypical good looking guy with a perfect life until things go terribly wrong. The characterization of him doesn't develop much past that, and therefore it is really hard to care for him as a real person because really, he's just a cardboard cutout. As are most of the other characters. Also, as an international relations grad student, I find the whole concept, especially Bradberry's concept, of a Chinese invasion and occupation completely implausible, ridiculous and distracting. The way Bradberry explains the occupation made me laugh in a sad sort of way. There is just little grasp of military strategy, and a whole slew of base Chinese stereotypes that have been propagated by the worst Sino-alarmists. It's offensive to the sensibilities of anyone who knows anything about China. In short, people don't live or act the way Bradberry writes them.Of course, this is a zombie novel, and the handling of zombies should be able to save the day. Too bad there is nothing new here either. I'm being unduly harsh I'm sure, but I could barely get through the first 16 chapters and there is no way I would pay for this book. World War Z all the way."}, {"userName": "Alice", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/22595720-alice", "userReview": "[his other cryogenic buddies get some brain degenerative virus, and become mindless zombies. Royce and Alex (who is he again?) escape the facility, and go back to Alex's apartment. Where it stars to go downhill for me,“She wore a long silk nightgown that hugged her frame at her chest and hips. I tried not to look. Her figure made it hard to concentrate.” (hide spoiler)]"}, {"userName": "Brian", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/2284563-brian", "userReview": "Well, I wanted to like this novel, I read the Amazon reviews, the Goodreads reviews, and I wanted to like it.I didn't like it.I thought the characters were impossible to care about, there was absolutely no sympathetic persons in this book. None. The main character killed zombie children and used their dead bodies to provide traction for his car to get out of mud. And showed no remorse, no emotion, just did it because I'm sure the author thought it would shock his readers. Well, it did shock me, and make me wish the main dude would get his brains eaten by the zombies.Perhaps it was just me, but the writing seemed forced and trite, the plot a bit to easy to guess, the zombies to easy to kill, the list goes on and on.I really wanted to like this book, I did not."}, {"userName": "Jenell Diegor", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/21215193-jenell-diegor", "userReview": "Who doesn't love a good zombie novel? Travis Bradberry's Cryonic brings out the best elements on a story about the undead. In this particular tale, he explores the scientifically possible \"re-animation\" of people - when they are frozen when they die, and brought back to life after a period of time. Unfortunately for our protagonist, Royce Bruyere, the world he woke up to was not the same as the one he left. A different governing power is now in control, and regards him as a possession rather than a person. It was well-written, full of action and adventure, and not a dull moment whatsoever. I am seriously looking forward to the end of the novel, but those first 16 chapters were a genuine treat to read!"}, {"userName": "Dee", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/23699961-dee", "userReview": "So..... I wanted to like this book. I really did. The first few chapters were great and had me hooked. Too bad that didn't last long!If I can make an honest assessment of this book, it would be this: It read like a comic book, I'm sure my little brother would have loved it. Stereotypical, strong, suave, arrogant protagonist. Inferior secondary characters who only served to highlight the superiority of the main \"he-man\". Gory zombie violence. I think the author dreamed up a story for himself where he could live out his masculine fantasies. The prose was lacking, vocabulary was simple, and the conversations were repetitive. Disappointing! Thanks to Goodreads First Reads for the free copy."}, {"userName": "Steven James", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/19368122-steven-james", "userReview": "I thought the book was a fantastic read. I'm not sure why there is so much hate for the characters. I found them all pretty interesting. This book was a real page turner for me especially with the short chapters. I couldn't stop reading it. The scenes in the book described the zombies and action perfectly. I feel like this would make a good movie. Everything I read played out in my head like I was seeing it in person. Easy to follow and understand the situation that the protagonist was put in."}, {"userName": "Anari", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/22592980-anari", "userReview": "This novel had me gripped from the word go. Cryonic is a brilliantly spun, futuristic tale which begins with the death and subsequent re-animation of Royce Bruyere by the means of cryogenics. When he is brought to life, several decades later, he arises to find that the world is not a friendly place. China is the ruling super power and half of the U.S. has been enslaved. The Chinese are experimenting with dead bodies, in the hopes to revive their dead soldiers and continue with their plan for world domination - but there is a flaw in their design. Those that are being brought back to life are contracting a virus with sinister implications. Travis Bradberry will appeal to lovers of the genres Sci-Fi and Horror, and he writes with a superbly realistic style. The characters are well defined and the plot writhes like a snake - plenty of twists and turns to get excited about. Loved it. 5 Stars all the way."}, {"userName": "Sammy Smith", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/5903290-sammy-smith", "userReview": "Wit, sidekicks, adventure and a real hero feel that immerses the reader in the zombie world. Yup, this book has it all!There was a fantastic mix of fiction, science and politics that made this book not only appealing, but strangely plausible. There is a small cliché of the main character waking up to the zombie filled world, but hey – that’s my only gripe from an otherwise fantastic tale AND there’s something special to Royce (MCs) and his ‘waking up’ (I won’t post spoilers).I thought this ended too soon, and I wanted more. I had questions, dammit!! But I whizzed through this in no time and I’m happy to read whatever Bradberry writes in the future."}, {"userName": "Mairi Cameron", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/7587880-mairi-cameron", "userReview": "What an utter pile of pants. Please, don't read this book.To qualify, I love zombie books, and sci fi. World War Z is one of my all time favourite books. But not all zombie books are good, and this one really isn't. Having read some other reviews I felt I should edit my own, I'm not sure who's reading this and seeing a good writing style - it reads like a children's book, very basic easy reading, little characterisation, no in depth descriptions. The main character starts out likeable and becomes a complete cliche. Move along, pick another book, don't waste your time on this one."}, {"userName": "Lisa", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/4038169-lisa", "userReview": "This was actually one of the worst books I have ever read. Horrible HORRIBLE dialog, flat characters, a plot that could have been intriguing if the author had actually spent any time with it, and the most ridiculous ending ever. Also, the author totally used the \"future\" setting to explain away pesky problems he didn't want to deal with. I'm sorry, but this book sucked. No redeeming qualities whatsoever."}, {"userName": "Tracie Setliff", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/21213055-tracie-setliff", "userReview": "If you want an excellent Zombie book I recommend Day by Day Armageddon Origin to Exile ISBN 978-1-4516-3303-0As for this book, I barely made it through the free chapters I typically get to see if a book is interesting. this was a great disappointment from go.I felt the writing very elementary and, as another person posted, the characters were extremely difficult to root for. Carson was the only one I (barely) cared about and he became lunch fairly quickly. I took the advice that this was THE only Zombie book in a post on World War Z but quickly decided the latter is a better book even though it was difficult for me to finish."}, {"userName": "J Freese", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/22786524-j-freese", "userReview": "Definitely a fast-paced read. I couldn’t put it down for my curiosity was constantly peaked and I wanted to know what would happen next. I’m not typically a fan Zombie books or movies, but when I do partake, I am always interested in how the storyteller creates the Zombie epidemic. In other words, Zombies don’t just appear out of nowhere, what event caused human beings to turn into Zombies in the first place? This book offers a brilliant explanation and I thoroughly enjoyed it. It’s not just another Zombie book, it’s a futuristic adventure. Well done."}, {"userName": "Kris Richards", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/20031678-kris-richards", "userReview": "First off, the quality of writing is excellent. Technical grammar is nigh on perfect and the dialogue believable and fresh. I loved the character voices. Recently, there’s been a glut of zombie based stories, movies etc – they’re almost the new vampires! But I think Bradberry does a good job of making the genre his own. There’s darkness, tension, excitement and, at times, a real visceral horror as the craziness explodes around the main character, Royce.If you enjoy fast paced story-telling, with style and class – go for it. You won’t regret it!"}, {"userName": "George", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/14002282-george", "userReview": "Pretty interesting read. Never thought that if you signed up for being re animated in the future you would become a zombie. The novel is placed in 2047 where the Chinese have taken over the US and need soldiers. The plan of action is to bring back the dead alive and for some strange reason all except Royce are turning up as flesh devouring zombies. Wow, very interested to know what the future of either Royce or the nation would be"}, {"userName": "Vojtech", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/5051728-vojtech", "userReview": "There are some cool ideas in here (I don't wanna spoil), but it's a pretty short read (also considering the price) and I think it's way overrated on GoodReads. Would you really be looking for a car with ignition keys (!) in 40 years? I think not. I wish the story didn't come to such an abrupt happy ending. The book lacks balance."}, {"userName": "Ronald Greek", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/22732285-ronald-greek", "userReview": "I'm a zombie story fan, & although I already had a hard copy of this book \"in the mail\", I thought what the heck, read the preview… BIG mistake… Now, I'm chomping at the bit for my book to get here!"}, {"userName": "Heidi", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/1634894-heidi", "userReview": "Imagine waking up in after an accident. You ask to see the people you love, but you find out it’s 35 years later. You also find out that the Chinese now run the country. There has been a horrible environmental event that has changed the world. And the Chinese now run the country. That’s exactly what happens to Royce. Royce is the first person that is brought back from a cryogenic state. And since his reawakening was successful the doctors decide to bring back other individuals who are in a cryogenic state. But something goes wrong when the other individuals awaken. And the result is zombies!If you’re a fan of sci-fi and zombies, then you’ll like this book. This book is what science fiction is all about. It combines real life science with something kind of far-fetched. The science includes a world- wide catastrophe that has geo-political ramifications. The far-fetched is the zombies. But hey who doesn’t love zombies? Sci-fi fans should read these books."}, {"userName": "Ruth", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/4634821-ruth", "userReview": "Cryonic is The Walking Dead with a Chinese twist. When Royce Bruyere dies, he is cryogenically preserved per his last wishes. When he is revived, he finds the Chinese have invaded and brought their miracle medicines with them. Unfortunately, not everyone they bring out of cryonics fares as well as Royce. With bloodthirsty victims literally nipping at his feet, Royce races across America to save his country and his family. This is a fun zombie novel if you can get past the science and geology that is ignored by the author. People are running for their lives; zombies are on constant attack; the question, will the world succumb or will it prevail is always at the fore front of the reader’s mind. Cryonic is written with a fast pace that allows a reader to finish in a day. A great Halloween read."}, {"userName": "Maggie Soroka", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/17018218-maggie-soroka", "userReview": "That was BAD. This \"author\" needs a lesson in grammar. If you're going to write a novel, please learn the difference between lay and lie or further and farther... I have no tolerance for poor grammar when reading a published author. Further, if it wasn't for the swear words, I would have guessed this book was written for children. My 11 year old likely would have enjoyed the simplicity of the writing, me...not so much.With that being said, I really don't expect a lot from zombie novels, I read them (or similar books) when I want something light and fast to read. However, with the poor writing, lack of character development and the overall juvenile feel of this book, I am left feeling like I went with my first instinct and didn't read this."}, {"userName": "Peyton Stewart", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/13821068-peyton-stewart", "userReview": "Cryonic: A Zombie Novel is a high-concept blend of the tried and tested zombie genre – think the Walking Dead – with a splash of Buck Rogers about it, as the hero is a cryogenically frozen survivor woken up in a dark future where a natural disaster-devastated USA has been over-run by the Chinese. It’s a fascinating fusion of the two forms, with the wholly believable Chinese takeover of America being blended with the zombie idea… interestingly, the outbreak is caused by cryogenic sleepers going bad. It’s very fast paced, carried off with a dry and irreverent wit, and will keep you turning those pages as you rush to find out what happens to Royce Bruyere. The best literary fun I’ve had for a long time."}, {"userName": "Jaime", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/7139501-jaime", "userReview": "Bradberry has a twisted mind, in a good way of course. As fans of horror, sci-fi and zombies move through this book at a fast pace, they will imagine it's almost like watching a movie, instead of reading a book. His descriptions are so exact and precise, and everyone will find Royce, our hero in this novel, to be a fantastic character. The author has clearly done extensive research on the Chinese culture as well, which is an added bonus because it makes Cryonic all the more relevant, and believable. The one-of-a-kind storyline will keep book lovers glued to their seats, and will anticipate what could possibly happen next with each flip of the page. It's terrifying, contemporary, and could really happen! How does will it end???"}, {"userName": "Gladys", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/22012865-gladys", "userReview": "I was actually hesitant to read zombie-genre books since most of the books I've read so far couldn’t enable me to envision the terror like on screen. But Cryonic really changed that for me. Aside from the fast-paced and action packed sequences in almost every page, the author's superb writing makes you feel like you are actually right in the middle of it all.The way it was presented was highly researched, especially on the subject of cryogenics and the aftermath of a possible natural disaster. It also diverges from the common setup on almost all zombie related books and films by using cryogenics as the basis of the zombie apocalypse. I would highly recommend this book to anyone who wanted a new taste of the undead.This will keep you awake for hours."}, {"userName": "Margaret", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/27130525-margaret", "userReview": "I forced myself to finish this book since I paid for it. In just about every chapter, I found myself rolling my eyes. The writing is choppy and the dialogue is silly. When a character has to tell the reader that his wife says he's handsome? Eye roll. When Royce switches back and forth with \"Alex\" and \"Al\" and \"Jason\" and \"Jace\"? Eye roll. Saying \"um\" all time? Eye Roll. And of course Celeste is beautiful and Royce has the hots for her. This book is one cliche after another.World War Z is a far superior Zombie novel and the writers of \"Walking Dead\" run circles around the writing in this book."}, {"userName": "Justin Barry-walsh", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/18906505-justin-barry-walsh", "userReview": "I only continued to read this book past the first chapter to justify writing a review to counterpoint the hopelessly positive reviews of so many. Aside from the apalling ethnocentric american nationalism running through the book, I found the basic premise was unoriginal, the novel badly written, the charcters clumsy stereotypes and the end predictable. If you want to read a book written at a reader age of 8 go for it - otherwise don't touch this book."}, {"userName": "Tish", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/6791145-tish", "userReview": "2.5 This book was okay. The writing was easy to follow, but I think the length did not allow enough time for character development. The reason for the story was interesting, but the main theme - zombies - has been done so much and there wasn't anything new to make it interesting. I didn't care for the coddling of one of the main characters, it seemed out of place. I didn't think this book was awful, but I honestly do not understand the 5 star rating that is was given by most people."}, {"userName": "Eric Lander", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/2884431-eric-lander", "userReview": "Very creative story that happens to have some really freaky zombies in it. I would guess this book will appeal to people who are zombophiles as well as those that don't tend to devour every zombie book around."}, {"userName": "Heather", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/7206503-heather", "userReview": "I was excite to get Travis Bradberry's new novel \"Cryonic: A Zombie Novel.\" I'm not one who normally reads zombie novels, but his take on it that a man named Royce Bruyere was cryogenically frozen and is reanimated into a different United States then he remembers. He wakes up to be surrounded by Chinese people and finds out that the United States was invaded by China. He is the first person to be successfully reanimated, but through Chinese greediness, the others that are reanimated after he was turn out to become zombies. Interesting, huh? Definitely. Unfortunately, I was disappointed in the book. I felt that the main character was a little unbelievable and completely unlikable. The dialogue seems forced. Perhaps I had higher expectations since it was written by an award-winning author who has sold more than a million copies of his books. I really like the premise and there is a good story there, but not in this version of the book.Although I was disappointed in this book, it would not stop me from reading other books by this author. Clearly he has a vivid imagination and perhaps it comes through clearer in other works.**I received this book from the Goodreads Members Giveaways. It did not influence my review.**"}, {"userName": "Badseedgirl", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "I think this novel got a bum wrap from previous reviewers this novel was full of hilarity. Who doesn't like a novel where the hero uses zombie corpse of a little person and a boy scout as a wedge to get their escape vehicle unstuck from the mud!!My only criticism is that from the moment Royce started talking after being unthawed, I heard myself singing Hulk Hogan's theme song under my breath:I am a REAL AMERICANBut I still enjoyed it, although I found the ending a forced and a bit of a let down but overall a good read"}, {"userName": "Misha Husnain Ali", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/5627027-misha-husnain-ali", "userReview": "A pretty short read. The premise was interesting but I can't say I liked any of the characters, particularly the protagonist. As a result, I didn't feel particularly interested in him escaping the zombie invasion."}, {"userName": "Franky Onley", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/21251003-franky-onley", "userReview": "One of the best zombie novels I've read in a while. Would recommend to anyone and everyone!"}], "description": "\"Sometimes you're better off dead. . . .\"When Royce Bruyere chose to be cryogenically frozen upon death, he figured coming back to life would be exciting. Neat. Bonus time. The world he awakes to is nothing of the sort.A Chinese invasion has crippled the United States, dividing the country in a decade-long stalemate along the Mississippi. Royce's successful reanimation is unprecedented, making him the Chinese regime's most prized possession--but not for long. Eager to control life and death, the Chinese reanimate other \"cryonics,\" until something goes horribly wrong.Royce travels through a future wrought with violence and despair, only to discover the cure for the disease lies within him. It's a race against time as he flees the Chinese and the bloodthirsty victims of a terrifying epidemic in the hope of saving the country from apocalypse and creating a life worth living.", "title": "Cryonic", "url": "http://www.goodreads.com/book/show/15811102-cryonic", "average": 3.17, "cover": "https://images.gr-assets.com/books/1368812630l/15811102.jpg", "reviews": 124, "authors": [{"url": "https://www.goodreads.com/author/show/15463.Travis_Bradberry", "name": "Travis Bradberry"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/15811102-cryonic", "http://www.goodreads.com/book/show/18193334-cryonic", "http://www.goodreads.com/book/show/6486483-emotional-intelligence-2-0", "http://www.goodreads.com/book/show/230789.The_Personality_Code", "http://www.goodreads.com/book/show/27540.The_Emotional_Intelligence_Quick_Book", "http://www.goodreads.com/book/show/15811701-leadership-2-0", "http://www.goodreads.com/book/show/7592327-self-awareness"]}