{"ratings": 85, "userreviews": [{"userName": "Kate Olson", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Thanks to Algonquin Books for this free review copy!OH MY GOODNESS. This book was a total binge read for me - I received it in the mail on Saturday, picked it up to read Sunday night at 7:30 and finished it by 1:30 on Monday afternoon. And then I proceeded to spend WAY too long online looking at any pictures I could find of Blackwell's Island (today Roosevelt Island) and the structures/people/interiors/EVERYTHING. I'm absolutely fascinated with medical history and NYC history, and this book is a great addition to the other titles I have read on these topics. It is very accessible and very character-driven, and gives equal page-time to the main structures on Blackwell's in the 1800s ~ the Lunatic Asylum, the Workhouse, the Almshouse, the Hospitals for the Poor, and the Penitentiary. While all of the history of this time period absolutely blows my mind (how DID anyone actually come of out it alive???), what hit me the hardest is how little some things have changed over the years. The book ends with a striking discussion involving Rikers Island, and instantly the reader is pulled out of history and into present day, asking, \"Why can't we do better?\". A must-read for fans of history and social policy nonfiction."}, {"userName": "Marilyn Katz", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/49808658-marilyn-katz", "userReview": "I was lucky enough to win a copy of this book from Goodreads. This is an important book for several reasons. It tells the sad and very political story of what became Roosevelt Island in New York City and it tells, through some grim historical accounts, the mistreatment of this city's poor and mentally ill in the 19th century. How many misconceptions and poor treatment practices are in place today? Although this is not an upbeat and pleasant topic, it is an important one and this book should be read by much of the public who think prisons are the place for our mentally ill citizens."}, {"userName": "Sarah Furger", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/3912384-sarah-furger", "userReview": "Solidly researched and well constructed history of Blackwell’s Island. Horn pulls no punches - this is a nasty slice of American history. While it is extremely dark and unpleasant, it is certainly something 21st century Americans should consider when looking at our current correctional and mental health care systems..."}, {"userName": "David Beatty", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/81296061-david-beatty", "userReview": "This book is a well written and well researched on the horrors of the past. It is not light bedside reading, it is a great read for anybody interested in learning about the history of Roosevelt Island at this time."}, {"userName": "Terry Pearson", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/44262130-terry-pearson", "userReview": "I won a free copy of this book in a on Goodreads.Nonfiction:Roosevelt Island ( NEE Blackwell Island ) was originally purchased in the 19th century to house facilities created to tuck away the insane, the ill, the indigent, and the criminals from the general public. The injustice bestowed on the island's inhabitants is nothing short of cringe-worthy .Descriptive, horrific yet oddly fascinating. A damn good piece of history."}, {"userName": "Michele", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/1819398-michele", "userReview": "Interesting, sad look into the sad residents of early NY incarceration (criminal and \"insane\") facilities."}, {"userName": "Rhonda Lomazow", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/3901245-rhonda-lomazow", "userReview": "A sad at times heartbreaking revealing look at how we treated the mentally ill first locking them up in horrible conditions then throwing them out on to the streets.A harrowing look at a horrible time in our history.All students of history should read this,"}, {"userName": "Linda", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/3516814-linda", "userReview": "This book discusses the history of the many facilities on New York’s notorious Blackwell’s Island: lunatic asylum, almshouse, workhouse, penitentiary, and charity hospital primarily for treating venereal disease. The treatment was abysmally cruel, and there was an odd echo of some current philosophies rejecting help for those deemed lazy and parasitic rather than those considered the “deserving poor.”"}, {"userName": "Sue", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/1353029-sue", "userReview": "Though we all know how awful many if not most mental health facilities were, even into the 20th century, this book was a revelation.  In the 1800’s, Blackwell’s Island, now Roosevelt Island in New York’s East River, was home to a lunatic asylum, prisons, hospitals, poor houses and work houses. All built with the greatest of intentions, but all ending as abominations. From over-crowding, physical abuses, and utter disregard for sanitary practices, these buildings meant to protect, rehabilitate, and heal were actually death traps and torture chambers.  Horn focuses on a few major and minor players for a well-rounded look into lives that were so tragically affected, and a few who tried in vain to change the system."}, {"userName": "Kim McGee", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/5057126-kim-mcgee", "userReview": "Blackwell Island within sight of Manhattan was the dumping ground for New York's poor, diseased, mentally ill and criminals. It was a place where many traveled to and few came back unscathed and housed men, women and children. Over the near century it existed it was a place of abuse, cruelty, torture and unbelievable neglect. Not all the people working there were bad but the majority of them did very little to really help anyone there. The one person who fought for the inhabitants of the island was one of Blackwell's directors, Reverend French but in the face of overwhelming corruption and an \"out of sight, out of mind\" attitude from politicians, even he was not able to solve all of the problems there. Horn gives us snapshots of some of the more famous trials and a glimpse into the horrors of life there as well as the sensational story of Nellie Bly, who had herself committed to the island to get the real story of what the conditions were like. Interesting read for anyone who enjoys social reform and history of New York in the 19th century. My thanks to the publisher for the advance copy."}, {"userName": "Annie", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/1616058-annie", "userReview": "It’s an old saw that the measure of a society is how they treat it’s poorest members. If this is true, then nineteenth century New York has a lot to answer for. As we learn in Stacy Horn’s Damnation Island: Poor, Sick, Mad, and Criminal in 19th-Century New York, being poor and/or suffering from a mental illness and/or being a criminal at this time and place meant a trip to Blackwell’s Island. The island was home to an insane asylum, a prison, and a work house from the second half of the nineteenth century into the early decades of the twentieth. Horn dug through archives and newspapers to tell the appalling stories of all of these institutions...Read the rest of my review at A Bookish Type. I received a free copy of this book from the the publisher via NetGalley, for review consideration."}, {"userName": "Tiki", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/1463668-tiki", "userReview": "My interest was piqued after listening to a podcast on NY's history and wanted to learn more. A lot I had to skim through but I was most taken by the story published by Nellie Bly having faked her madness to stay in the lunatic asylum where half the inhabitants were only in there by virtue of their not speaking English or having someone put them there. Husbands could commit their wives with impunity until not too long ago. The saddest part is the island's potters field where hundreds of unnamed individuals lie buried."}, {"userName": "Kalendra Dee", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/6929957-kalendra-dee", "userReview": "A chilling account of the infamous Blackwell’s Island. Set within viewing distance of glittering Manhattan, Blackwell Island was home to a lunatic asylum, two prisons, an almshouse, and a number of hospitals. Built in the 19th century and touted as the most humane and modern facilities, it quickly became a house of horrors for the unfortunates incarcerated there. Stacy Horn brings the long-dead voices of its inhabitants to life in tis investigative report."}, {"userName": "Rosemary", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/29084832-rosemary", "userReview": "This book gives a look at what life was like for the poor, insane and criminals sent to Blackwell's Island in New York City during the 1800's. The best parts were the stories of actual people like Sister Mary Stanislaus and Adelaide irving. The hero of the book was the Rev. William French who spent his life ministering to the poor souls on the island."}, {"userName": "Jennifer", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/4692494-jennifer", "userReview": "Received through FirstReads...The great photo on the cover, along with all the great excerpts from reviews gave me the idea that this was going to draw me in like \"Devil in the White City\" or something along those lines. It wasn't a bad book, but the people profiled failed to come alive. I found myself wanting to skim the pages when I came across more statistics. My favorite part was a excerpt from another book, which can't be a good thing. A good source of information, but not too entertaining."}, {"userName": "Briony", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/2536381-briony", "userReview": "While the subject of this book is fascinating, I had a hard time paying attention to the audio. I officially gave up on listening to it when I realized I could not recount any of the storyline. I might try and revisit it at another date."}, {"userName": "Lectus", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/10746337-lectus", "userReview": "A good source of information if you are doing research about this place. Engaging? No, but I don't think it is supposed to be; it is just a recount of history. I personally didn't enjoy it because I am not interested in the subject, but I do recognize its information and historical value."}, {"userName": "Quinn", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/7835668-quinn", "userReview": "This is probably a very good documentary of the Asylum off Manhattan in the 1800s. However I thought it was going to be stories from the patient perspective - how they got committed, what conditions were like, how they were treated, etc. Therefore I DNF."}, {"userName": "Kristin", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/5291082-kristin", "userReview": "An interesting but somewhat toothless look at the way petty criminals, the impoverished, and the insane, were treated at the turn of the century. Horn's book is more of an overview than a truly in-depth experience and fails to make history come alive."}, {"userName": "Karen", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/3916384-karen", "userReview": "Extremely interesting of NY and Blackwell Island and a reflection of what was happening all over the country at that time. The author has so much work in this book. Well done"}, {"userName": "Janet Aileen", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/3981773-janet-aileen", "userReview": "A sad, scandalous account of deplorable, disgusting institutional conditions in the 1800s."}, {"userName": "Wendy", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/4886171-wendy", "userReview": "Disappointing."}, {"userName": "J Wells", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/18522231-j-wells", "userReview": "Good, but it started to flag near the end and I skimmed to finish"}, {"userName": "Cavak", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/67047018-cavak", "userReview": "To my surprise, this is the second of Horn's books that I finished reading. Didn't realize until later that she also authored \nThe Restless Sleep: Inside New York City's Cold Case Squad\n, another history/true crime book that I previously read.Though the topics are different between the two books, I think The Restless Sleep is a more engaging read because Horn incorporates herself into the book by interviewing related parties, whereas Damnation Island edges towards a scholarly retelling told through various third-person and first-person written records. That's understandable since many of the related parties for Blackwell lived over two hundred years ago, but there weren't any descendants that she could interview? Maybe she thought that side of the research detracted too much from the main topic. Or maybe Horn came up with dead ends? Both books are wonderfully informative and detailed.As much as I want to believe that many of the book's inhumane practices towards women, children, the poor, mentally ill, or the physically disabled are dated means of confinement, well... they unfortunately aren't gone completely. And prison overcrowding and excessive fees to the poor remains an issue in the U.S. that many people are unwilling to address or even acknowledge. But getting a glimpse of the potential origins for the prison system and mental health foundations was a fascinating if sobering experience. Improvements have been introduced in some ways since then, some ways not. I thank Horn for shining a spotlight on this issue.Besides the stories of the horrible treatment, Horn goes into the blatant corruption that took place to keep people incarcerated for often trivial reasons. Especially for women and foreigners. It was too easy to get them committed to Blackwell for being \"insane\", it's scary. There are many names and dates to keep track of throughout the book, so it might be difficult to grasp the initial significance of certain events. Once I got past the fifty page mark, I didn't have too many problems keeping up with Horn's story.Don't expect a sunny read. But there are moments of gentleness and compassion that keep it from being a dire and gloomy one. Not everything at Blackwell was terrible, even if it initially comes across that way. They carried me over to the end.I enjoyed learning something new, and the events recorded within it will stay with me. Give Damnation Island a shot if you are curious about a darker side of reality that remains to this day. Maybe it might encourage you to become more compassionate.I received the book for free through Goodreads Giveaways."}], "description": "Today it is known as Roosevelt Island. In 1828, when New York City purchased this narrow, two-mile-long island in the East River, it was called Blackwell’s Island. There, over the next hundred years, the city would send its insane, indigent, sick, and criminal. Told through the gripping voices of Blackwell’s inhabitants, as well as the period’s city officials, reformers, and journalists (including the famous Nellie Bly), Stacy Horn has crafted a compelling and chilling narrative.  Damnation Island recreates what daily life was like on the island, what politics shaped it, and what constituted charity and therapy in the nineteenth century. Throughout the book, we return to the extraordinary Blackwell’s missionary Reverend French, champion of the forgotten, as he ministers to these inmates, battles the bureaucratic mazes of the Corrections Department and a corrupt City Hall, testifies at salacious trials, and in his diary wonders about man’s inhumanity to man.   For history fans, and for anyone interested in the ways we care for the least fortunate among us, Damnation Island is an eye-opening look at a closed and secretive world. With a tale that is exceedingly relevant today, Horn shows us how far we’ve come—and how much work still remains.", "title": "Damnation Island: Poor, Sick, Mad, & Criminal in 19th-Century New York", "url": "http://www.goodreads.com/book/show/35489149-damnation-island", "average": 3.67, "cover": "https://images.gr-assets.com/books/1505608318l/35489149.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/4035.Stacy_Horn", "name": "Stacy Horn"}], "type": ["Nonfiction", "History", "Historical", "New York", "Crime"], "outlinks": ["http://www.goodreads.com/book/show/35489149-damnation-island", "http://www.goodreads.com/book/show/4863441-unbelievable", "http://www.goodreads.com/book/show/27766.The_Restless_Sleep", "http://www.goodreads.com/book/show/17086094-imperfect-harmony", "http://www.goodreads.com/book/show/5952.Waiting_for_My_Cats_to_Die", "http://www.goodreads.com/book/show/38816.Cyberville", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}