{"ratings": 132889, "userreviews": [{"userName": "Emily May", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I finished this book with two clear ambitions in mind:1. I wanted to jump on the next flight to Dublin.2. I wanted to sandwich myself between Jericho Barrons & V'lane (preferably naked).Let's just say that this is one of the most addictive stories I've read in a long time; even as I write this review, the second in the series is on it's way to me courtesy of Amazon.It just has... everything. A crime mystery, a fantasy world steeped in history and folklore, and the kind of men that you would hate in real life but are the most erotic thing imaginable in literature. I can't believe I've waited so long before starting this series!"}, {"userName": "Shannon", "userReviewDate": "Feb 10, 2009", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "[Mac goes from a cut-off shorts, pink camisole, and strappy sandal wearing 22 year old tan blond bimbo to a fighting machine. With no training! Even Buffy had training. (hide spoiler)]"}, {"userName": "Navessa", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "*SPOILER FREE FOR ALL YOU FEVER NOOBS*…all two of you…It’s no secret that Fever is my favorite series of all time. This is my third re-read of it and the entire reason I first decided to give these books another go was to force myself to attempt to properly review them and not just drool over Jericho Barrons for five pages.Mmmmm, Jericho, om nom nom nom nom nom. Damn it, there I go again. Anywho, there are a lot of reasons that I love this series aside from the male lead. I’m going to go with a numbered list here as it seems to be the only way to make sense of all my feels.1. The way in which the story is toldOur narrator and MC, MacKayla Lane, has been through hell. You know this from page one, line one, where she says:“My philosophy is pretty simple – any day nobody’s trying to kill me is a good day in my book. I haven’t had many good days lately”This series is told in retrospect and because of this we, the readers, get all sorts of ominous warnings throughout it along the lines of “If I had only known”, “One day those words would come back to haunt me”, “He’d never let me forget that fact” and so on. While I loved this series the first time I read it, I didn’t appreciate it as much as I should have. Only upon my first re-read did I really grasp the genius of KMM. I noticed so many minute details that hinted at things to come and all those warnings made complete sense because I now knew what she was referencing. Ms. Moning must have had the entire thing planned out in advance, how else can you explain all the hidden gems I’ve stumbled across? Even now, on my FOURTH read of this series, I’m still noticing things I didn’t pick up on before. 2. MacKayla Lane. I love her. I was behind her from page one, line one. In fact, I’ve never not loved her. This is because, on a lot of levels, I get her. Because I used to be her. When I was Mac's age, I too was a sunshine girl, a rainbow girl. I used to wear beautiful dresses to work, spent hours on my outward appearance, accessorized to the nines and always tried to be nice to people. I even had a propensity for the words “sir” and “ma’am”. And I got all sorts of comments about that. My hair in that photo is actually a little darker than I normally kept it because after a while, you get sort of sick of hearing people compare you to Paris Hilton. Do I look anything like her? No. Did people still whisper that shit all the time? Yes. Why? Maybe because I was blonde and I liked colorful clothes. Maybe because they’re assholes. I couldn’t really tell you. What those people failed to realize was that I'd been taking martial arts since I was old enough to throw a punch, and that the pretty little matching purse I clutched in my perfectly manicured nails held a five inch blade that I could hit you in the chest with from twenty feet away. Even if you dodged and the blade somehow missed I could probably break five joints or bones in your body before you realized what had happened.*grins* I think what people fail to realize about Mac is that she’s exactly the same way. Oh sure, she might talk about how much she likes to accessorize and has a propensity for the color pink but you have to look deeper than that. What’s the first thing she thinks about after she emerges from the haze of grief caused by her sister’s murder? Vengeance. Mac’s makeup is her war-paint. Her clothes are her chainmail.“I might be bruised and bewildered, but by God I looked good. Like a smile I didn’t really feel, presenting a together appearance made me feel more together inside, and I badly needed bolstering today.”3. The world-buildingPerfection. On every level. There’s not one point in this book that I felt like KMM was info dumping. In part that’s because the reader is learning about the world as Mac is learning. Instead of filling page upon page of the potentially boring conversations between Mac and Barrons, KMM has Mac record the necessities in her journal. Brilliant! The fae lore, the sidhe-seers and even the OOPs are revealed piece by pertinent piece. You’re given just enough to fully understand what’s going on in each scene but are constantly waiting for more. 4. DublinI’ve never been. Before reading this series, I sort of wanted to go. There were definitely a lot of European cities higher up on my list of places I had to visit before I die. After reading Fever? MUST. GO. NOW. The city transcends a backdrop and becomes a character itself. The Temple Bar District, the fictional dead-zones, even the Garda station jumped off of the pages at me. I had a perfect image in my mind of each one and when I Googled most of them afterwards, I was shocked by just how similar the real images were to the ones I’d imagined. I want to spend a week there and explore it all. I want to get lost in the south side amongst the liberals and the elite and then cross the river Liffey and mingle with the blue collar Catholic Irish. I want to drink Guinness and try to figure out just what the hell people are saying. I want to eat stew and listen to faery tales. 5. Jericho Mothafuckin BarronsA lot of people picture David Gandy for JZB. Fuck that shit. Yes, I said it. His eyes are too light. He’s too frigging pretty. JZB is darker, more carnal, purely sexual and intensely masculine. Only one man comes to mind when I think of him:The best way I know to describe him to those who have yet to meet him is self-contained. Every move he makes has a purpose, every sentence he speaks is full of meaning. He is the bearer of hard truths. When Mac would rather hide in the comfort of a convenient lie, he grabs her by the throat and forces her to face reality. He’s an unapologetic asshole. He’s cutthroat, mercenary, dangerous. I blame evolution for my attraction to him. Some lesser evolved part of my brain reads about Jericho Barrons and thinks “That man could not only defend your young but would happily slaughter anyone that even thought of threatening you.” He makes my cavewoman stand up and take notice. In closing, I doubt I can ever really explain just why this series is my favorite but I hope the above has begun to do it some sort of justice. Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Kat Kennedy", "userReviewDate": "Feb 17, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "Series OverviewClick here if you can't help your attraction to me. That or, you know, you want to watch my video review.Mr. Kennedy's thoughts on the Fever series (Please note, there will be spoilers):Mr. Kennedy is standing around shirtless, wanting to discuss some of the aspects of the Fever series. I find it hard to concentrate.For goodness sake, Mr Kennedy! Take those sunglasses out of your mouth! I can't hear what you're saying!Me: So what's your favourite part of the Fever series so far (He has read up to Dreamfever):Mr Kennedy: I definitely like Mac better now. She isn't as boring. But she's still doing her inner monologue. That's still really - I mean, it just doesn't end. Does she ever stop doing that?Me: No. Mr Kennedy: Well, fine, but the sex is really good. That shit was hot.Me: *Awkward silence* She got raped.Mr Kennedy: What?! No!*Interview interruption as Mr. Kennedy goes to check*Mr Kennedy: Well, that's really embarrassing.Me: It's okay, honey.Mr Kennedy: I'm not a rapist.Me: I know that.Mr Kennedy: I mean, I thought it was sexy cause she seemed to like it. You know, like with V'lane.Me: Yeah. So, moving on. What do you think about Barrons.Mr Kennedy: Definitely the King of the Unseelie. I want that down on paper that I already figured it out.Me: Right...Mr Kennedy: Wait, did you add in the rapist thing? I don't want everyone thinking I'm a rapist. That's really embarrassing!Me: Don't worry, babe. I won't add that part in.Mr Kennedy: Good. So yeah, I like Barrons. He's cool. Me: Oh, do you have a crush on him now?Mr Kennedy: Yeah, you wish I did. Then you could watch us make out.Me: Shut up!Mr Kennedy: You're blushing! Write down that you're blushing! You want me to make out with Barrons! You want us to *profanities excluded*.Mr Kennedy is falcon punched and wrestled down to finish the interview.Me: What do you think of V'lane:Mr Kennedy: That guy? He's a douche. I don't like men that try to buy people's affection. I mean, I get that he's supposed to be alien and everything but he's just trying to buy Mac with favours. That's stupid.Me: Who do you think Mac's going to end up with? Mr Kennedy: Barrons. No contest.Me: You'd pick Barrons over V'lane?Mr Kennedy: Is the right answer going to lead to sexy times? Oh shit. You're imagining us together right now, aren't you? You're so freaky. Me: I am NOT!Must not think sexy thoughtsMe: So, how do you think it's all going to end?Mr Kennedy: I think Mac is a fae princess. It's been alluded to. And it would be a flip out if Barrons was her father! That would just be creepy as. It isn't that hard to figure it out. Am I right? You know I'm right.Me: Yes, darling, you're totally, totally right.*The End*My overall review of this series is that I really, really enjoy it. This series is addictive like crack.Most certainly, it isn't a perfect set of novels. In fact, there are many aspects of it that would annoy me in other novels such as the sexualization of violence against Mac and the romanticizing of an overtly aggressive alpha male.But my hormones demanded that I put these criticisms aside because... manflesh! Pretty, pretty manflesh! Yes, I too can be reduced to a quivering mass of lust induced hysteria. The world building is great, the characterization is pretty good, the story line is interesting and involving.All up, I recommend this series if you're looking for an Urban Fantasy to sink your teeth into."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "Buddy read with a TON of friends.This is how it feels right now: everyone is on Team Jericho: And then we have me: Pic courtesy of Cory. Thanks, Cory. You shouldn't have. No, really, you shouldn't have.This fucking book.I don't even know how to go about describing my love/hate relationship with this book. Actually, it is mostly hate. I hated every single character in this book, and yet I willingly read on anyway. I don't understand it at all. It is the equivalent of watching midget porn, not that I actually watch midget porn, it's just an example. WHATEVER. The point is, it's ugly, it is horrifying, it is disgusting, but you just can't bring yourself to look away.I give this book too little credit, I feel, in my rant over my hatred of Jericho and MacKayla. It truly is a well-written book. It is a testament to how good it is when the characters evoke such emotions within me, that I feel that they are realistic, complex, believable characters. The mythology is based upon the fae, the Tuatha de Danaan. It is beautifully written and a credit to the author that I loved it this much despite how much I disliked the main characters.Praises over, it's time for me to go off on how much I HATE JERICHO AND MAC.I hated MacKayla's immaturity and prissiness, improbable action and TSTL behavior. I don't care if you're a Southern Miss. You are a grown-ass woman. You can fucking curse when you want to. I was raised to be a lady by my mother, too, my very proper Asian mother who is as stringent (and astringent) on proper behavior as much as a Southern mom. I would die before I use bad language before my mother. Behind her back, I curse like a fucking sailor. I use language that would make the most hardened soul blush. Stupid little Mac with her \"petunias\" and her \"fudge-buckets\" and her multitude of platitudes for curses. Fuck you. You're an adult. Act like it.\"Because I was blonde, easy on the eyes, and guys had been snapping my bra strap since seventh grade, I'd been putting up with the Barbie stereotype for years.\"Guess what, honey? That's actually an accurate stereotype and a stupid statement to make because throughout the book, you act exactly like a brainless Barbie the majority of the time. I admire her initiative, she's out to solve her sister's murder. I get that, I sympathize, I absolutely do. I have a sister of my own, a little sister; I would jump through hellfire for her. I understand Mac's anger, her need for closure, and to an extent, her grief.\"Oh, go ahead,\" I hissed. \"Just kill me and get it over with. Put me out of my misery!\" Missing Alina was worse than a terminal illness. At least when you were terminal you knew the pain was going to end eventually. But there was no light at the end of my tunnel. Grief was going to devour me, day into night, night into day, and although I might feel like I was dying from it, might even wish I was, I never would.You can bet your petuniaass that I would damn well investigate my sister's mysterious death, if she were to die.\"I might not be the brightest bulb in the box, but I wasn't the dimmest, either.\"You sure about that, Mac?\"He didn't just occupy space; he saturated it. About thirty, six foot two or three, he had dark hair, golden skin, and dark eyes. His features were strong, chiseled. He wasn't handsome. That was too calm a word. He was intensely masculine. He was sexual. He attracted. There was an omnipresent carnality about him, in his dark eyes, in his full mouth, in the way he stood.\"Ok, Jericho is supposed to be hot? You know who else is considered hot? Serial killers like Richard Ramirez and Jeffrey Dahmer. And as for stalkery behavior, he's got Edward Cullen beat. And Mr. Sparkles is less of an asshat.\"I am unaccustomed to asking for what I want. Nor am I accustomed to bartering with a woman,\" he said finally.I know there's a lot of people out there who find Jericho attractive; I can't comprehend it. He is larger-than-life, true, he has a magnetic presence, true. But I am the type who likes a gentleman, a gentle man, Jericho is not. There is rarely a moment of softness with him. He is the alpha male of alpha males. You know those monsters that jump out of a haunted house and goes BOO? That's Jericho. He constantly jumps close to Mac and scares the shit out of her. It gets old. Condescension, intimidation, and fear are tactics of interrogation, not seduction. I do not find him remotely romantic, it does not get my panties wet. Nope nope nope.Characters aside, this was a very well-written book. The description of the dark, damp, dreary environment of Ireland I did love the incorporation of Celtic myth, of the portrayal of the fae. They are not fairies, as initially believed by Mac. They are horrendous, rotting, foul creatures. Outwardly beautiful, like the spectacular LegolasV'lane, they are inwardly manipulative, and disgustingly sexually abusive. They literally suck the life out of a person, stealing their outward beauty and inner spirit. I loved the portrayal of the dark side, the horrifying side, of the world of fae. It is a complete 180 from the wonderfully bright and beautiful world of fairies about which I have read in the past.Reluctantly recommended by me."}, {"userName": "Regan", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "Totally addicting, could not put it down!"}, {"userName": "Jeaniene Frost", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/1621755-jeaniene-frost", "userReview": "Rating is for the entire Fever series. Fast-paced and action packed, I plowed through all five books in a week."}, {"userName": "Candace", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "Having now finished this book that came so highly recommended, I have to admit that what I feel mostly is indifference. I wanted to love it, but I didn't. That being said, I didn't dislike it either. The problem was that I just didn't care a whole lot one way or the other.The story is about a young woman, MacKayla, that goes to Ireland to play detective after the death of her sister. In no time, she's uncovered a whole new reality, full of supernatural beings that she had only thought existed in fairytales. The more clues she unearths, the more she begins to wonder if she's following in her sister's footsteps.Along the way, she partners up with Jericho, who is looking for the same ancient book that MacKayla is. The sexual tension is off the charts between these two. However, MacKayla doesn't know if she can really trust him or not. There is a fair amount of action/adventure in this book and it is relatively suspenseful. I would have liked more romance, but it just wasn't that type of book. It is the first book in a series, so that may change as the series progresses.Although the story was just kind of \"okay\" for me, I did think that the narration was done well. So often when I listen to audiobooks, the narrators butcher a southern accent. Often times, it ruins the entire story for me as I want to cringe and cover my ears. Finally, somebody got it right! Overall, I give it 3-stars. I would have given the narration 4 or 5-stars though. It was a nice story to pass some time, but I didn't love it like most of my friends did."}, {"userName": "Tatiana", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Updated 12/8/2014Yep, still addictive.Updated 1/23/2011If you haven't been coerced/begged by me into reading this series yet, IDK where you were last month (maybe away from Goodreads?). If you still don't know that these books are awesome and totally worth your time, this is my last attempted to lure you into giving them a chance. However the main purpose of this update is just to follow up on the outcome of this particular series. So many crash and burn in the process, lose their steam and become a waste of time. Not so here. Fever books are fantastic from the 1st to the last. This series is a great adventure full of mystery, action, intrigue, intricate fae mythology, sexy guys, and hawt schmexing. I am now going to add an extra star to all my Fever reviews for meeting my expectations and not disappointing me in the end. Original reviewI am no expert on urban fantasy and will not waste any time on analyzing the quality of writing of this genre book, I am just going to say that Darkfever's standard mix of ass-kicking heroine/amusing cast of secondary characters/lore/mystery/paranormal hunks worked for me.MacKayla Lane is a 22-year old blonde southern belle/bartender/part-time student who peacefully lives with her parents in a small Georgia town. Mac's life is turned upside down when she learns her older sister Alina is brutally murdered in Dublin, Ireland. The search for the murderer is fruitless and after uncovering Alina's last cryptic voice message, Mac decides to go to Ireland and try to push the murder investigation in the right direction. In Dublin MacKayla immediately finds herself thrown into a world of Faery and learns she has a powerful connection to this world...The first thing that drew me to this book was the narrator - MacKayla. My last couple of attempts to explore the genre of urban fantasy were unsuccessful mainly because I couldn't stomach the protagonists. After enduring wimpy and boring Mercy Thompson (Moon Called) and perpetually gloomy and defiant Kate Daniels (Magic Bites), reading MacKayla's \"voice\" was a relief. She is not particularly smart or strong, but there is a certain lightness about her, and the fact that Mac is not traumatized by some past events is a breath of fresh air too. So many UF heroines, almost as a rule, are some kind of recovering victims. Luckily, Mac isn't one of them. The lore and the setting are enjoyable too. Karen Marie Moning builds her fairy world on Irish lore and I think succeeds in it. Her fae are interesting, with their various abilities to feed on humans' beauty, to make their unwitting victims sexually aroused, etc.What might turn off some readers:1) This book doesn't have a conclusive ending. Darkfever is simply a first chapter in Moning's 5-part story whose major conflict will be resolved in the last book - Shadowfever - out December 2010. Only a few story threads are wrapped up in this installment.2) Lack of romance. It doesn't mean there are no hotties to swoon over however (mysterious Jericho Barrons and ruthless Fae prince Vlane are both irresistibly alluring), but at this point Mac is with neither of these guys. Overall, I enjoyed this book quite a bit. It was fast-paced, filled with entertaining characters and interesting lore. I will definitely read at least the next book in the series - Bloodfever."}, {"userName": "Steph Sinclair", "userReviewDate": "Apr 01, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "1.5 stars This is one of those books where almost every aspect of the book failed me. The characters were flat, the plot stalled around 40%, and the narration was unsatisfying. In fact, the only reason why I didn't just give the book one star was because the beginning intrigued me. Barrons. I don't get his appeal. This is partly because I don't particularly care for the whole \"alpha male\" trope since many times all it seems to be is barely disguised sexual or physical abuse against the heroine. Oh, so Barrons likes to threaten Mac or give her a good choke to get his point across? Totally cool, he's just being an Alpha Male! Catch Me! Swoon! I think not. Had this have been a YA novel, we'd all be calling this an abusive relationship. He may show a different side to himself later in the series, but I don't think I'll be able to look past book 1 to ever find him remotely attractive.Mac is probably the most annoying heroine I've read in a long time. (Maybe if I had read this circa 2009, I would have liked it better.) She's a very shallow person, who I had a really hard time relating to, understanding, or caring about. Her sister is dead and she's supposedly trying to find the murderer, but she always seemed more concerned with what color her nails were. Why is this important? The narration wasn't my favorite with Mac constantly interjecting with lines like \"I won't bore you with the details...\" IT WAS SO ANNOYING. I just wanted to shake her. Like, PLESAE bore me with the details because this is a, you know, BOOK. But no. Instead Moning decided that telling me every detail of Mac's outfit was somehow more relevant that describing what the fey looked like. Having Mac constantly spoil the plot time after time got so old and left no room for the element of surprise. By the time I finished the book, I feel like I know about as much about the characters and the world from when I started, which is nothing at all. Well, wait. This is what I know. As Mac would say, \"I'm just paraphrasing here.\"- Mac likes the color pink, is fashion forward and apparently spends way too much money in the iTunes store- Barrons likes to beat his fists against his chest. He does macho things in his spare time, like running a book store. Since Mac barely describes him, this is what my brain registered him as:- the fey are evil and like to rape women because reasons- Mac's sister died by some evil guy who is not fey but also not human?? Also, his name is Lord Master (over compensating much?). I'm unsure if that's his BDSM alias or real name. Anyway, Mac's sister was hiding stuff from Mac because plot.- Mac's parents are hiding things because plot- Evil fey hang out in the part of town no one goes to because it's abandoned. Ummm, duh? Also, plot. Pretty big disappointment with this one, folks."}, {"userName": "Katerina", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "What a great story! And it would have been even greater, if it weren't for Ms. Mackayla-call her Mac-Lane.Allow me to explain by posing some questions.1) You were warned that you are going to learn how to kill Fae. What do you wear?a) Fabulous lavender shorts with matching top and high heels-oh my God is that blood on your clothes?b)Something cozy you wouldn't mind throwing away later because, you know, mutilated bodies and stuff.c) Does it even matter? Just give me the dagger!2) You just realized your sister's killer may be hiding in the dark neighbourhood that is inhabited by a caste of Fae that suck your life force until the only thing left of you is dried skin. What do you do?a) Head straight to darkness without telling anyone because you're so badass that Fae should be running away from you.b) Run to the opposite direction.c) Make a solid plan and get some help.3) You found out that the world is in danger and for reasons unknown you are one of the few who can help. Put your priorities in order:a) Pink nail-polish, hormones, fate of the world.b) Hormones, fate of the world, pink nail-polish.c) Fate of the world, hormones, pink nail-what?Yeap, you guessed right. Dearest Mac's answers were solid A's. If you like your heroines Barbie-like, you're going to love her. She had her moments of course, but she was shallow, impulsive and self-centered to the core. I can understand her reservations to believe in the extraordinary, her reluctance to accept her destiny and her need for closure after her sister's murder, but that's it. I can't justify every single stupid decision she made (and trust me, they were many), and her fixation on her appearance when everything was falling apart, but hey! if you are killed in your sleep you should at least be fashionable, right?I think, though, that I started off the wrong way. Because Darkfever was actually a deeply addictive, action-packed and ingenious story! As you can already tell, it follows the adventures of Mac, whose sister was brutally murdered in Ireland and so she decided to travel there and find the answers she was denied. But there is something ominous in the streets of Dublin, and she soon encounters creatures that came straight out of nightmares, she searches for objects of dark magic and gets in the middle of the ancient war between Men and Fae, a war that is about to be rekindled. She doesn't know who to trust. The most obvious choice is the sensual stranger who has saved her life a couple of times, but has many secrets and seems to use her for his own purposes. There is only one thing she knows for sure: the Mackayla Lane who first arrived in Ireland is not the same Mackayla Lane that will leave. If she leaves at all.\n\n“There are two kinds of people in this world, Ms. Lane: those who survive no matter the cost, and those who are walking lambs.”\n\nFast-paced. Eerie. Other-worldly. And a little on the sexy side. That is Karen Marie Moning's Darkfever, and it deserves all the hype around it. Setting aside my huge dislike of Mac, I loved this wonderful and intricate world, with its rich mythology, its gothic vibe and its strong mystery element. The narration, with its ominous warnings, the foreshadowing and the way Mac talked to the reader made me even more curious about the events to come. Fae have always been fascinating, and this sinister version of them made Darkfever repulsing and seductive at the same time. And there was also Jericho Barrons.This man is clouded in mystery, he oozes sexuality, and he's not scared of letting Mac know what he thinks about her. The tension between them is so thick you can cut it with a knife, and I am certain explosions and earthquakes will take place in the next books. Well, count me in!\n\n“It's what you choose to believe that makes you the person you are.”\n\nAll in all, Darkfever is a page-turner, and I'm looking forward to returning to Dublin's dark streets!"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Mac Version 1.0\nThe book starts off in Georgia. Mac is a pretty pampered. She works as a bartender, doesn't have much ambition..Just is.\nNo, not Arby's..she is a bartender! Who happens to love pink..way too much.She is lying by the pool waiting on her parents to come home and spoil her some more when her world cracks. She gets the call that her adored sister Alina has been murdered in Dublin. She hops a plane and heads to Ireland because the police have given up on finding her killers and she is the angry sister that will spur them on.Once there she runs into a bookstore..that happens to be owned by Jerrico fucking Barrons. \nBarrons is pretty much an ass..but he is hawt so that kinda is overlooked..yes even by my hating ass.After Mac realizes she can see the Fae she is informed they might not like that and will kill her Barbie butt. So Barron takes her in and together they start hunting Fae objects plus the book that her sister died trying to locate.\nOnce it's realized that the fae know that Mac can see them she is forced to change her appearance.\nI haven't read much UF..and I admit..I liked this book quite a bit. It's pure fun. A perfect escape when you need it. I will continue with the series that my GR friends pushed me into. Plus I'm ready for another version of Mac......."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "I have read Karen Marie Moning’s Highlander Series which I really liked and decided to read her Fever Series, even though I am not that crazy reading books in the first person (I tend to avoid those) and series that are about one person …..and urban fantasy is not my favorite genre….so what made me want to read Darkfever, the 1st book in the series????? Well, I read some good reviews, my local bookseller suggested I try it and hey, loved the book cover and the heroine’s name…..MAC…beyond cool I thought!!!!!!!!!!! And not forgetting…I love stories set in Ireland…From the 1st paragraph…\n”My philosophy is pretty simple –any day nobody’s trying to kill me is a good day in my book”\n, I was totally drawn into McKayla Lane’s world - from the steamy heat of Georgia to the dark and dangerous alleys of Dublin,\n\nthe shadowy and intriguing fae, seelie and the unseelie, Sidhe-Seers, druids and more and more dark and light beings….I could not put the book down… I had to turn the next page so I could find out what would happen next ………This book begins with Mac travelling from her safe, privileged and cocooned life in Georgia, USA to Dublin, determined to finding her sister’s killer…. and before she know it ---walks into the middle of a war between fae and humans….\n\n” A war was coming. I could feel it in my bones. A war to end all wars.And mankind didn’t even know it.” \n\n ….a war where she will play a huge part in.\n\nMac kind of reminded me a bit of “Elle” from Legally Blonde…anyone remember that Reese Witherspoone movie Legally Blonde….the love for pink…where everyone thinks she’s an airhead because she loves fashion and her blonde hair??????????? But wait…….does Mac had something inside her that she had no idea about!!!!! from a naïve, pink-mad, fashion crazy girlie, she soon finds that she is more than that….\n\n“You, Ms. Lane, are a sidhe -seer.”“Huh?” What was a she-seer.“A sidhe -seer. You see the Fae.”I burst out laughing.“This is no laughing matter,” he said roughly. “This is about life and death, you imbecile.”“I laughed harder. “What, some pesky little fairy’s going to get me?”\n\nMac’s life will be forever changed……..Jericho Barrons…..geez this is some amazing guy!!!!! Gorgeous, rich, cultured with great taste in clothes and cars……..can I get a ride with you in your Viper???? Please Jericho!!!!! He’s a really mysterious character – arrogant ….who is he really????? He has so many secrets….Mac feels a darkness in him ….and something more….. Loved the dialogue between the two….Whilst there are no sex scenes in this story, one can feel the connection and sexual tension between Mac & Barrons. \\The secondary characters are so well written and unforgettable…..I am sure we will get to know them better as the series continues…..Rowena, Fiona, Malluce , Vlane….and many others.The plot is intriguing, dark, fast paced…at times I was holding my breath waiting for the next thing to happen…and do things happen…..You are constantly thrown into this dark and scary world, where humans are being killed or being taken over by an immortal and unstoppable evil. Nail-biting stuff!!!!!!!!Using Dublin as the main setting in the story is just so clever...it’s a murky, shadowy, wet and dismal place, with dark cobbled streets and scary alleys….just the right place for evil to breed and live!!And how could any book lover not love Jericho Barron’s bookshop??? So realistic that I felt myself immersed in this world and its characters.The last two paragraphs….and I had to know more…..I had to go out and buy the next books….I had to do it immediately………that’s how I have been hooked…….I need to read more of Mac’s journal, be with her on her journey and share all her pain and happiness….I LOVED this book!!…and this too…………"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Dec 19, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Darkfever took me on a very dark ride, but I enjoyed myself immensely. Ms. Moning delivers with her concept of the Fae, and with this story of the inception of a young woman's crusade to find out who murdered her sister and why. Along with Mac, I was thrown to the wolves, exposed to the cruel, ruthless, and extremely scary nature of the Fae. I am very interested in stories that show Faeries not as the cute, glittery sprites that dance around flowers and giggle in high-pitched voices, but the otherworldly type, who view humans as objects to be used and discarded, when they aren't ignored as beneath their notice. Call me weird, I guess. If I am, then Ms. Moning and I am on the same wavelength here.Mac was a very interesting character. She seemed shallow and immature, but she wasn't. I saw her evolve very quickly as a person, and show that underneath the pink nails, perfect blonde hair, and always coordinated fashions, there was a strong woman who could hold her own. I am very close to my sister, and this book hit home with me. I can't imagine how Mac would have felt, and I don't want to. Having your sister be alive and then the next, horribly murdered. That is an awful place to be in. And to find out about your hidden heritage as a sidhe-seer, and that the Fae are ruthless, cruel and dangerous beings, and you might be one of the few who can stand against them if they decide to take over the world. Wow! Just wow! I'd say she stood up great under all that pressure.And Barrons. I had heard about the guy. He was even better than I expected. Erudite, cultured, dangerously intelligent, powerful, good-looking, and with a hidden agenda and nature that kept me intrigued. He's manipulative and cuttingly sarcastic, but he saves Mac's life and gives her shelter, and even better, helps her to find the means to survive in a world that doesn't make a bit of sense, and to come into her destiny as a power sidhe-seer. Oh, and he owns a bookstore, a really nice one. That's another plus. I was thinking he was like Giles from Buffy the Vampire Slayer, with a little bad boy thrown in for flavor. But my mother nailed it, as she often does! He's actually like Wesley, well Bad Wesley (after he betrays Angel and gets his throat cut). She is so right, and I loved the comparison, since I adore Wesley (good/nerdy and Bad/dangerous Wesley both). Anyway, Barrons....Loved him! I thought that there was a great dynamic between Barrons and Mac, sort of a sensei/student, sidekick, antagonistic partner/frenemies, and could be something more (with the tons of sexual chemistry between them).I've been a fan of Ms. Moning for years, since I've read most of her Highlander books, but I have to say that this book really cements my admiration for her. She writes the Fae very, very well (beautiful/ugly, otherworldly, and very dangerous), and she managed to write a story that engaged me on many levels. There were the dark elements, the humor, the appeal of an ancient, foreign city that was so exquisitely described in the narrative, a likeable heroine who had depths, and I was able to see evolve in a good way over the course of the book, a fantastic antihero, bad boy like Barrons calling my name, and very scary, intense adversaries. This book was primo. I have definitely gotten the Fever, and I want more!"}, {"userName": "Aimee ♥ | Aimee, Always", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/5478965-aimee-aimee-always", "userReview": "I went into this book expecting to possibly die of swoons, sexy times and badass battle scenes, but right now I kind of just want to push every character in this book off a cliff. And if I'm lucky, there will be a mob of angry Aimee clones there with pitchforks right at the bottom.You're probably thinking, Hey, the characters can't be that bad! Maybe they aren't. Okay, I'm kidding. They totally are. At least, they are in my book.Ladies and gents, I present to you, MacKayla Lane:No, I'm serious. I am fucking baffled as to why she keeps claiming not to be a Barbie (meaning your typical blond and very pink idiot) when she honestly is one. This woman is a complete asshole who lacks any sort of common sense. I mean, she basically walks towards danger. Who does that? She's also incredibly vain, shallow and ignorant, never forgetting to mention how pretty she is and how she can \"never pull off ugly.\"Then we have Jerricho Barons. He's basically Christian Grey... minus the excessive love for BDSM. This douchebag is manipulative, abusive, and also has the same personality as a cardboard box. Okay, I lied. A cardboard box would have much more personality than him.On the other side of the spectrum, we have V'lane, a Fae who basically kills people by making them want sex so bad it makes them go crazy. (Yes, even Mac. Surprise, surprise!) So, he's also abusive and talks like he owns the Earth and everyone in it. Not attractive. At all.Also, every single guy Mac meets in this book is apparently hot/sexy/attractive/buff/cute/dresses nicely. Where are the regular people? Where are the unattractive ones? WHAT UNIVERSE DOES MACKAYLA LANE LIVE IN?!Another little qualm of mine: How the heck is this book listed as a romance novel? Where is the actual romance?! Someone please shove it in my face because I really, really can't see it. We only see hints of a blossoming \"attraction\" and basically no other swoony feelings whatsoever. I can't even say that Mac and Barrons are friends, let alone anything more.Rage-inducing things aside, this book definitely had a lot of potential. Moning definitely didn't shy away from writing graphic descriptions (and we all know I'm a huge fan of that) and creating such odd creatures. My eyes widened every time Mac encountered a creepy new Fae.Oh but wait! I have another complaint! The ending managed to be predictable and random both at the same time. The actual \"bam\" moment turned out to be a \"meh\" one. As a bonus, we got Mac suddenly turning into a killing machine without any past training! Hooray.Because I'm a masochist I've been told that this series gets better, however, I'm still going to read the sequels. Eventually.Deadly Darlings | The Social Potato | The Book Geek | Twitter | Instagram"}, {"userName": "Kim", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/1594906-kim", "userReview": "My apologies to Olivia, I know you weren't blown away by Action Barbie and her gang of new friends, but OMG I loved this.Another one of those books I can't read in public. Not because it's full of smut, but because I constantly feel like making out with my Kindle. That's how much I loved reading this book. I was constantly grumpy for the past few days, without having a real reason.Conversations with me pretty much went like this:Person: Kim?Me: WHAT?So after having to reanimate a few of those persons I put 2 and 2 together and realized it was because I felt anxious every moment I wasn't reading this book.There was not one dull chapter in this book, I kept wanting to find out what would happen next. I love how certain questions were left unanswered, questions that a lot of other series already elaborately explain in the first book.I'm not very girly myself so I don't really get the whole pink thing, but it didn't bother me. (I was lucky enough to keep Alicia Silverstone out of my head during the entire book!) I heard a some things about Mac before I read this and I was expecting I would hate her guts. But nope. Love her. I even felt bad because I laughed during her encounters with V'lane. The first one was just funny, the second one was... um... I'm trying to find a way to describe this without giving anything away... I don't know... I read that part and tried to imagine myself in Mac's position. I'm sure my low levels of feeling horrified don't even come close to what it must be like.I pretty much went into high school crush mode the moment I met Barrons (but I didn't know why yet, and I'm still not sure if I have a reason). I'm so intrigued, I feel like bursting out of my skin. I'm this close to booking a flight to Ireland. I'll even swim if I have to.I would dive into the second book this instant if I wasn't reading 3 other books already, but if I don't force myself to read those first, I'll spend all my time reading this series. And maybe it's not a bad idea to drag this out a bit. I might have to give my Kindle to somebody so I can't start reading Bloodfever. But I don't want to end up in jail for assault and battery, or even manslaughter, 'cause I'll know I'll say \"don't let me have my Kindle under any circumstances\" and then regret it 3 seconds later.*dreamy sigh* Oh Barrons. Where have you been all my life?"}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[ (hide spoiler)]"}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Oct 16, 2010", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "Abandon Hope, All Ye Who Enter Here.\nFirst I was like “Fever re-read huh? I’m gonna combine-read it with some other book because I’m that cool.”And then I was like “Fuck this shit it’s Fever were talking about. My mind can handle only one load of awesomeness at a time.”The first time I’ve read Darkfever I didn’t like Mac much. The reasons are obvious. She’s a weakling pretty little blond spoiled brat. However, now I can’t help but love the woman because of what she became throughout the series. I’m biased about everything in this book.And then there’s Barrons. One of the best male characters ever created. Seriously dudettes, if you’ve never read Fever, then at least do it for the sake of Barrons. You’ll thank me later.Speaking of self-induced-pleasure, oh how I love the spark between Mac and Barrons! I mean, just look at them drool over each other, exchange cute words and flirt non-stop.\n\"You, Ms. Lane, are a sidhe-seer.\" \"Huh?\" What was a she-seer? \"A sidhe-seer. You see the Fae.\" I burst out laughing. \"This is no laughing matter,\" he said roughly. \"This is about life and death, you imbecile.\"\nBarrons. Can’t live with him, can’t live without him.I kid the cute words and flirting. Don’t expect much of it. Barrons is a cruel sonovabitch and it takes more than just a pair of fine boobies to catch his attention. Maybe this is one of the reasons why I love him so much. Yes, he’s an asshole but he knows what he wants and stops at nothing to get it. Think of this as a wonderful prelude to one of the best couples in book history. The intensity of it makes me get all bubbly inside. Because I know how it ends.Do you know? No? Does it make you feel bad that I know? Yes?Read the books and you’ll know.Anyway, reading Darkfever for a second time was very entertaining and refreshing. It’s actually the first time I re-read a book. Isn’t that exciting? It sure is. Nevertheless, the best part of re-reading a series is knowing how it ends. The author can’t trick you anymore! I’ve had so many moments where Karen Marie was throwing hints around, and I remember the first time I read the book I was worried and thinking about all the possibilities, building theories. And now. Now I KNOW EVERYTHING.It sure feels good.Darkfever is, in fact, the weakest of the Fever books, but it does have lots of memorable moments. It also taught me lots of useful things. Stay in the light. Don’t stare at strangers. Fuck the police because they are useless.The group read deal came with five questions that all the participants have to answer. Here we go.\nMy Mini-Interview for Darkfever:\nQuestion#1: How would you describe this book in 2 words? I’m too good to settle for two words. Here’s only ONE word: holyfreakingcheesecakeliciouslygood.Question#2: At what point did Barrons start wanting more from Mac than just her ability to sense things? Since this moment.\n“I told you we were going to visit a vampire in a Goth-den tonight. Why, then, Ms. Lane, do you look like a perky rainbow?\" I shrugged in kind. \"Take me or leave me, Barrons.\" He took me. As I'd known he would.\nQuestion#3: Do you find V’lane attractive? Explain your answer. Even though V’lane is described as the most perfect creature that walks the earth I fail to be attracted to him. My reasons are simple. First of all, getting a helpless woman half naked in public without her consent is a no-go for me. Second, Mac was describing all these monsters who cloak their true faces under the illusion of beauty. This makes me think, what if there is a type of monster who is naturally gorgeous but just as dangerous as the rest of them? Yes. Yes, there is. V’lane. My job here is done.Question#4: What's the first thought you had when you heard there'd be a Fever Reread? Barrons!!!!!! *dirty thoughts* It will be nice to read Mac’s story again.Question#5: Which is your favorite scene from the book? The scene where Mac got lost in the dark streets, and suddenly she stumbled upon Barrons Books and Baubles that looked like an oasis flooded in light. I have a very good visual image of it in my mind. Maybe one day I’ll paint it.And last but not least, my favorite quote:\nA butterfly flaps its wings somewhere and the wind changes, and a warm front hits a cold front off the coast of western Africa and before you know it you've got a hurricane closing in. By the time anyone figured out the storm was coming, it was too late to do anything but batten down the hatches and exercise damage control.\nWhy? Because this is how it all started.Check out what my reading buddies thought: ~ Aly ~ Alky ~ Brittany ~ Dee ~ Jesse ~Read my old review here.The Awesome Fever Reread - July-September, 2012!My reviews for the other Fever books:Bloodfever (Fever #2)Faefever (Fever #3)Dreamfever (Fever #4)Shadowfever (Fever #5)"}, {"userName": "Natasha Polis", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/19208239-natasha-polis", "userReview": "Second book of 2016 DONE! Really enjoyed this one for what it is.... A fun sexy paranormal new adult book! It's short and gets to the point, it's exactly what I wanted and kept me reading into the weeeeeee hours of the night/morning. Good thing I have the next 4 books in the series, cause this one ended way too soon!"}, {"userName": "Aestas Book Blog", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/5604583-aestas-book-blog", "userReview": "This is a spoiler-free mini-review for the SERIES, not just this book: Do you want to meet THE. Ultimate.  Alpha Male.  Character?? Grab yourselves a copy of Darkfever and meet the enigmatic, mysterious, fiercely protective, powerful and dominating Jericho Z Barrons.  “He didn't just occupy space; he saturated it. The room had been full of books before, now it was full of him.”  All I can say is if you want a completed book series with an incredible plot, a unique world, and vivid, multi-layered characters with deep pasts, where EVERYTHING happens for a reason (having finished them, I realized there was absolutely NO fluff in these series at ALL), and a full-filling, heart-warming HEA, then this is the series for you.Moning does a masterful job of building an world full of multiple complex story lines and then weaves them all together seamlessly in a way that will keep you guessing right up till the very end. (ALL my predictions were wrong! and that doesn’t happen very often)… This book will have you going crazy asking “What IS Barrons????”  “When you know who I am. Let me be your man.”  Seriously, this is one of the BEST paranormal series I have EVER read. I can’t recommend them highly enough!It is a COMPLETED series and should be read in order. It is one continuous story. Each book starts right where the previous one left off. And the SERIES ending is a HEA. The individual books themselves have cliffhangers since the story spans 5 books.And they are definitely ‘adult’.  “One day you will kiss a man you can’t breathe without, and find that breath is of little consequence.”  And there are a few Barrons casting visuals here to help convince you to give this series a shot :)PS. I read these books in my pre-review writing days so I apologize for the lack of detail."}, {"userName": "Mo", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "4.5 Stunning Stars.I went into this one with a bit of trepidation. Why? Well, for one, it is Paranormal which I do not really do. Two, it is set in Ireland and, being Irish, I can be super critical if it is not done right. But a few friends decided it was time to go for it and do a Buddy Read of it. I loved it. OK, the terminology was a bit too much to take in at times but the writing was excellent. The characters were intriguing. The sex was non-existent but what the heck, if the writing is good I usually don’t mind. But they better get it on some time soon.\nI love books, by the way, way more than movies. Movies tell you what to think. A good book lets you choose a few thoughts for yourself. Movies show you the pink house. A good book tells you there's a pink house and lets you paint some of the finishing touches, maybe choose the roof style,park your own car out front. My imagination has always topped anything a movie could come up with. Case in point, those darned Harry Potter movies. That was so not what that part-Veela-chick, Fleur Delacour, looked like.”\n\n“Assume' makes an 'ass' out of 'u' and 'me'.”\n\n“Last night you said you wanted to know what to expect so you could better select your attire. I told you we were going to visit a vampire in a Goth-den tonight. Why, then, Ms. Lane, do you look like a perky rainbow?”\nWas a bit wary as it was set in Ireland, in Dublin. Don’t really know Dublin that well as I am from the West of Ireland meself. But she knew her stuff. Only thing I found wrong was that she said Gardai car instead of Garda car – Gardai is plural. But that is just nit-picking from me.\nBarrons laughed again. \"And there, my dear Fio, you make one of Womankind's greatest mistakes: Falling in love with a man's potential. We so rarely share the same view of it, and even more rarely care to achieve it. Stop pining for the man you think I could be -- and take a good, long, hard look at the one I am.” \nShe talks about a Dolmen towards the end of the book – it was an ancient burial place. This one is literally up the road from the village I grew up in in County Clare. Poulnabrone Dolmen.\n“Sometimes, Ms. Lane,\" he said, \"one must break with one's past to embrace one's future. It is never an easy thing to do. It is one of the distinguishing characteristics between survivors and victims. Letting go of what was, to survive what is.”\n\n“He raised a brow. 'Petunia, Ms. Lane?'I scowled. \"Ass, Barrons.”\nLook forward to starting …."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nAhhhhh, stop yelling at me already and let me explain.It seems everyone liked this book. I’m talking everyone. EVERYONE. Except me. I. Just. Don’t. Get. It. \nOkay, not really. This is obviously a case of it’s not you, it’s me. Maybe I’m too mature for stories of the supernat . . . BWAHAHAHAHA! I couldn’t even type that without laughing. I don’t really know what went wrong, so I’m gonna play it safe and blame it on Sookie Stackhouse . . . \nAfter riding out the horribleness which became the Southern Vampire series, I just wasn’t prepared to deal with yet another vapid waitress and her otherwordly interactions. You see, Mac is a simple waitress from a simple small Southern town whose simple life gets flipped upside down when her sister gets murdered. Annnnnnnd of course Mac has to take it upon herself to travel halfway across the world in order to become an amateur Sherlock Holmes and find out “whodunit.” The problem? Well, Mac is an idiot. I mean, she made Sookie seem like a real braintrust, which is simply terrifying. Mac spends most of her time coordinating her ensembles with her nails, and don’t you know . . . \nYep, Mac referenced pink so much I thought I was going to barf Pepto Bismol. \nAlong the way, Mac meets a mysterious alpha male named Barrons who (like me) finds her insufferable, but (unlike me) somehow doesn’t follow his instincts to step aside and let her be murdered. Turns out that’s a good thing as Mac has some special powers of her own. Powers that detect the hidden Fae that walk amongst the normies as well as the ability to sense hidden Fae Objects of Power (OOPs for short).Sidenote: My brain insisted on replacing OOP with O.P.P. – which is a VERY different thing. That song is still playing in my head. Are any of you even old enough to remember Naughty by Nature? Probably not *insert sad face* so here’s a little image that will show you how the song goes . . . \n Okay, back on topic. Barrons recruits Mac in order to find the Sinsar Dubh – the most powerful of all of OOPs that can destroy the world as we know it. Talk about some serious pressure.\nGet it? Anyone? Bueller? Under Pressure – Queen and David Bowie??? Hilarious!Alright, so this book didn’t work for me and I didn’t like it, but I didn’t completely hate it either. Some things I enjoyed?1. The writing wasn’t horrible and although I really don’t like first person narrative, I did like that Mac’s voice was well aware of the fact that she was telling a story that already happened. Seriously authors, if you are writing from first person it’s pretty obvious that person ISN’T DEAD, so don’t try to bullshit the reader into getting all nervous about whether they’re going to make it out alive.2. Mac admits she’s a useless Barbie in times of crisis.3. The setting. Although the world building was pretty lame for me, I’m assuming it gets better since there are a crapton more books in this series. However . . . Dublin???? That’s good – assuming Mac and Barrons ever leave the f-ing bookstore.4. Mac’s superpower of detecting bad guys? She vomits. LOLOLOLOL. I got a kick out of that.5. And last, but obviously not least, BARRONS. Duh, right? I haven’t yet read any reviews of this series, but I’m assuming there’s a lot of Joe Manganiello gifs to be had. For me, though? It was all about this dude . . . \nand anytime I can’t get the image of Oded Fehr out of my head is a good time.To all my homegirls out there who have read/are currently reading/or are re-reading this series – I’m sorry it didn’t work for me. I’m always the oddball : ("}, {"userName": "The Flooze", "userReviewDate": "Feb 27, 2009", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "[how in heaven’s name does Barrons go from gruff and surly to Painting. Her. Nails? Yup, that’s right. Mr. I’m Going to Use and Abuse You is suddenly content to pick up a teensy brush and apply some pink lacquer to Miss Thing’s fingers (hide spoiler)]"}, {"userName": "Lola  Reviewer", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "*5 stars*5 stars*5 stars*5 stars*I have always enjoyed reading UF series, especially the ones containing a bit of mystery. Exactly like Darynda Jones' series of Charley Davidson. It may not be a surprise that I liked Darkfever, but it is one that I seriously couldn't put it down! I shouldn't have started it yesterday at 11PM, even if it was a friday night. You see, sleep is important to me. I actually had to drag myself to bed and convince myself that tomorrow is another day, that I'll have plenty of time to read and that nothing's going to happen to my heroine that I wouldn't know eventually about.Of all the UFs I've read in my life, (Queen Betsy, Charley Davidson, Night Huntress, Parasol Protectorate,...) this one had, in my opinion, the best and most interesting worldbuilding. I mean, fairies? Yes. Dark and lethal fairies? Gimme gimme!! Also, I liked the fact that there were many different settings and not principally in a specific place like my latest read book, Cruel Beauty (which was also a very good but quite different book.)The characters were very entertaining and riveting. And there were quite some to fantasize about. A reason why I love reading urban fantasy series is that they remind me of action-packed TV shows. And I can never get enough of them. I love seeing the character developpements from the first to the final books. I like my heroines kick-ass, smart and independent so Mackayla Lane was a bright shinning star for me. I think I'm in the minority here, but I didn't get all crazy and fangirl on Jericho as most of you who read this book may did. Maybe I was supposed to succumb at his charm, but I didn't. Maybe it's because of the fact that him and Mac didn't meet at an interesting moment for me. And a book shop? Meeeh. I love book shops, but it's just not the place I was expecting. I may not have swooned over him, but he definitely was a nicely built and thought of character. My own personal fantasy is V'lane:To every person who has yet to read this book, do so. I'm (almost) positively sure you will be a satisfied reader and will enjoy it in one way or another.Happy reading!"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "I have just completed my FOURTH read of this book and guess what? I still love it! It's like a slice of pizza, mac and cheese, chili and cornbread, cheeseburger and fries... the best comfort food. When you read this book the first time, you see a young, naively superficial, but well-intentioned young woman grieving who travels to Dublin to try and find answers to her sister's bizarre murder. Once there, she meets the mysterious Barrons, owner of Barrons Books and Baubles, a carnal man who isn't what he appears. Layers of the onion are unpeeled, and Mac discovers there is a whole other world full of fae, not Tinker Bell fairies, but monsters. Even the pretty ones are deadly and ruthless and treat humans as animals. Mac isn't going to let them take over the world, and she is going to use her new-found powers, along with Barrons connections and strength to take back the planet!This book starts it all and I'll always love this series. It made me love books more than I thought I could. I am totally biased and unashamed of it when it comes to this series. Mac is bad-ass and Barrons is at the top of my book boyfriend list, tied only with Eric Northman. The THIRD Fever series MacHalo Group Re-read starts November 23, 2017. This will actually be my fourth time reading, so screw it. I am adding a brand new review space. (I still don't trust GRs new re-read system thing. Plus, who remembers the dates they read a book each time?) I have this edition from picking it up at a thrift store.Original review: Darkfever: FIVE STARS!"}, {"userName": "Aly's Bookish Wonderland", "userReviewDate": "Nov 26, 2014", "userURL": "http://www.goodreads.com/user/show/22178203-aly-s-bookish-wonderland", "userReview": "You want to believe in black and white, good and evil, heroes that are truly heroic, villains that are just plain bad, but I've learned in the past year that things are rarely so simple. The good guys can do some truly awful things and the bad guys can sometimes surprise the heck out of you.\n\nMacKayla Lane has her life together: a loving family she adores, a sister that is also a best friend, a job that pays in the environment she thrives in (partying) and courses at the local community college to keep things interesting (and her father off her back about finding a \"proper\" job). Everything is just perfect.Until Mac's sister, Alina, is found dead in a trash-filled alley in Dublin, where she'd gone to study at Trinity College. With no suspects, evidence, or arrests, the Dublin police make quick work of the case and waste no time in closing it.\n\nAlina wasn't just my sister; she was my best friend. Though she'd been away studying at Trinity College in Dublin for the past eight months, we'd emailed incessantly and spoken weekly, sharing everything, keeping no secrets.Or so I thought. Boy was I ever wrong.\n\nWith a family torn apart by grief, Mac decides to take matters into her own hands and fly to Dublin. She was going to catch the killer herself, or at least convince the Garda to reopen the case, thanks to a voicemail left by Alina on Mac's the phone hours before she died.\n\n\"Oh, Mac, everything has gone so wrong! I thought I knew what I was going, I thought he was helping me, but -- God, I can't believe I was so stupid! I thought I was in love with him and he's one of them, Mac! One of them!\"\n\nBut once in Dublin, Mac realises things aren't going to be as easy as she'd hoped, and that Dublin in't what it seems. Abandoned streets, strangely forgotten by the public, lead her to Barrons Books & Baubles one foggy, wet night.\n\nBarrons Books & Baubles seemed to stand bastion between the good part of the city and the bad. To my right, street lamps spilled warm amber light, and people called to each other, laughing and talking. To my left, what few streetlamp still worked shed a sickly, pale glow, and the silence was broken only by the occasional door banging on broken hinges in the wind.\n\nThat night, she meets the enigmatic Jericho Barrons, book collector and owner of Barrons Books & Baubles, and he is nothing if not forceful and adamant that she must leave Ireland.\n\n\"You, Ms. Lane, are in way over your head. Take my advice and extricate yourself while it's still possible.\"\n\nBarron's is dead set on running Mac out of town, but then he realises they could be of use to each other. Mac, he discovers, is a sidle-seer, a powerful human being that can see the face, and her unique gift of sensing Fae Hallows is of much use to him. Soon, Mac and Barrons forge a reluctant partnership -- Barrons will keep her alive in a world quickly being overrun by paranormal monsters, and in exchange, Mac will help Barrons find the Sinsar Dubh.\n\n\"The Sinsar Dubh is a book.\"\"A book? THat's all? Just a book?\" It seemed terrible anti-climactic.\"On the contrary, Ms. Lane, never make that mistake. It is an exceedingly rare and exceeding ancient manuscript countless people would kill to possess.\"\"Including you? Would you kill to possess it?\" I needed to know exactly where we stood, he and I.\"Absolutely.\"\n\nThere are numerous reasons why I love the Fever series: the setting (Ireland and Scotland have been two obsessions of mine from a very young age), the characters (Mac and Barrons in particular, but the entire cast is just wonderful and perfectly done), the plot, histories and legends incorporated so well you'd think Ireland truly was infested by murderous castes of Fae ready to take over the world.As this reader's second reread, Darkfever, the first book in the series, revealed many plot points easily missed or overlooked the first time. In a fantastical world on the bring of a terrifying, supernatural war, it's a race against time to find the Sinsar Dubh. Everyone wants it, and they will go to extreme lengths to get their greedy hands on it.Karen Marie Moning's very clever creation of a \"rainbow\" girl (a lover of boys, gossip, clothes, parties and expensive shoes) turning \"dark\" illustrates how desperately this particular character wants to survive and avenge her sister's brutal death. Each character is completely and wildly different to the next, bringing new excitement to the page as it is difficult to predict what will happen next.Also, the tension is one to savour. With battles that spike your adrenaline and thick mystery you can cut with a knife, Darkfever is definitely a book to read and, hopefully, adore.Review also coming to 100% Rock Magazine!After Reread: 30/12/15-06/01/16 I love rereading books for the simple fact that you miss so much when you're ripping through a treasure-trove of a book the first time. The excitement is high, your gut is twisting, your heart is hammering and you just HAVE to know what happens next. The second time is a lot smoother, and you can soak up the details better: the whens and hows and whos and whys. I had many a \"AH HA!\" moment whilst reading and things that were lost on me the first time (and things I forgot as I read more of the series) made a lot more sense.Considering I read the first five books in four days, I can say with certainty that not much stuck in my head except that it was awesome, kickass, fast paced and that I loved Mac and Barrons unconditionally. This time around, I can't wait to really READ it and hopefully write a more coherent review. The below quote is still one of my favourites.Full review to come! \n\"Assume makes an ass out of 'u' and 'me'.\"\nI dare you to not read Darkfever.I dare you to not enjoy Mac's internal narration, and her curse-word substitutes: \"petunia\" for ass and \"frog\" for fuck.I dare you to try and stay away from Barrons.I dare you to not like this new, invigorating, glorious plot.I dare you to not like every single character you meet, no matter how much of a dickhead they turn out to be.I dare you to not love the rich background provided, and the histories shown.I dare you to not fall for all the different species that stalk through the pages of this book.I dare you to not argue with your feels on more than one occasion.I dare you to not laugh even at the soberest of times, or when something awful has happened, because the narration is just quirky enough to alleviate the tension for ten seconds.I dare you to not get all flustered and hot when Barrons speaks, even if you end up hating him immensely half the time, and wanting to punch him for the other half because he's an Alpha male dickhead who will not give you any sort of reasoning for his actions.I dare you to read the rich descriptions of Ireland and Dublin, and not want to go there.I dare you to not adore Mac, even when she's trying to be kick-ass and fails miserably.I dare you to read this and not wish some of it to be real, even if that wish implies terrifying monsters walking the streets.I dare you to read Darkfever and not love it.Pre-ReviewThe \"Glossary From Mac's Journal\" is one reason why you should read this book. It contains treasures such as 'death-by-sex Fae' and 'many mouthed thing'.Seriously. This book is not only brilliant, but hilarious too. I love Mac. Review to come!"}, {"userName": "Eryn✵", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/17568354-eryn", "userReview": "3/5Can I say that I'm disappointed, but also satisfied? I mean, at first, this started off shakily, and I was disappointed with where everything was heading, with the characters and writing. Mac was annoying, shallow, and seemed to care more about her own appearance over anything else (I realize Moning was trying to make Mac a character we could empathize with, but I just wasn't getting that), whereas the writing wasn't engaging me either.Then, there was Jericho. I'm pretty sure I was supposed to think he was \"super hot\" or something, well, I didn't. With him, I don't know, I guess the simple explanation is to say that I just didn't like him. Regardless, I surely didn't hate him, but he didn't do it for me with his reoccurring attitude problems and abusive ways towards Mac. This brings me to Mac and Jericho. Did I want them together? I guess...? Did I care if they ended up together? Not really? Okay, so here's the thing. I didn't like either of them as characters, so I didn't really care if they ended up together or not. Not only that, but I didn't feel the \"connection\" between them. So, that was disappointing.If you got to this point of the review, you're probably wondering how I even gave this 3 stars. Quite frankly, I'm even wondering that. However, I enjoyed the entire story. If I'm not picking at everything and pointing out how annoyed I was when reading as Mac describing her outfit's at the most random times (seriously?), then it was all good and fine. Maybe not \"good,\" rather, it was it was interesting. Interesting enough to hold my attention.Overall, I'm going to start the second book, since I got it for Christmas. Either way, I'm sure many people will love reading this. Me? Well, I thought it was nothing more than average."}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "[I blame all of you for the high expectations I had for this book. I'm not sure why but I'm between three and four stars. Let me tell you one thing: Darkfever kick asses. It is indeed an awesome series, I can feel it. I'm excited about this flawless world-building. I'm even more excited about the Jericho/Mac relationship. I'm so intrigued about Mac's sister murderer and it's obvious we know nothing about what really happened. I can tell there's so much more to find out and Karen Marie Moning is one of those rare authors that won't give you a stupid, whinny MC or a douchebag for a love interest.Now, why the hesitation? It's because of all the hype. I mean, I though Jericho was synonymous of sexy times, a steamy relationship or a forbidden love. In the end, they're building a dangerous relationship. The tension was there, Jericho's hotness and maleness was there but nothing calm the needs I had for something a little more explicit, if you know what I mean. I know, I'm always complaining about how easily UF's girls loose their pants but what do women want, right? I didn't feel that attracted to Jericho. Yeah, he was hot and I love how rude he was with her (that says so much about my loving life...) but I wasn't swooning for him. Something inside me says: NOT YET... I'm listening.Coming back to the awesomeness: 50% of the book and still Mac was trying to be logical about this new paranormal world. Can you believe it? Not a TSTL Mary Sue, though at first I didn't like her, Mac proved to be a great character and her evolution was incredible. What's this sorcery? a story where things actually make sense? yeah. She lost her sister and you can tell she's not over it and she won't till she avenge her sister. Not for a moment, not even when V'lane was near, she forgot the emptiness and injustice of her sister's death.I also love the POV. Mac tells the story a year ahead from and adult, mature POV. She knows exactly what went wrong before us and that made this so addictive. \"Why would she say that? What's she not telling me? Why would she regret that decision later?\" I'm telling you, it only took me a few pages to feel excited about it and I've already started reading the second book. (hide spoiler)]"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "[ Besides, Barrons is still more of the ancient animal at this point in the story. Mac humanizes him a lot in the later books. (hide spoiler)]"}, {"userName": "Helen 2.0", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/39575951-helen-2-0", "userReview": "November 2017 Re-re-read - gettin LIT with the MacHalo tribe!!!Took me 3 reads to finally realize how much KMM likes to insert her personal opinions into this book... and she rambles, for gods sake."}], "description": "\"My name is MacKayla, Mac for short. I'm a sidhe-seer, one who sees the Fae, a fact I accepted only recently and very reluctantly.My philosophy is pretty simple - any day nobody's trying to kill me is a good day in my book. I haven't had many good days lately. Not since the walls between Man and Fae came down. But then, there's not a sidhe-seer alive who's had a good day since then.\"When MacKayla's sister was murdered, she left a single clue to her death, a cryptic message on Mac's cell phone. Journeying to Ireland in search of answers, Mac is soon faced with an even greater challenge: staying alive long enough to master a power she had no idea she possessed - a gift that allows her to see beyond the world of man, into the dangerous realm of the Fae.As Mac delves deeper into the mystery of her sister's death, her every move is shadowed by the dark, mysterious Jericho...while at the same time, the ruthless V'lane - an alpha Fae who makes sex an addiction for human women - closes in on her. As the boundary between worlds begins to crumble, Mac's true mission becomes clear: to find the elusive Sinsar Dubh before someone else claims the all-powerful Dark Book - because whoever gets to it first holds nothing less than complete control both worlds in their hands.", "title": "Darkfever\n      \n          (Fever #1)", "url": "https://www.goodreads.com/book/show/112750.Darkfever__Fever___1_", "average": 4.13, "cover": "https://images.gr-assets.com/books/1392579949l/112750.jpg", "reviews": 9181, "authors": [{"url": "https://www.goodreads.com/author/show/48206.Karen_Marie_Moning", "name": "Karen Marie Moning"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/112750.Darkfever", "http://www.goodreads.com/book/show/1451694.Darkfever", "http://www.goodreads.com/book/show/6283272-darkfever", "http://www.goodreads.com/book/show/18112531-darkfever", "http://www.goodreads.com/book/show/6863668-darkfever", "http://www.goodreads.com/book/show/6985664-darkfever", "http://www.goodreads.com/book/show/7304203-shadowfever", "http://www.goodreads.com/book/show/6050298-dreamfever", "http://www.goodreads.com/book/show/344262.Bloodfever", "http://www.goodreads.com/book/show/2702704-faefever", "http://www.goodreads.com/book/show/743599.Beyond_the_Highland_Mist"]}