{"ratings": 2, "userreviews": [{"userName": "Zeusthedog", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/12452141-zeusthedog", "userReview": "la vita scorre noiosa nella Citrus Country Florida. .. come noioso scorre questo libro. Belle idee poco sviluppate."}], "description": "Esiste la Florida dei parchi divertimenti, degli alberghi, delle spiagge e dei surfisti. Ed esiste la Florida della contea di Citrus, nella cosiddetta Costa della Natura, dove c’è la natura perché non ci sono parchi divertimenti né alberghi né spiagge. E dove regnano i redneck al posto dei surfisti, e piante che fioriscono e marciscono sfacciatamente al posto di giardini rigogliosi.Toby McNurse ha quattordici anni e tante ferite dentro di sé: non ha mai avuto un padre e non ha piú una madre, abita in una casa malandata con uno zio che si arrangia pulendo cose che nessuno osa pulire, dai mattatoi ai vecchi motori incrostati, e discorre incessantemente e pateticamente di suicidio.Toby frequenta la scuola locale, dove impera il professor Hibma, un uomo insicuro e confuso che riesce a pontificare per venti minuti filati sulle mostruosità del capitalismo, la rivoluzione diventata merce, i poveri che hanno ormai la pizza e l’erba assicurata, i moralisti e gli artisti che se ne fregano di tutto.Toby infrange le regole e accumula punizioni, ma senza gioia nella disobbedienza, né rabbia. Le vuote passioni dei suoi compagni di classe – musica, droga, piccoli crimini, sesso – non significano nulla per lui. La droga è una cosa patetica. I flirt, umilianti. I furti e altra robaccia simile, ridicoli.Nella classe di Toby è arrivata da poco Shelby Register, trasferitasi in Florida con il padre e la sorellina dopo la morte della mamma. Shelby è carina, sveglia, sogna di fuggire in qualche paese lontano ed è attratta da Toby, pur sapendo che quello della brava ragazza che si innamora di un teppista è il classico luogo comune. Ma per Shelby i ragazzi normali sono una noia, quindi ben venga il luogo comune.Toby, tuttavia, non è affatto un vandalo qualsiasi, un banale teppistello angosciato come tanti. Toby è un ragazzo che, nel profondo della sua anima, è piú terribile di tutti i delinquenti minorili della contea messi insieme. Un malinconico destinato a infliggere danni ben piú gravi di quelli che Shelby o il professor Hibma osano pensare, e che, al cospetto di Shelby e di Kaley Register, la sorellina di quattro anni dai capelli che scintillano come un’esca nell’acqua, sa che è giunta la sua ora... l’ora di fare finalmente quello per cui è venuto al mondo.Magnificamente scritto, inquietante, commovente e ilare insieme, Dark Florida ha rivelato sulla scena letteraria americana e internazionale il talento di John Brandon, uno scrittore capace di illuminare, con crudo e poetico realismo, il lato oscuro della gioventú odierna.«Un giovane grande scrittore che farà molta strada».San Francisco Chronicle«Con Dark Florida John Brandon si aggiunge alla schiera di quegli scrittori che non smettono di ricordarci che il mondo reale è molto piú inquietante della letteratura. Il risultato è una grande storia con una voce eccezionale, ricca di personaggi che risultano veri proprio perché estremi».New York Times«John Brandon è uno scrittore dalla prosa infallibile – a metà strada tra Denis Johnson ed Elmore Leonard».Davy Rothbart«Dark Florida è un romanzo incantevole, con un tocco di dolente ilarità… Fa sorridere anche quando infligge un colpo al cuore, ed è uno dei migliori libri mai scritti sull’adolescenza».Dan Chaon", "title": "Dark Florida", "url": "http://www.goodreads.com/book/show/30517739-dark-florida", "average": 3.0, "cover": "https://images.gr-assets.com/books/1465599754l/30517739.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/938447.John_Brandon", "name": "John Brandon"}, {"url": "https://www.goodreads.com/author/show/2853264.Luca_Fusari", "name": "Luca Fusari"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/30517739-dark-florida", "http://www.goodreads.com/book/show/7755180-citrus-county", "http://www.goodreads.com/book/show/2066546.Arkansas", "http://www.goodreads.com/book/show/13239796-a-million-heavens", "http://www.goodreads.com/book/show/18492622-further-joy", "http://www.goodreads.com/book/show/10573018-burnt-bridge-1"]}