{"ratings": 1131, "userreviews": [{"userName": "Stephen", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "WHO IS THE ULTIMATE SWORD AND SORCERY BADASS: KANE OR CONAN?4.5 to 5.0 stars. Today, I thought I would provide a public service by definitively answering the above question, which has been confounding fantasy fan boys for decades. Now before we (and by we I mean myself and the other voices in my head) answer this question, we want to comment on all of the other “theories” floating around regarding this question developed by so called “experts” in the genre. These other theories are, in a word, guff, poppycock and drivel. They do nothing more than muddy the waters and cause angry confrontation from fan boys who have had too much Mountain Dew and Crunch and Munch. Well enough of that “subjective” crap, we have developed an actual MATHEMATICAL PROOF that answers this question once and for all.*\n*WARNING: The proof used in this review was developed in cooperation with psychotic gnomes, hopped up on Mescaline, No Doz and Thunderbird and tested only in a controlled environment deep within the creamy nougat center of a King Size Three Musketeers. Solving the proof below while either sober or wearing clothing made from any form of “natural” fiber may cause incontinence (with or without anal bleeding), excessive hair growth and/or night terrors. Please consult an unemployed physician** before reading the rest if this review and advise them whether you have: (1) purchased and watched more than once the entire first season of Alf; (2) yelled at a child under 7 for grabbing the last Beanie Baby from the display rack when you were reaching for it; or (3) fallen in and out of love during the course of a single trip to the post office. ** We are trying to do our part to help the economy by getting Doctors off the street. \nHere is an explanation of this proof so you can follow along at home as well as verifying the accuracy of the steps taken. STEP 1We start off by assigning values for the following:g(1) + f(1) + 1(y -17) to stand for Kane's supreme coolness and overall badassedness quotient h(1) + f(1) + 2 (x + 4) to stand for Conan's square-jawed manliness and penchant for fur STEP 2A. Next we add to the Kane equation the co-efficient of Kane's mysterious, well developed, Lovecraftian world of ancient mad gods, powerful alien conquests and epochs of lost technology which is represented mathematically as follows:k(t) + 1+Vt+Et2+Ft3(sin8)+t4(cosX)B. We then include on Conan’s side the square root of Conan's Hyborian Age, add in the supreme awesomeness of the individual stories “The People of the Black Pool” and “The Tower of the Elephant” then divide by Pi (to account for Robert Howard's blatant racism) which is expressed as follows: c(t) + hy(5) + (P(2)b+Te(7)) + 4y/PiSTEP 3We then add to Kane an amount equal to his immortal undyingness, which provides him with “wicked smarts” and “two oodles” of knowledge represented as: 7x + 15g - (y + 3n) plus Kane’s “Wolverine” like healing ability shown as: 9xt/4 +1(8-5y) + 17and add his seriously outstanding sorcerer abilities (plus another 15 since he rarely uses them as they are not necessary do to his “the bombitude” in other areas):Oh + Yeah+15STEP 4Finally, we add +75 to Conan for the phrase \"By Crom\" and +125 for Conan’s ability to answer the question “What is Best in Life?”ANSWER: Kane = g(1) + f(1) + 1(y -17) + k(t) + 1+Vt+Et2+Ft3(sin8)+t4(cosX) + 7x + 15g - (y + 3n) +9xt/4 +1(8-5y) + 17 + Oh + Yeah +15Kane = 220,500 “theMan” units Conan = h(1) + f(1) + 2 (x + 4) + c(t) + hy(5) + (P(2)b+Te(7)) + 4y/Pi +75 +125 Conan = 117,400 “theMan” units and a remainder of 42 “kickasses”RESULTAs you can clearly see, Kane has been PROVEN to have almost TWICE the BADASSEDNESS of Conan, which can be expressed using the following equation: Conan = Kane’s bitch ADDITIONAL THOUGHTS AND CLARIFICATIONSThe developers of the above proof (other then the psychotic gnomes) would like to stress in the strongest possible terms that we are HUGE fans of Conan (as evidenced by our many 5 star reviews of his awesome adventures) and that his being Kane’s bitch does not diminish his overall coolness. For comparison sake, the creators of this proof when calculating their own “badassedness” come up with a total of less than a single “theMan” unit which caused serious negative image outlook and bouts of weeping. That said, we will now take questions from the audience if there is anyone there. If addressing a question to a specific “voice” in my head, please call him/her by name and/or planet of origin."}, {"userName": "J.G. Keely", "userReviewDate": "Nov 30, 2014", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "There are stumbling blocks for every author--we each have our crutches, our weak points, our awkward moments--but what sets a good author apart is that, despite these things, there is always something that carries them through it, some verve or strength that makes up for it.This is especially true for pulp and genre authors: their work may be unpolished, even bordering on the cliche, but some aspect of their approach and vision still shines through. Lovecraft's pacing and voice often left much to be desired, but his unique vision of cosmic horror still makes much of his work intriguing. Early on, Moorcock struggled with subtlety and sophistication, but his odd conceptual approach often saved him. Indeed, for Howard, the more polished his style became, the more it lost the vitality that set it apart.With Wagner, I struggled to find the unique aspect of voice that makes a story worth telling--and worth reading. Certainly, there are some things he does well: his writing shines when he is setting a scene, in descriptions of places, structures, weather, the tapestry of a landscape passing the lonely traveler by. There is some real loveliness there, some fine turns of phrase and genuine tone.However, outside of these passages the style becomes finicky. The action scenes get bogged down in deliberate, meticulous description, preventing them from flowing, from being dramatic and wild. It all begins to feel like a foregone conclusion. Wagner doesn’t seem to be able to create interesting tensions within the action to keep us interested.In actions scenes, there is always the obvious, overarching conflict that must be resolved. In combat, it is the naked question of who will prevail, whose sword arm will prove stronger. In the chase, it is the question of whether the quarry will escape, or be captured. In order to lengthen these into full scenes, there must be a sequence of smaller conflicts playing out which are progressively dealt with en route to the final conclusion.However, it is vital that these smaller conflicts be interesting in themselves, and not just be an extension of the larger. So, it cannot just be ‘our hero sees a new foe before him’, to be cut down and defeated in a repetitious succession of thud and blunder. There must be some wrinkle, some particular that must be overcome in a way that requires something specific of our hero, that engages him. It is not enough simply to have a quick foe, or a massive one--that quickness or size must be given some particular thrust--some detail that makes it feel true to the reader, that makes it imperative to the hero’s momentary survival.Kane is meant to be preternaturally skilled and competent--but even the most certain man must grit his teeth and will his way through at least some of his struggles. The combat often ends up lacking a sense of danger or thrill or unpredictability to keep things moving. It shows how difficult it really is to produce the kind of exciting flow that Howard seems to create so effortlessly--almost thoughtlessly--in the Conan stories.Wagner’s dialogue likewise shows a niceness that causes it to lose much of the punch it might otherwise have. Firstly, he walks that line le Guin marked in her essay \nFrom Elfland to Poughkeepsie\n, in that when he makes his language conversational, it can start to feel overly modern and plain in the mouths of these outlandish characters. That isn't to say that characters in fantasy should all speak like chivalric knights errant, but creating conversation that is both rough and retains a period feel is no easy feat.Secondly, like many authors unsure of their own voice, he seems to fear being misunderstood. So, he leaves nothing implied, allows no subtle nods, instead making sure the whole is stated outright for the reader. So, if we have our hero speaking with a shady character, a dark-cloaked spy who works both sides, you can be certain that at some point, there will be an aside where he thinks to himself ‘I’m not sure if I can trust him’. If two characters are planning to break into a castle, one will probably mention that he doesn’t want to be caught and tortured.There’s a reason that writers don’t do this: ‘While fully dressed and facing forward, he walked with his feet across the green grass lawn’--most of those words simply aren’t necessary. The exact same image is communicated by ‘He walked across the lawn’. The true job of a writer is deciding what needs to be shown versus what can be left unsaid. If our hero walked backwards on his hands while naked across a perfumed lawn of purple bones, that might be worth mentioning. Ultimately, it makes Wagner’s writing tedious to get through--less like characters engaged in conversation and more like two writers plotting the outline for a script.The Cthulhu bits are played too straight, too matter-of-factly. Wagner isn’t adding anything or putting his own spin on it, he’s just lifting Lovecraft’s descriptions whole cloth. Indeed, the characters often speak of magic and demons with all the wonder and fear of a mechanic talking about rebuilding an engine.Moreover, the events of the story don’t really seem to touch Kane, to change him moment to moment. Of course, his immortality would give him an unusual point of view, and it’s certainly not unthinkable that he should feel disconnected from the world--jaded and detached. But even so, this jadedness does not seem to drive him, it does not modify his reactions, it simply leaves him blank. With Moorcock's Elric, we get the idea that he has grander desires that drive him, even if they tend to be personal ones, and he otherwise feels separate from the world.Now, if the intent were to explore the existential ennui of immortality, that could make for an interesting story, but the events of Kane’s life are very much the norm for a sword & sorcery hero--battles and demons, pirates and assassins. His own actions in this world are also very much the norm, so it’s not as if we’re being provided with some fresh outlook or approach to underscore his unique perspective.I was excited to try this series, based on it's reputation--a darker Conan, a modern take on Eddison's and Anderson's violent, blood-and-glory tales--unfortunately, the tone, characterization, dialogue, and plotting simply weren't up to the challenge. Ultimately, though Wagner is certainly reaching for what might be an interesting vision of fantasy, he never quite succeeds at bringing it to life, on the page.My Suggested Readings in Fantasy"}, {"userName": "Jim", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "Kane is sought out by a mad princess to lead her forces in a revolt against her king & husband on the recommendation of a demon. It goes about as expected with plenty of betrayal, killing, torture & gore to spice up the horror & sorcery. Truly a great S&S adventure. This also fills in a bit more of Kane's history that is hinted at in \"Cold Light\", the second story in Death Angel's Shadow.This is the Centipede Press edition. If reading this in chronological order, it should be read after \"Mirage\" in Death Angel's Shadow. See my review here for the full chronology:https://www.goodreads.com/review/show..."}, {"userName": "Algernon", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "Superb Cover. I've been meaning to read this ever since I saw a Kane illustration gallery on a Frank Frazetta site. while the florid language feels at times dated and I miss the humor from Fritz Leiber's Fafhrd and Grey Mouse series, I must admit that Karl Edward Wagner has style and can weave a truly disturbing tale in a rather tight package.I don't generally respond well to cynical world views and bloodthirsty heroes, but Kane has made a strong impression after only one book. While he is in some ways related to Conan or Fafhrd as a brawny barbarian killing machine, I think he should be considered separately for his special abilities, including magical talents and for his biblical backstory that is only hinted at in this first showing. I also think Tempus from Thieves World and Logen Nine fingers may have been inspired by Kane.The actual events in Darkness Weaves start as a classic sword and sorcery tale, with a meeting in a disreputable tavern between a drunken assassin and a nobleman in disguise, go from here to a tale of island empires in turmoil, love, treason and plots for revenge. Magical forces come to play a greater role in the second half of the book, builting up to a cataclysmic final confrontation that curiously made me think of Shakespearean tragedies, where wars decide not who wins but who is left to contemplate the desolation and to meditate on the darkness inherent to human nature.I would recommend this as required reading for any student of sword & sorcery and horror genres."}, {"userName": "Ctgt", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "I've been fascinated with Wagner for several years now, actually longer than that but I didn't realize it until recently. If you of a certain age you may remember The Science Fiction Book Club and their mail order catalogue from back in the day. I distinctly remember ordering several Conan collections and eventually figured out they were edited by Wagner.\n \n \nRemember?Anyway, Wagner used Fafhrd and the Gray Mouser and Conan as a starting point for his anti-hero warrior/pirate/sorcerer. Although none of thisTo crush your enemies, see them driven before you, and to hear the lamentation of their women. See, Kane is not only a great warrior, he's also got a head on his shouldersRegretfully he considered the priceless volumes of black knowledge which he had been forced to leave behind. Well, he had committed most of them to memory, and the Black Priest would recover them presently and return the accursed tomes to their niches within his shadowy vaults.Quite the combo don't you think?Kane made his name early on as a pirate so there are several sea battles and the requisite sword fights but this is not a non-stop action story. There is quite a bit of background laid out in the use of \"tales\" told by characters so don't expect to go from one fight to another. Wagner also throws in just a smidge of his eldritch love for good measure. It can also be pretty dark in spots, there is a scene where a character is chained to a bull so to be dragged through the streets of the town.I really enjoyed this book but I am a self confessed fan of Wagner so your mileage may vary but I think anyone who enjoys S&S would like this book."}, {"userName": "Paulo \"paper books always\" Carvalho", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/3789445-paulo-paper-books-always-carvalho", "userReview": "A writer in the wrong time. If he had lived in 1920/30/40 he would have been in the same league of Robert E Howard and H P Lovecraft and the lot. He was nihilistic, anarchistic and absurdist. He died because of alchool. I think that explains a lot. He sets his work (some of it) in the same timeline of Conan and Bran Mak Morn. He created a hero called Kane. This book is one of the three novels and three collections. This is the first of the tales. So what's good in it? Well Kane stories are set in a grim, pre-medieval world with rich in history. He is powerful, left handed and read hair and have said to killed his brother Abel (Cain and Abel anyone?) and cursed by a mad god with an eternal life of wandering. (again Cain and Abel?). He is vulnerable to wounds but heals fast. He is both a warrior and a sorcerer.Elric by Moorcock and Conan by Howard are heavealy influenced. But as I said this is an excelent character with both the brains but also the strenght. This tale was quite good to read. The history is these... The Thovnosian Empire is made up of several islands that join forces to destroy Red Kane but his body was never found. Now Efrel the mutilated ruler of Pellin intends to take over the empire and exact revenge on her enemies. Using dark arts she learns that Kane is alivce and due to his genius naval strategy is recruited and regards the all deal an unfinished business. There are some references to Kane past and indicated why Kane prefers violence when has other skills. Violence is an addiction. The dialogues are quite good and the reference to Efrel are quite disgusting (in a good way). In these tale don't expect good hearted characters..."}, {"userName": "Jason M Waltz", "userReviewDate": "Dec 02, 2013", "userURL": "http://www.goodreads.com/user/show/1744326-jason-m-waltz", "userReview": "Enjoyed another tale of Kane, learned a bit more of the man, and found myself readily enthralled by his plots and machinations. It was nice to see him interact with a friend of sorts throughout the entire story. Definitely good to see him triumph once more, but I experience mixed emotions when he yet again stumbles at the moment of his own personal triumph. As he says, \"It's a game I play. An old game with an old enemy.\" While he's a scoundrel with black heart as black as any and blacker than some, I find it would be appealing if he were to actually win out once, allow us witness to his rule.A good, strong read that offers testimony to Wagner's Gothic horror foundation while not quite distancing itself from the riddle of steel he apparently found so lacking. Kane is much more than at first he seems (or those awesome covers lead some to believe), but in the end he still is a man filled with the hot-blooded passion to survive and the might and skill to ensure he does.Read Kane and find out what real grittiness is."}, {"userName": "The_Mad_Swede", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/915296-the-mad-swede", "userReview": "This is the first of Karl Edward Wagner's Kane books (in its full edition, as restored in 1978), but the second one I've read (since I quite accidentally managed to start with book four a few years ago).This particular novel tells an epic story of conquest and revenge, as the mad sorceress Efrel seeks righteous vengeance upon the Emperor of the Thovnosian empire, Netisten Maril, to whom she was once married. Aided by supernatural forces, Efrel is recommended to seek out Wagner's brilliant anti-hero Kane to lead her earthly rebel forces. And Kane, with a dark and sordid past, has other reasons to ally himself with Efrel.As I wrote with regards to The Dark Crusade, there is a resonance of Robert E. Howard (and other high grade pulp writers) in Wagner's prose, while the novel at the same time positions itself as part of the reinventing tradition of authors like Michael Moorcock and Fritz Leiber.All in all, a really enjoyable read. Of which the least is not the section that splendidly delves into Kane's past in a fragmented manner of hints and innuendo. Highly recommended!"}, {"userName": "Jamie Underwood", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/26504804-jamie-underwood", "userReview": "A Tale of high adventure and sorcery. Kane is a heavily endearing character; his brutality and deceptiveness is countered by a sophisticated and learned mind. His evil appears lessened somewhat only because the Characters in the book surpass even Kane's constant intent for domination through brutal conquest. Its hard not to like Kane, and in this novel we find Kane with a companion, a friend, which he has not had in the previous novels, and it is interesting to find him able to trust in an ally. This novel also gives the most detailed references into Kane's actual past and the adventures across a vast breadth of time he has endured in his wanderings. I have found the two previous Kane novels by KEW extremely enjoyable and Darkness Weaves definitely met my expectations from this talented fantasy writer, coupled with another fantastic illustration by Frank Frazetta. A true master of the genre, KEW's Kane stories will delight any Sword and Sorcery fans. Enjoy!"}, {"userName": "Karl", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "This is copy 40 of 300 signed and numbered copies. Facsimile signed by Karl Edward Wagner and signed by Bram Sels."}, {"userName": "Derek", "userReviewDate": "Dec 19, 2010", "userURL": "http://www.goodreads.com/user/show/1769635-derek", "userReview": "Before the involvement of the Scylredi, this it is a well-crafted but otherwise typical sword and sorcery story of human-scale treachery and trickery: everyone involved seems to be sharpening a knife for the inevitable plunge into an ally's back. There is the standard dark magic by the vengeance-obsessed evil queen (though 'evil' here is an entirely relative concept), and the bloody battles, the assorted cast of unsavory characters, and an empire to be forged.Wagner dips into Lovecraftian oeuvre, adapting the Elder Things of \"At The Mountains of Madness\" into the Scylredi, the aquatic prehuman beings of Elder Earth, who in recent eons have fallen on hard times, retreated into the deepest parts of the sea, and forgotten much of their learning and technology. The introduction of their backstory and super-science gives the setting far more texture and lifts it completely out of the ordinary, especially when I was expecting little more than the usual tropes of gritty fantasy. Unfortunately, they are little more than the hired guns of the evil queen; after all the backstabbing done by the humans, I was expecting them to do the same."}, {"userName": "Nicholas King", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/8796486-nicholas-king", "userReview": "As I read Karl Edward Wagner’s Darkness Weaves, I was struck by the familiarity of the setting. The pre-industrial (and possibly post-apocalyptic) world of Kane, the Mystic Swordsman, is classic sword and sorcery with malevolent witches, blood-soaked battles, and a plethora anti-heroes. This is not “high fantasy” of the Tolkien or Brooks variety where the heroes are virtuous and good triumphs over evil in the end. There is no limit to the action, moving from thrilling violence for its own sake as well as enough titillating (and transgressive) sexuality for anyone who prefers more adult-fare in their fantasy. To read the rest of this review, please visit The King's Crier: Book Reviews blog: http://kingscrier.blogspot.com/2012/0..."}, {"userName": "Tim", "userReviewDate": "Jul 15, 2009", "userURL": "http://www.goodreads.com/user/show/978026-tim", "userReview": "Reread this book after finding it in an old box of mine my parents gave me after cleaning the grandparent's attic. Kane is a fantasy anti-hero. Barbaric in his actions, if not his orgins, evil not in the small details of life, but in his general abandonment of any standards or measurements outside his own personal gain. Saying all that, Wagner makes him likable, or at least intriguing, and you can cheer for Kane because in the world he inhabits the choice does not seem to be between good and evil, but between greater and lesser evils. It does not diminish Kane to say that in this book he is the lesser evil."}, {"userName": "Charles", "userReviewDate": "Jul 17, 2008", "userURL": "http://www.goodreads.com/user/show/1336573-charles", "userReview": "Karl Edward Wagner's \"Kane\" is a great character in Heroic fantasy. Personally, I think he's the best character ever. This is one of the very early Kane novels, orginally published as \"Darkness Weaves With Many Shades.\" It's a very good introduction to the character."}, {"userName": "Timothy Boyd", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/22819383-timothy-boyd", "userReview": "This is one of my favorite dark fantasy series. Kane is an excellent anti-hero, not really good but not entirely a bad guy either. Excellent story and character. Highly recommended."}, {"userName": "Mike", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/2039167-mike", "userReview": "I continue to enjoy reading the books about Kane. Personally, I enjoyed him having a psuedo side kick in this one in Arbas, a character that could have been (though it's fine that he wasn't) more developed to be fun. But of course with Kane's immortality and distance of centuries between stories, there is no need for another character to be around him all the time. The book is very well written and I enjoy deeply Kane's bloodlust and pureness of evil. It seems that Kane fights for others nations just to destroy them in the end, because destruction and death are his realm."}, {"userName": "Steven", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/3669123-steven", "userReview": "It's a shame these aren't republished, kind of hard to get your hands on it. I liked the book, it's definitely not high-brow, and but very entertaining nonetheless. Even though Kane is kind of a Gary Stewart. But that's on particular with the genre maybe, Kane is like Conan, and but with more tricks on his sleeve. Also really didn't expect but digged the Lovecraftian horror. I wonder how the rest of the books are."}, {"userName": "Martin", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/10536918-martin", "userReview": "Karl Edward Wagner's Kane is a fascinating hero, or rather anti-hero - like Conan, but with higher intelligence, and some magical abilities as well. He is cursed with immortality and often does things out of sheer boredom. And as this book suggests, he may or may not be Cain from the Old Testament. This, the first Kane novel, is a great introduction to the character."}, {"userName": "SmokingMirror", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/18521494-smokingmirror", "userReview": "Woohoo, the book concludes in a massive battle with a gratifyingly large number of betentacled beings leading the way! I like the intelligent, ambulatory ones the best. Like many fantasy battle scenes, things get a bit generalized and gore besplattered, not that Wagner's prose undergoes a decline in his descriptions of the dark events. A very atmospheric read."}, {"userName": "Craig Rettig", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/2172311-craig-rettig", "userReview": "Fans of Conan need to check this book out, as Wagner writes some brutal fight sequences and has a good imagination for multiple-person battle scenarios. There are also several decent subplots working in this book at all, which is surprising given its short length.All in all, this is a tightly-written book that I really enjoyed."}, {"userName": "David", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/4647751-david", "userReview": "An absolutely perfect novel. Could not ask for any more in a Sword and Sorcery tale. I can see why this is such a cult classic. If you are interested in Fantasy, you have to read this one. What I don't understand is why it is out of print. Shameful."}, {"userName": "Suzanne", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/1423386-suzanne", "userReview": "Like Conan, if Conan was smart."}, {"userName": "J. Weichsel", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/67943382-j-weichsel", "userReview": "I don't believe there's such a thing as a \"guilty pleasure,\" because I think that you either like something or you don't and there's nothing to feel \"guilty\" about either way, but if I did believe in guilty pleasures, Darkness Weaves would be a great example. Man oh man, it's so trashy you can't help but be entertained. The climax involves a witch performing sorcery on a nude damsel, earlier a damsel is raped and impregnated by a Lovecraftian sea monster, there is a battle scene between a fleet of ships and sea monsters, and there is sex and awesome gore throughout. Darkness Weaves is the first book Karl Edgar Wagner wrote in his Kane series, but wasn't published until many years later, and is listed as the seventh book in the series. I've read better books in the Kane series, but this gets high marks for entertainment value. The Kane series is inspired by Howard's Conan series, and is about mankind's first murderer, who is cursed with immortality and wants to conquer the world. He's pretty much the ultimate anti-hero."}, {"userName": "StrangeAeons", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/69492657-strangeaeons", "userReview": "Kane is the good guy bad guy. While Kane is certainly more existential and morally aware than Conan, that doesn't make him any less violent, nihilistic, sexual, and disturbed. Good and absorbing. Particularly brutal battle sequences.I had more fun reading it than I did Robert E. Howard's Conan but it's not as good as George R.R. Martin’s A Song of Ice and Fire."}, {"userName": "Canavan", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/2140589-canavan", "userReview": "✭✭✭✭½"}, {"userName": "Scott", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/11823093-scott", "userReview": "Solid Kane adventure. Mostly sword, some sorcery. Good villain, good allies, twists and turns. I enjoyed it. Thick prose, but good writing."}, {"userName": "Lee Broderick", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/6078800-lee-broderick", "userReview": "I avoided this book for a while, wary of a biblically inspired protagonist from a Bible Belt author. That wariness, I now realise, was unjustified, even if I might like to flatter myself that it was understandable. Why shouldn't the Judeo-Christian mythos be any less fertile a ground for cultivating fantasy tropes than the Ancient Greek or Germanic legends? The answer, as I probably would have acknowledged before, is that there's no reason - it just requires the right author and that was what made me wary. Neo-Wiccan fantasy writing probably annoys me just as much as any Christian fiction would. In truth, Kane is a great character set in a world that is inspired almost entirely independently of his own mythological roots - Robert E. Howard and H.P. Lovecraft are obvious touchstones.Karl Edward Wagner begins to explore some of the boredom, ennui and detachedness that must surely accompany immortality. This is something that must be obvious to most people who've ever given the condition much thought and yet it's so often presented as an unquestionably good thing in fantasy literature that its treatment here stands out. Kane is also an anti-hero in the truest sense; his morality is skewed, as it very probably would be by his detachedness anyway if it weren't a generator of his curse. Kane is driven unapologetically to materially improve his own condition. He's also more than just a thug - time and intelligence have combined to give him the opportunity and potential to nurture both physical and intellectual (including sorcerous) powers to a high degree, making him a formidable being. This is a bleak, black story, however: the good guys do not fare well and even Kane can only make decisions based on imperfect knowledge which can lead to his decisions backfiring.If the character of Kane is promising, however, his dialogue is not: I was exasperated every time I read a 'yeah' or a 'like'. It would be unfair to say that these speech patterns are anachronistic - how could they be in a make-believe setting? They still jarred with me though but perhaps that's simply a reflection of my Britishness (I confess it was eye-opening for me to discover that 'like' in particular was already a part of the U.S.American vernacular in the 1960's). If Michael Moorcock could decide to introduce his most famous creation to Wagner's though then the books can't be without any literary merit and the fact that the book managed to entertain hints that the prose between the dialogue wasn't quite as bad - despite showing an occasionally stereotypically fantasy-writer's love for the overly florid.A little research after reading the book shows that I started in the wrong place. It seems the Kane series on GoodReads was organised according to publication date but it turns out that, chronologically, this is the last in the series - I've now updated the series here, including all known works, to reflect this. \nNight Winds\n seems to have a better reputation than this and so I'll be reading that and hoping the style improves to match the potential. In truth, what could I expect of a book that (again, discovered after a little more research) was not only the author's first attempt but was first published as crudely editted weird-porn?"}, {"userName": "John", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/8101733-john", "userReview": "So, I have to start this out saying I own most books Karl Edward Wagner has written and multiple copies of all the Kane books including two copies of \"The Book of Kane\" (one is signed number 400 something). I'm a bit of a fan. I ran across an old copy of \"Night Winds\" in Ensenada Mexico when I was in junior high school and have been collecting Kane books ever since. This is the second time I have read \"Darkness Weaves\", the first time I was in my late teens / early twenties. My goodness it's good. This time I appreciated the writing style much more. At times Wagner flows his writing every bit as well as Lowry or McCarthy all the while Kane is bashing people to pulp. Is it predictable, yeah. Is it gory at times, yeah. Is there gratuitous sex, yeah. Is it just lots of fun, heck yeah!I would recommend this to lots of men and few women. I would also recommend you read it like I did this last time, a chapter at a time here and there in between and along with other books. Savor it.\"Death Angle's Shadow\", you are next.Thank you Karl Edward Wagner, rest in peace, you are not forgotten."}, {"userName": "Chompa", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/729626-chompa", "userReview": "A while back I read that Karl Edward Wagner was the spiritual successor to Robert E. Howard. Kane is Wagner's most famous character as Conan is Howard's. I can certainly see where the comparison comes from and can even agree. Is Kane as good as Conan? Well, not for reading purposes in my humble opinion, but this book wasn't bad. In Darkness Weaves, we find Kane hired to be a general for an attempt to overthrown a distant Empire based in some islands. The person who hires him was horrifically crippled by the Emperor and is plotting his demise. I'm not going to go further into the plot. The writing was at times brilliant (there is a scene describing Kane's hideout at the start of the book that comes to mind) and other times where it just seemed to drag. Overall, the story was pretty good and it had a good Sword and Sorcery feel to it. Kane was an interesting character and I liked that we really didn't get much of what was going on in his head until he'd either do something or explain it. Overall I enjoyed it, but was not amazed by it."}, {"userName": "Jerry", "userReviewDate": "Dec 23, 2011", "userURL": "http://www.goodreads.com/user/show/5442180-jerry", "userReview": "Do you love sword and sorcery fiction? Do you enjoy anti-heroes pretty much destroying the world with a weapon in each hand? Not opposed to a redhead? Then don't wait, but dive in! You're in for a treat.Darkness Weaves was all I hoped it would be. Wagner provides us an interesting anti-hero, but one who will fail to elicit any sympathy. That's okay, because he's great at killing. The settings are atmospheric and the writing style is perfectly matched to bring out the oh-so eldritch decay of it all. Great stuff.Unless this is the first book you've ever read, the story will be predictable. Don't go into it expecting to be kept guessing. Read it for action and adventure, and a chance to visit a strange world filled with sorcerous evil ripe for smashing."}], "description": "Once Efrel was the beautiful consort of a king. Now she is a hideous creature who lives only for revenge. She has allies to aid her, but only Kane, the Mystic Swordsman, can rally her forces for battle. Only he can deliver the vengeance she has devised in her knowledge of black magic.", "title": "Darkness Weaves\n      \n          (Kane #7)", "url": "http://www.goodreads.com/book/show/715277.Darkness_Weaves", "average": 4.04, "cover": "https://images.gr-assets.com/books/1386358871l/715277.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/88014.Karl_Edward_Wagner", "name": "Karl Edward Wagner"}], "type": ["Fantasy", "Heroic Fantasy", "Fiction", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/715277.Darkness_Weaves", "http://www.goodreads.com/book/show/23282167-darkness-weaves", "http://www.goodreads.com/book/show/4291522-darkness-weaves", "http://www.goodreads.com/book/show/22855526-darkness-weaves", "http://www.goodreads.com/book/show/152245.Conan", "http://www.goodreads.com/book/show/715276.Bloodstone", "http://www.goodreads.com/book/show/715274.Dark_Crusade", "http://www.goodreads.com/book/show/216549.Death_Angel_s_Shadow", "http://www.goodreads.com/book/show/1695319.Night_Winds"]}