{"ratings": 1133, "userreviews": [{"userName": "Amy", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/11067136-amy", "userReview": "In a sweet nutshell, this book is horrible.The story focuses on Ellen, a flippy drippy bore with completely fucking warped perceptions of motherhood.Ellen is 35, lives in New York, works for a designer as a Marketing Exec and wants to have a baby. That's it. She seems to want NOTHING else out of her life! She hates her job, her boyfriend is an impotent car wreck of a human being (so head's up, if you're looking for sex in this book, it ain't happenin')!! The only thing she seems to care about, is her 4 year old diapered niece \"Pickle\". Yes, she calls the kid pickle! I'll get to THAT irritating shit in a minute.I think the most disappointing thing about this book is that Ellen is the most unlikable character! She's the kind of girl I would cross the street to avoid. When she's not focused on how fat everyone else is (all mothers by the way, catty bitch) she's hating them for being able to have a baby! Her life means nothing to her unless she can have a baby. What century are we in??? Plus, she doesn't even seem to care that her boyfriend won't fuck her!! I mean, I see that the author is trying to make her all sensitive and such and that their relationship means more than sex (blah blah blah), but seriously any other woman would be going out of her mind!!! Ellen just sort of mentions it at times, like he keeps forgetting to bring milk home. Seriously?Um, also, if you're desperate to have a baby you kind of need a man with a working penis!!And now the \"Pickle\". I'm sure she's cute and all, but has anyone realized this four year old is still in pampers??? The over the top sticky sweet moments between her and her niece were enough to make me gag. She even found her pitching a fit and screaming at the top of her lungs adorable. Who does that?Maybe I'm just not as sensitive to \"motherly\" desires, but as a 35 year single woman myself, I'm pretty happy with my career, family and social standing. What this woman is dying for, I just can't relate to!I mean the writing itself isn't bad, I just found the characters so empty, whiny and annoying. Sorry, but two thumbs down for me."}, {"userName": "Raina Tellado", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/23925803-raina-tellado", "userReview": "I think the reason that this book was so extremely disappointing was because I expected the story line to be about someone who actually dates Big Bird. What I really read was an annoying story about a woman who just wants to get pregnant. Not only was it cheesy and predictable and so far away from being my kind of a book, but I found some of the remarks to be offensive. \"fag\" and \"retarded\" were used surprisingly often and I got pissed, not gonna lie. This was just an annoying piece to read and I can't wait to move onto something different and get back into my genres of literature. I don't recommend this to anyone."}, {"userName": "Lauren Fidler", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/2072335-lauren-fidler", "userReview": "2.5this is the sad story of a woman who apparently works in marketing for a famous fashion designer but hates her job because she not-so-secretly wants to be knocked up. so desperate is this woman for her own bebe that she is willing to use her niece (\"pickle\") as a cheap knock-off just to get a fix. she makes friends with a former acquaintance from high school who also uses her nephew to play \"mammo\". you can't make this shit up.well, apparently laura zigman can. complicating the plot:1. the protagonist dates a \"impoholic\" - an impotent, recovering alcoholic2. everyone else around her is uber-fertile and pregnant - boss, sister, co-workers, etc3. she has to plan a baby shower gift for her boss4. she's 35 and thinks big bird is the ideal matesigh. mindrotteriffic."}, {"userName": "Michelle", "userReviewDate": "Jan 18, 2008", "userURL": "http://www.goodreads.com/user/show/512643-michelle", "userReview": "I didn't like this much as Zigman's novel Animal Husbandry, but that might be because the story is about a successful single woman who is desperate to have a child. I could not really relate to the desire as my biological clock has never worked."}, {"userName": "Nina Draganova", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/20038488-nina-draganova", "userReview": "Съвсем случайно попаднах на тази книга, не знаех че има издадена на български друга на авторката. Бях забравила какво приятно чувство за хумор има. И тук отново то се проявява с пълна сила. На пръв поглед това е елементарна , повърхностна , чиклитеска история :) За най-нормалния стремеж на една жена , която клони към края на детеродните си възможности, да има семейство или поне само дете. И за нейното решение в крайна сметка да поеме риска на самотното майчинство.Но тази книга ме наведе на размисли , докъде стигна човечеството. Как докарахме всичко до унисекс. Как сме стигнали дотам , да се лишим от най-ценните взаимоотношения и ги заместваме по всякакъв начин, все по-често."}, {"userName": "Lynnette Dobberpuhl", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/4914745-lynnette-dobberpuhl", "userReview": "I liked this book. It struck me as an honest look at the conflicts many modern women face with relationships (or lack thereof,) childbearing and career. However, I had difficulty sympathizing with the main character and I am not sure if it is because my own reproductive situation was so completely different, or if it was because she struck me as somewhat more self-involved than the average young woman thinking about committing herself to a life as a parent. Still, the world Zigman created and the characters within pulled me along to the ending."}, {"userName": "Kenzee", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/5304615-kenzee", "userReview": "Wow this book was stupid. The characters were shallow and impossible to relate with. The ridiculously convenient ending just pissed me off."}, {"userName": "Michelle Pichon", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/39905082-michelle-pichon", "userReview": "RequiredOne two three four five six seven eight nine ten eleven twelve thirteen fourteen fifteen sixteen seventeen eighteen nineteen twenty"}, {"userName": "Ellyn (Mrs. Darcy in my Dreams) Robison", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/26386063-ellyn-mrs-darcy-in-my-dreams-robison", "userReview": "3.5 funny!"}, {"userName": "Trish", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/2546812-trish", "userReview": "just ok.... the ending was all too convenient for me."}, {"userName": "Margaret", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/10549695-margaret", "userReview": "Sure, Ellen Franck was excited when her sister became pregnant but she never counted on falling head over heels in love as a result. The minute she held her newborn niece, Nicole (known as Pickle) her heart was stolen and she knew what it was that she was missing in her life. Ellen, 35,hates the term of \"biological clock\" but she knows that her chances of having a child of her own are diminishing as each day passes. She is in love with a gentle man and has been in a relationship with him for over a year; but he is broken. Divorced after the death of his son, he lost the ability to be intimate with anyone. He will not risk another love, another child and when Ellen asks him point blank to help her have a child, no strings attached, the relationship crumbles.Ellen ponders and researches and discusses with her friends and her sister her options. She knows to have a child as a single parent would not be easy for her or for her child. Should she follow her heart and go forward with \"artificial\" means of becoming pregnant? Ellen does not make her final decision lightly and as Ellen becomes informed of the details of artificial insemination and its pros and cons, so does the reader.The title and cover of this book made me think I was going to read a side-splitting, laugh out loud comedy. While I did smile and chuckle, I found the book to be a tender and wistful story of many women like Ellen who, rather than settle for a male partner as a means to an end, want to have a child even if it means going it alone.I loved the characters in this story and how they came to life as people I would enjoy knowing and having as my own friends. But the character who stole my heart, just as she did Ellen's, was Pickle. I don't know Zigman's personal bio, but she certainly knows children...at least toddlers and their ability to drive a person to distraction and at the same time melt your heart and make you laugh at the same time."}, {"userName": "Sheila", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/6400542-sheila", "userReview": "This book was...ok. Not too deep. About a modern woman, Ellen Franck, facing the age old insurmountable problem: how do you find a marriageable husband in order to have a baby? Ellen's biological clock ticks loudly away in her heart, and she takes cues from those around her-her sister her boss, her new friendship with a fellow high school alum, among countless other-on her quest to figure out her path. She has a fabulous job which is wearing on her, and a frozen boyfriend, Malcolm, who cannot seem to live up to her needs.In the end, Ellen makes a decision for herself, by herself, and everything (of course) falls into place.I liked that this book is an easy read. The plot, while very relatable to many women, is not all that compelling. And every character is really measured against the single-minded concern of our narrator, her interest in having her own child.I did not find Ellen believable as an aunt (who calls up their niece and nephews to revel in what he or she is wearing that day?), I found her family relationship weird, her single mindedness, weird, and frankly, a little boring...And really? Demi Moore? There are parts which are awfully convenient and contrived.The topic is not one to which I currently relate, but I have related, as I believe every woman has. I also think the way that women constantly measure themselves against others in pursuit of our womanly goals is accurately enough presented. In that reality, it does not make me proud to be a woman.This is the kind of book that makes me feel like I could write a big, and for that, Laura Zigman, I thank you."}, {"userName": "Susan Bazzett-Griffith", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/19421489-susan-bazzett-griffith", "userReview": "An interesting and less-stereotypical-than-usual take on the chick lit/ mommy-lit genre. Zigman's Dating Big Bird is surprisingly mature for a book of it's ilk. Her protagonist, a single career woman in her mid-thirties, wants a child, dotes on her niece, and finds a friend in a similar situation. She actually shows the character realizing and ruminating on her decision to have a child on her own throughout the entire book, rather than the normal go-go-go pace of these types of books. She considers all options, she continues to live her life, working, being an active member of her extended family, and listening to/considering all of the thoughts and advice of all the people around her. The book has characters representing all different kinds of mothers, and Zigman refuses to show any sort of favoritism to any of the characters' choices, which was refreshing. The reason I only give this book three stars is that, perhaps because of her careful handling of the subject matter, it was a little slow, and because the ending was more than a bit unbelievable. Honestly, this book screams- make a romantic comedy! Make this into a chick flick! And I didn't love that aspect of it at all and felt it took away from what could have been a more feminist-leaning/ empowering story. Dating Big Bird is a good read, though, for those who are into these kinds of books."}, {"userName": "Kimberly", "userReviewDate": "Feb 04, 2008", "userURL": "http://www.goodreads.com/user/show/851919-kimberly", "userReview": "Having three kids, I can fully relate to Ellen's (the main character who wants to be pregnant and have a child but has no way of getting pregnant) desire to have children. Those of us with kids will get a laugh out of the silly things she does while trying to decide whether to get pregnant and how to get pregnant. Not to mention the who. The whole working mother vs. stay at home mother delimna is really into play, and although it doesn't go into depth about which is \"better\" (although I don't see either as being \"better\" than the other, just different from each other), it does bring up the hot topic. I'm not sure I really liked the end and the last 50-75 pages seemed to summarize the end of the story instead of telling the story. There really may not have been a ton to tell at that point though. I don't want to give away too m uch here. :)I grabbed this book because I found it for less than $1 knowing nothing about it. Just the thought of \"Dating Big Bird\" was intriguing and very odd. There is no actual Big Bird in the story, just a stuffed one. I wouldn't spend a chunk of change on the book, but it was a fast read that offers a different point of view on a topic that I am so familiar with: motherhood."}, {"userName": "Adelaine Pek", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/36931580-adelaine-pek", "userReview": "I loved this!I enjoyed every page of it and it got me constantly laughing. It has a realistic feel to it and I liked how Zigman covers both side of perspective/opinions in matters (eg. becoming a mother). The story is exactly like how the synopsis said it, and despite not being in my thirties or at the stage of wanting to be a mother yet, I can fully understand the main character Ellen’s thought process.At first I picked this book up thinking, “Oh? Is the character going to date/have a romance fling with my favorite Big Bird from Sesame Street?” Then I realise how shallow minded I am. And I realise how incredibly genius the title DATING BIG BIRD meant. This book is not talking about dating the yellow character from Sesame Street; instead, using it as an expression, this book talks about choosing a guy who has the qualities of the Sesame Street character.Click here for full review: https://adelainepekreviews.wordpress...."}, {"userName": "Marnie", "userReviewDate": "Nov 21, 2008", "userURL": "http://www.goodreads.com/user/show/625210-marnie", "userReview": "I was really disappointed with this book. It's about Ellen, a single woman who wants a child. I thought I'd be able to relate to wanting a child so much, but she wants one for all the wrong reasons. Her boyfriend is a jerk, & after she dumps him & makes a fortune designing a stupid necklace for her boss she decided to go to a sperm bank. It's disgusting how they screen the sperm donors so they mostly have blonde, blue-eyed guys over 6 feet tall with above average IQ's & perfect family histories to assure that the clients get \"perfect\" children. From what I've heard that's how it is in real life too. Also, it was odd that Ellen's 4-year-old niece still talks baby talk & is not potty trained, & no one was worried about that, I dont think the author knew very much about children. And I wont give away the ending but I will say it shows what bad judgement Ellen has & that she probably wont be the best mother."}, {"userName": "Patricia", "userReviewDate": "Aug 13, 2009", "userURL": "http://www.goodreads.com/user/show/664515-patricia", "userReview": "I have no desire to have children and thus, was at a disadvantage with this book. The main character is obsessed with having a child. The fact that she is in a relationship with a man who wants no children, and shows no signs of changing that view, is one of the conundrums of the plot.I couldn't relate to the main character. I found the story annoying. I found the writing style in which the author repeatedly uses:Many very short.Sentences like this.Over and over.Again.to be very distracting. The plot point at the end of the book, which is the catalyst for change in the protagonist's life, I found to be entirely unbelievable. Why not just have her win the lottery? And the last chapter? Total cop-out.There was nothing redeeming about this book and only an incredibly lazy day got me to finish this book. I was too lazy to start a new one. Not recommended."}, {"userName": "Leena", "userReviewDate": "Mar 17, 2010", "userURL": "http://www.goodreads.com/user/show/3450420-leena", "userReview": "Very satisfying read, a quick one too, and often hard to put down. This story is a mixture of wry humor, psychological insight, and dreams of the best possible outcome ever. Like others have said, the ending was a bit too dreamy, too \"perfect.\" My only criticism is that it actually would have been much more satisfying if the ending had been written differently. I liked that this author opened up the door to accepting single motherhood by choice, but then regretted seeing her almost compulsively throw Ellen into a couple RIGHT before the end of the story. Would have loved to see Ellen stay single but hopeful, to see her joyful at her approaching single motherhood while raising the bar for that special someone who may enter her and her child's lives."}, {"userName": "M", "userReviewDate": "Jan 15, 2010", "userURL": "http://www.goodreads.com/user/show/32819-m", "userReview": "An uneven novel that doesn't compare to her previous effort, Animal Husbandry. I still think Zigman is one of the more intelligent chick-lit writers around, but it seems she gets a bit lazy with this one. The descriptions of the relationship the main character was in resonated with me more than the whole I-want-a-baby-sooooo-bad stuff, but even so, I was a bit annoyed at how unrealistic things became, particularly towards the end. I will say I was surprised by the ending, but that's just me, once again, comparing it to Animal Husbandry (much better, imho). So if you want the good beach read, go for that instead."}, {"userName": "Candice", "userReviewDate": "Aug 19, 2007", "userURL": "http://www.goodreads.com/user/show/289983-candice", "userReview": "I'd read Animal Husbandry, by this same author, and liked it, so I bought this one when it was on the bargain books aisle at Barnes & Noble. To the extent that I paid $4 for a hardback (which I always love), I liked it okay. The author has some funny, quirky ways she writes things, which I like, and I don't recall too many (any?) other books about a woman wanting to get pregnant via articial insemination, so it gets points for a different topic. The ending is a bit nauseating to me, but they gotta wrap it up in a nice bow, I guess....I liked Animal Husbandry better than this book, but hey, I got this one cheap."}, {"userName": "Marie F", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/38193046-marie-f", "userReview": "More a 2.5 than a 3, but it was an amusingly awkward book. I am not much on romance books but the humor made it quite a bit more bearable than typical or expected (though I doubt all the \"humor\" was intentional). I doubt I would read anything else by this author, this main character just tickled my sense of humor. We needed a romance book for a reading challenge in my group a few years back and this had a curious title. Occasionally it is fun to read things other people I know enjoy, to be able to discuss... this fit the bill nicely as it was tolerable enough, but not so captivating that I'd be tempted to read ahead and need to beware of spoilers when speaking."}, {"userName": "Ellie", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/9368634-ellie", "userReview": "This book offers insight into a very real conflict among modern women, who struggle to balance finding a man, building a successful career, and raising a child (or children). While there were parts of this book that were humorous and relatable, I could not connect with the main character, who was desperate to have a child in order to become happy. Interestingly enough, along the way she also falls in love and becomes rich/famous, so it is impossible to say whether said baby actually improved her life or \"having it all\" was responsible. In either instance, this seemed to be too much like a fairy tale for me to appreciate."}, {"userName": "Maria", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/1396560-maria", "userReview": "This one was OK. The concept wasn't bad: a mid-30s singelish woman living in NYC really wants to be a mother. Unfortunately, the way the story unfold wasn't that great, and the events didn't always flow smoothly. I think this could have been a much better story if the writing had been more cohesive, and perhaps if it wasn't the story of a woman working in the fashion industry. That made me feel as if the story should have been funnier, since all books with the fashion industry as a \"character\" have some element of humor to them."}, {"userName": "Kelly", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/554932-kelly", "userReview": "I picked this up the night I finished Zeitoun to try and give my brain a break. It has (or could have) a serious side becuase it looks at an issue facing many of use (to have kids or not, can you do it by yourself, etc.) but it is so glossed over by the lame character development that I think it is just a letdown. This is a reread from back in grad school. I had forgotten most of it, the section I thought was completely stupid when I first read it still came across just as stupid, and it led to the downfall of the book."}, {"userName": "Amanda", "userReviewDate": "Apr 17, 2008", "userURL": "http://www.goodreads.com/user/show/713172-amanda", "userReview": "While this was an interesting look at the decisions some women face, I really didn't like it in the end. It seemed too easy, too wrapped up in a nice neat ball... And I can say as a sister and mother that I don't think I'd ever give the advice to go it alone when having a child, but maybe that's just me. That said, it's got humor and some interesting character types. Setting up the conflicts was great, very believable, but the climax and resolution left something to be desired. I guess reality maybe?"}, {"userName": "Kirsty", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/3138068-kirsty", "userReview": "Sometimes, I like to buy secondhand books with ridiculous names. Sometimes they turn out to be great, other times - not so much. This book definitely falls into the latter category. It is a quite frankly bizarre story that ends as abruptly as the stories I used to write in primary school, as if even the author got tired of it by the end. The main character comes across as desperate and pathetic, and more than a little odd - the kind of odd that makes you feel slightly uncomfortable as you read. Totally a waste of 2 hours I'll never get back."}, {"userName": "Roxie", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/10975215-roxie", "userReview": "I am not, on the whole, a big fan of the chick lit genre. Oftentimes, I feel like if you've read one book of this ilk, you've read them all.But this book was a pleasant surprise. Ellen actually felt like a real person, and her relationships - with Amy, with her sister and mother, with Karen - actually felt believable. I found myself getting very invested in the story and in Ellen's struggle with the idea of having a child on her own.And while I wish the epilogue had been developed into a much larger part of the book, I was satisfied by the ending."}, {"userName": "Cathy", "userReviewDate": "Mar 19, 2009", "userURL": "http://www.goodreads.com/user/show/1788502-cathy", "userReview": "I went through a phase reading about young women with glamorous NY jobs (Death by Prada, etc.) when I was stuck in an very unglamorous job on Long Island! I read this before I had kids, and remember thinking no one would be as crazy over it as she was, but if I read it now I'd prbably be more in tune with the story. I can remember if that I did think parts were funny enough to read Animal Husbandry after it..."}, {"userName": "Rebecca McNutt", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I didn't really find this book very funny, just weird. And It was really difficult for me to sympathize with the main character. The guy she's married to isn't really a bad guy, but she doesn't like him because he's too occupied with his thoughts to get t on with her and she wants a baby? And she isn't even concerned about why he's distant, she's just too busy dreaming about having a baby... and I found the jokes to just be very strange and eventually boring."}, {"userName": "Betsy ", "userReviewDate": "Aug 27, 2007", "userURL": "http://www.goodreads.com/user/show/136927-betsy", "userReview": "This is an interesting book, but the storyline isn't all that realistic. If you're looking for a moderately entertaining beach read, this might be a good choice. It's a cross between devil wears prada (main character works in marketing for a designer) and some other books like this. Character's goal is to have a baby, no matter what."}], "description": "Ellen Franck isn't in love with Big Bird. After all, he's a big yellow Sesame Street character -- and she's an intelligent single woman with a fabulous job. On the other hand, Big Bird is looking like a better candidate for fatherhood every day: he's tall, affectionate, and steadily employed. And right now, for Ellen, thirty-five years old and dying to have a baby, almost any father will do.In her hilarious and heartbreaking new novel, Laura Zigman, bestselling author of Animal Husbandry, explores what happens when the life we've chosen isn't that life we expected it to be. And at this point Ellen Franck is rethinking all her choices. Mired in a relationship with a man who is better at brooding than breeding, sister to a woman who can't seem to stop having babies, and working under a boss who is about to have the baby shower of the decade, Ellen knows the path to motherhood is clear. All she has to do is leave her relationship, horrify her family, find an anonymous father, and become independently wealthy.Piece of cake.", "title": "Dating Big Bird", "url": "http://www.goodreads.com/book/show/136268.Dating_Big_Bird", "average": 2.99, "cover": "https://images.gr-assets.com/books/1320438083l/136268.jpg", "reviews": 126, "authors": [{"url": "https://www.goodreads.com/author/show/78787.Laura_Zigman", "name": "Laura Zigman"}], "type": ["Womens Fiction", "Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/136268.Dating_Big_Bird", "http://www.goodreads.com/book/show/20422850-dating-big-bird", "http://www.goodreads.com/book/show/136270.Animal_Husbandry", "http://www.goodreads.com/book/show/136266.Her", "http://www.goodreads.com/book/show/136267.Piece_of_Work", "http://www.goodreads.com/book/show/31935384-trogen-tjur-s-kes", "http://www.goodreads.com/book/show/6012776-get-over-yourself", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}