{"ratings": 53, "userreviews": [{"userName": "Erin", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "This book isn't set to be published until September, but I just couldn't wait any longer to crack open its pages.  Well, it didn't disappoint  Set against the backdrop of the American Civil War and then later, the involvement of the Union Army in the settling of the West, this historical fiction is absolutely  spellbinding.  The action in this story begins right away as Cathy is taken from her plantation by Philip Sheridan of the Union Army and recruited to work as a cook's assistant. Vowing to one day be reunited with her mother and younger sister, Cathy is outspoken, hard working, and the perfect historical fiction protagonist. She also finds herself constantly being mistaken as a man(due to her rather masculine features) and after the war is over, this does serve as a vehicle for Cathy to disguise herself and head out west with the Calvary. I think what really worked for me and  sustained my interest throughout  was how skeptical I felt when reading the synopsis of the story. Well, Sarah Bird certainly convinced me by providing many instances where \"discovery\" resulted in so many twists of fate. Add to the mix a really great cast of characters, some humour, romance, and a vivid portrait of 19th century America and it was truly a memorable story. One which will certainly have historical fiction fans intrigued.  Thanks to NetGalley for an advanced ebook in exchange for an honest review."}, {"userName": "Sharon Huether", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/3534528-sharon-huether", "userReview": "An amazing story of a womans courage, determination and fortitude. She, Cathy Williams joined up with the Buffalo Soldiers after the end of the Civil War 1866-1868. She fooled all the men for two years, except the men she was in love with..At different times. One was killed and the other one crossed the Rio Grand into Mexico where he was safe from the U.S.ArmyJust before she was to make her escape her deception was found out.In the night she got away and joined Wayne Swazye in Mexico.I received this Free Book from Goodreads First reads."}, {"userName": "Stephanie", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/4519035-stephanie", "userReview": "General Sheridan and his soldiers were burning everything in sight and took Cathy Williams-a slave-off a plantation as contraband to be an assistant to the generals cook. After the war is over she enlists in the Union Army disguised as a man with the Buffalo Soldiers.I’ve always wondered how the Union Army was able to recruit/convince ex-slaves-right after the civil war- to become Buffalo Soldiers knowing what they were going to do to the Indians. It really has always baffled me. This story goes into that a little of that and explores the feelings of the Buffalo soldier’s feelings on this. The Union Army was not kind to the soldiers and I believe used them horribly.As I was reading this story, I was dreading reading about what was going to happen once they get out west-already knowing its history and the author gives you a vivid picture of their struggles and Cathy’s efforts to keep her disguise as a man.Daughter of a Daughter of a Queen is a top-notch historical fiction story, memorable characters, outstanding history details of its setting, conflict and I’m truly looking forward to more stories by this author.I obtained a copy of this book from the publishers through NetGalley for an honest review.I have rated this book five stars.Stephanie M. Hopkinswww.layeredpages.com"}, {"userName": "Christie«SHBBblogger»", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/6650940-christie-shbbblogger", "userReview": ""}, {"userName": "KayG", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/2329201-kayg", "userReview": "This is a remarkable work of historical fiction based on the life of Cathy Williams. She began her life as a slave, but was endowed with a proud knowledge of her African ancestors. She experienced the Civil War as a Union Army cook. After the war she hid her gender and became a member of the Buffalo Soldiers, an all black regiment who worked in the West. That story in itself is fascinating, but the details are riveting; I’ll not spoil them for you. There was much enlightening information: the challenges of blacks after they were freed; the treatment of the American Indians; life in the West; behavior toward women. I learned so much from this book. This is a powerful and important book, full of engrossing historical information and impossible to put down! However you should know that the talk is tough, and the cruelties are difficult to read, although they are not unnecessarily graphic. This book was provided to me by NetGalley in return for an honest review."}, {"userName": "Debi Samuels", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/34589326-debi-samuels", "userReview": "Powerful. This is the sort of books that they should read in schools as recommended reading. Human, emotive, touching and very raw. I could see this being a movie very easily because it's that good (in the way that a movie would ruin it likely). From a white, foreign, perspective the American Civil War and the continuing racial tensions have always been so difficult to understand because I grew up in a country where slavery was made illegal hundreds of years ago in a multicultural school where racism was never even considered or seen. I realize that's a privileged thing to say, but this book just illustrated so much of the historical pain behind the current problems that it seems so relevant. I especially liked the beginning where she illustrates that the stereotype of the southern black ex-slave is so strong to make people assume she's a fake and the part where she comforts the dying black soldier. You can see the transition from a certain naivete into a much harder woman just between those two points. A very dynamic read with developed characters. Great history."}, {"userName": "Heather", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/712719-heather", "userReview": "Oh my, this book is engaging and wonderful. So true to what happened to the slaves after the civil war ended. The North did not truly care what happened to the slaves. Most of them did not care one bit for the Africans any more then the Southerns did. The Northerns were just following orders and refuse to let the South leave the Union. Once the civil war was over there was nothing for the slaves. They were just kicked off the only home they had ever known and made to fend for themselves.I don't judge Cathy's choices cause in all honestly if I was in the same situation I would probably do the same thing. I admire her for surviving the way she did.The characters are all well written and the story line is amazing. You need to read this book. The strength of Cathy is amazing the only downside to the book is the very end. It does not end they way you think it should or would. I still have unanswered questions about the story and in some ways that makes it a wonderful book."}, {"userName": "Kay", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/29492477-kay", "userReview": "The Daughter of a Daughter of a Queen by Sarah Bird is a brutally honest, terrifying, thrilling, story of a young strong black girl taken by Union soldiers to be a helper for the cook with General Sheridan's army troop and her life as an adult. The fascinating story of her disguising herself and joining the Buffalo Soldiers for 2 years and the life she leads afterwards. It has a heart breaking ending.This story is written with heart, grace and warmth for this strong warrior of a woman. The best I've read so far in 2018!Definitely FIVE stars."}, {"userName": "Kim Cabrera", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/44638012-kim-cabrera", "userReview": "If you love historical fiction, you will absolutely love this book. It tells the tale of Cathy Williams, who was the only woman documented to have served in the U.S. Army with the Buffalo Soldiers. She hid her identity and served two years before she was found out. She was a real person and she really did this, but the novel is fiction based on her story. Still, it’s a wonderfully fascinating tale of a very courageous and bold woman. Her grandmother was a queen in Africa, but she was kidnapped and ended up in slavery in the southern U.S. Her daughter and granddaughter (Cathy) were born into slavery. The story begins during the Civil War, when General Philip Sheridan selects Cathy to come along with his entourage and be his cook’s helper. She is forced to leave all that’s left of her family, her mother and little sister. She sees the war end and her people freed, but then they have to find something to do. She was a cook’s helper, so she has skills, but she doesn’t want to be a laundress or a cook, two of the very few jobs that were available to women at the time. She and her friend, Solomon, who was the cook she worked for and who now wants to marry her, decide to go into the Army. Without giving away any spoilers, Cathy ends up enlisting in the Army alone. She is sent west, supposedly to fight Indians. But, the cowardly commander of her post has other ideas for the soldiers. The story has a lot of very tense moments. She’s a woman living in a very dangerous situation. She’s alone and has few friends and can really trust no one. The work is very hard and the conditions are really bad. Weather is hot and there is no shelter at the fort at first, since it was burned down. She constantly has to struggle to keep her identity hidden. To complicate things, some of the other soldiers bully her all the time. But she has great marksmanship skills and gains their respect eventually, but it doesn’t completely stop the bullying and harassment she has to endure for being “different.” Even though the men don’t know she’s a woman, they sense that she is different somehow. Her situation is further complicated because she met the man who is now her Sergeant previously, when she was on the wagon being transported to General Sheridan’s camp. He does not recognize her though. The tale is very complex and intricately woven. I was so absorbed in her story that I didn’t want it to end. I even went on Google to see if there is more information out there about her life. She’s a fascinating historical figure and one that I have never heard about before. It’s sad that our history books don’t tell the stories of people like Cathy Williams. She deserves a place in history. This book should be made into a movie so that her story can be shared more widely. The book was very well-written and I enjoyed the author’s take on the story. We don’t know all that much about Cathy Williams, but this book gives her interesting life a new audience and hopefully will lead to more research so we can learn more about her. I think this book would be appropriate for history classes since it presents a first-person look at the Civil War, the Buffalo Soldiers, and life on the frontier. It also shows how poorly the black people were treated by just about everyone they encountered in those days. They may have gained freedom, but they were still in a bad situation. The sort of insider’s view that a reader gets in a book like this is invaluable for teaching these lessons. High school students should read this book because it will help them gain a new perspective that they can’t get out of a dry, boring textbook. I highly recommend it."}, {"userName": "Vicki", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/34641535-vicki", "userReview": "This compelling,well-told tale tracks the life and struggles of the only know female Buffalo Soldier. Author Sarah Bird vividly, sometimes painfully, captures the inhumanity, racism, sexism and danger Black Americans faced during and after the Civil War, especially the precarious fates awaiting Black women.Told in first person narrative, Bird imagines the life of former slave Cathay Williams, a girl who is torn from her family to be a cook's helper for the Union Army during the Civil War. When the war ends, she faces bleak prospects as a Black woman and decides to flip her name to William Cathay to enlist in the U.S. Army as male Buffalo Soldier after the war. This is an often violent, sometimes heartbreaking story right to the end.As with all historical fiction, readers need to remember that this is, indeed, fiction. The author places Williams in the 9th Cavalry while the real William Cathay enlisted in the infantry. Other details are altered for the sake of the story. But what a story it is. What a riveting read right to the end.I received an ARC from the publisher through NetGalley"}, {"userName": "Mona  AlvaradoFrazier", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/4981624-mona-alvaradofrazier", "userReview": "“Here's the first thing you need to know about Miss Cathy Williams: I am the daughter of a daughter of a queen and my Mama never let me forget it.\" Told in the first person, this novel immerses the reader in the U.S. Civil War, where Cathy Williams, a slave, is separated from her family during the destruction. She makes the decision to join the Union Army disguised as a male, to become a Buffalo soldier as a means of survival, having witnessed what can happen to African American women. The narrative is enriched by the language, knowledge of army life (for African Americans in 1860's) and the social-political realities of the era; all well told by the author. The excellent writing swept me away into this hard world by the writer's vivid descriptions and the development of the relationships between Cathy and her mentor, her sister, and the lengths she went to disguise herself while in the Army. When she falls in love with a man the reader feels her heartache and the stakes that are in play for both characters. This isn't an 'easy' read but it's an important subject to know about and the author makes the experience compelling and satisfying. I can envision this book becoming a movie and if it is I hope actors can show the story, as well as the author, wrote. I highly recommend reading this book.Thank you to NetGalley for the arc and opportunity to read this book in an exchange for an honest review. The publishing date is September 2018."}, {"userName": "Donna", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/2095840-donna", "userReview": "Cathy Williams was born and raised as a slave in Missouri. Near the end of the Civil War, she becomes a cook for the Union Army. Naturally tall and athletic, Cathy decides to hide her gender and become a Buffalo Soldier in the U.S. Calvary after the Civil War. This powerful and fictionalized true story is totally engaging and fulfilling. Cathy is such a \"huge\" character that she literally steps off the page! I loved this story of a strong and capable woman who is aware of her roots and will never forget that she is the \"daughter of a daughter of a queen!\" Highly recommended for lovers of historical fiction!Daughter of a Daughter of a Queen by Sarah Bird will be available September 4, 2018 from St. Martin's Press. An egalley of this book was made available by the publisher in exchange for a honest review."}, {"userName": "Doris Vandruff", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/35576617-doris-vandruff", "userReview": "Cathy Williams has been mistaken for a boy, again. Yes, she is tall, strong and she chooses to were pants, but that isn't who she is. She is an African Princess. Her grandmother was strong African Queen. So if Cathy has to wear breeches to prove that she is strong and brave, well then she will. And that's what makes her special. She is an African woman who serverd in the Army for two years without being known as a women. She is awarded the sharpshooter medal. She is a Buffalo Soldier. This is a work of fiction. The detail and imaginative storyline are genius. Loved the characters. There isn't anything about this book I didn't like. It was entertaining, surprising. Strongly recommended.5 Stars"}, {"userName": "Mandy", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/30760811-mandy", "userReview": "Brilliant read! Very rarely do I read a book and wish it hadn't come to an end. I was completely hooked from the very first pages. Bird's use of language is magical and transports you right into the story. In parts it's heart wrenching but the strength of the characters shines through no matter how grim the circumstances and how difficult the choices were for them. I would not hesitate to recommend this book and look forward to reading more of the author's work."}, {"userName": "Pat Welte", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/31395152-pat-welte", "userReview": "I really enjoyed reading this book. You almost feel like you are traveling with the soldiers. It has light-hearted moments as well as heart touching moments. I really cared about the characters and I really hated a few. I also felt relieved that I didn't live during the Civil War. Ms. Bird wrote an excellent book, this is the first book I have read by her, but it certainly won't be the last."}, {"userName": "Rachel V.", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/11832296-rachel-v", "userReview": "The historical fiction version of the story of Cathy Williams (William Cathay), descended from an African Queen and growing up listening to stories of her warrior queen grandmother Cathy goes from being a slave, to being contraband and a cook in the Civil War, to pretending to be a man and enlisting in the US Calvary as a Buffalo Soldier. Her story is one of horrible cruelty and the danger of being discovered, raped, and killed a constant. I enjoyed the book the most when she was a cook and on campaign in the Civil War because there was a lot going on and it was exciting. I think I expected more about the Buffalo Soldiers since they were in most of the military campaigns and 23 Buffalo Soldiers received the Medal of Honor during the Indian Wars. Her time was mostly building barracks, cleaning latrines, cooking, and trying to figure out how to use the bathroom and bathe without being discovered. About halfway through the story turned into more of a romance with a twist. I’m glad I read it and I think most people will enjoy it, it just wasn’t what I was expecting.I received an eARC from Netgalley and the publisher for an honest review"}, {"userName": "Kaytee Cobb", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/22299570-kaytee-cobb", "userReview": "This was so well put together. We meet Cathy Williams toward the end of the Civil War, when she is \"requisitioned\" as a cook for the Union army, under General Sheridan. Cathy is the granddaughter of an Amazon queen, tall and muscular. As a recently freed Black woman, she is swept up in the end of the Civil War and opts to conceal her gender and join up with the peacetime army. Sarah Bird doesn't write a lot (in the galley, at least) about why she chose to pursue this story, or how much of it is based in fact, or whether it's even possible for us to know ANYTHING about women who served in the Buffalo Soldiers branch of the U.S. Calvary after the Civil War, but the tale she weaves is compelling and unputdownable. At 400 pages, this book breezed by. Definitely recommended for history aficionados."}, {"userName": "Gretchen Marie", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/5183640-gretchen-marie", "userReview": "4.5 StarsI actually wished that my train ride was longer while I was reading this so I could finish it...it had me hooked. A fictionalized version of a true story, Daughter of a Daughter of a Queen is the type of book you just wish could be taught in schools so young people, especially young women, can discuss the history behind it and find an incredible role model in Cathy Williams. Not only is it a powerful story, but the writing is excellent, enveloping you in the action and taking you along for a ride with the cavalry. This book made me snort from laughing, dramatically (but authentically) slap my hand over my mouth in disbelief, and mutter \"no no no nope, what the hell?\" under my breath all in the course of one (very long) subway ride. Highly recommend."}, {"userName": "Holly Senecal", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/3345347-holly-senecal", "userReview": "This story needs to be read in school!! Why do we not teach more about this part of history? Daughter of A Daughter of A Queen was so good.~It was a historical book that read like a fiction novel and I cannot wait until it's published and I can recommend it to every teacher friend I have."}, {"userName": "Jamckean", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/15352484-jamckean", "userReview": "The fascinating story of Cathy Williams, the first woman to ever serve in the peacetime US military. Readers will cheer aloud for this bold, brave and unstoppable woman; she refused to allow race or gender to keep her from serving her country as a Buffalo Soldier. A riveting novel that blends fact and fiction, DAUGHTER OF A DAUGHTER OF A QUEEN is a must read."}, {"userName": "Dori Stowell", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/63044733-dori-stowell", "userReview": "Cathy Williams was raised by strong women, a grandmother who was an African Queen and her mother, a slave. They taught Cathy to have pride in her heritage as a “Daughter of a Daughter of a Queen,” even as she is torn from her family on a Missouri plantation and sent to work as a cook for the army. s a slave and woman in the civil war, Cathy chooses to keep her strong African heritage and her identity, and refuses to allow her circumstances to change her sense of who she is. Eventually, she finds herself enlisting as a buffalo soldier and disguising herself as a man. This book shares a powerful side of the civil war, unknown to many. I found myself neglecting my other responsibilities to find out how Cathy’s life would turn out. I highly recommend this historical novel!"}, {"userName": "Judy", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/1244630-judy", "userReview": "Daughter of a Daughter of a Queen is Cathy's story of the civil war. What makes this story so intriguing is that Cathy is a black, former slave who passes herself off as a man most of her life. It would be interesting to include this in a high school US History class.I received an ARC from the publisher through NetGalley."}, {"userName": "Jean A.", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/73029278-jean-a", "userReview": "I thoroughly enjoyed this book. The author left me wanting more. Other than knowing that Cathy Williams was a real person, I’m ashamed to say I don’t know how historically accurate the balance of this book is. That being said, if only half of the cruelty described in this book actually happened, slavery was one of the most abhorrent parts of our country’s history. The author made Cathy Williams come so alive for me that after I finished the book I spent a couple of hours reading about her. There is nothing better than reading about strong women and she certainly was that."}, {"userName": "Cheryl", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/2403757-cheryl", "userReview": "Disclaimer first: I got this book as part of a First Reads giveaway.I love history. Historical fiction, I have a love-hate thing for. There are stories that wouldn't be told without the fiction aspect because there just isn't enough concrete evidence to write a bit of non-fiction for. It varies too about just how much of the fiction is true. Given how little is actually known about this Private Williams, much of this has to be fiction. I dislike when that is the case because I want it to be real. I want to be able to talk about it as if it was all true and I can't.Where does that leave me? It leaves me reading a book that is inspired by a woman with a history that hasn't been well documented. Those whose interest has been raised can certainly try to look for more, but for those who want a feel of how it might have gone, have this story.The story is engaging and I found myself thinking about it even when I wasn't reading it (like when I was trying to finish a library book that was due). Overall, I felt the writing was strong.Potential spoiler ahead...The love story. I happen to believe that for her to have lasted as long as she did without being discovered, there probably was someone who helped protect her and it probably would've been a romantic hook-up. I could've lived without that, but as I've stated, I think it was likely that it would've have taken place even if it hadn't been the way it was written about.The ending, broke my heart. I didn't get too choked up until then."}, {"userName": "Crystal", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/3325683-crystal", "userReview": "Disclaimer: I received this book free from Netgalley in exchange for an honest review.This book troubled me from nearly the beginning. I couldn’t quite put my finger on it.it but I could feel there was something wrong. I gradually came to realize that the problem lay in how the people of color were portrayed in the book. Not only were the voices problematic but they were written in cliche.You know what this reminded me of? Gone with the Wind. That is NOT a good thing. African-Americans were consistently shown to be mulish, ignorant and backwards. The lead character was supposed to draw strength from her heritage. Her mother stressed her being the child of a strong warrior woman from Africa, but the actual connection to her heritage was written in such a way as to be purely tenuous and superficial.One scene in particular was absolutely ridiculous. Cathy, as an enlisted Buffalo Soldier, has to hide her gender but her fellow soldiers are suspicious. As a trial she is forcefully put into a room with a prostitute, while her fellow soldiers listen at the door. What followed was a ridiculous farce. Cathy banged on the bed while encouraging an unfortunate, intoxicated sex-worker to pray loudly to “Hell Mary” for forgiveness for her sins. The ensuing noise convinced the soldiers that Cathy MUST be a man and hella good at sex besides. This was scene belonged in a Mel Brook’s comedy. It was demeaning, ludicrous and repellant.I won’t even go into her depiction of First Nations people. They were props. Like the stand-in, life size cardboard figures you see in a movie theater.This is not historical fiction. It’s just fiction. Loosely attaching your character to a real person’s history does not lend credence to your story. I found the entire book odious. I’m sorry I read it. The real life Cathy Williams deserved more. This is why we need more books written by people of color."}, {"userName": "Kirsti Call", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/900890-kirsti-call", "userReview": "I received a copy of this book from netgalley in exchange for an honest review.“Here's the first thing you need to know about Miss Cathy Williams: I am the daughter of a daughter of a queen and my Mama never let me forget it.\" What a book! The book is about Cathy Williams and her experience of the Civil War as a black woman who disguises herself as a man so she can join the calvary. This is historical fiction at it's best. Cathy Williams was real, and Sarah Bird does an incredible job of helping us hear her voice, feel what she felt and better understand her plight as a black woman at that time. I learned about the civil war, treatment of slaves and black people, treatment of American Indians, what it was like to be in the calvary. Bird beautifully writes about this part of our history with heart and accuracy. I especially loved the relationships in this story. Although Cathy loses almost every person that she loves, she is strong, capable and independent--the kind of woman we should all hope to be."}, {"userName": "Felicia Allen", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/29025122-felicia-allen", "userReview": "This is a very historically acurate story told from an ex-slave woman's point of view. It was very well written and extremely accurate. There are a lot of racial terms and some contriversial views in this book, but it is necessary to make it accurate. Also, in the book they used _______ in place of swear words. I am not sure if that will appear in the printed book or not. I loved this tale. It followed Cathy Williams, the first and only female, black buffalo soldier. The story follows her from when Sheridan burned her plantation and took her for a cooks helper clear through her mysterious ending. You follow her through love, loss, courage, and times of fear. This book gives you a true inside look at what life was like back then for blacks, soldiers, and women. The way it was written, you could almost believe that you were reading a memoir."}, {"userName": "Amie Wilson", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/19953541-amie-wilson", "userReview": "A powerful book based upon an African-American woman who served as a Buffalo Soldier in the United States Army disguised as a man. This fictionalized account of the life of Cathy Williams is fascinating. I have to admit, I was constantly worried she would be caught and I carried a sense of dread throughout the book. The descriptions of the life of a soldier, especially recently freed slaves' lives, are eye-opening and interesting. It was refreshing to read about an angle of the Civil War and post Civil War era that hasn't been written about frequently, it made the story fresh and interesting."}, {"userName": "Pam", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/1866842-pam", "userReview": "This was a fantastic story about Cathy Williams life as a slave and then a Buffalo Soldier. I knew very little about the Buffalo Soldiers and I am so glad that I was able to read this for a little bit of knowledge. Some of the content is a bit difficult to read, but well worth the effort!My thanks to netgalley and St Martin's Press for this advanced readers copy."}, {"userName": "A.E. Walnofer", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/22466355-a-e-walnofer", "userReview": "I appreciated the uniqueness of this story. The main character's voice and situation was unlike any other I've ever read. Cathy William's story is one that should be read and valued so that others can be inspired by her strength and heart."}], "description": "The compelling, hidden story of Cathy Williams, a former slave and the first woman to ever serve in the US Army\n\n\n“Here's the first thing you need to know about Miss Cathy Williams: I am the daughter of a daughter of a queen and my Mama never let me forget it.\"\n\nMissouri, 1864\nPowerful, epic, and compelling, Daughter of a Daughter of a Queen shines light on a nearly forgotten figure in history. Cathy Williams was born and lived a slave – until the Union army comes and destroys the only world she’s known. Separated from her family, she makes the impossible decision – to fight in the army disguised as a man with the Buffalo Soldiers. With courage and wit, Cathy must not only fight for her survival and freedom in the ultimate man’s world, but never give up on her mission to find her family, and the man she loves. Beautiful, strong, and impactful, Cathy’s story is one that illustrates the force of hidden history come to light, the strength of women, and the power of love.Christina Baker Kline says Daughter of a Daughter of a Queen is \"an epic page-turner\" and \"unforgettable.\"", "title": "Daughter of a Daughter of a Queen", "url": "http://www.goodreads.com/book/show/39097617-daughter-of-a-daughter-of-a-queen", "average": 4.23, "cover": "https://images.gr-assets.com/books/1520659696l/39097617.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/191417.Sarah_Bird", "name": "Sarah Bird"}, {"url": "https://www.goodreads.com/author/show/191417.Sarah_Bird", "name": "Sarah Bird"}], "type": ["Historical", "Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/37638181-daughter-of-a-daughter-of-a-queen", "http://www.goodreads.com/book/show/39097617-daughter-of-a-daughter-of-a-queen", "http://www.goodreads.com/book/show/37638135-daughter-of-a-daughter-of-a-queen", "http://www.goodreads.com/book/show/9754006-the-gap-year", "http://www.goodreads.com/book/show/18404382-above-the-east-china-sea", "http://www.goodreads.com/book/show/445730.The_Yokota_Officers_Club", "http://www.goodreads.com/book/show/352973.The_Flamenco_Academy", "http://www.goodreads.com/book/show/3218147-how-perfect-is-that"]}