{"ratings": 1295, "userreviews": [{"userName": "Allina", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/5694306-allina", "userReview": "It would help if there was a way to help someone budget money when their income doesn't even cover their basic needs. I can budget money without the help from this book, but it sucks when it's the electric company that is \"below the line\" and the electric is getting shut off. It's either rent or electric. Childcare or gas to get to school. I'd like to see help for people in that situation. I can't think of savings, but I once applied these principals, and I hope that one day soon I'll have money to actually start saving again. Once I can start saving again and start looking into the advice in here that I didn't already have such insight with (mortgages, retirement plans, money markets, and such) then I will appreciate the book even more."}, {"userName": "Brooke", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/1499408-brooke", "userReview": "Fill in the blank workbook while watching his videos in class. Very helpful"}, {"userName": "Wes", "userReviewDate": "Jun 28, 2010", "userURL": "http://www.goodreads.com/user/show/3785149-wes", "userReview": "Dave Ramsey is designed for today's Christian: luke-warm, wealthy, irresponsible, easily influenced by manipulation and repetition. Dave: \"Does this make sense, say yes.\" Audience: \"Yes...master\".However, if you're not a luke-warm Christian, not wealthy, and are annoyed by the abundance of cliches, Dave Ramsey's material probably won't help."}, {"userName": "Amy", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/1422042-amy", "userReview": "what an amazing process to go through as a couple...when your heart is open. We did this as a class with other people which was so neat because other people had ideas that were great! This brought hubby and I so much closer and on the same page with gazelle intensity with one single goal to become and to live 100% debt free!!! I am not someone that loves a budget or loves to make one, but I am a huge fan now after seeing how quickly we can make our money work for us, just by having a place for every dollar we bring home!"}, {"userName": "Stephen London", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/18830205-stephen-london", "userReview": "I have needed to read this book for a long time. Very helpful advise from a Christian perspective to getting my personal financial house in order."}, {"userName": "Leigh Abdou", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/11944381-leigh-abdou", "userReview": "10 Stars...changed mine and my families life."}, {"userName": "Melly0919", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/2077465-melly0919", "userReview": "His advice is invaluable. I recommend this to anybody who wants to know more about finances."}, {"userName": "Lorelei Jaramillo", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/21981297-lorelei-jaramillo", "userReview": "Done with the book and now To change our family tree!"}, {"userName": "Greg", "userReviewDate": "Apr 13, 2012", "userURL": "http://www.goodreads.com/user/show/3395589-greg", "userReview": "Good stuff, especially on the topic of paying off debt. I would recommend it to anyone who owes on credit cards, car loans, or any other debt where they pay interest. I don't believe Dave's specific advice on investing is as good as his advice on retiring debt. To his credit, Dave says not to invest in anything you do not understand. Compare the performance of an S&P 500 index fund to managed funds and the fees before following his investment advice. I am however suspect about Dave's specific advice on investing in mutual funds. For the period of December 31, 1992 to December 31, 2007, only 41.6% of actively-managed U.S. large company funds that beat the S&P 500 in a particular year were able to beat the S&P 500 in the next year. After three years, only 9.7% of the original group was still beating the index. The numbers are similar for actively-managed small cap funds and emerging market funds. In short, do your research carefully do not invest in anything just because \"Dave says\". Think for yourself. Question authority."}, {"userName": "Matthew", "userReviewDate": "Nov 19, 2013", "userURL": "http://www.goodreads.com/user/show/25839947-matthew", "userReview": "Chapter 1: The Beginning... A Very Good Place To StartNoise that they will make when they are financially free.Follow the rules and Commit to them.Dave's story. Millions in debt3.5 years to end up broke.Chapter 2Enough of Anything Is Too MuchJust say no, to having it now! We're being taught by everything around us to have dessert before dinner.Chapter 3The Basics (A Foundation) Money is active - always moving, a current flowing.Money is amoral - the 'love' of money is evil. Society that values you because of your stuff.Measure your wealth not by how what you have, but by the things for which you would not take money.Chapter 4:Understanding Spiritual Aspects of MoneyFinance is exact math, until a human touches the money. Chapter 5: Caveat Emptor : Buyer bewareBook was finished, but notes are lost."}, {"userName": "Susanne", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/1593592-susanne", "userReview": "So as you can tell we are doing the Dave Ramsey class at church, I didn't really want to do it, thought it was all hype, felt I didn't need it...I mean am I not already cheap enough! But I must say I am learning things I did not know and needed to do, I have a spiffy budget and am doing my envelopes. I probably would have preferred to do Larry Burketts study with Crown as it would have been more Biblically focused but Dave's principles for finances are the same and he is a good speaker that holds my attention. Be aware though I listened to a few radio answers from his show and he can be a bit sarcastic, I mean these folks were kind of \"stupid\" (his word) with their money, but it could be a bit harsh...But I am a believer!"}, {"userName": "Lindsey", "userReviewDate": "Mar 12, 2012", "userURL": "http://www.goodreads.com/user/show/3070362-lindsey", "userReview": "Perhaps the book isn't as good as the video series done by Dave Ramsey but it still holds truth within its pages and like all truely great books it challenges your brain and makes you think. As one of those guilty people who never wrote down a budget before this book, I agree whole-heartedly that you can always spend what you make. Even if you get a raise, somehow even then you don't have money lying around. It is spent \"somehow\". With a budget, you know where that money goes and it works harder for you...Favorite quote: \"You can give something. Somehow giving reminds us that the world does not revolve around us and that no matter what our financial status is, someone always is in a much worse situation.\""}, {"userName": "Don", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/5181581-don", "userReview": "Biblical with humor, reality focused, Dave's principles for finances are not the same as Larry Burkett, but he is a good speaker with a great sense of humor that held my attention.A very excellent financial plan for getting out of debt and investing for the future.The book has changed our financial lives and changed the way my wife and I think and organize God's money. I am so grateful to have found these biblical truths on how to use money for God's purposes.Dave Ramsey is amazing, inspirational and motivational. I'm a huge fan of Dave and the principles of biblical finances, we are blessed to be on the journey toward \"financial peace\" together."}, {"userName": "Clint", "userReviewDate": "Mar 31, 2009", "userURL": "http://www.goodreads.com/user/show/1573254-clint", "userReview": "First off: The book's advice is really sound. He has great specific step and really clarifies some tough to figure out things like insurance and its role in our lives.The first 1/3rd of the book I was a bit turned off and had to struggle through it because Dave uses cliches and fluff sayings so much that it distracts from the message. 'You know what I mean? What a concept! Do you understand? Say yes!' Ugh. That got old.However, once he got into the really interesting things for me (investments, insurance, retirement accounts, and college accounts) then I stopped noticing the fluff words."}, {"userName": "Jay", "userReviewDate": "Apr 20, 2011", "userURL": "http://www.goodreads.com/user/show/1481637-jay", "userReview": "Excellent!Everyone should understand these concepts. This is a series of lectures that discuss, first and foremost, personal finance. But the series also touches on the inseparable adjacent aspects of life that impact and are impacted by one's financial situation and approach.Ramsey has a great way of speaking and conveying importance and individual application. More importantly, though, the content is solid.I don't agree with 100% of what Ramsey says. There's nothing revolutionary or magically about his recommendations. But I do agree with most of them. And I'm planning to put much of it to good use."}, {"userName": "Jennifer Suggs", "userReviewDate": "Aug 18, 2010", "userURL": "http://www.goodreads.com/user/show/3959285-jennifer-suggs", "userReview": "I took this as a 12 week class and it changed my relationship with money. I am now debt free and working on living within a budget. I want to control my money and financial future (as much as possible) and not have my money and debt controlling me. I podcast Dave's radio show now and it's good stuff, people! He's a southern guy who has made a ton of money, lost it all and made it again. He's learned a lot along the way and now his mission is to teach others. He works with a lot of professional athletes and I have really appreciated learning from him."}, {"userName": "Kelsey", "userReviewDate": "May 13, 2009", "userURL": "http://www.goodreads.com/user/show/913473-kelsey", "userReview": "My in-laws enrolled in Dave Ramsey's Financial Peace University and received the audio portion of the course on CD, which they let us borrow. I absolutely loved it. I would honestly recommend this course to anyone and everyone. We thought we were pretty financially savvy and conservative, but we learned so much by listening to these CDs. Dave Ramsey has a talent for powerful motivation, and everything he teaches is honest and God-centered. I cannot give this high enough praise...seriously, check it out."}, {"userName": "Laura", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/1407260-laura", "userReview": "This series on financial peace changed my life. Dontae and I have set a goal to be debt free by December 2012 and we want to buy our first house all in cash, never borrowing money again. Our credit cards have been shredded for good. We have a fire lit under us because of Dave Ramsey's common sense message: \"Debt is dumb and cash is king.\" The greatest thing I'm looking forward to in accomplishing our financial baby step program is having the opportunities to give back."}, {"userName": "Linda", "userReviewDate": "Aug 31, 2009", "userURL": "http://www.goodreads.com/user/show/952153-linda", "userReview": "Good book, GREAT class. My husband and I took this 13 week class and it was well worth it. It's everything you need to know about finances, budgeting, getting out of debt, getting a bargain, saving for retirement and college, insurances, and (my favorite) where and how to find a bargain! If no one taught you about money, this is where to go. If you did learn about it, get some great reminders and learn even more."}, {"userName": "Brian", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/5974053-brian", "userReview": "Dave Ramsey talks about his \"baby steps\" to eliminate debt and build wealth. I'm 41 and have been a believer in his methods for years. It has done well for me to follow his guideline. I re-read this book recently (on CD while commuting) to get a better understanding of some of the \"higher\" steps (retirement building, etc.) and plan to slightly redirect some of my focus to create long term financial stability for my family. Thanks again, Dave!"}, {"userName": "Chris", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/7318501-chris", "userReview": "Great for me, the basics to get things in order. Even though I ma not there yet, the later bits seem weak to me, but I will have to find out when I get there. Dave did a good job motivating me to get things straight -- get out of debt, pay off the mortgage, and make a monthly budget BEFORE each month, not just track what happened after it happens. Of course, I wasn't fond of the religious part, especially towards the end -- felt more like a sermon. But all in all, it was helpful."}, {"userName": "Jason", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/6751478-jason", "userReview": "Financial basics that everyone needs to know - presented in a fun, memorable way.I'm too logical (and know the math) to follow his debt snowball plan by going smallest debt to largest. I'll stick with highest interest rate first, thank you. His \"emotional momentum\" argument is well-founded, though."}, {"userName": "Otis Kopp", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/27850188-otis-kopp", "userReview": "GREAT read. This has revolutionized my thinking on financial management. I'm motivated now more than ever to attain freedom from debt and be a better steward, a better saver, and a better giver of what God has entrusted me with financially. I will be recommending this book as a must-read to everyone I know!"}, {"userName": "Kim Holdiman", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/11591587-kim-holdiman", "userReview": "Great financial advice from a Biblical standpoint. Dave always mixes humor, honesty, scripture, love, hard truths, and compassion in his teaching. He has turned our financial thinking and operating upside down, inside out, and straightened it out. We are headed down the baby step road to financial freedom thanks to Dave!"}, {"userName": "Luis Cordero", "userReviewDate": "Dec 18, 2011", "userURL": "http://www.goodreads.com/user/show/6978789-luis-cordero", "userReview": "Practical, simple, and straight to the point. The book is easy to read and flows from concept to concept. David talks mostly from personal experience which I find valuable and enriching. There are many advises in his book that i have followed for some years and they work, not because David says so, but because they are common sense. A must read if you struggle to manage your money succesfully."}, {"userName": "Eleanor", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/3993432-eleanor", "userReview": "My husband and I are taking this class at our church and it is awesome. We are coming at this from a different place than most of the others in our class as we don't have debt to snowball. Even so this still has such great truths for us, especially about our societies' warped views of credit and car worship. It is time to wake up teach our children a more Biblical aspect of money."}, {"userName": "Christine Sykes", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/15065506-christine-sykes", "userReview": "Phenominal and funny. Helped me very much with getting my finances on the right track so that i could get my priorities straight.Perfect for all levels of financial chaos. Mine personally being beginning family with little/no dept. Alot of what is advised can be very meticulous and aggressive. Take what applies to you and works for you but don't stress the rest or else you may want to give up!"}, {"userName": "Alice", "userReviewDate": "Dec 24, 2010", "userURL": "http://www.goodreads.com/user/show/4658249-alice", "userReview": "We took this class to meet and interact with other folks who where trying to do exactly like us.....be debt free including the mortgage! Although we had previously read The Total Money Makeover, this course was helpful as it forced us to finally develop a household budget and start on an estate plan."}, {"userName": "Ayah", "userReviewDate": "Mar 22, 2010", "userURL": "http://www.goodreads.com/user/show/3478048-ayah", "userReview": "Dave Ramesy's system for living debt free is proven to be successful. I'm working my way through this program and learning a lot. It's super simplified information written at an 8th grade level so anyone can use it. While he is pretty Christian, I've learned to tune those parts out and just take what's useful."}, {"userName": "Mindy W", "userReviewDate": "Oct 10, 2008", "userURL": "http://www.goodreads.com/user/show/1504375-mindy-w", "userReview": "It is so nice to see where each $$ goes~ I started on September 1 as a part of a class~ An eye opener for my husband and I~ Couldn't have come at a better time with him just retiring and the ecomomy spinning out of control! Great, informative book~"}], "description": "91 Days to Beat Debt...And Build Wealth", "title": "Dave Ramsey's Financial Peace University Workbook", "url": "https://www.goodreads.com/book/show/7052895-dave-ramsey-s-financial-peace-university-workbook", "average": 4.53, "cover": "https://images.gr-assets.com/books/1395450379l/7052895.jpg", "reviews": 80, "authors": [{"url": "https://www.goodreads.com/author/show/44526.Dave_Ramsey", "name": "Dave Ramsey"}], "type": ["Nonfiction", "Economics", "Self Help", "Christian", "Business"], "outlinks": ["http://www.goodreads.com/book/show/7052895-dave-ramsey-s-financial-peace-university-workbook", "http://www.goodreads.com/book/show/295685.Dave_Ramsey_s_Financial_Peace_University", "http://www.goodreads.com/book/show/18522350-financial-peace-university", "http://www.goodreads.com/book/show/78427.The_Total_Money_Makeover", "http://www.goodreads.com/book/show/129565.Financial_Peace_Revisited", "http://www.goodreads.com/book/show/11306337-entreleadership", "http://www.goodreads.com/book/show/12174298-dave-ramsey-s-complete-guide-to-money", "http://www.goodreads.com/book/show/18702622-smart-money-smart-kids"]}