{"ratings": 727, "userreviews": [{"userName": "Chad Warner", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/1586355-chad-warner", "userReview": "This short book presents a good perspective on time management and intentional living, but it’s overly simplistic, and there’s nothing deep or novel. Smith’s advice: live for God, determine your purpose, live intentionally, value relationships, and live conscious of your earthly legacy and eternal afterlife. Smith writes explicitly about his Christian principles, but most of his lessons are nevertheless applicable to people of any (or no) religion.In a chapter about conquering rejection, Smith gives examples from his sales background. He says he “was always hunting for nos.” When he was trying to sell bookings for a comedian, he would ask, “You wouldn’t be interested in booking a comedian, would you?” I can see how this might ease the sting of rejection by lowering expectations, but it seems like a poor sales technique due to its pessimism and lack of confidence and enthusiasm.There are better and more comprehensive books that deal with time management and purposeful living, including The 7 Habits of Highly Effective People and The 80/20 Principle.I read this because it was recommended by a client, Tom Page, managing editor of the School Communicators Network. He wrote about this book on his SCN Encourager blog.Notes• “Don’t focus on time, but on events themselves. Fill these events with people you love. Relationships will be enhanced and memories created.”• “Stop counting days down. Instead, count them up! Marvel at how many you’ve been allowed to spend on this planet. And never forget that each one could be your last.”• Don’t put off celebration until a major accomplishment. Celebrate little steps.• In challenges, think, “I am the problem.” This gives you power over circumstances, rather than feeling like you’re a helpless victim.• “In truth, people can generally make time for what they choose to do; it is not really the time but the will that is wanting.” John Lubbock• “There’s no secret trick or complicated formula...All it takes is for you to simply decide that you are going to live your life with purpose...”"}, {"userName": "Erlyn Trinidad", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/722982-erlyn-trinidad", "userReview": "I was glad I picked this book and I must say that I was rather blown away by the simplicity of the concepts presented by Mr. Smith. Truly, brevity is the soul of wit. Robert Smith's 20,000 Days and Counting is packed with universal truths that we all need to be reminded of in our daily lives, for us to have a sense of urgency. I like the fact that this book is designed to be read in only one hour as the author stated, we need to allot more time for other things that are far more important in our lives. One particular statement he mentioned that I am almost always guilty of is that:  We have an amazing ability to over estimate what we can do in the next five years and totally under estimate what we can do in the next fifteen minutes. This totally hit home when I read it because I'm guilty of always procrastinating thinking that I still have so much time and later on trying to finish everything in a frenzy while I try to beat the deadline.There's a lot of points he raised that are equally important. But the biggest take away that I have of this book is making myself the Problem, as Mr. Smith said - Become your own problem. According to him, by doing so, you thereby take the outside circumstances and bring them inside. And suddenly you have control. We are all guilty of putting the blame on the circumstances, the people around us, management, the government, and the devil of course, but we often times forget to take ourselves into account. And what a paradigm shift that makes when we become our own problem and start evaluating ourselves, what we are good at and what we could improve on.This book is beyond a good read, really one book you'll read over and over."}, {"userName": "Cheree", "userReviewDate": "Dec 14, 2013", "userURL": "http://www.goodreads.com/user/show/4622950-cheree", "userReview": "20,000 Days is a quick read. coincidentally, I received this book on my 20,000th day of being alive. This was not by design (or at least not by my design!). I simply heard about the book (I believe via Dave Ramsey's Entreleadership and thought sounded worthwhile.) I didn't realize until I had started the book and went to the website to calculate my days, that was the case.Is there any earth shattering new information in this book? Not really. But it serves as a good reminder that time passes quickly... too quickly. And also is a good reminder that time is the only thing we can't regain when spent or lost. Whether we have a defined number of days on this earth, or whether we can exercise some control over their length, or whether circumstances beyond our control can cut our lives short suddenly and without warning, is all debatable. But one thing is for certain, how we spend the time we have is what truly matters.I think taking some time to get by yourself on one of these big days to reflect and plan is a good idea. Since I missed my 20,000th day, I'll have to choose another. Also noteworthy are the many wonderful quotes throughout the book. 20,000 Days is a quick read, and I believe your time reading it will be well spent."}, {"userName": "Joe Cassada", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/3900807-joe-cassada", "userReview": "A very brief book with not a little filler. Not a bad book, but not a great one, or even an interesting one. Smith regurgitates a lot of pep-talk jargon. Nothing new, no incredible insights, just a really positive thinking man who wants to cheer you up.So, don't get the book thinking it is about productivity, or organizing, but understand it is more about motivation. Ironically, the author actually states that motivation is a myth, i.e., we do not increase motivation to increase productivity, rather, we increase productivity to increase motivation. Again, the book doesn't really get into the nuts and bolts of productivity - it's simply a lot of \"you can do it!\" motivational pep talk.The only interesting part of the book was where he describes taking a few days to retreat into solitude and plan his next 20,000 days. Sadly, he doesn't give us any details about how he planned, or even what he planned. If only he had written a few chapters about that process, it would've made this book so much better.I wouldn't spend the money to purchase this one; instead, check it out from the library, read it in an hour or two, and glean what you can."}, {"userName": "Loren", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/18370826-loren", "userReview": "I was first drawn to this book by the author's association with Andy Andrews, of whom I am a huge fan. Robert D. Smith works from the premise that one day he realized he'd lived 20,000 days of his life, and that those days just happened to him while he wasn't paying attention. In other words, as John Lennon once said, \"Life is what happens to you while you're busy making other plans.\"Smith then tells how the realization of that fact caused him to deliberately plan the next twenty thousand days of his life so he could drive them rather than be a passenger.It's a compelling read, and his style is exuberant. All in all, I finished the book with perspective I didn't have before, so on that note I will recommend it. Four stars."}, {"userName": "Tia", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/9017732-tia", "userReview": "I stumbled upon this book because a friend's wife recommended it to him. I think this possible was the best (& a quick read) read I have read in awhile. Some of the statements just linger in the mind for awhile and others give you a quick dose of reality. It gives you the stepping stones to act upon things & the rest it up to go. Highly recommend reading this book."}, {"userName": "Rick Theule", "userReviewDate": "Jul 04, 2015", "userURL": "http://www.goodreads.com/user/show/7682462-rick-theule", "userReview": "Great book to help you determine your passion in life!"}, {"userName": "John Browning", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/20938991-john-browning", "userReview": "Great short read for a better perspective on life."}, {"userName": "Marwa  S. El-toukhy", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/33138966-marwa-s-el-toukhy", "userReview": "نصيحة أرسلت لى لأبدأ بهذا الكتاب قبل التخطيط للعام الجديدالكتاب نصائح عملية للسعادة فى حياتك ،لا شىء تجهله بل تجهل تحويله كعادة يوميةأحببت تفسيره ل عش اليوم كأنك تموت غدا .. لم أكن أفهمها رغم أنى سمعتها مئات المرات .. هى نفس معنى فيلمAbout timeكتاب قصير وأسلوبه محبب للنفسبس مش قوى .."}, {"userName": "Connie", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/5778979-connie", "userReview": "What is important right now? and What is next? Two questions to ask yourself. Our homework from the book club was to write our life purpose. This was a good process for me. Another great thought from the book was to Honor and Celebrate the small steps in life. Well worth reading!"}, {"userName": "Alexandra Swann", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/7142214-alexandra-swann", "userReview": "A friend of mine gave me this book. I found it very interesting. Smith has a unique approach to making your days count."}, {"userName": "Julia Southwick", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/10484692-julia-southwick", "userReview": "This book was full of cliches and seemed overly simplistic. If it wasn’t so short I never would’ve finished it."}, {"userName": "Scott", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/5045695-scott", "userReview": "Didn't much care for the religious points in the book but really liked allot of it. Very motivating. In particular the seven questions to start the day."}, {"userName": "William", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/58001930-william", "userReview": "This book has a few very interesting ideas and concepts. It is a little light on substance."}, {"userName": "Jon Barr", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/23667943-jon-barr", "userReview": "A quick read with simple (not easy) and actionable steps to make and execute a plan for your life."}, {"userName": "Jack Oughton", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/5668541-jack-oughton", "userReview": "Short but sweet 'mortality literature'. I didn't really get anything new out of it, but I like the way that Robert presented the ideas - and I appreciate the brevity. Worth a re read."}, {"userName": "Jason Isaacs", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/13195493-jason-isaacs", "userReview": "In his book “20,000 Days and Counting” Robert D. Smith gives practical advise on “squeezing every last day, hour, minute, and second out of life until your life is done and you’ve given, loved, and celebrated all you could.” While being no small task, Smith figured out how to do so in 105 pages! Stated simply, Smith suggests to his readers that we count the days we have been given so far and ask ourselves if we have put that many days of life to full use. Since we are alive for a short time, it is important that we make the most of what we have been given. Though this suggestion seems platitudinous, Smith distinguishes his advice from others in that he tells his reader to “draft your life’s story, then live it!” In other words, put in writing who you are, what you are all about, and what you want to do- then live every day with the needed intensity to complete these goals. His advice is helpful, but I believe that the advice this book and other bravado- based motivational books offer is most hopeful when it is applied on the far side of… well- spiritual brokenness. I am searching for a more tempered word choice, but it is the only one that fully embraces our need. While writing from a Christian- theistic framework, Smith’s advice is as applicable to an atheist salesperson who wants to muster more motivation as it is to a retired Christian who wants to focus his remaining years on his family. Smith’s advice is good, but it is fleeting. I believe there are two spiritual truths that will allow a Christian to live with the purpose and intensity that Smith has described in his book. The first is best described by Dietrich Bonhoeffer in his book “The Cost of Discipleship” and it is having single minded obedience. The third chapter of his book describes in detail how a Christian decides to obey God- not daily or hourly, but moment by moment (he does so by examining the Gospel accounts of the disciples who followed Jesus). This type of radical obedience (and the resulting repentance) brings the believer into a relationship with Christ that is as intense as it is liberating. All desires must be seen as subordinate to obedience, and once obedience is primary- many of our desires find their God intended place. I recommend the entire book- and most importantly, I recommend the Gospel accounts to which his book is responding!  The second truth is learning to be led by the Holy Spirit in this moment by moment obedience. Living a Spirit filled life is necessary in order to obey God, and obeying God can only be done by the work of the Spirit. The Spirit is our Guide and Comforter, often prompting us to make decisions and show love in unnatural ways. The Spirit will work as wind in our sails, setting the course for our obedience.  Once these truths have been applied, reading Smith as an enjoyable primer on “staying focused” is helpful- consider the book to be a friend who prompts you along the way. However, I do not think a person will find his book to the springboard needed for long term commitment to intense goals. I believe this is best done by having a single minded focus to obey God and being led by the Holy Spirit."}, {"userName": "Rachel Blom", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/4889136-rachel-blom", "userReview": "The book was a lot thinner than I had expected, I read through it in less than an hour. That doesn't mean it isn't good though, there's a lot of food for thought in there. There’s practical wisdom in 20,000 Days and Counting, for instance the importance of creating a life statement, to determine your purpose in life, to take responsibility for your life and your problems, the importance of the little steps, dealing with rejection, etc. Many insights may seem like clichés, but if we’d applied them more we really would live life differently.Not all of what he offered appealed to me. He quotes a prayer for instant that he prays daily, which was taken from the famous The Power of Positive Thinking by Dr. Norman Vincent Peale:I believe I am always divinely guided.I believe I will always take the right turn in the road.And I believe God will always make a way where there is no way.To be honest, that is not my kind of prayer. Where as the scientific proof for the power of positive thinking is real, I like my prayers to be a little more personal, vulnerable and real. The first and third statement are absolutely true, but I don’t need to ‘pray’ these since God knows they are true anyways. The second one I do have a problem with, because of course I make mistakes, every single day. And I have taken wrong turns, only to be able to get back on the right road by the grace of God.Overall, even though I liked the book and there was practical advice in it that helped me determine some practical actions, I was a bit disappointed by it. I’d read raving reviews (for instance from Michael Hyatt) and I had expected more, especially from a Christian point of view.The book isn’t un-Christian (though this of course is very subjective), but it’s more of a positive-thinking-Christianity. I would think that the Bible has way more to say about making each day count, discovering your purpose, and living life to the fullest than what is written here. It seems to be the perfect book for those who believe in a problem-free, successful Christian life, but less so for those who want to take up their cross and follow Jesus, even amidst suffering.I won’t go as far as to say this book preaches a prosperity gospel, but it comes awfully close if you ask me. My ‘test’ for that is to always wonder if the message applies to Christians who are persecuted for their faith as well. In this case, I wonder if Christians in the labor camps in North Korea would embrace the idea of ‘always making the right turn in the road’ and what their ‘purpose of life’ would look like…So I’m not saying that you shouldn’t read this book, there really is valuable advice in there. I definitely learned a couple of things that I will apply to my life. But be warned that the Christian content may be less or different that what you’d expect or want to see."}, {"userName": "Violet", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/11228600-violet", "userReview": "Around the time Robert D. Smith had lived his 20,000th day, he took two of the next 20,000 (or however many he has left) to plan how he would spend the rest of his life. In his book 20,000 Days and Counting: The Crash Course for Mastering Your Life Right Now, he divulges what he did during his two-day retreat, and explains the philosophy on which he bases his life—a philosophy he sums up in statements like:“There is no thought that will purge your priorities of worthless and worldly tastes like that of your impending death. Ponder the kind of life you would like to look back on when you come to die… “and “The best preparation for living is to be prepared to die at any time … imminent death inspires clarity of purpose, a rearranging of what really matters” – Robert D. Smith, 20,000 Days and Counting, Kindle Locations 554 and 573.However, the book is anything but morbid. For this man, who has spent most of his career managing entertainer and author Andy Andrews knows how to show us a good time. The book’s tone and content is upbeat, encouraging, helpful, and practical. In it he suggests exercises that will help readers discover their life’s purpose and gives them ways to live responsibly and constructively. Some of his suggestions that resonated with me were:- You increase motivation by increasing productivity.- Be open to saying “yes” more than you say “no.”- Take ownership. “Start thinking I am the problem … when you do that…. Suddenly you have power” (Kindle Location 771). The book is a fast read and worth every minute spent immersed in it. The few hours it took me to read it are already proving well spent in their impact on my 2013 goals and resolutions. This is a book that will clear your vision and help you live with a “So teach us to number our days that we may gain a heart of wisdom” mindset (Psalm 90:12—one of numerous Bible verses he quotes; the book is consistent with a Christian perspective). I recommend it! I received 20,000 Days and Counting as a gift from the publisher for the purpose of writing a review."}, {"userName": "Sharon", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/5394360-sharon", "userReview": "The book up for review is “ 20,000 Days And Counting” by Robert D. Smith.This book falls into the category of self-help,personal growth and general.When I requested this book it was noted that it can be read in one hour. They were right. The author one day realized he had been alive 20,000 days. He ponders on what he had done in that amount of time. He decides to plan the next 20,000 days of his life to maximize his full potential.The book is divided into three sectionsSection 1:The 20,000 -Day Mind-Set. It doves into how Robert came up with the concept of 20,000 days. It is about changing the mind-set. We are not thinking of how many years we have left or have lived but instead count the days. Each day we are to live our lives like it is our last. Learn to accept your mortality, cause folks it is happening. Once we can do that, the burden of it is no longer with us.Section 2:Beating The Clock-Motivation is a myth. It is difficult to get people going and to improve productivity, Do the opposite. Increase one’s productivity and the motivation will happen. . It comes down to choices and options which boils down to yes or no. When you think of all the decisions that one makes in a day that basically sums it up. Do what you know. That alone will amaze you.Section 3:Today Is Day One-The day to get your life into gear. This section has questions to ask yourself to see if you are ready. Are you prepared to change your life?The sections have quotes from various people who home in on the topic you are about to read.I generally liked this book. The fact it was a quick read was huge. I also like how it was not your typical self-help book. I was not being preached at but instead shown ways how I can improve my life and the things around it."}, {"userName": "Charmin", "userReviewDate": "May 10, 2014", "userURL": "http://www.goodreads.com/user/show/24603494-charmin", "userReview": "Highlights:1. Wisdom is not really critical but also valuable for me to make important daily decisions.2. If we learn how to die we will know how to live: if we learn how to live, will know how to die.3. In order to make every day count, you must have the emotional connection at the fanatical commitment to follow through.4. Constantly saying no – to lunch, to that project, to vacation, do whatever it may be – diminishes opportunity for discovery and growth.5. Increase your productivity, then the motivation will follow. When we actually do better, we get excited, and the cycle continues6. Become your own problem. If you're the problem, you can solve it. So I assume the responsibility, on the difficulty, and I guarantee you will create a solution.7. Remember that it's the little things that add up to the big picture. Do not wait for impending death to light the fire of action inside yourself. Act today. Start small. Their opportunities hiding in the day today. Discovering your purpose maybe the easy part. The hard part is keeping it in front of you daily to the point where he drives you continuously.8. Become a process fanatic. When you form a clear plan for your life, every day becomes part of something bigger: the process it's up to you however to determine who you are in the process of becoming.9. There is tremendous power in owning those \"little \"things for which you have talent!10. If you want things to change in your life, you have to be open to change, to new possibilities."}, {"userName": "Alana", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/4625065-alana", "userReview": "The author does state on his website, and at the start of the book, that it was designed to be read in an hour, so I knew the book would be short. However, when I first picked it up I did momentarily think \"This is it? This is all I'm getting for my money?\" That didn't last long. The fact that it can be read in an hour (I read it in a few snatches of time while my toddler was pre-occupied) is actually a big bonus, because I know that it is a book that I will pick up and read again and again over the course of my life, maybe even several times a year when I need a bit of a boost. What you get out of this book is worth far more than the price.The style is conversational and not only do you feel you get to know the writer but that he really is looking out for you and wanting for you to 'get' this new way of living. It feels very personal.This book has indeed given me a whole new outlook on my life and what I want to achieve every day. In fact, I achieved more in the day I read it than I had done all month. It really is inspirational and I heartily recommend that you all go out and buy it or loan it from the library.Today I am 11976 days old. I see 12,000 days as being my next milestone and I want to be able to celebrate on that day and see that I have changed my life for the better and I intend to spend the next 24 days putting everything I have learned into practice."}, {"userName": "Cindy", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/10819180-cindy", "userReview": "Time flies; it goes by faster than we realize it. The urgency of time; the time we have left on this earth to do what we were put here to do; this is the essential message author Robert D. Smith writes about in his “crash course for mastering your life RIGHT NOW”.Smith had the revelation of figuring out just how many days he had lived, and started counting “from day one” at this point. He asks the reader to do the same. Imagine if you were told that you only had 2 months left to live. What would you do? What would you want to accomplish? Who are the people you would contact? These are all answered, or given suggestions to, as presented by the author.Smith suggests being grateful, finding out what matters most to you, and being kind and loving to others, because we never really know how long we will have on this earth.I requested this book to read for two main reasons: One, the title intrigued me, and two, it was meant to be read in an hour or so. (The urgency of time stated again.) I found it an enjoyable read and worth re-reading. The book offers tips and thought provoking exercises, and includes positive self-talk.I received this book in exchange for my honest opinion from Booksneeze.com and Thomas Nelson publishers."}, {"userName": "Paul Gustavson", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/12422469-paul-gustavson", "userReview": "Lots of great nuggets in this book. If you want the most out of life and live it to its potential, then this book is right up your alley. The author starts off reminding us that our days are numbered. That life blows by in a blink. But there are some benefits to recognizing that. One nugget he conveys early on is this: \"Don’t focus on time, but on events themselves. When you control the event, you control your life. Fill these events with people you love. Relationships will be enhanced and memories created.\" (p. 15). Another nugget I particularly liked are the seven questions to ask to start each day. 1. Whose life am I going to brighten today? 2. What three things am I most grateful for today? 3. What memories am I going to create today? 4. What challenge am I going to overcome today? 5. What value am I going to create today? 6. How much joy can I create for others and myself today? 7. What life-changing decision( s) am I going to make today? Bonus Question (just to cover all the bases): What question am I not asking yet today? (pp. 94-95)I think even if you just pick 3 of these questions to start the day -- you've started off on the right foot.Enjoy"}, {"userName": "Patricia", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/6946703-patricia", "userReview": "\"Three o'clock is always too late or too early for anything you want to do.\"Jean-Paul Sartre, FRENCH WRITER, PHILOSOPHER 1905 - 1980Do you spend more time looking back over your life than talking about the future? Are your regrets keeping you from making the most out of the years in front of you? Are you living your life to the fullest? Do you need help making a successful plan for the years in front of you? 20,000 Days & Counting,The Crash Course for Mastering Your Life Right Now is here is help you take the first step and the next to change your thoughts. Robert D. Smith provides the tools to help you change your mind-set.This book is genuine, direct, life changing, inspiring and short. There are quotes you will find yourself repeating throughout the day. This book is life-changing (a statement I do not make lightly!). It is one of those books you will share with others. Enjoy.Notice: A copy of this book was provided by Thomas Nelson for review. The words are my own.A copy of this review appears on \"Dialogue\""}, {"userName": "Cathy", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/5269963-cathy", "userReview": "Just what I needed!This book is your Reset Button to get yourself out of any rut you find yourself in. The wheels will start turning and there will be no stopping your new found creative freedom."}, {"userName": "Andy Anderson", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/3118174-andy-anderson", "userReview": "Good book, easy reading... pretty sobering title and to think I may only have another 10,000 days left... Live with intensity, eat dessert first plus a great chapter on the statement-\"Who do I have to become to achieve ___________(you fill in the blank)?Also a good chapter on admitting I am the problem and now doing something about it. It's way more personal. He suggests to ask two questions to answer: (1) what is important right now to me? (2) What is next?He writes about 7 questions to seize the essence of the day1. Whose life am I going to brighten today?2. What 3 things am I most grateful for today?3. What memories am I going to create today?4. What challenge am I going to overcome today?5. How much joy can I create for others and myself today?6. What value am I going to create today?7. What life-changing decision(s) am I going to make today?"}, {"userName": "Mary", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/4993122-mary", "userReview": "A strong message of encouragementRobert D. Smith writes an abridged version of a self-help book to guarantee that everyday counts - making no excuses. He offers his opinions and strategies for success, such as; saying yes to new possibilities, not assuming you are the victim, and never be misled by the hours in a day.Even if you don’t agree with all of Smith’s strategies, 20,000 Days and Counting reads as an expressway to ‘hurry up and decide’ to control your life – specifically the present moment. The book serves as the perfect device to get back on track, or to start creating a track. 20,000 Days and Counting by Robert D. Smith is a short and practical tool one can apply to improve your life - even as you read. Smith practices what he preaches and wastes no time.I’m 21,436 days and counting."}, {"userName": "Farnoosh Brock", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/17483237-farnoosh-brock", "userReview": "No shortage of motivation books out there, that's for sure, but even if it's the same message, delivery matters and I think in this short book, Robert D. Smith manages to pull us in especially since his own wake-up call had been so rude and so poignant.I love and hate the irony of focusing on death so that we can live life more fully now but it's true - if we had forever, we would not seize the moment as there shall be so many more ... since we do not have but a limited time, focusing on the end pulls us right back to the moment when we can do something special for the remaining days.I am giving it a 5 star, I wish it were longer and I do wish there were more stories. I don't know what it is with me and stories but hey, it is a great kick in the gut - with gentleness of course - and a good read I highly recommend."}, {"userName": "Micah Lugg", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/2917801-micah-lugg", "userReview": "I liked \"20,000 Days and Counting\" for several reasons.1. It is short. He wrote it to be read quickly, and at a few pages over 100, that was not hard.2. It is punchy. The book is like a collection of motivational pep talks to help you value every day and live life to the fullest.3. It is truthful. Much of what he writes are echoes of biblical themes and truths, and thus it was easy to agree with it. He writes with wisdom of Eccelesiates to consider the shortness of life, and thus to live life with everything you've got.The monotony and mundaneness of life can lull us into coasting from day to day, but reminders like are found in \"20,000 Days\" help us to snap out of the daze and begin to life intentionally and passionately."}], "description": "Most people sleepwalk through day-to-day existence, passively letting time slip away. Unfortunately, impending death is usually the only thing that can wake people up to the intensity of life.But what if it didn’t have to be that way?What if you were able to• truly discover the driving purpose for your life?• live each day with maximum intensity?• conquer all of your limiting fears?• learn how to accomplish more in one day than most people do in one year?20,000 Days and Counting presents breathtakingly simple strategies and concepts that enable listeners to be 100 percent present and intentional with every passing minute of every day, for the rest of their lives.One hundred years from now, what will you have left behind? What will your legacy be?Are you ready to find out?", "title": "20,000 Days and Counting: The Crash Course for Mastering Your Life Right Now", "url": "https://www.goodreads.com/book/show/18318931-20-000-days-and-counting", "average": 3.88, "cover": "https://images.gr-assets.com/books/1385351251l/18318931.jpg", "reviews": 112, "authors": [{"url": "https://www.goodreads.com/author/show/7065826.Robert_D_Smith", "name": "Robert D.   Smith"}], "type": ["Self Help", "Nonfiction", "Self Help", "Business", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/18318931-20-000-days-and-counting", "http://www.goodreads.com/book/show/15864582-20-000-days-and-counting", "http://www.goodreads.com/book/show/17209597-20000-days-and-counting", "http://www.goodreads.com/book/show/17331956-20-000-days-and-counting", "http://www.goodreads.com/book/show/16692350-20-000-days-and-counting", "http://www.goodreads.com/book/show/19276146-no-brand-is-an-island", "http://www.goodreads.com/book/show/18331965-battle-tested-branding"]}