{"ratings": 23, "userreviews": [{"userName": "Mkittysamom", "userReviewDate": "Jun 13, 2015", "userURL": "http://www.goodreads.com/user/show/9901011-mkittysamom", "userReview": "I really like the background idea of Deadinburgh, I don't want to say because it would give away the plot! Books 1 and 2 were about how Joey and Alys meet. They come from separate communities and were born during the initial outbreak or soon after. Both characters have some pretty mysteriously fun \"parental lineage\". Experiencing the depth of their friendship and their almost superhuman fighting abilities while they strike out on their own, to be free. Well freedom is relative, but that's what they originally believed. Joey and Alys thought they came from oppressed communities. Jock is also a magical character! Book 3 felt like repeats and focuses on what happened before Alys and Joey were born. I thought it was kinda boring, because only a few things revealed were really important, and ...the author played a mean trick on Jock :( I'm sad :( Poor Guy...he gets the poop end of the stick, and turns out to be an amazing guy!! The lidless leader was freaky and made an awesome villain!! I just love the fresh ideas in Deadinburgh!!"}, {"userName": "Jamie Eastman", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/26963491-jamie-eastman", "userReview": "Was goodThis was a great read, had me hooked from the beginning right up until I finished. I don't very often find myself disappointed when I finish simply because I've finished, this one could have kept going and I'd kept reading. Definitely recommend."}, {"userName": "Katelyn", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/26637235-katelyn", "userReview": "I received this from goodreads giveaways. I really liked this book. Pleasantly surprised."}, {"userName": "John Harris", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/18272602-john-harris", "userReview": "As this is a compilation of 4 books I'll split my review up. I'd already read the first book, so that's reviewed elsewhere.Book 2 - 3 stars. After the twist and climax to book 1, I was slightly disappointed by book 2. It was still good, but seemed to take a long time to get going. Always heading towards the final battle, which was very good.Book 3 - 4 stars. This was entirely back story to how we reached the point where the first book starts. It was really good to see how the outbreak started and follow through the journey that a number of the characters had to take to reach where they did. I thought the fleshing out of Bracha was particularly good.Book 4 - 4.5 stars. This one grabbed you and never let go. A number of story strands were running throughout the book, and were all brought together in a blockbuster of an ending. I was surprised by the ending again, but I felt an interesting way to finish. The ironic twist at the end was also very good.Overall, I really enjoyed this series, and I would recommend it. Read the first book and you'll be hooked!"}, {"userName": "Rebecca Conn", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/31028625-rebecca-conn", "userReview": "This book was ok. Not one of my favorites. It took me longer than I expected because I took more breaks than I normally do. I couldn't really get into the book. I read a lot of zombie books and this was in the lower middle of the pack."}], "description": "Collecting Mark Wilson's Bestselling dEaDINBURGH SeriesIncludes: dEaDINBURGH VantagedEaDINBURGH: AlliancesdEaDINBURGH: OriginsDue for publication on April 25th, 2015 by Paddy's Daddy Publishing", "title": "dEaDINBURGH: Collected Edition\n      \n          (Din Eidyn Corpus #1-3)", "url": "https://www.goodreads.com/book/show/24675662-deadinburgh", "average": 4.22, "cover": "https://images.gr-assets.com/books/1441744688l/24675662.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/6151445.Mark_Wilson", "name": "Mark    Wilson"}], "type": ["Horror", "Horror", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24675662-deadinburgh", "http://www.goodreads.com/book/show/24714542-deadinburgh", "http://www.goodreads.com/book/show/20875585-deadinburgh", "http://www.goodreads.com/book/show/24356511-deadinburgh", "http://www.goodreads.com/book/show/18626180-head-boy", "http://www.goodreads.com/book/show/26791432-on-the-seventh-day", "http://www.goodreads.com/book/show/14743931-bobby-s-boy"]}