{"ratings": 295, "userreviews": [{"userName": "Bogdan", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/2537876-bogdan", "userReview": "I knew it! Excellent and brilliant collection of short stories!All of them were very good and enjoyable having a wide range of ideeas and subjects to debate on.The texts aren't very long and this is a plus for the writer that in a short length of words he creates believable characters and unique worlds.Like I said before, I love his writing and ideeas and listening to this audio I wasn't disappointed at all.Recommended!"}, {"userName": "Kev", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/34286166-kev", "userReview": "4.5 stars.An enjoyable selection of short stories from an author whom I like very much. Hope he brings a new novel out soon."}, {"userName": "Cristhian", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/6701436-cristhian", "userReview": "Los cuentos aquí reunidos (11 en total) son en su mayoría buenos, nada extraordinario ni malos. Son de ese tipo de cuentos de buena calidad que encontrarías publicado en alguna revista de vez en cuando.Pero... el cuento que le da nombre al libro es perfecto. No tiene falla alguna. Es más, si lo hubiera publicado solo esta review sería un 5 completamente y de lo mejor que haya encontrado en lo que va del año.Dicho eso y considerando los demás, 3.4/5"}, {"userName": "Jono", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/889539-jono", "userReview": "The title story is excellent and almost worth the price of admission alone. Some of the others are interesting at best, and completely baffling and skippable, at worst."}, {"userName": "Darren Dilnott", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/24963189-darren-dilnott", "userReview": "If there is a finer, more original collection of short stories than Peter Clines Dead Men Can't Complain, i'd really, really like to read it. Astonishing journey that twists and winds in unexpected directions.Mixtures of Lovecraft, and other Peter Clines characters makes this a collection an incredible journey that is well worth the time."}, {"userName": "Annie", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "I loved these short stories, and maybe they will tie me over until Peter can give us a new one...WRITE FASTER MR CLINES!!!!! LOL This was well written, narrated and a great listen for any true fan...dont hesitate buy it now!!"}, {"userName": "Bikram", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/66172797-bikram", "userReview": "This is the second short story collection that I've read in recent times and I loved this one too. (I guess I should pick up more anthologies.) Some of the stories truly have unexpected twists (first and fourth story, both involving time machines, ) that blew my mind, while others' twists were kinda apparent (story #2 about the superhero, #6 about resurrection, and the last story.) from the very beginning. Couple of stories were simply good because of their content, without needing any twists - story #7 about the student studying zombies, the story about a robot finding Man and the title story. The other 3 of the total 11 stories were meh. Not boring or bad; just not as good as the others. So, overall a pretty good book.The narration was top notch too. I was drawn into each of the story and it was like watching a netflix series.Definitely would recommend."}, {"userName": "Jami", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/5777523-jami", "userReview": "So, what is not to like about the writing of Peter Clines paired with Ray Porter's voice?!?!? This was an excellent compilation of short stories that were well narrated by both narrators. I particularly enjoyed the first short story (the title escapes me) and the title story. The stories were of varying lengths and all of them kept my interest. The only complaint I have is that some of them ended too abruptly; but perhaps that is just a sign that they were so good that I wanted more! The abrupt endings of some of the stories was what kept this from being a 5 star rating."}, {"userName": "MGMaudlin", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/3429191-mgmaudlin", "userReview": "I am a fan of Peter Clines, especially of his novels 14 and THE FOLD, but these short stories, while well crafted, read more like experimental scenes from possible novels than true short stories. Yes, they wrap up fine and have Twilight Zone twists at the end, but in most of the cases some vital ingredient is missing, making them bits of entertainment rather than memorable stories."}, {"userName": "Renny Barcelos", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/10326578-renny-barcelos", "userReview": "Peter Clines is truly a wonderful author. I usually don't care about short stories, can't get engaged in such a small frame and then suddenly it's over, but these? They are all gold. He tells one hell of a good story after another in just some minutes (audiobook version). Can't wait for the next full novel."}, {"userName": "Ryan", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/10495729-ryan", "userReview": "Listened via Audible (this is an Audible exclusive). This is a collection of sci-fi/horror/futuristic short stories, and it was GREAT! I've read (technically listened) to a few other Clines books and they've all been amazing - this was no different. If you want an easy, interesting, and nerdy listen for your commute, I highly recommend!"}, {"userName": "Shane", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/4175210-shane", "userReview": "Great collection of short stories. They all fall some where in the horror and or science fiction genre. There is even a story set in the Ex-verse for those lime me clamoring for more of that story. The readers are top notch and I think it will be great on a second or third listen as well."}, {"userName": "R. Andrew Lamonica", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/12033764-r-andrew-lamonica", "userReview": "Wow. Some fun stuff in here. Usually short-story collections from novelists feel like someone just emptied their drawer of all the stuff that they couldn't make work as a novel. But, if these is Peter Clines' fail-bin, I'm really excited about whatever he writes next."}, {"userName": "Perry", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/10785790-perry", "userReview": "The more I read of Peter Clines, the more fucking I WANT to read. Pretty solid mix of short stories here. The first two especially did a lot to hook me hard. The rest were a fairly strong mix without any serious bad apples in the bunch."}, {"userName": "Melody", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/10157381-melody", "userReview": "Having fun listening to this book!"}, {"userName": "Donna", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/9403127-donna", "userReview": "Another fun read from Peter Clines! Zombies, aliens, machinery-gizmos, noir -- all good stuff."}, {"userName": "Rolando Gill", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/5004167-rolando-gill", "userReview": "Peter Clines does not disappoint. There are some great stories in here."}, {"userName": "Robin", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/11154802-robin", "userReview": "Would love to see a bunch of these turn into full stories."}, {"userName": "Anthony", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/2122277-anthony", "userReview": "A short but very fun book. Twilight Zone meets Black Mirror."}, {"userName": "oli", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/53388935-oli", "userReview": "road trip audiobook #2"}, {"userName": "Kat Jenkins", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/13356242-kat-jenkins", "userReview": "Wonderful short stories by this endlessly inventive author!!"}, {"userName": "Heather", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/37054920-heather", "userReview": "Fun collection! My favorite was Red-necromancy; it made me LOL."}, {"userName": "Chris Pederson", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/18406339-chris-pederson", "userReview": "LOVED every story and there was even an ex-heroes epilogue."}, {"userName": "Marj", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/1782554-marj", "userReview": "Solid collection of well-narrated short stories-- creepy, unsettling, clever."}, {"userName": "Chris Antonio", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/5588659-chris-antonio", "userReview": "Good selection of fun/weird/creepy short stories. Be advised that there aren't any \"hollywood endings\" and you need to be able to cope with a stories that don't get wrapped up nicely."}, {"userName": "Khris Reaves", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/25313458-khris-reaves", "userReview": "Great collection of stories!"}, {"userName": "Josh", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/9642652-josh", "userReview": "The last short was my favorite. Would reef the hell out of it as a full novel."}, {"userName": "Arnór", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/7412113-arn-r", "userReview": "Short stories that reveal the markings of this excellent and intriguing author."}, {"userName": "Ofer", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/7527204-ofer", "userReview": "Not bad for short stories. Now, where is my follow up to 14 and fold?!"}, {"userName": "Jeannie", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/12132892-jeannie", "userReview": "Interesting stories. As mentioned in other reviews, I think some of these would make great novels. I really enjoy Peter Clines' writing and only wish this was a longer book full stories."}], "description": "A cop interrogates a perp in a lizard costume that seems all too real.An all-powerful superhero protects his city - and they better like it.An average Joe finds out that being undead isn't all that it's cracked up to be.Including three never-before-published stories, Dead Men Can't Complain is the first-ever collection of short fiction by Peter Clines, author of 14, The Fold, and other Audible smash hits. Combining equal parts geekery and humor with the occasional dash of horror, Dead Men Can't Complain is ideal for Clines fans eagerly awaiting his next novel - or for brand-new listeners discovering this Audible favorite for the first time.", "title": "Dead Men Can't Complain and Other Stories", "url": "http://www.goodreads.com/book/show/35222799-dead-men-can-t-complain-and-other-stories", "average": 4.05, "cover": "", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/3396842.Peter_Clines", "name": "Peter Clines"}], "type": ["Horror", "Science Fiction", "Fantasy", "Short Stories", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/35222799-dead-men-can-t-complain-and-other-stories", "http://www.goodreads.com/book/show/35391339-dead-men-can-t-complain-and-other-stories", "http://www.goodreads.com/book/show/15062217-14", "http://www.goodreads.com/book/show/23164927-the-fold", "http://www.goodreads.com/book/show/16479439-ex-heroes", "http://www.goodreads.com/book/show/17229633-ex-communication", "http://www.goodreads.com/book/show/17162429-ex-patriots"]}