{"ratings": 301, "userreviews": [{"userName": "Jason Koivu", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "After being attacked by some underworld thugs, instead of a rolling over and playing the victim, a couple decides to get revenge on their attackers. This was originally one of Donald Westlake's (aka Richard Stark) ideas, which his friend Lawrence Block asked to use since Westlake didn't think he would ever have the time to get around to it. As Richard Stark, he was busy pumping out volumes in his Parker series. Block took the idea and ran with it. Without realizing it, his course veered somewhat from Westlake's original idea, so by the time he was done, he had completed his own book, one that would not have existed without his personal touch.The story itself is solid. The execution is decent. Since Block's career spans from the '50s to today, this late '60s book could be called an early work. As such it suffers somewhat. Block's easy, flowing style wouldn't really click into place until the '70s. So Deadly Honeymoon feels a little stiff in places. Generally it's not bad, but for instance, towards the beginning the narrative skips an emotional beat and that threw me off for a while. I needed the closure of a certain reaction from one of the two main characters that I didn't get and didn't set right with me. It took a while for me to get over it and except that it just wasn't going to happen. Eventually though, the thrilling tale that is this book took over and I could enjoy it to its satisfying conclusion."}, {"userName": "Dan Schwent", "userReviewDate": "Jul 02, 2010", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "Dave and Jill are just beginning their honeymoon when they witness a murder. The killers give Dave a savage beating and rape Jill while Dave can only listen helplessly. But they made one mistake. They let them live...Deadly Honeymoon is a fairly standard revenge plot, masterfully paced by the esteemed Lawrence Block. I picked this up after reading about it in Telling Lies for Fun and Profit, Block's spectacular writing book. It's a good example of building suspense.Dave and Jill aren't hugely detailed characters. Block's done a lot better but this was really early in his career. The couple's tracking down of their enemies was believable and well done. The story felt a little dated at times but was still an enjoyable read. It was almost orgasmic when the hitmen finally got what was coming to them."}, {"userName": "Tfitoby", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "Second go round with this book, the first time I've encountered this bug in the GR engine that doesn't allow you to read the same book several times. Needless to say it's still impressive and highly influential to me.Yet another quick and enjoyable read from the Grand Master.This standalone Block is the story of a young couple beaten and raped on their honeymoon who decide that their own revenge rather than talking to the police is the best course of action.Block (apparently with the guidance of Donald E. Westlake) sets out to tell this very specific story and doesn't deviate from the path for even a second. This is not a brilliant piece of noir but it's a purely entertaining pulp novel from start to finish told with a kitchen sink kind of naturalness that appeals to me a great deal; he spends as much time on looking at maps and discussing driving directions as he does to the violence Dave and Jill dish out. In filmic terms this is more Jim Jarmusch than Oliver Stone, more Mike Leigh than Quentin Tarantino, what's not to like?I can't say it's a good example of the great man's large body of work but it's worth a read nonetheless, I haven't read a Block I haven't enjoyed to date and I can't see it happening any time soon."}, {"userName": "Mark", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/2569035-mark", "userReview": "[ with the killing of the bodyguard Carl. The two hitmen were murderers and brutes and, though I am not a vengeful killer myself, I could understand how a young couple so brutalized and cruelly violated might opt to take matters into their own hands and not feel overly destroyed or distraught by doing so but Carl was just doing his job. Dave broke into his house and smashed him over the head with a gun and all Carl was doing was protecting his employer and his own health and yet his murder, cos that is what it was, is eased over by both of the young people with only momentary or at least very little worry or regret. (hide spoiler)]"}, {"userName": "Eric_W", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "It’s wonderful that many books that would have disappeared into the ether never to be read again are being reissued as ebooks. Lawrence Block is resurrecting many of his early books, some written pseudonymously and now released under his true name. Pulp fiction and cheap paperbacks were often the best way for writers to break into the business and to support themselves early in their careers.Deadly Honeymoon is just such an early Block and the first book of his to be optioned for movie rights. It follows David and Jill, newly weds (she’s still a virgin at 24 true to the morays of the fifties) and they are unfortunate enough to witness the mob hit on a man hiding from gangsters in the cabin next to them while on their honeymoon. They are seen and David is beaten while Jill is being raped. They mention none of this to the police who come to investigate the killing, but immediately plot their revenge and much of the book follows their search for the killers about which they know very little. Their investigation presages the detective work of Block’s later protagonists like Scudder.My only complaint, and this is related more to the novella’s anachronistic content, was the prosaic and utterly predictable ending."}, {"userName": "Josh", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "Conceived by Westlake, birthed by Block, 'Deadly Honeymoon' is violent vengeance served in cold blood. Unlikely protagonists and newly weds Dave and Jill were honeymooning at a secluded cabin when they witnessed a mob hit. The hit men then beat Dave and raped Jill taking her humility as well as virginity. Rather than seek justice from the long arm of the law, they embark on a journey to ensure the hit men reap what they sow. The dramatisation and constant battle to maintain a sense of normalcy in such a difficult and tumultuous time sees Jill walk dreamlike through life not knowing if her sleep state is better than wake for her rapists faces haunt her every moment. While Dave's determination and apprehensive blood lust was derived from helplessness as much as it was a want to make things the way they were. Not your run of the mill gun toting protagonists but more accidental hero and all heart. The plot didn't deviate and its delivery was designed to be simple yet effective. I enjoyed 'Deadly Honeymoon' from start to finish - especially the more memorable scenes that turned a wholesome American into Tony Montana in flash of a gun barrel. 4 stars."}, {"userName": "David", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/9497155-david", "userReview": "[There is nothing to prevent Lublin from tracking them down. Dave knocked out several of Lublin's teeth and he doesn't seem like the forgiving kind. (hide spoiler)]"}, {"userName": "Jeff", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/82329-jeff", "userReview": "Great book. Quick read. The plot for this book actually came to Block via Donald Westlake. After Westlake gave him a brief outline of the plot, Block asked him of he was going to write the book. When Westlake told him he wasn't, Block said he'd take a crack at it. It's about couple on their honeymoon who witness a murder, then the murderers knock the guy out and rape his newlywed wife. They then take justice into their own hands."}, {"userName": "John", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/2763719-john", "userReview": "Judging from the title and cover art, I was expecting this to be a horror novel, probably of the slasher variety. What I actually got, though, was a lean 'n mean noir thriller, written in Block's usual hardboiled prose. And though the main characters are a newly-wedded couple seeking violent retribution for a brutal rape, the story plays out like a 50's crime caper rather than a bloodbath-in-waiting.It's a very simple story, told without frills and comprising less than 200 pages. Nothing about the plot particularly stands out, but Block does invest you in the characters right away, and I love how old-fashioned the whole thing is. DEADLY HONEYMOON made me long for the days of public telephones, all-night diners, corner drugstores, newsstands, microfiche, and saving yourself for marriage. I spent every page on the edge of my seat wondering if the newlyweds would ultimately get their revenge...but also whether their relationship would survive the ordeal either way."}, {"userName": "Greg", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/26415033-greg", "userReview": "What starts out as a dream of a honeymoon soon turns into a horrific nightmare for two young and virginal newlyweds. One day into their planned four week sabbatical into blissful domesticity, violence mixed up with unplanned lust destroys their lives. In the blink of an eye, the two victims (the former innocent lovebirds) witness a brutal murder and then become victims of both physical and sexual assault, plan their vengeance and select Justice as their new God, and then re-arrange their lives in order to re-discover the peace that was so cruelly taken from them.DEADLY HONEYMOON is a short book. It should take just on two hours to read but it is a fast paced, action based tale of revenge. It does not possess much poetic worth but there is plenty of satisfaction for a job well done at the end, as well as a happy ending for the story’s heroes. Some books take their time to find their pace, but this one hit a home run right from the opening page. The kind hearted reader (aren’t we all) will fall in love with the two main characters within minutes and that’s really the only emotional attachment you are going to need to enjoy this book. The way the killers are tracked down is very clever; but you can tell the book was written and set in a different era than the one we are blessed to find ourselves living in now. They must breed lawyers tough in the States (or they did back when this book was written), as some of the information gathering was quite brutal. Effective, though.Having just finished this book I am typing away on my virtual keyboard writing this review and i think how easily i could sit down for a re-read of DEADLY HONEYMOON. The opening chapter is fresh and well populated with engaging characters but storm clouds start to gather quickly in the small town of Pomquit so before i do so, i want to make sure the windows and doors are all locked. You don’t know just what the wind will blow in.Another five star read from a fan down under."}, {"userName": "Dave", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/35045983-dave", "userReview": "“Deadly Honeymoon” is a 1967 selection by Lawrence Block. The premise is simple and it has been talked about enough that, to explain it, is not giving anything away. A young couple (Dave and Jill Wade) goes to a motel/cottage complex for their three-week honeymoon. On their wedding night, they hear voices and look out their window and see a man (Joe) they had met in a nearby cabin begging for his life from two hoods who then blow his brains out. When Jill involuntary lets out a scream, the hoods grab the young couple, beat the man to unconsciousness and rape the woman. Figuring they weren’t paid to kill the young couple, they leave them alive. There is not enough information for the young couple to go to the police with, barely one name (a first name perhaps) for one of the hoods and not much of a description. They are shamed by what happened. And, instead of reporting to the authorities what happened, they take off and plot vengeance.What follows is a story about two innocents who decide to hunt down two contract killers in New York City. They don’t know their way around. They don’t have any training. They have three weeks to do it before anyone from their hometown starts missing them. But, they go up against mobsters and well-heeled hoods in a way that surprises them. Although at first the reader wonders if the story will hold together, it does succeed because of the sparse prose that Block uses and because Block humanizes these two characters, showing how the incident changes them and their thirst for vengeance strips their innocence. Block also shows the awkwardness between the young lovers after the incident.Although at times, Dave and Jill speak as though they have read many mystery stories, the story succeeds and does so quite well. At times, the story feels dated, it is a solid read."}, {"userName": "Heath Lowrance", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/7717194-heath-lowrance", "userReview": "In essence, this is a simple, relentless revenge tale. Dave and Jill are young newlyweds on their honeymoon, bright-eyed and eager for the future, until they witness a murder and become victims themselves—the bad guys beat Dave senseless, and, almost on a whim, brutally rape Jill. Thankfully, Block doesn’t go into detail on this (after all, who wants to read a rape scene?) but in his clinical, almost detached vagueness, Block succeeds in horrifying you. It’s the sudden shift that does it, the juxtaposition of a young couple so happy and naïve just pages earlier, confronted with a sort of violence they never could have conceived of.Instead of going to the police, Dave and Jill decide to take matters into their own hands. Something has been taken away from them, they feel; something that can only be paid for in blood.The two of them go to New York on the trail of the enemy, and over the course of tracking them down discover how deep the darkness in their own hearts goes. They still love each other, still want each other, but their desire for vengeance tests everything they think they know about themselves. DEADLY HONEYMOON is an immensely satisfying novel, moving along at a breakneck pace, lingering only briefly on their fumbling and bittersweet attempts to hold onto each other. A lot of the anxiety in reading it comes from your fear that, after all this, will they ever be able to return to any sort of normalcy. And Lawrence Block keeps you on edge about that until the final pages.An absolutely top-notch, brilliant novel."}, {"userName": "Kurt Reichenbaugh", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/3797062-kurt-reichenbaugh", "userReview": "A revenge tale about a likable young couple, just married and looking for a quiet private honeymoon together. Instead they run into a couple of sociopathic hitmen. It's a lean novel, short and tense. No room, no time and no regard for questioning the meaning of it all, Dave and Jill are going to find the men that hurt them, and make them pay."}, {"userName": "David Macpherson", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/3181924-david-macpherson", "userReview": "Fast, mean little book of revenge. A honeymooning couple comes across two contract killers. They beat him and rape her. The couple don't tell the cops. They go to New YOrk City and track and kill the two hit men. It was taut and violent and wasn't long enough to be annoying or to over stay its welcome. Well written of course, because Block is a fine craftsman."}, {"userName": "Angela", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/21912064-angela", "userReview": "It was ok. My first time reading this author. Not sure yet if it is his writing style or the generation style, but not my favorite ever. Plus there was a lot of the story that you just have to take for face value and not think about all the holes/flaws in the story."}, {"userName": "Joe Newell", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/4517273-joe-newell", "userReview": "It was a decent read. Especially interesting was the era the book was written in,1967 is now 50 years ago. So many changes in the world."}, {"userName": "Diane", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/4767034-diane", "userReview": "I has such a good time listening to this, I started it over when it was done."}, {"userName": "Bill Balhorn", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/71142114-bill-balhorn", "userReview": "Ok"}, {"userName": "Cathy Houston", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/2201014-cathy-houston", "userReview": "unusual idea well developed"}, {"userName": "Nick", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/6348204-nick", "userReview": "I often wondered why many famous authors make it difficult for readers to sample their very early work. After reading Deadly Honeymoon I think I might have the answer. Up front I have to say that Lawrence Block is one of my favourite authors and Matt Scudder one of my favourite characters in the crime fiction world. So when Mr Block started e-publishing and promoting some of his very early work I thought I would have a look.Deadly Honeymoon is a straight out and out revenge tale. A young couple on their honeymoon witness a gangland murder and then the two hitmen decide to beat the husband and rape the wife. The reason they don't kill them is because one of the goons decides \"I don't like killing nobody without I get paid for it\". Then in less than half a page of dialogue the couple decide they will head to New York, track the two men down, and kill them.What follows is a very,very linear story with more detail given to street directions than fleshing out the characters. Interestingly Block says in the afterword that Gold Medal (who had published some of his other earlier stories) turned this book down.Full kudos to Lawrence Block for making his earlier work available to readers. If you are a Block fan this may be of interest to you. If you want to sample his earlier work I would suggest those books published by Hard Case Crime which are much stronger than this. If you are new to Block don't start here!"}, {"userName": "Matt", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/5726052-matt", "userReview": "Early Lawrence Block from before he started using his sense of humor. A great hook here: Newly-wed virgins (I guess this was written at a time when this still happened) are about to spend the first night of their three week honeymoon at a remote cabin. Instead, they witness a gangland-style execution. The killers beat up the guy and rape the girl. They're young, scared and devastated. So what do they decide to do? Take the three weeks of vacation they still have and track down the killers and get their revenge. Whoo-hoo.The evolution from naive kids to expert detectives and stone-cold killers is a little far fetched, but its a lot of brutal fun. Some of their investigation techniques, like calling the police and pretending to be an out of town reporter, are ones that Block uses again in later books as examples of bad sleuthing. I'm sure this was intentional on his part.Lawrence Block has become my favorite genre writer. Even before he got down his style-chops and unleashed his sense of humor, he was cranking out this sort of delicious drugstore paperback work."}, {"userName": "C-shaw", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/2663695-c-shaw", "userReview": "This 1967 mystery by \"potboiler\" author Lawrence Block was recommended in the _Murder Is Binding_ mystery I just read. It's a good one, a quick read, about a couple who get involved with murder on their wedding night.* * * * *I thoroughly enjoyed the story, which was originally the idea of Block's good friend, Donald Westlake. It makes me want to read Westlake's \"Parker\" stories and other 1960s mystery and detective stories, on which I cut my reading \"teeth,\" and a genre I haven't read in years. It was so funny to read about New York City in the 1960s: people were located when only their first names were known, a hotel room was $5.50, boarding houses had shared bathrooms and men always shaved and wore suits and ties. Diners abounded in the city and folks routinely smoked in them. Tee hee."}, {"userName": "Molly", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/4316841-molly", "userReview": "I think I got this book since it was a cheap book for kindle. It is a story of revenge and moves slowly in parts. However, it was a hoot to read for a totally different reason. It was written in 1967 so it was entertaining to me to have characters using pay phones, looking at evening versions of newspapers, using typewriters, and paper maps to choose a travel route. They smoked nonstop and there were a couple scenes where I kept thinking how different this would be if they could text!"}, {"userName": "Barbara Walsh", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/33812519-barbara-walsh", "userReview": "I liked this book and found myself looking for opportunities to read it during a busy work week. A young newlywed couple combine their resources to hunt down two killers who interrupted their honeymoon plans. The couple stay calm and level headed during their search and exact revenge on their own terms."}, {"userName": "Alan", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/715998-alan", "userReview": "OK. Not one of Block's best. It doesn't feature any of his regular characters and it is in fact an improbable story of a honeymoon couple who witness a murder and then go after the professional killers who did the deed. In fact, that's the interest, amateurs against so called pros. If it was Donald Westlkae, this would be comic. Here, maybe a little too serious."}, {"userName": "Carrie Garza", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/26467461-carrie-garza", "userReview": "An old book. Found it in sack of books passed along to me,A young couple on their honeymoon are brutalized by a couple of hitmen and set out to exact revenge. It is well written and tje story flows easily, even if a little unbelievable. Written in the 60's it is very interesting to read about what was modern at the time. And there is a drive by shooting. Overall a lot of violence."}, {"userName": "Patrick", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/1225802-patrick", "userReview": "A pretty generic thriller about a newlywed couple who run afoul of hired goons and meticulously take their vengeance. Again it's funny how long it took back in the 60s to find information that these days would take ten seconds on Google."}, {"userName": "Steven", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/159477-steven", "userReview": "This is one of my favorite of Block's early noir novels. He'd clearly been studying up on his buddy Westlake's Parker novels; it has that sensibility. Basic revenge plot. Honeymooners witness a murder and the hit men rape the wife. Honeymooners decide to track the hit men down and kill them."}, {"userName": "Dave", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/977989-dave", "userReview": "Early, pulpy Lawrence Block--very quick read. Not as rote as it seems at first--pretty neat. And pleasantly full of grimy NY: diners, getting lost, Gramercy Park, pay phones, riding the train to the end of the line. Writing by Walking Around."}, {"userName": "Bosley", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/1937408-bosley", "userReview": "Block by the numbers; revenge by the numbers ... An early, slightly exploitative story by a young master who had not quite mastered the reality of human condition. Engrossing, but a little naive at times."}], "description": "The Third in a Series of ibooks Reissues of Mysteries by Multi-Award-Winning Author, LAWRENCE BLOCK! It was a perfect setting for a honeymoon -- a charming little cabin in the isolated Pennsylvania woods. It should have been the perfect beginning to a long and happy marriage. Then five shots rang out in the quiet woods and shattered Dave and Jill Wade's perfect honeymoon. Terror had come crashing through their cabin door, snuffing out all thoughts of love. Now all that Dave and Jill Wade felt was haste -- hate and the overwhelming desire for revenge.", "title": "Deadly Honeymoon", "url": "http://www.goodreads.com/book/show/442733.Deadly_Honeymoon", "average": 3.35, "cover": "https://images.gr-assets.com/books/1174814321l/442733.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/17613.Lawrence_Block", "name": "Lawrence Block"}], "type": ["Fiction", "Mystery", "Thriller", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/442733.Deadly_Honeymoon", "http://www.goodreads.com/book/show/1417052.Deadly_Honeymoon", "http://www.goodreads.com/book/show/12090303-deadly-honeymoon", "http://www.goodreads.com/book/show/17699486-deadly-honeymoon", "http://www.goodreads.com/book/show/27190348-deadly-honeymoon", "http://www.goodreads.com/book/show/39507.The_Sins_of_the_Fathers", "http://www.goodreads.com/book/show/76758.Eight_Million_Ways_to_Die", "http://www.goodreads.com/book/show/132111.When_the_Sacred_Ginmill_Closes", "http://www.goodreads.com/book/show/402739.Burglars_Can_t_Be_Choosers", "http://www.goodreads.com/book/show/380563.Hit_Man", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}