{"ratings": 67, "userreviews": [{"userName": "Angela Verdenius", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/11378467-angela-verdenius", "userReview": "This series has it all! Long-running, so much happening, so may different situations, so much danger. I never know what is going to happen in this series, and trust me, no one is safe!"}, {"userName": "Colin", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/25287731-colin", "userReview": "Simply brilliant if your a fan of The Walking Dead then this is the one for you every chapter ends on a knife edge as does every book I have read six volumes now and still can't get enough Ryan Casey is a brilliant writer who keeps you on the edge of your seat throughout"}, {"userName": "Harrison J. Lamb", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/57125349-harrison-j-lamb", "userReview": "- 3.5 STARS -Pretty good, entertaining story for the most part, and very fast-paced; the chapters are shorter (but there are more of them per episode), and short, one-sentence paragraphs are often used to give the writing a sense of speed. The story picks up with the group's struggle to escape from the horrors that they ran into at the BLZ in the last book's conclusion, and it's as you'd expect -- a lot of bloodshed and fear. There are some really nice, emotional scenes in this one, and zombie-killing scenes that are sure to satisfy fans of the zombie genre. However, I don't quite know how to feel about the Orions; on one hand they are kind of unbelievable and science-fictioney, but on the other hand they bring something new to the undead threat and make them scarier, which is a good thing. I think, overall, you'll enjoy this book if you love Dead Days, but if you just want a classic Walking-Dead-style zombie survival tale, then some elements might sway you from liking this book. It certainly brings something fresh to the table."}, {"userName": "Daniel A. Daniel", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/32251400-daniel-a-daniel", "userReview": "Great saga! On to number6!Like the previous books, this one is full of surprises and keeps you reading much longer than planned. I am now starting on the Sixth installment and also am going to start the new series \"Chloe\", I highly recommend this series if you are a fan of the Zombie genre!"}, {"userName": "The Talented Miss Ripley ", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/3627855-the-talented-miss-ripley", "userReview": "I can't explain how excited I was to get this book. Ryan Casey did not disappoint.Riley's quest to keep his humanity, his fear of losing the people he care about, his new family have all come to a screeching halt. Riley finds out the truth and it's a dousey! (If that's how it's spelled) incredible read. I recommend this book to all the people who love love zombies! I'm off to read Chloe!"}, {"userName": "Mike Purdin", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/43461723-mike-purdin", "userReview": "Fun readReally enjoyed all five seasons, hope there are more. Need to read the Chloe books. Have to be good. Looking forward"}], "description": "This collection contains the complete fifth season of thrilling zombie apocalypse saga, Dead Days -- all SIX episodes (episodes 25-30) that make up the fifth series. Save 60% versus buying the episodes individually!\n__________________________THE FIFTH SEASON OF THE HIT POST APOCALYPTIC SERIALIn October 2013, a chaotic infection spread across Britain, turning the majority of the population into bloodthirsty zombies.The weak fell. Many of the strong fell, too. The only survivors were those willing to sink to the most brutal depths of humanity in order to further their own existence.Dead Days is the story of a group of those survivors.Season Five of the thrilling, suspenseful post apocalyptic series picks up right after Season Four's devastating conclusion. The journey to the BLZ is over. Our survivors' lives hang in the balance. Terrifying new horrors lurk around every corner of this living hell...Who will escape? Who will survive?And even if they do, will they be able to handle a staggering new truth?A horrifying truth that reveals itself as Season Five hurtles towards its conclusion?One thing is for certain...There will be blood. There will be tears. In the Dead Days, nobody is safe.With fast-paced zombie action and gripping character scenarios, Dead Days is a truly unmissable serial adventure. Scroll up and buy the complete season five now. You'll be hooked on every twist and turn, right through to the game-changing final page...Abre Los Ojos.", "title": "Dead Days: The Complete Season Five Collection (Books 25-30) (Dead Days Box Set)", "url": "http://www.goodreads.com/book/show/25625641-dead-days", "average": 4.55, "cover": "https://images.gr-assets.com/books/1441565494l/25625641.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/5587490.Ryan_Casey", "name": "Ryan Casey"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/25625641-dead-days", "http://www.goodreads.com/book/show/18877604-dying-eyes", "http://www.goodreads.com/book/show/19251209-dead-days", "http://www.goodreads.com/book/show/34845415-the-world-after", "http://www.goodreads.com/book/show/25220786-infection-z", "http://www.goodreads.com/book/show/32794967-blackout"]}