{"ratings": 828, "userreviews": [{"userName": "Maria", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/3448004-maria", "userReview": "Interestingly enough, I was only asked to review the first book in the Deadlocked series. But it was so short (they're all novellas) and so good, that I had to read the rest! Deadlocked starts off as your average zombie apocolypse story - although you learn pretty early on that the virus may have been may have been brought on intentionally as an act of bio-terrorism. I found the mystery to be exciting and thrilling - especially considering I could totally see see this happening in our world today! But of course, my favorite part were the...ZOMBIES!When it comes to the disgusting, man-eating creatures, A.R. Wise does not disappoint! His zombies move a little faster than others I've read about, they can walk underwater, and change within a matter of hours after death. It was great! LOL. Their ruthless pursuit of flesh makes every moment terrifying. Even as you read, you want to make the characters hurry up and you practically want to shout at them! And speaking of the characters - I loved them all - every single one. There are only a handful that last throughout all four novellas and I love that Wise was not afraid to kill some of our favorites - it made the story all the more realistic. The character of Laura, a mom desperately trying to make sure her kids stay safe, is the most bad-ass character I've read in a long while. She lives through some crazy painful experiences just to keep her children from turning into zombies. Her risk-taking courage is actually quite inspiring. 5 out of 5 stars!"}, {"userName": "Tabatha", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/12373776-tabatha", "userReview": "As with the first one, I Could not put this book down! I'm a huge Walking Dead fan and just post apocalyptic books in general and these do not disappoint!!"}, {"userName": "Kimberly", "userReviewDate": "Jul 26, 2013", "userURL": "http://www.goodreads.com/user/show/9399899-kimberly", "userReview": "*Squeals* OMG!!! AHH!! I LOVE THIS SERIES!!! Ahem.. now that I've sorta calmed myself, we can discuss the book. All I have to say is... read this series. If you love zombies, you'll love this. The images that A.R. Wise creates in my mind are shocking, horrifying and just unbelievably amazing!! One of the best authors for a zombie series I've ever read. I can't stop thinking back on what happened in the book and saying, \"Oh my god!\""}, {"userName": "Rinny Rainwind", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/23473130-rinny-rainwind", "userReview": "Hmmmmmm"}, {"userName": "Michael Young", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/38508908-michael-young", "userReview": "This is an excellent series. I have been reading zombie literature and post-apocalyptic fiction for an embarrassingly long time now and Mr. Wise's series is one of the top ten for me. To go into more detail I would reveal spoilers so I will shut up. At any rate, if you are on the fence with this series I obviously recommend it."}, {"userName": "Jackie", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/5962759-jackie", "userReview": "This is an fun, interesting continuation of a zombie story. I love how the story changed perspective in this novella (it sort of had to), but you don`t loose your interest at all. I`m excited to read the next one."}, {"userName": "Unapologetic_Bookaholic", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/1125077-unapologetic-bookaholic", "userReview": "I read the author's note on each book. It is great to get the behind the scenes perspective on the story.I have my own emotional reaction which is....I like it enough to want to continue learning about the fate of each character. My thoughts and perspective on this series is there is a lot of planning that went into the storyline. The writing is very lean. A lot of \"she said\" for describing the dialog. I was always told never to use that word, but I'm not taking away any points in my opinion on the overall story. In conclusion if you're interested in reading about a unique zombie apocalypse. Give this series a try. No style points for descriptive writing but there are some terrific one liners for ya!"}, {"userName": "Sandy", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/8578711-sandy", "userReview": "Guys…seriously…intense zombie-ness! Book 1 follows David as the main character in his attempt to find his wife and daughter in the beginning of a very new zombie outbreak. We meet up with Laura and the girls, Kim and Annie, at the end of book 1. That installment ends with David’s ultimate sacrifice for his family. Picking up with book 2, we switch to Laura’s point of view as she watches her husband's sacrifice and realizes that she too is willing to do anything for her girls. Laura’s story is extremely intense and emotional even more so than David’s was. Laura does things in this book that blew me away. Whatever it takes. Not only does she have to protect her daughters from zombies, but also, even more so in this book, from the remaining human populace that’s seemingly lost all of their morals. Survival of the fittest abounds—kill or be killed. And despite rooting for the main characters, I saw the logic in a lot of the arguments from the other humans they ran into. The couple they came across on the boat…while I agree that the husband was a bit of a DB, he had some good points. Same thing with the “cops” who need to feed the masses they’ve assembled. Normal rules of \"what’s mine is mine and what’s your’s is your’s\" just do not apply anymore. It’s more like \"what’s your’s is mine as long as I can take it from you.\" Despite being a short book, AR Wise packed Deadlocked 2 with more action and story than some books 5 times the size, and I’m excitedly looking forward to continuing the story with Billy’s point of view in book 3. AR Wise yet again added an author’s note to the end of this book. And on the one hand, it could easily come off as boasting how he describes all of his writing “tricks”—I can’t think of a better word there—such as mirroring the scene where David jumps into the water and being pulled under by zombies from book 1 to Laura’s scene in the water being pulled under by a shark, and how everything ties in together. And maybe I’m just dense, but I didn’t pick up on everything he explained in the author’s note while reading the book, so it actually made the book that much better for me (I did get the similarities of the specific scene I mentioned with the water though—I’m not that dense). So I’m torn between thinking it would have been better for AR Wise to let the reader discover all of this themselves, and feeling like he’s just so excited about his story that he can’t help but share as much of the story and the process as he can. Plus as I said, I didn’t pick up on all of the things he discussed in the author’s note, so I’m happy to know them now. They enrich the story. All in all, Deadlocked 2 gets 4 Stars from me. If you're looking for a quick, intense read involving zombies, it doesn't get much better than the Deadlocked series. Have you read Deadlocked 2? What did you think? Let me know!"}, {"userName": "chucklesthescot", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "After the shocking end of book one which I loved, we pick up from where we left off. So if you haven't read the first Deadlocked book and plan to at some point, it would be a good idea not to read on with this review as I'm going to talk about the end of that book which is the start of this one!Laura becomes the narrator of the book after the death of her husband David, who died with Billy's father to allow them time to escape in their boat. Now Billy aims to look after Laura and her daughters Kim and Annie and get them somewhere safe until they can decide what to do next. After trying to help rather ungrateful survivors, they have a run in with would be thieves who are dressed as cops. What they find out is that the food that David and Laura took from the school is contaminated and anything eaten raw could infect them. Billy is determined to head into the city to see if his mother survived the attack, leaving a worried Laura hidden on the boat with the girls, watching in fear as Annie starts to exhibit signs of infection. Laura knows that there is a cure but it means leaving the girls alone and heading alone into the city to find a pharmacy.This wasn't as good as the original story and I did find certain aspects of it a bit far fetched. The journey down the river was pretty darn bizarre and each event seemed to get crazier as we went along. I didn't think that she or Billy showed a lot of common sense or did much to keep the girls safe! Still, it was entertaining enough for me to decide to go on and read the next book, which covers Billy's adventures in the city. That is a bit annoying after the cliffhanger end to book two, so we need to wait to book four to see what happens to the girls.Overall, I'm a bit concerned about where the book is going plot wise. I like Laura and Billy as characters, but this seemed to be less about the zombie outbreak than we saw in the first book and starting on the road towards government conspiracy or bioweapons gone wrong or something like that. Still, we'll see what happens next."}, {"userName": "Ren", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/1533037-ren", "userReview": "[they passed underneath the suicide bridge, I rooted as Laura swung the baseball bat, swore when those fucks from earlier sent the \"police\" after them, and even came come to tears by the end. (hide spoiler)]"}, {"userName": "Stormy", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/5883218-stormy", "userReview": "I am not sure how many times I can say that I love A.R. Wise, and I love this series. Each book has left me breathless, and wanting to know what happens next. Deadlocked 2, starts off right where Deadlocked leaves off. We follow Laura, in her journey as she is still grieving the loss of her husband, David. We see that in the beginning she is a timid scared woman. But she quickly realizes that her daughters survival and her own depends on souly her. She steps up her game, and becomes a Mama Bear. Willing to do whatever it takes to ensure her little girls safety even if it means sacrificing herself. . I love the developing relationship between her and Billy. I do not believe it was ever meant to be a romantic relationship, it's the type of relationship that I think anybody fighting for their lives together would build. They quickly become a small family unit, willing to do whatever to protect what they have. Their bantor between each other is often times comical, and I found myself laughing at loud lots of times. Again, one of my favorite parts of these books are the Authors notes. I have quickly come to appreciate them, and I wish more authors would include these into their books too. I love getting to know Wise's motives, and train of thought. This makes it to where I am not wondering around aimlessly after reading these books wondering why in the hell would the author do something like that!? He answers all of our questions at the end of each book, and leads us into the next one. High Five to A.R. Wise for this! And as an advide reader, I thank him! I really do not think you will be disappointed in these books, I think even if you aren't into the Zombie genre, this series will make you change your mind! There is lots of zombie action, but on top of that this book, all of these books have depth and structure, plot, and awesome characters making it so much more than Zombie horde gallore. Off to the next book!!!"}, {"userName": "Kat", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/3835702-kat", "userReview": "As soon as I finished the first Deadlocked novella I immediately went and bought the next 3 in the series, and book 5 as soon as it was available. I love a good, hardcore zombie tale, and this is a series that definitely hasn't disappointed me so far.After the first novella in which David witnesses the beginning of the zombie outbreak and goes through every terror imaginable to resuce his wife and young daughters, the perspective shifts to that of his wife, Laura. As she fights to protect her daughters not just from the undead but the humans that are starting to take advantage of other survivors, she endures some pretty hairy situations, but never gives up on her goal.To put it simply, Deadlocked 2 is the story of the incredible lengths a mother will go to in order to protect her child. Emotional, action-packed and perfectly gory, Deadlocked 2 is the perfect example of how a zombie novella can really work - the characterisation is perfectly balanced with the zombies, and at the end, I couldn't wait to get to the next installment.Deadlocked is a series that I truly enjoy and highly recommend to any zombie lovers, or even as a first foray into the world of the walking dead!Read more of my reviews at The Aussie Zombie"}, {"userName": "The Digital Ink  Spot", "userReviewDate": "Jan 21, 2012", "userURL": "http://www.goodreads.com/user/show/7493592-the-digital-ink-spot", "userReview": "Deadlocked 2 starts right where Deadlocked left off. David's wife, Laura is in momma bear mode and is doing what she has to do to protect her children and the things she does are off the charts. I am surprised by the lengths Laura will go to stay alive. She is a real fighter is putting it lightlyI loved the first book and this was even better than the first. It is a great story unto itself but it also adds to the over all story arc created by Wise in this four part series. I have the third part on my To Read List on Goodreads. What we learn in this 2nd story is that the zombie apocalypse is not by accident. (when is it ever) Laura stumbles across a couple of men who say they know what is behind this mayhem. How she handles those men is pretty hardcore.The amazing thing and one reason why I like Wise's writing is because he gives insight to his characters and how they cope with death and killing. They change and the characters are aware of the changes in themselves. It's refreshing to find an author who writes in this genre and writes well.This book and this series is well worth your time."}, {"userName": "Holly", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/6556991-holly", "userReview": "Um, can you say DISGUSTING? This book had me getting a bit queasy at times. Blech! True zombie horror to the max! What I loved about this book aside from the horror factor, was the extreme protectiveness of a mother to do whatever it takes to protect her children. Even when that means putting herself in danger. That's real life and the author captured the essence of that aspect of motherhood very well in this story.You want blood and guts and flesh eating? This book has it! You want a story about survival and how the drive for self preservation affects humans, for the good and the bad? This book has that too!Favorite quotes:\"I was the only hope she had of a cure. If I stayed here, she would die, and so I forced myself to stand.\"\"There was nothing left of the humble, kind, timid woman that I'd been that morning. I'd become something else entirely.\"4.5 stars for the sheer terror and gross factors alone! Very strong language and as such not intended for younger readers."}, {"userName": "Nancy (The Avid Reader)", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/7149266-nancy-the-avid-reader", "userReview": "The following review is my opinion and not a paid review. I was given a copy of Deadlocked from the author for a review.The second book in this series starts off right where the first one ended. Only this time the mother Laura is the one fighting for her daughters lives. Laura is a very strong person mentally and physically. She fights the dead as well as the living to keep her family safe. She is one tough woman with all that she has to endure to protect her daughters. Talk about motherly love this woman definitely loves her family.I loved the fact that Laura always stood her ground and that she wasn't afraid to fight. She didn't run off and hide and then start screaming like most females do in horror movies. I mean you know like most of the girls in horror movies will go and hide under the bed. She usually thought out the best way to handle a situation before she just jumped right in."}, {"userName": "AudioBookReviewer", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "My full Deadlocked 2 audiobook review can be found at Audiobook Reviewer.Like I said earlier Deadlocked 2 picks up, without missing beat, immediately after the first book but from David's wife Laura's perspective. The zombie apocalypse continues to allow the crazy's to come out of the wood work, not sure how they manage but they do. Now it is up to Laura to keep the family together. She's powered by adrenaline, grief, Oxycontin and the fundamental instinct to protect her children. Wise believes that women characters are, more often that not, not portrayed as real women probably would be in these situations. I find it very refreshing when a strong willed stand alone female protagonists hit my ear, there should be more. I will be listening to the next chapter, I just can't help myself.Audiobook provided for review by the publisher."}, {"userName": "Paulo \"paper books always\" Carvalho", "userReviewDate": "Jun 14, 2014", "userURL": "http://www.goodreads.com/user/show/3789445-paulo-paper-books-always-carvalho", "userReview": "This second story starts right after the first tale. In this tale we follow Laura, David's wife, as she struggles - first to see her husband being eaten alive and second - to safe their two children with the help of Billy. This tale follows the same directness of the first. Everything moves fast and there is no pause to take a deep breath.As they travel through the river, with plenty of supplies stolen from a school they meet several people. Again the same thing as before. Not everyone is a nice as they are and best of all - the change that the writer did to Laura throughout 70 pages was quite good. We see Laura change from a mother that depends on her husband to a woman that attacks people that mess with her and her family.Again the end was quite surprising. Almost the same formula as the first part. Read this two parts and be prepared to a turmoil of feelings. Herr Wise will punch your stomach!"}, {"userName": "Annette M Guerriero Nishimoto", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/3619095-annette-m-guerriero-nishimoto", "userReview": "Today's review is on Deadlocked 2 by Aaron WiseJust as the first book in this series; Deadlocked, Wise is able to maintain the fast paced action and keep the reader interested and invested in the lives of Laura, her children, and Billy. But staying with Billy may put her and her children's lives in more danger than she bargained for.When Laura finds that her youngest daughter is infected with the tainted food, she must leave both children alone so that she can search for the \"cure\". Like her husband David, Laura is set on doing everything she can to save her children. Even at the cost of infecting herself.With the first book being written from the POV of David, Deadlocked 2 is written from the POV of Laura. I can't wait to see who's POV book 3 is written in.3.5 of 5 starsAvailable at Amazon"}, {"userName": "Netanella", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/1157679-netanella", "userReview": "First paragraph:  They ate my husband as I watched.3 1/2 upped to 4 stars.Deadlocked 2 continues the story of a major city caught up in a zombie outbreak, and one family's attempt at survival. As one can tell from the opening line, David Dad from the first story didn't make it. Now it's up to Mom, again told in first-person perspective, to get her two young daughters to safety. This is great, gory, visceral zombie action. No one is safe, not even the cute little kids or the puppy dog. The author throws everything at this family, including the kitchen sink, it seems. There are the typical bad guys disguised as good guys, sharks, exploding bridges, a really bad case of PMS, and Mom pulling an almost-Mike Tyson maneuver on a zombie herself. This must have been one of the grossest scenes I've read in a long time.Book 3 continues this sordid little tale. I can't wait!"}, {"userName": "Sylvia", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/6376571-sylvia", "userReview": "This book was such a disappointment. Honestly, it was a massive let down after the first book. The language in the first book was very basic, but the character was well rounded and the pace kept you hooked. I devoured it on a train ride home after work. The next day, I picked up where Deadlocked finished and started Deadlocked 2. *minor spoilers*The main character is not nearly as well formed. Her emotions swing wildly and then she says she's having her menstrual cycle. It's as if the author said, \"Look, I know she's crazy. This is why.\" It's undermining and sad. She is a ridiculously thin character and incredibly inconsistent. I found myself skimming through the vast majority, just waiting for the end. I did purchase books 1-4 and now I'm not sure I'll be reading book 3 or 4. Also - this book is in dire need of an editor."}, {"userName": "Kylie", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/3301201-kylie", "userReview": "I came in to this expecting a decent enough story, having read the first, and was very pleased to find that there was much more to the second instalment in this series of zombie novellas.The pace continues to move swiftly, with enough down time to catch your breath, but not enough to ever feel quite safe - and it is written pretty convincingly too. There is also a first for me in this book - not an easy thing to come across when you have read and watched as many zombie books and movies as I have - when Laura dispatches a zombie in a particularly gruesome way when she is out of other options...Ah, the lengths a mother will go to to save her children..."}, {"userName": "Caridad cruz", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/5133919-caridad-cruz", "userReview": "i give this book a 4 star because it contained wonderfully disgusting, gruesome parts, what i didn't like about this book was that the main character went through too much nonsense, sharks were involved, anyway and she survived it, that blew it for me, i will not be getting book 3 because of this. i read book 1 and gave it 5 stars, this one would of been a five star if the character would not gone through half of the BS that she went through!! its an easy read, and i read it in one day thinking it was going to change, to no avail, she kept going through some unbelievable BS being human and hurt!!"}, {"userName": "Mike", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/16951188-mike", "userReview": "Hands down the best zombie series I have ever read. The Deadlock series 1-4 possessed every thing that I like in a zombie story.Strong characterization - checkFast paced with non stop action - checkGreat story - checkMassive Conspiracy - checkZombie Gore - CheckBut most of all, this was very well written. The best complement I can give to the author is that I was so deeply moved that I shed a tear at the end of book 1. Kudos to you A.R. Wise. I've never heard of you before, but now I'm a superfan."}, {"userName": "Stephanie", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/10477694-stephanie", "userReview": "The Deadlocked series has got to be my all time fave series. I haven't read a ton of series because I don't think they do the story justice as some point. Not this series. It just keeps getting better and better. You are simultaneously cheering and jeering. Don't miss this read!Deadlocked 2"}, {"userName": "Linda", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/8195147-linda", "userReview": "This picks up right where the 1st book left off and the beginning truly heartbreaking.This story takes you through a lot of different emotions, which says a lot because it's not very long. It scared me, it made me laugh, it made me mad, and it made me want to fight.It is a zombie story, true, but it's also about a mother doing everything she can to protect her babies. I will read the next book in the series."}, {"userName": "Digit", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/6786726-digit", "userReview": "Really good little novel written in parts like the old pulp fiction. I enjoy this series very much, even though the genre is saturated right now. The author tries to stay way from the cliches and simple plot devices. He actually attempts to make his world plausible and the characters behave in reasonable ways, if unexpected at times. Can't wait to finish the series and answer the questions that have been adding up since the first book!"}, {"userName": "Erika", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/595029-erika", "userReview": "Ok absolutely loved the second installment of this series. I also loved how the book started right where the first ended. I loved how the author put it from the mom's point of view. Being a mom myself I really truely felt like I was fighting for my own life. The author did a great job of making you feel everything the main character was feeling. It was a great, gory, wonderfully written book. I highly recommend this book."}, {"userName": "Milarmie", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/8053658-milarmie", "userReview": "This book picks up right where book 1 left off and it was action-packed as soon as you start reading it. I thought David, the main character from the first book, was such a hero. Well, Laura, David's wife, is a bigger badass. She went from this scared, timid, helpless wife to a don't-take-no-crap-from-anyone-I-will-do-anything-to-protect-my-kids woman. So far I am loving this series..."}, {"userName": "Senona Macias", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/25334257-senona-macias", "userReview": "Part 2 is continuing David story but now has changed perspectives and is in his wife's words. It is about her struggle to keep her girls safe. She gets partnered with a young man that she has never met before but soon become fast friends and protectors of each other. Now zombies are not the only things that she needs to worry about."}, {"userName": "Delilah", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/8255633-delilah", "userReview": "If you're a zombie lover...this series is for you! This is the second book in the series, and I can't wait to read the next book. I am sure it will be just as suspenseful and gory as the last two! What a mother will do to find the \"cure\"...even to go as far as ripping the flesh of a zombie with her bare teeth! Eek!"}], "description": "Part two of this series picks up immediately after the end of the first. David's wife, Laura, is forced to take over the protection of their family as the boat travels out into Hailey Bay, away from the zombies. However, the boat's pilot plans to dock back in the overrun city to rescue his own family, which will put Laura's in jeopardy.Laura is forced to overcome unimaginable horrors as the zombie apocalypse explodes around her, but it is the evil intent of the humans around her that present her greatest challenge. The reader is taken far beyond the edge of their seat as Laura pushes forward to the inevitable end. No one is safe in a world where the dead hunt the living.", "title": "Deadlocked\n      \n          (Deadlocked #2)", "url": "http://www.goodreads.com/book/show/13371323-deadlocked", "average": 4.07, "cover": "https://images.gr-assets.com/books/1328315421l/13371323.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/5429635.A_R_Wise", "name": "A.R. Wise"}], "type": ["Horror", "Horror", "Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/13371323-deadlocked", "http://www.goodreads.com/book/show/17735190-314", "http://www.goodreads.com/book/show/13371322-deadlocked", "http://www.goodreads.com/book/show/17982642-314-book-2", "http://www.goodreads.com/book/show/20488228-314-book-3", "http://www.goodreads.com/book/show/13575187-deadlocked-4", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}