{"ratings": 2274, "userreviews": [{"userName": "Cora ☕ Tea Party Princess", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/4166936-cora-tea-party-princess", "userReview": "This book annoyed me quite a bit.The characters were juvenile and the setting was juvenile. It felt almost like the academy was an excuse to write your typical YA school drama but have an excuse to add lots of graphic sex. New Adult, I think NOT.Sara was a little bit bat-shit. Well, more than a little. She'd doodles on her notebook Sara loves Vincent like an obsessed 12 year old. Only she's not an obsessed 12 year old. She's an obsessed adult who's borderline stalker with her plans to get close to the ageing rockstar. It's kinda no wonder she failed high-school, supposed drama the previous year aside.And drama. Wowsers. Hand some drama to an overexcited fan-fic writer and something like this is what you'll end up with. There's a bit of every fan-fic cliché in this.This ended exactly was I predicted, a little too perfect and happily-ever-after for me. And that was probably what really annoyed me the most. The predictability of the whole damn story. It made Sara seem even more thick-as-a-plank.I received a copy of this for free via NetGalley for review purposes."}, {"userName": "Rebecca McNutt", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Dear Rockstar was an exciting book, full of Eighties nostalgia and the love of music, but the love triangle melodrama got old really fast."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "[image error]"}, {"userName": "J.", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/7141041-j", "userReview": "[ sexual abuse, parent abandonment, death--but those issues really are not directly addressed until the end of the book.  (hide spoiler)]"}, {"userName": "✿ℎazℯℓ - thℯ ℛock Cℎick ℱairy✿", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/4162653-az---th-ock-c-ick-airy", "userReview": "Not what I expected. I read this book with the thought that maybe, just maybe, it would break my not-so-good-books streak. But no, it didn't and I'm sad about that.At first, I wasn't too bothered by Sara's obsession with Tyler. However, as the story progressed, I found out that not only did Tyler have a family, he's also twice Sara's age and that turned me off big time. Honestly, if you ask me what i thought the mystery was when I read this book's blurb, I'd say that I thought Dale is Tyler. I though he was just pretending or something. As it turns out, the plot runs deeper than that. I was taken aback, but I still read it. I had hoped that this will be sweet... but it's not. It's just a whirlwind of events and problems that I couldn't keep up. Even their intimate scenes felt hurried. Dale is also a contradiction. He wanted to slow down, but he's also very intense. He wanted honesty when he also was so very full of shit. I already figured out he story behind his dad, so no surprise there. spoilers aheadspoilers aheadspoilers aheadspoilers aheadI felt as if I didn't really know much about both characters, well, at least not until the end. I mean, the mysteries were all revealed, but I don't see any difference. I mean, ot was just all laid there leaving me as a reader with nothing to chew on. It just... lacked some things. For example, it was said that Sara was raped... ummm so? what happened, really? There was a short explanation.. like a few sentences for what happened, but that wasn't enough for me. It's definitely a crucial issue for me. Then there was also a matter of both Dale and his sister being Tyler's kids and John (their dad) not knowing about it. Wuuuuuttt? How could he not know when from start to finish of this book, they have been going about how Dale is the spitting image of Tyler. That's just sooooo hmm.. dense of him. Tye one thing at bothered me most is how Sara and her mom hid how abusive the stepdad was. I mean, Sara was 19... there could've been lots of chances to call for help since obviously, she knows 911 because when the stepdad was pummeling Dale and her, she was shouting at her mom to call the darn number. If it crossed her mind then, why not in the past too when she was being raped, or even after that or I don't know... maybe instead of papering her walls with Tyler's pictures, she could've instead wrote a letter or better yet, called child services or the authorities. I know I'm just ranting now. I am just soooo frustrated with Sara's personality. She's trying hard to look like a badass girl, but she cowers when it comes to her stepdad, it's ughhhhh... FRUSTRATING.So there.., that's my whole experience reading this. :/"}, {"userName": "Jenny - TotallybookedBlog", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/3870376-jenny---totallybookedblog", "userReview": "4.5 stars - Jointly reviewed for Totallybookedblog.comJenny: Fluff up the hair, break out the hair gel and whack some Rick Astley on the turn table because we’re heading back to the 80’s with Dear Rockstar!So..think back. Do you remember your first rock star crush? You know…the one you thought you’d die over if you didn’t get to meet……and if you did meet them, you were convinced you’d fall in love and get married? Oh come on… we all had that insane crush and those crazy dreams when we were younger. Didn’t we? Hmmm well at least I hope we all did or I just made a complete prat of myself!I have to say I absolutely loved Dear Rockstar. It was refreshing, fun and emotional. Whilst the characters are damaged, this never felt heavy because it was beautifully told, so well handled, with relatable engaging characters. Plus..Who doesn’t love a trip down memory lane? This book had it all for me. Let’s not even get started on the crazy chemistry between Dale and Sarah. Ummm I’m still recuperating from THAT storage cupboard scene. Wowsers! Still fanning self here!\n“..but even in that enormous stadium, Tyler Vincent hadn’t elicited in me, or anyone around me, the same feeling Dale did with one dark, heated look.”\nI finished it one sitting and had that happy book love glow whilst reading it and didn’t want it to end. Do you agree Gitte?Gitte: …….Sorry what? Ooops, I’m still thinking about that cupboard scene….HA! Yes, I absolutely agree Jenny; I really enjoyed Dear Rockstar; LOVED Dale & Sara! There were so many things I completely related to and connected with. And if you’re a prat, then I am too, because I totally crushed on Johnny Depp in ‘21 Jump Street’ as a young teenager, dreaming about the day he’d meet me and think: “Oh I have to marry Gitte” (true story!) Now, when I’m not so much a teenager anymore…cough….I’m still crushing on him (seriously, this man only gets better with age, and is it wrong that I really fancy him as Jack Sparrow?) Yeah, I’m still doodling his name on my doodle pad. Hmmm….there may be a name for this, but who cares! Anyway, Dale and Sara’s story had a little bit of everything that makes a story great and I loved their journey.\n“You’re good at being a rock star. I’m good at being the world’s biggest fan.”\nDear Rockstar was different and kept me reading, not wanting to put the story down unless I really really had to. Dale and Sara’s journey was sad, sweet, funny, passionate and beautiful, their characters written with such depth, I couldn’t help fall in love with them.\n“Sometimes the best things in life are crazy.”\nSara loves (some might say obsessively) Tyler Vincent, the sexy famous rock star. She grew up alongside her idol albeit it in her head and heart. He was a constant; I’d even argue he was her ‘security blanket’ in the real world that was not kind and loving to our Sara. She shapes her life to reach the desired result of one day meeting up with her idol.\n“I didn’t just want to meet him. I wanted to change him. I wanted him to change me. I wanted to be essential in his life.”\nSara, bless her, has a pretty abysmal home life so the one good thing in it…her crush…well it becomes her escape. That is until Dale enters her real world. Dale; who looks a lot like Tyler, and is an aspiring rock star to boot. Wow, I too absolutely fell, hook, line and sinker for Dale Diamond!The attraction is immediate, for both of them, and a journey of secrets, lies, horror and deep rooted emotional scars are uncovered. But overall, this is a story of sweet heart-warming hope, love and trust.\n“What was wrong with me? What did I want? I thought I knew. Before Dale Diamond came along, I could have told you in detail what I wanted. Now I had no idea.”\nSo yeah, I absolutely loved this story and its characters. I also love this Author’s writing and how she flawlessly weaves together humour and horror whilst giving the reader hope and love amongst the sadness.\n“Everybody hurts. You don’t need to hide it.”\nJenny: 19 year old Sara is an attending an Academy to catch up on her last year of high school which she missed due to issues which are unravelled slowly throughout the book. Sara is creatively talented, has dreams and aspirations but doesn’t have much else. She feels trapped and in her mind, Tyler Vincent is the key to her unlocking her dreams.\nThere was one lone tree at the side of the building. It looked as lost and forlorn as I felt.\nIt is during her second week at the academy Sara meets Dale Diamond, the new guy on campus who bears an uncanny resemblance to her rock god crush Tyler.He’s a super talented singer/guitarist/songwriter who is hoping to make the big time by entering the battle of the bands on MTV and has star quality written all over him.\nWhen he lifted his head and began to sing, looking out into the audience, the spotlight focused on him and him alone, it was immediately clear this man was a star.\nBoth are instantly attracted to one another and so begin the journey of Dale and Sara, two characters who won me over immediately!\nIt was pretty clear that there was nothing in the world more important that chemistry and it was happening here.\nSara and Dale were absolutely adorable. I was completely smitten with both of them. Watching their relationship develop was mesmerising. Dale Diamond!! Well, if I didn’t just fall in love with him. Dale says what’s on his mind, wears his heart on his sleeve, has that poetic beautiful nature about him and well….words fails me. I loved him! He knew he was fighting an invisible force for Sara’s heart but he never gave up. He had his own dreams and goals, but Sara was so important to him and he fought to make her believe that.\n“How do I make you feel?”“Like I would follow you anywhere.”\nThe whole relationship never felt forced. It developed beautifully and I was with them every step of the way. I laughed with them, loved with them and my heart broke with them. The secrets revealed shocked me.\n“You’re mine. I knew it the first time I saw you. I will always come for you, Sara. Always”\nAt first I couldn’t grasp how Sara, being 19 could have this type of mad obsession with a rock star, but the way this author brought this to fruition was just beautifully explored and sad. I completely understood it and found her story moving and heartbreaking. I completely “got” Sara.Sara’s voice was quirky and fun. Despite her sorry existence, she never came across as whiny. She saw humor in situations and she spoke her mind. An absolutely refreshing heroine and I loved her.\nI sobbed, letting him hold me and wipe away my tears, and I knew, finally, what it was. I was happy\nDear Rockstar had it all. The story was so beautifully told and even though there were some very tragic parts to this story, parts that crushed me, the story never felt laden down. The characters were well developed and I felt I got to know them and I cared about them. It was a fun yet moving story with characters who will enter into your heart. Secrets were revealed in a deliciously slow way which will have you turning the pages with anticipation every time. This was a story about taking risks. About healing, opening your heart, trusting in and reaching for your dreams. About finding that special person won’t only save you, but will make you believe in yourself and what’s in your heart.\n“When are you going to realize there’s no one else for me? You’re it, baby.”\nThis was an absolute winner for me and I hope this isn’t the last we’ve heard of Sara and Dale. Perfection!"}, {"userName": "J *deep in the heart of Texas*", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/9072385-j-deep-in-the-heart-of-texas", "userReview": "4--Dale Loving--Stars!OMG I freaking LOVED this book. It was fun, it was funny, it was sexy, it was sweet, it broke my heart, it had me on edge! Sara and her BFF Aimee attend an alternative high school, after not graduating their senior year. Sara has been in love with rockstar Tyler Vincent since she was 14. When Tyler Vincent look-alike, rockstar in the making, Dale Diamond shows up the first day of school, Sara's world is rocked!! Dale and Sara have an instant attraction to each other. But see poor Sara is just a little bit obsessed with Tyler Vincent--we're talking loads of fan letters, I wallpapered my room with pictures of you, I painted a self-portrait of us together OBSESSED! \n“I know you. Inside and out, Sara. I know you, and I’ve accepted it all. Every bit of the crazy. And I love you anyway remember?” \n Prior to meeting Dale, Sara plans to enter said self-portrait in a contest--with the winner getting to meet Tyler and also recieve a full scholarship to college. For Sara, up until Dale, this was her ticket out of Jersey--an escape from the painful home life she's currently living. Where before, Sara thought the contest was her only option, now she has Dale to consider. Who will Sara choose...Tyler or Dale? Will she even have to?? What happens when Sara discovers Dale has been keeping his own secrets??I just loved everything about Dale and Sara's journey, despite it being rather predictable. This was a quick, short read that had me smiling (through most of the book)....biting my nails a time or two....throwing a few punches at both Dale and Sara.....swooning over alpha Dale....and fanning myself during the sexy times.Best part - it was a STANDALONE with a HEA!!!! Yeehaw! Read on people!!!!"}, {"userName": "Jenn", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/3349239-jenn", "userReview": "ARC provided by the Author in exchange for an honest reviewThis story threw me back in to an 80's tailspin. I LOVED it. I loved all the reminders of growing up in the 80's. Every time I read something 80's related it cracked me up and reminded me of my junior high years. Even though this book was set in the 80's, it didn't take away from the story one bit. This book does have serious content as a theme yet, it's not the focal point of the story. The focal point being around Sara and her OBSESSION with rock-star, Tyler Vincent and a budding sweet love story between her and Dale Diamond.I really loved Dale Diamond. When he wanted something, he CLAIMED it. He wasn't a player bad boy and he didn't play games. All he wanted to do was be a rock-star himself and win over the love of Sara. He enrolls at her Continuation School which throws a wrench in her life plans causing her to rethink her plans, let down her walls, and eventually throw all caution to the wind. I enjoyed the secondary cast of Matt, Aimee and John. I loved the secondary love story we got between Matt and Aimee too. Matt, Dale and Sara had me laughing a bit over all the \"BEE\" related comments as well. What I LOVED about this book:1. 80's era2. Matt and how he didn't play games and went after what he wanted.3. The humor4. BEE related comments5. The relationship between Dale and Sara6. Fast paced story7. Kept me up til late at night sucked in8. All things 80's: music/objects/food-drink/carsMy only draw backs were:1. I felt the last 25% was rushed a bit2. Major things happened and then were glossed over3. Would have liked a little more of Matt and AimeeOtherwise, I thoroughly enjoyed this book a lot."}, {"userName": "Charlene", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/9931840-charlene", "userReview": "I need to preface this review by saying that I'm not normally a fan of the NA genre. What I am, however, is an 80's girl and this book brought back so many memories of that era for me. I could actually taste the plate of fries that was so often my lunch during high school (yeah, I know...but we all did it, didn't we?). This was my experience throughout this story...I could feel myself immersed in Sara and Dale's lives. I'm not going to regurgitate the plot for you - you can read the synopsis for that. What I will say is that while I started off rather uncomfortable with Sara's extreme fan-girlness (yup, just made up a word) I ended the book totally understanding why she created this imaginary future for herself. The entire book had me enthralled, but the last 10% made it for me - I actually cried for these two. Sara, so strong in her own way...and Dale, the ultimate dream boyfriend. God, he was so perfect...sigh...I'm back in my teens fawning over a new love. Was the book perfect? No, and I know some other reviewers have pointed out some improvements that could be made. For me though, the mark of a great story is one that hooks me from the outset, makes me feel for the characters, even makes me cry...and for that, this book has earned a rare 5 stars from me. Well done Emme...I'll be looking for more from you!"}, {"userName": "Michelle", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/13126896-michelle", "userReview": "Received book from author in exchange for an honest review.'Turn up your collar, feather your hair, and splash on some Polo, because we're going back to the 80's when MTV played music videos, there was no such thing as American Idol, and becoming a star meant doing nothing short of crazy for that one, big break.\"Sara is a little obsessed with rock legend Tyler Vincent. The walls of her bedroom are covered with posters torn from the pages of magazines. She knows everything she thinks there is to know about him. He is her fantasy - her way to escape. Sara didn't graduate with her class. A life formed from choices she couldn't control forced her to have to leave school - repeating her senior year at a school that houses troubled students who weren't cut out for the conventional route of high school. Dale Diamond is new in town. Sara's friends can't stop talking about the boy that looks just like a younger version of Tyler Vincent. Sara isn't sold quite yet, no one has measured up to the image of Tyler Vincent in her head. That is until she meets the rockstar in the making; Dale Diamond.Dale sees something in Sara that makes him want to claim her as his own. But he is fighting for her heart with a fantasy about a man that she has never met - a man that doesn't know she even exists. But Sara is finally starting to see something beyond her teenage obsession - she is starting to see Dale. He is a real life rockstar in the making. He is close enough to reach out and touch. \n\"I don't want you to be my fan. I want you to be mine.\"\n Both have their secrets.She is trying to hide the abuse, the hurt, the broken life she has had to endure.He is trying to forget what he saw that afternoon - that secret that he learned - the thing that destroyed his family and made him want to be so much better than him.Sara and Dale's story is not just a simple story. The connection she feels towards her idol are tied to far deeper issues than just a fan with a crush. Her obsession has become her crutch to dealing with the cards she was dealt. As secrets come to light, they find their way through the blurred lines of what is real. Her escape might still come at the hands of a guitar playing rock god - but it might not be who she always imagined it would be.I really enjoyed this book. Taking a journey back to the 80's had me remembering my own days of tacking up my posters of Bon Jovi on my wall - those stacks of Teen Beat, BOP... sitting next to by bed while trying to soak up everything I could about them. The days when you would stay up for hours to catch a video of your favorite band... I loved that the author was able to not only set this story in that era, but even the writing style fit. I wasn't quite sure what to expect when I received this book. But I was pleasantly surprised by the way the story was told. The story was beyond what the cover and summary gives you. A creative way to touch on some darker issues and taking two broken characters and watching them both find strength to find a way to fix each other and to fix themselves."}, {"userName": "Bethany", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/3142322-bethany", "userReview": "ARC provided by the Author in exchange for an honest review.I really enjoyed Dear Rockstar. I thought the book was just going to be a fluffy story about a girl in love with a rock star. I was so wrong. Dear Rockstar deals with some very serious issues and has few very steamy scenes. Then there was Dale Diamond, I don't know if I can really explain how much I loved him. First of all he had the perfect 80's rock star name, I mean it couldn't get any better. He was also so sweet and straight forward with Sara. He wasn't completely honest about his past with Sara but either was she. Dale never played any of those annoying games, he wanted Sara so he went after her. No cat and mouse games like in other books. Dear Rockstar was split into two parts. I felt the first part of the book was fun and sweet, the second half a lot more serious and drama filled. Emme Rollins did a great job sucking the reader in and taking them back to the world of the flashy 80's. I can't wait to read more books by her."}, {"userName": "Abbie", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/10194401-abbie", "userReview": "Actual rating - 2.5The main character, Sara, really annoyed me. Her obsession with Tyler really got on my nerves after two pages. I kept hoping she would give it a rest, but that never happened until the end. It was also quite irritating that she kept mentioning food and how hungry she was. The part with the skittles felt like it went on forever! The ending wasn't bad, but I didn't love it."}, {"userName": "Gitte TotallyBookedBlog", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/7379751-gitte-totallybookedblog", "userReview": "4.5 stars - Jointly reviewed for Totallybookedblog.comJenny: Fluff up the hair, break out the hair gel and whack some Rick Astley on the turn table because we’re heading back to the 80’s with Dear Rockstar!So..think back. Do you remember your first rock star crush? You know…the one you thought you’d die over if you didn’t get to meet……and if you did meet them, you were convinced you’d fall in love and get married? Oh come on… we all had that insane crush and those crazy dreams when we were younger. Didn’t we? Hmmm well at least I hope we all did or I just made a complete prat of myself!I have to say I absolutely loved Dear Rockstar. It was refreshing, fun and emotional. Whilst the characters are damaged, this never felt heavy because it was beautifully told, so well handled, with relatable engaging characters. Plus..Who doesn’t love a trip down memory lane? This book had it all for me. Let’s not even get started on the crazy chemistry between Dale and Sarah. Ummm I’m still recuperating from THAT storage cupboard scene. Wowsers! Still fanning self here!“..but even in that enormous stadium, Tyler Vincent hadn’t elicited in me, or anyone around me, the same feeling Dale did with one dark, heated look.”I finished it one sitting and had that happy book love glow whilst reading it and didn’t want it to end. Do you agree Gitte?Gitte: ……Sorry what? Ooops, I’m still thinking about that cupboard scene….HA! Yes, I absolutely agree Jenny; I really enjoyed Dear Rockstar; LOVED Dale & Sara! There were so many things I completely related to and connected with. And if you’re a prat, then I am too, because I totally crushed on Johnny Depp in ‘21 Jump Street’ as a young teenager, dreaming about the day he’d meet me and think: “Oh I have to marry Gitte” (true story!) Now, when I’m not so much a teenager anymore…cough….I’m still crushing on him (seriously, this man only gets better with age, and is it wrong that I really fancy him as Jack Sparrow?) Yeah, I’m still doodling his name on my doodle pad. Hmmm….there may be a name for this, but who cares! Anyway, Dale and Sara’s story had a little bit of everything that makes a story great and I loved their journey.“You’re good at being a rock star. I’m good at being the world’s biggest fan.”Dear Rockstar was different and kept me reading, not wanting to put the story down unless I really really had to. Dale and Sara’s journey was sad, sweet, funny, passionate and beautiful, their characters written with such depth, I couldn’t help fall in love with them.“Sometimes the best things in life are crazy.”Sara loves (some might say obsessively) Tyler Vincent, the sexy famous rock star. She grew up alongside her idol albeit it in her head and heart. He was a constant; I’d even argue he was her ‘security blanket’ in the real world that was not kind and loving to our Sara. She shapes her life to reach the desired result of one day meeting up with her idol.“I didn’t just want to meet him. I wanted to change him. I wanted him to change me. I wanted to be essential in his life.”Sara, bless her, has a pretty abysmal home life so the one good thing in it…her crush…well it becomes her escape. That is until Dale enters her real world. Dale; who looks a lot like Tyler, and is an aspiring rock star to boot. Wow, I too absolutely fell, hook, line and sinker for Dale Diamond!The attraction is immediate, for both of them, and a journey of secrets, lies, horror and deep rooted emotional scars are uncovered. But overall, this is a story of sweet heart-warming hope, love and trust.“What was wrong with me? What did I want? I thought I knew. Before Dale Diamond came along, I could have told you in detail what I wanted. Now I had no idea.”So yeah, I absolutely loved this story and its characters. I also love this Author’s writing and how she flawlessly weaves together humour and horror whilst giving the reader hope and love amongst the sadness.“Everybody hurts. You don’t need to hide it.”Jenny: 19 year old Sara is an attending an Academy to catch up on her last year of high school which she missed due to issues which are unravelled slowly throughout the book. Sara is creatively talented, has dreams and aspirations but doesn’t have much else. She feels trapped and in her mind, Tyler Vincent is the key to her unlocking her dreams.There was one lone tree at the side of the building. It looked as lost and forlorn as I felt. It is during her second week at the academy Sara meets Dale Diamond, the new guy on campus who bears an uncanny resemblance to her rock god crush Tyler.He’s a super talented singer/guitarist/songwriter who is hoping to make the big time by entering the battle of the bands on MTV and has star quality written all over him.When he lifted his head and began to sing, looking out into the audience, the spotlight focused on him and him alone, it was immediately clear this man was a star. Both are instantly attracted to one another and so begin the journey of Dale and Sara, two characters who won me over immediately!It was pretty clear that there was nothing in the world more important that chemistry and it was happening here. Sara and Dale were absolutely adorable. I was completely smitten with both of them. Watching their relationship develop was mesmerising. Dale Diamond!! Well, if I didn’t just fall in love with him. Dale says what’s on his mind, wears his heart on his sleeve, has that poetic beautiful nature about him and well….words fails me. I loved him! He knew he was fighting an invisible force for Sara’s heart but he never gave up. He had his own dreams and goals, but Sara was so important to him and he fought to make her believe that.“How do I make you feel?”“Like I would follow you anywhere.”The whole relationship never felt forced. It developed beautifully and I was with them every step of the way. I laughed with them, loved with them and my heart broke with them. The secrets revealed shocked me.“You’re mine. I knew it the first time I saw you. I will always come for you, Sara. Always” At first I couldn’t grasp how Sara, being 19 could have this type of mad obsession with a rock star, but the way this author brought this to fruition was just beautifully explored and sad. I completely understood it and found her story moving and heartbreaking. I completely “got” Sara.Sara’s voice was quirky and fun. Despite her sorry existence, she never came across as whiny. She saw humor in situations and she spoke her mind. An absolutely refreshing heroine and I loved her.I sobbed, letting him hold me and wipe away my tears, and I knew, finally, what it was. I was happy Dear Rockstar had it all. The story was so beautifully told and even though there were some very tragic parts to this story, parts that crushed me, the story never felt laden down. The characters were well developed and I felt I got to know them and I cared about them. It was a fun yet moving story with characters who will enter into your heart. Secrets were revealed in a deliciously slow way which will have you turning the pages with anticipation every time. This was a story about taking risks. About healing, opening your heart, trusting in and reaching for your dreams. About finding that special person won’t only save you, but will make you believe in yourself and what’s in your heart.“When are you going to realize there’s no one else for me? You’re it, baby.”This was an absolute winner for me and I hope this isn’t the last we’ve heard of Sara and Dale. Perfection!"}, {"userName": "Terri ♥ (aka Mrs. Christian Grey)", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/6014919-terri-aka-mrs-christian-grey", "userReview": "Quick review:Cover: Nice! Rating:  R Thumbs Up:  3.5Overall: A solid story with potentialCharacters: Good\tPlot: Why settle for a fantasy when the reality is betterPage Turner: Sure Series Cont.? N/A Recommend:  MaybeBook Boyfriend: DaleSUMMARY (50 words or less)There is much potential in this story. There is an edginess to it that draws in the reader. I can’t say I regret reading, but I will say I wish is lived up to its potential. I think this could be a five star read with some tweaks.For a full review and yummy pic, see my blog post at:http://mybookboyfriend.blogspot.com/2..."}, {"userName": "seton", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/2012809-seton", "userReview": "Genre: NA romanceThis novel is set in 1986 New Jersey. I know that is so far back as to make this practically a historical but back in 1986, I happen to be living in NJ. I know it, like the back of my hand. And that may be the problem since some details seem to be off and the mistakes kept on accumulating.This isn't a horrible NA novel with eye-raping editing like some that I have read recently. The heroine is stalker-level OBSESSED with a famous rockstar twice her age to escape the reality of her shitty life at home. She says that she is \"in love\" with this rockstar, wanting to marry him, and yet . . . . she is envious of the rockstar's daughter and wishes that the rockstar is her daddy (and I dont think she means Sugar Daddy either.) Oooooooooooooooookay.Of course, this is all before she meets the hero who is the spitting image of her rockstar, albeit 20 yrs younger. That's not creepy AT ALL. The hero zooms in on the h like a torpedo and has eyes for noone else right from the very first second of meeting. Why? I have no idea. And then there are the pop culture references. Some of them (Jordache jeans and Flashdance fashion) were already passe by 1986. New Kids on the Block and Tiffany both had their first hit in 1987, not 1986. DNF @ 70%"}, {"userName": "Kim Bailey", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/17747245-kim-bailey", "userReview": "3.5 StarsA very sweet read. I was looking for something nice & light - an easy read. I got that & a fair bit more with this book. Emme Rollins takes the idea of star idolization & turns it into something new & a little more meaningful. Her characters are well written and the storyline is solid.There were some very nice moments in this book.It was however, a bit predictable in spots - and some of the more meaningful moments were skimmed over, while less important things got more note than necessary. Not a bad book at all. I enjoyed my time with it."}, {"userName": "Jess-i-ca ~Sometimes a Gif Witch~", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/8740772-jess-i-ca-sometimes-a-gif-witch", "userReview": "This was a nice enjoyable read. It wasn't spectacular and it was a little predictable but overall I liked it. I especially liked that it was set in the late 80's and all the old skool references.I guess if you are looking for a fluffy read with a HEA then check this one out."}, {"userName": "❀ Crystal ✿ - ", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/10734393-crystal--", "userReview": "*ARC given to me by author for honest review*If you’re looking for a new rock-star read to sink your teeth into Dear Rockstar may be it. Dale may not be famous yet, but he’s a rock-star in the making and Sara has to learn to switch alliances for her future, one that does not include middle aged rocker Tyler Vincent who she’s been a bit obsessed with over the years. I thought Dear Rockstar was a great read. It was in no way a typical rock-star story but instead the 80’s era timeline and Sara’s rock-star obsession are extremely understandable and reliable. She may have seemed like a crazy obsessed fan but in reality the idea of Tyler Vincent allowed her to escape reality and provide some sort of positive outlook for her future when the present was nothing but hell. Sara is part of a continuing education program to receive her high school diploma after missing her senior year. Her and her friends all have their demons and reasons for re-going to school. Many joke about her Tyler Vincent obsession, but accept it since he’s been a part of Sara’s life for so long. She practically breathes Tyler Vincent from morning to night. That is until Dale strolls into her class one day and although he reminds her of Mr. Vincent she easily sees the difference and slowly falls for Dale and his own rockin’ rockerness. Dale has some obvious concerns with her Tyler fan-girl behavior but he doesn’t hold it against her. Sara must learn to accept Dale into her life, even the dark parts. Dale has his share of secrets and it’s up to Sara to overlook them because in the long run Sara’s obsession was too perfect and she failed to see that even Tyler Vincent may not be perfect and certainly not perfect for her. Where the title comes in will shock you as it did me but I thought it was a great way to provide 'evidence' so to speak. I really loved Dale’s dad. He reminded me of a mix between normal Jerry Garcia and Jerry Garcia on acid. In the grand scheme of things you can’t help but love him and also feel immense pain over the secrets he’s unaware of. I can’t decide if I think it would be better for him to know or remain clueless. Either way he was a great addition to the book and provided some semblance of fatherly normalcy for Sara.Overall Dear Rockstar was a great read. Many of us born in the 70’s, 80’s or even 90’s can relate to Sara’s rocker love. She may veer more on the extreme side but this fantasy allows her a happy place when home basically sucks. Tyler Vincent has been her escape plan for years, obviously most of her plans were far-fetched and thankfully Dale helps her realize this. If rockers and neon legwarmers are your thing, I highly recommend Dear Rockstar. There are of course Adult themes and sexual situations that fogged up my glasses. But Dear Rockstar is definitely NA and joy to read even if I wish there were more 80’s hairdos, outfits and references. Great read, don’t miss it."}, {"userName": "Stephanie (Bookfever. ♥)", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/4939266-stephanie-bookfever", "userReview": "Dear Rockstar was a very unexpected read for me. I didn't know about it until my friend Christina told me about it when she read it and told me I had to simply read it. Since it wasn't expensive on Amazon I bought it but normally any Kindle books I buy, will be unread for months since I have so much to read but she convinced me to read it with the review she wrote and the way she raved about it. Oh, what would we be without our bookish friends?Dear Rockstar is a story about an 18-year-old Sara who has a complete obsession with rock star Tyler Vincent and dreams of meeting him in real life so he can rescueher from her awful home situation. While she starts a new school year to try and get her diploma she meets Dale Diamond, a new student in her school. When they fall completely in love with each other things get complicated when secrets arrise and Sara has a chance to meet Tyler.I must say that I love love love the 80's and I loved all the references to it in the book. That's one of the major reasons why I loved Dear Rockstar. The other major reason is that the romance was amazing. When Sara and Dale fell for each other it felt so genuine and real. It was actually believable even though it happened kind of fast. Something that feels real and believable like that is hard to find in any book lately in my opinion. The main characters + side characters were all well build and every single one was amazing to read about.Sara was a great character to read about, though a little too obsessed maybe but with everything she went through she's allowed to be I think. Enter Dale Diamond! *dreamy sigh* Dale was so amazing. He was exactly was Sara needed and he also needed her. I love how he wanted her the moment he saw her and went straight for her. And oh my god, that Skittles scene was just to die for. So adorable! I liked Sara's friends a lot. They all seemed to have their own problems and inperfections. I also adored Aimee and Matt together, yet another BEElievable romance in this book! (Yes the BEElievable is an inner joke. You'll get it when you read the book! ;D)However... there were some hatefull characters also like Sara's stepfather \"the stepbeast\". I can't get how with everything he did to Sara that she still had hope to get out of town and get a better life. I was almost crying when everything that happened to her was revealed at the end. He was the most horrible man ever. I also can't get how her mother let everything happen like that and what she did at the end of the book. Luckily Dale's father, John, was great. He's a great father to Dale and he's so nice to Sara too. I really liked him. Of course this wouldn't be a new adult book without some heart breaking and shocking events. I must say the \"twists\" involving Dale and Tyler Vincent weren't as shocking to me because I suspected it all along and guessed it all right. It was a little too obvious to me. Also the last pages were a little too rushed for me and the ending a little too wide open. It was a great ending but I wished to know more about what was going to happen not only to Sara and Dale but also to Aimee and Matt. So that's why the book didn't get a full five stars but I still thought it was a fantastic book and loved it. I also can't help but wonder/hope that there will be a sequel. Fingers crossed!Overall Dear Rockstar by Emme Rollins was a remarkable new adult book that caught me by surprise by how much I enjoyed it. Though with a few minor points it's a really fast, exciting, at times heart-breaking read with loveable yet complex characters that I really cared for and connected with + some steamy romance to leave you gasping for breath and tadaaa you have a great book that I would recommened to everyone. I'm sure they will all love this book as much as I did!"}, {"userName": "Heather", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/3973394-heather", "userReview": "Er-Mer-Gerd! Best book ever my friends! I cried. I did. Tears. They fell.I suppose I should start with the prerequisite I received this book in exchange for an honest review and boy was it good.Emotional roller coaster.Where do I start? You can absolutely totally FEEL the heart that was poured into writing this book. You can feel the characters’ emotions: Dale and Sara, Sarah’s relationship with her step-father, and her love for Tyler Vincent. (Which BTW I totally get. I totally wall papered my walls, doors, and ceiling with Joey McIntyre from NKOTB. I did. Not ashamed to admit it. If I could get away with it with my husband, I’d totally do it now.)I completely get that obsession. Y’all know I don’t do spoilers over here, but I let myself fall into the same thing because of what was going on in my world as a teenager. Except nobody resembling Joey McIntyre showed up to take my breath away.Maybe that’s why I completely got Sara. I understood that pain she was covering up. When I tell you I was completely sucked into this book, I am not exaggerating. I shoo’ed the kids away. No interruptions children, mama is reading and mama is gonna finish this book tonight.Dale. Oh Dale Diamond. You have been added to my shelf of book boyfriends. Who doesn’t want to be loved like that? That intensely. Completely and totally. It wasn’t in a stalkerish way. It was in a soul mate, you complete me, your my other half kind of way.I just answered a question in a Goodreads group about what do you not like in a hero or heroine.I said –*******I absolutely love my alpha males but I don’t like immature boys parading as alpha males that blow off the handle at anything. It’s one thing to protect your female, that’s hot, it’s another to beat the crap out of someone in her name pretty much unprovoked.*******Dale was perfect. He protected her when she needed to be protected. He was patient with her. He was loving. He was kind. I want a Dale.{sigh}Dear Rockstar was so full of emotion that I cried more than once. I’m not joking, near the end I would wipe away one set of tears just to read something else and another set would fall, then there were the happy tears.Then there were the love scenes. Hot. Perfect. Abso-freaking-lutely perfect. Best that I have read in awhile (and I have read some good ones). There’s this one scene in a back room…read it. You’ll know what I’m talking about. Definitely not for the young set. This is one for the grown women who want to swoon – a lot.For my readers who need a HEA. There is one. Emme doesn’t leave you hanging. Perfect ending. Emme – LOVED it! You have been added to my favorite author list, one whose books I must snag the day they are released (or before if you need any more reviewers. Sign me up!). I cannot wait to dig into the one you share with us when we sign up for your newsletter! Hint hint! You can get a taste of her writing just by signing up to get her updates. You want that taste. Believe me!"}, {"userName": "Lisa Kane", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/13291924-lisa-kane", "userReview": "Sara is 19 and goes to Iselin Academy, along with her best friends Aimee and Carrie. Each has a reason why they didn’t graduate from a traditional high school. Sara is obsessed with Tyler Vincent a rock star, and the story line takes place in the 1980’s. A time when people relied on land phones and MTV reined on cable. Dale Diamond has his first day at the Academy and Sara can’t help but notice he has the whole rock look going on. He seems to zero in on her and the two strike up a friendship. Sara lives with her mother and her stepbeast, as she refers to her step father. Throughout most of the story, when he is mentioned it’s usually accompanied by him hitting her mother for a variety of imagined reasons. Sara is afraid of him and hates him, and longs to get out of the hell her life has become. She aspires to be an artist and there is a contest that she is entering to win a scholarship to a college in Maine (near Tyler Vincent’s home). In her mind she knows Vincent has the perfect life and has a warm relationship with his kids. Sara’s dad died when she was too young to even remember him. Sara’s mother defends her step father over and over again and seems to be a willing victim for his attacks.Dale is practicing with his new band for a chance to compete in MTV’s Battle of the Bands. He lives with his dad. His mother had a long term affair and ended up leaving his dad, thinking her married lover would do the same. He didn’t and Dale’s sister moved to Maine and lives with his mom. Although I enjoyed parts of this book, I had a bit of a disconnect with the characters. Dale seemed obsessed with Sara right from the beginning and felt things for her that usually develop over a little more time. There are several plot twists towards the end of the book, one in particular I didn’t see coming, but most seemed to be a stretch of coincidences. I found myself questioning why Sara put up with the violent, abusive situation she found herself in, I understand she had no education or resources but the severity of the abuse would seem to supersede those factors. I never quite got why she was so obsessed with Tyler Vincent and lived in such an imaginary life in her head. Given the bleakness of her own environment, she would need to fill that void, but the worship of this particular individual confused me. The secondary character of Dale’s father John was a sweet, warm addition that provided some much needed comfort for Sara, but he seemed to be very accepting of a permanent relationship between these two, again things moved at warp speed. I would give the first half of this book a 3.5 but a 4 for the second half as it did pick up speed and had some interesting developments. While their relationship seemed a little unrealistic, Dale is definitely swoon worthy material. The plot turns keep coming at you, twists by twists at the end and that keeps the story moving along at a fast pace. One of its most appealing factors is its HEA and has no cliffhanger, such a refreshing change of pace these days."}, {"userName": "Joann - Book Junkie", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/17413135-joann---book-junkie", "userReview": "* * * * * 5 S T A R S * * * * * \n What a FANTASTIC story!!! I was completely swept away by Dale Diamond and I loved every minute of it!!!\nDear Rockstar is set against the backdrop of the 80’s and while I loved all the references to mall concerts, acid wash – anything, banana clips and Rick Astley ~ this story was so much more. This book centers on Sara ~ a 19 year old senior in high school who is obsessed with a rock star named Tyler Vincent. She attends an “alternative” high school (The Academy) with her best friend Aimee because they were both unable to graduate the year before... Sara is infatuated ~ borderline obsessed ~ with Tyler Vincent (rock god) and is determined to do whatever it takes to just be close to him. Enter Dale Diamond ~ a 20 year old musician who is new to The Academy and apparently a Tyler Vincent doppelganger. There is an instant connection when they first see each other in class but they both feel it for different reasons. Dale is focused on winning MTV's Battle of the Bands Contest and Sara is trying win a contest that will help her meet Tyler Vincent. As their story begins to unfold, you learn there is so much more than meets the eye with these two characters. They're both dealing with some intense family issues and when everything comes to a head I was on the edge ~ I mean just couldn’t stop reading until I knew what would happen next! Their journey together takes some very intense twists and turns and even though I saw some of it coming I still felt every bit of it. The relationship between Dale and Sara was sweet, sexy and intense all at once. Dale Diamond (what a name!) was so amazing and I couldn’t help but love him more and more with every chapter. And Sara... oh Sara... There were so many times where I was so frustrated by her Tyler Vincent obsession but ~ like most things in this book ~ there was so much more behind it. This story took me by surprise and I absolutely loved it!I HIGHLY recommend this book and I truly can’t wait to read more from this author!  I received this e-RRC in exchange for an honest review."}, {"userName": "Christie72", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/3613324-christie72", "userReview": "***I received this book in exchange for an honest review.***LOVED THIS BOOK!!!! It was amazing...it had love, angst, darkness, not to mention the steamy, hot love scenes. HOLY COW...the sex in the storage room backstage after one of Dale's concerts will be etched in my mind for quite some time.However, Dear Rockstar is not just about sex. It's a sweet love story about two individuals who haven't had such great childhoods, but who finally luck out when they find each other. Sara is one of the strongest female leads I have come across in a while. She has been in one of the most evil and darkest places I think a human can be. That she not only survives but perseveres and flourishes is a miracle. Dale has also had an unhappy past, although not as traumatic as Sara. So, when she and Dale meet, that darkness becomes full of beautiful light! They have to be one of my favorite couples. They come to share a real, honest love with one another. Dale is a knight in shining armor. It makes a girl yearn for a Dale in her own life. And if you are lucky enough to have one, you appreciate him more.There were other things I liked about the book. I really liked the secondary characters such as Aimee and Dale's dad, John. They really added to the storyline. They were a great source of support for Sara and Dale. I also felt like the writer dealt with the difficult issues in a very sensitive manner. On a lighter note, I loved that the story took place in the 80's...great pop culture references. I may be showing my age, but it brought back fond memories of that decade. I had posters plastered on my wall too! But, the love scenes stand out for me...they were HOT & BEAUTIFUL. It wasnt just two bodies coming together seeking pleasure but two damaged souls meeting and becoming something absolutely beautiful!I can't wait to read her next book. I will be adding Emme Rollins to my list of favorite writers!"}, {"userName": "Tracey", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/12052161-tracey", "userReview": "This book was provided by the author for an honest review..thank you I would have gladly paid to read this story. Dear rock star had me at the Skittles, and smurfs. The fact that this was set in the 80's was a treat, there were so many nostalgic moments. Such a fun time to write a story around. Back when mall performances, and battle of the band's were a way to start a rockers career......Sara is a young woman at 19yrs old that has pinned her walls full of Tyler Vincent. Rock star. She has entered an art contest to go to Main for art school based just on the fact that, this is where Tyler is from. On the surface Sara appears to be another obsessed fan. Under the surface Sara has built a fantasy life that has helped her through a childhood that was terrible. A monster of a step father, and a mother who won't stand up for her. This fantasy is her plan to get out of her home. Her dreams have kept her sane. As she sits in her chemistry class Dale walks in, he looks so much like Tyler Vincent. After a class of small talk, and a red heart made out of skittles. Dale and Sara star a friendship that becomes the reality Sara needs. But will she choose reality over her fantasy. Dale just happens to be an inspiring rocker, and Sara starts to see that he might be the one who can save her heart. Dale was a great character, so sweet and understanding of Sara. These two are hot together. This story had so many layers that were peeled back to find secrets, and uncomfortable truths. It was a story of love, friendship, and acceptance. Do yourself a favor read this great book. Take a trip down memory lane if you remember the 80's. Or if you don't find out what all the fun was about. Either way this was a great read...I truly enjoyed it."}, {"userName": "Megan", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/17141751-megan", "userReview": "Think back to that rockstar, boy band, rapper or... pianist in the 70s, 80s, 90s, or 00s, you fell in love with. Remember all the fantasies that you created of this person? Remember how you felt like you knew them? Remember how you put them on a higher pedestal making them more than human? Well take what you did and multiply it by 80! THAT'S how bad Sara had it for Tyler Vincent '87.The novel is broken up into two parts, \"The Warm-Up Band\" and \"The Headliner\".In \"The Warm up\" begins with Sara and her friends in alternate high school. There is a rumor that there is a new guy in school that looks like no one other than Tyler Vincent. Sara find THIS hard to believe! There is no one she has eyes for other than Tyler and there is no one who she will ever have eyes for. Until Dale sits next to her in Chemistry class... He looks EXACTLY like Tyler Vincent only he has blue eyes! He's from the same city! He plays the guitar! This guy is so dreamy, but will his secret tear them apart?\"The Headliner\" focuses on Dale and his band Black Diamond. They are trying to make it as MTV's Best New Band. Dale and Black Diamond are naturals on stage! Girls don't even know their name or songs they're singing but somehow they suck them in, making them love them. Dale and Black Diamond are a new band together so they practice a lot, making sure they are polished enough when they end up on MTV. While Dale is trying to be Best New Band, Sara is making her escape plan from her sucky life and New Jersey. The only problem is that Sara's plans may get in the way of Dale's too!I received this book in exchange of an honest review."}, {"userName": "Ailene♥", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/19370866-ailene", "userReview": "After reading this book, my emotions were everywhere but in a good way. I didn't even intend to cry. But my tears were pouring. I'm just so happy I've decided to read this book. Dale and Sara's chemistry was intense! It's not forced. It's just natural. Their relationship was real. Their conversations/interactions made me giggle so hard and there were butterflies in my stomach the whole time! There were times that it reminded me of another book that I've read before. It brought out some emotions that I was feeling when I was reading Love Unscripted. But this one's way better...Dale Diamond reminded me of Ryan Christensen. He's so mature and so in love with Sara. He's very understanding, FAITHFUL and he's such a sweetheart! And their steamy scenes were REALLY HOT!!! JUST WOW!!! One of the best I have ever read!!! lol!In the beginning, I already had my suspicion who Dale really was. I was almost 100% sure of it. It's just that I doubted it when his dad was introduced. I thought I was wrong. Then, he said his mom had an affair. It brought out my suspicion again. But I told myself, his dad couldn't be that dumb, right? In the end, I was still right. The thing that really surprised me more was Sara's revelations. It would have been better if those were revealed a lot sooner in the book because it kept me a bit blindsided in the end. But there were so many goods in this book. It's almost perfect for me. The ending was quite unique, actually. I'm so happy about that. I don't think a sequel would be necessary because I don't want more drama. But if there is, I hope it's lighter and more like an epilogue book... Great job Emme! :)"}, {"userName": "Karen", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/4864278-karen", "userReview": "I received a copy of this book from the author for honest review.Let me just get this out of the way first. Rick Astley, The Cure, Tiffany, Duran Duran, INXS, Bon Jovi, Violent Femmes….Ahh the memories. Yes this was a wonderful 80’s flashback for me. I admit that some of it was repressed such as Madonna cut-off gloves, but hey, we can all laugh about it now. It was a lot of fun and certainly helped remind me of my own rock star crush when I was a teenager.Sara has a major obsession with Tyler Vincent that began when she was 14 years old. Tyler is a Rock God and Movie Star, and Sara has made it her mission to know everything about him. He is the focus of all her hopes and dreams, and a way for Sara to escape her reality.Along comes Dale Diamond. Gorgeous, sexy, confident and looking just like a younger version of Tyler Vincent. I loved the chemistry between Sara and Dale that sizzled right from the start. Beyond that I loved the developing relationship between them. Dale was such a sweetheart and a nice change from the bad-boy rocker type character that I often come across. I loved how Emme Rollins managed to write a character like Dale Diamond with all that rock star charisma and sex appeal yet underneath everything Dale was a good guy.This was a more than just a rock star romance as the story deals with some heavy issues. While I did at times question Sara’s continued obsession with Tyler Vincent, I can understand why she needed that focus in her life. It was an entertaining story with some wonderfully steamy scenes to keep the pages turning."}, {"userName": "Miranda", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/20665832-miranda", "userReview": "[ Except during the whole time he was neglecting at least a kiss! I thought I was going to curl up and cry I was so ready for them to just do it already. And boy they didn't disappoint ;)  (hide spoiler)]"}, {"userName": "Illustrious Illusions", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/17282619-illustrious-illusions", "userReview": "First, let me saw while you may not be a New Adult fan ~raises hand~ Dear Rockstar is not your typical New Adult genre story. I can honestly say I laughed quite a bit as I was reminded of the 80's ~ a genre sometimes better left forgotten. So, if you are an older reader who doesn't feel like they have anything in common with this new genre, you will love Dear Rockstar and the memories it evokes.Sara has faced some challenges in her young life that could have destroyed her, but she has found a way to create something different. Dale learned some hard truths in his young life, but is one of the most compassionate men I've met in awhile. I also adore when the supporting characters have pivotal points in the story as they do in this one. From their parents, to friends, every character is there for a reason.Dear Rockstar is a fabulous debut novel that touches on a lot of emotions, has a super seXy rockstar or two, and will evoke memories in the reader ~ that is if you remember MTV used to play music videos and you read 'Teen Beat' to get your rockstar news! ~LOL~ A unique take on the rockstar heroes that are running amuck today and a phenomenal journey of love and trust.Review copy provided by the Author in exchange for an honest review."}, {"userName": "Kelly ", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/447260-kelly", "userReview": "I was really worried when our h/h meet in the oh so over used Chemistry class. But no need to worry because Dale and Sara are Amazing? From go I could feel the connection they had. Dale is an amazingly,swoonsy, Prince Charming of sorts and Sara is in need of his love. You will love her! She is one of those characters you just want to take under your wing and protect. So where does Tyler the Rockstar figure into this??? I'll admit it was a hard sell for me, this utterly crazy way Sara obsesses over him. In the end I got it. Some of this was hard to read because although you know where things are going you can't help but die a little for Sara. Now Dales story was a little different for me. It reminded me of another book. Don't RUSH to conclusions because it's not exact but just elements were similar. I'm not sure if there will be any other books but I would like to see Sara's BFF Aimee and Matt get a story. I can't end this without mentioning how incredibly sensual the sex scenes were! They are so well written that I could actually feel the emotion pouring off of Sara and Dale. Another neat thing being set in the 80's I'm an eighties girl! Bottom line it wasn't perfect but, the good heavily out weighed the bad."}], "description": "Sara is obsessed with rock star Tyler Vincent, and as she works to complete her senior year, she’s determined to find a way to meet him—although her best friend, Aimee, keeps telling her to find a different escape from her desperately violent home life.Complications arise when Dale, the mysterious new transfer student, sets his sights on Sara, and she falls for this rock-star-in-the-making in spite of her better judgment. When Sara wins a contest, she is faced with a choice—travel to Tyler Vincent’s home town to meet him, or stay and support Dale in a Battle-of-the-Bands hosted by MTV.Their triangulated relationship is pushed to its breaking point, but there is another, deeper secret that Dale’s been keeping that just may break things wide open...Turn up your collar, feather your hair, and splash on some Polo, because we’re going back to the ‘80’s when MTV played music videos, there was no such thing as American Idol, and becoming a star meant doing nothing short of crazy for that one, big break.", "title": "Dear Rockstar\n      \n          (Dear Rockstar #1)", "url": "https://www.goodreads.com/book/show/18113029.Dear_Rockstar", "average": 3.8, "cover": "https://images.gr-assets.com/books/1372425033l/18113029.jpg", "reviews": 267, "authors": [{"url": "https://www.goodreads.com/author/show/7144570.Emme_Rollins", "name": "Emme Rollins"}], "type": ["New Adult", "Romance", "Music", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/18113029-dear-rockstar", "http://www.goodreads.com/book/show/18163903-dear-rockstar", "http://www.goodreads.com/book/show/18110098-dear-rockstar", "http://www.goodreads.com/book/show/18658219-meeting-trouble", "http://www.goodreads.com/book/show/22568041-following-trouble", "http://www.goodreads.com/book/show/23007436-making-trouble", "http://www.goodreads.com/book/show/18431690-lucky-girl", "http://www.goodreads.com/book/show/18159587-buried-secrets"]}