{"ratings": 364, "userreviews": [{"userName": "Athena Shardbearer", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/4159427-athena-shardbearer", "userReview": "Buddy read with Boo-Thang! (Shandra) & Boo-Ski! (Annette) July 8. MUHAHAHAHAHAAHAHAHAHAHA!Well, this book wasn't as scary as I thought it would be. The writing was beautiful and engaging, but I kept waiting for the zombies to come out. It was more along the lines of the history of zombies, where they come from, how they exsist and a lot to do with the bible. What I did like is God is seen as a woman, Yirmiyahu is her prophet and he is there to spread the words that she wishes to deliver. \nYou shall bury the flesh of the dead, and raise above it a cairn of stones, a warning to any that see. You shall not touch the flesh of the dead, for the dead body is unclean. If a man touches the flesh of the dead, you shall put him from your camp, and watch him. Seven days you shall put him from your camp.\nThere is a lot of references of God and the bible, religion, and priest and at times it was over done, but it was ok. Just eh. I gave it three stars because of the writing and a little because of the story. I'm not sure if I will read the next one, maybe if there was a little more action, more zombie attacks? But, it is a short book, so it didn't take too much of my time."}, {"userName": "Shandra", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/23160533-shandra", "userReview": "Buddy read with my girls Athena and Annette July 8th.Actual rating: 2.75 stars. No spoilers. \nThe pace in this book was a crawl. I'm so thankful it wasn't very long, because I can see myself having walked away from this if I wasn't able to keep telling myself, \"Don't give up, there's not much more left.\" I wanted to like this book. I tried to. I wanted it to be something it wasn't. I wanted more action. The premise is good. Let's take historical events from the bible and make them into fiction. Let's toss some zombies in there. How could a book be bad when it has zombies? Well...I learned how. I'm an action type of girl. I wanna see throats being ripped out. I want to hear people screaming. I want to see blood flowing in rivers. I don't give a crap about the human condition of it all. Hey, I told you I'm cold hearted. This was just too slow for me. I'm sure many people would enjoy this story, but I'm not one of them. I'm giving it 2.75 stars cuz I didn't hate it, I just didn't like it. The writing was pretty good though, just the pace wasn't. I won't be continuing onto the next books in this series because this story just isn't for me."}, {"userName": "Lily at Bookluvrs Haven", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/7527747-lily-at-bookluvrs-haven", "userReview": "This story BLEW me away! And what an amazing cover! Good representation of gut punching story coming at you. This story IS NOT for the weak of heart (or stomach)!Let me start with a warning that I hope you pay attention to. Please don't spend an hour and a half cooking up a great dinner, because you will not enjoy it, if you eat and read this book at the same time, like I stupidly did. Not only did my dinner go cold due to all the chewing pauses as I ferociously devoured parts of this book (as opposed to devouring my scrumptious dinner), but the slight feeling of nausea as some of these scenes played out in my head didn't necessarily allow me to fully enjoy the food on my plate. Needless to say, my better half gave me a couple of looks and head shakes, and asked me if I was going to finish what was on my plate... Well, at least HE enjoyed dinner...As a Zombie genre fan, this had all the EWW impact moments one would look for. I have never heard of Stant Litore, but holy crap, did he ever write a good zombie story. I am an INSTANT FAN.That being said, something else caught me off guard about this book. That being our main character and prophet, Yirmiyahu and how deeply his story touched me.This story didn't really focus on the plague of the walking dead and how it even came about. It focused on the spiritual and physical struggles of Yirmiyahu as he tried to convince the masses to have faith in God (good twist with portraying God as female by the way). This was such an emotional and gut wrenching story. I found my eyes filling up with tears during some of his most agonizing moments as he fought to stay alive. And though I will not include a spoiler in this review, let me just say, towards the end of this story..... Big, big \"Nooooooooooo, no no no no!!!!\" moment...Wow... Just... Wow.... Great character development? Check!Great story and plot? Check! Emotionally wrenching? Check! Memorable and thought provoking? Check! Zombie gore factor!!! Check! Check! Check!If you guys like the Zombie genre do yourself a favor and check this novella out. I really don't think you will be disappointed. Worth every penny. (For this and other reviews visit us at http://bookluvrshaven.blogspot.ca!)"}, {"userName": "Simon", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/211278-simon", "userReview": "Quite interesting, with several virtues, but in the end not quite satisfying. I gather the author is zombifying the whole Bible, one book at a time. I like the idea here, the scope of the whole project. This, the first installment, is a novella based on the book of Jeremiah. The work focuses on Jeremiah (Yirmiyahu, since the author uses the Hebrew version of his name.) He is, of course, an Old Testament prophet, railing against the moral failings of his society - the hungry children, the idol worshipping. He is also a Levite, a member of the priestly caste, concerned with ritual purity. This combination of prophet and priest makes an absolutely perfect context for the figure of the zombie, the unclean dead who preys on the poor children in the squalid alleys and feeds on the sacrifices of children made to terrible chthonic deities. In addition, the events unfold as the city of Jerusalem is under siege by the Babylonians. Death, hunger, thirst, are rampant; in effect, everyone in the city is already a member of the walking dead.The author can write well too. The prose has the right majesty to match the tone of the prophetic book it re-imagines.Why, then, given these things, did I not completely fall for it? I think it is because it lacks drama. Some dramatic events do happen but they are told in a highly undramatic idiom. Characters, with the possible exception of Yirmiyahu himself, are not vividly brought to life; their interactions are not animated in the telling. This creates a certain monotony in the tone."}, {"userName": "Masquerade Crew", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/6447941-masquerade-crew", "userReview": "Bec C.'s Review:I have to admit. I nearly didn’t finish this book. Around the 20% mark I was becoming very unsure as to whether I wanted to keep reading it, and in fact turned to other reviews to help me decide. Being non religious, I struggle to read books with heavy religious elements, and this book, being based on a bible story, has some religious elements. And yet I did keep reading and boy am I glad that I did. Much like other alternate history books (such as Pride and Prejudice and Zombies), this book takes an existing tale and changes it to include the walking dead. The story in question is of Jeremiah, who was thrown down the well. This might seem worrying and controversial to some, after all wouldn’t those who enjoy zombie stories want them to be free of religion? And wouldn’t the religious want their stories free of zombies? And yet this book manages to merge the two in a very tasteful manner. The religious elements are just an element of the story, they are not overwhelming or made a mockery of. You are dealing with one man’s faith in the face of the perils of zombies rising against his town, and of his people refusing to listen to him. It is a compelling story and one I enjoyed, despite being non religious. I believe this story is written in such a manner that those it risks offending through its very premise, zombies in a religious story, would actually be surprised to find themselves enjoying it, much as I did. Give this story a chance and it might surprise you too."}, {"userName": "Adeselna", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/3244681-adeselna", "userReview": "Full review: http://madwomaninattic.wordpress.com/...I was not expecting something so biblical, perhaps some action, deaths, something more graphical, but, as always, that is the readers fault. What is not our fault is the lack of main goal and conflict. For the most part you keep trying to understand what is Yirmiyahu doing in the middle of chaos. What is his purpose, his goal? We also fail to understand the initial incident. There’s a plague, right, which turns people into walking dead and we find our protagonist inside a well. Then we follow his flashbacks struggling with the absence of action.The scene with the God Chemosh is the best part of the book. It evokes the cruelty of Gods and the naivety of humans, who are willing to sacrifice children to appease the divinities. Throughout the book the author has done a good job showing us what the humans are capable of in the cruelest way. A city even abandoned by God is certainly a powerful image.As I have the third book “Stranger in a strange land”, I am looking forward to read the other books. It is true that I have read worse first books from authors, but still it did not satisfy me as a reviewer."}, {"userName": "Susan Sample", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/1507135-susan-sample", "userReview": "This is really a review of all of the Zombie Bible books. They are fantastic. They may be my favorite of all of the zombie narratives out there. Litore has clearly done a mountain of research into early Hebrew culture and religion (and early Christianity) and puts it to good use here. Zombies are not apocalyptic here--they are an ongoing problem that recurs through history, and somehow, that reimagining of the usual zombie narrative really made me love them. The apocalyptic vision seems a bit done by this time--really, is there a new story to tell about zombies? This is a great one. I like the Christian addition to the tale as well. It's lovely and faithful and touching (and while I'm not religious, I figure I can suspend disbelief since I'm reading about zombies in the first place!). This guy's writing is great--he manages to invoke ancient civilizations with their beliefs, values, and behaviors intact, while slipping zombies into the mix so seamlessly, I am in awe. Also, how can a writer go wrong when his daughters are named Inara and River?"}, {"userName": "James", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/6359177-james", "userReview": "I had really mixed feelings on this book. I can agree with many of the other reviewers on the quality of its thematic and storytelling elements. However, it may have just been a bit too long in tooth to get to the point, resulting in some degree of dilution."}, {"userName": "James", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/4286733-james", "userReview": "If you are into zombie stories this is one of the best ones out there. A different take on the zombie genre. Not just blood and gore but a great historical look at zombies. Definitely recommended to all zombie fans."}, {"userName": "Natali", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/5755333-natali", "userReview": "Awesome and daring premise, but almost too biblical at times."}, {"userName": "KB", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/64698141-kb", "userReview": "I bought a signed copy of The Silver Edition with beautiful cover art by Lauren K. Cannon. The binding is glued but quite sturdy for such a thin book and will take some abuse yet unfortunately the cover paper is already curling and separating at the edges so I fear that this edition will not stand the test of time. Moving on to the plot. Seeing that it was based on the book of Jeremiah in the bible I felt compelled to read the RSV before diving in. I was quite impressed with his attention to detail and inclusion of actual verse from the bible. Immediately I could see why it was an easy plot devise to include zombies; (forgive my notation if it's incorrect I'm new to this) Jeremiah 7:33 \"And the dead bodies of this people will be food for the birds of the air, and for the beasts of the earth; and none will frighten them away. \" Then in line 34 \"...for the land shall become a waste.\" And again the entire 8th paragraph described the dead as being \"dung on the earth\" and that \"Death shall be preferred to life\" and finally settling on the title phrase 9:21 \"For death has come up into our windows, it has entered our palaces, cutting off the children from the streets and the young men from the squares. 22 Thus says the Lord: \"the dead bodies of men shall fall like dung upon the open field, like sheaves after the reaper, and none shall gather them.\" Clearly he had ample zombie material to draw from, who knew? But let's start there. Great inspiration yet by page 88 the story arc resembled more of a flat line and Yirmiyahu was still in the well having flashbacks. By the end of the book (pg 109) I was left with the question...sooo what was the story? By being so faithful to the book of Jeremiah it's almost as if he missed out on a great opportunity to take some creative license and formulate a fully fleshed out story; One that includes a beginning, middle, and end, plot devices to drive the story forward, and a precisely defined message. As stories go the bible wasn't written by professional writers, their goal wasn't to entertain but to teach and even then the message is convoluted at best with A LOT of room for interpretation, thus the schisms of religion. Over all -I really enjoyed the beautiful prose and metered phrasing, there was the backdrop for what could have been an epic story but he failed to deliver a plot. I realize that this style of seemingly incomplete writing is natural for comic books that are intended to keep you reading the serial and from what I understand -there are more Zombie bible books to come; Unfortunately, they just aren't for me."}, {"userName": "Lauren", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/7390420-lauren", "userReview": "Originally published on my blog (http://novel--concepts.blogspot.ca/20...)Summary: Yerusalem is being ravaged by a plague, so what else is new? It's biblical times, something bad is always happening in Yerusalem! This isn't just your normal plague though, this isn't wine and water turning to blood, it's not frogs or fireballs falling from the sky, and it's definitely not something as mundane as a plague of locusts. No, this is an old plague, true evil, a sign that the people of Yerusalem have truly failed God and are doomed, it must be; for why else would the dead be walking the earth?Yirmiyahu (Jeremiah for those of you unfamiliar with the biblical spelling) tried to warn the people, he truly did. He tried to stop them, did everything in his power to try and make them see the error of their ways. He has failed; the city is besieged by Babylon and there are more and more dead wandering the streets, soon they will surely out number the living. He is of course terrified and appalled, with his fellow men and especially with himself. He blames himself for their downfall, for not doing even more than he did to stop it from coming to this. Yirmiyahu has given everything to try and save Yerusalem, even breaking his covenant with his wife to send her away so that he could stay and try to save the city he loves. But now he is alone, for even God has left Yirmiyahu.Without God how can Yirmiyahu hope to save Yerusalem and its people from the tide of walking dead that they unleashed upon themselves?\nReview:\nAt 93 pages this is a lovely little one sitting read, or at least it would have been something I could have read in one sitting were it not for the fact that I've been having a hard time concentrating on anything for more than thirty minutes at a time thanks to my wisdom tooth headaches (I'm headed to the dentist on Wednesday to get that looked at). I like books that can be read in one sitting, I'd much rather spend two and a half hours reading a book from start to finish than watching a movie. The book is a much richer world and I have a very vivid imagination; I usually much prefer my own visualisations to those in film adaptations for example. Because of my headaches, I wanted something that would allow me to get through it quickly because I knew it would be an effort to focus so I scoured the pile and came away with this and it fit my reading needs at the time perfectly.This is not the type of book I would normally gravitate towards, when it comes to supernatural creatures I'm usually a vampire or werewolf fan. I always used find zombies to be incredibly lame but then I took a class back in 2008 and we studied zombie movies and even though I still thought they were lame I enjoyed the symbolism of them. Milla Jovovich and the Resident Evil series can be attributed with eradicating my dislike of zombies; the zombies in that series are not lame at all. So thanks to that class, and Resident Evil when I won the third book in the Zombie Bible series from Book Riot's Name that Author contest one week back in November I was super excited to read it because a) Hey I won a free book! Yeah! and b) Oooh Christian mythology meets modern horror! so I decided then and there that I would acquire the first two books and read them in order. I asked my local library to order them, and they did; but then I ended up getting a lot of book money for Christmas and just bought them myself. I'm extremely glad that I did decide to dive in and give the zombie lit. a chance because this book didn't disappoint me. That being said, if you're a zombie fan a word of warning, do not be fooled by the gory cover image above, the title or the summary; the zombies are in there, assuredly, but they are not the stars of the action so if you're expecting gory action scenes all over the place and life or death chases this is not the zombie book you are looking for. I for one am okay with that because I really enjoyed the direction that the author took the story but maybe that's just the religious culture scholar in me? There's a lot of philosophical and religious waxing on the part of the main character; a good 90% of the book is him working through his own actions and those of his fellow Israelites, trying to figure out if they are capable or even worthy of redemption by God. For that reason the narrative is not linear it jumps around a lot between the present and several different points in the past through flashbacks.On the plus side you really don't need to know anything at all about Christian mythology because Litore has taken little almost meaningless biblical incidents and imbued them with a new fantastical life. It is a bold undertaking indeed, and I know that there are people out there who are perfectly willing and ready to label this as sacrilege or blasphemy, but I am not one of those people. I applaud him for having the courage to take on this idea and it is a brilliant one. He has executed his vision amazingly, and he is so completely into this project that even his historian's note at the beginning and about the author section at the back do not break from the character he has created for himself of a zombie historian who has survived a 1992 outbreak of zombies in the Pacific Northwest. That right there is dedication to one's art.I am excited to read the rest of the series and Stant Litore is now most definitely on my list of authors to watch for.\nCheck him and his zombies out at http://zombiebible.blogspot.com"}, {"userName": "Shamela", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/10937373-shamela", "userReview": "I have put off publishing this review, mainly because it's the first time I've written a review that I KNEW the author would read. [Insert nervous fidgeting here.] Full disclosure: I am acquainted with Litore via a friend of a friend on Facebook (it's a fine chain of authors: Darin Bradley to Jeff VanderMeer to Stant Litore), but I am not being paid or bribed for this review. I won a digital copy fair and square. Just so you know.I was skeptical about this series but certainly curious, and had it on my \"to read\" list for quite a while. One of the things that intrigued me about Litore is that he is an interesting case study, if you will, of the changing landscape of book publishing. The first two novels of The Zombie Bible were self-published, then picked up, and Litore is very active in self-promotion via Facebook relationships with readers, using discussion groups, frequent status updates, etc., to connect with both established and new readers of his work. I appreciated that he attempts to respectfully and thoughtfully engage his FB friends in discussions about publishing, aesthetics, religion, and the like--all of which predisposed me to give this series a try.The Old Testament + zombies. Such a mash-up runs the risk of being gimmicky (\"What's that, Lassie? The prophet Jeremiah is trapped down a well with a zombie?\") but manages to avoid the Pride and Prejudice and Zombies fate of being amusing for the first chapter or so, and then running out of steam when the joke wears thin. Largely in part because Litore is not shooting for novelty or comedy. His novel is genuinely creepy. Creepy, and deeply thoughtful. It is a truism that sci-fi is often an entertaining and nuanced way to provide social commentary--horror doesn't get discussed in the same way as often, but this series, at least, should. Litore delivers a story that is claustrophobic and awful and gross in all the best ways, that I just couldn't read at a fast clip. Why? Because I had to keep putting it down in order to Think About Stuff.Stuff like the nature of oath-taking and contracts. Stuff like notions of personal integrity. Stuff like how to judge if someone's being stubborn, stupid, or heroic. Stuff like issues of poverty and class in our current society. Stuff like definitions of courage. Stuff like political expediency during national emergencies.Seriously. It's almost crazy-making just how thought-provoking I found this novel. All the things I'm listing here might make you think that it's too heavy or pedantic, but please don't be deterred--it's a great horror story, and you don't have to interrogate it in any of those ways. But I happen to think that it's a selling point that it bears such interrogation.Litore's depth of research is evident, and I liked his choice of going with a less Westernized version of character names. That decision is of a piece with what I feel is one of the things the novel deliberately tries to do: forcing the reader who is \"familiar\" with Old Testament stories to look at them in a new way. One thing that did wear on me just a bit was that Yirmiyahu's internal monologues covered the same ground in very similar words, over and over. I suppose I could be charitable here and say that he is worried about the same two major issues throughout the book (breaking covenant with his wife; spurring the king to deal with Israel's \"unfaithfulness\"), and that it's typical for worried people to niggle at the problems they're facing. I just found it a bit drawn-out, as if there was perhaps a concern that the reader wouldn't understand that those issues were the raison d'etre. It also took me a while to grasp why Yirmiyahu categorized his actions towards his wife as breaking covenant, but that's a problem with my modern perspective, not Litore's prose.The \"examine this story again\" element that most appealed to me was Litore's characterization of God as feminine. Coming from a faith tradition that has repeatedly shut down the notion of women's ordination in ways that draw heavily on particular translations' Old Testament standards, I have always found the exclusion of the feminine principles found in the early Gnostic/Coptic tradition disheartening and off-putting. I remember the first time that I read about Sophia, the feminine figure seen as both the human soul and an aspect of God analogous to the Holy Spirit, and the history of how that aspect was suppressed. I loved those mentions in early scriptures, and was depressed by the lack. Now, in Litore's book, that figure is rediscovered/reconfigured as the primary aspect of God, and the Biblical texts have a brand-new emotional resonance. The yearning of God for Her people hit me with almost physical pain, and the parallels between Yirmiyahu and his beloved wife with God and Her beloved people are numerous and elegant.Chances are, you might like this book sheerly because of the novel menace of the undead plaguing an ancient culture. There is graphic squick and gore aplenty, written well, and really that's plenty to recommend the book. What might surprise you, however, is how elegantly erudite the squick and gore turn out to be."}, {"userName": "Andrew Talbert", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/70038062-andrew-talbert", "userReview": "Trying too hard. It seemed like the whole book was an attempt to turn the Song of Solomon into a sex scene for Jeremiah and his wife. Too terrible to finish."}, {"userName": "Matt Mancini", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/9271478-matt-mancini", "userReview": "So the Babylonians are coming and Jeremiah is calling the nation of Israel to repentance for her idolatry and the breaking of covenant with her God. This is the history. Into this, Stant Litore throws zombies to make a dire situation even more dire and add a new difficulty for our intrepid prophet and the covenant people of God.I wanted to like this one. Like, really. It's a really interesting concept (if not necessarily entirely original) and I like the allegorical possibilities that present themselves when the living dead are present among the spiritually dead. From very early on, though, I found myself disappointed. Some things you should know about this book:1.) It's quite short. I'm not sure how many pages it would be in print as I read it on the Kindle, but I imagine it was somewhere on the order of 100 pages. This isn't necessarily bad. Just something you'll notice pretty quick.2.) From the outset, the author refers to God in the feminine. I have to be honest, this really gets on my nerves. I have nothing against femininity and God doesn't either (despite the claims of His critics), but the God of the Bible; the God of Abraham, Isaac, Jacob and, yes, Jeremiah, is referred to in the masculine. He is God, the FATHER. This isn't novel and it isn't intellectual, it strikes me as cheesy and gratuitous. It's one of those things that is so annoying to me that it made it hard to consider this book a real winner after the first appearance of the word, \"she.\" The idea of a female god is intriguing and Litore played it well, don't get me wrong...but as I've mentioned, the God of the Bible is simply no referred to in the feminine. To make an adequate comparison, it would be like writing a historical fiction novel in which Abraham Lincoln was portrayed as a lady. ...only, now that I write that...it sounds kinda interesting. Take it for what you will.3.) Not a ton of zombie action here. In fact, not a ton of action at all. The entirety of the plot in the book occurs in something a little like hybrid flashbacks and first person remembrances. Jeremiah, in actuality, spends the entirety of the book at the bottom of a well. Accordingly, there is very little by way of resolution. He starts in a well, he ends in a well...you are told of his prophesying to King Zedekiah, you are told of the Babylonian siege...but you aren't really told where it all ends up. Guess you'll have to read the Bible to get resolution...again, maybe not a bad thing.4.) The one very strong point in this book, in my opinion, and the most fully-developed plot line, is the relationship between Jeremiah, and Miriam, his wife. Their love is beautifully portrayed and paralleled with the covenant of God with her (His) people, and it was this love, and Jeremiah's commitment to his wife, that made me care of about him (and therefore this book) at all.All in all, it was an interesting read that, in my opinion, fell well short of its potential and ventured too far into cliche and trend. This could have been done so well. And, while I'm unimpressed with the direction this book took, I have every confidence that Stant Litore even has the style and skill to pull it off fantastically - there's no question the man can write. That said, it needed to be longer, more developed, more conflicted, and less cliched. Prose simply won't carry the whole shebang the whole way."}, {"userName": "Danielle", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/4764837-danielle", "userReview": "When I first heard about The Zombie Bible, my brain was flooded with a cacophony of thoughts.1.\tIs this going to be another unnecessary Bible “translation” like the LOL Cat Bible or the Conservative Bible?2.\tIs this going to cause Fred Phelps to visit Stant Litore carrying “God Hates Zombies” signs?3.\tThis isn’t this Zombie Bible is it? 4.\tDo we really need more zombie stories?Intrigued, I downloaded Death Has Come Up into Our Windows, and settled in with my Kindle and some hot chocolate. Whatever I had been expecting, this was not it. From page one, I was greeted with intelligent, eloquent, academic prose. The tale begins with a note, ostensibly from a historian, giving readers some background of the rise and fall of the zombies. It is here that we learn what it is about zombies that fascinates us so—they reflect the worst of ourselves, that thing inside us we are afraid to face. After a lengthy but necessary introduction, the story begins in proper. Death Has Come up Into Our Windows is based on The Old Testament events of Jeremiah 38, where the prophet Jeremiah is thrown into a well for warning the King of the impending fall of Jerusalem. Kings, it seems are so caught in their own hubris, any hint of impending doom is taken as blasphemy, treason, or both. And so it is, that Stant Litore’s telling of the tale finds our protagonist, Yirmiyahu (the Hebrew, non-Anglicized version of the name Jeremiah) tossed into a mud filled well where he is forced to wrestle the undead for the amusement of the king’s guards. Clearly, this is not a line by line retelling of the Old Testament story, rather a retelling based loosely on the biblical account. What really drew me into this story is that (like most well-told zombie tales) it is not a story about the walking undead, but a story about humanity. That is not to say it is a zombie story missing zombie gore, for there is gore in abundance; however, there is not gore for the sake of including some blood and guts. Instead, we are presented with a world where we are forced to question exactly who is the antagonist—is it the shambling undead, hungry for flesh or is it the living humans who have created this problem due to their own inequities? While in the well, Yirmiyahu has time to ponder his life, to reflect on his own shortcomings, to battle his faltering faith, and to reflect on what his society has become. Far from the typical brainless (see what I did there?) zombie fare that is in excess these days, Stant Litore has presented his readers a well-written philosophical dilemma wrapped in zombie paper. The result is a mash up of literary fiction and zombie action. This story deals with very real human issues in a smart and sensitive manner and forces readers to look inward while also entertaining the hell out of them. Fans of zombies will not be disappointed by Death Has Come up Into Our Windows, but it is also an excellent entry point for those new to the genre. I am glad that I took a chance on this story and am looking forward to more from Stant Litore. And, in case you’re wondering, the answers to my cacophony of questions are: 1.\tNo. But, the LOL Cat Bible is a fun way to kill time waiting for a doctor’s appointment.2.\tMaybe, Fred Phelps & the crew do enjoy a good sign waving.3.\tThankfully no, not at all, not even a little.4.\tOf course we do, why would I doubt this?*Review from Mercurial Musings"}, {"userName": "Jennifer (Bad Bird Reads)", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/6864850-jennifer-bad-bird-reads", "userReview": "The GoodThe Zombie Bible? Yup, you heard right. I had the same reaction when I first heard about this series. I was a little reluctant at first because I had never read the bible, so I wasn't sure how much I was going to truly understand Death Has Come Up into Our Windows. Especially since the author notes: \"Based Loosely on the Events of Jeremiah 38, 595 BC.\" But it's not religious fiction, it's a book about religious events. And the more I read, the more I got into the story and understood the biblical history and how it tied in with the fantasy of a land filled with zombies. But first, let me tell you what greets you on page one: “By the time they lowered Yirmiyahu into the old well behind the king’s house, the city around them was already dying.” Yup, kick in the face, right? So, as you can assume I was intrigued from the get-go. The book, in general, is about Yirmiyahu who says he is God's prophet. He can hear her cries and anguish over her People (yup, God is a female in Litore's tale, have to give him point's for that). Her People who worship other deities through the sacrifice of children. Yirmiyahu then finds out that his fellow priests encourage such death in the hopes of satisfying the undead and their hungers. But Yirmihau knows this is not the way. Unfortunately, no one will heed his warnings, and eventually the People take out their fear on the one prophet who is trying to save them. This book has more of a literary quality to it. Every page had rhythmical, intelligent language that enriched the story. This is not just another zombie book. Litore takes us further into the darkness of the human condition. And the obvious amount of research Litore has done in preparation of writing this series only makes me respect him more as a writer. Yirmiyahu is an emotional character that really makes the reader ache for his many trials he must face for being God's prophet. He cares for God's People, even though they may not care for him. I have to say my favorite parts are the times he spends with his wife. You can tell he truly loves his her, and reading about their moments together filled my heart with joy. This book will disturb you, it will enthrall you. It's a new take on the zombie craze that has a deeper meaning. I was literally speechless for a couple minutes after I turned the last page. The BadAt times, I felt the book got a little repetitive. I would read a sentence and swear I just read the same sentence a couple pages back. Also, though I understood the biblical theme for the most part, I feel that a knowledge of the bible would have helped me understand and enjoy the references and story as a whole a little more. The SnugglyNo actual sex, just little moments of intimacy. OverallThis story was both original in it's premise and terrifying in its no-holds-barred type of truth. This book is not wrapped up with a pretty bow at the end. We get heartbreak and we are shocked and horrified by the conclusion. This is not a light read. It's a story with depth that is both satisfying and enjoyable. I would like to say that this sort of book may not be for everyone, but I for one thought the writing was beautiful and the story entertaining. http://readingandwritingurbanfantasy...."}, {"userName": "Ron Giesecke", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/41869077-ron-giesecke", "userReview": "For death is come up into our windows, and is entered into our palaces, to cut off the children from without, and the young men from the streets.Jeremiah 9:21-------I’ll just say this at the outset. To simply categorize this series as a biblical narrative with the enemies of Israel transposed with zombies might be the verbal synopsis I give to someone whom I might think would like this, but it is so much more than that.Anyone familiar with Jeremiah’s plight will know the schematic here, even if Litore takes certain liberties with a few things. In reality, the libertarian license was taken the minute the undead were placed in the narrative in lieu of the Babylonians anyway, so really the question isn’t “is he going to take this license,” but “how far?” And I personally think he stopped short of losing anyone who might be uncomfortable with an out-and-out departure.Essentially, the prophet is tossed into a cistern, because no one really wants to hear the uncomfortable information he has to put out—a plague—an invasion is coming, and there are things you need to do to stop it. One of those things being the cessation of the horrific practice of child sacrifice to idols. And this invasion, of course involves the walking dead.As is the usual case with municipal authorities needing to make examples of supposed religious fanatics, they toss a zombie or two down into the muddy well with him, and listen to him struggle for supremacy in the mist of dehydration, hallucinations and dreams mixed with the prophetic as well as the nostalgic.In this narrative Jeremiah has a wife—oddly enough, a character that probably never existed in real life, yet becomes the apex around all emotional investment I made into the story. And believe me, for a simple 89 pages, the author had me invested in that relationship.Two caveats for the conservative reader. God is referred to in the feminine pronoun in this book, and while I was at first thrown by it, I managed to see a larger thought in this narrative; that a subtle, maternal side in the midst of a raging prairie fire of manhood, testosterone, and death would provide the gentleness to an Old testament God who gets a bad rap for something other. I don’t feel the characterization was made to mollify some socio-political worldview, and the ultimate treatment of God and his non-changeability is actually held very high in the book. So for me, the 180 on the gender reference simply covers the gentleness and lilting touch of the Creator.The other caveat would be what some reviewers have referred to as a “sex scene,” but really, it is more an implied conjugal moment between husband and wife. There is no salacious material there, and quite frankly, Song of Solomon carries far more material than this moment provides. Somehow the sanctity and privacy of their marriage is kept intact, all the while letting you know they are bonding under the worst of human circumstances.No spoilers here. It’s a short book, but big on investing your mind and heart. It’ll also drive to back to the primary source material, if you’re devout in any fashion."}, {"userName": "Sam Woodward", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/23524001-sam-woodward", "userReview": "Stant Litore's Zombie Bible series is a unique take on the saturated genre of zombie fiction - and it's surprisingly effective! He has taken select Bible stories & reworked them with added zombies. But forget Pride and Prejudice and Zombies with its forced humour, this is a much more mature & affecting book.This is the first in the series but each book is a separate Bible-inspired story, which is why it says on the authors' website that they can be read in any order. It's the story of Old Testament Prophet Jeremiah (referred to by his non-anglicized name Yirmiyahu), who has been thrown down a dry well in Yerusalem. This is because his rage & frustration at the social injustice in his city earned the wrath of his king, who has come to \"love wealth instead of improving the health of his people\". And while poverty & zombies consume Yerusalem from within, the hordes of neighbouring Babylon lay siege to it from without. We learn through flashbacks that Yirmiyahu preached that the city gates should be opened to let the Babylonians cleanse the zombies & feed the poor, which naturally did not go down well with the ruling class whose wealth would be plundered.As a non-Christian, I initially had mixed feelings about the biblical element but while it's a significant part of the background & Yirmiyahu's psyche, there's no overt preaching to the reader. Instead Yirmiyahu's burning rage at social injustice ties in rather well with the themes of modern zombie novels. Instead of corporate irresponsibility & governments dispassionately making no attempt to save those caught up in infected areas, we have affluent rulers who have neglected their people, priests who sacrifice food to \"gods who promise the most rewards for the least effort\" while their own people are starving. Either way, Litore informs us that whether it's \"our tendency to let problems fester untended until they become crises [or] our frequent inability to work together for a common good,\" in his alternative history, \"the rapid rise of an outbreak is nearly always a consequence of our own failings.\" And the spiritual failings of a society lead to its physical demise.This is an incredibly short introduction to the series (the Kindle edition is 89 pages). The claustrophobic setting of the well weaves a genuinely creepy atmosphere, making this a mostly psychological horror & more than that, an introspective on how morality should (yet all too often doesn't) shape social action. Indeed the zombies are mostly incidental. If you want more zombie-slaying action, apparently Strangers in the Land - the third book in this series - has it in spades, although I haven't read it yet. But given how Litore's haunting debut has stuck in my mind, I'll be reading them all very soon!"}, {"userName": "Teddi Deppner", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/7137458-teddi-deppner", "userReview": "I first encountered Stant Litore when he participated in a speculative fiction discussion panel on YouTube. I liked his comments. They had depth and did not simply regurgitate things I’d heard others say. I was intrigued by mention of his books, a growing collection called “The Zombie Bible”. So I put “Death Has Come Up into Our Windows” on my Kindle. And devoured it. And was struck to the heart. Struck by the beauty of Stant’s prose. Struck by the way he took me into another world, the world of ancient Israel and Babylon’s siege of Jerusalem during the time of the prophet Jeremiah. Struck by the sound of God weeping in the temple, and how the grief of God at the betrayal of his loved ones and at the death that was rampant in the city overwhelmed the one man with ears to hear it. Imagining what it was like to be alone in that. To be the only one who could hear God’s cry and to be so rejected, so many times.It is heart-wrenching. The story raises questions that are scary, disturbing, unsettling. Uncomfortable. It paints pictures that I will never, ever forget. I was willing to enter into the story because it had zombies, because I knew it was “only fiction”. Fiction, yes. Beautiful, haunting and well-crafted fiction. But, praise God, it is not only that. I would recommend this book to anybody that enjoys horror and especially those who are familiar with bible stories. The story is richer if you know the history of the people of Israel and their journey. But even without that background or belief, I think the story is a fascinating read, like a glimpse of a fantastical land in which kings and prophets face off and gods vie for the peoples’ devotion.One note to traditionally-minded Christian readers: It helped me a lot to remember that the God of the Bible is neither male nor female. Both man and woman are “created in His likeness”. Yes, he traditionally represents himself as male and when God entered the world in the form of humanity, he came as a male. However, the scriptures also speak of the Spirit of God as the Spirit of Wisdom, and calls Wisdom a “she”. There is, in Jewish tradition, references to the manifest spirit of God – the shekinah – as female. Awareness of this rarely-mentioned concept may help in accepting the author’s artistic choice to call the presence of God in the temple a “she” and should assist your enjoyment and “willing suspension of disbelief”. I appreciated the chance to stretch my mind and consider the female aspects of my God in this context. I think is a valuable exercise for every believer."}, {"userName": "Anthony Mathenia", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/6499464-anthony-mathenia", "userReview": "I was lured into reading Zombie Bible: Death Has Come Up Into Our Windows with the tease of Old Testament prophets cage fighting zombies. In reading, I expected a wry, amusing mashup between the Bible and zombies only to find out that I had been pleasantly mislead. This book is as deep as the well the prophet Yirmiyahu (Jeremiah) is tossed into where his captors drop the undead on him in cruel amusement. Really, this book isn't a book about zombies (as some critics will point out), but rather it is a book about love. In between the sparse, yet exciting, zombie slayings, there is a rich, captivating romance. It concerns the love that the prophet has for his wife, his city Jerusalem, and for God. It seems strange to describe a book about zombies as being realistic, but the author gets deep inside the head of the prophet to learn what really fired him up and caused him to risk his life to bring an unpleasant message to a people that did not want to hear it. Yirmiyahu is a one-man Occupy the Temple movement, railing against the ruling and clergy class that had turned its back on the land's poor and mistreated -- and as a result God. In doing so Stant saves the reader from the popular false impression that Biblical prophets were simply predictors of the future, but rather rightly depicts them as the people's conscience crying out against social injustice and warning what the results would be for ungodly behavior. One of many things that impressed me was Stant's command of the Biblical narrative backdrop. He simply didn't drop some zombies into a Biblical setting, sprinkling in some Hebrew words and locations for flavor. Rather he has a rich understanding, not just of the details of the source material, but of the underlying message of love. This is book is intensely spiritual and worthy of meditating on for those inclined that way. There is a poetry at work here whether it is describing the prophet's locking arms with the undead or lips with his wife. Throughout, Stant's prose is delightful and compelling. I look forward to reading more."}, {"userName": "Tung", "userReviewDate": "Apr 21, 2013", "userURL": "http://www.goodreads.com/user/show/763514-tung", "userReview": "Pride & Prejudice & Zombies kicked off the genre of taking serious literature and adding the undead. This novella is a perfect representation of this genre, and while the plot sounds ridiculous, it works incredibly well. Litore takes a portion of the life story of Old Testament prophet Jeremiah (called Yirmayahu in the book, his proper Hebrew name), and asks the question “How would Jeremiah’s prophecies sound if he was warning Jerusalem not just of the oncoming Babylonian siege, but also of the zombie problem they had in their midst? In the beginning, Yirmayahu is thrown into a cistern as punishment for his prophesying against the king, and the nation’s sins, and the religious establishment (just like in the OT). As he suffers in the cistern, he has flashbacks to incidents in his life that led him to his current state – especially flashbacks with his wife Miriam, making this story not just a Biblical narrative and zombie tale, but also a love story. In between these flashbacks, zombies are thrown into the cistern with him, and he must fight for survival. Overall, the prose is fantastic. Litore presents a completely plausible and believable characterization of a prophet’s mindset – his struggles with physical concerns balanced against what he knows to be right spiritually. He displays a deep familiarization with the historical context of Jeremiah and Jewish customs. He utilizes real verses from the book of Jeremiah and weaves them into Jeremiah’s dialogue perfectly. My only complaint with the book is that the amount of time spent talking about zombies is far, far greater than scenes involving actual zombie action. Zombies are definitely not the central story here; Yirmayahu’s faith and love are the core of this novella. (Note: some may have issues with Litore’s feminization of God in the book, but seriously, God’s gender is the blasphemy here and not the addition of zombies?) Overall, a quick, fun read with surprising depth. Recommended."}, {"userName": "Adeselna", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/3244681-adeselna", "userReview": "Full review: https://madwomaninattic.wordpress.com...During the whole time I kept struggling with the book, I tried to find the motives for it. “Come on Ana, why are you not enjoying it?”… “I don’t know, I’m just bored.” But thanks to a conversation with a friend of mine, I realized that perhaps Litore wanted to simulate the Bible structure and style. Maybe that was why I struggled with it for the most; I was not expecting something so biblical, perhaps some action, deaths, something more graphical, but, as always, that is the readers fault. What is not our fault is the lack of main goal and conflict. For the most part you keep trying to understand what is Yirmiyahu doing in the middle of chaos. What is his purpose, his goal? We also fail to understand the initial incident. There’s a plague, right, which turns people into walking dead and we find our protagonist inside a well. Then we follow his flashbacks struggling with the absence of action.The scene with the God Chemosh is the best part of the book. It evokes the cruelty of Gods and the naivety of humans, who are willing to sacrifice children to appease the divinities. Throughout the book the author has done a good job showing us what the humans are capable of in the cruelest way. A city even abandoned by God is certainly a powerful image.“She cannot stay— the Covenant is shattered; God’s ears are violated with the screams of her People.”Litore, Stant (2012-08-14). Death Has Come Up into Our Windows (The Zombie Bible) (p. 35). AmazonEncore. Kindle Edition.The end is powerful enough to imagine what will the second book style be like. It is a sour ending, but you feel like Yirmiyahu fails from beginning to the end. There is no happiness: he loses everything and refuses to fight."}, {"userName": "Courtney Cantrell", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/5182315-courtney-cantrell", "userReview": "When I first discovered Stant Litore's \"The Zombie Bible\" via Twitter, the premise intrigued me: the Old Testament...with zombies. As a Christian and a horror/zombie fan, I couldn't wait to see just how Litore wrote the walking dead into the familiar Bible narrative. As a writer, I couldn't wait to see if his premise would inspire me to try my own hand at such an ambitious genre mash-up.The author did not disappoint me on either count.\"Death Has Come Up into Our Windows\" presents a three-fold struggle: the prophet Yirmiyahu's attempts to convince Jerusalem to turn back to God, his own desperation to maintain the passion of his faith, and his fight to stay alive while imprisoned in a well. The three struggles weave in and out of each other as Yirmiyahu remembers the events that led both to his imprisonment and to his crisis of faith and as he battles the zombies that soldiers drop into the well with him.Litore's writing flows well, and I'm impressed with how carefully he crafts his tale, using historical setting and elements of Israelite culture to create richness and depth. His main characters are many-layered creations with ample development as the story progresses. The story arc involving Yirmiyahu's wife is especially poignant and moved me to tears several times.I'm giving the story 4 stars instead of 5, because the prologue (\"An Historian's Note\") was too long and threatened to lose my interest. On my Kindle, the story didn't really grab me until I was about 20-25% into it.However, I'm glad that I kept reading, and I'm looking forward to reading future installments of The Zombie Bible. (And, thanks to inspiration from Litore, I might create a few Bible/other mash-up tales of my own)."}, {"userName": "Lucinda Rose", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/6397179-lucinda-rose", "userReview": "Bible: Death Has Come Up into Our WindowsBy Stant LitoreThis first book of the Zombie Bible is very promising for lovers of fiction and the horror genre. The story is set in an ancient city besieged by the Babylonian army and the dead, setting it apart from others in the genre.Zombies aren’t a new terror in this world, which is a welcome relief from the norm of post-apoplectic zombie filled tales. It invites the reader to step back in time and follow the journey of a prophet chosen by God to spread her warnings to the people..The plot weaves back and forth from the man fighting for his survival and sanity to the events which lead him there. Litore’s writing is compelling and honestly it keeps you interested even when you want the tragedy to end or to beg him to have some mercy on the characters.This is truly an original work, no clichés or worn out metaphors. Litore gives us vivid and heat wrenching descriptions like this “The memory found him and fastened to him like a great leech in the mud, and he lay against the wall as it drank from him.”.A good novel should go for the throat; this novel goes for your heart, rips it out and eats it before your eyes. It elevates this genre from blood and guts spilled for amusement to something with a greater meaning. Many of know of Mary Shelley’s Frankenstein as a horror novel, but its’ greatness comes not from the fear it produces instead it comes from the thoughts it produces in the readers. Both this book and Frankenstein draw the reader into reflecting on the human condition and its’ gruesome reality.For lovers of fiction, particularly those of you who love zombies, this is a must rea"}, {"userName": "Justin", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "Death Has Come Up Into Our Windows is the first novel in author Stant Litore’s \"Zombie Bible\" series. I came into this series backwards, starting with the more recent Strangers in the Land, but once I read that I knew I had to get the previous installments. The basic premise of the series is that zombies are a part of day to day life in ancient Israel, and one that impacts their Laws and lives in a profound way.Unlike Strangers in the Land, Death Has Come Up Into Our Windows is more “Bible” than “Zombie.” It’s essentially the story of a guy in a well, pondering the events that brought him to that point. The guy is a prophet called by God to expose the wickedness around him. Wickedness like the temple on the hill where priests feed innocents to the shambling undead in a vain effort to placate them.Zombie 411: The zombies in this book are straight-up Romero-style \"shamblers.\" No sprinting, using tools, etc.I have to say this was a bit disappointing after the all-out horror and action of Strangers in the Land. There’s a kind of intensity here, but it’s more along the lines of existential crisis rather than getting your face chewed off crisis. The encounters with the walking dead are haunting enough, but are kept to a minimum, while the main character’s struggle with his faith is front and center.It may not have been what I expected, but it was beautifully written, thought provoking and had some very compelling characters (even though the end was somewhat unsatisfying). I’m glad I already knew the series got more exciting though; otherwise I may not have taken a chance on the next volume."}, {"userName": "James Jr.", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/3043716-james-jr", "userReview": "I write and read a lot of horror fiction, but rarely anything to do with zombies. So, imagine my surprise when I finally picked one up, began to read and found myself intoxicated by just how wonderful it was.I’m speaking of an entry into author Stant Litore's \"The Zombie Bible\" entitled, \"Death Has Come Up Into Our Windows.\" As a Christian, I am familiar with the Old Testament books of the Bible. With his use of original language, setting and capturing the speaking style of characters of this day and age, Litore completely and easily immerses us in the story. So much so that I believed I was either reading an Old Testament book or perhaps had unearthed another long lost scroll.In less masterful hands, this could have very easily come off as campy and cute, and completely solidified my desire to never read zombies again. Instead, although the plot does include “the dead”, it more importantly includes the living. We feel for Jeremiah as he recalls his wrestling with God and what God wants from him. We see the horror that surrounds him and feel the pain that he feels over sending his beloved wife away…and much worse later that comes off as one of the more powerful scenes I may have ever read.Litore took aim at telling this sub-genre in a way that no one was doing and he absolutely nailed it. I’m seriously blown away by everything Litore has done here, and you will be, too. \"Death Has Come Up Into Our Windows\", my friends. There are zombies that attempt to locate and feed upon the living, but what we get here is oh so much more."}, {"userName": "Rick Gualtieri", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/5729097-rick-gualtieri", "userReview": "I applaud Stant Litore for being so bold as to take on such a potentially controversial topic as the bible. That alone merits some stars of admiration. That he makes it work so well is a testament (no pun intended) to both his talent and the obvious amounts of research he put into this chapter of the Zombie Bible.There's a real sense for the plight of the prophet Yirmiyahu as he must contend with both his faith as well as the threats both inside and outside of his city (not the least of which is the walking dead). It's rare to read a story in which the main character seems as alive and real as he does.I have to say I found myself surprised at how much I enjoyed it. Though I enjoy historical 'monster' stories, I usually shy away from books with heavy religious undertones. Though Yirmiyahu's musings on god can get a little dense (for my tastes) at times, there is such immersion in his world and his surroundings that it all works. There's also the fact that zombies are never far from the picture and whenever they appear you are definitely reminded that this is a horror novel. No punches are pulled...which makes sense; this is the Old Testament after all.In summary: \"Death Has Come Up into Our Windows\" is a fairly short read that manages to condense a surprising amount of depth, character, and action into its pages. That it does so in the context of the both the historical and religious undertones of the Bible itself, is quite the feat. A must read for any fan of horror."}, {"userName": "Jason Kirk", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/4641394-jason-kirk", "userReview": "Amazon.com Review: Zombies are a powerfully resilient metaphor, able to absorb both horrifying bodily damage and whatever widespread cultural fears abide in the times of their creator or their setting, especially with regard to their origin stories. George Romero's \"Living Dead\" arose at the peak of the Cold War, animated by the same rampant radioactivity that struck deep fears in the American collective consciousness. In the film adaptation of I Am Legend (2007), \"the infected\" suffered a would-be cancer cure gone awfully awry. The list goes on and on. In Stant Litore's novella, the biblical prophet Yirmiyahu (Jeremiah) warns the people of Jerusalem of the dangers of worshiping false gods while the city suffers the twin trials of zombie infestation from within and Babylonian siege from without. It's a wildly original tale: beautiful, terrifying, and deeply reverent. Racked by his divine calling, Litore's Jeremiah embodies the ambivalent prophet's existential anguish with memorable resonance. As such, \nDeath Has Come Up into Our Windows\n is not only a great zombie yarn, it's also the most imaginative take on Jeremiah's story since Edward Snow's 1987 translation of the Rainer Maria Rilke poem that bears the prophet's name. Highly recommended. --Jason Kirk"}, {"userName": "~thea~", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/29384360-thea", "userReview": "I finished reading “Death Has Come Up into Our Windows” weeks ago, and it has stuck with me. A part of me will always be at the bottom of a well in an ancient city besieged by its enemies on the outside and plagued by the walking dead within its walls. At any given time during the day or night, I may find myself staring up at “the hole in my sky” and remembering: “That silence above him was as terrifying as the darkness in which he stood – this clinging, tangible hoshekh, a darkness that touched both body and spirit.” Imagining myself there and wondering what I would do if they threw down into the well with me another of the ravenous dead.Stant’s writing is beautiful, without being tiresomely literary. By setting the story in ancient Israel, and using some Hebrew words now and then, he evokes that sense of wonder I enjoy in fantasy novels. Immersed in this book, I am visiting another place far from my current day reality, a place of horror and miracles, of discovery and re-discovery of what my heart has been trying to tell me that has been lost in my modern-day rush. I thoroughly enjoyed this story, and highly recommend it. It crawls into you as shuddering horror, it keens with aching beauty, it touches as true. I will carry it in my heart always. (Sounds sappy, but really. I'll never forget this one.)"}], "description": "DEATH HAS COME UP INTO OUR WINDOWS595 BC. God is weeping behind her veil in the Temple while the dead eat her city.Her prophet Yirmiyahu wakes sometimes in the night and hears those cries. He has foreseen the devouring of the city, and his warnings to its citizens are far from popular. As our story opens, Yirmiyahu is imprisoned at the bottom of a dry well; once each day, his gaolers toss the hungry dead into the well after him. Yirmiyahu will have to fight to survive the dead, dehydration, and some truly wrenching memories -- memories of atrocities witnessed, lives lost, and sacrifices made that shatter the heart.ABOUT THE ZOMBIE BIBLEThe new fiction series Zombie Bible isn’t your average gore flick reproduced on paper or e-ink. And this isn’t your parents’ Sunday School, or your college bible study. It’s the old stories coming back, with teeth, with their innards spilling out messily before your eyes. Zombie Bible isn’t going to pull any punches. It isn’t going to water down the truth. It isn’t going to look for a PG-13 rating and it definitely isn’t going to tidy anything up with a happy love story at the end.But over the course of this series, you're going to see human beings living the bravest lives they can in a world that wants to eat them alive. You’ll see men, women, and children facing impossible choices and fighting to live lives that are about far more than just surviving. The series will move you and pierce you to the heart.", "title": "Death Has Come Up Into Our Windows\n      \n          (The Zombie Bible #1)", "url": "http://www.goodreads.com/book/show/12961889-death-has-come-up-into-our-windows", "average": 3.48, "cover": "https://images.gr-assets.com/books/1335201427l/12961889.jpg", "reviews": 75, "authors": [{"url": "https://www.goodreads.com/author/show/5297892.Stant_Litore", "name": "Stant Litore"}], "type": ["Horror", "Horror", "Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/12961889-death-has-come-up-into-our-windows", "http://www.goodreads.com/book/show/16006384-death-has-come-up-into-our-windows", "http://www.goodreads.com/book/show/15954486-death-has-come-up-into-our-windows", "http://www.goodreads.com/book/show/16031555-strangers-in-the-land", "http://www.goodreads.com/book/show/22018832-ansible-15715", "http://www.goodreads.com/book/show/15954436-what-our-eyes-have-witnessed", "http://www.goodreads.com/book/show/25283387-write-characters-your-readers-won-t-forget", "http://www.goodreads.com/book/show/22245280-i-will-hold-my-death-close", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}