{"ratings": 965, "userreviews": [{"userName": "Το Άσχημο Ρύζι Καρολίνα", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/41264370", "userReview": "Αυτός ο συγγραφέας έχει έναν πολύ ιδιαίτερο τρόπο να διηγείται τη ζωή του. Θα ήθελα να μάθαινα περισσότερα για τη μέθοδό του. Δεν είναι απλώς ξερές αναμνήσεις, αναπλάθει λογοτεχνικά - μυθιστορηματικά - όλες τις βιωμένες καταστάσεις, τις αναλύει συχνά και τις ερμηνεύει και μέσα από αυτές αυτοσυστήνεται και αυτοαποκαλύπτεται. Δεν αποκρύπτει τίποτα, αλλά είναι εμφανής η υποκειμενική του ματιά επάνω στα πράγματα. Όλα τα φιλτράρει μέσα από τον ίδιο. Όσα διαβάζουμε και μαθαίνουμε καταλήγουν στο τέλος να είναι δικά του δημιουργήματα - όχι επινοήσεις - αλλά εκδοχές της πραγματικότητας όπως εκείνος τη βίωσε. Έτσι, καταλήγουν να γίνονται όλα τα πρόσωπα, τα πράγματα, οι καταστάσεις και τα γεγονότα κομμάτι του εαυτού του και ζωντανεύουν επειδή ο ίδιος τα διασώζει, ενώ συνάμα εκείνα επιδρούν επάνω του ποικιλοτρόπως, διαμορφώνουν τον χαρακτήρα του και την προσωπικότητά του, προαναγγέλλουν τις μελλοντικές του επιλογές, χτίζουν τα θεμέλια της ζωής του. Ο πρώτος τόμος (1905 -1921) ξεκινάει από την παιδική του ηλικία σε μια Βουλγαρική πόλη, στις όχθες του Δούναβη και καταλήγει ως την Ελβετία, λίγο μετα το τέλος του πρώτου παγκοσμίου πολέμου, όπου ο συγγραφέας έχει φτάσει πλέον στην ηλικία των δεκαέξι ετών. Είναι παράξενο το γεγονός ότι ενώ συνήθως πρώτα διαβάζω κάποιο έργο ενός συγγραφέα κι έπειτα αναζητώ περισσότερα στοιχεία για τη ζωή του, εδώ στην περίπωση του Canetti ισχύει ακριβώς το αντίθετο. Δεν έχω διαβάσει κανένα βιβλίο του. Δεν είμαι καν σε θέση να πω αν άξιζε να πάρει το Νόμπελ λογοτεχνίας στα 1981. Επειδή όμως ετούτη η αυτοβιογραφία είναι στην ουσία της ένα ιδιότυπο μυθιστόρημα - ένα παράξενο και εθιστικό λογοτεχνικό δημιούργημα που διασώζει στοιχεία από τη ζωή αυτού του ενδιαφέροντος και παράξενου ανθρώπου, δηλώνω γοητευμένη. Το έργο με εντυπωσίασε ακριβώς επειδή είμαι ένας άνθρωπος όπου ξεχνώ με μεγάλη ευκολία. Πρέπει πάντα να σημειώνω κάτι για να μπορέσω στη συνέχεια να το συγκρατήσω και αγαπώ πάνω από όλα τις μηχανικές, επαναλαμβανόμενες εργασίες ακριβώς για τον ίδιο λόγο. Από το παρελθόν μου έχω εικόνες και αισθήσεις και αποσπάσματα, σπαράγματα μνήμης που αποφεύγω να τα αποκαταστήσω σε μία ενιαία αφήγηση, το κάνω σπάνια, με τεράστια δυσκολία. Αυτή μου η αναπηρία με κάνει να θαυμάζω - να παθιάζομαι - με εκείνους τους δημιουργούς που εκμεταλλεύονται στο έπακρο τους μηχανισμούς της μνήμης, όπως ο Marcel Proust ή εν προκειμένω ο Elias Canetti. Η διαφορά ανάμεσα στους δύο συγγραφείς είναι πως ενώ ο πρώτος αναπαριστά με απόλυτη πιστότητα μια περασμένη εποχή προκειμένου να την διασώσει από την λήθη (και έτσι να σώσει και τον εαυτό του από την ανυπαρξία) και χτίζει έναν κόσμο από την αρχή συνθέτοντας τις ψηφίδες της πραγματικότητας σε μια ενιαία αφήγηση, ο Canetti μοιάζει να ακολουθεί την ακριβώς αντίθετη πορεία. Παίρνει δηλαδή κάτι συμπαγές και ενιαίο και το σπάει σε πολλά μικρότερα κομμάτια, χωρίς ωστόσο να χάνει η αφήγησή του τίποτα από τη γραμμικότητά της, και μέσα από αυτήν την ανάλυση προκύπτουν αναρίθμητοι κρυμμένοι κόσμοι. Κι ο κάθε κόσμος, είναι ένα τμήμα, μια διαφορετική απόχρωση της ευρύτερης εικόνας που αποτελεί το πορτραίτο του ίδιου του καλλιτέχνη και όσων τον περιβάλλουν. Από πλούσια οικογένεια Σεφαρδιτών εμπόρων, ο συγγραφέας βιώνει σε μικρή ηλικία τον θάνατο του πατέρα του και υποχρεώνεται να μεγαλώσει κοντά στην πιο ιδιόρρυθμη γυναικεία φιγούρα που έχω δει να αποτυπώνεται ποτέ σε λογοτεχνικό έργο. Την μητέρα του. Ο ίδιος προσπαθεί να εξηγήσει πολλά πράγματα με ερμηνείες που ορισμένως μοιάζουν βγαλμένες από εγχειρίδιο αναλυτικής ψυχολογίας. Οι ρόλοι ανάμεσα στη Μητέρα και στο Παιδί εναλλάσσονται τόσο συχνά αναμεσα σε αυτές τις δύο, συχνά υστερικές, προσωπικότητες που τελικά μέσα στην τόση ασυνέπεια καταλήγει να δημιουργείται ένα σαφές και διακριτό μοτίβο. Προφανώς, κάποια στιγμή, μητέρα και γιος ξεκίνησαν να διαφωνούν για ένα θέμα, και η διαφωνία τους αυτή, συνεχίστηκε ως το τέλος της ζωής τους. Επειδή όμως παράλληλα υπάρχει μια αρρωστημένη αγάπη ανάμεσα σε αυτούς τους δύο, μια έλξη σχεδόν ερωτική, καταλήγουν να ταυτίζονται συνάμα, σε βαθμό που δεν επιτρέπουν σε τίποτα και σε κανέναν να μπει ανάμεσά τους. Ο ίδιος ο συγγραφέας είναι ένα παιδί με τεράστιες ευαισθησίες, μεγάλη περιέργεια για τον κόσμο γύρω του, παρατηρητικός και φιλομαθής σε σημείο μανίας. Είναι αυτονόητα βιβλιοφάγος και αναπτύσσει μια ώριμη σκέψη, γεμάτη δημιουργική φαντασία. Είναι πεισματάρης, εγωιστής αλλά δεν είναι κακομαθημένος, είναι τίμιος και φιλότιμος. Οι γονείς του είχαν δύο μεγάλα πάθη που προφανώς του μετέδωσαν. Την Τέχνη (και δη το θέατρο) και τη Βιέννη. Για τη Βιέννη βέβαια διατηρώ τις επιφυλάξεις μου καθώς στο τέλος του πρώτου τόμου δείχνει ως έφηβος να είναι ερωτευμένος με τη Ζυρίχη και μάλιστα αναφέρει πως που εκεί έζησε \"τα μοναδικά απόλυτα ευτυχισμένα χρόνια\". Υποσημείωση: Εκείνη ακριβώς την εποχή, έζησε μακριά από την ιδιόρρυθμη, αλλοπρόσαλλη και δεσποτική (όπως την παρουσιάζει τουλάχιστον) μητέρα του, μόνος και ελεύθερος, σε έναν κοιτώνα κοριτσιών, σε ένα Γυμνάσιο αρρένων, δίπλα σε μια γοητευτική λίμνη, σε έναν ονειρεμένο κήπο, όπου μπορούσε να διαβάζει, να γράφει και να ονειρεύεται. Αυτή ακριβώς η ευφορία (κατά τα λεγόμενά του) πυροδοτεί το μένος της μητέρας του, που αποφασίζει να τον πάρει από εκεί, για να ζήσουν στην χαοτική μεταπολεμική Γερμανία και εκεί ακριβώς τελειώνει ο πρώτος τόμος της αυτοβιογραφίας του."}, {"userName": "arcobaleno", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/9951082-arcobaleno", "userReview": "Giovanni Segantini\u2028, Mezzogiorno sulle Alpi (1891)* Uno dei più bei romanzi che abbia letto. Mi ha fatto riscoprire il piacere della lettura che da qualche mese languiva: davo la colpa al caldo, alle distrazioni estive di vario genere, alla stanchezza mia... invece no: la causa stava proprio nella qualità della lettura. Perché \"La lingua salvata\" mi ha inaspettatamente assorbito in modo assoluto e io ne ho gustato ogni pagina.Pacato e obiettivo, lucido e umile nelle interpretazioni, semplice nell'esposizione, Canetti accompagna il lettore lungo il sentiero della propria memoria, ripercorrendo l'infanzia, fino all'adolescenza. E il lettore attento può osservare con chiarezza i germi di una rara sensibilità e di una eccezionale ricchezza di sentimenti; di una curiosità vivace e intelligente; oltre che di profondi valori morali e culturali. (Sentivo ogni nuova esperienza come qualcosa di fisico, come una sensazione di dilatazione corporea. [...]Era una porta che si apriva all'improvviso là dove neppure la si poteva immaginare, e di colpo ci si trovava in un paesaggio con luce propria...).Ne risulta una rievocazione dolce e sofferta, melanconica e dura, ma sempre appassionata e appassionante; la madre, i familiari, gli amici, gli insegnanti,... appaiono figure vive e vibranti; ne escono pagine spesso intensamente poetiche e suggestive, alcune davvero indimenticabili. Una coinvolgente autobiografia, dunque, ma non solo: è infatti qualcosa di più completo e vasto, di respiro carico e profondo, che affonda le sue radici fin nella Memoria storica dell'Umanità.Non \"conoscevo\" Elias Canetti (Premio Nobel per la Letteratura, nel 1981); ora ringrazio Carla, amica di buone letture, che me lo ha fatto incontrare.*Risalimmo la Lötschental seguendo la mulattiera, unica via di comunicazione della valle con il mondo esterno. [... ] d'un tratto la valle mi si aprì davanti, inondata di sole, sfolgorante di luce: s'innalzava lassù verso le candide montagne e sfociava in un ghiacciaio... Qui ogni cosa era diversa, immagine di un mondo arcaico. Tutte le donne portavano in testa cappelli di paglia, ma non solo le donne, anche le ragazzine."}, {"userName": "Io?", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/7224081-io", "userReview": "Ci son romanzi o poesie che senti tuoi, altri invece no, per cui non provi nemmeno compassione. La lingua salvata appartiene alla prima categoria, il suo battito segue lo stesso ritmo del mio cuore, all'unisono pulsano di vita. Nonostante tutto. E che battito! Il battito potente della cultura viva, una fame famelica di Sapere, capace di travolgere qualsiasi barriera spaziale e temporale. Capace di dare un senso alla vita. Alla nostra vita."}, {"userName": "S©aP", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/9777043-s-ap", "userReview": "Ha toccato molte corde segrete, questo libro. Ha scavato con minuzia e pazienza da archeologo, in me lettore. Ha riportato alla luce tenerezze sepolte. Risvegliato meraviglie. Ne ho adorato il ritmo e la consistenza; la ricchezza lessicale e l'asciuttezza degli aggettivi; la sapienza disarmata, «... priva di altezzosità». Mi hanno stupito la limpidezza del ragionamento e la felicità della scrittura, fluida, mai compiaciuta. Il tempo narrativo è teso, misurato, non si abbandona al vagheggiamento, lega fatti a ragionamenti come in un romanzo. Raro, in un memoriale. La profondità d'introspezione mi ha sorpreso per esattezza e freschezza. È rammentata e descritta nel suo essere sorgiva, acerba nell'intuizione poi consolidata; e ha rianimato, nel ricordo, le mie sorprese di ragazzo, la perspicacia acquisita, le indignazioni profonde e tutti i sapori dimenticati dei miei passi incerti. Ho qui ritrovato i fondamenti di un'educazione concepita, non improvvisata, ma anche i difetti di un certo terrore pedagogico, che oggi mi sono apparsi ingenui, più che dannosi. L'emotività di un tempo (che appare lontano) era ancora impressionabile, non anestetizzata da una realtà onnipresente e cruda. Mi sono infine riconosciuto nella descrizione, a mio avviso perfetta, della vita intellettuale e della sensibilità, qui rappresentate. Enorme diletto. E gran conforto."}, {"userName": "Melania &#x1f352;", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/23622394-melania-x1f352", "userReview": "3,8/5Mi-a fost tare greu sa “ intru “ in cartea asta. După prima jumătate am vrut de mai multe ori sa renunț la ea. Traducerea am găsit-o ca fiind ciudata , copilărească , iar vocea scriitorului nu-mi inspira nimic . Era o povara sa încep sa citesc. Dar încetul cu încetul povestirea a început sa fie mai fluida. Cu cât micul Canetti creștea, cu atât îmi era mai drag sa citesc despre el , despre setea lui fantastica de cunoaștere , despre figura titanica a mamei, despre prietenii si profesorii lui , toti un personaj mai interesant ca celălat. E păcat ca nu e valabilă o traducere mai recenta a celui de-al doilea volum , ultima ediție fiind atât de veche încât nu știu dacă o sa o găsesc pe undeva .As reveni cu mare interes in viața lui."}, {"userName": "Francesco Fantuzzi", "userReviewDate": "Jun 21, 2012", "userURL": "http://www.goodreads.com/user/show/6155410-francesco-fantuzzi", "userReview": "Non avrei mai immaginato che un anziano scrittore che scrive dei primi anni della propria esistenza mi potesse entusiasmare a tal punto. Un'autobiografia? No: o meglio non semplicemente. In queste pagine si può trovare molto di più, e non sarà troppo disagevole riconoscere nei tanti personaggi e nelle tante abitudini, idiosincrasie, esperienze esistenziali, anche sé stessi. Un libro formidabile, perché il sig. Canetti è riuscito ad insegnare tante cose ad ognuno di noi lettori, al di là di una scrittura e di uno stile vicini alla perfezione. Slurp!"}, {"userName": "Morena", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/14624131-morena", "userReview": "\"L'impulso di rivolgermi alle stelle, così irraggiungibili e intoccabili, cominciò, credo, proprio allora, e crebbe negli anni successivi fino a transformasi in una religione, la religione delle stelle. Non mi aspettavo nulla dalle stelle, all'infuori della regola del perpetuo ritorno nello stesso luogo, in un rapporto immutato e immutabile con altre stelle con le quali formavano costellazioni dai nomi meravigliosi.\""}, {"userName": "Marija", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/8968451-marija", "userReview": "Out of four books that I needed to read for my German class, this one was my favorite. This autobiography tells the story of a Jewish boy and his life up until 1920. He tells us about his relationship with his parents, his time in school and his love for learning. I love how it is told. Only the events that shaped the boys life are emphasised. There is something special about this book that made me like it so much. Maybe it's the love for literature that he showed early on in his life or his life in general. His family moved a lot and lived in Vienna, Zürich, Manchester and I loved that aspect of the book."}, {"userName": "Lorenzo Berardi", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/183865-lorenzo-berardi", "userReview": "The die has been cast upon reading Gregor von Rezzori's 'The Snow of Yesteryear'.Struck by the literary spell of that excellent specimen of Central European memoirs, I decided it was just the right time to go ahead along the same golden vein.Thus, I picked 'The Tongue Set Free' up. This is the first volume of Elias Canetti's monumental autobiography and, probably, the one I'm going to like the most. I will explain you why in a minute. To a superficial reader, Canetti and von Rezzori have much in common. Both authors were born in now remote corners of Central-Eastern Europe at the dawn of the 20th century, came from multiethnic and polyglot families, spent their childhood years moving from one country to another due to the First World War events, drammatically lost a family member, graduated in Vienna, and eventually chose German as their first language in writing.However, for all the things they had in common (including the decision to publish their compelling memoirs in the 1980s), there is much more separating these two superb authors and intellectuals than what could meet the eye. First of all, Canetti was nine years older than von Rezzori and came from a Jewish family. Whereas von Rezzori - despite or because of the antisemitism of his father - was fascinated by Jews and their culture to the point of learing yiddish, Canetti was essentially a cosmopolitan secularist who never accepted the notion of sacrifice attached to the roots of Judaism (Abraham being ordered to kill Isaac) and Christianity (Jesus dying for the sake of humanity) alike. Not that von Rezzori flirted with zealous bigotry at any stage of his life; he actually led a rather worldly life playing in movies together with Brigitte Bardot, Marcello Mastroianni and Jeanne Moreau as well as moving to Tuscany where he became an art collector. And yet, compared with Canetti, von Rezzori was certainly more inclined to religious symbolism and spirituality (he was the author of 'The Death of My Brother Abel' while his last work - published posthumous - is entitled 'Cain') and a more prolific novelist. Canetti's reputation as a successful author and the chief reason why he became a Nobel laureate is largely due to his essays even though it's his only novel, 'Auto-da-Fè', which is considered his masterpiece. Let's face it: none of the eight novels published by von Rezzori never reached the fame of that single one by Canetti. One may say that it's the subject each author studied at Vienna University that influenced his own literary career. The flamboyant, dreamy von Rezzori graduated in art (after giving up medicine and architecture), thus ending up as a creator of works of fiction, while the more pragmatical and politically involved Canetti graduated in chemistry, thus becoming an essayist and an expert of social studies.Now this distinction is true to some extent.The funny thing is that if we take into consideration their memoirs/autobiographies the less analytical and more prolix of the two authors is Canetti, the chemist graduate and essayist. The ability to draw together his childhood and young adult memories in a convincing and precise narration belongs to von Rezzori, the playwright, novelist and art graduate.Mind you, this doesn't mean that the first installment of Canetti's memoirs is not a wonderful accomplishment for most of 'The Tongue Set Free' is indeed a masterpiece. I just think that von Rezzori was better in recapping the early events of his life to their core so that he led me to be more emotionally attached to those pages. Canetti's early life was as fascinating and eventful as von Rezzori's - if not more - and the writing is equally beautiful, but my impression is that the author does take himself too seriously once he hits his teenage years. Let's call it the Nabokov Syndrome, if you like it.This said, 'The Tongue Set Free' is a must have and a must read for all those who relishes the golden vein of literary memoirs in a linguistically rich and multi-layered cultural environment and I loved it. I'm just slightly concerned for what is due to come in the second and third volume of this autobiography where Canetti is likely to focus on his own cultural struggle and Viennese milieu rather than giving voice to the dear ones who lived around him. I hope to be proved wrong, though!"}, {"userName": "Cloudbuster", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/9652328-cloudbuster", "userReview": "La lingua salvata è la prima parte dell'autobiografia di Elias Canetti e copre gli anni che vanno dalla sua nascita ai sedici anni. Il libro è scritto in maniera magistrale ma c'è qualcosa in questa storia che mi disturba. I primi capitoli raccontano della vita spensierata nella nativa Bulgaria e della rottura con questo mondo operata dai genitori che trasferiscono la famiglia in Inghilterra per sfuggire all'ingombrante influenza del nonno. I genitori di Elias hanno entrambi una forte passione per il teatro e la letteratura che trasmettono al figlio. Quando, però, il padre muore per un infarto Elias, figlio primogenito, viene individuato dalla madre come suo confidente e sostegno. Ne nasce una situazione innaturale, in cui un bambino di meno di dieci anni passa le serate a leggere Shakespeare e a discutere di letteratura e di passioni umane. Tra scenate di gelosia e discussioni sulla letteratura ed il teatro si sviluppa un rapporto tra madre e figlio che a tratti diventa quasi morboso. Sintomatico è che in tutta la narrazione non si parla mai di giochi ed i fratellini non sono mai nominati per nome e sono visti quasi come un fastidio di cui bisogna liberarsi piazzandoli in un collegio o con un'istitutrice. La parte finale del libro descrive l'adolescenza a Zurigo, lontano dal controllo pressante della madre che è stata ricoverata in un sanatorio. Ho trovato molto belle le pagine in cui Elias ricorda pregi e difetti dei suoi insegnanti e dei compagni di scuola. Il libro termina bruscamente con l'intervento della madre che, nel timore di perdere l'influenza sul ragazzo, lo strappa da questo mondo ovattato e decide di trasferirlo in Germania. Sicuramente, non la scelta migliore per una famiglia ebrea all'inizio degli anni 20."}, {"userName": "Lysergius", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/5905580-lysergius", "userReview": "The Tongue Set Free is a beautifully written memoir. It opens with an extraordinary image, Canetti's earliest memory. A man makes him stick out his tongue; if he talks he will cut it off. Years later Canetti realises that this was his nursemaid's lover, frightening him into silence about their rendezvous. The idea of speaking as the entry into forbidden grown-up life dominates this book. When he is seven his father dies. He is propelled from childhood into adulthood, from his father to his mother, through language. In an extraordinary, cruel episode his mother forces him to learn perfect adult German in three months, to replace the English of her husband as quickly as possible. His tongue is set free: he has won his mother, from his brothers, against all lovers. It is the most intense Oedipal relationship and Canetti describes it brilliantly. But it's all extraordinary, and all masterfully written. There are wonderful descriptions of Canetti's first oriental, medieval home in pre-World War l Bulgaria: of his later homes in Manchester, in Vienna, in Switzerland. These are unforgettable snapshots."}, {"userName": "M. Sarki", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/5562041-m-sarki", "userReview": "The first of three memoirs covering the life of Elias Canetti. So wonderfully written, much more superb than the writing of Vladimir Nabokov and his Speak, Memory. Typically, childhood memories are not my cup of tea but Canetti kept me engaged and extremely interested in what he had to say."}, {"userName": "Jonathan", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/4024731-jonathan", "userReview": "The Tongue Set Free begins in 1905 with Canetti's earliest memory. My earliest memory is dipped in red. I come out of a door on the arm of a maid, the floor in front of me is red, and to the left a staircase goes down, equally red. Across from us, at the same height, a door opens, and a smiling man steps forth, walking towards me in a friendly way. He steps right up close to me, halts, and says: \"Show me your tongue.\" I stick out my tongue, he reaches into his pocket, pulls out a jackknife, opens it, and brings the blade all the way to my tongue, he comes closer and closer, the blade will touch me any second. In the last moment, he pulls back the knife, saying: \"Not today, tomorrow.\" He snaps the knife shut again and puts it back in his pocket.It turns out that the man is the maid's lover and was trying to prevent the young Elias from blabbing their secret to others. The first part of this book, which covers these years in Ruschuk, is my favourite as Canetti describes his family and the local inhabitants. Little Elias loves the stories that the servants tell him, especially fairy stories involving wolves, werewolves and vampires. This early period consists of his wonderment at visits from gypsies, watching a man chopping wood, the births of younger siblings and the family struggles and feuds that went on, especially between his two grandfathers who hated each other. Canetti's parents loved each other dearly and had married in opposition to their parents' wishes. Canetti was a polyglot but he explains that that was nothing unusual in this city as nearly everyone knew several languages. People often talked about languages; seven or eight different tongues were spoken in our city alone, everyone understood something of each language. Only the little girls, who came from villages, spoke just Bulgarian and were therefore considered stupid. Each person counted up the languages he knew; it was important to master several, knowing them could save one's own life or the lives of other people.Canetti tells of an incident whereby he attempts to murder an older girl, whom he had previously been besotted with, when she refuses to show him her schoolbooks which contain her writing from school—he's five years old and he tries to kill her with an axe. But both his parents find life in Ruschuk stifling; his mother wants to live somewhere more exciting and his father needs to escape the influence of his own father. Both have artistic interests, especially in the theatre, and they find their family's indifference to anything other than business insufferable. And so they head to Manchester, England where Canetti's father takes on a job in a relation's firm. Life in England opens up a whole world of books for Elias as his father brings home book after book in English for little Elias to read. But it is rather solitary for young Elias and he is left alone for too long in the nursery.At home in the nursery, I usually played alone. Actually, I seldom played, I spoke to the wallpaper. The many dark circles in the pattern of the wallpaper seemed like people to me. I made up stories in which they appeared, either I told them the stories or they played with me, I never got tired of the wallpaper people and I could talk to them for hours.But he is caught talking to the wallpaper people and he has to be weaned away from these 'unhealthy tendencies'. As the book progresses Canetti's tendency to become obsessed over certain things arises again and again, but it is also an example of his natural ability to make up characters and to tell stories. After this incident he settles for telling stories to his younger siblings. Tragedy strikes as his father suddenly dies. Elias had loved his father but had been rather indifferent to his mother. From now on as they move from Manchester to Vienna and then to Zurich a bond forms between Elias and his mother but it's a relationship that is different from the loving relationship with his father. He becomes protective of his mother and jealous as well, especially when she attracts suitors such as a Viennese professor who repeatedly takes Elias's mother out to the theatre. Elias is only happy when they finally escape from this danger by moving to Zurich. But in Zurich the Canettis have to get used to what they see as a more puritanical lifestyle, though Elias secretly prefers it to Vienna. Elias also has his first encounter with anti-Semitism at school. During this period the family begins to break apart as Elias's mother moves to Arosa, whilst his brothers live in Lausanne; Elias stays in Zurich and continues his education. Much of the last section of the book is about his studies and his teachers, at times this part gets a little dull but Canetti doesn't dwell on any specific too long before moving on. The book ends in 1921 with Elias having to reluctantly leave Zurich, which he has grown to love when he's summoned by his mother to join her in Germany. In the last chapter Canetti's mother really lays into her son for being content and complacent living in Zurich and warns him that he's rotting away there. She ridicules just about everything he has grown to love, these are very often things, such as an interest in the theatre and books, that she had earlier urged him to pursue. The war has changed her. The only perfectly happy years, the paradise in Zurich, were over.Canetti would return to live in Zurich for the last twenty years of his life.This was read for German Literature Month VI."}, {"userName": "James", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "\"My earliest memory is dipped in red. I come out of a door on the arm of a maid, the floor in front of me is red, and to the left a staircase goes down, equally red. Across from us, at the same height, a door opens, and a smiling man steps forth, walking towards me in a friendly way. He steps right up close to me, halts, and says: \"Show me your tongue.\" I stick out my tongue, he reaches into his pocket, pulls out a jackknife, opens it, and brings the blade all the way to my tongue. He says: \"Now we'll cut off his tongue.\" I don’t dare pull back my tongue, he comes closer and closer, the blade will touch me any second. In the last moment, he pulls back the knife, saying: \"Not today, tomorrow.\" He snaps the knife shut again and puts it back in his pocket….\" (p 3)Elias Canetti, winner of the 1981 Nobel, was born on this day in 1905. Canetti’s reputation as a polyglot and polymath can be traced to his cultured upbringing and cosmopolitan travels — born in Bulgaria, raised in Vienna, Zurich and Frankfurt, most of his working life spent in London. The hero of his most famous novel, Auto-da-Fé, is a reclusive, book-loving scholar, a man easily entrapped and destroyed by his small-minded and self-centered antagonists. Published as Europe slid into WWII, the book is often read as a voice of warning, as is the later Crowds and Power, perhaps Canetti’s most famous book. This is an anthropological-philosophical study which finds a herd-animal pathology behind many cultural events and social groups.In his autobiographical writing, Canetti made no apologies for being an outspoken individualist. “My chief trait,” he writes in Party in the Blitz, memoirs covering his years in England, “much my strongest quality, which has never been compromised, was the insistence on myself.” His memoir spans three volumes of which The Tongue Set Free is the first. In this premiere look at his early life, subtitled \"Remembrance of a European Childhood\" he presents the years from 1905 to 1921 in chapters based on his residences: Ruschuk, Manchester, Vienna, finally Zurich. The opening paragraph, quoted above, suggests that Canetti was destined to take speaking up as his life-theme. But his education was of primary interest to me. It was broad and classical in one sense and reflective of his changing abodes over the years before and after the Great War. By the time he was in his teens in Zurich he was already a writer, having written a play, Junius Brutus, a tragedy in five acts. But he also studied music and it is in this that I feel closest to this great writer and thinker."}, {"userName": "Alfred", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/7218948-alfred", "userReview": "First of all, I have read this book in Finnish. This is the only edition Goodreads presented to me that didn't treat the entire trilogy as a single book.I picked up the first two books in Canetti's autobiographic trilogy in a used book store for a single euro each. Having read the first I consider them great finds. Canetti's writing style is funny and interesting and he doesn't shy away from describing his low points, like when as a child he tried to kill his friend. But what I found more interesting than embarrassing revelations about the writer was the thinking and worldview of a true cosmopolitan: a Jewish man whose ancestors had settled in Bulgaria after their expulsion from Spain and who lived in England, Germany and Switzerland before he was an adult. I also found Canetti's views on violence and social status smart, because I agreed with them. The book is a description of a world long gone, the Old Europe, and the reader comes across familiar figures as Canetti encounters them in the daily life of his childhood. Lenin for example is described as a bald man with a big head. But the book is also a tale about extraordinary growth and a small boy overcoming herculean obstacles, such as acting as suicide watch for his depressed mother. I have only recently started to explore the field of (auto)biography and The Tongue Set Free has shown how inspiring and fascinating it can be."}, {"userName": "Zöe Yu", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/5894431-z-e-yu", "userReview": "I knew Elias Canetti from Susan Sontag. He is as passionate as Sontag was. I thought he might have a name of Italian, but it is spanish. I am so amazed by the multi-lingua environment he lived in. And his mother and father should be the essential step for him leading to the Nobel Prize. Surprised to know Schweiz has such a profound influence on him. But now I know that no personal respect to any king leads Schweiz to a neutral country perfecktly. His mother's opinion on WAR is very much impressing too. As a woman, she hates death, but refusing to discuss it with her son Elias. WAR made these death repeatly meaninglessly. But meanwhile, she chose to ask her son to live in Germany, a country lost its war. Life, reality, these things are what she put in front of her son's eyes, and tell him to learn how to live. I respect her very much."}, {"userName": "Johannes", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/31583106-johannes", "userReview": "Faszinierend in der Schilderung eines einzigartigen Herkommens: Da \"Mitteleuropa\" und noch viel mehr längst untergegangen ist, ist Canetti sicherlich leider der einzige in Bulgarien geborene sepharidische Jude mit türkischem Pass, spanischer Muttersprache, englischer Bildung und deutscher Kultur, von dem ich auf lange Sicht lesen werde. Canettis Großvater gibt an, 17 Sprachen zu sprechen, der an Karl Kraus geschulte Enkel meckert: alle nur fehlerhaft. Er muss es ja wissen. Für den Traditionalisten und Liebhaber außerdem hochinteressant Canettis früheste Lektüren, wer kennt schon noch die unheimliche \"Schwarze Spinne\" oder Liliencron? Wirklich schöne Bücher, genau wie dies hier."}, {"userName": "Elalma", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/9841456-elalma", "userReview": "Definirei questa autobiografia quasi una storia della lingua materna, nel senso letterale del termine. Qual � la lingua \"materna\"? Qella imparata nella prima infanzia? Quella degli affetti? Quella dei genitori? Gad Lerner afferma in Scintille che chi parla tante lingue alla fine non ne conosce bene nessuna, ma a me pare che il fanciullo Canetti, perfettamente rispondente alle dure aspettative materne, abbia fatto del tedesco la \"lingua madre\". Ma quello che conquista � anche l'amore della conoscenza, cos� ricercata, cos� amata come fosse una madre dura e un po' anaffettiva."}, {"userName": "Jacques le fataliste et son maître", "userReviewDate": "Nov 14, 2010", "userURL": "http://www.goodreads.com/user/show/4535892-jacques-le-fataliste-et-son-ma-tre", "userReview": "Questo (e gli altri due volumi dell'autobiografia*) sono una delle più belle rappresentazioni del cosmopolitismo e di uno sradicamento che diventa posizione privilegiata da cui osservare e comprendere la realtà.* Cfr http://www.goodreads.com/book/show/96...e http://www.goodreads.com/book/show/96..."}, {"userName": "Z Bloom", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/5943935-z-bloom", "userReview": "Добре, че не му е заминал езикът!Тази книга е изговорена, не е писана на ръка. Не може да е писана на ръка.И макар че немският му е наложеният интимен език, на който познава себе си и навлиза в орбитата на майка си, българският превод звучи също толкова добре."}, {"userName": "Piet Michael", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/15387849-piet-michael", "userReview": "Der erste Teil der Autobiografie eines multikulturellen Kindes und ein schön lesbarer Roman zugleich."}, {"userName": "Brian Burciaga", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/10426699-brian-burciaga", "userReview": "Elias Canetti's childhood memoirs. Working on my German..."}, {"userName": "Speranza", "userReviewDate": "Dec 09, 2012", "userURL": "http://www.goodreads.com/user/show/13631093-speranza", "userReview": "A vivid, eloquent and well-written account of a nomadic, rather privileged childhood, told by a narrator smug, snobbish and self-righteous to the point of nausea."}, {"userName": "Gerard Flens", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/57577186-gerard-flens", "userReview": "Na Het Martyrium, het beste boek dat ik dit jaar heb gelezen, wilde ik dolgraag meer lezen van deze wonderbaarlijke schrijver. Het meest voor de hand liggend was zijn volgende meesterwerk Massa en Macht, maar ik voelde me nog niet klaar voor deze imponerende studie waar 20 jaar aan gewerkt is en waarmee de Nobelprijs voor de Literatuur grotendeels is verdiend. Ik kwam daardoor uit bij zijn hoog aangeschreven autobiografie, daar Elias Canetti geen andere romans meer heeft geschreven na zijn eerste. Dit is het eerste deel van die autobiografie: De Behouden Tong. De enige autobiografie die ik ooit eerder las is van Carl Lewis, de atletiek legende, die mijn grote held was op de basisschool. Ik was toen 11 jaar, en dat betekent dat ik er nu dus niet helemaal zeker meer van was of dit genre wel iets voor mij zou zijn. Wat bleek: deze autobiografie is bijna magisch. En of dat nou ligt aan de schrijfstijl van Elias Canetti en de wijze waarop hij alleen de meest belangrijke momenten uit zijn leven tot leven brengt, of iets aan autobiografieën in het algemeen, ik kan het nu niet zeggen, maar mijn eigen persoonlijkheid bepalende herinneringen keerde achter elkaar terug in mijn gedachtes. Wat mooi vond ik dat. Het was net zoals bij het Martyrium, waar ik ook na het lezen nog vaak met de materie in mijn hoofd aan het wegdromen was in het verleden.Dit eerste deel van de autobiografie vertelt over de eerste 16 levensjaren van de schrijver. Terwijl voor mij een verhuizing binnen mijn eigen dorp al een apocalyptische ramp geweest zou zijn geweest in mijn jeugd, doet hij zowel Bulgarije, Engeland, Oostenrijk als Zwitserland aan als opgroeiplekken. Omringt door vele culturen en talen ontwikkelt kleine Elias al snel een liefde voor woorden en zinnen. Hij wordt daarbij aangemoedigd door zijn vader die van jongs af aan veel boeken voor hem meeneemt en hem verder stimuleert door elke avond te vragen wat hij gelezen heeft. Na de plotselinge dood van zijn vader neemt zijn moeder deze rol van hem over en onder haar invloed groeit hij uit tot een belezen jongeman die werkelijk overal geïnteresseerd in is. In deze jaren neemt de relatie met zijn moeder een grote rol in zijn leven in, maar ook de invloed die familieleden, schoolkameraden, docenten, schrijvers en verhalen op hem hebben gehad komen uitgebreid aan bod. De meest fascinerende momenten waren voor mij echter de ervaringen met individuen of groepen die hun macht lieten gelden en daardoor als beginnende inspiratie dienden voor zijn eerder genoemde meesterwerken. Het zorgde ervoor dat ik meteen bij hoofdstuk 1 werd gegrepen:\"Mijn vroegste herinnering is in rood gedompeld. Op de arm van een meisje kom ik de deur uit, de vloer voor mij is rood, en links loopt een trap omlaag die even rood is. Tegenover ons, op gelijke hoogte, gaat een deur open en er stapt een glimlachende man naar buiten, die vriendelijk op mij afkomt. Hij komt heel dicht op mij toe, blijft staan en zegt tegen me: ‘Laat me je tong eens zien!’ Ik steek mijn tong uit, hij tast in zijn zak, haalt een zakmes tevoorschijn, opent het en brengt het lemmet heel dicht bij mijn tong. Hij zegt: ‘Nu snijden we hem zijn tong af.’ Ik durf mijn rong niet terug te trekken, hij komt steeds dichterbij, dadelijk zal hij hem met het lemmet aanraken. Op het laagste ogenblik trekt hij het mes terug en zegt: ‘Vandaag nog niet, morgen.’ Hij klapt het mes weer dicht en steekt het in zijn zak.Iedere morgen komen wij uit de deur de rode gang op, de deur gaat open, en de glimlachende man verschijnt. Ik weet wat hij zal zeggen en wacht op zijn bevel om mijn tong te laten zien. Ik weet dat hij hem zal afsnijden en iedere keer ben ik angstiger. De dag begint ermee, en het gebeurt vele malen.Ik houd het voor me en vraag er pas heel veel later mijn moeder naar. In het rood alom herkent zij het pension in Karlsbad, waar zijn met mijn vader en mij de zomer van 1907 had doorgebracht. Voor de tweejarige hebben zij een kindermeisje uit Bulgarije meegenomen, zelf nog geen vijftien jaar oud. In alle vroegte gaat zij doorgaans met het kind op haar arm weg, zij spreekt alleen Bulgaars, maar vindt overal de weg in het drukke Karlsbad en is altijd stipt op tijd met het kind terug. Op een keer wordt zij met een onbekende jongeman op straat gezien, zij weet niets over hem te vertellen, een toevallige ontmoeting. Na enkele weken blijkt dat de jongeman in de kamer precies tegenover ons woont, aan de andere kant van de gang. Het meisje steekt ’s nachts soms snel naar hem over. Mijn ouders voelen zich voor haar verantwoordelijk en sturen haar direct naar Bulgarije terug.Het meisje en de jongeman gingen beiden heel vroeg van huis, op die manier moeten zij elkaar voor het eerst hebben ontmoet, zo moet het zijn begonnen. De bedreiging met het mes heeft de beoogde uitwerking gehad, het kind heeft er tien jaar over gezwegen.\" De tong is behouden gebleven. Op naar ‘De Fakkel in het Oor’ dus, deel 2 van deze autobiografie van een wonderbaarlijk schrijver."}, {"userName": "Adrian Găinaru", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/44007033-adrian-g-inaru", "userReview": "https://ch3815h.wordpress.com/2016/12...Limba salvata, cu subtitlul sau Istoria unei tinereti, este un roman amplu scris de un laureat al premiului Nobel pentru literatura cu o prodigioasa cariera cultural-artistica si stiintifica. Numele sau, Elias Canetti, fiul cel mai mare al parintilor sai, descendentii ramurii sefardite a evreilor europeni din doua familii, Arditti – mama autorului si Canetti – tatal acestuia cu o interesanta istorie ce are-n prim-plan ca numitor comun exodul constant. In buna parte, cu 4-5 secole in urma inainte ca finalul secolului al XIX-lea si-nceputul celui urmator sa consacre uniunea tinerilor proveniti din cele doua familii, familie sudata cu greu avand in vedere mai ales opozitiile venite dinspre bunicul mamei autorului cartii fata de reputatia numelui Canetti, despre care Arditti sustinea ca este un parvenit al ultimelor zile ale imperiului otoman, iar nu un comerciant de traditie, cu experienta si renume asa cum se lauda cu numele sau, sefarzii au trait mereu pregatiti si pe picior de plecare in multe locuri ale Europei. Istoria unei tinereti, subtitlu ce inaugureaza romanul cu speciale valente autobiografice Limba salvata si care are trei parti, prologul din Istoria unei tinereti continuand cu Facla in ureche si alocand epilogului romanesc subtitlului Jocul privirilor prin care autorul evidentiaza o mare calitate a sa de om si artist pe care si-a antrenat-o sustinut inca din frageda pruncie, aceea de fin observator al realitatii pe care intr-o cariera impresionanta dedicata cunoasterii mai intai si apoi fascinantei lumi a literelor a dus-o la desavarsire.Valentele autobiografice despre care amintesc in deschiderea analizei acestui roman tripartit Limba salvata se deosebesc de tehnicile de baza ale demersului artistic ale predecesorului francez al scriitorului Canetti, caci in romanul In cautarea timpului pierdut, Marcel Proust porneste de la reconstituirea copilariei pe baza amintirilor si a asocierii fragmentate a diverselor componente de senzatii in urma revenirii unor episoade petrecute mai la inceputul vietii. Or daca sinestezia recompune prin senzatii nu disparat retraite, ci temeinic reconstituite ca si cand s-ar intampla deunazi pentru autorul care scrie cartea, ce nu e doar o vie si vasta colectie de amintiri intr-un jurnal pastrat cu rigurozitatea unei ambitii ce se agata de trecut pentru a putea face din temerile viitorului ce se prezentifica cu rapiditate, ci o ampla calatorie menita a-nvinge timpul macinat de organic si de boala, reveland importantei instante a cititorului timpul pur, slefuit de exercitiul narativ al lui Marcel Proust la capatul unui impresionant excurs cu accente autobiografice, prin care scrisul purifica pe cel ce a trait, experimentat si impartaseste artistic din felul in care a simtit el aceasta calatorie prin viata.Tema redundanta ce a fascinat si lumea coconului actualei civilizatii occidentale, numesc aici activitatea artistica si-ntrevad la orizont preocuparea scrisului lumii vechii Elade, tema calatoriei in literatura, pe care o amintesc printr-un scurt periplu in discursul meu aici de la Iliada si Odiseea, la Balzac si Stendhal, trecand si prin Proust, Tolstoi si Dostoievski, urmand apoi un James Joyce si Kafka e revelata curiozitatii cititorului in maniera care face din amintirea etapelor si evenimentelor importante din viata scriitorului in roman, nu o simpla succesiune de date similara impersonalului caracter pe care-l poate comporta orice tip de raport, tabele si spatii din cadrul lor umplute cu specificatii in spatele carora principiul economiei de semne/resurse asigura in plan comunicational si printr-o legenda insusita anterior de solicitantul raportului si de semnatarul datelor transmise mai departe. Povestea, caci asta este cuvantul de baza in carte, prezinta evolutia tineretii persoanei Elias Canetti, accentuand inca din primele fraze ale romanului prefigurarea unui destin pe care omul ce creste se pregateste asumat si pasional sa-l imbratiseze cu o chemare nemasluita pentru lumea literelor si a universului pe care folosirea combinarii lor in cuvinte adunate-n propozitii si fraze face ca viata ca substanta fluida a unei existente marcate de o sumedenie de factori obturanti pentru exprimarea liberei vointe in ceea ce priveste propria persoana sa nu se limiteze doar la niste date obscure in care un amplu rol il joaca prejudecata istorica la care mentalitatea depasita de argumente si antrenata de un foc viclean divide omenirea si-o goleste de umanitate. In titlul original al cartii, aparuta pentru prima data in 1977, la editura Karl Hanser din Munchen, Die gerettete Zunge, organicitatea povestirii ca tehnica romanesca a lui Canetti pastreaza nota unui firesc dat biologic, referirea numelui romanului trimitand spre corporalitate superioara si facand din organul vital transmisiei orale a plamadirii mintii umane, limba un actor important pe scena unde autorul isi prezinta artistic voalat propria existenta incarcata de culoare. Treptat maestrul literei, ca semn distinctiv al artistului care opereaza cu notatii in exprimarea propriei gandiri, transforma organul biologic in sistemul de semne cu care opereaza comunicarea umana, astfel ca acest traseu al fiintei ce trece prin copilarie si adolescenta spre o tinerete marcata de pericolul razboiului are asigurata amprenta unei autenticitati artistice literare ce excede primelor tentatii impresioniste venite din partea cititorilor tineri.Povestea merge inainte iar refugiul in studiu, citit amplu si necesitatea pe fondul mutarii frecvente a domiciliului evitand riscurile comportate de caracterul unui trai alert si imbracat in sentiment al rivalitatii intre semeni de a invata limbi straine pentru a putea face din formarea viitoarei cariere una lipsita de griji, dar pornita din start ca urmare a traditiei istorice a neamului nevoit sa se adapteze mereu schimbarilor de mediu si de teritoriu pentru a-si duce mai departe viata alaturi de alti semeni, trimite cheia corecta a lecturii romanesti spre cititor ce vede cata admiratie are fragedul fiu mai mare al tinerei sale familii vaduvite de pierderea prematura si dureroasa a tatalui, pentru limba in care in taina cand ambii erau in viata, parintii lui o foloseau doar pentru ei. Atunci, copilul Elias, stia ca nefiind nici bulgara pe timpul sederii familiei la Rusciuc, nici romana invatata in treacat de scriitor de la doica de la nordul Dunarii (Giurgiu), nici curenta spaniola in care cel mai mult timp neamul sefardit comunica, nici engleza in care pret de scurt timp dupa plecarea familiei din Rusciucul bulgaresc, parintii autorului o doresc limba de baza a formarii copiilor lor, dupa descinderea la Manchester in logica ratiunilor comerciale in care fusese invitat de fratii sotiei sale si el sa se alature pentru asigurarea unei linisti familiei sale, mai sigur de realizat ca-n Balcanii amenintati de instabilitatea inceputului de veac. Asa devine copilul aflat la varsta inceperii scolaritatii, stalpul de baza al familiei, cand catargul singurului parinte ramas in viata oboseste si busola e de preferat sa ghideze unitatea familiei cu ceilalti doi frati mai mici prin necunoscutul vietii prin lumea noua, cu fiecare noua dimineata. Isi castiga in ochii mamei respectul cuvenit prematur odata cu griji si responsabilitati ce-n mod curent ingenuncheaza copilaria, iar seriozitatea comunicarii dintre mama si fiul ei cel mare este apropiata de cea pe care sotii o aveau pana nu demult. A trebuit sa fie asa, pe de o parte pentru baiatul Elias, curios de ce parintii apelau la germana pentru a-si spune lucruri pe care in familia lor era bine doar ei sa le fi stiut si nu si copiii, pe de alta parte pentru tanara mama, vaduva si cu 3 fii de crescut si educat si pe deasupra si marcata psihic de pierderea sotului ei. Rand pe rand, Elias devine in ochii mamei lui fiul ei cel mare, desi abia incepe scoala, unde in paranteza fie spus, va merge stiind de timpuriu deja sa scrie si sa citeasca nu gluma, ci atat in spaniola, cat si-n engleza pe care i-o cultivase tatal lui prin cartile de literatura universala pentru copii pe care i le facuse cadou cat fusese inca in viata.O poveste, de la un capat la celalalt al cartii care te captiveaza si care dincolo de un excurs pe care cititorul il imagineaza voit sau nu in timp ce parcurge textul romanului canettian, analiza omului dotat prin ambitie si exercitiu cu un bogat simt anticipativ al sondarii realitatii pe care in calitatea sa de fin observator o trece prin mai multe filtre redand la capatul analizelor sale obiectivitatea in stare pura, slefuita de un predeterminism subiectiv face sa descoperi o munca de om calit intru cunoastere, pornind de la metoda empirica a achizitiei de cunostinte si evoluand treptat pe masura timpului folosit fructuos spre a sti."}, {"userName": "Lupo", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/76844581-lupo", "userReview": "Straordinaria, in tutti i sensi, storia dell'infanzia di Canetti. E' incredibile come il tedesco, imparato a forza per volontà materna, anche se poi strutturato nella successiva permanenza a Vienna, diventi per Canetti la lingua della scrittura. Il tedesco è la quarta lingua imparata da Canetti, dopo Spaniolo (la lingua degli ebrei sefarditi della Bulgaria), il bulgaro e l'inglese, prima lingua imparata nelle migrazioni infantili. Canetti afferma che, avendo imparato il tedesco su testi letterari ed essendo il tedesco per i suoi genitori la lingua della cultura che li aveva avvicinati, gli è risultato quasi un obbligo l'uso di quella lingua per scrivere.Bellissimo libro, ti tiene legato come nemmeno un giallo."}, {"userName": "Maurizio Manco", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/71961244-maurizio-manco", "userReview": "\"Allora non sapevo ancora che cosa è la vastità, eppure lo intuivo: il poter contenere in sé moltissime cose, anche tra loro contraddittorie, sapere che tutto ciò che sembra inconciliabile sussiste tuttavia in un suo ambito, e questo sentirlo senza perdersi nella paura, e anzi sapendo che bisogna chiamarlo col suo nome e meditarci sopra: ecco la cosa che proprio da mia madre ho imparato, ed è la vera gloria della natura umana.\" (p. 225)"}, {"userName": "Haymone Neto", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/26451808-haymone-neto", "userReview": "Relato autobiográfico do autor da infância na Bulgária à adolescência na Suíça. A personagem mais importante é a mãe, ao mesmo tempo tirana e brilhante. A prosa de Canetti é virtuosa, e as experiências e o momento histórico que ele conta são fascinantes. Apesar disso, as referências e em especial a presença absoluta da figura materna às vezes tornam a leitura enfadonha."}, {"userName": "Habemus_apicellam", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/20567354-habemus-apicellam", "userReview": "Elias, bambino figlio dell'Europa... Canetti racconta i suoi primi sedici anni, segnati dal suo peregrinare per l'Europa (Rustschuk, Bulgaria; Manchester; Losanna; Vienna; Zurigo) e ci racconta anche indirettamente la storia europea dalla Belle Epoque al Grande Massacro. Quasi glaciale nel descrivere il suo trauma infantile (la morte del padre) e nel scavare a fondo dentro il rapporto complesso e di interdipendenza con la madre, Canetti parla con voce chiara, tagliente, senza ambiguità nel descrivere i suoi odi, le sue gelosie, le sue sofferenze di ebreo. Nessuna condiscendenza per la propria giovane età, nessuna attenuante per le nostre più oscure pulsioni, fin dal momento che a 5 anni si scopre potenziale assassino...."}, {"userName": "Liedzeit", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/70907778-liedzeit", "userReview": "In spanischer Kolonie auf Balkan aufgewachsen."}], "description": "Eerste deel van de autobiografie van de in Bulgarije geboren Duitstalige joodse auteur (1905-1994) waarin hij zijn jeugdjaren beschrijft in Bulgarije, Engeland, Oostenrijk en Zwitserland.", "title": "De behouden tong: geschiedenis van een jeugd\n      \n          (The Memoir Trilogy #1)", "url": "https://www.goodreads.com/book/show/16009378-de-behouden-tong", "average": 4.15, "cover": "https://images.gr-assets.com/books/1347780246l/16009378.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/6517.Elias_Canetti", "name": "Elias Canetti"}, {"url": "https://www.goodreads.com/author/show/2842833.Theodor_Duquesnoy", "name": "Theodor Duquesnoy"}], "type": ["Nonfiction", "Biography", "European Literature", "Biography", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/16009378-de-behouden-tong", "http://www.goodreads.com/book/show/21235381-1905-1921", "http://www.goodreads.com/book/show/6855066-la-lingua-salvata", "http://www.goodreads.com/book/show/18308870-la-lingua-salvata", "http://www.goodreads.com/book/show/17825852-limba-salvat", "http://www.goodreads.com/book/show/576154.Die_gerettete_Zunge", "http://www.goodreads.com/book/show/1304066.The_Tongue_Set_Free", "http://www.goodreads.com/book/show/821130.Tongue_Set_Free", "http://www.goodreads.com/book/show/16059296-the-tongue-set-free", "http://www.goodreads.com/book/show/3014280-the-tongue-set-free", "http://www.goodreads.com/book/show/10281181-la-lingua-salvata", "http://www.goodreads.com/book/show/18934048-a-l-ngua-absolvida", "http://www.goodreads.com/book/show/15850462-la-lingua-salvata-storia-di-una-giovinezza", "http://www.goodreads.com/book/show/205189.Auto_da_F_", "http://www.goodreads.com/book/show/79917.Crowds_and_Power", "http://www.goodreads.com/book/show/205194.The_Voices_of_Marrakesh", "http://www.goodreads.com/book/show/205190.The_Memoirs_of_Elias_Canetti", "http://www.goodreads.com/book/show/950757.The_Torch_in_My_Ear"]}