{"ratings": 6365, "userreviews": [{"userName": "Jamie (The Title Page)", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/10080839-jamie-the-title-page", "userReview": "Check out my other book reviews at my blog; The Title Page*WARNING* I use what might be considered offensive language in this review, buyer beware.Glamour starts with Rae, a super awesome fast runner, absolutely gorgeous, better at everything than everyone, chick who is studying to kill demons. She breaks out of the protective walls through a hole that mysteriously appeared right in front of her (umm ok.) and takes a run in the woods, where demons and evil stuff lives.Sounds like a plan.After running into some clerics (demon hunters) who were killing a fairy (ugly green skin, fire-truck red hair, doesn't sound attractive) she books it away from them. Dogs appear (?) and chase her and she is magically a gajillion miles ahead of them, or at least far enough ahead to have an entire meet and greet conversation (and make out session) with sexy demon Breandan (whom she just met). Chaos ensues.I enjoyed the first chapter of this book because the writing was so natural. I felt like I was actually in Rae's head. That didn't last.I must point out, the entire novel takes place in one day. ONE DAY. And it's not like a little amount happens. We've already had mountain after mountain attack Rae. This girl would not be in one piece (literally, she would have fallen apart by now. Body parts everywhere.)When I set out on a book planning to review it, I usually take notes to assist my review later. I didn't have to do that with this book. It annoyed me so badly that I remember everything I thought was wrong with it.This book has too much in it. I find myself sighing with frustration because it's just one thing after another. Give her a break! Give me a break. I'm so sick of all of this stuff happening all at once, it's exhausting.And absolutely nothing has been pointed out as to why Rae is so goddamn special. It's confusing, and frustrating, and quite frankly, the writing sucks.The character development is non-existent and contradictory. When Rae first meets Ed- sorry, Tomas (her vampire bang buddy)she describes him with a bowl haircut. A BOWL. She even says he wasn't remotely attractive.The next chapter, she comments on how she's run into 3 SUPER-OMG-I-WOULD-SO-DO-HIM-EVEN-THOUGH-NO-ONE-HAS-EVER-EVEN-TOUCHED-ME-BEFORE guys, Breandan, Devlin, and... Tomas? WTF. A bowl. Remember that.The only character I even remotely liked was Rae's best friend, Alex. And my reasoning for that? She was described to look something like this.Yes, Rae's best friend is Avril. True story.You know those character descriptions that most books have, you know, to help you picture and relate to the characters? Fletcher apparently doesn't need those.Those moments when you're reading a book, and you just want to do this to it?Maybe I have anger issues. But that probably wouldn't be a good idea for me anyways because I'm reading this book mainly on my tablet. Don't want to smash that...Moving on.....Rae eventually meats Breandan (who, it turns out, is sort of a prince)'s brother, Lochlann. Lochlann is the only person in this entire book who doesn't like Rae. THANK YOU SO MUCH, MS. FLETCHER. THANK YOU.But... but how dare he not like Rae? She's perfect! (Although we don't know why) Everyone loves her! Everyone wants to have steamy make-out sessions with her next to dead bodies. EVERYONE.You know what we call girls who make-out with three guys in one day (albeit, one 3 hour time slot) in current day Massachusetts? A whore. I said it, Rae Wilder is a giant, flaming, whore. Pardon my Klingon.(If there are any prostitutes out there who are offended by my review than I apologize)Then there was the romance. Rae \"bonded\" to Breandan, which was some sort of undying love pact that they can't control. But she was also in love with Tomas. Let me remind you, she met both of these boys today. And now she can't possibly live without either of them.Honestly, I think if the end of this series ended with Rae waking up in an insane asylum, it would make SO MUCH MORE SENSE. I mean, what sane person lets a demon stay in her room when she's been conditioned her whole life to fear them.I really liked it in the beginning but now I detest it. I just want this book to be out of my life, but obviously not badly enough to put it on my 'abandoned' shelf. As if the facts that all of the novels in this series were published mere months apart wasn't hint enough not to bother.I have never rated a book so low unless it was FSOG or Twilight, where I was personally offended by the events that occurred in the books. This is upsetting to me.JUST LET THE POOR GIRL SLEEP."}, {"userName": "Kate", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/4780173-kate", "userReview": "I'm 2/3 of the way through this book and am currently debating whether or not I should continue reading it. I enjoyed the initial premise of Rae finding out that she is a demon and exploring her powers and learning about herself. However, not enough time is taken to get to know any of the characters, and the plot moves along so quickly that the story is choppy. My main frustration with this book is the tawdry love triangle that is occurring. It reminds me way too much of Twilight (which I could not stand in the least), and beyond that, it seems that no time was taken in the storytelling to develop actual relationships (there's a bunch of random make-out scenes and feelings of intense desire and infatuation). If the pace slowed down a tad bit and more time were taken to really flesh out the characters and their relationships with each other to make them seem more life-like and realistic, I think this would be an excellent read. As for now, I'll call it okay."}, {"userName": "Penelope Fletcher", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/4372300-penelope-fletcher", "userReview": "I may be slightly biased in this rating ;)"}, {"userName": "Traci", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/2345224-traci", "userReview": "I am really disappointed in this one. It sounds so good, and it was free, and I was excited to read it. Unfortunately I only got to 40% before it came down to either giving it up as abandoned or clawing my eyes out because I tried to read another word and… well, I like having eyes. The mortal enemy of this novel, and this storyline (which still has potential) was apparently time. It was rushed. It was all rushed. The 40% I read all took place within a few hours. A few hours. And it was painfully obvious that the only editor this novel ever saw was a quick run-through with spell check. The editing alone was painful. The rushed storyline made it worse. The slang made it unbearable.This novel is about a girl named Rae, who lives in a post-war society where very few humans still live on the planet. There was a war at some point in the distant past between \"demons\" (which are all vampires, were-creatures, goblins, fairies, and witches—and I’m not sure how witches aren't human, but it's the not my classification) and humans. The humans all live in a big city protected by Clerics, which is what Rae is in training to become. There's something around the wall called a klaxon, which may or may not be an alarm of some sort—it was never explained before I stopped reading. And right before I stopped, there was the slam-in-the-face sort of foreshadowing that \"hinted\" that maybe this version of history is all wrong, anyway. Our plucky heroine, Rae, is an orphan. The only tie she has to her past is a mysterious amulet that has never left her neck. She wears it to remind herself that she has no one. She is super fast, can heal super quickly, and has a compulsive punching problem—evidently when people touch her, she hates it so much that she just wants to lay them out. And I don't mean she's getting groped between the two classes she actually visited. I mean she wants to punch people when they accidentally brush against her in the hallways. She can also make a hole in the wall so she can get out without disturbing the klaxon, so she can go Outside.And this is where our story starts. Rae is dressing, and it's not even one percent into the book and I've highlighted the first proofreading error that I just can't get past: \"Stood in my fraying bra and panties, I groggily scratched at my knee, trying to pull myself together.\" Every time I have to stop myself and say \"what?\" it means that I'm pulled out of the story. She is going for her morning run and happens to find two of her teachers murdering a fairy. The first thought that occurs to her is how horrible this is. And I'm not going to argue with that, it is horrible. But she's spent her whole life believing that these beings are subhuman and that there's nothing wrong with hunting them. She is in training to hunt them.  This upsets her so badly that she punches one teacher and runs from another, and she somehow breaks into a run which is super fast even for her.  \"Taken by shock, I planted my feet and slammed to still.\" As she stops, she sees a boy watching her. This boy is, to no one's surprise, a fairy. His name is Breanden. She is instantly attracted to him.Instantly.\"Without thinking, I reached to touch his jaw and it felt like strength.\" What does strength feel like? If I reach out to pet the glistening, rock hard six pack abs of a weight lifter, am I feeling strength? Or is it just feeling up a stranger?Also, Breanden is apparently a toddler. One of the first things he says to her? \"Since I saw you first you have to be mine.\" Anyway, after his little territorial display of dominance, he tells Rae that she too is a demon/fairy and that she has been hidden in the human city by a glamour that is now going to fade because breaking into a run means she's discovered her true nature. Despite all this, and despite the fact that she's punched her teacher and the other teacher saw her do this, and she's fully convinced they're going to kill her (which is, I guess, what happens to people who disobey) Breanden takes her back to the city. On her way to her first class of the day, she gets waylaid by a vampire named Tomas, and hides him in her closet to talk to him after the day is over.We're treated to a bit of unnecessary description about school uniforms, and a bit of that slang I was mentioning earlier. The clothing object in question is a green blazer, and \"the girls rocked them shorn at the elbow or tied around the waist to show off their tattoos.\" I went from \"compulsive punching problem\" to \"teenage mutant ninja turtle\" at this point.Oh, and Rae is apparently a Mary Sue: \"I was pretty much good at everything I tried and took eight classes instead of the six most Disciples preferred; Martial Arts, Explosives, Subterfuge, Entomology, Demon Theory, Equestrianism and Alchemy.\" I am… not entirely sure what the point in listing her class schedule was, considering that I was almost halfway through the book and she only went to Demon Theory long enough to argue with the teacher (the one who chased her in the forest that morning, and incidentally blow her cover in that whole fiasco) and skip Alchemy to sit in the library.She also takes the time to worry about Breanden (who, in case you've forgotten, she only met about an hour ago): \"The thought of him being discovered was making me feel slightly sick. I even threw up in my mouth a little.\"I threw up in my mouth a little too, Rae.Her friends are annoying: \"Ro saw all the questions on my face and winked at me. 'We talk all about it later and I say hai proper,' he said.\"So, really, I got no resolution. It's roughly halfway through a book, she's met some fairies, apparently fallen in love with the king of the toddler fairies, there's a vampire in her closet, and she's discovered she's a demon and tried (unsuccessfully) to stick it to the man, and she hasn't even had lunch yet. I don't know what the demons did, whether there are humans outside the wall or why I should give a damn. I will leave you with one parting shot: \"Our dietary staples were caffeine, sugar and bread.\"Holy shit."}, {"userName": "Kandise", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/4606975-kandise", "userReview": "Page 126 of 187. Done. I can't go any further...no, no I refuse to go any further. My blood pressure is up, I have a migrane, my eye is twitching, my throat is burning with bile...I just can't, I'm going to need some serious medical attention if I continue this read. Rae you Floozy! You are the epitome of everything I despise in a female protagonist! You are stupid, so very stupid and I honestly believe you have a mental condition that prevents you from keeping your hormones in check whenever you catch scent of a male! Male anything! It could be a troll and you would try to get to third base!Keep your legs closed Ho! Oh and let me not forget the one responsible for it all...Thank you Penelope Fletcher for writing the first book that caused such a adverse reaction to my being that I had no other choice but walk away...before-I-even-got-to-the-end! Self-preservation at it's glooooriouuus best."}, {"userName": "Dusti", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/5436179-dusti", "userReview": "Upon finishing this book, I was overcome with a sense of sadness. I've felt that way before, like when I finished the last Harry Potter book, or when I finished The Hunger Games trilogy. Those books were so good, I was very sad to see them end. However, the sadness I felt when I finished Demon Girl had nothing to do with my love of the book. I'm upset because this book COULD HAVE BEEN great. Ya know how sometimes, particularly when you're talking excitedly, your words get ahead of your brain? I feel that the author must have felt this way the entire time she was writing. Maybe she had a great story planned out in her head, but just got ahead of herself while writing. It was so rushed that I was scratching my head trying to figure out what had just happened. In a matter of 2 days, Rae:Gets chased by ClericsSees them kill a fairyMeets and supernaturally bonds with a fairyFinds out she's a fairyMeets a vampireEnters a love triangle between said vampire and her bonded-for-life fairy-boyGets involved in a political fight between fairy-kindFinds out she's a princess (of sorts)Makes out with vampireAlmost diesGets captured by the \"bad\" fairiesWatches her best friend be killedGets rescuedTries to perform voodoo on dead BFFSaves vampire from certain deathAll of that in two days, with little to no character development to boot. And don't get me started on the grammar and spelling issues. The book was actually difficult to read. There were entire words missing (like \"to\", or \"have\") which rendered sentences unreadable. Add that to misspelled words, missing commas, and unnecessary commas and you've got yourself a hot mess! Here's my tip for Penelope: SLOW DOWN and fire your editor!"}, {"userName": "Jeremy Stephens", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/3086983-jeremy-stephens", "userReview": "Let me start of by saying that this is one of the worst books I've ever read. I can describe everything I felt about Demon Girl in one word- terrible. I understand that the target audience for this book is teenage girls so there probably is some bias against the story on my part since I am a twenty eight year old guy. Therefore, to be fair with this review, I am going to put on my hypothetical English-teacher-hat and base my review on other more provable flaws with this book as much as I will my opinion of the plot to better explain why I believe this is such a horrible book.  1. Writing style- clearly nobody edited this nonsense because the whole time I was reading it I kept tripping over misspelled words, words that were repeated and (in a couple cases)sentence fragments. I don't consider myself to be the grammar and spelling police when it comes to novels (a few mistakes here and there are forgivable), however the overabundance of errors made this difficult to read in some places. I shouldn't have to reread a sentence a couple times to figure out what the author meant. The sentence fragments were unbearable but at least there were only a couple. The whole time I read this, I wanted to grab a red pen and start correcting everything and then write an \"F\" on the cover with a note to see me after class.2. Plot- I noticed a problem with this book that a lot of high school students I have worked with in the past have had- the story moves so fast it leaves out too much detail and character development. The main character is outside and then a handful of pages later here comes a big life altering fact she must change her life around (i.e, not being human in this case) and then a few pages beyond that more overly rushed action. This could have been much better if the author had slowed down, developed ideas further and went more into detail with characters.3. Diction that didn't quite fit- Maybe it's just me but the way the characters spoke didn't seem right. One second they are talking normal and the next you would think they were at a bar or something. Just because one has artistic licence to use curse words doesn't mean they should be thrown awkwardly into conversations just because they can.4. Lack of originality- If there was a way to breed Terry Brooks' Shanara series with the Twilight Saga, then this would probably be the result. Like the Shanara books, the story takes place in a post-cataclysmic future in which magic and fantasy creatures have returned. Like the Twilight Saga, the main character is a boy crazy teenager who is caught in a love triangle with super-natural guys. Overall, I found the story to be a miserable attempt to milk the popularity of the fantasy genre. Well, there you have it. In my own defense, I did give it one star for effort. Perhaps if her writing style becomes more refined and her ideas more original, Penelope Fletcher will present the world with something worth reading. For now we're stuck with this garbage and I find myself longing to get the hours of my life I wasted on this book back."}, {"userName": "Morrigan", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/4834450-morrigan", "userReview": "This book is set in a post-apocalyptic world where humanity has been clustered inside walled cities to guard against demons (vampires, witches, fairies, etc). Rae is a girl training to become a Cleric until one day she discovers she is a fairy. So, starts this book. The entire storyline takes place in 2 days but, oh boy! does a lot happen in 2 days. Rae is thrust into a war between 2 fairy factions, 2 love interests (the fairy named Breandan and the vampire named Tomas) and so on... I found the idea of the story interesting. This book does have some potential IF some very big issues are addressed. Grammar: If there was ever a book in need of an edit, this is the one. The grammatical errors, missing words, wrong words (at one point the author writes `right' when it should have been `wrong'), etc. made reading the book so distracting and frustrating that I could barely concentrate on the plot. I don't think I went 2 pages without encountering a mistake. Character development: Characters are largely undeveloped and have no depth, even the main ones. For example, we get very little in terms of interaction between Rae and her best friend Alex, so the events of the end did not have any effect on me whatsoever. We didn't get to care about Alex at all. We learned little about her, and only through Rae's narration. Basically, that is the problem, we learned everything from the author telling us than from the character development. Character interaction: I will make allowances for Rae's sudden trusting happy lovey dovey relationship with Breandan but, not with Tomas. We get no frame of reference, rhyme or reason as to why Rae is interacting with the vampire Tomas the way she is. From their first encounter to the second, there is a world of difference. I mean, talk about jumping the gun! Basically, this is a story with potential if the author decides to review it and expand on the book, fix the errors and get a good editor. Also, am I missing a chapter between 9 and 10? :/ That was a BIG jump in events."}, {"userName": "Melanie", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/2084161-melanie", "userReview": "I want to give this book a glowing review, I really do. But I just can't. This is the biggest rush job of a piece of literature that I've ever read. First, grammar and spelling were atrocious. It's obvious that the only editor who's gone over this thing is automatic spell check. Example, repeatedly I saw things like trial where it should have been trail. There were some sentances that completely lost their direction midway through and some that were so convoluted I'd read them three times, then give up trying to understand what was meant and move on. There were many facepalm worthy cliches and metaphors. BUT... the story was a fantastic and original idea, even if it did tread into Twilight territory with that unnecessary love triangle. The characters were solid frames on which more depth could have been built (but sadly wasn't). The plot was fast paced and exciting (though it's not believable that it all takes place in 2 days at times). I just wish the author would have slowed down before pushing this thing to be published. It feels like a diamond in the rough, if she would have polished it, I could be writing that glowing review. I hope she goes over her next volume in the series with greater care and takes her time with publishing."}, {"userName": "Kerry", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/5794386-kerry", "userReview": "WARNING: Editor Needed. Apply c/o Demon Girl.I had asked some friends of mine on Twitter what indie books I should give a try since I've been on the search for the best ones. I should not have listened to my niece. She is 14. She liked this book.You know what? I liked this book too. I had seen the bad reviews on here which didn't deter me [they never do]. It made me want to see just what was the problem with Demon Girl.Grammar. Edting. I used to work as a copywriter for a magazine in Toronto. Not saying the name because you will laugh. I'm not a spelling master or an East Shoots and Leaves guru. I don't listen to Grammar Girl podcasts. I am too lazy to correct my own mistakes. Unless I am paid to do so. The point is, I know grammar because I had to. So even though I am flawed with my own, I can never not see it in others. How is that for a double negative?Demon Girl had a cool, slightly rehased premise but I liked Rae. And I liked Fletcher's writing here. She can tell a story. I read till the end. Pages kept turning. I liked Rae too though I can't put my finger on why.But my FLUCK the grammar was terrible. Not in a \"you do not know how to write\" way but in a \"get an editor\" way. I had the same problem with Amanda Hockin's books but those improved as she did get better editors. This is bad for the reader because if you are anything like I am it will take you out of the story. But this is not the worst problem for a writer to have. All Ms. Fletcher needs to do is go back and edit. Clean up those typos. Fill in the missing words. Take out and then put in a few commas. Do that, I'll come back and give you four stars!You're a good writer Penelope and your work deserves to be presented better, for you and all other self-published writers out there."}, {"userName": "Ronda  Tutt", "userReviewDate": "Oct 30, 2010", "userURL": "http://www.goodreads.com/user/show/2216375-ronda-tutt", "userReview": "Brutally Horrifying! Gory Filled Dark Paranormal!First let me state that this is a Young Adult Read and that this is usually not my type of read so the rating in my opinion may be off for some of the younger groups. My rating is 2 ½ Stars but am rounding up to a 3 Star.Definitely a book full of the dark side of paranormal! The author has created a world filled with Demon Fairies, Vampires, Voodoo Witch Magic and Humans strive to co-exist. If you like the brutal savagery sacrifice of innocent humans, gory details where blood and guts drip from head decapitations, then this is the book for you. It took me a little bit to get into the book and I thought the last two chapters of the book was the best part.The romance was mild but sweet between Rae and Breandan her bonded Fairy-boy but Rae seems to be fond of Tomas whom she calls her Vampire-boy.Rae, a demon fairy is charged with guarding a magical amulet, an amulet with elemental source power. Devlin, the High Lord of the Fairy Kind has become pure evil with evil intentions towards his own people. Between Lochlann , Breandan (Fairy-boy), Tomas (Vampire-boy), and Rae’s brother Conall, the adventure to overtake Devlin the High Lord is within reach between the fast action in this book but the author has left us hanging in the end.There will be a follow up to this book – “A Demon Day” – Coming Summer 2011"}, {"userName": "The Pirate Ghost (Formerly known as the Curmudgeon)", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/5555043-the-pirate-ghost-formerly-known-as-the-curmudgeon", "userReview": "Okay, this book doesn’t need much of my over analysis, nor does it need me inferring all the super-secret squirrel influences that I often see in the stories. I’ll cut to the chase. 3 stars (More realistically around 3.5. It got better as it went on so I expect the next one, or may be the third one due to the sophomore slump, will be even better.) Plot vs. Post-apocalyptic Earth. The Penelope Fletcher’s vision of post-apocalyptic Earth where humans lived in walled fortresses and struggled to keep safe from numerous demons “outside the fence” turned out to be almost like a supporting character itself. At one point we even get a glimpse of what the ruined city had once been, London. In this world, Demons had the upper hand outside the highly protected enclaves where humans hide. Demons include the usual suspects and more, this time they include the Fea, Fairies. The primary players are Vampires and Fea though there are hints of other demons lurking in the forests and abandoned cities. None of this is particularly unique, though the way Penelope Fletcher describes it may be. Her Fae seem more like Japanese Anime’ fairies with long pointed ears, long tails and dragonfly wings with beautiful human bodies, including fangs than the more traditional elves and fae from works like Tolkien and Shadow Run. As for the plot?This is a “coming of age” story, or maybe more accurately described as a “rites of passage” story, about a Girl, living in one of the walled fortresses. She was an orphan, left on the steps for a cleric who raised her then sent to “the academy” to learn the skills needed to be a “cleric” and fight demons. This particular Fae, Rae Wilder, lives life as an outsider looking in, with few friends. She likes to push the boundaries which lead her to running outside of the fence and finding trouble. It turns out the Clerics that are so revered aren’t exactly the nicest people. Illusions shattered, she has to flee the very clerics that are training her in fear for her life when she’s helped by a Fae and learns that she herself is “Fae.” Of course the relationship doesn’t end there. The Faery is some how Bound to Wilder and vice versa. On the way home, she meets a vampire and yes, romance develops. Now I’ve heard the criticism about how this or that work is so much like “Twilight” but I’d like to point out that that love triangle of epic and biblical purportions is nothing new, even when it showed up in the Twilight series. Ever read stories of the Greek gods? Abraham, Sarah and Hagar? Sampson and Delilah? Helen of troy married to a Greek king only to have her heart (and body) stolen away by Paris? Lancelot, Arthur and Guinevere? Han Solo, Luke Skywalker and Leya? It’s a common story theme because it’s a human theme. Even if it’s accurate, it’s not fair criticism because one could level the same critique at Twilight or a host of other popoular stories and even some considered classics if they wanted. In fletcher’s hands, these common themes are told with uncommonly smooth writing. Her fiercely tribal Fae are interesting and colourful and there is so much more room for exploring the Human enclaves and the world that she created. Smoothly written prose may not be a vaccine for overdone themes and vampires, but I found this pleasantly different. Perhaps it is because I’m new to PNRs. You just can’t beat a well told story. This was a wonderful coming of age tale with complicated relationships. Rae Wilder turns out to be a strong female character and independent thinker. Fletcher had a wonderful description of what fairy or vampire speed was like without hokey side effects. Weaknesses: I wasn’t excited about how physical combat was described and resolved, and the description of magical combat seemed incomplete. This would be in keeping with a PNR where the focus is on relationships but parts of this seemed more like a UF (well, a post-apocalyptic-fantasy). Also, the only character we really got to know was Rae Wilder. Though we learned a lot about Brandon and Thomas, it seemed just the tip of the iceberg in both cases. I’d have also liked to see more of Alex and Rae’s other friends at the Academy or Conel, and the other fairies. Still, I’ll give fletcher a break because this was a world seen through Rae Wilder’s eyes and, likely more of a PNR than UF when it comes right down to it. Regrets:There were so many opportunities in this book for Fletcher to make a statement about inclusion, racial tension, and tolerance that simply went unnoticed. Perhaps that’s not what a PNR focuses on, but the opportunities were there. The bottom line-this is a smooth, enjoyable read that is slightly edgy and appropriate for young adults. It includes a good old fashioned love triangle and some too familiar demons but the skill of the story teller outweighs those things. Given all the problems and regrets with this story, one might think I didn’t like it, but, at some point I said “Screw all of that,” and let the story suck me in and placed my faith in the storyteller. Letting go of old anger and resentments brought relief and I enjoyed this. There is plenty of violence here, but nothing unpalettable for most young adults and older. The story will probably appeal more to female readers than male readers with the soft combat scenes and the focus on romantic interventions. There are some common themes here that some consider \"overdone.\" THough some things in this story may surprise you, there is plenty that will not, even when it's supposed to. 3 stars. Good read, enjoyable, UF/PNR."}, {"userName": "Natalie Mulford", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/4289446-natalie-mulford", "userReview": "I really enjoyed this book! I was a little dubious when I started reading it, but once I got into the swing of it, I didn't put it down. The story is rather fast paced, but I liked that, some stories tend to drag things out, so it was refreshing to see everything happen so quick. Rae didn't have much time to process things because her world turned upside down overnight.I admit, I liked the triangle. I do love a good angsty love triangle. Given everything that has happened, I don't blame Rae for being confused! It's a relatively easy read, but it's in now way 'light'. It gets rather dark in places."}, {"userName": "Sarah Marie", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/6515737-sarah-marie", "userReview": "Glamour by Penelope FletcherDNF @ 18%I'm incredibly disappointed by this one. I went into this expecting to have a lot of fun. I knew this wasn't going to be a ground breaking novel, but I at least expected it to be decent. This was painful. In the 18% that I read, I felt as if I lost several brain cells and my common sense had been tossed out the window. The writing is atrocious and cringe inducing. Descriptions like \"lightening dark\" are used to describe the sky. I'm aware that Penelope Fletcher is an indie author, but I have read many books by an array of indie authors and while there are mistakes here and there, they are not this cringe inducing. The problem with using a phrase like \"lightening dark\" is that it sounds like the author is trying too hard to set the tone. Rule of thumb in writing: Say it loud. If it doesn't sound right, then it isn't. So change it. If you aren't sure, there are editing software programs that can read it to you, so you hear it from another source and can make the decision. I know that may sound like a lot of work, but I don't have endless free time and when I choose to pick up a book, I hope that is well-written enough to be accommodating. You don't have to be the next J.K. Rowling or F. Scott Fitzgerald.Whimsical Writing Scale: 0.5My main problem lies with the characters of Rae and Breandan. They are immediately forced into some weird, awkward overwhelming connection and they have only interacted for less than an hour. Here is a compilation of the most cringe inducing moments:\"My name is Breandan, and you are mine.\" @ 6%6%!! This is so soon and this takes instalove to a whole new level. Also gross. How dare this jerk assume she wants to be claimed like land. I'm sorry, but we aren't in the 1800s anymore and saying things like this in literature is not romantic. It's eyebrow raising. \"I glided the pads of my fingers into the shallow groove which flowed uninterrupted to his shoulder blades. My hands left his back then I hesitated in my exploration. The sensation that slicked over my palms was, odd. Hovering a few inches away from his skin felt warmer, thicker.\" @9%Slow your roll, Rae. This isn't a Harlequin novel. You don't have to start instigating boy-chicka-wow-wow right now. Stay focused on the task at hand and the fact that you just found out you are a demon. That's pretty important, especially since you are training to kill them. \"Do you want to talk about it? That helps females I am told.\" @12%The misogyny continues. Oh, Romeo, tell me more about what females want. #notallmen\"I don't think I even like you. How can I feel like this? Like I've known you my whole life. When you touch me, I feel complete. When you speak, I accept everything because you said it.\"This occurs at 13%!!!!! She has just met this guy and she is already saying that she needs his commands to think out life and her current situation. I can't. Don't even get me started on the random love triangle that is introduced before the 20% mark.Character Scale: NOPECover Thoughts: The cover is gorgeous. So stunning."}, {"userName": "CS Stewart", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/5941736-cs-stewart", "userReview": "[Then she wouldn't die, we would have a fantastic heroine, and she WOULDN'T DIE!!! (hide spoiler)]"}, {"userName": "Stuti (Turmeric isn't your friend. It will fly your ship", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/6372822-stuti-turmeric-isn-t-your-friend-it-will-fly-your-ship", "userReview": "MUch-shuck, how old was I when I tried to read this one? Maybe 12? That was a loooong while ago and even my pre-teen, therefore by default, extremely lame, brain found this one tres horrible. I remeber liking all these quotes at the beginning of the chapters, and sometimes the imagery was pretty(that's what I remember; it'll probably be sparkly now), but the overall story was too crappy, and it was also one of the first love-triangles I'd read, and I detested it.The MC and her special-snowflake-treated-as-a-pariah-shit bugged me all kinds of wrong ways. The vampy guy was at least better than the fairy guy- ugh, he was so goddamn you're mine, we're destined, and I just wanted to bash him in the all the inappropriate places.This was probably the first book I hated. Whoa, guys this is the important stuff they leave out in history classes. The recent history, the history being made. What do you think, a couple years from now, when you're giving tests or taking part in trivia or those quiz shows or even trying to cozy up to someone, knowing about Atila or Forest Policies or New Earswick or Ebenezer Howard is gonna help you? Or will it be me and my reviews and my posts that's gonna help you reach you endgoal? Stay tuned in to my frequency, folks, and you will have a shot at a better lifestyle. Trufax. (Hint: The history two years from now will be my days of today. I will monopolize history, just you wait)"}, {"userName": "Chelsea", "userReviewDate": "Dec 27, 2010", "userURL": "http://www.goodreads.com/user/show/4635707-chelsea", "userReview": "First of all, this is the first book I have read on my new Nook. :) That being said, there were a lot of errors, the Nook Editors really need to step up their game. It made the book hard to enjoy when I am spotting typos left and right. Secondly, I gave this book 3 stars and maybe it only deserves 2, but I did enjoy it. The characters were vastly underdeveloped, and the relationships between them were unreliable and unrealistic (at best). I know those of you out there are thinking \"It's a FANTASY book, it's supposed to be unrealistic..\" and I get that. The plot line, the demons, and the \"other world\" feel to it is all good in my opinion. However, the relationships and how the characters acted in the classic love triangle left something to be desired. (understatement) The book was riddled with cliche metaphors and similes. Some of the elements of the story were hard to grasp and poorly explained. Crucial elements could have been simplified, but rather were woven into complex details that just annoyed me. Even the main character was just plain stupid at times. Dense. Frustrating. Overall, 3 stars, whatever. It was alright."}, {"userName": "Amanda", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/3306782-amanda", "userReview": "It was a fairly quick read and I enjoyed every bit of it. Although, there were some editing issues. I have read alot of fairy books and this one definitely stands alone. It wasn't like anything else I have read. I enjoyed the characters and Rae the main character is hilarious. She is a strong, spunky, very independent girl who is not about to let any guy tell her what to do of feel. Something every girl will envy. Not only that she seems to have every hot guy in the palm of her hand! Loved the Book and Can't wait for the next one. Definitely one of the better books I have read this year."}, {"userName": "Belinda", "userReviewDate": "Mar 15, 2012", "userURL": "http://www.goodreads.com/user/show/4076802-belinda", "userReview": "Demon Girl, an independently published ebook by Penelope Fletcher, is the first in the Rae Wilder series and, if you’re feeling brave, it’s currently available from ManyBooks.net as a free download. Originally released in 2010 the ebook is currently being re-edited (praise be to the gods of writing). The new edition, with a shinny new cover and re-titled Glamour, is due for release at the end of March 2012. This review is in response to the 2010 version. What it's aboutOn a post-apocalyptic earth humans live in heavily fortified compounds, protected from the demons that roam outside their walls by the militaristic Sect. Rae is different, faster, stronger, quicker to heal, but she doesn’t realise how different until, on one of her forbidden runs outside the Wall, she meets a boy. Breandan is just as strange, if not stranger, than she is and he tells her things, things about herself, that could see her exiled, imprisoned or dead.What I liked and didn’t likeI liked the cover and it was on the strength of the design that I downloaded the ebook. The cover is simply designed with nice typography and an elegant colour scheme. It doesn't show the woman's face, which I think is a smart move as it leaves room for the reader to imagine what she (presumably the protagonist, Rae) looks like. The premise, a dystopian/post-apocalyptic world where humans hide from ‘demons’, known to the rest of us as fairies, goblins, vampires and shape-shifters, was an interesting idea and I wanted to know more about it. I just didn't want to have to put up with:* Rae, whose emotions seemed to fly all over the place.* The terrible editing, which made the book read like a first draft; and* Fletcher's habit of telling instead of showing.Despite this habit there were some really great descriptions. The ones that struck me occurred in the first third of the book when Rae **spoiler** uncovers her true form, that of a fairy, which has been hidden under the illusion of a human body.\nMy wings twitched. How the wind feels through your hair, such it felt as a gust[ed] over and under my wings.\n\nI spun and tried to catch the thick length of skin protruding from the base of my spine... It was warm, soft and I stared dumbfounded at the hard, leaf like tip.\n**end spoiler**They were so effective that I felt the sensations along with Rae. Fletcher seemed to vacillate between these wonderful descriptions and info dumps that just made me want to smack someone (usually Rae) over the head.I objected to how she called Tomas and Breanden boys when she describes them like men. She robs the characters of authority and sex appeal and makes Rae sounds silly in the process. It’s alright for an 18-year-old girl to be attracted to, and even fall in love with, a man. It may be a little creepy if he’s older than her father but it’s ok. Two things I would like to point out are:1) If you’re going to write urban fantasy, or any genre for that matter, have your lingo, and your bestiary, straight because using the wrong terms just makes you look like an idiot.\u2028\u2028For example fairies and shape-shifters are not demons, neither are goblins, witches or vampires, although you could probably make a case for the later. I can understand why Fletcher wanted to lump all supernatural creatures under one banner but there are more accurate words than 'demon', words like sups, preternaturals, monsters and abnormals (thank you ).2) In the same vein: when you’re outdoors the ground is called ‘the ground’ not ‘the floor’, unless you are referring to it as ‘the forest floor’, which Fletcher doesn’t.I feel like the structure is messed up. What is the beginning of the book, Rae’s run in the wilderness outside the Wall, feels like it should be the middle, after her life within the human compound is established. It’s also too short, with a lot of big, important things happening one after the other with no time for the reader to take things in and no chance to become emotionally invested.My overall opinionDear Ms Fletcher, can I edit your next book? Or maybe not. I don't think I could keep myself from murdering Rae, who starts out a little silly and quickly degenerates into a moron. Seriously, she’s 18 (or is it 19?), brought up in a dangerous world to be a demon killing badass, you’d think she’d be able to stand up for herself a little more rather than be tossed about on the whims of the various males in the story.Kudos though to Fletcher for publishing her own book and getting it out there to be read by a lot of people.As a writer I take from this book how it was published and marketed, because it’s been read by a spit-load of people who though enough of it to give it a review. I’m interested in seeing how her next book is received. Will her next book be a paid one? If so how much will it be sold for and will people buy it?I’m also taking the idea of how a simple but effectively designed cover can lure readers. People do judge books by their covers and a well-designed, elegant cover can hide a lot of sins.Since learning that the book has been re-edited, and because I’m a sucker for punishment, I’ve decided to take a peak at the re-edited version to see what sort of improvements have been made. I'll post an update once I've read it."}, {"userName": "Rhiannon Frater", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/1805401-rhiannon-frater", "userReview": "First off, this is a 3 star review, because I LIKED the book. I know some people don't like 3 star reviews, thinking it's a negative thing, but I did LIKE the book. WHAT I WAS NEUTRAL ABOUTThe lead character of Rae is very flighty, impulsive, and passionate. Her history, life situation, and the revelations of her heritage all made perfect sense for a complex character. The thing is...Rae isn't that complex. Basically when offered option A-The Right Choice or Option B-The Wrong Choice, you know Rae will automatically default to Option B. There is no surprise. She lives in a state of wonderful denial. For example: She discovers she has magical abilities, but decides to just ignore this because it means she's not human. Also, she comes across as rather stupid. She can't even remember her own school schedule.I flip-flopped back and forth between liking the character and not liking the character and finally came out of the book with a shrug.She is what she is.WHAT I LIKEDThe World Building- I really loved the world author created. I would say it's the books strong point. She has clearly put a lot of thought into the post-apocalyptic world Rae lives in. It's a very messy, dangerous world with no real clear indicator of who is the \"good\" guy and who is the \"bad\" guy. The humans' reaction to the monsters coming out of the closet and basically slaughtering them to almost extinction makes perfect sense. You kill them and try to save yourself. The monsters viewpoint on humanity is also interesting. There is a lot of moral ambiguity in this story, which I liked a lot.The Descriptions - The author can definitely create beautiful sentences that are rich with detail and paint a vivid picture in your mind. I marveled at the sheer lushness of her writing at times. It was very engrossing.The supporting cast- I liked a lot of the minor characters in this story much more than Rae. I found them to be extremely intriguing and well-developed. I especially enjoyed two of the male characters Tomas and Conall. Also, the witch, Ana, was a really cool character when she was about.The overall plot- The plot is nothing we haven't seen before: a chosen one, a war between two factions, complicated love triangle, etc. But somehow the author made it feel fresh again. And that takes talent.WHAT I DIDN'T LIKEThe Love Interest - Breandan basically comes across as a jerk. He sets Rae up so she's robbed of any choice in her future. It's definitely insta-love of the magical variety. Rae is rebellious by nature and to see her pinned down by the magical love match really sucked. Despite how beautiful Breandan is or how supposedly noble he is, I can't like someone who robs another person of their free will intentionally.Also, this forces us into a love triangle. Since Rae always opts to do the dangerous, stupid, impulsive thing, we all know she would have picked the vampire in a heartbeat. But to get her into a love triangle with the \"good guy\" fairy, she gets robbed of her free will in the matter. Kinda sucked.The Descriptions - Yes, what I really liked about this book, I also came to hate at one point. Sometimes the descriptions worked really well, but there was a section in the book I had to literally force my way through. There is one conversation that takes forever because every little thought, every little movement, every little expression is described in flowing detail. I would get to the next line in the conversation and realize I forgot what the previous line had been. I slogged through this section and almost gave up.The use of the word Demon- Vampires, fairies, and all other magical creatures are pegged as demons by the humans. That I could buy. These other races come out of nowhere and kill most of humanity and you're going to call them demons.But what I didn't get is why Rae, the fairies, and all the other magical creatures call themselves demons, too. It seems like such a derogatory word. Also, most of the magical races don't fit the traditional description of demons, so I couldn't figure out why the magical creatures would call themselves by it. I kept waiting for someone to say to Rae, \"Stop using that word! It's an insult!\" Never happened. Made no sense.IN THE ENDI came away liking the book enough to buy the sequel. The author can definitely write. She is very talented. But she may need a much stricter editor that will challenge her on content and not just be fixing typos, grammar, and punctuation. The author is definitely wildly imaginative and that alone made me like this book."}, {"userName": "Jessanie82", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/4651283-jessanie82", "userReview": "A great concept - a tough, if slightly undecided, heroine, a dizzying world of fae creatures, a war against not only humans but rebel fairy forces all point to what should be a stellar read, but for me this book fell short of expectations. I personally felt it could have been fleshed out a bit more, relationships explored more, one example being Rae and her Cleric friends, and perhaps told over more than one night. It just felt rushed and the connections the characters were meant to have/developing with one another seemed forced on the reader, instead of letting them develop naturally. I was a bit taken aback with the frenetic pace of the action and had to wonder how Rae didn't keel over from sheer exhaustion from it all! Everyone loves a rockin' rollin' action packed read, I know I do, but I also love time taken out to establish a back story and relationships.Everyone has noted the editing and grammatical errors, so I won't spend too long on that issue, just note that it left me quite disjointed at times and I had to actually stop and think 'now what word is that meant to be?' before continuing. The only really big problem I had was the weird skip from chapter 9 to 10. I thought that somehow I had missed a chapter and went back to see if I had, but no. It was like a sentence had been cut out. One minute she's standing in a field talking to Devlin about her mother, the next she's tied up and just coming to? Wha...? How? When? I didn't understand how she got there.I'd also like to find out how we ended up with this world, with humans barricaded behind enchanted fences and giant walls and fae creatures roaming the surrounding forrests. I noted that in once scene she runs into an old city, complete with burnt out cars, so is this a possibile future of our current world? Do humans develop mutations in their genes which lead to these 'demons' being brought forth into the world? When did it all happen, how did the world react, when did the big war happen? These are all questions that popped into my head after reading the scene with the burnt out cars.All in all I did enjoy this book, although it did take me quite a long time to read, and I look forward to seeing if Rae can live up to all the expectations everyone seems to have of her in the next installment!"}, {"userName": "Lindsay", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/7098774-lindsay", "userReview": "Ebook was free Price I would willingly pay: £0.25The Bad:1. I'm going to say it, and i truly mean it, Enough with the goddamn Twilight Love Triangle destiny rubbish, good god it has been done to death, and it is so unrealistic, and i am saying that about a fantasy book. It is terible, \"oh he is my destiny, nothing could ever come between us\" \"Oh wait i have such a connection with this other guy\" please enough!2. Things happened so quickly, Their fighting, then the enemies are fighting together, It is all a bit confusing.3. The characters were to one dimensional, Even Rae seemed very shallow and not overly developed. I think she took being a fairy far to quickly and quietly. She just believed it and moved on, only making mention of it a few times. Why could we not see Alex and Ro and Conall developed just a little bit more.4. Taking a Vampire to her room was, again, so unbelievable, she has been taught her whole life to hate demons and within an hour she loves one and is hiding another? I know with fantasy we have to suspend reality for a while but not common sense!I can't say to much more without giving spoilers away which i refuse to do in my reviews.The Good:1. The spelling and Grammer were ok2. Good Use of the Fae creatures3. I am honestly struggling to find good points. Which is odd as i usually find something i like about every book i read.The fact is, i didn't enjoy this book, doesn't mean no one else will, it just didn't do it for me."}, {"userName": "Elena", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/4654276-elena", "userReview": "I read this because it was a free Nookbook, and now I can see why. The story itself had an interesting premise, but it devolved very quickly into what read like bad fan-fic, in the same style as the Twilight books. The worst thing, though, was that it was clear the writer either had no editor or a really awful one. The sheer number of typos and errors made trying to get into the story incredibly difficult. I kept having to pause to figure out her intent because of all the misplaced commas, or to decide which word she meant (there was a lot of the word \"of\" instead of the word \"off\" and other such mistakes). In short, I felt like I was having to grade a high school student's paper on creative writing. I'll give her credit for having some interesting ideas on the basis of the story, such as the incident in world history dubbed \"the Rupture\" in which most of humanity had been wiped out and the survivors now lived inside small cities surrounded by walls from which they never ventured outside. The ideas of the Clerics and the Demons were also pretty interesting. I was just disappointed that it turned into a really awful \"love\" story, where the main character is, of course, great and powerful and torn between two great and powerful men. The character of Rae read like the greatest Mary-Sue next to Meyer's Bella. Ugh."}, {"userName": "Kristin", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/18711982-kristin", "userReview": "DNF at 10%. I can literally count the # of books I have done this with on one hand. This book is THAT bad. The grammar is atrocious, misspellings, fragmented sentences, you name it. It is in need of some serious editing. The world building is practically non-existent up until this point and not much of anything makes sense other than they must be in some sort of post-apocalytpic world where demons have taken over and humans are protected by other highly trained humans called Clerics in some sort of compound that they are not allowed to leave. The MC is training to be a Cleric but there is no explanation of what exactly this entails. The storyline suffers greatly in that the author does not provide complete, well though out descriptions of what is going on. She jumps from one aspect to the next without clear transitions. The writing honestly reminds me of my eighth grade writing skills where I would move along too quickly, assuming that the reader knew what I was talking about without slowing down to fully develop my thought processes. I don't know, maybe it gets better, some of the reviews are positive, but the lack of writing skill is just too much for me to wade through any further."}, {"userName": "Brandy", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/5943400-brandy", "userReview": "I've had this book on my radar for a while and I finally decided to read it this weekend. There are a couple things I don't like about the book.1. Spelling and grammatical errors. Also errors with the format of the book. Some paragraphs were spaced out and just looked really weird and confusing. When there should have been a \"where\" there was a were. Totally different words with completely different meanings.2. Rae, the main character is more wishy washy than Bella from Twilight. Of course there is the infamous love triangle (HATED) and our heroine is stuck an doesn't know what to do. She loves one guy one minute and then hates him the next. Grow up, sister.3. Parts of this book did not make sense. It jumped from subject to subject leaving the reader confused and backpedaling trying to figure out what was missed.Now that I've stated my complaints, let me point out that the book was free, so there is a plus. Also, the premise for the story was actually really great. It was just executed very poorly. I fully intend on reading the second installment of this book in the high hopes that possibly a better editor came along and that the author will slow down a little now that the characters are established and explain a little more in depth!"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "$0.99 on Amazon: 22 JAN 2016This is a book I read when I first got my Kindle and was one-clicking freebies and cheap books (we all go through that initial giddy phase - or do we ever really leave it?). At the time, I quite liked this. No, it's not perfect, and I might not even like it anymore if I were to do a re-read. I guess my standards were lower then, but I think this is around the time I discovered Twilight (yes, I was a late bloomer), My Blood Approves, and the Sookie Stackhouse books and was just craving anything paranormal romance. I read two or three of these in the series and, what can I say? I liked them. From what I can recall, it's YA and about the fae. A girl finding out she is more than she thought she was. Yeah, sounds familiar, right? I'm sure she was a Mary Sue and a special snowflake, but I didn't even know what that meant at the time, and so, it worked for me. :)"}, {"userName": "Johanna Sawyer", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/17416257-johanna-sawyer", "userReview": "Quite frankly I felt like this book lacked definition. I think you really have to nail down your characters before you plunge into a story but I was too confused to understand what the author was trying to tell us. The characters DID NOT SPARK for me. When it seems they have no choice but to be together it feels forced. She used the word confused a lot...like 29 times. That's just what I was...CONFUSED!"}, {"userName": "Louise", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/16053029-louise", "userReview": "[There is no real acclimatizing to the story or characters with such a farcically small time frame of literally 24 hours!?:* Are introduced to the female protagonist and the establishment she is within.* She witness' a murder* nearly gets killed (several times)* Discover the establishment is actually somewhat corrupt* She see's her first fairy* The 'bond' occurs.Tells us many times how much she can't bare to be touched, goes out of her way to not be touched yet lets THREE people maul and paw all over her and nearly gets jiggy with it* she gets all hot over Breanden (by far the better character yet annoyingly we don't actually find out much about him as rather then establish him as the true male protagonist she almost equals that status with several other males!)* Finds out another person in the establishment is a fairy in disguise* Kind of gets all slutty with him but then stops.* Meets a fugly vampire* Feeds the vampire, twice.* Nearly runs away with the vampire.* Meets the white witch* learns there's possibly history between the witch and 'her fairy boy'* learns possibly futures* Learns about glamours and casting* becauses semi proficent at the aforementioned* see's her true self* learns about the amulet and manages to get all three missing pieces* Falls in love with the vampire (yes really, after five minutes of talking to him)* Watches a cleric get killed* Nearly watches B get killed and nearly dies herself because of it* Meets the Rebel leader who'd previously disappeared* Finds out who her mum was and what she did* discovers her legacy* Finds out she has a brother* rescues a fairy* watches her best friend get sacrificed * tries to work voodoo* watched the other male protagonists nearly die a few more times* Gets battered herself a few times* finds out that everyone is a brother/uncle/son/whatever of someone else who may or may not be important and we may or may not, probably not, need to ever know.* Demands answers yet not about herself, then gets pissy when she doesn't get answers about herself.* Commits herself to being a mate yet tries to go off with the vampire fuckbuddy, who was ugly and dying and then suddenly isn't. He has ZERO charisma, rarely says or does anything other then trying to get her to follow him, appears unpowerful and spectacularly mundane and halfway through becomes attractive.* Most of the characters seem to become different characters with inconsistent writing and many of them possess no real voice of their own, more like cardboard cut outs with names.* is awkward and bullied yet also popular and has many friends?etc etc etcIt really is absurd, a few of the threads in more detail and with more story would have completely changed the book for the better. All this in about two days, seriously?  (hide spoiler)]"}, {"userName": "Jessica M.", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/2783129-jessica-m", "userReview": "Let's cut to the chase, folks. Penelope Fletcher's Demon Girl was way too past-paced, with little to no character development; a rather illogical love triangle, and very difficult to read. This is all in great part due to the bad pacing, the horrible grammar, the spelling mistakes, the missing words, the lack of transitions between some scenes, etc. I often considered dropping it, especially when I had I give up on trying to understand what was going on, on what the author meant.One thing that somewhat infuriates me, however, is how the author won't admit that she needs better editing. I once wrote to her on Wattpad with my thoughts, encouraging her to get a new and better editor, to consider writing more carefully, and so on. She simply said that that was her \"style\" of writing, and that if someone failed to understand and accept it as so, then they shouldn't read her book; or something along those lines. Either she's in denial, or she thinks way too highly of herself to see the truth. And this will only hinder her true potential.Nonetheless, as I already implied, this book had great potential; and for this, I chose to read it until the end. The premise is indeed interesting, but the execution was so poor, that I was left with many doubts, many questions. I could make a whole analysis of every situation presented in the book, and tell you why I think that at some points it makes little sense, but I choose not to bother with it. I also have to admit that I purchased the next volume in the series, hoping that the editing would improve; but I have yet to confirm whether this came true or not.Note: if you're into Twilight and all that \"stuff,\" you will probably enjoy this much more than I did; seeing as (pardon my honesty) the Twilight series is, in general terms, so horrible: poorly written (although better edited than Demon Girl, that's for sure!), and has one of the most absurd, most illogical (there goes that word again!) \"love\" stories ever written – and let's not mention the bonus! It ruined the concept of vampires entirely. Now, whenever I claim to love vampires since I was little, I am immediately associated with Twilight; and that is, in my opinion, just unbearable, embarrassing, and unacceptable. Thankfully, I am pretty sure that I am not alone in this. And I have to give credit to Penelope Fletcher for trying to keep her vampires closer to the original concept.I wish that the author had made the relationships and attractions between Rae and her two lovers more credible, as right now it all seems so... superficial and forced. I know she can do better than that. I do like how Rae is a quite strong and proud girl, although she sometimes seems confused and doubtful. Sometimes I don't know what to make of her. She is definitely a better heroine than many I have come across, however. Yet, her two guys... I definitely dislike Breandan; the vampire boy, on the other hand... I am not yet convinced, but at least I like him better. All in all, I really wish that Rae Wilder's world was explored in more detail, and many more things explained. Perhaps this will happen in future installments: I hope so."}, {"userName": "TarynXO", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7177270-tarynxo", "userReview": "I don't even know how to start this review. Sadly I felt like I should have taken notes so that everything I felt I needed to say wouldn't be missed or forgotten. What needs to be forgotten? Over 60% of this book. The thing about this book that really upsets me? It could have been a great book. Rae, main character of this book learns that she is not a human. Great, so we should all be prepared for information and truth and character building into the demon that she is right? Wrong. I kept reading thinking, \"what the hell just happened?\" It felt like one thing happened and before we could even process it and accept it, bam! something else happened in the blink of an eye. Way to confusing for me. Some may process story lines quickly but for me it was way to confusing. I was literally begging for some more character building for all of the characters. I don't even know the color of Rae's hair, her build nothing. Her friends? Nope again nothing. She is suppose to have this \"best friend\" but we literally know nothing about her, nor the relationship her and Rae actually have together. As every other review of this book states, yes, this whole book consisted of two days, which isn't really a bad thing, but for the love of god let someone breathe. That's another thing. This author used the quote \"Oh god, for the love of god, dear god etc way to many times. What made it worse? It was always plural. \"oh my gods, dear gods, for the love of gods!\" I couldn't get passed it I really couldn't.Love triangle. Everyone can complain as much as they want that they hate love triangles but get over it. What book nowadays does not have love triangles? I don't think there is anything wrong with them when the relationships of the characters build and make sense. This love triangle? Horrible, if Rae wasn't a demon in some paranormal world and it was reality, I would classify her as a whore. How could someone be in love and truly care about two completely opposite men when she has known them for what? A whole 5 hours? Literally, after maybe 20 mins of meeting one of them she has her legs wrapped around him, pinned against the wall begging for what? Sex she has never had before? Ugh, come on. Coming from a girl who hates touching people she all of a sudden got over her 20+ year fear to skip the baby steps of touching arms to top off, legs out and making out? Seriously?The concept of the story was good. Hell, the story would have been great if it was less rushed, better understood and there was more character building so that we could really understand the characters, their roles and the \"real\" feelings between them. I stuggled with this one, alot. Some may enjoy a faster paced book and if so then this is the one for you. I want to be able to love the characters and feel for them and I felt like I went in blind and they all still feel like strangers.:( I hate giving reviews like this."}], "description": "Book One. Rae Wilder has problems. Supernatural creatures swarm the earth, and humanity is on the brink of extinction. Stalked by a handsome fairy who claims she is like him, demonkind, Rae thinks maybe it was a mistake breaking the rules by going over the Wall into demon territory. Plunged into a world of dark magics, fierce creatures, and ritual sacrifice, she is charged with a guarding a magical amulet. The changes to her mind and body are startling, but rather than accept her purpose she struggles against who she is destined to be. Throw in a big lust for a vampire who can't keep his hands off her, and life starts to get complicated. Rae is forced to make the ultimate choice: to live and die human, or embrace her birth-right and wield magics that could turn her into something wicked, a force of nature nothing can control. BrE.", "title": "Demon Girl\n      \n          (Rae Wilder #1)", "url": "https://www.goodreads.com/book/show/9481431-demon-girl", "average": 3.57, "cover": "https://images.gr-assets.com/books/1313391648l/9481431.jpg", "reviews": 642, "authors": [{"url": "https://www.goodreads.com/author/show/4399719.Penelope_Fletcher", "name": "Penelope Fletcher"}], "type": ["Fantasy", "Fantasy", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/9481431-demon-girl", "http://www.goodreads.com/book/show/9635418-glamour", "http://www.goodreads.com/book/show/13578710-glamour", "http://www.goodreads.com/book/show/9695235-the-demon-girl", "http://www.goodreads.com/book/show/24081930-venomous", "http://www.goodreads.com/book/show/10490387-compel", "http://www.goodreads.com/book/show/11322991-smolder", "http://www.goodreads.com/book/show/11115394-enchant", "http://www.goodreads.com/book/show/13247147-burn", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}