{"ratings": 3, "userreviews": [{"userName": "Albert Yates", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/14289020-albert-yates", "userReview": "as an anthology filled with short stories where members kill one another it's everything you'd expect. there are some gems in this book!I was most impressed with Meat the Parents by Moira Briggs. such a unique take on a teenager acting out on the impulses to murder their parents for breathing the wrong way. I got this story for Annie Walls though,I can't lie. Her Living Stiff story was really fun. this makes me want to go out and join a writing club so that I could be part of something as cool as this."}], "description": "When an online writing group full of sick and twisted people, decide to take on the subject of murder... this is what happens. 'The Unblocked Writers Group' was started on facebook in 2010. On most days, they are content with the usual activities-sharing writing tips, posting excerpts of their current projects, hi-jacking posts with what they believe to be witty commentary and generally finding newer and more creative ways to drive each other nuts. However, once they were challenged to create their best fictional murder story in flash-fiction format, all hell broke loose. 'Dis-Membered' is a collection of short narratives from 12 writers with one mission: crafting the untimely and gruesome demise of whoever they felt had it coming. With tactics ranging from subtle acts of deceit and trickery to raw and savage depravity, they combined to leave a trail of bodies on the page. In the end, no one was safe from their wrath-not even their fellow group members.", "title": "Dis-Membered: They Had It Coming", "url": "http://www.goodreads.com/book/show/21486248-dis-membered", "average": 4.67, "cover": "https://images.gr-assets.com/books/1397433367l/21486248.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/8063850.The_Unblocked_Writers_Group", "name": "The Unblocked Writers Group"}, {"url": "https://www.goodreads.com/author/show/7318054.Vicki_Barnes", "name": "Vicki Barnes"}, {"url": "https://www.goodreads.com/author/show/509799.Wayne_DePriest", "name": "Wayne DePriest"}, {"url": "https://www.goodreads.com/author/show/5777960.Annie_Walls", "name": "Annie Walls"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/21486248-dis-membered"]}