{"ratings": 750175, "userreviews": [{"userName": "Sarah Actually", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/9738620-sarah-actually", "userReview": "Here are some thoughts on this book.1. I would have been all OVER this in 1897.2. I would like Van Helsing to be quiet. 3. I can suspend disbelief for the vampires but not for the blood transfusions4. I know it was 1897 and blood types weren't discovered until 1901 (according to my very in depth research) (wikipedia) but I still cannot get past it5. The Texan would go outside and just randomly shoot things for fun, including things sitting on windowsills of windows in rooms where live people are hanging out, so he was clearly the most realistic character6. VAN HELSING. SHUT UP. 7. Oh cool, another chapter from Mina's POV finally - oh nope it's just Van Helsing talking to her the whole time8. This book is called \"Dracula\" but it should have been called \"Dracula Lite\" because he was barely in it after the hilarious first few chapters where Jonathan is complaining about his bad breath9. Why can Dracula control wolves?????????????? Someone explain this to me10. I want a book about Dracula's sister wives11. I'm pretty sure I can still hear Van Helsing rambling about something off in the distance12. The men in this book were 1000 times more dramatic and emotional than the women which was amazing13. For real Jonathan was crying and groaning all over the place and Mina would just look at him like \"...ok.\"14. Mina is a boss15. THAT'S NOT HOW BLOOD TRANSFUSIONS WORK. IS SHE A UNIVERSAL RECIPIENT???? YOU DON'T KNOW!!!! OMG.EDIT, JULY 2, 2017: Hello there! Thank you for reading my review of the book, DRACULA (Paperback) by Bram Stoker, which I posted on this website, good reads dot com, two years ago when I read this book and still remembered things about it. It is now 2017, and all I remember at this point in my life is that in this book there is a guy named Van Helsing who talks very much, and sometimes there's a vampire named Dracula who has bad breath. I can only assume that is why everybody hated him so much. If you feel the urge to leave me any type of comment about what I said two years ago about the blood transfusions, please take a quick moment to check if your \"well, actually\" mansplaination re: this series of jokes has already been posted by someone else. I have received many of these already, and I would not want you to waste your valuable time repeating someone else's very helpful and insightful comment! If your comment is something like, \"you are stupid for thinking wikipedia is reliable,\" I greatly appreciate you informing me of this. I definitely included that thing about wikipedia as a sarcastic joke about how little research I did on this topic, but it is still nice to be reminded that the people who read my good reads dot com reviews are so very, very smart, so much smarter than me, and so extremely helpful, and definitely understand my sense of humor. In conclusion, thank you for reading my review of the book Dracula on good reads dot com!"}, {"userName": "Catriona (LittleBookOwl)", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/5365999-catriona-littlebookowl", "userReview": "Managed to finish this :) Second time studying, but first successful read-through.I enjoyed it more this time around, mainly because I actually read the last quarter or so of the book, which was the most enjoyable in my opinion."}, {"userName": "Jonathan Terrington", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "Dracula: the very name instantly brings to mind visions of vampires, stakes, garlic and crucifixes. But when one bothers to read the novel they may realise how twisted modern vampire fiction has become.Vampires are not meant to exist as heroes. Go back a few hundred years and men believed truly that the vampire was a real immortal, cursed to quench his undying thirst with a living mortal’s blood. The very idea of a blood drinker inspires the very image of a villain to the mind. And that is what the titular character of this novel is.The word novel is not used lightly, but one could also write that this is a collaboration of journals, letters and papers. For that is how Bram Stoker chose to fashion his famous novel (in epistolary form). And the different viewpoints through each journal serve to create suspense which suits the gothic tone of the novel perfectly.In all it is a macabre novel that serves to make the reader reflect upon good and evil. The vampire to me is nothing more than an indication of man’s own cursed nature and that unless he is delivered he must suck life from others around him. Ultimately only the righteous can destroy the darkness that serves to drain life.The Rest of this Review has been moved to my new site: The Write Stuff. Visit my site to read the remainder of the review and any new reviews."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Dracula is, of course, one of the most renowned horror stories, and the most well-known vampire novel. Bram Stoker set the ground rules for what a vampire should be, and set the benchmark for all other writers of the vampire afterwards. Indeed, if tyrannical villains are a necessity of Gothic fiction then Count Dracula is the father of all gothic villains, in spite of it being one of the last Gothic fiction novels to be written. It’s a work of genius that his presence is felt so strongly in the novel with him appearing in the flesh so rarely. \"His face was a strong, a very strong, aquiline, with high bridge of the thin nose and peculiarly arched nostrils, with lofty domed forehead, and hair growing scantily round the temples but profusely elsewhere. His eyebrows were very massive, almost meeting over the nose, and with bushy hair that seemed to curl in its own profusion. The mouth, so far as I could see it under the heavy moustache, was fixed and rather cruel-looking, with peculiarly sharp white teeth. These protruded over the lips, whose remarkable ruddiness showed astonishing vitality in a man of his years. For the rest, his ears were pale, and at the tops extremely pointed. The chin was broad and strong, and the cheeks firm though thin. The general effect was one of extraordinary pallor.The atmosphere of the novel is unmistakably gothic. It is impossible to talk about Dracula without mentioning the Gothic; the two are one and the same. The decaying castle in which the book begins is testimony to the eeriness that follows. The \"damsel in distress\" motif appears quite often in Gothic literature, and none so much as Dracula. Mina and Lucy are both damsels at some point, and even Harker himself can be seen as one at the start when he is rescued by his wife that has a “man’s brain.” It’s quite a subversion of the standard gender roles, at this point, and quite funny really. On initial inspection the plot of the book can be summed up in a few short sentences: Dracula wishes to create more vampires in Victorian London; his attempts are thwarted and he and his kind are exterminated. But, the novel is so much more than that. It represents Victorian fears and fancies; it is a comment on women’s position in society and underpins their sexual desires (and perhaps fears.) It suggests a struggle between modernity and science with religion and superstition. It harbours the effect of Darwinian thought on man as Dracula himself represent the idea of “survival of the fittest.” The undertones of sexuality and disease that occur so frequently symbolise the time in which it was written. Each one of these has been a topic for commentaries on Dracula, and academic essays. Indeed, the extrinsic value of this novel is incredibly high. Bram Stoker also explores the theme of sanity with many of his characters, not just Renfield. At some point, every character wonders whether their dealings with the Count are born from some mental deficiency rather than a paranormal encountering with the villain. This clashes the Victorian realism view with the paranormal events that occur in the novel. There are also issues of identity, and how this is affected by transgression. It can further be seen as an allegory for religious redemption and a comment on colonisation. I think I’ve said enough; if I say anything else I will break my “500 words a review” rule. As you can probably tell I’m quite passionate about this book: it is brilliant; at this point, I can honestly say that Dracula is one of my favourite novels of all time: I just love it. I might even write my dissertation on it and Gothic Literature. Dracula rules!!!!!!!!!!!!!!"}, {"userName": "Ana ", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "4.5 Bloodsucking Stars! \"Once again... welcome to my house. Come freely. Go safely; and leave something of the happiness you bring.\" \n \"I want you to believe... to believe in things that you cannot.\" I’m not a big scary book fan, but I have been known to read some spooky stuff. Two books that I found most terrifying were Peter Straub's 'Ghost Story,' which is also one of my all-time favorites, and Stephen King's 'Different Seasons.' Ok the last one isn't that scary but it's my favorite Stephen King book and I had to mention it. I can now claim to have finally read Dracula! It has always shamed me that I never read it but called myself a book lover and so I decided I would finally give it a try. I half expected Count Dracula to sparkle in the sun. But then I remembered this isn't Twilight. \nVampires. They're everywhere, you know. They can be found in the folklore of virtually every culture in the world. There have been countless books on vampire phenomenon. Too many to name or analyze. Yet Bram Stoker remains the undisputed 'king.' \nStoker's Dracula has some of the darkest characters and plot lines I've ever read. The world he has created is at the same time unique and spell-binding. I dare you to find me a vampire more badass than this guy-\nHe is a fascinating character full of contradictions. \nDracula is a complete monster, yet I couldn't help but feel sorry for him. His story is tragic and bizarre, but it draws you in and makes you fall in love with him in spite of his villainous ways. \"Do you believe in destiny? That even the powers of time can be altered for a single purpose? That the luckiest man who walks on this earth is the one who finds... true love?\" Gary Oldman will always and I mean ALWAYS, be my number one favorite Count Dracula. It is also my favorite Dracula movie. Simply because it's directed by Francis Ford Coppola, and Gary Oldman is fantastic. \n \"I am longing to be with you, and by the sea, where we can talk together freely and build our castles in the air.\" For those who haven't yet read it... why not?? \n \"There are darknesses in life and there are lights, and you are one of the lights, the light of all lights.\""}, {"userName": "Mark", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/52374080-mark", "userReview": "As I expected this one goes straight to the favourites shelf!!Whether you have read it or not, we all know loosely the story of Dracula. Although I assume a lot of people think of it as the bloodthirsty vampire book it definitely is not. Have no doubts this is a horror novel but not like those of modern day, the horror here is perceived as much as it is read, simply by the amazing words of Bram Stoker. There is no real gore here - this is not the Hollywood Dracula, nor is it Buffy the Vampire Slayer or Interview with the Vampire.Forget your views of flying nasty invasive bats and laughing Vampires in capes. They are here, they exist in this book but the 21st Century Vampire is not Dracula - although Dracula in the original. Everything you see today is the image of Dracula but moulded and enhanced and with a tonne of gore thrown in.This is a literary horror, it pushes the boundaries of belief but only a little. Reading as a vigilante or revenge story you do get a feeling that this is not far-fetched fiction like you read today. For example, the book I read before this was Richard Laymon's 'Bite\". The horror comes more of a building of fear - based mainly on the fact that we all know the general story and all understand what should be happening. Think of it as like having a fear of spiders or snakes and you find one in your house. You go to get something to kill it and return to find it gone. Now you know WHAT it is but not where it is or when it will resurface, but it is there, it is present.The other point to raise here is the way Stoker chose to set the book out. I think it was a clever way of doing things because most of it is read from the journals of the group of main characters. In a sense, it removes the feeling of disbelief because as the reader you are not really being asked to BELIEVE the story. You are almost forced to believe that this could not be fictional as there are several different journals that overlap, from different individuals but all claim the same story."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 28, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I believe this may be the edition I read \"first\". This is an amazing book. I've read reviews by those who disagree and reviews by those who hated the format. But I was swept up in it the first time I read it as a teen and have been every time since. My advice is don't worry about all the psychological baggage that has been tacked on over the years...and please don't confuse the movie \"Bram Stoker's Dracula\" with the actual plot, story, and characters in the book. It doesn't remotely resemble the book and the title has galled me since that movie came out. The book is far, far better.I believe it's worth noting that a lot of the psychological baggage that has been attached to this volume probably tells you more about the ones attaching it than the book. This book creates a horror atmosphere that has been copied constantly over the years but never quite captured again. You'll be experiencing with Harker the castle and what he faces there. Battling the Count in England...and the terror of the ship's crew that carried his earth boxes across the sea, all will stay with you. Again let me urge you no matter how well any movie has been done, if the movie Dracula is the only one you know, you haven't met the proto-vampire who resides in this book. He/it still walks through literature and even more in the dark fears that lurk in the back of our minds when we're alone on a stormy night or we have to walk alone past that old rundown graveyard (not cemetery) where the city has never gotten around to installing those street lights.This isn't Twilight, nor is it Buffy the vampire Slayer, there aren't any friendly, helpful, romantic vampires here. (None sparkle either) There is quite probably a reason (or maybe more than one) why we wish so badly to laugh at this book. It does what it does very, very well...and that's be frightening. This book is a classic that has been around for over a hundred years..there's a reason for that.\"We\" just read this in the Supernatural Readers group...and I still like it. LOL"}, {"userName": "Martine", "userReviewDate": "Aug 05, 2008", "userURL": "http://www.goodreads.com/user/show/381149-martine", "userReview": "'Welcome to my house. Come freely. Go safely. And leave something of the happiness you bring!'These are pretty much the first words spoken to Jonathan Harker, one of the heroes of Bram Stoker's Dracula, upon his arrival at Count Dracula's castle in Transylvania, just minutes after a nightmare journey through the landscape of gothic horror: darkness, howling wolves, flames erupting out of the blue, frightened horses. Within a few days of his arrival, Harker will find himself talking of the Count's 'wickedly blazing eyes' and 'new schemes of villainy' and have some hair-raising encounters with the man who is now the world's most famous vampire: 'The last I saw of Count Dracula was his kissing his hand to me, with a red light of triumph in his eyes, and with a smile that Judas in hell might be proud of.' Several adventures involving sharp teeth, mirrors, garlic, crucifixes, bloody-mouthed corpses and big stakes will ensue. The above quotations should make it abundantly clear what kind of book Dracula is. It's sensation fiction, written nearly half a century after the heyday of that genre. It's a cross between an epistolary novel, a detective novel and a save-my-wife story, and it's full of scares, horror and disgust, all described in a lurid tone that befits the subject: the living dead. Or the Un-Dead, as the book's other hero, my countryman Van Helsing, calls them.Sadly, Van Helsing is one of my main problems with the book. While I love his heroism, his 'Let's-do-it' attitude and his unceasing struggle for Mina's soul, I find him entirely unconvincing as a Dutchman. I wish to God (with a crucifix and everything!) that I could switch off my inner linguist and appreciate the story for its narrative qualities rather than its linguistic aspects, but Stoker has Van Helsing indulge in so many linguistic improbabilities ('Are you of belief now, friend John?') that it quite took me out of the story, again and again and again. I'm aware this is not a problem that will bother many readers, but I for one dearly wish Stoker had listened to some actual Dutchmen before making the hero of his story one. Then perhaps he also would have refrained from making the poor man mutter German whenever he is supposed to speak his mother tongue. ('Mein Gott' is German, Mr Stoker. I mean, really.)Linguistic inaccuracies aside (there are many in the book), Dracula has a few more problems. For one thing, the bad guy doesn't make enough appearances. Whenever Stoker focuses on Dracula, the story comes alive -- menace drips off the pages, and the reader finds himself alternately shivering with excitement and recoiling in horror. However, when Dracula is not around (which is most of the second half of the book), the story loses power, to the point where the second half of the book is actually quite dull. In addition, the story seems a little random and unfocused. Remember the 1992 film, in which Dracula obsesses about Mina Harker (Jonathan's wife) because she is his long-lost wife reincarnated? That conceit had grandeur, romance, passion, tragedy. And what was more, it made sense. It explained why Dracula comes all the way from Transylvania to England to find Mina, and why he wants to make her his bride despite the fact that she is being protected by people who clearly want him dead. In the book, however, Mina is merely Jonathan's wife (no reincarnation involved), a random lady Dracula has sunk his teeth into, and while this entitles her to some sympathy, it lacks the grand romantic quality the film had. I guess it's unfair to blame an author for not thinking of an improvement film-makers later made to his story, but I think Stoker rather missed an opportunity there.And then there's the fact that Stoker seems to be an early proponent of the Robert Jordan School of Writing, meaning he takes an awful lot of time setting the scene, only to end the book on a whimper. The ending to Dracula is so anticlimactic it's rather baffling. Did Stoker run out of paper and ink? Did he want to finish the story before Dracula's brides came and got him? I guess we'll never know.Still, despite its many flaws Dracula is an exciting read (well, the first half is, anyway), and Stoker undeniably left a legacy that will last for centuries to come. In that respect, Dracula deserves all the praise that has been heaped on it. I still think it could have been better, though. Much better."}, {"userName": "S.A. Parham", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/275867-s-a-parham", "userReview": "I was rather disappointed by this classic. It started out with promise, especially the Jonathan Harker bits. Then all the male characters descended into blubbering worshippers of the two female characters, and by the end of the novel, I was wishing Dracula could snack on all of them and be done with it. I kept having to put it aside and read chapters in between other books, but I managed to finish it at last."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Nov 03, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "I highly recommend reading this to any fans of the vampire genre. It is a commitment and investment for the reader, but it is worthwhile. While Dracula is not the 1st vampire novel/story, it has firmly established many of the conventions of the vampire genre. I must say that no movie version I have watched does this justice. Bram Stoker's Dracula might have been a somewhat faithful rendition, but it took unforgivable liberties with the relationship between Mina and Dracula, and downplayed the deep, abiding love between Mina and Jonathan. In addition, it portrayed Dracula as a seductive, lovelorn and sympathetic character. He is none of these. Dracula is a complete and utter fiend. He is unrelenting evil, and I spent this whole book waiting for him to get what he deserved.I love the use of letters and correspondence to tell the story. It added an authenticity to this story by revealing the narrative through written details of events. One would think that this would create a distance between the reader and the story, but strangely it does not. Instead it infuses the story with a human element, as we see things unfold through the eyes of the humans who witnessed everything. In addition, the diary entries from Jonathan Harker, Mina Murray (soon to be Harker), Lucy Westenra, and John Seward show the emotional impact of the characters to the horror of Dracula. Dracula is very much a Victorian work. It is clear what the mores were at that time in reading this story. It is also evident how society is changing as time speeds towards the 20th Century (this book was published in 1896). The attitudes towards women as sweet, beloved creatures who should be loved and adored is very much in evidence. However, Mr. Stoker took the time to show that Mina has a powerful role and usefulness beyond what was expected of her as a woman of her times. In fact, she plays a very pivotal role in this story. Because of the connection between Dracula and herself, she cannot be relegated to a second class citizen in this story. In addition, her view of the situation shows much about how Dracula managed to wreak his reign of terror over poor Lucy and how devastated Jonathan was from his early encounter with Dracula. Mina turns out to be a real heroine in this story. She is very resourceful, and her methods are a great help in the process of understanding what Dracula is, and tracking him down. I felt for her when she was under his thrall, because her love for Jonathan was true, as well as her abhorrence of the evil of Dracula and how it had affected her. Those scenes added a psychological component to the horror element in this book.This book is not a thrill a minute book. It might be a horror story, but it's also a crime novel, in that the group composed of Drs. Van Helsing and Seward, Jonathan and Mina Harker, Quincy Morris, and Arthur Holmwood spend much time trying to track and defeat their prey, Dracula. Readers should approach this story with this in mind. There are some moments that are truly unnerving and scary, all the same, but they are used with good effect. I would be reading right along, and then something really scary would happen all of a sudden. When my heart rate went back to normal and I fell back into the procedural-type narrative, another creepy moment would occur. Thus, my investment of diligent reading paid off, for those scary moments were quite suspenseful.Readers should also be aware that the characters tend to be along sentimental lines. They are good, decent people. They cry and feel sorrow. The men might be brave, but they are not afraid to break down and sob out their anguish. I admired each of the protagonists that I was supposed to admire: Mina, Jonathan, John/Jack Seward, Van Helsing, Arthur, Quincy, and the poor, unfortunate Lucy. Each of them invest their heart and life into tracking and destroying the beast. This might strike a modern reader as being too good to be true. But in the historical context, I didn't have trouble with it. I might expect different characterizations for a modern vampire novel.I found that issues that I had with the recent movie adaptations of Dracula did not exist in this novel. Mina is not played as the good, innocent foil for the sexually adventurous and slightly wanton Lucy. Lucy is a sweet girl who was preyed on and destroyed by Dracula. Mina is not a fickle woman who would abandon her true love for the seductive wiles of the vampire Dracula. That always bothered me about the movies. I didn't see why poor Lucy was deserving of what happened to her. Even if she had been a wanton, I couldn't say she deserved her demise at Dracula's hands. Reading about her decline, death and resurgence as a vampire was extremely difficult, not to mention the effect it had on the loved ones she left behind. Additionally, I dislike how throwaway the love that Mina had for Jonathan is portrayed in the movies. I'm glad it was not this way in the book.Renfield is a character who has been played for laughs in many of the Dracula adaptations and knockoffs. In the original novel, he is a character to be pitied. He was seduced by Dracula, subsequently losing his reason. There are glimpses of his formerly formidable intellect and sanity, as well as a sense of right and wrong that shone through, causing me to feel sorry for him. Particularly when he warns Seward not to keep him in the Asylum. If only Seward had listened.Drs. Seward and Van Helsing are physicians and men of science with profound respect for each other, but who tend to look at situations differently. Dr. Seward is very much a rationalist. He tries to approach Lucy's strange illness from a completely scientific perspective, yet Dr. Van Helsing is a learned man who is trained in modern medical science (as well as a pioneer in medicine), but gives credence toward the ancient beliefs, and whose knowledge is shored up by his faith in God. The struggle that Seward faces in having to accept that Lucy's demise is due to a powerful supernatural entity is evident as we read his journal entries. Van Helsing is seen through the descriptions of the diary entries of Mina, Jonathan, and Seward. I found Van Helsing quite the character. Without a doubt, he's my favorite in this book, although I found some of his lines hard to read because of the fact that it is written as though English was his second language (which it was). He is a man of compassion, although with a tendency towards bluntness. I like that he's able to think his way out of difficult situations, but also relies on faith against his demonic enemy.The movies tend to emasculate Jonathan, but he is a very strong character to have survived his imprisionment in Dracula's castle, with his body and his sanity intact. His conviction to protect Mina at all costs, despite knowing the depths of the power of his enemy speaks to me. He might not be a he-man, but he is definitely a worthy man mate for Mina.Arthur Holmwood is a noble, yet he is not protrayed as a prig. He is very down to earth, and willing to do his part to destroy Dracula and to see justice done for his beloved Lucy. I admit I tended to picture Cary Elwes (an old crush of mine who played Holmwood in Bram Stoker's Dracula) about 50% of the time. He definitely rose to the occasion, despite the seemingly insane ravings of Van Helsing about Un-dead creatures, and the need to drive a stake through the heart and cut off the head of his beloved. Quincy Morris embodies the Texan spirit in the very best of ways. His devotion to Lucy and later Mina causes him to risk his life in the struggle against Dracula. Don't look for a sexy creature of the night in this book. Dracula is a horrid, evil beast. When he meets his demise, I didn't feel one iota of sympathy. I was cheering instead. It's refreshing to read about evil vamps without any charisma for once (and this from a paranormal romance fanatic). This book is a delicious work to have read. I'm glad I attempted it when I could fully appreciate its genius. I freely admit when I read it in high school, I wasn't ready for it. It took me the better part of the week, but I found myself eager to keep reading, despite the somewhat antiquated language. I wanted to see how things would unfold. You might think, \"Well Dracula is old hat. I've seen many vampire movies. It's all the same.\" I'd tell you, not so. You should read this book if you're a vampire fan. You will find a resonance that is lacking in most of the modern vampire fare, with its classic setting, genuine characters, and the tangible essence of the unearthly evil of the vampire. And to think that Stoker wasn't quite as glutted on the rich milk of the vampire legends as us modern vamp fans are. Maybe that's why this book felt so authentic to me."}, {"userName": "Nayra.Hassan", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "مصاصي الدماء.. ما اكثرهم في واقعنا ..تأمل قليلا في المقربين منك ..و ستكون محظوظا حقا لو لم تجد فامبير جفف مشاعرك و مواردك أولا باول؛ قبل ان يجفف الدماء من عروقك مرارا  هي رواية تغذي بداخلك ذلك الشعور الموروث غير مبرر : الخوف .بلا منطق ولا نهاية. .بل ونجد فيه متعة و ندفع المال لنرتجف بين صفحات تلك الرواية الدموية التى تحكي و تحكي و تظل تحكي عن ذلك الوغد الروماني السادي الذي يضع رؤوس اعداؤه على مائدة افطاره! !ا💀دراكولا تعني \"الشيطاني \" بالرومانية فقد فاز الكونت فلاد الولاشي باللقب بعد ان سعى اليه كالخراتيت العنيدة ..في الواقع والرواية.تروى القصة على لسان المحامي البريطاني جونثان هاركر الذي يذهب في رحلة لقلعة الكونت في ترانسلفانيا..لتحل عليه الللعنة هو و كل من يعرفه او قال له صباح الخير يوما مانجد نفسنا تحت رحمة عشر أبطال بتقاليدهم الثرية و عباراتهم العتيقة ..برام ستوكر \"زميل\"لنا؛ اي كان ناقدا لعشر سنوات ثم تحول لمؤلف لذا جاءت الرواية مثالية البناء ..الشخصيات متكاملة..الاقناع تدريجي...الرعب في اناقة الكونتيسات ...هناك تطويل بالطبع ليعرف البطل كم كان ساذجا عندما ضحك من كلمة فامبير ..و رؤية فرانسيس كوبولا في فيلم 1992أمسكت بروح الرواية و قدمتها كما لم يحلم ستوكر نفسه... عدا المبالغة في رومانسية دراكولا لكن ستظل\" دراكولا \"اول رواية كاملة عن تلك الأسطورة الضاربة في القدم..رواية ساهمت في تنشيط السياحة في رومانيا لأكثر من قرن كامل .🏰"}, {"userName": "Hannah Greendale", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend. Despite being hailed \"the most famous figure of seductive evil\" in literature, Count Dracula proves to be neither scary nor seductive."}, {"userName": "Carmen", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "[died (hide spoiler)]"}, {"userName": "Henry Avila", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "\"Children of the night what music they play\" ; Jonathan Hawker hears those chilling, famous words from the inhuman appearing Count Dracula, in the remote Castle Dracula , Transylvania (Romania) . What started out as a simple real estate deal by an English solicitor and a foreign nobleman, becomes a blood sucking nightmare. The shell shocked Jonathan is imprisoned by the creepy Count, a \" person\" you wouldn't want to see in a dark alley on a moonless midnight walk. Three strange , bizarre , but very beautiful women, brides of Dracula, the weird sisters, are in his room looking not quite real. When Dracula arrives also, they fade away.... into nothingness . Next day the Englishman can't decide if what he saw last night was a dream or fact... Either way the terrified Mr. Hawker escapes , as if his life depended on it, not caring about those eerie wolves , surrounding the building and disappears... Back in \"civilized\", safe England his fiance Mina on vacation in Whitby, is visiting her sick, good friend Lucy Westenra, she becomes very pale too, almost like ill Lucy who is losing blood, why ? Dr. Seward with the help of Dr.Van Helsing an expert in little known diseases, gives her Lucy, four transfusions, still she becomes weaker, and small punctures are spotted on Miss Westenra's neck, what can they be? A gruesome Bat is seen flying outside the window, lurking about waiting for who knows what... mists come into poor Lucy's room... Dr. Seward, the head of an insane asylum, has a star inmate named Renfield he likes keeping busy, by eating flies and spiders. Something unnatural is disturbing the disturb man. Renfield even attempts to kill the good doctor. On the continent the dazed Jonathan, is found in a hospital in Budapest, disclosing events, in his journal, read by Mina when they get him back home..Dracula is seen by Hawker in England, or was this man, the undead fiend , actually the Count? Better speak to Dr. Van Helsing, who they say has read about vampires and is an expert on the subject. This old Dutchman doesn't mind getting his hands dirty....The novel has inspired countless films, books and television shows...the endless flow of vampires stories more than a century after this classic was published.There is an obvious reason for this phenomenon...It still scares people ...in an entertaining manner... The historical figure was a Romanian Prince, Vlad 111 or Dracula, ( son 0f Dracul, the Dragon) 1431- 1476, known as the Impaler, an alias he acquired , and well deserved too...for his bloody treatment of captured soldiers... his many enemies, by the thousands...he is a national hero."}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "«Η εκδίκηση μου μόλις άρχισε. Πέρασε στους αιώνες και ο χρόνος είναι στη δική μου μεριά».Ο Κόμης Δράκουλας με τη γοητευτική και οδυνηρά ιδιόρρυθμη προσωπικότητα είναι ένας ευγενής, γόνος αριστοκρατικής και πανίσχυρης οικογένειας, υπηρέτης του μακάβριου και του σκοτεινού. «Καλώς ήρθες στο σπίτι μου! Μπες ελεύθερα. Έλα με ασφάλεια, και άφησε λίγη απ' την ευτυχία που φέρνεις». Η μορφή του, ψηλή, λιγνή, υπνωτιστική, σατανικά ζοφερή και ικανή για αποτρόπαιες και ανατριχιαστικές πράξεις. Ένας χιμαιρικός εφιάλτης, αιμοβόρος, αιμοσταγής, αδιανόητος εγκληματίας, αδελφός της ματωμένης σελήνης και γητευτής λύκων, εντόμων και τρωκτικών. Μια παρουσία υποβλητική αδίστακτη και ανυπέρβλητη απο ανθρώπινες δυνάμεις, εφορμά τα μεσάνυχτα απο τον εγκαταλειμμένο και ερημωμένο Πύργο του με σκοπό να παρατείνει την κυριαρχία του και να διατηρηθεί αιώνιος...πίνοντας αίμα. «...άκουσα σαν από πολύ χαμηλά στην κοιλάδα τα ουρλιαχτά πολλών λύκων. Τα μάτια του Κόμη έλαμψαν, και είπε: «Άκου τα, τα παιδιά της νύχτας. Τι μουσική που κάνουν!» Βλέποντας, υποθέτω, κάποια έκφραση στο πρόσωπό μου που του φάνηκε παράξενη, προσέθεσε, «Α, κύριε, εσείς οι κάτοικοι της πόλης δεν μπορείτε να μπείτε στην αίσθηση του κυνηγού.»Εξουσιαστής της διαβόητης δυναστείας των Νεκροζώντανων συμβολίζει την δύναμη της ονειρικής ιδιότητας, της μεταμόρφωσης του υλικού σε άυλου καθώς και την απόλυτη ένωση του φαντασιακού τρόμου με στοιχεία πραγματικότητας.  Η σκιά του σκεπάζει για αιώνες τα απόκρημνα βουνά της Τρανσυλβανίας και τα ίχνη του είναι για πάντα αποτυπωμένα στις Ρουμανικές Άλπεις. Το συγκεκριμένο μυθιστόρημα του Ιρλανδού συγγραφέα Bram Stoker δεν είναι ένα βιβλίο τρόμου και φρίκης,είναι η επιτομή του γοτθικού λογοτεχνικού είδους. Σίγουρα πρόκειται για ένα έργο κλασικό, αξεπέραστο, απέθαντο σαν την αρχετυπική φιγούρα του Δράκουλα που το διαφεντεύει. Είναι ένας μυθικός θρύλος, ένα εφιαλτικό ταξίδι με προορισμό την αιώνια ψυχική καταδίκη και υποτέλεια στα απέθαντα πλάσματα που ηδονίζονται πίνοντας αίμα και υπακούν στα σαδιστικά ένστικτα του αιματηρού ηγεμόνα της επίγειας κόλασης. Εκδόθηκε το 1897 ως επιστολικό μυθιστόρημα με ημερολογιακές καταγραφές των χαρακτήρων που πρωταγωνιστούν. Η δημιουργία του κράτησε επτά χρόνια. Είναι αποτέλεσμα μελέτης και έρευνας των ευρωπαϊκών λαϊκών παραδόσεων και δεισιδαιμονιών και τις ιστορίες για βρικόλακες απο όλο τον κόσμο. Απο εκεί και έπειτα κατέκτησε την πρώτη θέση στην καρδιά αμέτρητων ανθρώπων ως το πιο συναρπαστικό πρότυπο σκοτεινού τρόμου μέχρι και σεξουαλικής απόλαυσης βαμπιρικών προδιαγραφών...Ο Κόμης Δράκουλας ενέπνευσε θεατρικούς συγγραφείς, λογοτέχνες, κινηματογραφικούς παραγωγούς και σκηνοθέτες και θα συνεχίσει να το κάνει με απίστευτη επιτυχία. Το νεκρό και σάπιο χώμα έγινε το κρεβάτι του τέρατος με τα κόκκινα μάτια,τα μυτερά δόντια και την τεράστια δύναμη. Το σατανικό του χαμόγελο γοητεύει μεθυστικά τα θύματα που αφήνονται ανενδοίαστα στην αφαίμαξη τους προς τέρψη του τέρατος που ασκεί αφύσικη έλξη κάθε είδους. Μοναδική απαντοχή των θυμάτων η Θεϊκή παρουσία και αρωγή που μπορεί να απομακρύνει ή και εξοντώσει το Κακό. Κάπως έτσι ο Κόμης Δράκουλας κατέκτησε την έννοια του αδιανόητου και κατά συνέπεια την αιώνια μυθοποίηση. Μπροστά σε αυτό το μεγαλείο δε γίνεται να σταθείς σε λεπτομέρειες και να κατακρίνεις με τη λογική και ορθολογική εκτίμηση αυτό που η ανθρώπινη φαντασία πλάθει και παρουσιάζει. «ΦΙΛΕ ΜΟΥ,— Καλωσήρθατε στά Καρπάθια. Σάς περιμένωάνυπόμονα. Σάς εύχομαι καλόν ΰπνο γι άπόψε. Αύριο στίς τρεις φεύ-γει ή άμαξα γιά τή Μπουκοβίνα· Εχει κρατηθεί μιά θέση γιά σάς. ΣτόΠέρασμα τού Μπόργκο θά σάς περιμένει ή άμαξά μου γιά νά σάς φέ-ρει. 'Ελπίζω δτι τό ταξίδι σας άπό τό Λονδίνο ήταν άνετο κι ότι θάείναι εύχάριστη ή παραμονή σας στήν όμορφη χώρα μου. — Ό φίλοςσας,«ΔΡΑΚΟΥΛΑΣ»"}, {"userName": "Mohammed Arabey", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "في ويتباي الهادئةالساحرة،تحاول لوسي مع مينا تهدئة قلقها علي خطيبها الغائب برومانيا**دكتور نفسي يعاني رفض لوسي لخطبته، يشغل نفسه بمتابعة مريض من نوع خاص..يهوي صيد الذباب والعناكب..مهووس بالحيوات**سفينة غامضة ترسو بويتباي في عاصفة عاتية وأجواء كئيبة غامضة..بدون أي طاقم علي سطحها الا ربان..ربان مقيد بدفتها،ميتا**أقتحام بيوت بلندن..رحلة بقطار الشرق السريع..وأخري نهرية..ذئاب وخفافيش وعالم مهووس بالخرافات والاساطير..وثومماذا كنت تظن؟ أكنت تعتقد أنك ستظل قابعا بقلعة ما بترانسيلفينا تكتب مذكراتك فحسب؟؟دعك من تلك الافلام الرخيصة التي شوهت القصة الاصلية وسجنتها في كلاشيهاتودعك من قصة الحب بين الفتاة ذات الملامح الثابته والفتي الذي يلمع في ضوء الشمسDracula is Better Love Story than Twilight :)وفوق كل ماسبق....كاتب مهووس يصرح بأن كل الاحداث الهامة بالرواية مبينة علي أحداث، بل وشخصيات، حتي الانجليزية منها، حقيقيةبرام ستوكر قام فعلا ببناء عالم مصاصي الدماء بطريقة أكاديمية و بأطار مغامرة متنوعة الشخصيات والاماكن بنفس الوقت, عمل فعلا ستشعر بتعب الست سنوات التي قام فيها بجمع المعلومات الحقيقية من دول مختلفه حول الاساطير والثقافاتمعلومات تاريخية حقيقية حول فلاد الولاشي ظل يجمعها ,عن حكام رومانيا وقساوتهم, معلومات حول الخفافيش ماصة الدماء, ومزج بين بعض الاساطير المحلية الاحداث الفلكلورية والتي قد تكون مبنية علي اصول حقيقية مع الاطار الخيالي للرواية والمغامرةوقد أعجبني جدا تلك المشاهد السياحية بويتباي بالاخص التي رسمها بدقه برام ستوكر وجعلك كأنك تزور المكان نفسه فعلا وتعيش الاجواء الغامضة التي حلت عليه بذلك الوقتبعض المعلومات حول الاساطير التي في دول العالم المختلفة علي لسان فان هلسنج فعلا اثارت فضولي للبحث عنها ..كما اثار فضولي أكثر مقدمة الكاتب بنفسه والذي يجزم ان الاحداث تنطوي علي الكثير من الحقيقة..وبعض الشخصيات حقيقية ايضا ,هذا جعلني اتخيل المؤلف كفان هيلسنج نفسه..انه الفانتازي الحضري في أول صوره، وهو النوع المفضل بالنسبة لي في الفانتازيUrban Fantasyوقد سبق رواية دراكولا روايتان عن مصاص الدماء..ولكن تظل دراكولا هي الاصل وحجر الاساس لكل ماجاءعن اساطير مصاصي الدماء بعد ذلكربما جاء بعد ذلك روايات تثري أسطورة مصاص الدماء أكثر وتمنحها جاذبية وقد تضيف لها عمقا \"غالبا تلك التي تكون مستندة لحجر أساس الذي وضعه برام ستوكر\" ولكن احيانا تاتي الاخري مجرد تقليدا ماسخا وحبس للاسطورة في أقبية قلاع رومانيا.. ولكن غير الرواية الاولي في 1819 أو,انت هنا في رائعه ستوكر في 1897 ستتعرف فعلا علي اصول تلك الاسطورة*********************النـــسخة العربيــة-------------لم أكن أنتوي ان اقرأ الرواية في المقام الاول..لحساسيتي من الكلاسيكيات عامالكن النسخة العربية المترجمة كانت مشجعة ... فقد كانت بالفعل ترجمة امينة, متضمنه الاضافات الاصلية من الكاتب برام ستوكر من فصل كامل بالمقدمة الي تعديل بسيط بالنهاية غير المنشورةغير الملحق حول فلاد الولاشي نفسهولكن بصراحة لم يرق لي في كثير من الاحيان الحوار,شعرت بطوله احيانا وصعوبة فهمه..هو واضح ولكنه يحتاج تركيزا اكثر من المعتادوسرعان ماأكتشفت أن الامر ليس عيب ترجمة, بل ان الحوار فعلا في النسخة الانجليزية يتميز بصعوبة شيئا ما بالأخص في حوار فان هلسنج والذي ليس انجليزيا في الاساس..وقد تأكدت بنفسي من صعوبة الحوار لاقتنائي نسخة اخري انجليزية وهي ما أعدت القراءة منهاعاما جو الرواية في نهايات القرن التاسع عشر يجعلك فعلا تتعجب من \"المشاعر الفياضة للرجال والنساء, والتي ستشعر في كثير من الاحيان ان الحوار مبالغ في امره جدافستجد الرجال يبكون لرقة السيدات وينبهرون ويصقفون بشدة لعلامات الذكاء التي تظهر علي الانسات الصغيراتوقد يغمن عليهم في بعض الاوقات من فرط الحب ..أنه زمن -مهما كان- يتميز بشئ من الايتيكيت, وان كان مبالغ في طريقة تقديمها,فانها الكلاسيكياتقد تجد الاحداث هادئة في كثير من الاحيان, لا مشهد ذروة ملئ بالاكشن كما تتوقع -وكما توقعت بنفسي-, ولكنها كما قلت رواية كلاسيكية...كانت طفرة في عصرها وظلت لعصور تالية كأيقونة روايات مصاصي الدماءمحمد العربيمن 13 مايو 2014الي 20 مايو 2014"}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "This was neither as bad as I assumed it would be or (nor?) as good as I eventually started thinking it could be. Much as I love receiving real mail, whether it's a letter, present, post card, or even just a book I ordered (Shucks, for me? Thanks, me!), the epistolary form just doesn't generally jiggle my jolly parts. This is especially true when a lot of what you're reading is the journals of a bunch of people you'd never even want to have passing conversations with, Dr. Van Helsing and Dr. Seward being obvious exceptions. Regardless, this is one of those books that fall under my largely arbitrary and completely self-imposed \"Must Read Before I'm Dead\" list. In the midst of being asphyxiated by Proustian self-reckoning, I decided to take a break from being challenged and read something light. You know, like a Gothic novel about an immortal Vlad Tepes and his baby-eating whore-beasts. It's funny what pop culture'll do to ya. I'd heard over and over again that this was like the Book of Genesis for the whole Twilight romancing the undead thing that weirds me out anew with each internet-drenched day. I took this \"Bram Stoker's Hawt Vampires Makin' Tender Love\" idea at face-value because I've seen the Coppola flick. Remember? A lovelorn Oldman, a sexually-repressed and reincarnated Ryder, absinth, slow-dancing in a castle with candles and string-music and shit, vampire nipple-sucking, orgasm-inducing illnesses, etc. Wrong, wrong, and wrong again. Turns out, the movie's entire romantic twist on the story was really just artistic license on roids, and all Mina is to Dracula is a leisurely Sunday brunch. There is straight-up NUUUUTHING saucy here, unless you count Mina and Jonathan Harker's relationship which is about as sexy as a box of Quaker Oats. I don't mean to insinuate that I was disappointed by this difference between book and screen as, needless to say, I have yet find myself reaching for the 19th-century literary fiction shelf when I feeeeeel like maaakin' lurrrrve. Still, I think it's a distinction which inquiring minds may appreciate knowing before committing to this occasionally exciting but largely sloggy story. The good parts were great, but the last 60-ish pages-- appropriately set on a bunch of fucking boats just inching their way along the river--moved so slowly, became so tedious that I just felt like screaming \"Christ Almighty, Dracula, would you just eat these fuckers already?\" If you want to know whether he does or not, you'll have to suffer through the end like I did. The first half is fun, though! (Twss!!)Oh, and how dare you keep Tom Waits locked up in a cage. That's it, I'm calling your mother."}, {"userName": "Matthew", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "Two things about this book:1. It is a really great and creepy story that deserves classic status2. Everything is repeated soooooo much without any obvious benefit.Here is actual footage of Bram Stoker writing this novel:If Stoker had just got to the point, this book would have been much more exciting and suspenseful. I understand the exact same mysterious thing happens night after night. I understand that Dracula has some boxes of dirt. I get that you brought Winchester rifles along for protection. Each of these things was repeated ad nauseam throughout the book. Talk about killing the pace - by the time the gruesome scares came I was very disengaged. Also, funny thing about this book as a horror story - it must be the grandfather of heading up the stairs to hide instead of running outside or cutting through the graveyard shortly after hearing a serial killer is loose. They keep leaving people alone even though those people are repeatedly attacked when they are left alone. Then, when they finally insist on guarding someone, that person insists that they need no one but God to guard them!? Seems like so far God had not been interested in protecting, so why count on him starting now!?So three stars because it is a classic and I like the story. I especially like Lucy's suitors - their gung ho manliness amuses me. But the repetition and the illogical behavior in the face of a bloodsucking monster are the cause of the removal of a couple of stars."}, {"userName": "Mohammed Arabey", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "[\"الريفيو المبدئي اول ماشفت الروايه في معرض الكتاب في الاسكندريه اسبهليت من ضخامتها\"سواء عدد صفحات او حجم قطع الكتاب نفسه\"ايه ده.كل دي روايه دراكولا؟اينعم كلاسيكيات ومش كلاسيكيات وبس بل اشهر كلاسيكيات الرعب في العالم \"المفروض اكتب العالم بحروف كابيتال لاني مع ان دي كلمتي المفضله بس المره دي مش مبالغه\"دراكولا دي اترجمت واتعدلت واتلعب فيها من مليون مؤلف ومؤلفه سواء كتب افلام مسلسلات واي حاجهمكنتش ناوي -اذا حصل وجه يوم اقول اقراها - اني اقراها مترجمه..انا بحترم دكتور احمد خالد توفيق وبعشق معلوماته عن الروايه دي في اغلب كتاباته بس برضه مكنتش حقراهاله مترجمه مش قله ثقه فيه لكن عشان دور النشر.بس المفاجأه هنا ان المترجمين 2 وكمان اخوات و عليهم اشراف كمان من طرف تالت..ولاني لاول مره اسمع بيهم قلت اقرا عن النسخه وهل مترجمه تمام ولا لا؟ لقيتهم مش بيوعدونا بترجمه دقيقه وكامله للروايه الاصليه لبرام استوكر وبس وانما كمان بيعودونا في الكتاب\"العملاق\"ده باضافات بصراحه اول مره اسمع عنها تضيف الكتير للكتاب زي مابيقولوا .حاجه فعلا تشجع ان الواحد يجيب الروايه مترجمه المره دي باين كده اني حجيبها بس في ملاحظه بس اخيره..دي الطبعه الاولي وان كنت شايف ان الغلاف مرعب بس كان عايز تاتش بروفشنال كمان زياده زي صوره المؤلف ورا وكده و صبغه بطريقه تناسب قوه محتواه اللي باينه من المكتوب ورا..او حجمه الاكبر من الروايات البيبرباك العاديه - تقريبا بحجم الهارد كفر الكبير- بس شكلي مش حقدر استني طبعه تانيه و حجيبه ..مستني اراء الناس هنا قبل مالمعرض عندنا مايخلص عشان اقرر  :) (hide spoiler)]"}, {"userName": "Ginger", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "I want to suck your blood!!What an amazing Gothic classic to listen too!So, I finally did it. I took on the granddaddy of all vampire books. I decided to listen to this one instead of reading it due to a great recommendation from a friend on here.Thanks Terry!I think this was a great decision to do since the characters in the audio book were excellent, especially Susan Duerden. Her voice was beautiful and mesmerizing as Lucy Westenra! All the narrators did such a great job with each character.The reason that I didn’t rate this higher than 4 stars was Bram Stoker got a bit repetitive and tedious at times. Boxes of dirt was used a bit too much among other things in the story. I get it Stoker, he needed a place to lay his head. 😉🤣But in all honesty, I’ve got to give him a break about the repetitive part since this was wrote in 1897. Did they even have editors back then?!Well done Stoker on writing such a well-loved book that has tested the age of time and public opinion. I mean, who doesn’t love vampires or at least has heard about them?!He basically created the legend.Or did he? Bau ha ha ha! 😈😈Fellow readers, if you’ve not read this or listened to the audiobook, get to it one day. Check it off the list. I don't think you'll be disappointed!"}, {"userName": "Jason Pettus", "userReviewDate": "Apr 19, 2008", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted here illegally.)The CCLaP 100: In which I read a hundred so-called \"classic\" books for the first time, then write reports on whether or not I think they deserve the labelBook #13: Dracula, by Bram Stoker (1897)The story in a nutshell:To best understand the storyline of Dracula, it's important to imagine yourself as an actual citizen of 1897 when the book was written, and then imagine one of your friends positing the following question: What if some of the horrible monsters mentioned in old Gothic literature from centuries past were actually real, and what if one of these ghouls decided one day to move to your hometown? Because that's the entire premise behind Stoker's original plotline, something easily forgotten in our modern times when even the 1800s look quaint and historic; that the real thrill of this novel to his contemporary fans was not just the premise of a blood-sucking vampire living somewhere in the bowels of eastern Europe, but that this vampire decides to pack up and move to 1897 England instead, mostly because after hundreds of years of killing, the people of his section of the world have finally caught on that he's an inhuman monster. That's what takes young goofy lawyer Jonathan Harker at the beginning of the book out to the wilds of rural Transylvania; it's his firm that's helping this reclusive member of the aristocracy transfer property and money and the like into the English legal system, and as the most junior member Harker is the one assigned to actually transport all the finished documents out to Dracula's spooky family castle in the middle of the Carpathian Mountains, for his final okay and signatures.Ah, but the Count turns out to not be exactly what he seems, with creepier and creepier experiences finally culminating with an attack on Harker's life, the stealing of Harker's information by Dracula, and a whirlwind sea voyage to the pastoral English coastal village of Whitby, where Harker is originally from and where his plucky fiance Mina patiently awaits his return. (All of this, by the way, is told not through a traditional omniscient narrator and standard dialogue, but through a whole series of written documents such as diary entries, letters, newspaper clippings and more, coincidentally making Dracula one of the best-known examples of what's called an \"epistolary novel.\") As you can imagine, chaos soon ensues in Whitby, as the Count takes up residence at the local abandoned Medieval abbey on the edge of town and starts turning various young sexy girls into zombie slaves through repeated erotic bloodletting rituals, with no one there understanding what's going on because of course none of them living in a world yet where vampires are a well-worn cliche.Thinking that his beloved has fallen under a rare disease, one of these Whitby residents calls in a friend of his from Amsterdam, the Indiana-Jones-like exotic-disease specialist and world traveler Abraham Van Helsing, who quickly realizes that this quaint seaside resort town in fact has a vampire on its hands. This leads to a whole series of action sequences, fight scenes, chase scenes, a trip back over to eastern Europe, and all kinds of other details I won't spoil; needless to say, things come to a \"head\" (ha ha) back at Dracula's Transylvanian castle, leading all to a nice old-fashioned \"good guys definitively win\" ending, perfect for the moralistic times in which Stoker lived.The argument for it being a classic:Oh, there are all kinds of reasons to argue for Dracula being a classic; just for starters, it's a fine example of the Romantic/Victorian novel, not to mention one of those projects in the 1800s to first help establish the so-called \"weird\" genre (eventually leading us to such modern subgenres as horror, science-fiction, goth and more). It's also one of the first books, fans claim, to present a truly complex and unpredictable main female character -- Mina Harker, that is, who it could be argued is much more the hero of this tale than the globetrotting vampire-killer Van Helsing -- although none of this should really come as a surprise, given that author Bram Stoker's mother was the famous early feminist Charlotte Mathilda Blake Thornely. Plus, it's one of the most adapted stories of all time as well; according to the Internet Movie Database, for example, over 100 films now exist with vampires as their main theme, with close to 650 movies now at least mentioning vampires in one way or another, all of them single-handedly because of Stoker and this particular novel*. And if all this wasn't enough, fans argue, the book remains a surprisingly thrilling one to this day, and surprisingly scary for a story that is now 111 years old and counting.The argument against:Like many Victorian novels, critics claim, reading the 400-page Dracula anymore is bound to make you think of that line from The Simpsons, when Homer meets British comedian Ricky Gervais: \"You take forever to say nothing!\" That's not necessarily bad, just that it makes the book hard to enjoy as a simple piece of pleasure-reading; like many other books now reviewed for the CCLaP 100, it makes Dracula historically important and a book that genre fans should definitely tackle, but not necessarily a \"timeless classic\" that everyone should make their way through at least once before they die. Not to mention, there's that little matter of the 750 films that have now referenced vampires throughout the decades, the thousands of books and television episodes, the countless Dracula costumes worn to endless Halloween parties; when the details of a book become this much an ingrained part of our entire culture, critics claim, it makes trying to read the original book an exercise in frustration, in that you already know in your gut just about everything that's going to happen (not to mention every single surprise Stoker laid for his then-unsuspecting 1800s audience). Again, it makes the book no less important from a historical and scholarly point, but unfortunately just not a book that the general populace should feel like they need to tackle themselves.My verdict:So let me mention this before anything else, that after four months now of regular Victorian-novel consumption because of this essay series, how surprisingly more modern and complex Dracula is than many of its contemporaries; it is a much more readable book than many others written in the late 1800s, featuring characters that sometimes are much more complex than usual for a moody Romantic tale, and with a shocking level of gore that has been quietly excised from the Dracula legend over the years by Hollywood and others. (For example, in the original novel they not only would pound stakes through the hearts of vampires to kill them, but shove garlic down their throats and cut off their heads, not for any supernatural reasons but to simply make sure the stupid things were actually dead.) Now, that said, as a fantastical novel from the Romantic period, Dracula certainly does ramble on in overly flowery language a lot more than we 21st-century readers are used to, and especially that self-satisfied blowhard Van Helsing -- yes, we get it, ya Dutch freak, you're a vampire expert, now shut up shut up shut up! And it certainly will hold almost no surprises to the modern reader either, at least regarding the fact that Dracula is a vampire and what exactly a vampire is (a major point of suspense to Stoker's original audience, in that Dracula isn't revealed to be a vampire in the novel until halfway through). Still, though, all in all the surprising strengths of this book ended up outweighing the expected weaknesses, which is why today I'm confidently declaring Dracula a classic that is definitely worth your time and attention.Is it a classic? Yes*Now, that said, please be aware that the vampire myth itself existed long before Stoker wrote about it in Dracula, simply that it was an obscure legend little known outside of the academic community; like I said at the beginning of this essay, that was Stoker's entire point, to take a supernatural concept from old Medieval literature and transport it into the \"modern\" world. In that sense, then, you can see how such projects from our times like Interview with the Vampire and Buffy the Vampire Slayer are actually a lot more faithful to Stoker's original premise than you might've realized."}, {"userName": "Lola  Reviewer", "userReviewDate": "Apr 24, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "[ (hide spoiler)]"}, {"userName": "J.G. Keely", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "Almost every author will fall into one of two camps: the active, and the reactive. The active author looks at the world around them and decides to write about what they see. They sit down and think: \"I'm going to write a story, the subtext of which will provide my analysis of Victorian sexual mores\". They then construct the story around this theme, creating characters to show different aspects and constructing a plot which moves from general observations to specific insights.Then there are the reactive authors. These tend to sit down to write a story without necessarily thinking about what the characters or story mean. Reactive authors will often still touch on the same themes as active authors, but instead of deliberate explorations, we get the author's gut reactions.In the Late Victorian, one of the ideas that concerned many authors was the 'New Woman', who was a proto-feminist: she was active, controlled her own life, considered marriage a partnership instead of a master/subservient relationship, took pleasure in her own sexuality, and took part in traditionally male activities, like science, writing, and carousing.Since Stoker is a reactive author, we do not get a deliberate analysis of the New Woman: we don't get a view of how she came about, of what drives her or differentiates her, or of what she might mean for the future of sexual politics. Instead, we get the reactive view: a certain thrill in the sexual freedom she represents, but in the end, she is condemned for being frightening--she is too difficult to control, she does not fit in.The reactive view is nebulous, switching back and forth, never getting to the heart of the matter. Stoker does not include the New Woman because he understands her, but because she troubles him. This applies equally to his other recurrent themes: foreign vs. British identity, homosexual and other non-familial desire, scientific innovation, and ancient mysticism.He includes these things not because he has some insight to reveal to the reader, but because they are concepts he cannot cease bringing up. They are a part of his world, and so he depicts them. These depictions shift and change with his reactions: homosexuality is first condemned, then pitied, then hinted at enticingly, then condemned again.It is one of many things which Stoker desires to speak about, to puzzle through, something which both intrigues and unsettles him, which he cannot help but return to whenever he considers humanity. It is a habit formed by deep emotional connections and powerful memories. He is lost somewhere between the grotesque fall of his former friend Oscar Wilde and his lifelong worship of Wordsworth, whose celebration of homosexuality was an open secret.Unlike Byron, Shelley, and Polidori, who inspired Stoker's tale of Gothic horror, Stoker is not certain what he thinks about the world he lives in. He does not have a philosophy or a voice, he is just a man trying to make it through a world which he cannot come to terms with.It is not an ideal situation for his characters, who must shift with the movement of the tides. The only consistent personality is Van Helsing, who is too ridiculous and overblown to get lost in the text. The others all move from one extreme to the other: now subverting Victorian ways, now upholding them. The longer the story goes on, the more they become a collection of names, losing any distinct identity. Though Stoker works in broad strokes, the characters are not unsympathetic or stupid, but they are there to serve the story, wherever the winds may list.Dracula, himself, is mostly absent: our heroes try to create an identity for him with their fears and assumptions, but none are very certain that their assumptions about Dracula are correct. They point out several times that their own violent hunt for the count is not terribly civilized or sane, and may not be any more justified than Dracula's own need to feed. What carries them along every time is their own self-righteousness--but coming from such scattered, unsure characters, it is hardly a convincing justification.There is a lot of elbow room in reactive books, because there is no distinct heart to the story, no central philosophy driving it--which appeals to a certain breed of academic: Stoker touches upon most of the controversial topics of his day, but never creates any definitive view of them. Things are truly open for interpretation, and the critical works in this collection take full advantage.First Dracula is homosexuality, then he represents a gender switch, then he is the capitalist monopoly which destroys fledgling British Utopian Socialism--and certainly, all these are unconscious influences on Stoker, but it is too much to say that Dracula is any one of them. He is a collection of fears, insecurities, desires, and popular topics thrown in by Stoker as they came to him.Most of the critics seem to recognize that Stoker was no great thinker--just an average, well-off, educated man with some talent for flowing prose. This being the case, it feels silly for them to declare one argument or another fundamentally sums up the text. Many think a declarative style lends strength to a somewhat vague analysis, but as a New Historicist, I prefer the critic give the author only as much credit as seems warranted.That isn't to say there isn't a great deal to be gleaned about the period from Stoker--indeed, his insecurity often reveals much more than he intends--but we can only learn as much as we might from talking to the average man of the period, as opposed to studying the expert opinion of an 'active' author.As a story, it is entertaining, and the reader may be surprised at how different the original vampire is from the one we are now familiar with. There are some aspects of the book that I think would be interesting to see in film, but there are many other winding, long-winded passages which are better left out. The book goes rather slowly in the middle, maintaining roughly the same conflict with no new developments, and we are reduced from several different epistolary views to a more-or-less streamlined, neutral voice as the bland heroes grow more uniformly alike.The conclusion is rather abrupt, and we never do get to a real showdown to match all the buildup of Dracula's many-faced evil, but this makes sense. Since Stoker is unsure precisely what he means to get at with his book, we can hardly expect him to create a viable, satisfying conclusion. The ending is certainly final, but it is not a decisive advance upon the book's themes, but a safe retreat to normalcy.As all horror authors must, Stoker reaches for his own fears and insecurities to drive his story along, but he is not a self-searching man, so when he comes to the time for an ending, he instinctively rejects all of the vague things which unsettle him, trying to do away with them suddenly and violently, as befits a man who is out of ideas.And so, the showdown the story deserved is absent--we never face Dracula in his own domain, under his own power. His dark castle remains shut up, and the mystery of who he was and what motivated him is left unconquered. Due to one of the many small errors which permeate Stoker's text, even the conclusion can be called into question.Though we are assured that life has returned to normal, that things are now safe again for the straitlaced Victorian family--that homosexuality, feminine power, foreign influence, and pagan mysticism have all been destroyed--the assertion rings hollow, because Stoker never deals with any of these fears. He never manages to meet them with the right tools to overcome them. In the end--and as we always suspected--Dracula is simply too pervasively perverse for the upright Victorian man to kill, because as an average Victorian man, Stoker simply doesn't know where to strike. Like too many conservative thinkers, he has cultivated his own naivete by avoidance until he cannot comprehend how to oppose his enemy.So Dracula lives on in our world, growing in power, his vast array of subversive powers getting stronger with time. He withstands the full force of Victorian ideals, then outlasts them, watching them crumble. It shouldn't have been surprising: as Byron, Polidori, and Shelley all hinted, it wasn't Dracula who was the myth, but Victorian morality. It isn't heroic to oppose sex and death, it is tragic: strike them as hard and as often as you like, then watch them rise again. And so Dracula does."}, {"userName": "Lyn", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "When I talked to my high school English teacher about my experience reading this, and how it compared to the racy Canterbury Tales, she made an erudite and astute observation, \"Human nature doesn't change\". This changed the literary landscape of horror writing since. Sexual, sensual, creepy and still terrifying today.This review, published in June 2015, is dedicated to a truly great man, Sir Christopher Lee, who passed away in 2015. Sir Christopher portrayed Dracula in the 1958 film Horror of Dracula (with Star Wars co-veteran Peter Cushing).Fair winds and following seas."}, {"userName": "Fernando", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "“¡Sea bienvenido a mi morada! Entre por su propia voluntad, entre sin temor y deje aquí parte de la felicidad que lleva consigo.” Pocos mensajes de bienvenida son tan geniales como este en la literatura. Considero que junto con la recepción que le hace el gato de Cheshire a Alicia en el país de las maravillas (\"Estamos todos locos aquí. Y si tu estás aquí, es porque también estás loca\") transforman en algo imborrable el recuerdo que uno tiene de libros estos tan clásicos, brillantes y queridos por los lectores de todo el mundo.Luego de leer “Drácula”, debo reconocer la inmensa vigencia que posee este libro de Bram Stoker. Y no me refiero a esa vigencia que supo conseguir gracias a la infinidad de películas que aparecieron después de su publicación en 1897, desde “Nosferatu” de Murnau, allá por 1922, Bela Lugosi en 1931, que murió creyéndose que realmente era Drácula, las infinitas caracterizaciones de Christopher Lee en los ’70, hasta la que retrata más fielmente al libro, me refiero al film de Francis Ford Coppola de 1992, entre otras. Particularmente en mi caso, y luego de haber leído un poco tarde el libro a mi entender, y me refiero con esto, me fue casi imposible despegar de mi mente la imagen de Anthony Hopkins como Van Helsing, a Keanu Reeves como Jonathan Harper o a Winona Ryder al imaginar el semblante de Mina Murray. Pero no son las películas, sino este gran libro lo que me ocupa en esta reseña.Le llevó siete años a Bram Stoker escribir Drácula y si bien podemos pensar que recaló parte de su inspiración en otras novelas y cuentos sobre el vampirismo, logró forjar la imagen de Drácula tal cual la tenía pensada cuando el título del libro originalmente era “El no-muerto”.Los orígenes del vampirismo como tema en la literatura deben remontarnos primeramente al cuento “El Vampiro”, de John Polidori, el cual surgió luego de esa amable sugerencia de una competencia literaria que le propusiera a este autor el poeta Lord Byron (Polidori era su médico) y a dos emblemas del romanticismo como fueron el poeta Percy Bysshe Shelley y la que sería su esposa, Mary Goodwin, quien con el apellido de su esposo, daría a luz a otro monstruo célebre: Frankenstein. Todo esto forma parte del libro Fantasmagoriana, corto libro que incluye esos cuentos y que recomiendo leer.Otro propulsor del género fue uno de los iniciadores del Romanticismo en Alemania, me refiero a E.T.A. Hoffmann con su cuento “Vampirismo” y por último a un gran autor gótico de cuentos y novelas de fantasmas a quien yo admiro mucho: Joseph Sheridan Le Fanu. Su famosa novela “Carmilla” trata también del vampirismo, con el aliciente de que es una mujer la que ocupa el lugar del conde en esa historia, que roza ciertos peligrosos bordes lésbicos, sobre todo para el año en que se publicó: 1872. Cabe destacar que si bien, Stoker puede haberse inspirado en estas historias, a la postre terminará diferenciándose claramente de todos ellos (aunque personalmente creo que no se despega mucho de Carmilla en cuanto a los atractivos de índole sexual que Drácula insinúa), dotándole al conde de todos los atributos sensuales atractivos que tiene a su alcance para atraer a las mujeres bajo su poder como así también de los demoníacos, que utiliza para infringir daño a todos aquellos que quiere dominar y vencer.Es que Drácula encierra la la encarnación de todo lo maligno que hay en el hombre y a la vez desnuda todos esos miedos que nos han acompañado desde el origen de los tiempos, sobre todo el miedo a lo desconocido, algo que Mina transforma en atractivo, cuando en parte de su diario dice: “Omne ignotum pro magnifico. Todo lo desconocido parece maravilloso.” El mismo Drácula supo ser un hombre que fue corrompiéndose moralmente para terminar siendo la abominación en la que se convirtió. Es que, es inevitable aceptar que uno teme a lo desconocido, hasta que comprueba que eso es tangible y nos afecta directamente de buena o mala manera. Como en toda novela con un villano bien definido tenemos en danza varios personajes alrededor del mismo y cuya trascendencia es tan importante como la del primero.El libro cuenta con los personajes necesarios para que todo funcione correctamente, ya que además de los tres principales, encontramos otros que son clave a la hora de cerrar el círculo de la trama y me refiero a doctor John Seward, Lucy Westenra (quien será eje fundamental de la historia para entender por qué suceden tantas cosas), Arthur, su prometido, el americano Quincey Jones y por último Reinfeld, el loco encerrado en el manicomio de Seward, debido a su relación con el conde, quien lo tiene bajo su dominio. Una característica interesante que saca a la novela de las tradicionales formas de escritura ya que está narrada en forma de diario personal, de cartas, a partir de artículos periodísticos e incluso telegramas y memorandums. Es atractivo encontrarnos con esta forma en la que Stoker escribió el libro, puesto que nos ayuda a \"hilvanar\" lo que sucede para entender la historia. No es el único ejemplo de libros escritos de esta manera, de hecho, me vienen a la mente otros dos, como por ejemplo \"Pobres Gentes\" de Fiódor Dostoievski y \"Las penas del joven Werther \", de Johann von Goethe, aunque estos están relatados puntualmente en forma epistolar.En estos tiempos que corren, me refiero a este siglo XXI y después de tantas películas de terror (y hago referencia nuevamente al cine como método de ejemplificar lo que genera el miedo visual, a través de la pantalla) es difícil que uno se asuste absolutamente con ninguno de estos libros que otrora causaban escozor y con ello puedo nombrar a autores que hicieron un culto del género como Poe o Lovecraft, pero debo confirmar que si bien no sentí \"miedo\", si pude compenetrarme totalmente con la historia a partir de lo que cuenta Jonathan Harker durante su estadía en el castillo de Drácula, a principios de la novela. Cuando relata el momento ve al conde reptando cabeza abajo las paredes del castillo, reconozco que es excelente la forma en que lo que Stoker ha escrito, ya que junto con la descripción del ataque a Lucy Westenra, ya convertida, me parecen momentos magníficamente narrados. La elección de ciertas características del Romanticismo, sumado a ambientes góticos, personajes inolvidables y mujeres fatales y terroríficos sucesos extraordinarios contra los que batallan hombres ordinarios renuevan el brillo de un clásico tan único como inolvidable.\"Aprendemos de los fracasos. No del éxito\", dice Stoker a través del personaje de Van Helsing. Puede que en su caso haya sido así, ya que como tantos otros escritores (Melville, Kafka, Poe), el éxito le resultó esquivo y podrá decirse que sólo fue reconocido por este libro. Pero al final, triunfó. El mismísimo conde Drácula, a partir de litros de sangre derramada a lo largo de los años, se encargó de ubicar a Bram Stoker en el sitial que se merece dentro de la literatura: entre los grandes."}, {"userName": "Paul Bryant", "userReviewDate": "Sep 25, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "If I was Bram Stoker I’d remake the old Melanie hit – remember this one?Look what they done to my song, ma look what they done to my song well it's the only thing that I could do half right and it's turning out all wrong ma look what they done to my song Which the Count would have sung asUite ce au facut sa ma cantec, mamaUite ce au facut cintecul meu e singurul lucru care i s-ar putea face jumatatedreptate si e intorcandu-se in toate regula mama uite ce au facut sa ma cintecReviewing Dracula in this twilight age of loin-thrustingly pert young vampettes and vamparistas is like extolling the sexual allure of Clara Bow and Jean Harlow. Dracula was the first “grown up” book I ever read. Hey, 12 year old PB, good choice! It made my pulse pound and my skin horripilated madly. But I do not think this would happen to a modern reader. Poor old recycled Dracula, rewritten, cartooned, parodied, Buffyfied, sliced, diced, crimped, carved, and ripped off in every one of a million ways, undead you were and undead you still are, if only as a Halloween costume and a footnote to an essay about Stephanie Meyer.Given all of that, and given the high Victorian never use one word where a bucketful will do style of Mr Stoker, I still think it's worth five of my stars. It seethes with that wonderful sexual hysteria the Victorians loved writing about, from Wuthering Heights to Dr Jekyll and Mr Hyde. They couldn't mention anything directly so they did their best with linguistic nodding and winking, and much mention of purity, and chasteness and its opposite unchasteness. Bosoms were okay, anything beneath waist level was absolutely not, until you got to shapely ankles and well-turned feet. So you can see they were gagging for it, and the writers were ferociously finding metaphors for writing about sex; and Bram Stoker found vampires. The strong sick pall of sexual dread which suffuses Dracula like a London pea-souper is seduction. This is what Stoker wants to write about - seduction and sexual enslavement, or, why do good girls fall for such very bad men? The Count is the embodiment of all seducers. He comes around at night and he gets into your fiance's bedchamber, so naturally you have to drive a big phallus right through his heart. I get that. Bram Stoker is practically frothing about all of this.  Bram Stoker invents most of the trappings of vampires right here and throws in a handful of the most outrageous scenes (three beautiful young female vampires in the dead of night overheard squabbling about who should get the baby they have got in the bag they're holding up; three men all giving one woman a blood transfusion using only a rubber hose; the Count scrabbling up a castle wall as fast as a man could run, all great stuff).I say read Bram Stoker, read Let the Right One In, and step delicately around Twilight."}, {"userName": "Madeline", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "FINALLY finished it. Assigned reading, in addition to being painfully boring, takes away serious time from The List. Anyway, on to the bit where I review the book: it wasn't exactly what I was expecting (for instance, the whole novel consists of diary entries and letters written by the main characters - not Dracula, though), and no one even says the word \"vampire\" until page 165. And they're talking about the bats. It was genuinely creepy, but the towards the end of the book the pace suddenly overdosed on NyQuil and started riding a sloth towards the climax. (why does that sound like a porno? Ahem, moving on) Seriously, our merry gang of vampire hunters have figured out that Count Dracula is, in fact, a bloodsucker (took them long enough; I spent the first half of the book mentally screaming at the pages \"He's a fucking vampire! Vampire vampire vampire!\"), and are traveling to Transylvania to go all Buffy on his undead ass. Great, but first we have to read pages and pages of \"and then we made our travel arrangements\", \"and then we bought lots of fur coats because it is cold out\", and \"we were all super patronzing to Madam Mina, because in case you've forgotten she is a delicate flower and her weak lady-brain cannot handle the stress of this trip.\"Let me talk about Mina for a minute here: after finishing the book, I'm very, very tempted to write a Dracula fan fic entitled \"Mina Harker: Vampire Hunter\". She will be super badass and wear lots of leather and kill tons of vampires (first on her list: Carlise Cullen), and I guess Jonathan can come too. I want to do this because, for the entire book, I kept waiting for Mina to unleash her inner awesome, because I knew it was there. She's super smart - she's the one who figures out how Dracula is getting back to his castle - is actually really brave, no matter how often she says she was scared shitless by the various undead goings-on; and since she has a psychic connection with Dracula towards the end of the book she's a hell of a lot more useful than Jonathan's whiny ass. She needed to leave him, and then run away with Van Helsing so they could fight vampires together. It would look exactly like thishttp://api.ning.com/files/RC0Zuusf3l-...and it would be MADE OF AWESOME."}, {"userName": "Matt", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "As the eerie time of All Hallow’s Eve approaches, I felt that it was high time that I finally tackle this novel, which a good friend of mine strongly supported as well. Young solicitor Johnathan Harker finds himself travelling through the Hungarian countryside and into Romania, on his way to a castle in the heart of Transylvania. There, one Count Dracula awaits Harker and proves to be an odd, yet amenable, host. Seeking to finalise a land deal in England, Harker and Dracula talk long into the night, though the former feels that there is something odd about his host. It is only when things occur that Harker realises that Count Dracula is nothing like any man he has met before and eventually escapes the confines of the castle. Back in England, Harker’s fiancée, Mina, and her close friend, Lucy, are going through their own ordeals. Lucy Westenra suffers through significant bouts of sleepwalking. The two women travel seaside to clear their heads, but Lucy encounters someone the reader knows to be Dracula during one of her sleepwalks and is eventually discovered with two minute puncture holes on her neck. Unsure of what to do, Westenra is sent to see Dr. Johnathan Seward, one of her suitors and director of the local mental hospital. When Dr. Seward cannot deduce all of these symptoms, he calls upon the renowned Dr. Abraham Van Helsing in Amsterdam to consult. When Van Helsing arrives and begins some of his early queries, he is highly interested, though cannot be completely sure that he has a diagnosis of yet. Slowly, Lucy begins to fade from his mysterious neck injury and eventually died of her injuries, though her body transforms into a vampire of sorts, paralleling some of the actions Count Dracula is known to have been committing. Van Helsing works with Seward to locate the body and it is at this time that the Dutch doctor deduces that there is something eerie at work. Studying the situation before him, Van Helsing proposes the seemingly barbaric act of driving a stake through Lucy’s heart and then decapitating her, which is the only way to ensure that her spirit will be freed, according to some of his research and ancient lore. Done with that issue, but still needing to resolve the larger concern at hand, Van Helsing gathers a group to hunt down the Count, who seems to have taken up residence in England, and drive him back to Transylvania. Lurking in the dark and gloomy areas of Eastern Europe, Van Helsing prepares for the fight of his life, armed with only the most basic medicaments, in hopes of slaying this monster once and for all. Stoker lays the groundwork for a truly bone-chilling tale that has stood the test of time. I would highly recommend this to anyone who has the wherewithal to delve deep into the heart of a sensational 19th century story of horror and mayhem.I am still kicking myself that I have not, until now, ever read this sensational piece of fiction. Surely one of the early stories that has fostered such a strong tie between Dracula and Hallowe’en, Bram Stoker’s work proves to provide the reader not only with thorough entertainment, but leave a shiver up their spine every time they enter a dark room. With a cast of powerful characters, Stoker weaves his tale in such a way that the story never loses its momentum. Harker, Seward, and Van Helsing are all well-crafted and provides powerful contrasts throughout the narrative, while Count Dracula is not only eerie in his presentation, but also one of the scariest villains in 19th century literature. There need not be outward descriptions of gore and slaying to get to the root of the suspense in this novel, which seems to differ from much of the writing in the genre today, where gushing blood and guts peppers the pages of every book imaginable. The narrative is also ever-evolving throughout, helped significantly by the journal-based writing that Stoker has undertaken. The reader is transported through the story using these varied perspectives (and some press clippings), rather than a straight delivery of the story from a single point of view. This surely enhances the larger package and does much to provide the reader with even more fright, at certain times. There are surely many stories taking place here, some of which deal directly with the issue at hand (read: Dracula), while others seem to solve themselves throughout the numerous journal entries. Whatever the approach, Stoker captivates the reader such that there is a strong desire to know how it all ends and if Van Helsing lives up to his more colloquial moniker of ‘Vampire Hunter’. I wish to add for those who wish to take the audiobook approach, as I have done, the Audible version, with a full cast (including Alan Cumming, Tim Curry, and John Lee), adds yet another dimension to this story and should not be discounted. I am so pleased to have had this book recommended to me and find that it is the perfect fit to a ‘equinox’ read for me to complete my book challenge. Kudos, Mr. Stoker, for such a riveting piece. I can only hope to find the time to read some of your other work, as well as that of your descendants, who seem to want to carry the torch and provide more Dracula for the modern reader.This book fulfills Equinox I (A Book for All Seasons) Book Challenge for Topic #6: A Book That Relates to the Current Equinox Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Char", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "I believe this was my third read of this book, but the only time I've listened to it on audio. This was a full cast performance and it was excellent. I highly recommend it to horror fans that dislike reading in epistolary form, the voicing here really brings the diary entries and letters to life. Highly recommended for fans of classic horror stories!"}, {"userName": "Maddie ", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/55751376-maddie", "userReview": "I loved Always said I will read and decided this year why not ?"}], "description": "A true masterwork of storytelling, Dracula has transcended generation, language, and culture to become one of the most popular novels ever written. It is a quintessential tale of suspense and horror, boasting one of the most terrifying characters ever born in literature: Count Dracula, a tragic, night-dwelling specter who feeds upon the blood of the living, and whose diabolical passions prey upon the innocent, the helpless, and the beautiful. But Dracula also stands as a bleak allegorical saga of an eternally cursed being whose nocturnal atrocities reflect the dark underside of the supremely moralistic age in which it was originally written -- and the corrupt desires that continue to plague the modern human condition.  Pocket Books Enriched Classics present the great works of world literature enhanced for the contemporary reader. This edition of Dracula was prepared by Joseph Valente, Professor of English at the University of Illinois and the author of Dracula's Crypt: Bram Stoker, Irishness, and the Question of Blood, who provides insight into the racial connotations of this enduring masterpiece.", "title": "Dracula", "url": "http://www.goodreads.com/book/show/17245.Dracula", "average": 3.98, "cover": "https://images.gr-assets.com/books/1387151694l/17245.jpg", "reviews": 19085, "authors": [{"url": "https://www.goodreads.com/author/show/6988.Bram_Stoker", "name": "Bram Stoker"}, {"url": "https://www.goodreads.com/author/show/28273.Nina_Auerbach", "name": "Nina Auerbach"}, {"url": "https://www.goodreads.com/author/show/44926.David_J_Skal", "name": "David J. Skal"}], "type": ["Classics", "Horror", "Fiction", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/17245.Dracula", "http://www.goodreads.com/book/show/22499618-dracula", "http://www.goodreads.com/book/show/6647732-dracula", "http://www.goodreads.com/book/show/1769535.Dracula", "http://www.goodreads.com/book/show/297823.Dracula", "http://www.goodreads.com/book/show/926414.Dracula", "http://www.goodreads.com/book/show/72485.Dracula", "http://www.goodreads.com/book/show/10483223-dracula", "http://www.goodreads.com/book/show/989088.Dracula", "http://www.goodreads.com/book/show/15748764", "http://www.goodreads.com/book/show/6370801-dracula", "http://www.goodreads.com/book/show/588495.Dracula", "http://www.goodreads.com/book/show/10250276-dracula", "http://www.goodreads.com/book/show/17226373", "http://www.goodreads.com/book/show/6250997-dracula", "http://www.goodreads.com/book/show/28946077-dr-cula", "http://www.goodreads.com/book/show/13493042-dracula", "http://www.goodreads.com/book/show/10511555-dracula-s-guest", "http://www.goodreads.com/book/show/70985.Dracula_s_Guest_and_Other_Weird_Stories", "http://www.goodreads.com/book/show/35819.Lair_of_the_White_Worm", "http://www.goodreads.com/book/show/18278171-dracula-and-other-horror-stories", "http://www.goodreads.com/book/show/543300.The_Jewel_of_Seven_Stars"]}