{"ratings": 13, "userreviews": [{"userName": "Amber", "userReviewDate": "Jun 13, 2015", "userURL": "http://www.goodreads.com/user/show/23016460-amber", "userReview": "Marin Picault is summoned back to her hometown of Saint Toulere, Louisiana by her grandmother Tante Louise who asks her to come investigate the murder of her Cousin Francis using her gift of communicating with the dead. Marin Hesitantly comes even though her ex-boyfriend Trent is there and won't leave her alone once she hits town. Can she discover who murdered her cousin before she is next? Read on and find out for yourself.This was a pretty good Paranormal mystery novel that I got for free on Smashwords. If you'd like to check it out for yourself, go look for it on Smashwords and amazon and I hope you enjoy it."}, {"userName": "Linda Marie Marsh", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/33245752-linda-marie-marsh", "userReview": "I don't know how she did it...how the author drew me in and planted my feet firmly in Louisiana with Marin, the main character! A rare talent for sure.Marin is a psychic who left her roots, her home for life in Canda years ago. But she's back. And lordy let the intrigue begin!A family curse...voodoo..romance...deception....it's all there.I hope there is a part two...i'd like to get to know certain characters better- like her cousin Charlie and Tante Louise.When is the movie being made hmmm????"}, {"userName": "Kristi (Books and Needlepoint)", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/1699270-kristi-books-and-needlepoint", "userReview": "This is what I consider a good Gothic mystery! There is murder, ghosts, voodoo, a long-standing feud, big old houses, creepy basements and all set in Louisiana, of course. I did get a little confused what with all the names, both living and dead that we are introduced to, but it becomes clearer as the story progresses. First you have Marin and Charlie (Charlene) who are cousins. They both suffered the loss of a parent, Marin's mom and Charlie's dad, who died together in a car crash. They love each other fiercely and watch each other's backs. Then there is Tante Louise, who is their Aunt. She has certain \"gifts\", which Marin think are questionable, but she does have the gift of sticking her nose in and figuring things out. She tends to work alone though and this worries Marin, as her Aunt is in her 70's. Marin begins having dreams about the Baulliere family before Charlie even visits to try to get her to come home. She tends to stick her nose in places she probably shouldn't because of these dreams as well. She is being visited by Marguerite in her dreams, but can't figure out why, or what Marguerite Picoult is trying to tell her. Combined with Charlie telling her that Ash Baulliere wants her to come figure out what the ghost of his Uncle Francis is trying to tell him and Marin knows she must return home. With the help of both the living and the dead, a family history is woven together that will bring light to secrets that have long been buried. I like Gothic mysteries and this one didn't disappoint!"}, {"userName": "Jackie", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/7088767-jackie", "userReview": "Dying to Dream is a roller coaster of a mystery. From the moment we meet Marin we know she is different. She has a talent. The psychic talent of connecting with ghosts or spirits while she sleeps. Though this can be very inconsistent. When Jack Robesaux is found dead it sets a whole slew of events in motion. Most of these events encircle Marin and Marin’s family. It is from this moment on that we know that this story is not your everyday mystery. This mystery with a bit of paranormal thrown in was unique and entertaining. I highly enjoyed the characters and the story. Though this story was entertaining I did find that at times the paranormal seemed just thrown in there. I feel this story probably could have been done without Marin being a psychic but it did add a level to both the story and the characters that produced a nice depth. I enjoyed all the characters from Marin to Trent to Tante Louise. They were all very well-written and grew as the story went on. Even though I felt the story was fluid, entertaining and well-written I felt that in the end the story fell a little flat. It tied up all the loose ends but some of it felt more forced than most of the story. Overall, I enjoyed this book and would recommend it for those who enjoy a mystery with a bit of paranormal thrown in."}, {"userName": "Theresa", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/8531525-theresa", "userReview": "I really enjoyed reading this book! My favorite character was Tante Louise; I would liken her to Miss Marple. Tante Louise would always say \"things are not always what they seem\", and speed things along with a little Voo Doo!All the characters were great, put I do wish their personalities, for example Charlie, were more expanded on.Can't wait to move on to Kathryn's other murder mysteries!"}, {"userName": "Kathryn Long", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/5216989-kathryn-long", "userReview": "The idea for DYING TO DREAM sprouted several years ago when I was researching about haunted sites situated in Louisiana. I found out about Oak Alley, a former plantation with its supposed hauntings. I started with the idea of a woman who painted pictures of people she dreamed about. But these pictures took on a life of their own, changing form and position often, speaking to her, etc. The woman is somehow directed by spirits to find a property for sale in Louisiana and buy it. Then the haunted moments started once she moved there. That is where I left it ... unfinished.Fast forward to 2009 and I dusted off the story, using some of the original ideas, tossing out others and what you see published here is the finished product. My heroine became a psychic who dreams the dreams of spirits, becoming them, and learning their mysteries. Using this she is able to help solve a couple of murders and find out some puzzling details about the family history. Oak Alley is written into the story, by the way, as the plantation house in Vacherie. They say write what you know. So, even though I've never lived in Louisiana, I do have a background in the French language and have studied Spanish. I decided a couple of my characters could benefit from the knowledge, and I have a splattering of French and Spanish phrases throughout the story, which I think adds a little authenticity to them as well as giving the setting some southern flavor. As for the paranormal aspects, I've always been interested in the study and phenomenon of spirits. I've even been on a couple of ghost tours! Most of it is all in fun, but still ... who knows? If you read the book, you will notice how each chapter opens with a line or two from various authors and poets about ghostly topics. (And yes, I checked to make sure they are in the public domain and break no copywright laws!) Even though I love all my characters, I'd have to say Tante Louise is my favorite one. Her feisty attitude along with the french flare and voodoo mystery adds so much flavor to the story. And the romance? Ah, yes. There is romance :-) Trent and Marin in the present, as well as a couple in the past. But how that turns out, I will leave it to you to discover when you read my book!"}, {"userName": "Kathleen", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/4896869-kathleen", "userReview": "The book was well written and easy to read. Tante Louise's southern/Cajun accent felt perfect to me. I enjoyed the subject matter very much as it seemed very fresh. Although I wasn't enamored with the main character's actions. She seemed to do too many things that everyone else told her not to do. I understand her character was supposed to be stubborn, but it almost crossed over into just being dumb or reckless. But, the interesting plot concept far outweighed that."}, {"userName": "Angela", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/5427469-angela", "userReview": "I thought it was really neat book. I liked the suspense and how Marian helped solved the murders. I can't wait to read your other two new books. I need to buy them."}], "description": "When Jack Robesaux is found lying dead on a Louisiana beach, psychic Marin Seurat must use her gift to prove it is murder and not suicide. Though Marin knows her dreams with their messages from the dead could help, she struggles with the idea of returning home and facing a troubled past. However, a phone call informing her of Jack's murder and the return of the family curse gives Marin that final push. In a surprising turn of events, Marin discovers a mystery from long ago that somehow connects to recent deaths. With the help of cryptic messages delivered by spirits, Marin races to solve the mystery of Saint Toulere.", "title": "Dying to Dream", "url": "https://www.goodreads.com/book/show/17931270-dying-to-dream", "average": 4.62, "cover": "https://images.gr-assets.com/books/1369190291l/17931270.jpg", "reviews": 8, "authors": [{"url": "https://www.goodreads.com/author/show/4203129.Kathryn_Long", "name": "Kathryn   Long"}], "type": ["Fiction", "Fantasy", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/17931270-dying-to-dream", "http://www.goodreads.com/book/show/12043755-whips-cuffs-and-little-brown-boxes", "http://www.goodreads.com/book/show/12664431-a-date-to-die-for", "http://www.goodreads.com/book/show/20995559-devilish-devious-and-deadly-with-one-bite", "http://www.goodreads.com/book/show/13454481-under-the-oklahoma-sky", "http://www.goodreads.com/book/show/16003852-gangs-illegals-and-a-rose-tattoo", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}