{"ratings": 650, "userreviews": [{"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "Some of the recipes looked interesting maybe I will try one. That's about all I could say about this book."}, {"userName": "Rebecca", "userReviewDate": "Jan 07, 2010", "userURL": "http://www.goodreads.com/user/show/842257-rebecca", "userReview": "(With apologies to my dad, who generously gifted me this promising book!) Some of these essays stand nicely on their own but many are forgettable, and as a collection this is a waste of paper. A transparent attempt to milk some extra money out of a perfectly nice column in the NYT. It barely cracks 200 pages, and has literally an extra inch of right margin space. Every essay is followed by one of those frivolous tie-in recipes no one ever makes. One of these \"essays\" is just a reprinted excerpt from a Julia Child's My Life in France! And several others I'd already read in other collections. AND FINALLY these essays claim to avoid the sentimental, but if I have to suffer through another reference to Proust or his godforsaken cookies in foodwriting, I won't be held accountable for my actions."}, {"userName": "Rowan", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/27210353-rowan", "userReview": "Good, but limited by short article format."}, {"userName": "Kate", "userReviewDate": "Dec 26, 2008", "userURL": "http://www.goodreads.com/user/show/137566-kate", "userReview": "A lot of these essays seem only to scratch the surface. But they were probably perfect for a newspaper column, which is where they first appeared, and choice of authors is fun. From this collection, I learned that Tom Perrotta is a cripplingly picky eater. And that an elderly MFK Fisher grew tired of her endless parade of lunch visitors. And there's an essay from R.W. Apple Jr. about how he got good food in war zones or other unlikely places."}, {"userName": "Peggy", "userReviewDate": "Jan 18, 2009", "userURL": "http://www.goodreads.com/user/show/1535777-peggy", "userReview": "These 26 essays are memories that somehow involve food. They are all 3-4 pages long. These remembrances are silly, or sad, or serious, or funny, or uplifting and many end with the recipe for that particular food.Rather than a meal, I used this book as a snack; something to munch on while waiting for the dryer to finish, etc. I enjoyed almost all of these tidbits."}, {"userName": "Ann", "userReviewDate": "Nov 27, 2008", "userURL": "http://www.goodreads.com/user/show/502486-ann", "userReview": "Delightful. A compilation the NY Times column of the same name - essays by terrific writers about food and eating. Not \"food writers\" - there are no essays by MFK Fisher here (although there is one rather disturbing essay about her). Check out the very funny recipes by Patricia Marx, The New Yorker's great shopping columnist!"}, {"userName": "Lauren", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/7803382-lauren", "userReview": "such a lovely collection of essays, connecting the reader through that delectable, ethereal memory maker, food. the stories, however, are like pictures you take but then forget to develop the film; memorable in the moment, but then pretty forgettable"}, {"userName": "Janet", "userReviewDate": "Nov 16, 2008", "userURL": "http://www.goodreads.com/user/show/1173248-janet", "userReview": "I love this kind of stuff--personal essays where people take you back to something meaningful that happened to them in their life. And in this case it included memories involving food, so how could this book lose? A couple of times I would turn to my companion and say, \"I love this book!\""}, {"userName": "Blair", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/2005712-blair", "userReview": "Like any anthology, some of these were really great and others left me a little empty. But, if you are interested in cooking, foodways, and what food means to people, it's a good little read. Probably will only keep it until I need more room on my shelf of \"books about cooks/cooking.\""}, {"userName": "Sherry ", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/2553256-sherry", "userReview": "Great fun reading short pieces by noted authors about food."}, {"userName": "Cara", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/27340237-cara", "userReview": "I'm hungry."}, {"userName": "Annabel Krantz", "userReviewDate": "Jan 17, 2011", "userURL": "http://www.goodreads.com/user/show/4823894-annabel-krantz", "userReview": "A clever idea by Amanda Hesser saw writers across America contributing essays about what food means to them; twenty-six authors shared stories about their favourite food memories. There were Jews cooking the passover meal in Berlin, a brother cooking comfort food for his Autistic sister on their birthday, Indian's trying their best to introduce their families to the delicate French cuisine, an ode to garlic, and one to gravy, and gripes by those who don't love food about people forcing them to eat desserts.The great variety of stories lent itself to a very interesting read. These acclaimed writers, with their wide swath of life experiences, were able to paint pictures that made your mouths water. Not to mention the stories are accompanied by the relevant recipes, so that we can cook similar delicious morsels at home.Rather than just be a book of people describing a meal that they've eaten, this book cleverly is more about the strong emotions that can be attached to something as simple as a meal. That feeling is something everyone can relate to, and reading the anecdotes triggers memories of the reader's own memorable meals.This book isn't very long, and each individual essay only spans a few pages, so it's a great book for food-lovers with not much time on their hands. Definitely worth a look."}, {"userName": "Eliza", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/3490134-eliza", "userReview": "2/15/12: This is a collection--\"Best of\", I'd guess--of short essays written for the \"Eat, Memory\" column in the New York Times Magazine. Edited by Amanda Hesser (who also edited the column while it ran), it covers a wide range of authors and topics, though all focus on the theme of memories and food. A quick read, but there are some lovely surprises in here; it is amazing how evocative smell and taste can be, bringing to mind memories of place and time and family. Just as Proust tells us! Also, it's interesting how often a sense of loss pervades these essays: loss of innocence, of loved ones, of appetites, of a taste for ice cream…. So it's particularly helpful to read these essays all together; it's easier to note their similarities, their common tendency to make food into something intensely meaningful. I suppose Duh, that was the whole idea of the assignment--but often an assignment is easier said than done, and these essays about the authors' experiences succeed in their mission. The best ones manage to be both personal and universal--the best kind of personal essay."}, {"userName": "Catherine Woodman", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5912889-catherine-woodman", "userReview": "I recieved this book from some great friends, who are as food oriented as we are, and I had not heard of it, so always nice to be given soemthing that is perfect for you that you were unaware of. This is a collection of essays by people who write, and very generally they are about food or the experience around food. I really liked some of them (the blind grill chef, Kiran Desai talking about her growing up experiece to name a couple), and perhaps best of all, it made me think seriously about writing about some of my most memorable food experiences--a signature dish piece, a reflection on what my children crave when they are no longer at home full time, the experience of holiday and food, the community experience of sharing meals. So while this is not great literature, it is enjoyable, and most importantly it gave me something to think about that goes far beyond the experience of merely reading it."}, {"userName": "Purlewe", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/2117145-purlewe", "userReview": "I love essays. And if you want to read fantastic essays, get a bunch from the times and put them in a book! I am in awe of Amanda Hesser and her ideas. Food writing that is not odes to grandmother's cooking, but instead essays about why grandmother cooked. I loved reading this on the subway as they were just the right length between work and home. She chose talented writers, playwrights, and poets to render memories into delectable bites.My favorites were: The Great Carrot Caper, The Absolutely No-Anything Diet, Home Turf, Line of Sight, Turning Japanese, and Crossing to Safety. Altho really.. none of these stories were bad.. I love stories about tastes in other countries, how someone found a recipe, working thru your grief thru cooking. All of these appeal to me. I also was highly entertained by the fact that I have read many of these authors other works, making a glimpse into their life.. their food life.. more interesting."}, {"userName": "kristen", "userReviewDate": "Jun 22, 2009", "userURL": "http://www.goodreads.com/user/show/2285739-kristen", "userReview": "One of my fondest memories was a dinner at a french restaurant with my husband, our young children, and my in laws. I did not think this an appropriate pick for youngsters but my father in law insisted. As we strolled in past candlelit tables filled with couples, I thought oh this is not a family establishment by any stretch. By the end of our 3 hour meal though, we were unaware of anyone else in the place. The meal was amazing and Grandpa made sure that his grandkids had whatever they needed including playing hand slapping games with loads of laughter. The head chef even joined our table for a while. I remember how scrumptious the food was but realize it was the company that made it so. This memory was what made me want to read this book. I liked the little \"tastes\" of stories but would not recommend the book. It was just okay."}, {"userName": "Sandy D.", "userReviewDate": "Mar 13, 2009", "userURL": "http://www.goodreads.com/user/show/1590672-sandy-d", "userReview": "This is a short little book, with a bunch of snack-sized (but delicious) essays. The first one in there (by author Ann Patchett) was kind of a dud, so I set it down and didn't pick it up again until right before it was due at the library - but most of the rest of the pieces in it were amazing. Several very funny bits, more than a couple that made me tear up - all in all, wonderful if you like reading about food.My favorites: a chef who tries to grow almond flavored carrots, the guy who hates dessert because of his experiences as a teenager working at an ice cream parlor, a Chinese woman who writes about Tang in Beijing, Julia Child failing a cooking test, Tucker Carlson working at a B&M bean factory...ah, too many to list. Read it yourself and tell me which you like."}, {"userName": "Tim", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/11827836-tim", "userReview": "Bit of an oddity.The sub title is Great Writers at the Table, great they may be in the US but I suggest nowhere else.The theme is short essays from the New York Times, some accompanied by a recipe/s.None of it is particularly good literature even though they are supposed to be ' Great Writers ' but perhaps their forte is not in short essays.Most are snapshots of the authors own lives, which is OK if you are interested in the author. But as one who has no knowledge of them, or their writings, it's rather difficult to produce any interest.The recipes appear to be irrelevant even if they relate to a meal mentioned in the essay, it's not a cookbook, so you are highly unlikely to refer to them again."}, {"userName": "Christina", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/761878-christina", "userReview": "The recipes I'm going to try from Eat, Memory are the Sole Meuniere and the Shrimp Ajillo. Shrimp is my favorite food and I'm going to try to cook the shrimp ajillo next week.The other recipes don't excite me. The narratives are often humorous, laced with food foibles.As not all the recipes thrill me, I would suggest you check the book out of the library.[I tend to be a generous reviewer though so the four stars.]The gastro narratives read in a flash. So pick it up: read and feed yourself."}, {"userName": "Laurie", "userReviewDate": "Jan 16, 2009", "userURL": "http://www.goodreads.com/user/show/415014-laurie", "userReview": "Unlike the usual collection of lyrical writing about memorable food experiences, this anthology has food writers and \"regular\" writers describing experiences related to food. I especially enjoyed two pieces about working in the food industry, Tucker Carlson on his time canning baked beans and Colson Whitehead as ice cream scooper. These essays are about food, not necessarily the love of food. Fans of some of these writers (Ann Patchett, Tom Perrotta, and Dorothy Allison are among those included) will want to pick this up."}, {"userName": "Cheree", "userReviewDate": "May 10, 2010", "userURL": "http://www.goodreads.com/user/show/1195784-cheree", "userReview": "This week I read Eat, Memory, a collection of essays from the New York Times, edited by Amanda Hesser. A book about cooking and food, I am in heaven. Each essay was very well written. All were from widely different perspectives. I enjoyed that. This would be a great coffee table book - each story can be read in under 10 minutes. Most of the essays end with a special recipe that relates to the story. I can't wait to try some of them out.Read complete review at http://chereemoore.blogspot.com/2010/..."}, {"userName": "Katina", "userReviewDate": "Apr 02, 2010", "userURL": "http://www.goodreads.com/user/show/254969-katina", "userReview": "Picked this up on a whim at the library. It was a fun and quick collection of food essays from the NYT. Some were excellent (\"Family Menu\" by Allen Shawn, \"Crossing to Safety\" by Dorothy Allison, \"Inward Bound\" by Chang-Rae Lee) and others I found to be pretentious and annoying. That's kind of how I feel about all food writing. For me, it doesn't get much better than the good stuff, but the articles I find stuffy or snooty are just nauseating.The book includes some recipes that look tasty and interesting as well."}, {"userName": "Karla", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/1194722-karla", "userReview": "WHY I PICKED IT UP:Steve and Hilary gave this to me for Christmas. It is one of the most thoughtful presents I've ever received. A perfect fit for me because I write about food on my blog and love to read.NOW THAT I'VE READ IT:I really enjoyed this collection. All of the essays were interesting, vivid, emotional, mouth-watering... I liked the inclusion of recipes. Highly recommended to anyone who likes essays/short stories and food writing."}, {"userName": "Iva", "userReviewDate": "Mar 10, 2009", "userURL": "http://www.goodreads.com/user/show/758187-iva", "userReview": "You may find some of these familiar pieces if you regularly read the New York Times. Short but illuminating, they surprise by examining various aspects of our experience with food. My favorite was by Yiyun Li discussing how Tang became the cool drink in her Chinese community. It cost l/2 a months salary, but somehow people obtained it. Another favorite was Patricia Marx, who hated to eat as a child, and for her birthday was allowed to skip dinner!"}, {"userName": "Stephen", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5870255-stephen", "userReview": "Hesser (who wrote that silly book about Mister Latte, her poor husband) has collected some delightful essays and memoirs from the New York Times Magazine (where she was a food editor until recently). They are short, digestible, emotional and witty ... variously. This is a near-perfect book to read on an airplane or airport ... which is what I did. It is a certain antidote to airplane and airport \"food.\""}, {"userName": "Brooke Evans", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/7166682-brooke-evans", "userReview": "Food memoirs are pretty magical to me. This one was so easy to read, with its short essays (2-4 pages each, and it's not a large book, so the pages are smallish.) My favorite one was \"Expatriate Games,\" by John Burnham Schwartz. (Excerpt link: http://query.nytimes.com/gst/fullpage... ) These essays kind of carry you away for a brief visit to memories made distinct and sometimes more profound by the food that accompanied them. A beautiful little book."}, {"userName": "Irina", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/5389994-irina", "userReview": "This book was a breeze to read through because of the fact that each essay was so unique and just brief enough. I wondered how this collection could be cohesive without being too scatter-brained, but it it was somehow put together with a perfect balance of diversity and commonality. There are some essays enjoyed far more than others, but all were worth reading and gave it's own valuable perspective on food from different cultures, economic castes, ages, and personal circumstances."}, {"userName": "Stasia", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/544632-stasia", "userReview": "Like most collections, there are some good and some mediocre essays in here. Most of them are followed by a recipe that's mentioned in the essay, which is kind of cool though mostly not things that I would want to make. It was an enjoyable read, though. It would make a good airplane book, too, since the essays are all fairly short and quick, and you don't need that much attention span to make your way through it:)"}, {"userName": "Alexa Hamilton", "userReviewDate": "Oct 26, 2008", "userURL": "http://www.goodreads.com/user/show/165593-alexa-hamilton", "userReview": "I've forgotten how many books and essays about food I've read, so some of these were repetitive. But they are nice, short essays about food and the meaning of food. Certainly not my favorite food-writing but it does the trick when someone steals your Sunday New York Times and you're in the mood for some short, non-fiction pieces."}, {"userName": "Mandy", "userReviewDate": "Aug 03, 2009", "userURL": "http://www.goodreads.com/user/show/933738-mandy", "userReview": "do i sound like a jerk when i say that i think you can get a lot more out of checking the NYTs food blogs? honestly, there were a few good entries; the rest just a range of self congratulatory to self-indulgent entries that, to me, are not very strong examples of food writing. my sister took it out from the library (thankfully)."}], "description": "New York Times Magazine food editor Amanda Hesser has showcased the food-inspired recollections of some of America's leading writers--playwrights, screenwriters, novelists, poets, journalists--in the magazine. Eat, Memory collects the twenty-six best stories and recipes to accompany them.Ann Patchett confronts her stubbornness in a heated argument she once had with her then-boyfriend, now husband, over dinner at the famed Paris restaurant Taillevent. Tom Perrotta explains how his long list of food aversions almost landed him in an East German prison. Gabrielle Hamilton finds that hiring a blind cook leads her into ethical terrain she wasn't prepared to navigate. And poet Billy Collins muses over his relationship with a fish he once ate.Also included are stories by Chang-rae Lee, Patricia Marx, John Burnham Schwartz, George Saunders, Colson Whitehead, Kiran Desai, Pico Iyer, and Heidi Julavits, among others.", "title": "Eat, Memory: Great Writers at the Table: A Collection of Essays from the New York Times", "url": "https://www.goodreads.com/book/show/3499678-eat-memory", "average": 3.5, "cover": "https://images.gr-assets.com/books/1348716669l/3499678.jpg", "reviews": 107, "authors": [{"url": "https://www.goodreads.com/author/show/24955.Amanda_Hesser", "name": "Amanda Hesser"}], "type": ["Food and Drink", "Nonfiction", "Writing", "Autobiography", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/3499678-eat-memory", "http://www.goodreads.com/book/show/7229100-eat-memory", "http://www.goodreads.com/book/show/8101270-the-essential-new-york-times-cookbook", "http://www.goodreads.com/book/show/44449.Cooking_for_Mr_Latte", "http://www.goodreads.com/book/show/10200872-the-food52-cookbook", "http://www.goodreads.com/book/show/406160.The_Cook_and_the_Gardener", "http://www.goodreads.com/book/show/28686770-food52-a-new-way-to-dinner"]}