{"ratings": 13232, "userreviews": [{"userName": "Milica's Bookshelf", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/52006095-milica-s-bookshelf", "userReview": "Rio, ljubaviiiiiiiiiii ♥"}, {"userName": "Steph", "userReviewDate": "Nov 14, 2013", "userURL": "http://www.goodreads.com/user/show/4215697-steph", "userReview": "[I already thought it was a little too much that Grace and Rio were going to let Elizabeth stay with them, even though I thought it was really nice of them. But a double wedding for Nathan and Garrett? I didn't really like that. And Rio asking her to marry him, saying they want to give Elizabeth brothers and sisters was just overkill for me.  Again, you don't need a proposal for it to be an HEA. Just sayin'. (hide spoiler)]"}, {"userName": "CC", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/25476191-cc", "userReview": "re-read - via audibleI did not love it, but still liked it. The second half was much better to listen to than the first. Grace was one kick ass chick!Prior comments3.5 stars. Which is a good rating. Since I enjoyed the previous story about Shea's abilities I figured what the hell and read this one even though it is even more far fetched. But I liked the story of Grace and Rio. The reason for the average review is that I thought it was a bit weaker on the character development side. Can't give lots of details on what I wanted, it just did not tick all of my boxes. However, I still enjoyed it and would recommend.Safety Gang Safe"}, {"userName": "Saly", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/3192922-saly", "userReview": "Rating 3.5 starsThis is kind of continued with the other book, since Grace and Shea are sisters. Grace has the ability to heal people, something that is painful to her since she absorbs that person's disease. To save her sister Grace cut their mental link and now she has escaped from her captors, injured and on the verge of giving up when Rio's team gets to her.Grace is pushed beyond her limits to survive and Rio doesn't coddle her instead makes her take strength from her reserves and they take shelter in his house in Belize until further arrangements can be made. He also knows that Titan is also on their trail. Titan is a special ops group who at one point was led by Rio. Rio was an idealistic solider who joined Titan and did everything they said, dabbling in shades of grey and then he started questioning it. He let his parents think he died and then found his pregnant sister beaten by her husband and she died, he avenged her but his parents couldn't accept him back, so he joined KGI where he had more control.This book had insta-love, Rio saw Grace on tape and wanted her to be his, I kind of didn't get this. Grace is pretty much broken so much so that she wanted to die at one point but Rio helps her.I found the book kind of sugary as far as the romance is concerned. There is betrayal as well from someone in Rio's team who needs Grace's abilities. At the end of the book we find out that Titan had another objective, the world thinks Grace is dead so she has to be careful all her life, remain hidden in Rio's house and they acquire a daughter as well(of the man who wanted Grace to heal her).I am a fast reader but this book took me a long while because I kept getting distracted by other things. The book just wasn't that good and authors should keep PNR and RS separate."}, {"userName": "Auntee", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "[ when Grace and Rio adopted the little girl that she healed? I found that a bit hard to believe. Nobody was going to claim this girl--the daughter of one of the most powerful men in the world? She had no relatives? This all just seemed a little to pat for me. Another thing that dropped it down a half a star for me was--I wanted to see/read more about how Rio and Grace were going to live. Was Rio still going to be part of KGI? Was Grace going to have to stay in Belize even though \"Grace\" was believed dead? And what about Resnick? Will he ever have a relationship with his \"sisters? I suppose maybe we'll find out in an upcoming book, but I don't like to have loose threads dangling if possible. (hide spoiler)]"}, {"userName": "Jess", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/1255781-jess", "userReview": "Review posted: Happily Ever After - ReadsBlog rating: 3.5/5The story opens with Grace fighting for her life. She’s on the run, she’s incredibly weak from being held captive and being forced to use her gift of healing on numerous people. She can heal anyone by taking their injury or disease into her own body and using her accelerated healing abilities to fight off whatever it was she took in. She has her limits and death isn’t something her ability can keep away and she’s at her limit now. She’s alone, running from men who want to grab her and use her healing power, but if Rio has anything to say about it, he’ll find her first and keep her safe from everyone. When we last saw Rio in Whispers in the Dark, he had taken one look at Grace on a surveillance video and knew he had to be the one to rescue her. Grace’s sister, Shea, was already being watched over by the man she loves, Nathan Kelly, but Grace was out there alone and had no one. Rio tracks her down, helping her recover and regain her strength. The threat to both Shea and Grace is still out there but Grace is the one they want now. A man desperate for his dying daughter to live hires a group, Titan, to bring Grace in to heal his cancer stricken young daughter. Rio is very familiar with the group Titan, and knows they’ll stop at nothing to complete whatever mission they’ve agreed to. Failure isn’t an option for them and Rio along with KGI and Steele’s team, plan their attack to make sure Grace and Shea can live their lives in peace. I liked the relationship between Rio and Grace. Rio is very alpha, very much about protecting Grace and keeping her safe and he’s felt a connection with her since the first time he saw her on the video. Grace has been through hell. Her “gift” causes her so pain, but the guilt she feels when she sees a sick child or someone that she knows she can help drives her to do more than she really should. Throughout the book, Grace is constantly recovering from helping someone. Grace has also lived a very solitary life. She’s never gotten close to anyone other than her sister Shea and with Rio, she experiences a lot of firsts. Their romance felt very much like a whirlwind. There were definitely some swoon worthy moments between the two, but one thing that I’ve never been a big fan of is a declaration of love after only knowing the person for a few days. It happens between them and I understand how intense and emotional their scenes are, but it still felt a little fast. As it was with Shea and Nathan, there is still the element of Grace’s telepathy and she and Rio can speak to each other in their minds. I could take or leave this and really in the end, if felt like the things they were saying in their minds mirrored what they were already saying out loud, so I’m still a little puzzled as to why this storyline was brought into the series in the first place. They’re not on page for long, but I have to mention P.J. and Cole and how much I’m looking forward to their story. P.J. is a smartass, tough and even in just a few short pages, they made me laugh and cheer and I’m so looking forward to them leading their own book. The story takes place primarily at Rio’s home in Belize. There’s a ton of action in the first part of the book and Rio’s team is front and center during all of it. I liked getting to know his team members and put personalities with a few of the names. That said, since this was Rio and Grace’s show, the Kelly family was MIA for almost the entire book. They’re there in the background, in the form of KGI, but I missed the big Kelly family scenes. And yes, I absolutely get that it wouldn’t have made sense to have that in Rio’s book, he’s a part of KGI, but he’s definitely a man who takes orders from no one, including Sam and KGI. We do get a nice big family scene at the end and a well-deserved moment for Shea and Grace. I overall enjoyed the story. Personally, I needed to look at this as a story within the KGI series, but very separate in its own way. Rio is very sweet with Grace and he shows a different side to the Rio we’ve known in prior books. He’s still that same hard, leader who will do what it takes to get the job done, but he’s more emotional with Grace and let’s himself feel love and be loved for the first time. Rio and Grace had a nice romance, I just wish the pace of it had slowed down a little or had more of a time passage. This book can certainly be read as a stand alone and fans of the KGI series will enjoy getting to know Rio a little more up close and personal."}, {"userName": "Smut Junkie", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/7935793-smut-junkie", "userReview": "FRIGGIN LOVED IT! It's probably best if I just start out by saying that I adore this series and ALL those hot KGI men, the entire Kelly Family and all of the women as well! If there was a book series that I could throw myself into, it would be this one, but how ever would I choose which guy I wanted?? LOL! ;)Anyway - you got a fair idea of Rio in the previous books and at the end of the last book you got a tiny sneak peak of Grace, the sister of Shea. I knew going into it that I would love it because I was pretty much crushing big time on Rio before I even opened this book up! I love a big, bad-ass guy, who will do anything in his power to protect an innocent...and when he has a heart of gold and a super soft side it's just all that more appealing. I had about 80 pages left in the book and I put it down because I was getting really anxious and KNEW that the big bad event of the book was about to happen and I was really stressing out about it. Grace had been through so much horrible stuff and my heart just broke for her so many times throughout the book. And after you get a little more of Rio's back story you heart breaks just a little bit for him too. And you KNOW that they can't loose each other...and damn that Maya Banks for stressing me out like that!! I also KNEW there would be a HEA, cause there always is, but I was really feeling upset this time around. I finished this at the pool and had to put my sunglasses on because I didn't want anybody to see my CRYING! Yes, really, I was crying! Now I am stuck waiting for the next installment of the KGI series, which is Cole and PJ's story, which I have no doubt will be pure awesomeness!On a side note - I pre-ordered this from Amazon and as I was reading today half the book fell out of the binding! That makes me VERY unhappy!! No brand new book should do that! WTH?"}, {"userName": "Erin Muses", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/9370248-erin-muses", "userReview": "Someone needs to fix the title - it is Echoes at Dawn. Please. It will drive me nuts.Thank you!My first impression of Rio from an earlier KGI book: Luckily my impression has changed.I love this series. It requires me to occasionally suspend reality, but most of the activities seem to be somewhat within the realm of possibility (then again, I'm no military/mercenary expert). This story took that realm of possibility a little too far, and in my opinion it was lesser for it.Grace Peterson is a telepathic healer. She can absorb another person's illness or injury and leave him or her healthy. She is also able to read others' thoughts and communicate with her mind. This was my biggest problem with the book. After reading Shea and Nathan's story, telepathy seemed to be special and was a feature of their relationship that made them so good together. In this book it was used too much - how was Rio special when Grace could have made such a connection with virtually anyone? I was also a little bit afraid that having Grace be able to read everyone's mind was almost like taking the easy way out and not having to write the characters well enough to portray their strengths and weaknesses without that mental tap.I really liked the other aspects of the story. My impression of Rio from the other books was thrown on its head, as he was much less the machine than previously written. The double wedding was kind of cheesy, but whatever - the parts with the whole Kelly family are a little cheesy.Overall it was a good read for fans of the KGI series, and I eagerly await the next. P.J. and Cole seem like they will be fun together!"}, {"userName": "Sunny☼", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/8143867-sunny", "userReview": "Grace and Rio. The action remains high through most of the book with plateaus of peace to give you a breath as Grace heals for one reason or another. She is a stong woman and her character development at least in determination is well thought out by Banks. The brain link reunion with her sister Shea is better than the actual reunion on the wedding day...not saying whose wedding.  Rio is the brooding alpha hero we all love and he doesn't let you down in any way. I am beginning to feel an ever so slight lack of sustainable interest from Banks in this book. By that I mean, there is some of Banks usual passion missing here. Barely percievable. Is KGI beginning to run it's course? Hope not. The next book is P.J. the hot alpha chick on the team.Rio saves Grace from her captors and takes her back to his hidden hideaway in the jungles of another country. Grace shows unbelieveable strength in walking away from her captors, literally, at Rio's side. Can not help but call her one strong lady. Later the evil bad guy wants her captured again to save the life of his dieing daugher Elizabeth. Does he get his way or not. That is the thread through much of the story. Of course he does, Grace goes and then desplays her incredible stategic thinking. Then she does her thing at a cost higher then I had expected. Bit of a surprise there at the climax of the story. Always good. The HEA was perfect, first with family and friends and then on their own. Only one thread left dangling at the end of this story. One that I really don't care one way or the other about. I enjoyed reading the book and it did have all of the elements I look for in this type of read."}, {"userName": "Jennifer", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/6505648-jennifer", "userReview": "Darnit! I wish I could put my finger on the exact reason this disappointed me, but it was really just a culmination of a lot of little things. 1. Yes, she is fierce. Please stop telling me how fierce Grace is. 2. Bad guys shoot to kill...never made sense Titan letting them get away in the first place. 3. I got it, the Kelly's are the most incredible family in the world. 4. Grace is fierce. 5. Psychic abilities and secret government organizations only appear when you need to fix a damaged plot line. 6. What was with the wrap up? Are you kidding me with the nice neat bow? It was like Ms Banks didn't want to pursue this storyline anymore so she decided to jam in as much closure as possible. Hopefully the next story with PJ gets us back to the basic good writing of romantic action that appealed before."}, {"userName": "Gina", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/10220350-gina", "userReview": "WOW!!! LOVE THIS!!I have to say this right off the bat, I FREAKIN LOVE RIO!! Seriously, love him (giggly, I would swoon at his feet if he were real) love him!!! And I am 50! how ridiculous and embarrassing is that. lol... This story is about Grace, Shea's sister from book 4 Whispers in the Dark, two sisters that are telepathic and can heal others. Grace has been on the run, having escaped the people who were holding her and torturing her, forcing her to heal people despite what it does to her physically. She is weak and near death and running in the mountains of Colorado. Rio and and his team are on a mission to find her and bring her to safety. Rio and his team work for KGI run by Sam Kelly (*swoon*). Throughout the previous books in this series I never got a real handle of what this guy was about. Always in the background getting the job done. What I learned in this book was that he is a scary, hot, badass, kinda guy. I mean the guy lives in the jungle! But what seriously pushed me over the edge was his enlightened attitude. He knew he needed more than strong muscles, but a smart, trained mind. And of course there was his tender, loving heart. (ok I am babbling, cuz i am crushing on him so much). What I also loved about this book was the action of course, I could picture myself marching through the jungle, ready to kill the baddies!! What i missed was the Kelly brothers, They were not in the book much, but on the flip side I really enjoyed the men in Rio's team. What I also liked was the way Grace evolved, frightened, running, broken. She finally decides enough is enough of people using and abusing her and she starts to kick ass!! (you are fierce girl) Loved this book!!"}, {"userName": "Keri", "userReviewDate": "Oct 18, 2011", "userURL": "http://www.goodreads.com/user/show/2335749-keri", "userReview": "This one was really good. I loved Rio! Rio and Grace may a great couple and to me one of the best books in the series so far. Grace had been on the run for over a year, separated from her sister and trying to stay out of the clutches of someone after her. She has the ability to heal people and there are governments out there that would do anything to posses her talents...even her own. Rio is the man that has volunteered to bring her home to her sister Shea. But before Rio could get to her, she had been captured. By the time he did manage to get to her, she had managed to escape her captors, but was still very weak from healing sick person after sick person. She was put through some pretty horrific situations. I liked Grace and thought she was a good fit for Rio. Rio is MB's typical he-man alpha with a tortured past, but a really awesome cook. What is not to love? I enjoyed the book and don't mind the paranormal element. What did bother me was I think Resnick got the shaft and I don't see how what went down can stay down, especially with Shea knowing the truth. I don't know why he was kept out of the picture there at the end, but do hope someday he gets his own story, because to me his is a very lonely man. I am not sure what the point was of keeping him away from Shea and Grace. I do hope that Swanni and Steele get their stories soon. Also I hope we hear from bad-ass bad boy Hancock again...that is going to have to be one special woman to take him down and find his heart. Overall a strong story and it brought me back to the series."}, {"userName": "Wendy", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/4485620-wendy", "userReview": "There's nothing better than a strong heroine to bring a tough warrior to his knees. Grace and Rio sure didn't disappoint, the sizzling chemistry, non-stop action, great plot, hot smexin' and loveable secondary characters, makes this an enjoyable and engaging read. Enjoy!"}, {"userName": "Amber Hughes", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/4721002-amber-hughes", "userReview": "**3.5 stars**"}, {"userName": "Kristen", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/5477946-kristen", "userReview": "4 Stars - Romantic Suspense with a touch of Paranormal."}, {"userName": "willaful", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/2833071-willaful", "userReview": "Very uneven book. Parts were great, parts really dragged."}, {"userName": "Mari", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/2062840-mari", "userReview": "This was my favorite in the KGI series so far. I loved Grace and Rio. I also liked that the story arc concerning Grace and Shea came to a conclusion and the author didn't drag it out. This was also the last audio book of the series that's part of romance unlimited. I wish the entire series was part of the program."}, {"userName": "Luzie", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/42006839-luzie", "userReview": "4,5/5 stars"}, {"userName": "Sonya Heaney", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/8641171-sonya-heaney", "userReview": "Originally posted here.So, Maya Banks did the right thing by me. I wanted this to be my favourite book of the series – as it features my favourite character of the series (that would be Rio) – and it is. In all its lovey-dovey, seriously dramatic glory, it is. While I prefer straight suspense to paranormal suspense, if you like Christine Feehan’s very popular GhostWalkers series, then this is in a similar style.I really think you should read the book before this one first. I couldn’t tell you if Echoes at Dawn would hold up on its own, as I’m too familiar with past storylines to determine that.In this one, Rio – a mercenary of sorts – and his team have been sent to rescue Grace Peterson (of the supernatural powers), who is on the run from bad guys trying to imprison her and use her for experiments. They catch up with her just as she’s about to fall to her death in Colorado.From there we have some chapters where Rio and Grace get to know each other. Grace’s magical powers mean her injuries heal nice and fast, clearing her schedule for a few chapters of sex. Lotsa, lotsa, lotsa sex. There’s a whole chapter just for Grace to experience Blow Job 101.Then everyone becomes cosy and declares their love and respect – and some more love – for each other.Then the action picks up again and they go off to shoot some more people. Something bad happens to someone we’ve known from the beginning of the series, and that was really awful to read. He’s supposed to not be the greatest guy, but I have a real soft spot for him!I’m not sure if Banks knows this, but (in my opinion at least) she writes suspense better than anything else. Her suspense chapters get to me more than the romantic chapters do. That first third of the book that took place in the forest was amazing. I was happy to have less of the Kelly family in this one, because they’ve taken away from the exciting parts in other books (yes, I know, the series is called KGI – the “K” standing for “Kelly”!). I really liked the focus on Rio and Grace, without having to be interrupted by fussy, interfering Marlene Kelly every second chapter.But then, I just really like Rio all around. I like his long hair. One of my favourite things about him is that he doesn’t baby Grace the way some of the other characters would have. I was really worried his real name – finally revealed in this book – would turn out to be something super-dorky, but it wasn’t.On a completely random note, these books use the term \nwhat all she’s endured\n a lot. It’s not an expression I have ever heard before, but all of the characters (even Brazilian hero Rio) use it. Maybe it’s one of those Americanisms that has slipped past my notice until now??I remember many readers being worried in the GhostWalkers series when books #4 and #5 switched focus to a different team of different men – much like what happens with this book in the KGI series. As with the GhostWalkers though, the switch of focus actually made for a stronger book. It was something of a clean slate; we didn’t have to spend half the book catching up with everybody from past books, which gave us more time for the main story.Echoes at Dawn is one of those guilty pleasure reads. You go in with certain expectations because of the genre, and it delivers on all of them. I still prefer my romantic suspense without magic in it, but this is definitely my series favourite."}, {"userName": "Nikki", "userReviewDate": "Jan 14, 2012", "userURL": "http://www.goodreads.com/user/show/6538604-nikki", "userReview": "OMG!!! I love Maya Banks! This is one of my all time favorite series and I am thoroughly happy with its latest installment! I have to admit, with Whispers in the Dark I was taken by surprise with the paranormal element (and I love paranormals by the way), which even at the end and even though I loved the book, I was still unsure how I felt about it. Same feelings applied to Echoes even though I was eagerly waiting for its release date! That being said, this book fu*#in rocks! I have been interested in / intrigued by Rio from the first and when I found out he was getting his own book I was thrilled! This book was just as awesome as the rest and I don't even know where to begin! We all knew from the last book, when Rio demands ;) to be the one to find Grace that something is there, and boy is there! Grace is so broken, mentally and physically that she's at her wits end, about to give up when Rio swoops in and gives her something to live for. While reading this today, I updated my status periodically with some of my favorite lines from Rio, and I must say I think I'm in luurve! :) In Echoes at Dawn, we see a side of Rio that has never before been seen up close and personal! We even find out *gasp* his real name! The action in this one doesn't disappoint and neither do the (wink wink) love scenes! We meet a few new characters and fall in love with an adorable girl named Elizabeth. I was very glad with how this book ends for everyone and I am now impatiently waiting for January so I can read about P.J and (more winks;)) David Coletraine, my other favorite non Kelly KGI member! Now I'll leave you with those lines I mentioned earlier! ** “I don’t expect you to understand it. Hell, I don’t understand it myself. But I do expect you to accept it. And me. Because, honey, whether you realize it or not, I’m going to be a steady presence in your life from now on. It’s just a matter of how and where I fit in when all of this is over with, but I’m telling you right now, I’m not going away.”**“I don’t know what to say,” she finally managed to get out.Rio’s smile was gentle but assured. “There’s nothing at all to say, Grace. You’re mine. You’ve been mine from the beginning. You never stood a chance once I decided that I was going to be the man who brought you home.” Only Rio could get away with that! :)**“I’m going to make love to you, Grace. Not right this minute. I’m not going to pressure you or rush this. But from the moment I saw you on that video surveillance tape, you were mine. I have no explanation for it. I don’t even entirely understand the connection. But it’s there, and I think you feel it too. I’m willing to wait until the moment is right, but you’re mine.\" Can we say SWOON!!"}, {"userName": "Francesca the Fierce (Under the Covers Book Blog)", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/3108364-francesca-the-fierce-under-the-covers-book-blog", "userReview": "3.5 starsThis review was posted at Under the CoversRio is the perfect romantic suspense alpha hero. At least that's what I thought every time he showed up in this series before. Then he made it his mission to go after Grace Peterson and rescue her. Well somehow between that decision and what went down in this book he lost some of that alpha appeal.This book started out strong for me and slowly fizzled out some of the charm. At times it felt we weren't getting much progression in the overall story although there was a lot of action.Grace seemed a lot stronger and ended up being a more delicate type of heroine, even though still stronger than her sister Shea in my opinion. Grace and Rio still worked well as a couple though, him being the strong protector and relying on her powers at times and there was still some spark. As a couple I have to say I liked them a lot better than the previous book. Although the romance might've felt a bit rushed, and I would've liked their connection to develop through a longer period of time. Rio was still a pretty strong hero even though he was toned down from what I expected.And then there's the Kelly's...this is not a Kelly family book. They were mostly absent in this story and I expect the same from the next book as well. I do expect the next book to be a little more to my liking, being that it's PJ and Cole. Playful but hard.*ARC provided by publisher"}, {"userName": "Hbeebti", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/3985879-hbeebti", "userReview": "4.5, I seriously loved Rio!Not my favorite of the series but it was still damn good.So much action and Rio was such a warrior but beneath that was a tender lover. Grace man at first she was weak in every sense of the word but toward the end she had a back bone and was such a trooper. I was bummed that there wasn't as much Kelly family as I would have liked but then this is Rio's book. Loved all the action and all the calm moments between Rio and Grace. I think the reason I gave it 4.5 instead of 5 was because the issue with Browning. Stuff went down and I felt for him in a big way but it was never resolved at the end. I didn't like that. Also something was bugging me about the whole thing. Its not even a big deal but some reason it has been bothering me. See Browning and his woman claimed that Grace wasn't forced to help but in fact she was. At least in the beginning, when you are tricked and being held in an iron grip that leaves red marks and he say I wont hurt you but I will if I have too then pulls a gun on her, isn't that force? Yes she helped of her own free will when she found out why he did what he did but still. For some reason this bothered me in a big way. Ok whatever Im over it seriously. lol"}, {"userName": "Vanessa", "userReviewDate": "Aug 03, 2012", "userURL": "http://www.goodreads.com/user/show/9740086-vanessa", "userReview": "I don't know what I expected of this one but i was still between the lines on it. Honestly, I expected more from it because I enjoyed Nathan & Shea's book a little too much. I expected more from Grace especially since she was a huge concern in the last book. I certainly expected more communication between her and her sister. I think I would have liked more interaction between her and Rio as well, I mean, besides the fact that the both saved each other I didn't feel the connection that I felt between Shea and Nathan. Even with all that I still gave this book 4 stars . Why ? Even though It felt lacking in some areas. Who am I to kid? I love a good love story. And that it certainly was. Also I don't know if it was just me, but I predicted a pregnancy in all of this. No? =D HAPPY READING . :)"}, {"userName": "Pamela(AllHoney)", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/884792-pamela-allhoney", "userReview": "The fifth addition to the KGI series. The story continues where the previous book, Whispers in the Dark, left off. Rio volunteers to find Shea's sister, Grace and he does. Of course there are lots of bad guys chasing after them so they have to hide. That gives our couple time to get to know each other. lol. I wasn't feeling this one as much as the previous books in the series. I'm not sure why but it didn't grab me like the others. I liked it well enough and will definitely keep it and continue the series."}, {"userName": "MountainKat", "userReviewDate": "May 24, 2011", "userURL": "http://www.goodreads.com/user/show/3916434-mountainkat", "userReview": "*4.5 Stars*Another great installment in the KGI series! I loved reading about Rio and Grace! But it didn't move me like some other books in the series have. I did admire Grace's strength and courage. It was amazing to see her have such compassion after everything she had endured. I can't put my finger on why I didn't connect with this book as much as I had hoped, but I still devoured it and really enjoyed it though! I just dread waiting for the next one - thank goodness for the novella we get soon!"}, {"userName": "Suzi", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/22800029-suzi", "userReview": "jebenica od knjige"}, {"userName": "Ery", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/5152904-ery", "userReview": "DNF- not my book. Classic alpha male and heroine in need of rescue. Too melodramatic for me (by far), but if you like books in the style of Christine Feehan or Lora Leigh, this is for you."}, {"userName": "HeatherTX", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/4193084-heathertx", "userReview": "Absolutely loved it! Rio is one complex character....one mintue he is hardcore all business and gentle and oh so caring the next. Grace is one lucky girl!"}, {"userName": "Lindap", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/6695270-lindap", "userReview": "4 StarsAfter the rescue of Shea in Whispers in the Dark the storyline continues with her sister, Grace, in Echoes at Dawn. It was nice to get the conclusion of this story arch in back to back books. Grace and Shea have a paranormal ability to heal. With Grace, she takes on the other person's illness or wound upon herself and that person is healed. It can be mental, cancer, knife wounds, GSW... This makes Grace a highly sought after person, and I don't mean in the I-want-to-pay-you-for-your-services kind of way. She's hunted. She's captured. She's use in experiments. Later in the book she find out exactly why a particular person is so determined to capture her.I liked Rio and Graces story and relationship. Like with the Kelly bothers, Rio is the tough, alpha, I'm in charge kind of guy....but he has a soft underbelly for the woman he's come to care for and love."}, {"userName": "Marianchu", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/27509501-marianchu", "userReview": "Me siento un poco decepcionada. Me explico: Creo que el inicio de este libro es uno de los mejores que he leído, te mantiene en vilo línea tras línea. La adrenalina y la tensión me tenía atrapada hasta el punto de no poder parar de leer; Rio y Grace, junto con los miembros del equipo eran perfectos, buenos diálogos, mucha acción, buena descripción del escenario, personajes con carisma, de los que atrapan.... pero a partir d más o menos el capitulo 14 empecé a notar un cambio en la actitud de los protagonistas que no me concuerda con el inicio del libro.... Grace pasa a ser bastante sensiblera y llorona y Rio neandertal con el mía y lo que yo diga.... lo que no pega para nada con el principio del libro....Me ha resultado cansina la narración de las escenas íntimas, demasiado largas y detalladas, llegando al punto de aburrirme (sip, aburrirme)Creo que el desarrollo de la segunda mitad del libro no ha estado a la altura del inicio sobresaliente y el final tampoco porque se vuelve a repetir el patrón de los libros anteriores, así que me encontré desgraciadamente con ganas se terminar la historia :(A pesar de ese inicio de 10 y de lo mucho que me gustaban inicialmente los personajes, a la historia completa no puedo darle más de un 6,5."}], "description": "Grace Peterson is desperate, in hiding, and on the run after escaping a shadowy group determined to exploit her extraordinary ability to heal others. Her only lifeline--an unerring telepathic ability she shares with her sister--has been severed, leaving her alone and vulnerable. And time is running out...Enlisted to bring Grace home is Rio, relentless member of the KGI. He's unprepared for his reaction to this wounded, damaged woman, and he's fiercely determined to protect her from those who nearly destroyed her. In Rio, she finds a safe haven, and for the first time...hope. But the mission is far from over. The danger Grace has eluded is fast closing in. And now it's pitching two lovers toward an unfamiliar horizon, with no place left to hide.", "title": "Echoes at Dawn\n      \n          (KGI #5)", "url": "https://www.goodreads.com/book/show/11222139-echoes-at-dawn", "average": 4.28, "cover": "https://images.gr-assets.com/books/1342124544l/11222139.jpg", "reviews": 622, "authors": [{"url": "https://www.goodreads.com/author/show/24978.Maya_Banks", "name": "Maya Banks"}], "type": ["Romance", "Romance", "War", "Contemporary", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/11222139-echoes-at-dawn", "http://www.goodreads.com/book/show/13072598-echoes-at-dawn", "http://www.goodreads.com/book/show/13126204-echoes-at-dawn", "http://www.goodreads.com/book/show/13582777-echoes-at-dawn", "http://www.goodreads.com/book/show/16033902-rush", "http://www.goodreads.com/book/show/16033906-fever", "http://www.goodreads.com/book/show/16033909-burn", "http://www.goodreads.com/book/show/9962040-in-bed-with-a-highlander", "http://www.goodreads.com/book/show/1333030.Sweet_Surrender"]}