{"ratings": 3229, "userreviews": [{"userName": "Angela M", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "The burden of grief for a mother losing her son, a wife losing her husband, a son losing his father he hardly remembers, a father losing a son through horrible circumstances. This is a hauntingly intense story of family dysfunction and mental illness and most of all love. It's edgy and sometimes eerie with moments of horror but hope, moments where you will laugh and cry, and characters I loved and hated at the same time . I have an affinity to young narrators or when the narrative point of view reflects what is going on in those young minds, how they interpret what they see and feel . So it was easy to fall for Edgar Allan Fini, eight years old - albino and borderline autistic . He lives with his mother Lucy, who's not exactly the model of motherhood to put it mildly and his grandmother, Florence who cares for Edgar when his mother could not, who finds solace in the loving care of Edgar. I was captivated by the narratives of these three characters and through their perspectives on themselves and each other, their stories and that of deceased Frank unfold. Into their lives comes the Butcher, who I liked a lot and Conrad, the ominous bearded man in the green truck. I'm finding it difficult to say more about the plot without giving anything way so I won't give any more details. The writing is wonderful but it's a long book . I may have given it five stars but there were times towards the end that I felt it was a bit drawn out. I was left feeling somewhat ambivalent about what happens to Edgar but this is not in any way a criticism of the novel. I think we are meant to feel this way. Definitely recommended but hold on to your seat because like me you might want to climb inside this book and rescue Edgar. This was a buddy read with my two very good Goodreads friends, Diane and Esil. Thanks again for a great discussion and your much appreciated thoughts on this.  I received an advance copy of this book from St. Martin's Press through NetGalley."}, {"userName": "Jaline", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "This book is about a family that has probably the worst case of bad luck I’ve ever read about. There were times I wished I could read with my eyes closed, and yet I was compelled to read every word. The story is dark and nearly every dream becomes broken; every possibility fizzles out of sight; every fantasy turns into a nightmare; every hope is delayed or destroyed.Still, nature – and life – abhors a vacuum so when the light side is tipped too far by the dark side, it eventually must right itself. In this book it does just that. And even though with some it is only in small ways, each person finds some form of redemption – by their own standards if not by usual standards.The people in this book had me staying up late some nights to read ‘just one more chapter’. They fascinated me and repelled me at the same time as they somehow maneuvered me into caring deeply about them and wanting passionately for them to succeed: to resolve, renew, and redeem themselves.I recommend this book to anyone who enjoys strong, character-driven novels with a plot that is propelled by the choices made by those characters. Oh, and – be prepared for at least one or two late nights with your eyes wide open and with your thoughts and feelings caught up in the lives of the people in this extraordinary, well-written novel."}, {"userName": "Larry H", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 3.5 stars.\nEdgar Allan Fini is an eight-year-old boy unlike any other. Because he suffers from albinism, his physical appearance is tremendously unique (a fact not quite appreciated by his bullying peers), but his heart and his mind are far more advanced in many ways than most kids his age. Since his father's death when he was a baby—an event no one speaks of—he lives with his mother, Lucy, and his beloved grandmother, Florence, with whom he has a special connection.\"Even those who loved you best were bound to find the flaws if they stared long enough. To lose his grandmother's favor would be the end of everything. Unlike his mother, whose light flashed on him only intermittently, like the beam of a lighthouse, the old woman was nothing less than the sun. The idea that she might think less of him filled the boy with shame.\"Edgar has his secrets, but then again, so do Lucy and Florence. Lucy mourns for the passionate, troubled man who rescued her from a troubled childhood and loved her fiercely, yet she continues to be angry with him for leaving her alone with his mother and their infant son. She tries to fill her husband's absence with alcohol and destructive relationships with other men, yet she can't help but wonder if she made the right choice all those years ago when her husband needed her most. While she loves Edgar, she doesn't know how to deal with him, and is happy to defer his parenting to Florence, despite what she believes Florence thinks about her.Florence, on the other hand, mourns for her lost son and tries to understand what happened to him and what role she played in his problems. She has pinned all of her hopes on Edgar, and loves the young boy with the force of her being, yet she wants to be sure he doesn't follow in his father's footsteps. She tries desperately to shelter him from the outside world, and from the mess she believes Lucy is making of her life and the memory of her son.<One day, feeling hurt, alone, confused, and angry, Edgar makes the decision to befriend a man with his own secrets and his own tragedy. It is a decision that impacts both his and Lucy's lives profoundly. Edgar must figure out what means the most to him, and what he truly wants, while Lucy must come to terms with her marriage, her husband's problems, her own childhood, and her relationship with her son. I'm being fairly vague with my plot description because there are a lot of elements which are more powerful if you let them unfold rather than learn about them in advance.Edgar and Lucy is a book a number of my Goodreads friends rated very highly and felt very passionate about, so despite my trying to tamp down my expectations, I had high hopes. This is a beautifully written book—seriously, Victor Lodato is a prose master, creating imagery and using language which truly took my breath away. It's very powerful emotionally, and Edgar and Florence's relationship made me a little teary. But despite the beauty of its storytelling, I liked, but didn't love the book.I wished that the story was tighter, as I felt the plot dragged on longer than it needed to. After a while I just wanted the plot to resolve itself. There are elements of mysticism I didn't quite understand, and at times there were characters I felt were extraneous. I was thankful that Lodato didn't take the story down a path I feared, and I felt that there was so much going on at times that it diluted the powerful heart of the story. But maybe these are the quibbles of someone who expected too much—perhaps if you just go into this book knowing you'll be moved, you may enjoy it more than I did.At its heart, Edgar and Lucy is a book about the beauty and pain which come with relationships and love of all kinds, and how painful it can be to be the one left behind. If you like beautiful writing, you'll be blown away. Heck, you may even cry. See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Carol", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "5, no holds barred, stars for each and every page. At over 500 pages, Edgar and Lucy is a commitment but don’t let the numbers intimidate you. Victor Lodato’s words sing and you’ll be turning pages so rapidly, you’ll be finished, sorry that it has come to an end.The Hook It could have been the title, Edgar and Lucy lacking pizzazz, that initially didn’t grab my attention. It might have been the somewhat bland cover that does make sense after reading the book. The positive reviews started didn’t sway me. I still wasn’t convinced that this was a book for me. Even knowing that Victor Lodato would be a featured author at Northshire Bookstore’s 2017 Booktopia Event didn’t hold any weight. What convinced me in the end was as simple as hearing the author describe his book and his share with his audience that one of his characters; Florence, was a combination of traits of his grandmothers, one Italian and one Polish. Perhaps not the best reason to pick up a book but I’m so glad I did.The Line(s) So many flagged pages. I had to stop noting every single passage that struck me. I chose this simple phrase from among the many. Grief loves innocence.”The Sinker Here’s where it gets harder. How do I convince you to pick up Edgar and Lucy? The only way I can think to explain it is to imagine a dictionary filled with words. Nothing in themselves. Then imagine that same dictionary used with skill by someone who can arrange these into this impressive story. That's Victor Lodato, talent on a grand scale. Victor Lodato read to his audience at Booktopia. These opening lines are the first of many passages that I loved:Having a life meant having a story. Even at eight, Edgar knew this. What he didn’t know was his own beginning. Newborn brains were mushy. If you wanted to how your life had started, you had to get this information from other people. But what if these people were liars?  I kept falling asleep.” Said Lucy. She was speaking of Edgar’s birth. The boy liked this particular story, and so he made sure to roll his head in feigned boredom. “Even with all the pain, I was, like —“ Lucy opened her mouth and made a stupendous snore sound worthy of a cartoon character. “It was nearly three in the morning when you decided to show your face.” She tossed back her hair and turned to the mirror. “And you didn’t make a fuss either. Doctor said he’s never seen a kid care less about being born. Slap, slap, and back to sleep.”  “And then they put me in the box, right? In the glass box, right?” “Yup. Because you were so small. And you didn’t wake up for a week.” “Size of a dinner roll, “ Lucy said with a slight shudder. “And so white, I thought you were a friggin’ ghost.”Edgar and Lucy. Lucy and Edgar. These two are prominent characters yet not the only ones. There are others, just as important, perhaps more important and just as thoroughly written in detail, each playing their part to make this story complete. I loved Edgar and unlike some other reviewers, I even loved Lucy. I loved all the characters and didn't want to let them go. You could call this a coming of age story set against the backdrop of a dysfunctional family, where mental illness, grief, and circumstance set in motion happenings beyond the control of this young boy. Edgar and Lucy is often humorous and might even be funny if not for its aching sadness. Do not miss it. It’s a gem."}, {"userName": "Cheri", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "!! NOW AVAILABLE !!4.5 Stars rounded upHaving a life meant having a story. Even at eight, Edgar knew this. What he didn’t know was his own beginning. Newborn brains were mushy. If you wanted to know how your life had started, you had to get this information from other people. But what if these people were liars?Edgar was born with albinism, giving him what some referred to as an angelic appearance along with his slight build, and with his white hair on the longer side. As a result, some of the larger, older boys pick on him. As this story begins, Edgar is eight years old, and lives with his mother, Lucy, and his paternal grandparents, Florence and Pio. He’s lived there all his life with them. Once upon a time when he was just a baby, his father lived there, too.…he knew—but only vaguely, a borrowed memory—that his father had died on a bridge. But that was a long time ago, before Edgar had yet to utter his first word. And so, to the boy, the father remained in the lump and shadow of a half-lived dream. His father was something at the edge of things, but he wasn’t a person, exactly.Edgar was given the name Edgar Allan Fini at the insistence of his father. He is closest to his grandmother, Florence, she dotes on him, he doesn’t have any real friends his own age, really, he knows all the people his grandmother knows, the shops and the shopkeepers, the people at the cemetery where they go to place flowers and pray. He loves his mother, but Lucy is rarely around him between her job and her desire for the attention of men, she’s often out of the house, and Edgar resents this. As much as he resents her “dates,” he longs for that attention. As dependent as he is on his grandmother--which she encourages--she also needs Edgar. It would be easy to label her promiscuous or a bad mother, but Lodato also portrays her as another wounded soul, immersed in the grief and confusion that seems to have always been a part of her life.Lodato has created some very flawed, quirky and believable characters that Lodato develops slowly and naturally. I really enjoyed the majority of this book a great deal, but it took me a little while to fully connect with it. I still enjoyed it, though from the beginning, but it felt more as though it was setting the stage for more. After that, I was fully engaged and had a hard time putting it down. While the story has some dark moments, there are also some charming ones. There are even some gorgeous descriptions of the landscape of the New Jersey Pine Barrens, and their legends included, which I loved. And, I have to say, there’s some very lovely prose. An emotional read about life, love, mystery and madness. Recommended. Pub Date: 07 Mar 2017Many thanks for the ARC provided by St. Martin’s Press!"}, {"userName": "Elyse", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I appreciate this book - but I felt 'too full' with too 'many' gorgeous descriptions, in the same way I can feel if Iload my plate on Thanksgiving with too many delicious foods. All together -it's too much."}, {"userName": "Esil", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "Edgar and Lucy, what can I say? I loved the writing. I loved the beginning. I loved Edgar and his grandmother Florence. I was heading to an enthusiastic 5 stars, and then you floundered a bit, and then you got solidly back on track at the end. So I've landed on a sincere 4 star rating. Spoilers are a real risk here, so here is an attempt at a few non-spoilery thoughts:-The book opens with 8 year old albino Edgar, who lives with his grandmother Florence and mother Lucy. The story goes back in time, as we find out how the three came to live together. Then the story moves forward as we find out what happens in the next few months. -The story is told primarily from Edgar's point of view, although other points of view are regularly mixed in. Edgar is exceptionally sensitive and precocious, but he doesn't always see things for what they are. I loved his perspective -- the mix of insight and mistaken understanding. Other characters are also mired in their own deep subjectivity.-Lodato has some awesome writing skills. He gets right into his characters' heads, showing us the twists and turns of their complex thoughts and feelings. He pulls off combining extremes of heartbreak and humour. He throws in some tinges of surreality that worked really well.-But around two thirds in, these strong skills got away from him. Some of the humour started feeling silly. And the sources of heartbreak got a bit too tangled. It started to feel like a bit too much of a good thing.-But Lodato pulled it together and redeemed himself in the end. And overall, I remain so impressed by his writing, storytelling and emotional deftness.Highly recommended for readers who can weather some rough patches. I would love to read Lodato's next book to see what he does next. Thanks to Netgalley and the publisher for an opportunity to read an advance copy. And thanks to Diane and Angela for another excellent buddy read."}, {"userName": "Diane S ☔", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 From the beginning I just loved Edgar, an eight year old albino boy, the light of his grandmother Florence's eye. Their relationship is so special and tender. His young mother Lucy, scarred by her past and the traumatic death of her husband is not much of a mother and is very self centered. Things will change quickly for our little group and the reader is taken on what is at times an intense emotional journey.It is a journey in other ways as well, as we learn the back stories of our characters, what made them whom they are now, and why they act the way they do. The characterizations are amazingly thorough and we watch as the present circumstances propel them to change, gain understanding. The first part of the book has a great deal of welcome humor and the pace moves quickly. In the second to last section, I felt this changed, the pace slowed and I think some of the scenes added little to the story and served to slow the pace. There are quite a few sexual scenes and graphic language is sometimes a factor. I didn't like Lucy in the beginning, felt sorry for her when I learned her story but it wasn't until the end that I embraced her as a character. I loved the Butcher who will play an integral part in the positive change that will eventually envelop our characters. I did feel, that Edgar at age eight acted more grownup then most of the adult people in his life. The ending was wonderful, an emotional relief after the roller coaster of our journey and the last chapter is perfect. Think this is a book to enter into with the mindset that while at times the reading is difficult, it is the journey that matters. If you take little Edgar into your heart you will want to know how he fares after everything he goes through. I did.This was a read and discussion with Esil and Angela, and our discussions helped me understand my reactions and formulate my thoughts. Priceless.ARC from Netgalley."}, {"userName": "Theresa", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/38029020-theresa", "userReview": "Thank you, St. Martin's Press for sending me, \"Edgar and Lucy\" by Victor Lodato, in exchange for an honest review.THIS. NOVEL. WAS. EVERYTHING. Victor Lodato is one hell of a writer. His writing style is so beautiful, rich, vivid, and completely magical. I was captivated with the story of an 8 year-old albino boy named, Edgar from the very first page. There's this gothic/old-fashioned undertone even though the novel is set in present day. I really liked it. I went into \"Edgar and Lucy\" not knowing what to expect, plot-wise, and I'm glad I did because there were so many twists and turns, and wonderful surprises/discoveries, so I don't want to ruin the plot for people who haven't read it yet. This book is humorous, dark, disturbing, creepy, and a fucking masterpiece. The characters are multi-faceted. The backstories of Edgar's beloved grandmother, Florence, his egotistical mother, Lucy, and his mentally ill father, Frank (who died when Edgar was a baby) are so well crafted and razor sharp. I cared about these characters. Lodato has this uncanny ability to tap into a character's mindset/soul with such precision. This novel is part contemporary and part coming-of-age. Edgar goes through life-changing/traumatic events, (I'm still in shock) and the way he copes with those changes is heartbreaking and yet inspiring. He's sensitive, moody, resourceful, and smart as a whip. \"Edgar and Lucy\" is a slow burn (500+ pages) but it's a damn good burn. I liked that I didn't know how it was going to end, but the ending was absolute perfection. Wow. I highly recommend it. Enjoy!"}, {"userName": "Nikki", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/1629938-nikki", "userReview": "I can't wait to read this despite the glowing review from Lena Dunham, whose opinion I couldn't care less about.After reading:I loved this! Such an engaging story with unique and memorable characters. The lovely writing was just icing on the cake!"}, {"userName": "Terri Jacobson", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/8370501-terri-jacobson", "userReview": "Edgar Allan Fini is 8-years old and lives with his mother, Lucy, and grandmother, Florence, in a house in New Jersey. Edgar is an unusual child, and incidentally, he is an albino. His father is dead, but Edgar is unclear about the details. His mother is an inconsistent parent and Edgar gets most of his care from Florence. He loves both women deeply.Edgar and Lucy is the story of this family, how they love each other and how they hurt each other, how they grieve and how they move on. It is the story of the ceaseless passing of time, the changing of our day-to-day world. It's about mental illness and the effect of inconsistent parenting. (But isn't all parenting essentially inconsistent?)The characters in this book are diverse and deeply crafted. The writing is excellent. Here is a passage in which Florence picks up one of Edgar's sketchbooks:She paged through the boy's fancies--quickly at first, but then with a vague, slow-moving dread. The sketches seemed innocent enough, but the years of Frank's illness had turned the old woman into a dark magpie, always on the lookout for any bright rumple of strangeness, any flash or glitter of unwholesomeness in the people she loved.Edgar and Lucy has a lot going for it: great writing, interesting characters, suspense. My one criticism is that about two-thirds of the way in, the story dragged a little bit. I felt that one of the story lines was just too long. A very fine reading experience. 4 solid stars."}, {"userName": "Marialyce", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "Well that was a very depressing book! I found it to be a great guide for dysfunctional people. It had everything in it from suicide, mental illness, abortion, sex, kidnapping, child abuse, and a young man who was an albino. As I read through the five hundred plus pages, I kept on asking myself when this book would end. It often seemed like the author kept on adding things, kind of like an addendum to an addendum. In other words, I felt this novel should have been about two hundred pages shorter. It is extremely hard for a reader, especially this reader, when an author belabors their characters so much so that the reader gets to the point of not caring a lick about the characters we should at least feel something for. For some reason, the author's style reminded me of Faulkner and not in a good way. It seemed Mr Lodato suffered from banality as he laboriously tried to cross every \"t\" and dot every \"i\" which at times made for a most boring read.There were elements I liked and characters who were in a word nice and loving.There would have to have been for me to sally forth for over five hundred pages. The grandmother, Florence, and the butcher were two redeeming characters and of course there was Edgar who never really seems like nothing more than the paleness of his skin. The rest of the characters were so very flawed, exceedingly so, and it often pained me to read about them. So perhaps this was the author's purpose to point out the flaws so that we could maybe eventually see the good. The only problem with that was it took forever to find the good while mired in the bad."}, {"userName": "Antoinette", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/5328952-antoinette", "userReview": "4.5 STARS\"Having a life meant having a story\". And what a story are we gifted with by Victor Lodato!We meet Edgar (8 yrs old) and his mother Lucy. Both are scarred individuals- Edgar, physically, as he is Albino and Lucy, mentally, from her upbringing and from the loss of the love of her life- Frank, Edgar's father.Lucy loved Frank so much that she was willing to relinquish Edgar to Florence, her mother in law. Florence is a wonderful character- hilarious, superstitious, just a perfect Italian Nonna, who makes Edgar the focus of her life. But life happens and Edgar now needs his mother- Will Lucy be able to do what it takes to save him?I became invested in both Edgar and Lucy. I loved Edgar immediately. It took me a while to warm up to Lucy. The author has created 2 memorable characters in this mother and son.He has also created secondary characters who added to the story, not detracted. You will definitely fall in love with Jack, the dog- I most certainly did!I loved this book-it is a book about connections; a book about love; a book about the bad things that happen in life and how the human spirit learns to move on, whether positively or negatively.\"Everyone's lost something- some people quite a lot, some people everything- and I suppose these strangers saw me as a bit of luck\". Victor Lodato is a beautiful, poetic writer.I highly recommend this book!"}, {"userName": "Kathleen", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/891502-kathleen", "userReview": "\"Learning kindness late in life was a kind of torture. The pain often came from the past, from kindness withheld. The knife was particularly sharp when those who most deserved your kindness were long gone. And unless you wanted to die of sorrow, you had to give this unspent kindness to those you loved less.\"MY review for the Chicago Tribune: http://www.chicagotribune.com/lifesty...A poet, a playwright and a novelist, not to mention the winner of a Guggenheim and a recipient of a fellowship from the National Endowment for the Arts, writer Victor Lodato seems to be something of a polymath.His second novel, the wonder-filled and magisterial \"Edgar and Lucy,\" certainly feels as though it was written by one, so wide-ranging is it in its concerns and themes, and so ardent is it in its desire to bring everything — life, love, family, loneliness, magic, spiritualism and death — together in its pages.The first section of the epic book's seven in total, \"The Age of Florence,\" brings the reader into 21 Cressida Drive, in Ferryfield, N.J., the still point at the center of Lodato's swirling plot. The epigraph for the whole book comes from Sappho: \"There is no place for grief in a house that serves the muse,\" and the narrative has a carefully built, architectural quality that lends it pleasing immensity and gravitas.The home at 21 Cressida Drive is presided over by one of the novel's three main characters, the working class and barely literate widowed Italian grandmother, Florence. She lives there with her angry and damaged red-haired daughter-in-law, Lucy, also a widow following the mysterious death of her husband, Florence's son, Frank. Together, they're raising Lucy's son, the preternaturally intelligent and introspective 8-year-old albino, Edgar. In the face of various betrayals and losses, the three struggle to figure out, in Lodato's astute distinction, how to \"Not start over — but continue.\"Lodato's skill as a poet manifests itself on every page, delighting with such elegant similes as \"Between the trees, strands of spider silk flickered like glitches in reality\" and such incisive descriptions as \"the miraculous horror of a child growing up.\"His skill as a playwright shines in every piece of dialogue. Even minor characters like the brassy old lady, Honey Fasinga, get such golden lines as, \"A person of style does not use his sleeve. Here's a tissue. Goodness gracious. Are you generally a crier? It doesn't do any good you know. You won't get far on an ocean of tears.\"And his skill as a fiction writer displays itself in his virtuoso command of point of view. He makes omniscience look absurdly easy, leaping in and out of the perspectives not just of the main characters, but also a host of others, including the schizophrenic Frank; the mentally disabled neighbor girl, Toni-Ann; the depressive kidnapper, Conrad; and even, at one point, a dog named Jackie.Equally impressive is that he does so in a way that encourages the reader to feel sympathy for each and every one of them. Even as they frequently commit foolish or terrible acts, as rendered by Lodato, they remain indelibly human.As much as it concerns itself with tragedy and the inevitable loss of innocence attendant upon coming-of-age, so, too, is the book by turns light and whimsical with elements of humor, as when a young Lucy thinks, in flashback, \"All of New Jersey appeared to be one giant cliche — an ugly sprawl of pizza and traffic and sleazeballs; green lawns lorded over by Marys on the half shell, and women who forced their hair into unnatural acts of aggression.\"Without giving too much away, the novel's drama borders, at times, on melodrama — fires and drownings, vomiting and maiming, abortions and psychics — but such deliberate excess seems appropriate given the story's focus on the barely fathomable dimensions of grief.The book pushes the boundaries of beauty, inviting the reader to be like Edgar, who, even when staring at litter on the ground, \"knew that these things were garbage, but at the same time he could feel their tiny breathless souls.\""}, {"userName": "Tammy", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/50603889-tammy", "userReview": "I predict that this book will be nominated for awards. It's that good."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "If I were to use one word to describe how I felt throughout this book? Engaged. And by that, I don’t mean this is a rip-roaring, fast-paced thriller of a book that left me jittery from a frenetic pace (But my heart was in my throat and my senses were firing … for other reasons). What I mean is that I was emotionally engaged -- hooked-- by the first sentence, and the few after it:  Having a life meant having a story. Even at eight, Edgar knew this. What he didn’t know was his own beginning. Newborn brains were mushy. If you wanted to know how your life had started, you had to get this information from other people. I was engaged with this young person from the first sentence, and then completely wrapped up in the lives of his mother, Lucy; his grandmother, Florence; his father, Frank … and even the host of secondary characters. I felt I knew them personally. I was emotionally invested in them – flaws and all; I cared about them, shared their sorrows and their joys. So, first and foremost, this is an exceptional character-driven novel that will have you inside the characters’ hearts and heads – not just in a cursory manner.I am still gob smacked at how realistic Lodato’s characters are. How one author can authentically portray the thoughts, mannerisms and confusions of an eight-year-old; a 28-year-old woman; and several seriously ill or emotionally damaged men and women of various ages – and make each voice unique – is just astounding. Lodato’s mastery of wide-angle third-person omniscient narration that winnows down into the thoughts and feelings of individual characters is impressive. That is one reason this book now earns the moniker “Melissa’s favorite reads of all time.”Another is the writing. It is gorgeous, drinkable, and delicious. Lodato is KING of the metaphor; he uses it in so many intriguing ways – to compare places and things, but also to describe sounds and sights, and emotions with such a clever and unique delivery. I highlighted entirely too many passages to mention them all, but consider these:How could the boy have come from her? Lucy was an open-faced sandwich; Edgar, a closed book. She ate like a day at the races – competitively; Edgar chewed cautiously, food taster to the king. ORThe leather-hushed interior of the car was like another weather system, with its gentle hum of cool-flowing air, the cloud cover of tinted windows, and the clean scent of pine blooming from a Christmas-tree-shaped air freshener hanging from the rearview mirror.So, so, so many more gorgeous passages on every single page.And while this is a literary, character-driven novel, I never once felt the pacing to be slow. I hungered to know more about these people, to understand how they connected, to discover pieces of their pasts, and to find out what their futures would hold. The author is daring, putting his characters through the wringer (resulting in this reader wringing her own fingers multiple times). There are twists and turns multiple times that left me breathless, sad, angry, happy. Emotional! Engaged!Though this is a story laced with elements of darkness and sadness, there also is a certain amount of levity provided by the humorous thoughts of the boy. I laughed aloud many, many times. Some of my laughter stemmed from Lodato’s descriptions of New Jersey, where the book takes place (my husband is from New Jersey, and many of Lodato’s descriptions had me vigorously nodding my head and cracking up).As an aside, I almost never enjoy stories with young narrators. In fact, I generally steer clear of them. But Lodato hit the sweet spot in his choice of an omniscient-to-close narrator, which allowed for beautiful language while, at the same time, accurately getting into the head of a child. Still. Blown. Away.So… If you love contemporary literary fiction with exquisitely drawn characters, excellent juxtaposition, symbolism, and thematic complexity, give this one a try. It may be a 500+page book, but it didn’t feel like it. It was, for me, a magical experience. My only regret is that this novel had been waiting on my shelf since April, even though I continually gravitated toward it once I’d finished another book then another; I should have read it sooner. For me, I just ‘knew’ it was going to be that kind of book after reading the first sentence. Next time I’ll trust my judgment and follow that instinct. And I will gobble up any future Victor Lodato books as soon as they’re published."}, {"userName": "Barbara", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/11701608-barbara", "userReview": "This novel will most certainly be on the best Literary Fiction of 2017 lists. The story is described as epic in scope on its jacket cover, and I concur. Domestic themes of love, loss, grief, forgiveness, and hope are threaded into this story of the human condition. The story moved me, and will be one that stays with me.Author Victor Lodato is a novelist and a playwright and uses his skills fantastically through the novel. The prose is beautiful and stunning. Furthermore, there is comedy mixed in to provide the novel with levity. Lodato uses playwright skill to pace the novel in such a way that the epic 533 pages are read with ease. It’s rare that a novel of that size is a page-turner like this one.Edgar Fini is a precocious eight-year-old albino trying to find his place in his world. He lives with his paternal grandmother, Florence, and his feisty, angry and disinterested mother, Lucy. Edgar’s schizophrenic father, Frank took his life in a mysterious way which Lucy and Florence avoid addressing. All three characters are joined together in their grief and trauma of Frank’s death. Lucy is damaged from her younger life and falters in mothering. Edgar is the school yard punching bag who is lonely and searching. Edgar goes missing, and Lucy emotionally wakes up and examines her life as a mother. Edgar’s journey is one of figuring out where he should be and his place in the world. Both odysseys are heart wrenching and human. There are many supporting characters that lend deep substance and humor. Lucy and Edgar are not alone, although neither recognizes this in the beginning. The story is a classic in forgiveness and redemption. I loved every sentence I read. Lodato is a talented author who writes of human fragilities with compassion."}, {"userName": "Mainlinebooker", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/600545-mainlinebooker", "userReview": "How many languages can you spell love? I would shout it from the rooftops exclaiming my adoration for this novel about a special little eight year old and his family. I could tell from the very first page that this was a novel that I was going to savor and enjoy. Eight year old Edgar is an unusual albino child born into a \"messy\" family with complicated love issues. Lodato has created a child with such wonder,imagination ,humor and pathos that I wanted to grab him and hold him tightly to my chest.It is a family narrative of love and grief taken to the extreme contexts,but the characters are so fleshed out that one feels as if they know them, although they may find some of them irritating or difficult to understand at first. Lucy, Edgar's mother, is pregnant with him at an early age, and due to her lack of maturity and upbringing, has absolutely no idea how to mother this child. However, her mother in law succeeds where she does not. Other characters enter this fray, and continue to set up obstacles as the young boy ages.My one slight disappointment was in the last few chapters which I thought were rushed and made me feel bereft of the fullness of the novel. However, no spoilers here. Just.read.it."}, {"userName": "Helen Simonson", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/2761578-helen-simonson", "userReview": "This tale gradually exerts a fiendish grip on the reader. A small strange boy in peril, with nothing but his wide-eyed innocence and faith in the world to save him. A flawed but loving mother overwhelmed... Beautifully written by Victor Lodato - whom I had the pleasure of meeting at a recent New York City reading."}, {"userName": "DeB MaRtEnS", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/9827967-deb-martens", "userReview": "I found myself comparing Lodato's style to that of Jeffrey Eugenides whose literary novels also burst with odd characters, circular plots, deeply complicated emotional relationships and unusual perspectives on all of the above. With such a meandering style, patience is required of the reader to allow the author to gather all the detail and pull it into a grand denouement, tying up all the tantalizing bits dropped along the way. I was patient. I waited. Unfortunately, I was never moved by any of the characters. The grand finale was less than grand for me. Questions went unanswered, but with so many situations and settings to account for, it is understandable. Lodato's tale attempted to take on the universal theme of \"time\" and supposedly how meaningless it is. That big ribbon just didn't manage to wrap up the package of Edgar and Lucy for me. I know that many adored this book. I kept comparing it to \"Middlesex\", and that was unfortunate. That novel is the perfection of oddball characters, important and difficult themes and a meandering plot done to perfection. Edgar and Lucy, for me, only made it part of the way. Barely three stars."}, {"userName": "Judy", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/3333943-judy", "userReview": "I had never heard of this author or his book until a reading group selected it. I am so glad they did! I loved every page.Victor Lodato is a playwright, poet and novelist, an occasional short story and essay writer. He has won awards and gotten a ton of writing fellowships. A hardworking writer, he was born and raised in New Jersey, the state where I grew up. This is his second novel.I loved the characters, even the \"unlikable\" ones of which there are many. I loved the oddness of the story which borders on the improbable but feels completely plausible while you are reading it. I loved the steady tension of the tale, though some of the reading group members felt he dragged it out too long. Personally, I feel any novelist who can keep me turning the pages in a state of high anxiety for that long deserves high praise.Edgar Allan Fini is an eight-year-old albino, being mostly raised by his grandmother in a small New Jersey town. Lucy is his unstable, unwilling mother. Edgar's father suffered from some kind of bipolar type mental illness and died when Edgar was an infant. Lucy's father was an abusive alcoholic, so she became a tough, wild young woman, which is why she stayed on with her in-laws after her husband's death and turned the job of raising Edgar over to her mother-in-law. We learn most of this from Edgar's young, unreliable viewpoint. He is an Owen Meany sort of precocious kid with a touch of something akin to Asperger Syndrome. I swear this novel has elements of many other novels but is not quite like any of them.Loss, secrets, abuse, mental illness, alcohol, predatory males, overbearing and overprotective old world grandmothering all paint a picture of blue collar life in New Jersey. Bruce Springsteen should compose the soundtrack if ever there is a movie.When Edgar is abducted by another unstable, grief-stricken man (though thankfully never sexually abused) both Edgar and Lucy deal with it in their own ways. Will Edgar ever make it back home from the Pine Barrens of New Jersey? Will Lucy ever grow up enough to deal with her past and her present, not to mention her future? That is what creates the tension.Perhaps Victor Lodato attempted to put too much into what is ostensibly a psychological thriller but I don't think so. I think he pulled it off. His writing is achingly beautiful and his dialogue is pitch perfect, as one would expect from a poet and playwright. His insight into people's hearts and minds rivals Shakespeare, if you ask me.In summary, the novel is not for the faint of heart or the squeamish. If you know me as a reader, you understand that it has just about everything I look for in a good read. I loved Edgar Allan Fini!"}, {"userName": "Maha", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/23423831-maha", "userReview": "This literary masterpiece can be mostly described as a love story. Well, not the romantic type of love. Edgar and Lucy is a book about kindness, about the endless humanly love that can even change fate.At the center of this epic novel is a precious eight years old child, Edgar. Edgar lives with his grandmother Florence and his mother Lucy. Florence is Edgar’s paternal mother. Both Florence and Lucy are Edgar’s only remaining relatives except for a maternal grandfather who couldn’t care less about his daughter and grandson. There had been a family tragedy. Edgar’s father had died in the most questionable way. No one wants to talk about that. However, the demons of this tragedy still torment Florence and Lucy, though in different ways for each one of them. While Florence had found her relief in dedicating her life to Edgar and filling the role of his mother, Lucy had been trying to immerse herself in drinking and relations. The threesome had found their way into living with each other.However, when Florence dies, Lucy and Edgar find themselves alone. They only have each other and they have to learn how to survive. Lucy is just beginning to realize how far she had been from her son’s life when new strategy strikes. Now the stakes are much higher. Through a very compelling novel, Victor Lodato takes us through the story of Edgar and Lucy and their journey. Will they be able to survive the new tragedy?The main hero in this novel is Edgar. He’s such a brilliant character invented by Victor Lodato. Seeing things through the inquisitive eyes of Edgar makes you sense the fear, joy and innocence of an eight years old child. There’s this wonder in his spirit like a little child visiting the circus for the first time. He has to learn a lot.  He is a real hero. With his eight years and innocent fear and weakness, he possesses a very powerful weapon. It’s his very loving heart. He has enormous love in his heart. It’s this love that saves him through very delicate and critical situations. He had received this love from Florence.  Through the watching eyes of the boy, he seems to have absorbed all this love and he’s radiating it to the world.Florence is the typical model of absolute grandmother love. She’s dedicated to the boy. I could relate with Florence so much. Though both my grandmothers had died long before I was born, my girls were lucky enough to enjoy this type of grandmother love. I see this bond of kindness and love between them and their grandmother and I realize how special and nurturing that is. It’s something different from a mother’s love. It’s very unique and precious.There’s a lot of kindness in this book. It’s this kindness that changes the sequence of actions in the book and gets people safely out of very risky situations. It touches my heart and keeps me thinking. How easy it is to inflict harm, but how enchanting and magical it is to prevent it through kindness. Like kindness is a weapon and a protective shield. It’s like a shining diamond in one’s heart radiating warmth and safety.There’s a wide cast of characters in this book. Each character in the book is unique and sometimes mysterious. Each has their own share of mystery, kindness and sometimes darkness. It’s great how Victor Lodato could set all their characters and direct them like they were performing on a stage with kindness as the playback melody.I enjoyed listening to the audiobook narrated by Victor Lodato. It’s amazing how he changed the tone of his voice with each character and situation, sometimes showing the fear and doubt in the boy’s voice and others the recklessness and despair in Lucy’s voice. Not only that. The book is a sea of emotions and Victor Lodato could adjust the tone of his voice to reflect every emotion and character.Forget about the Blurb. This is a book that you need to dive into to enjoy every part of it. Edgar and Lucy is one of the best books of 2017.**Special thanks to NetGalley & St. Martin's Press for supplying my copy of this book in exchange for an honest and unbiased review. This does not affect my opinion of the book or the content of my review. **For all my reviews please visit http://www.meshascorner.net"}, {"userName": "Karen", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/1299766-karen", "userReview": "I look forward to meeting the author in May and discussing this book with other Booktopians. Plenty to talk about."}, {"userName": "Nancy Brisson", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/7616365-nancy-brisson", "userReview": "Edgar and Lucy by Victor Lodato is a story of mental illness so severe that even love and medication cannot prevail. It is a story of grief that makes a person forget all the rules that humans should heed. And it is story of parenting both neglectful and obsessed; the story of a boy so small and pale he seems to have been born an albino child; a child so dependent on his grandmother, Florence, that when she dies he is too bereft to heed the protective advice routinely offered to children.- “never speak to strangers.”Lodato’s novel is well-written, but I was torn. The plot itself is not quite as formulaic as it might seem. This kept me reading. And clearly we cannot spend too much time thinking about the issues that arise from mental illness and our less-than-successful treatments and enabling behaviors. The rights of an individual to freedom are set against the chaos that comes with untreated serious mental illness, a set of circumstances which offers the mentally ill both a sort of dignity and the potential to destroy the balance of more than one life. Lodato makes us hope that we come up with better answers in the future. This issue, that continues to challenge us all, is frustrating, but is also a rewarding thread in this book.What I found hardest to take was the bad parenting the reader encounters in this story. Sadly, it is a fact that bad parenting is a common topic in modern literature. What happens to children when parenting is absent or inappropriate is heartbreaking and, although it probably reflects accurately on what is really the case (and not only in these times), I wish I could believe that exposure leads to improvement and that we get parenting right in the majority of families, however unorthodox the family might be. However, I have sincere doubts that such optimism is valid.There are plot twists in Lodato’s novel that I cannot discuss. The author uses internal cues to make us think that things will come out one way, while the outcomes are actually less predictable. This should be a good thing but ends up being a bit creepy in ways I cannot specify as I don’t want to interfere with letting readers judge this aspect of the novel as they read. It bothered me; it might not bother another reader. I am concluding with a belief that those who read Edgar and Lucy, by Peter Lodato will find in this novel an almost constant stream of personal emotional reactions. While it is a good read; it does not make it onto my list of favorites."}, {"userName": "Pam", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/3684954-pam", "userReview": "As I was reading Edgar & Lucy by Victor Lodato, I realized it’s been a while since I’ve read such an excellent book. I loved this book from the very beginning to the very end. It’s a long book that you don’t mind at all that’s it’s long, as a matter of fact, I would have gladly kept reading had there been more story to tell. But like the perfect book that it is, it ended on just the right note and left me completely fulfilled. The title of the book refers to Edgar and his mother Lucy. Lucy is widowed and a bit wild. Edgar is a thoughtful child dealing with the ramifications of being an albino. If I had to come with one word to describe this book it would be relationships. Every relationship is so developed, complicated and intricate like they are in real life. There is Edgar & Lucy, Edgar & Florence, Edgar & Conrad, Edgar & Jackie, Lucy & Florence, Lucy & Frank, Lucy & Ron, and even more smaller relationships. When you finish reading the book, you feel like you know these people, that they are your friends. While your getting to know all these characters and their relationships you are surrounded by prose so moving. The writing so beautiful. When we sit out on our back porch in the summer, we face an area of woods at the back of the lawn. Sometimes when there is a breeze, all of the leaves are nodding at once. I’ve watched them and wished that I could describe it. Well, Victor Lodato did and much more beautifully than I ever could:“The congress of leaves shivered and rolled, a voluptuous tossing that culminated in a vigorous nodding, as if all the trees agreed on something. The decision was unanimous; the answer; yes.” This book has everything: beautiful writing, excellent characters, and a few turns of plot that I didn’t see coming at all. Excellent. I received an ARC of this book."}, {"userName": "Krista", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "What terrible luck the Finis had. It was like a curse from a fairy tale; it never ended. Suicides and bridges and a child with marble skin. And though Netty never liked to think that anyone had worse luck than she and Henry, the truth was, the Finis did. They had very peculiar stars.\nI didn't know what to expect from Edgar and Lucy (and I totally recommend going into this read cold; the less you know beforehand, the better), and still, it was a constant surprise to me: the plot, the characters, the sentences. It's immediately apparent that author Victor Lodato is primarily a poet, and in addition to satisfying turns of phrase, the overall structure and themes are complex and literary; like a myth or epic poem. Yet in the end, I wasn't 100% on board with the plot – it had the feel of scaffolding: the (normally hidden) framework upon which the pretty stuff gets hung. And when the plot itself began to drag and refuse to resolve its crisis at about the two-thirds mark (of this longish book), I grew impatient. I'm considering four stars a rounding up – a nod to Lodato's tremendous skillfulness – and I'm only going to talk about the writing itself in general terms here; no spoilers. The following is an example of the poetical:\nWhat were they, these thoughts that had made her son's hands tremble? Even his eyes had trembled, like compass needles turning in dread towards some dark and unimpeachable north.\nThat passage wowed me on page seventeen, and made me think that I was in store for some very special writing – but I have to admit that there weren't nearly as many lovely bits as this set me up to hope for. Instead, Lodato's focus seemed to be more on the big picture, and as with any mythologist, he was heavy on the iconography: there are frequent bridges and tunnels; witches and widows; mirrors and timepieces; bodies of water and a sky full of stars. The past is always intruding on the present – ghosts walk the earth both literally and in relentless memory – and actions replay themselves throughout time; sometimes literally and sometimes flipped, so that madness leads to grief in one family, and grief to madness in another. Time itself is forever fluid and multi-streamed; a fact Lucy learned young:\nNew Jersey was a terrible place, the worst place in the world—and a teenaged Lucy knew that it would only get worse. She could see every part of the Garden State growing fatter and fatter – the people, the buildings, the cars, the hair, until, finally, there was no space between any two things and a mass suffocation ensued. As Lucy stared at her seventeen-year-old self in the window of the butcher shop, it suddenly made sense where the real pain was coming from. It was coming from the future.\n(It's no coincidence that Lucy has this revelation as she is mirrored by a butcher shop window.) And Edgar learned this lesson at an even younger age:Something was wrong with time.It had been wrong for years; maybe since the day he was born. His life was unfolding too slowly – more like a book when obviously life was a movie. He could see how his grandmother lay at the root of the problem. The way she'd made weeks out of minutes, and years out of days. His mother did it, too – falling into silences that had the bleak ardor of black-and-white photographs. The error with time was something he'd learned from them. And it seemed that today, the saddest day of the boy's life, time might stop completely.Lodato creates a lot of tension in the way that he makes his characters refuse to accept what they need – Lucy responds to affection with aggression, and Edgar doesn't take the simple steps that might improve his situation – and while this repeatedly frustrated me, as always, I need to admire a book that pulls so much emotion out of me as I'm reading; even negative emotions. I understand that Lodato is trying to capture a time and place with his writing about others: Edgar's bully is a cruel “fatty”; the neighbour girl is repeatedly called a “retard”; “Guineas” and “Pollacks” abound (conversely, the only two Black characters are noble and righteous). Less intentional, I'd imagine, is the way that Lodato turned me off with his writing about the women – Lucy's life would be better if she didn't sleep around (one reviewer said that she stopped reading this book when Lodato “rewarded” Lucy for changing her mind about an abortion; as though a male writer must have a religious agenda [and therefore, no right] to use this plot point; I'll need to think about that); the older generation of women are all selfless caretakers (and accept infidelity and abuse from their husbands); a “granny-bunned” woman detective is incompetent because she is a “novice female” and “neurotically prideful”. This repeatedly rubbed me the wrong way, but perhaps Lodato was trying to capture an archetype of femininity to satisfy his epic themes. In the end, I think this was the point:\nLearning kindness late in life was a kind of torture. The pain often came from the past, from kindnesses withheld. The knife was particularly sharp when those who most deserved your kindness were long gone. And unless you wanted to die of sorrow, you had to give this unspent kindness to those you loved less.\nUltimately, I'm a little ambivalent about his book – I didn't completely enjoy it, and it did feel unnecessarily long – but I can't deny that Lodato is a skilled writer; Edgar and Lucy might well win some awards."}, {"userName": "Jo Ann", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/227587-jo-ann", "userReview": "While I certainly did not care for some of the characters in this book, I loved 8 year old albino Edgar Fini...who could not care for this precocious, in many ways, and clueless in other ways, boy who placed \"crackers, water, a paper napkin, and a PINECONE (my caps) on a sick tray? Edgar's adventures with his father, mother Lucy of the title, loving yet smothering grandmother, and other characters you'll just have to meet, are adventures most of us would not care to experience. Lodato crafts some amazing sentences, some beautiful prose, and I wish I could meet him in May at Booktopia Vermont!"}, {"userName": "Loretta", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/3818887-loretta", "userReview": "\"Learning kindness late in life was a kind of torture. The pain often came from the past, from kindnesses withheld. The knife was particularly sharp when those who most deserved your kindness were long gone. And unless you want to die of sorrow, you had to give this unspent kindness to those you loved less.\"Wow.I'm not even positive where to begin. This book was not what I would call a pleasant read, but that was because I was so fully immersed into this world, so tensed by its occurrences, that the real world began to seem uninspiring by comparison.Constantly changing and surprising--truly surprising--this book has the unpredictability only provided by master storytellers. At various points, I found myself sizing up the story thus far, trying to get a general shape of what I thought would happen next, and inevitably I was wrong. At times, it truly seems to have the feeling where it's so outlandish that it has to be true--because who would be able to come up with a story like that?The characters are unique but lived in. The kind of people I would meet and think I could pigeonhole or stereotype pretty easily--after all, I've spent more than my fair share of time in New Jersey. But the author digs deeper, lifting up layer under layer. These people both fulfilled their stereotypes and transcended them. The genre is impossible to define. Is it a thriller? A ghost story? With its beautiful and profound statements, is it experimental literary fiction? Or is it something else altogether, a story that simply needed to be told, working its will until it poured out of the author? All I know is that it will wiggle around in my head for quite a long time. Somehow, through the use of baroque prose, the author turned the State of New Jersey into a land where ghosts, devils and angels fight over the fates of the living, where the wilds and paranormal are barely beaten back by the progress of human civilization, where mysteries will remain unsolved by science for generations or eons to come.I loved this book. Really, I found it deeply unpleasant in many ways, messy as love can be, but my goodness did I love it.5 very enthusiastic stars."}, {"userName": "Deb", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/2020999-deb", "userReview": "I don't know where to start! I loved this book. The writing style is just amazing with characters so layered. Edgar stole my heart and Florence will be with me forever. A story of love, ghosts, fear and loss. I cannot wait to talk about this and meet Victor at Booktopia!!"}, {"userName": "Linda Lpp", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/30129234-linda-lpp", "userReview": "This is one thick book! But am finding it interesting. Lots of depressed, pathetic people plodding along in their life. Hopefully someone or something will lighten the mood. Soon.Upon reaching the final pages, if I was the weepy type, the tears would be flowing. All the individuals in the story had realistic quirks and human sides you can relate to. The author managed to intricately weave the relationships of generations of families and friends from beginning to end of the book.Topics highlighted were many and exhaustive to say the least. I'm hardpressed to mention a few that stood out for me. HMM A couple of themes were family ties and strong bonds possible between a grieving man and a young surrogate son. That's all I'm going to say. I did find some sections confusing to say the least, but the rationale for inclusion must be known by author (and likely many of you). Not an easy book to read, but I've been touched by it. For some time I will think of Edgar, interestingly enough moreso than Lucy."}], "description": "\"I love this book.\" —Lena DunhamEdgar and Lucy is a page-turning literary masterpiece—a stunning examination of family love and betrayal. Eight-year-old Edgar Fini remembers nothing of the accident people still whisper about. He only knows that his father is gone, his mother has a limp, and his grandmother believes in ghosts. When Edgar meets a man with his own tragic story, the boy begins a journey into a secret wilderness where nothing is clear—not even the line between the living and the dead. In order to save her son, Lucy has no choice but to confront the demons of her past.Profound, shocking, and beautiful, Edgar and Lucy is a thrilling adventure and the unlikeliest of love stories.", "title": "Edgar and Lucy", "url": "http://www.goodreads.com/book/show/29939185-edgar-and-lucy", "average": 3.97, "cover": "https://images.gr-assets.com/books/1468802796l/29939185.jpg", "reviews": 598, "authors": [{"url": "https://www.goodreads.com/author/show/2907320.Victor_Lodato", "name": "Victor Lodato"}], "type": ["Fiction", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/29939185-edgar-and-lucy", "http://www.goodreads.com/book/show/6417409-mathilda-savitch", "http://www.goodreads.com/book/show/34629766-herman-melville-volume-i", "http://www.goodreads.com/book/show/23343083-jack-july", "http://www.goodreads.com/book/show/36212554-when-your-greatest-romance-is-a-friendship", "http://www.goodreads.com/book/show/7889908-motherhouse", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}