{"ratings": 3775, "userreviews": [{"userName": "Bill  Kerwin", "userReviewDate": "May 22, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "I wish I could love Edward II. Not only is its treatment of passionate male friendship unique in Renaissance English Drama, but its plotting is exemplary, its rhetoric disciplined, its imagery restrained, and—perhaps its greatest achievement—it expertly summons a coherent historical vision, calling forth the essential events from a myriad of incidents in order to convey a few hard political truths. In addition, not only did Marlowe’s portrait of a weak, self-indulgent monarch inspire Shakespeare’s characterization of Richard II, but his method of using history showed his fellow playwright the way, making possible not only the three great Henry plays but the Roman plays as well. Still, there’s nothing here to astonish me, as Doctor Faustus continually does, no grand rhetoric, like that of Tamburlaine to stir me like a big bass drum, no Machiavellian monologues from Barnabas or the Guise to horrify me with a smile. Marlowe the dramatic technician may triumph, but it is Marlowe the poet and evil genius I love, and I see little of him in Edward II.I’ll conclude with a little of that poetry--and a touch of that evil genius-- I did see here. Piers de Gaveston, the friend and favorite of King Edward, describes the pleasures and pageantry he will use to intoxicate the heart of the king.\nI must have wanton poets, pleasant wits,Musicians, that with touching of a stringMay draw the pliant king which way I please:Music and poetry is his delight;Therefore I'll have Italian masks by night,Sweet speeches, comedies, and pleasing shows;And in the day, when he shall walk abroad,Like sylvan nymphs my pages shall be clad;My men, like satyrs grazing on the lawns,Shall with their goat-feet dance the antic hay;Sometime a lovely boy in Dian's shape,With hair that gilds the water as it glidesCrownets of pearl about his naked arms,And in his sportful hands an olive-tree,To hide those parts which men delight to see,Shall bathe him in a spring; and there, hard by,One like Actæon, peeping through the grove,Shall by the angry goddess be transform'd,And running in the likeness of an hart,By yelping hounds pull'd down, shall seem to die:Such things as these best please his majesty."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "This is a marvellous play; it is clearly an equal to any of Shakespeare’s histories. It’s such a shame Marlowe had his life cut short; he could have been a real rival to Shakespeare if he wrote more. He’s only got a few plays compared to Shakespeare’s forty or so. He just didn’t write enough before he died; it’s a real tragedy because he had the talent to do so much more. Well, anyway, this is still superb regardless of Marlowe’s short repertoire of writing. I love the tragic elements, and I love the relationship between King Edward and his Gaveston. It’s complex and real. Edward is clearly madly in love with Gaveston, but I’m not entirely sure that his lover returns the passion. He has some feelings for Edward, this much is clear, but I think he is mainly using him for social advancement. He wants to get back at the nobles who have laughed at him, and looked down on his peasant class. So, he uses Edward as a shield to hide behind as he attempts to return the disdain. Well, the only problem is that Edward is a very flimsy shield. He is a weak King. Not just because he is homosexual, like the ignorant writers of  Braveheart will have you believe, but because he has no backbone. This isn’t because he is gay; he just happens to be gay as well as weak. The two are not related. His nobles push him around and bully him because of his lack of strength. They manipulate him and he doesn’t have the power to prevent it. Gaveston is a stronger man than he in this. He stands up for what he believes in whereas Edward just lets the world overrule him. He lacks the abilities of a strong ruler. His wife is a more authoritative monarch and his young son even more so. All in all, Marlowe’s Edward is a doormat. Indeed, he causes his own demise at the end of the play, which is a horrible end; it’s almost a mockery of his sexuality. He gets killed by having a hot poker shoved up his arse. This is to prevent physical evidence of his murder being easily perceivable on his corpse. I mean, the medievalists wouldn’t check there for a cause of death if they checked at all. It’s horribly ironic and brutal. It’s actually based upon some flimsy truth, but there are all sorts of conspiracy theories about that. Personally, I love the way Ken Follet handled it  The World Without End. He let his Edward escape, but Marlowe couldn’t of done that in a play; it needed its tragic ending.“All live to die, and rise to fall.” The two lovers caused their own deaths. Edward was too absorbed in his lover’s arms where as Gaveston was too arrogant. He attracted the wrath of the nobility when he needed to be humble to survive. He pushed them too far and angered them too much. They were both fools, but characters that can easily be sympathised with. Edward saw nothing but his Gaveston, and Gaveston saw nothing but prestige and glory. It’s a great play; I wish I could find a copy of the Ian Mckellen version somewhere. I bet he nailed the role."}, {"userName": "Jean", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "[Edward's death with a red-hot poker thrust into his bowels (hide spoiler)]"}, {"userName": "Andrei Tamaş", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/25858385-andrei-tama", "userReview": "Tragedie istorică în cinci acte, surprinzând întreaga domnie a regelui Eduard al II-lea al Angliei. Marlowe comprimă realitatea istorică, din considerente de spaţiu. Opera merită citită, dacă nu pentru cunoaşterea romanţată a istoriei în sine, cel puţin pentru sentimentul de frustrare dobândit în urma relevării unor caractere înzorzonate cu grade ereditare, pioase şi de o uscatime aristocratică, figuri ce conduc destinele atâtor oameni şi în numele cărora se moare fără rost."}, {"userName": "Micha", "userReviewDate": "Jan 05, 2008", "userURL": "http://www.goodreads.com/user/show/165422-micha", "userReview": "What I've learned? When it comes to choosing between your kingdom and a pretty boy, you should probably choose your kingdom. Not that I would, but that probably just strengthens the point."}, {"userName": "Bettie☯", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Bettie's Books"}, {"userName": "David Sarkies", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/5856247-david-sarkies", "userReview": "A story of sex and politics15 February 2014\tMy first encounter with this play was a movie that I watched once on SBS (the Special Broadcasting Commission for you non-Australians – this television station specialises in foreign and art-house programs, and soccer, however it has earned the moniker of 'Sex before Soccer' because a lot of the foreign movies are quite saucey) and I would have to say that this movie pretty much falls into the category of 'gay cinema'. Now, because I am not homosexual I have never been interested in gay cinema, however this movie intrigued me even more when I discovered that it was written by the one and only Kit Marlowe.\tAs I read through this play (the second time that is) I came to realise how it does fall into the category of gay literature because it revolves around the love affair between King Edward II of England and his lover Piers Galveston, who happens to be a commoner. In a way this play could easily be about any king of that period who falls in love with a commoner, however the fact that his lover is male no doubt adds insult to injury. Kings would have had their fare share of concubines and prostitutes, and while I thought that the issue that confronted the antagonists of the play was that he was sleeping with a commoner, the more of think about it the more I realise that this probably went on all the time.\tThe problem was that his lover was a man, and a commoner, and the concern that the antagonists had was that Galveston held power over Edward and as such could use his influence as Edward's lover to better his position, as well as holding the hear of the king. However Galveston is pretty quickly dealt with by the antagonists, much to the king's horror, and we then learn that he finds himself another lover. What is really interesting is that this story is true – according to this play Edward II was a homosexual, and the only reason that he married Queen Isabella was so that he might have legitimate children to inherit the throne.\tOne could see this as a tale of a jilted lover, that being Isabella, who was effectively sidelined in favour of Galveston, but the truth of the matter is that royalty do not marry for love, they marry for political convenience (or at least they did in those days) so it would not be all that uncommon for royals to only have sex with their partners to produce legitimate offspring. Further, I am not convinced that the problem necessarily lay with the fact that Edward was having an affair with another male because no doubt that was occurring as well, but the problem was the status of his lover. A king could not marry a commoner, but no doubt he could have one as a concubine. However I suspect that it was different when it came to males because what we see here, and it is emphasised throughout the play, is that this was not the Greek or Roman idea of an old man sleeping with a young man, but rather a relationship of love, and a relationship that threatened to upset the social order – he was in love with a commoner and was raising the commoner to the position of a noble, which was something that was not to be done.\tHowever, as the play moves on (and Marlowe has compressed the entire reign of Edward II into the play, as well as the epilogue where Edward III seeks revenge against the antagonists Mortimer and Isabella) it comes to light that Edward is not a strong king, but Mortimer, being Isabella's lover (and there is no criticism of that relationship) has gained such power that he is able to take the position of regent (namely the king that rules in place of a child king) and arranges for Edward's death. Yet Edward was not universally hated, particularly since Edward III after his coronation orders the release of his uncle, and then turns on Mortimer to make sure that his reign does not come to an abrupt end (as generally happened in those times). Mind you, from what I have read of the story of Edward III dealing with Mortimer, it was a lot more bloodier than occurred in this play, however the name of Mortimer has now come down to us as the atypical name of a bad guy. \tSuch is the power of the literary genius."}, {"userName": "Rozonda", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/1899-rozonda", "userReview": "Like Shakespeare's Richard II, Edward is an ineffective ruler but not an evil one; Richard prized luxury and pleasure, Edward is blinded by his love for a male commoner. Contrary to what one might think, it's not his homosexuality which offends the nobles (they comment is a typical \"weakness\" of rulers and noble minds, remembering Alexander or Socrates) but his choice of a low class lover.Edward is unable to play his cards well and his wife and subjects rebel against him, murdering his beloved. Even if we know he brought about his own disgrace we can't help but pitying this helpless king who is brutally murdered and we cheer when his son avenges him rightfully.A story of power, desire and human failure, Edward II is poignant and beautiful and probably Marlowe's masterpiece."}, {"userName": "Ana Rînceanu", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/28781546-ana-r-nceanu", "userReview": "The 1970 stage adaptation of this play stars Sir Ian McKellen and James Laurenson. It is perfection!Your lover or your kingdom... you decide..."}, {"userName": "Lolita", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/11944206-lolita", "userReview": "[So i was like this ....bored, tired, sick of studying.... suddenly boom....the professor started talking about the life of Christopher Marlowe, so this man is a bad-ass latterly, he was murdered when he was only 29. He was a double spy who served the quin Elizabeth who saved him from getting into prison by interfering a lot of times, and who belonged to a dangerous group called \"The School of Night.\" He took the PHD and the Ma Student. He was a very dangerous man as she said. nice....i am telling you his life is not boring, it is actually very... very interesting.sorry, my point is that i decided to read all his works, and by accident i discovered that he had a play talking about a king and his homosexual lover and then i became like SOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO SHOCKED... I searched the web, downloaded the book and started reading.... and wow...look what the lover \"Gaveston\" says \"I have my wish, in that I joy thy sight;And sooner shall the sea o'erwhelm my land\" me heart becomes like this king Edward \"Thy worth, sweet friend, is far above my gifts,Therefore, to equal it, receive my heart.If for these dignities thou be envied,I'll give thee more; for, but to honour thee,\" the evil conspirators nobles \"We'll hale him from the bosom of the king,And at the court−gate hang the peasant up,Who, swoln with venom of ambitious pride\" the Q. Isab 'the wife' \"Unto the forest, gentle Mortimer,To live in grief and baleful discontent;For now, my lord, the king regards me not,But doats upon the love of Gaveston.He claps his cheeks, and hangs about his neck,Smiles in his face, and whispers in his ears\" the king plead his love to Gaveston \"Because he loves me more than all the world.Ah, none but rude and savage−minded menWould seek the ruin of my Gaveston;You that be noble−born should pity him.\" after they make him exile his lover \"I'll come to thee; my love shall ne'er decline.\" To be continued....  So, this is a play, about a weak king who falls in loved with a low ranked man. his followers wouldn't accept the fact and they rebel against him, killing his minion. he gives everything for his revenge, his crown, England, and his soul \"O Gaveston, 'tis for thee that I am wrong'd,For me, both thou and both the Spencers died! And for your sakes a thousand wrongs I'll take.The Spencers' ghosts, wherever they remain.\" it is a true love and sincere passion. the play ends after the death of many characters, between them the king Eduard himself. It is very sad but i couldn't imagine a better ending, especially that it ends with justice. The weakness of the father, and the story of the father leaves Edward the III no choice but to be strong and rough against those who conspired against his father and killed him a long with his uncle. my rating is 5 stars...it is an amazing play.although it took from me a lot of time, but if i didn't have to study, i would have finished in less than a day. *something i didn't like was Edward's moaning an wailing, another is the lack of stage directions, but then you have to work your imagination on it, you could even imagine the happening in side the doors :) ....I highly recommend this book, to those who seek for true love, and a relationships between two different ranks....I think it is like my professor said that if Marlowe wasn't killed when he was young, he would achieve a lot, and he could compare Shakespeare. don't think that i am ignorant about Shakespeare's art cos I've read a lot of his poems. WARNING.WARNING.... DO NOT WATCH THE FILM. I REPEAT, DO NOT WATCH THE FILMIt is a total deformation for this masterpiece, and for the two characters specially Gaveston. thank you my professor. happy new year, and god bliss you...heheMUAH (hide spoiler)]"}, {"userName": "AGamarra", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/45926752-agamarra", "userReview": "\"Cual Juno en delirio llenaré el campo de murmullos, de suspiros y gritos; pues tras Ganimedesl no chocheo Júpiter tanto como él tras el maldito de Gaveston\"Me gusto mucho y también me sorprendió esta tragedia. ¿Recuerdan a aquel príncipe homosexual y apocado de la película \"Corazón Valiente\" hijo del rey apodado piernas largas? Bueno pues ese es Eduardo II. Esta tragedia me permitió conocer una parte de la historia de Inglaterra que ignoraba. Pues parece que su amor por el noble francés Gaveston llevó a la completa perdición de Eduardo II.Toda la debilidad del rey y sus excesos de orgias y derroches llevan a la escalada de diferentes nobles como Kent, Lancaster, Warwick y muchos más, liderados por el valiente y galán Mortimer quien de paso sedujo a la reina, esposa de Eduardo II, Isabel, que hace en parte mala fama a las francesas pues me enteré que es llamada la reina loba.Es una pieza muy interesante, me gusta mucho el dinamismo y la gran acción que hay en las obras de MArlowe, sobre todo las últimas, las hace muy emocionantes y también me parece que sabe balancear entre la acción y los parlamentos líricos, pocas obras de Shakespeare creo son tan vertiginosas.Excelente adaptación histórica y como siempre un grado de crueldad en esta interesante pieza."}, {"userName": "Lizara", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/40593256-lizara", "userReview": "estoy en SHOCK general con esta obra eh(me la he leído teniendo delante la versión de Ian McKellen de 1970)"}, {"userName": "Alejandro Teruel", "userReviewDate": "May 10, 2014", "userURL": "http://www.goodreads.com/user/show/5625189-alejandro-teruel", "userReview": "An interesting historical play on \"The troublesome reign and lamentable death of Edward the Second, King of England; with the tragical fall of proud Mortimer\", by Shakespeare´s contemporary and rival, Kit Marlowe.Nowadays, it is probably inevitable to start by comparing the two authors; in the case of this play perhaps the closest comparison would be to Shakespeare´s Richard II, which indeed is sometimes said to have been inspired by Marlowe´s drama. Both plays are based on similar chronicles about weak Plantagenet kings during the turbulent times framed by the War of the Roses. They are both historically inaccurate, carefully written to pass the censureship constraints and to comply with the propaganda needs and desires of the Tudor dynasty which overthrew and succeeded the Plantagenets. Both plays depict the unruly and often bloody, machiavellian political power struggles of the times, between king and feudal barons. They are fast-paced, gory narratives with memorable key scenes with twisting plot lines as the struggle favours now one, then another party.Although Marlowe appears to have a better grasp of classical education, which shows itself in allusions to greek and roman deities and in its inclusions of some passages in latin (usually cut in modern productions), Marlowe´s language in this play is sparer and, for the modern reader, simpler than Shakespeare at the stage of Richard II; there are fewer allusions and less word play and punning. Marlowe is crueller and more sadistic. The final death scene of Edward II is more harrowing than anything in Shakespeare, with the exception of the blinding in King Lear. Marlowe reports on Edward´s cold-blooded gaolers indulging in psychological deprivation and physical hardships in order to break the king, while the professional assasin, Lightborne, relishes in his knowledge of methods of murder, dwelling, for example, in detail on the use of particular poisons. He calls on his assistants to \"..lay the table down, and stamp on it/But not too hard, lest that you bruise his body\", thus, presumably letting Edward die of internal injuries, to the point where Lightborne gets carried away by his handicraft and proudly exclaims in self-admiration \"Tell me sirs, was it not bravely done?\".If you like Shakespeare´s early historical plays, I would highly recommend this play, if only to see what sort of competition Shakespeare was up against in his own time. I would also recommend reading this play while listening to the first two episodes of BBC Radio´s 1977 26-episode BBC radio drama Vivat Rex, in which John Hurt portrayed Edward. These two episodes constitute a slightly abridged version of the play and add a narrator (Richard Burton) to help identify where and when the different scenes take place."}, {"userName": "Timothy Ferguson", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/5448045-timothy-ferguson", "userReview": "It’s always interesting to listen to Elizabethan plays which aren’t Shakespeare. It lets you see how much of the grandeur of his work is based one what, back then, was a sort of national style. Marlowe does good work here, and the readers in the Librivox version are great, but he’s let down a little by the historical events he’s chosen to portray, and the political slant he takes. Basically this is the period where Edward II is infatuated with Piers Gaveston, and splits his realm in half over it. I presume I’m meant to be on Edward’s side, as he loses everything for love. It is, however, hard favour him, because he goes about the whole business in such a dreadfully stupid way.If he’d just kept Gaveston as an Extra Gentleman of the Wardrobe, it would have been considered a bit odd, but since he’d already fathered an heir, it would have been easy enough for him to get away with. Some of the Stewarts get away with this sort of thing. His flaw is that he wants to make his lover the most powerful noble other than him in the Realm. Powerful forces of reaction rise up and destroy him. Then Marlowe chickens out on the real historical drama and has Edward III roll in and kill the conspirators.In real life, the queen and her lover, Mortimer, controlled the kingdom. Young Edward, knowing he’d be killed if he got in their way, played a masterful game of pretending to be a young buffoon. He used tournaments and binges to mask the consolidation of a power bloc within the younger generation and those disaffected with the current regime. Then, with a band of his tournament friends, he captured and executed Mortimer, and forced his mother into a nunnery. I think Edward’s early life is a great story, and Marlowe just skips it entirely.Recommended for Shakespeare fans, and those liking stories of tragic infatuation.This review originally appeared on book coasters"}, {"userName": "Manik Sukoco", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/44105134-manik-sukoco", "userReview": "The edition of Edward II I read was the New Mermaid Series one, which had a very good and informative introduction, and has the spelling modernized. The spelling modernization extends to place names as well as general terms. I am not sure how I feel about spelling modernization, as it is nice to see how the work was originally spelled, but it made the work very easy to read. The play itself is amazing, very engaging even though it is a history, and is mostly based on things that actually happened. The language is not as flowery as Shakespeare, but is lovely nonetheless. Some of the characters of the play are very fickle, and seem to suddenly change as you read the text of the play. (Queen Isabella goes from devoted and self-sacrificing wife to cunning adulteress.) It makes more sense on stage, and after seeing this play, it was easier to see how good it is."}, {"userName": "Laura", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "From BBC Radio 4 Extra:Richard Burton narrates the playwright's chronicle of the English Crown. Marlowe's Edward II faces rebellion. Stars John Hurt.http://www.bbc.co.uk/programmes/b01gxn5p"}, {"userName": "Ella", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/53142700-ella", "userReview": "[All around, this was a stimulating and exciting read. The more I study literature from the renaissance, and really throughout all of history, the more it seems to map out a culture of suppressed queer sexual and gender experiences, a world subjugated to a heteronormative patriarchal narrative, but writhing at the seems to acknowledge a whole other world of alternative possibilities. I find this fascinating and, in a way, reassuring. (hide spoiler)]"}, {"userName": "Lona (Windowsill Books)", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/5733925-lona-windowsill-books", "userReview": "Read this for my English Renaissance: Love, Sex, and Power course."}, {"userName": "Amira", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/7755276-amira", "userReview": "Edward II is a great play. Yet it cannot be a rival to any of Shakespeare's Histories. It is a play on (gay) sex and politics."}, {"userName": "Joseph", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/4210703-joseph", "userReview": "Review on my blog!"}, {"userName": "Mandy", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/1836835-mandy", "userReview": "3 stars instead of the 4 the play probably deserves only because my edition had endnotes instead of footnotes, which was endlessly frustrating and flow-obstructing. Not the play's fault, but the experience (unfairly) tainted the play in my first reading of it. Edward II  is less boisterous than any of the other Marlowe plays I've read, which given the subject - the deposition of King Edward II because of his low-class and homosexual love affair with Piers Gaveston - makes sense. Despite the bawdy puns, the play remains somber and intense throughout. As someone in my class mentioned: \"the play is almost determined not to be liked.\" Very chilling (and potentially nausea inducing) ending."}, {"userName": "Samantha", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/5856236-samantha", "userReview": "Wow. Such a boring play. Edward II comes off as a whining idiot. His affection for Gaveston is pathetic and I cannot believe he lasted as king for more than a few weeks. I am not entirely familiar with Edward II as a real person, therefore I cannot comment much on this representation of his character. It does make me wonder how he would react to it though. In this play, he is portrayed as a love sick idiot who is so taken by a man that he forsakes his wife. There is much more to it, but that is mostly what I got from my reading. It was hard to keep my eyes open during this one. I must say, I do not like Marlowe's writing. Shakespeare is much more my cup of proverbial tea."}, {"userName": "Julianthebarbarian", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/29507754-julianthebarbarian", "userReview": "I saw this play at London's National Theatre, so this is as much a play review as a script review. Although the play has its faults, Marlowe expresses the love between the King and his male lover so tenderly that it is SO moving, even to a non- gay like myself. Hanging over this is the knowledge that this is a doomed love, and it must all end with Edward's cruel murder. This play is a part of gay London's history, as it was put on in the sixties ((I think about '69), when people were still reluctant to confront gay issues - but because this is \"culture\" ( darling) no-one could argue for it to be closed down,as they did with other gay plays of the time."}, {"userName": "Graham", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/1760824-graham", "userReview": "I remember reading EDWARD II in class while studying A-Level English Literature. We got a lot of out fun of it. I was playing Edward and a buddy of mine was Gaveston. We were 16 year olds so you can imagine the laughs we had.Looking back, this was a strong, solid play and almost as good as the stuff Shakespeare was writing during the same period. The level of ultra violence is there as well as the telling of a genuine historical story. I only knew Edward as that guy in BRAVEHEART who got chucked outta the window so this was enlightening stuff."}, {"userName": "Mike Jensen", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/2269105-mike-jensen", "userReview": "This excellent student edition is a good place to begin with Marlowe and this thrilling play. I think editor Martin Wiggins is quite right that Edward's downfall came not because he was homosexual, but because of the political mistakes he made in giving away favors, taxing the barons, and taking advantage of them. He may do much of this because he shows favor to his lovers, but those who bring about Edward's downfall tolerate his lovers until Edward's actions affect them. Great insight into a great play."}, {"userName": "Samet ", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/5945423-samet", "userReview": "What a historical figure.How adorable, how pleasing love is.The intimacy of two men regardless of disparate backgrounds, regardless of hostile and evil attitudes.Love is love.Love is love.Edward's inner world, naivety that grasp my whole attention.What a great reading experience it was."}, {"userName": "Jamie", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/1098316-jamie", "userReview": "Written in 1594 with a slightly cryptic typeset where 'f' is 's' and 'f', 'VV' is 'W,' 'u' is 'v' and 'u,' etc., yet after a few pages the conversion of letters becomes almost automatic. Long play, large cast of characters, with important death scenes too briefly brushed away. Yet this is a rare play that is able to turn a villain into a hapless human being and a virtuous hero into a villain."}, {"userName": "Amy V", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/16957555-amy-v", "userReview": "I love Marlowe, and this is one of his best - confusingly heartbreaking and brilliant and incredible. Edward's speech in Act 3 Scene 2 (lines 128-47) is so fantastically bombastic that I just want to have it played on loop constantly. If I had a one-use time machine I would 100% spend my singular journey preventing Marlowe's premature death."}, {"userName": "Melissa", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/15207800-melissa", "userReview": "What. The fuck. Did I just read."}, {"userName": "Alex Norcross", "userReviewDate": "Dec 12, 2008", "userURL": "http://www.goodreads.com/user/show/1160586-alex-norcross", "userReview": "An interesting glimpse at English Renaissance homosexuality and an interesting study on the nature of kingship and rebellion."}], "description": "The last of Marlowe's great dramas, often considered his masterpiece.", "title": "Edward II", "url": "https://www.goodreads.com/book/show/209186.Edward_II", "average": 3.67, "cover": "https://images.gr-assets.com/books/1172699144l/209186.jpg", "reviews": 145, "authors": [{"url": "https://www.goodreads.com/author/show/11155.Christopher_Marlowe", "name": "Christopher Marlowe"}], "type": ["Plays", "Drama", "Classics", "Historical", "Plays"], "outlinks": ["http://www.goodreads.com/book/show/209186.Edward_II", "http://www.goodreads.com/book/show/5879611-edward-ii", "http://www.goodreads.com/book/show/18778994-edward-ii", "http://www.goodreads.com/book/show/7802889-edward-the-second", "http://www.goodreads.com/book/show/10016573-edward-the-second", "http://www.goodreads.com/book/show/6284082-edward-ii-marlowe-s-plays", "http://www.goodreads.com/book/show/464833.Edward_the_Second", "http://www.goodreads.com/book/show/953497.Edward_the_Second", "http://www.goodreads.com/book/show/18525.Dr_Faustus", "http://www.goodreads.com/book/show/27803.The_Jew_of_Malta", "http://www.goodreads.com/book/show/18526.The_Complete_Plays", "http://www.goodreads.com/book/show/143487.Tamburlaine", "http://www.goodreads.com/book/show/18533.Doctor_Faustus_and_Other_Plays_Parts_1_2"]}