{"ratings": 5332, "userreviews": [{"userName": "Bill  Kerwin", "userReviewDate": "May 21, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "In this fifth entry in the Scudder series, Matt is hired by high-class hooker Kim Danniken. She is determined to leave the life, and, fearing her pimp Chance may try to stop her, she figures she may need Scudder's help. Things seem to be going well at first, but then somebody ends up dead, and Scudder realizes he has a much more complicated job on his hands.The plot is interesting, with a few twists and turns, some memorable characters (“Danny Boy” Bell, the black albino dwarf tipster; Chance the elegantly dressed pimp, connoisseur of African masks; Donna Campion, half-hearted hooker and accomplished poet), and more than a few exciting and atmospheric scenes.But the heart of the book—and the reason why I love it—lies elsewhere. It is filled with countless examples of two different kinds of small stories: the ones the newspapers tell its readers about sudden death in the city and the ones AA members tell each other about the ways alcohol has damaged their lives. You see, alcohol is trying to kill Matt Scudder, and maybe New York City is trying to kill him too, and it is through the contemplation of both kinds of stories that Matt comes closer to confronting his demons and getting on with what is left of his life.This is not only the finest Scudder so far, but a landmark and milestone of the hard-boiled genre. It is of course a genre forever tied to the magic of particular cities, but this book is the only one I know that consciously uses the city's stories, the tales of the dead and the dying, as a sort of urban necromancy, a way of calling the hero forward, out of the depths of his city, squinting in pain toward the New York light."}, {"userName": "Kemper", "userReviewDate": "Sep 22, 2007", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "Someday I’m going to get around to putting together my list of the greatest mystery/crime novels I’ve read. When I do, this one is going to be very near the top.Matt Scudder is still working as an unlicensed private detective, and he is approached by an upscale prostitute named Kim. She wants to quit the business but is nervous about telling her pimp, Chance. Kim hires Matt to break the news to Chance and gauge his reaction to see if he’ll try to keep her working. After Matt tracks Chance down, he’s surprised to find that the pimp seems reasonable and doesn’t object to Kim leaving. Matt passes the word along to Kim and thinks his work is done. Days later, he’s shocked to learn that Kim has been brutally murdered. Matt’s also got a personal crisis going on. His drinking has started taking a big toll on his health, and he’s had enough blackouts to finally admit that he’s got a problem. So he is attending AA meetings and trying to stay sober as he tracks Kim’s killer.From what I’ve read, Lawrence Block was originally going to end the Scudder series here, and it would have been a natural stopping place by the end of the book. Instead, this became the end of the first phase of Matt’s story. The mystery in this one is good as usual, but what makes this one special is Matt’s battle with the bottle. The usually steady Matt is jittery and on edge. He attends AA meetings and is often fascinated by the stories of others, but won’t talk himself. He’s constantly aware of his craving for booze, but is also always trying to rationalize that it’s not that big of a deal. It’s not helping that this was written during the early ‘80s when random murders in New York were reaching record levels. Matt compulsively reads the newspapers and is horrified by the prospect of violent death that seems to lurk around every corner, and his interactions with a cynical cop aren’t doing much for his state of mind. Block’s depiction of a Matt struggling to come to terms with his alcoholism is one of the best stories about addiction I’ve read, and the backdrop of a decaying New York overrun by crime makes you feel Matt’s desperation. It seems like drinking is the only sane response to the madness he sees all around him, but he’s honest enough to admit that he’s really just trying to find a reason to get drunk. The real mystery in the book isn’t about who killed Kim, it’s whether Matt will ever be able to get sober."}, {"userName": "William", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/36549125-william", "userReview": "Fabulous. A masterpiece of crime-noir.5-StarsBlock's dialogue in previous books has been good, but here he's gone nova. Wow. There are many characters with extended dialogue sequences in this book, and all of them are terrific.The plotting is deliciously complex, and the pacing is fantastic. Wonderful prose with great rhythm. Everything about this Scudder story is superb. As usual with my reviews, please first read the publisher’s blurb/summary of the book. Thank you. Matt's giant leap to the solution takes some re-reading, and some faith, and there's a bit of an info-dump in his explanation to Danny Boy near the end. So call it 5.5 stars for the dialogue and plot, and -0.5 stars for the info-dump... Overall then, 5-Stars. Well done!Note: I have 17 years of terrible familiarity with alcoholism. When a member of a family is an alcoholic, then all members are. Just like the alcoholic, we can't stop either. It's so destructive, and such a waste of life and love. I'm not sure how I'll be able to deal with this aspect of the book. 😥Update: I was impressed with the veracity of the struggle, and the compassion with which Block portrays the rollercoaster, and especially for the ending of the book.Some wonderfully-drawn characters here... a sample:Danny Boy\"Thirty dollars for tickets and fifty for my time... I’m sorry I have to ask you for money. If it were a track meet I wouldn’t charge you a cent. But I’ve never cared for boxing. If it’s any consolation, I’d want at least a hundred dollars to attend a hockey game.” Chance“They think they’re irreplaceable. If she had any notion how easily she can be replaced she’d most likely hang herself. The buses bring them, Scudder. Every hour of every day they stream into Port Authority ready to sell themselves. And every day a whole slew of others decide there must be a better way than waiting tables or punching a cash register. I could open an office, Scudder, and take applications, and there’d be a line halfway around the block.” KimThe resolution provided relief and release and precious little pleasure. I drew away from her and felt as though I was in the midst of an infinite wasteland of sand and dry brush. There was a moment of astonishing sadness. Pain throbbed at the back of my throat and I felt myself close to tears. Then the feeling passed. I don’t know what brought it on or what took it away.Lovely. I know this feeling. When you reach a certain age, you cry for the pain that will come for the young. Reminds me of a quote -“Youth endures all things, kings and poetry and love. Everything but time.”  ― James Crumley, The Last Good KissMattBut I had another motive, and perhaps it was a deeper one. Searching for Kim’s killer was something I could do instead of drinking. For awhile, anyway. 😥 FranHalfway down the stairs I started laughing. How automatically she’d slipped into her whore’s manner, warm and earnest at parting, and how good she was at it. No wonder those stockbrokers didn’t mind climbing all those stairs. No wonder they turned out to watch her try to be an actress. The hell, she was an actress, and not a bad one, either. Two blocks away I could still feel the imprint of her kiss on my cheek. DonnaLovely... One of the girls quotes Kipling, and Scudder completes the verse with: Are sisters under their skins. The Ladies - Rudyard KiplingRubyShe didn’t know if Kim had had a boyfriend. Why, she wondered, would a woman want two men in her life? Then she would have to give money to both of them. I suggested that Kim might have had a different sort of relationship with her boyfriend, that he might have given her gifts. She seemed to find the idea baffling. Did I mean a customer? I said that was possible. But a customer was not a boyfriend, she said. A customer was just another man in a long line of men. How could one feel anything for a customer? Mary LouFor the first few months she still thought she was doing research for a book. She took notes every time a john left, writing down her impressions. She kept a diary. She detached herself from what she was doing and from who she was, using her journalistic objectivity as Donna used poetry and as Fran used marijuana. When it dawned on her that whoring was an end in itself she went through an emotional crisis. She had never considered suicide before, but for a week she hovered on its brink. ...“I think Chance is the elephant and his girls are the blind men. We each see a different person.” And there are also other fine characters, especially Durkin and the lovely Jan, and with a nice minor role for Alice (with the cat, Panther).."}, {"userName": "James Thane", "userReviewDate": "Mar 23, 2010", "userURL": "http://www.goodreads.com/user/show/3483907-james-thane", "userReview": "Every time I post a review of one of Lawrence Block's Matthew Scudder novels, my strong temptation is always to begin by saying that this is one of my favorite books in the series. The problem is that I love every last one of them and so they're all my favorites, which I guess makes Eight Million Ways to Die one of my Most Favorites.The story at the heart of the novel is fairly simple and straightforward. A beautiful young call girl named Kim Dakkinen wants to leave the business, but she's worried that her pimp might object and perhaps harm her if she tells him that she's abandoning ship. So, on the recommendation of Elaine Mardell, a call girl with whom Scudder has been intimate, Kim asks Scudder to intercede and speak to the pimp on her behalf.As most crime fiction fans know, Scudder is an ex-cop who now works as an unlicensed P.I. He also has a problem with alcohol that is getting progressively more serious, which is why, when the young woman first consults him, she finds Scudder in his \"office\" at Armstrong's saloon.Scudder agrees to take the case and tracks down the pimp, whose name is Chance and who seems to be unusually wise and sophisticated for someone in his profession. Chance assures Matt that Kim is perfectly free to leave if she so pleases. Chance insists that hookers are a dime a dozen, and that he'll have no problem at all replacing her in his string.Everything seems copacetic, but then, a couple of nights later, poor Kim turns up savagely hacked to death in a hotel bedroom. Scudder assumes that he's been betrayed by the pimp and feels a moral obligation to bring the killer to justice. From there the story takes more than a few interesting turns before ending in one of the best conclusions of any book in the series.It's always fun to watch Scudder investigate a crime. This story is set in the early 1980s, before the invention of all the technological innovations that are now available to a P.I., and so Matt will spend a lot of time walking around town, talking to people and attempting to sort things out. He also spends a lot of time looking for working pay phones. But what sets this series apart from virtually any other is the fantastic job that Lawrence Block does in developing the character of Matthew Scudder. Scudder's descent into alcoholism began with the very first book in the series, The Sins of the Fathers, and as I suggested above, it has grown progressively worse until by this point Scudder's health and, indeed, his very life are seriously at risk. Scudder wrestles with the problem as he struggles to solve the murder and watching him do so is as gripping as the plot of any crime novel. Block handles it brilliantly, and the way he does so, for me at least, makes this book one of the true standouts in what remains my favorite series of crime novels."}, {"userName": "Carol. ", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "A book about the mystery of a dead hooker becomes a book about Matt Scudder taking one day at a time, trying to save himself from alcohol. The prose was dry and matter-of-fact; the words of a police report detailing his movements and contacts. And yet the way they were arranged, their anti-drama sensibility, packed an emotional punch. Definitely my favorite Scudder so far.The synopsis: Scudder gets a visit from a beautiful dairy-maid hooker who wants his help leaving her john. A little unusual to modern sensibilities perhaps, but Scudder explains that police and prostitutes frequently have 'special' relationships, the police acting a little like lobbyists working on behalf of their clients at the big house. He agrees, mostly because he's in need of money. After searching a number of likely pimp-hangouts, a contact arranges meeting with Chance, her pimp, at a boxing match. It gives Scudder a chance to impress Chance with his eye and ability to spot a deal. Meeting over, he returns to the girl and tells her she's free (these are usually 'girls' in Scudder's world). To no one's surprise, she turns up dead shortly after their last meeting. Chance tracks Scudder down and convinces him to take the case, for reasons that are partially unclear to both of them, but have a lot to do with staying dry for Scudder. Back from a short bender and even shorter hospital stay, he's trying hard to stay busy and AA doesn't seem to be enough.Character development shines in this book, and even the stereotypical hookers in Chance's stable have their own unique spin on their activities. The poet was a standout, but what really impressed me was how Block was able to make Scudder's struggle with alcohol consistently moving. I don't think I ever felt pity or impatience with his struggle; rather it was compassion for his courage, even when he wasn't able to quite articulate what and why he was doing. A scene in Harlem with a hopped-up mugger packs a wallop. In a book with an alcoholic main character, it's a writing cinch to go for the emotional crisis around a bottle, but instead Block springs it when Scudder is dry, cornered in an alley.Small touches of humor mitigate the bleak, and the potential depressingness of the struggle with alcohol. For instance, Scudder pays his source Danny Boy to point out Chance at the boxing ring: \"If it's any consolation, I'd want at least a hundred dollars to attend a hockey game.\" Ah, Danny Boy.I enjoyed the writing even more this book. There's the occasional sentence or three when Block is able to so perfectly capture an image, I feel like I'm in the scene: \"When I woke up the sun was shining. By the time I showered and shaved and hit the street it was gone, tucked away behind a bank of clouds. It came and went all day, as if whoever was in charge didn't want to commit himself.\"The depth of humanity shown in the dry description of Scudder's meetings is consistently moving, whether it is the inanities relayed and Scudder's internal commentary, or the larger issues people are able to touch on. The way he conveys struggle in these tiny testaments without becoming maudlin or self-pitying is impressive.Words of wisdom from Mary's qualifying: \"You know, it was a revelation to me to learn that I don't have to be comfortable. Nowhere is it written that I must be comfortable. I always thought if I felt nervous or anxious or unhappy I had to do something about it. But I learned that's not true. Bad feelings won't kill me. Alcohol will kill me, but my feelings won't.\"Interspersed though the book is the larger theme of the brutality and callusness of the big city. Somewhat unfortunately, he finds a kindred spirit in the cop Durkin, and their trading tales was just about enough to drive me to drink as well. Eight million stories in the big city, all right--and eight million ways to die. It says something for the quality of the writing that despite these weighty issues that the books itself is not depressing to read. Had you told me I'd me moved and impressed about a ex-drunk investigating some dead hookers, I would have raised a skeptical eyebrow. Glad I was wrong.The weak spot was perhaps the ending. I didn't feel like Scudder had enough steps to make the final intuitive conclusion, and victim's actions become even more unclear. Nonetheless, a great journey getting there.Cross posted at http://clsiewert.wordpress.com/2013/0..."}, {"userName": "Dan Schwent", "userReviewDate": "Mar 31, 2010", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "A hooker hires Matthew Scudder to tell her pimp she's leaving. Scudder delivers the message and everything is cool. Only the hooker ends up dead and the pimp hires Scudder to find out who killed her. Can Scudder find the killer before he ends up dead himself?Sometimes, I really struggle with rating a book. This was not one of those times. Eight Million Ways To Die is easily the best Lawrence Block book I've read yet, head and shoulders about the others. The characters are more alive than in the other Scudder books and Matt's struggle with his alcoholism gives this book something extra, making it more than just another detective story.The story is great, although I had a good idea who was involved with the murders about halfway though, although it wasn't as simple as I'd thought. As I said earlier, the characters grabbed me in this one. I kept thinking things like \"I hope Chance didn't do it. He's a nice guy for a pimp.\" Even minor characters like Danny Boy and Durkin were well drawn. Matt dealing with his alcohol problem was center stage and it made me feel like I was dealing with it right alongside him.To sum it up, Eight Million Ways to Die = Fantastic."}, {"userName": "Jason Koivu", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Matt Scudder, the ex-cop turned PI with a drinking problem, puts himself through the wringer in this one!Eight Million Ways to Die pairs Scudder up with an unlikely client. The very person who he suspects murdered someone hires him to find the murderer. Go figure! Scudder gets too attached to a young woman. Then he falls back on his crutch. In and out of bars. In and out of AA meetings. One life-threatening bender later and we're left wondering if and/or when the next dive down the devil's gullet Scudder will attempt. It's not a pretty journey and it's amazing the man survives. Not only survives, but gets it together enough to doggedly solve a very perplexing crime. Very solid plot here backed by wonderful early '80s New York City details, which pave the street-level setting of this book in shit. I don't know if this would be a 5-star book for everyone, even Block fans, but it hit me just right. Right in the gut and I loved it."}, {"userName": "Trudi", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "\"You know what you got in this city, this fucked-up toilet of a naked fucking city? You know what you got? You got eight million ways to die.\" ~Eight Million Ways to Die\n Matt Scudder, how much do I love thee? Let me count the eight million ways. This is definitely my favorite of the Scudder books so far, for all the reasons captured in this review here. Eight Million Ways to Die is New York in all of its grimy splendor: murderous, amoral, seething and unsympathetic. Block creates an authentic portrait using his signature slicing prose to recall an early 80's Big Apple plagued by poverty, racial tensions, police corruption and crime. Scudder describes the degeneration of the subway system and if you think Block is exaggerating for dramatic effect, take a look at this slideshow of photos captured during this period.When I think of Scudder's New York, this is what comes to mind for me:It's enough to drive a good man to drink. And drink some more. Drink yourself into oblivion. Matt has a choice to make -- stay sober and live, or drink and die. It's not as easy a choice to make as it should be. Matt continues his struggle in a battle of will versus weakness, guilt versus loathing, that's as enthralling as anything on the subject I've read. There are demons to be wrestled and subdued. The road from self-hatred to self-acceptance can be a long and lonely one. This time around Matt becomes tangled up in the gruesome murder of a young and beautiful prostitute. Her pimp Chance is a sure bet for the dirty deed, but he's the one who approaches Scudder and pays him to find the killer. The mystery is nicely layered and evenly plotted. Chance is an interesting dude and the chemistry he shares with Scudder is memorable. I really like their scenes and the dialogue exchanged between the two. Actually, most of the dialogue in this book resonates with a clear-cut precision that carries within it a hint of the philosophical. Whether Scudder is interviewing a hooker with the heart of a poet or trying to outdo an embittered cop in a game of \"the worst murder you ever heard\", the dialogue snaps with an emotional fervency and stark honesty that's as addictive as anything poured from a bottle (and I'm already jonesing for my next fix).What more can I say? I love this series and I thank the reading gods that there's much more to come yet."}, {"userName": "Tfitoby", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "There are eight million stories in the Naked City. This has been one of the best of them.The fifth Matt Scudder takes a further dark turn in to a city plagued by demons and lawlessness, taking a pessimistic cue from the classic movie/TV show The Naked City this is the story of a dead call girl, of 2000 murders per year, of a private investigator, of an alcoholic on a path of self-destruction. During his investigation Scudder comes in to contact with all kinds of filth and degenerates, he makes acquaintances with a good cop, a good pimp, five hookers and a black albino informant. There's violence and paranoia, sobriety and alcohol related blackouts, it's a rocky ride and I shan't spoil it for you.Last month I saw an Oscar nominated Denzel Washington as a highly functioning alcoholic on a downwards spiral in Flight. Last night I watched a highly praised Mary Elizabeth Winstead as somebody so desperately in need of booze that she pissed on the floor of a shop and fled with the alcholol whilst the clerk was distracted in indie flick Smashed. 2012 seems to be a love-in for American cinema and drunks. Neither of those strong performances and powerful portraits come even remotely close to capturing the pain, the complex internal struggle of Matt Scudder's alcoholism in Eight Million Ways To Die however. Everything Matt thinks and feels and does rings true, this is the harsh reality of a an addiction, do you want to die or do you want to fight back, the decision has to be made and either way it's going to be painful. But Block doesn't shoehorn this literary study of the weakness of man in to his already successful series of PI novels, ignoring the unsightly bulges and splitting seams, he crafts his study to his character and format therefore creating one of the most memorable pieces of fiction I've read yet. You develop an appreciation of this man over four novels and then suddenly you're watching him self-destruct, it's a tough read and you spend 350 pages rooting for the guy to come good, to find a way out of the darkness, hanging on his every emotion and action as if it is your life that is in danger and not his. There are many an alcoholic private eye in the hard-boiled novel racket, they drink a bottle of gin for breakfast and wash it down with a couple of Irish coffees and function well enough to sling out that all important sarcastic simile at just the right moment but Block takes that cliche and dismantles it, leaving you with an honest portrait of a good man with all of his faults open to the world to see, functioning the best he can, one day at a time.Alcoholism aside this story belongs to the relationships Scudder develops, the conversations he has with people along the way and the positive effect he has on people. Scudder is a good guy after all. The friendship that develops with the pimp, Chance, is one of the most impressive pieces of writing in a book filled with impressive writing, whilst the relationship with Durkin the cop works as a mirror and catharsis, it's a plot device but also something very important to a man like Scudder, he is a man living in forced isolation who needs human contact to thrive and Durkin helps Matt thrive. I found myself hoping that these relationships would last, Matt needs these people in his life whether he has realised it or not and I look forward to finding out how/if it does in the next book.To curtail the risk of rambling I shall cut this love-in short and simply state that this is one of the best private eye novels I've read, I'm more than happy to place it next to that other great drunken beast The Last Good Kiss in the pantheon of the genre, and you all should get addicted to Lawrence Block and Matt Scudder at your earliest convenience.Block Anonymous is a not-for-profit organisation formed to help people like this reviewer get over their addiction to reading Lawrence Block and we would like to invite you all to our meetings held in all major cities of the world if you are thinking about picking up this book or failing that carefully read the warning label before partaking in any activity involving the reading of a novel written by the American \"crime\" writer Lawrence Block. We have yet to successfully cure this addiction but with the help of your generous donation we will continue fighting for their reading souls."}, {"userName": "Richard", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/4677640-richard", "userReview": "That's it. If I never read another Lawrence Block novel (I shudder at the thought), this book on it's own solidifies in my mind that Block is one of the best crime novelists out there. But this is so much more than just a \"detective novel.\" It's a vividly written character study of the struggle to overcome alcoholism. In this, the fifth book in the famed Matthew Scudder series, Matt gets hired by a beautiful hooker to convince her pimp to let her get out of the life. It eventually turns into a murder investigation. But the mystery is almost completely secondary. Since the start of the series, Matt has had a steady downward arc in regards to his drinking. In the beginning he was comfortably in denial, confident in his control. But it's gotten worse with each book. And now, even though he tries to attend AA meetings, he has hit bottom. Terrified at what he's failed to see in himself and determined to stay sober, he ends up throwing his all into searching for a killer, dedicating himself to the case more than ever before. Not necessarily to do the right thing, but because it gives him something to take his mind off of his liquor jones. You get the sense that the case is the only thing that saving him from falling off the wagon again.The personal struggle is what puts this high above the previous Scudder books (which were all good). There's just more at stake for Matthew. Block's great writing really shines when describing Matt's struggle: detailing the denial of his lack of control, the bargaining that he goes through with himself about why he should take a sip, his feelings about the AA meetings, and his realization of how serious the problem has actually become. Matt sees liquor everywhere; temptation follows him around every corner of the investigation.And Matt isn't the only well-drawn character. I really enjoyed reading about Jan, Matt's love interest and the person who (in the previous novel) opened his eyes to his alcoholism and the solutions, as well as Chance, the level-headed pimp that totally bucks the stereotype. I enjoyed so much of this book and it's the best installment so far in a series that will hopefully only get better."}, {"userName": "Mara", "userReviewDate": "Mar 12, 2014", "userURL": "http://www.goodreads.com/user/show/1923002-mara", "userReview": "What starts out as Matthew Scudder, fresh off of a drinking bender that landed him in a hospital, helping a hooker \"get out of the game\" turns into layer upon layer of murder and mystery in a city where people keep killing each other and there are eight million ways to die.This installment of Lawrence Block's Matthew Scudder series takes things to the next level. Things are richer, deeper; the grime is grimier- it's just more in all the right ways. Since some cleverer people have come before me and said most of the substantive things worth saying about what makes this story all that it is (Kemper and Trudi's reviews are worth checking out), I'll just share some of the miscellaneous bits and pieces that hopped into my mixed-up mind as I followed Scudder about the city this time around.\n\n\"I'm looking for a particular pimp.\"\n\n\n\"They're all particular. Some of them are downright finicky.\"\n\n\nWhen dead hookers turn up, it should be of no surprise that a detective is out pimp hunting, but the way Scudder takes it all in just struck me as hilarious and (for you South Park aficionados out there) immediately reminded me of \nButters' Bottom Bitch\n.\nMatt's trying to get his 90 in 90 together one day at a time, so there are plenty of rich AA/recovery observations made as he struggles to confront and understand his alcoholism.\n\nHe was holding up his end of a typical alcoholic conversation, wherein two drunks take polite turns talking aloud to their own selves.\n\n\nLike most friends of Bill W. at some point, Scudder sits through meetings thinking that it's all self-congratulatory bullshit, that he's an exception to the rule, I could go on...but seeing the absurdity doesn't read as criticism. Block does a good job of letting Scudder's flaws come out, while managing to keep the reader from feeling like they're taking his moral inventory (heck, Matt's not at his Fourth Step yet anyhow)."}, {"userName": "Brandon", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "Wow. Just wow. I can easily say this is the first \"great\" Scudder book. I knew I made a mistake rating the first 4 novels at 5 stars each. It's not that they're bad books, they're just not in the same league as Eight Million Ways to Die.In the 5th installment of the series, Block takes Scudder and the City of New York all the way down to rock bottom. Whether he's exposing the reader to gang violence and random murders or he's having Scudder drink himself half to death; not a lot of hope escapes these pages.It's been suggested in the past that Block has had his fair share of problems with alcohol. While he refuses to admit it or even talk about it, you have to think at the very least, he had some personal exposure to the addiction. The subject matter is written with a sense of intensity that is often hard to ignore.Scudder advances so much as a character in this outing that he's quickly solidifying himself as one of my favorite detectives. His violent outburst against a common street thug is just so bad-ass that I actually found myself yelling \"OH!\" at the encounter's conclusion. The man can be rather ruthless when threatened but carries a sense of calm when surrounded by others. However, under all that, he comes across as terribly vulnerable this time around. He's just an all around great read and I can't wait to get deeper into the series."}, {"userName": "Richard", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "8.5/10This book oozes style. Ooze rhymes with booze, one thing that heavily influences this story and is a driving force behind Scudder. Forget the main plot thread in here, its standard fare without much of a mystery or intrigue. The main thread is the constant struggle/battle Scudder has with his drinking which has been touched upon before in this series but is really at the forefront here. There are some intriguing characters along the journey too, people from Scudder’s past who we know from previous outings and some new ones. But one of my favourite characters is Chance, the pimp with a heart and good coffee. The interactions between him and Scudder were some of the best for me and I was torn between what to think of him along the way.Another star for this novel is the city of New York. It’s hard for me to picture the New York described here compared to the New York portrayed in current day culture but it seems like a rank place with many perilous corners to turn but one which feels like a well fitted glove to Scudder. His philosophy of Goyakod (get off your ass, knock on doors) works wonders for him in a time where you couldn’t just call up Google and find the answers at your fingertips. The one issue I had with this wasn’t anything to do with the story but with the narration. The audiobook I listened to was narrated by Lawrence Block, the author, and it just proves that those who write the books shouldn’t necessarily read the books. This would have been an easy 5 stars with an actor who could do a couple of voices or add another layer of grit to it but instead I got a bland narrator who, whilst certainly not the worst I’ve heard, didn’t add anything to the story and in fact took something away from it. A really good book though and by far the strongest in the series, each novel is building on the previous and is getting better and better. I just hope I can track the next one down in audio format which is becoming somewhat harder than expected!!"}, {"userName": "Maureen DeLuca", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/44509500-maureen-deluca", "userReview": "Number 5 and going strong- \"an oldie but a goodie\" 'nuf said!"}, {"userName": "Cathy DuPont", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/6637209-cathy-dupont", "userReview": "Lawrence Block has quickly become one of my top favorite hard-boiled/noir writers. To date I've read 11 of his books including a couple as short stories.As you may have noticed, I've already claimed to love the pimp, Chance, in this story. Can't help myself; the guy is a real cool dude, not your stereotypical pimp. He doesn't drive flashy cars, wear flashy clothes, hang out at pubs, taverns and the such. And, he's good to his girls. He is none of those things we generally think of when we think of pimps. Matt Scudder is, as we know, an alcoholic and has been since book number one in the series. So no spoiler there. Well, Matt continues to fight his demons while at the same time, trying to find the murderer of one of Chance's 'girls.' This is the best Scudder I've read and they've all been great. I think I've given them all four stars, maybe one other five. (After reading this, I want to change that five star to a four star, this was sooo very good; such an excellent read.) This is, by the way, number five in the Matt Scudder series. Matt (we're now on a first name basis) is not a licensed P.I. but does favors for friends (or friends of friends) and gets paid for his service. He tithes (10%) all his income, which is quite interesting and sends checks to his wife and two boys. He acknowledges he should send more money more frequently than he does. This storyline was one of the best mystery storylines that I've read in years. And I cannot express how much I enjoyed reading this book. I was mad when I had something to do and I had to put it down. And couldn't wait to pick it back up when I finished with my chore.This book just pushes me to pick up the next one and I've got a list of books to read which is a mile long. But I cannot wait until #6 in the series rolls around and it will soon.After this, I'm no longer messing around with these so-so, not worth my time books; these sissified reads. I'm just putting them down. Like someone said, \"life's too short to read a lousy book.\" I'm sure that I said something like that but with stronger language. The stonger language is due of course, to my reading the hard-boiled, noir genre. I can put blame on something else, it's not ME. Passing the blame? I learned that from Matt...all the reasons in the world to have a drink, blaming something else. I came up with a lot, I mean a lot of reasons to not do a chore and instead read Eight Million Ways to Die. A lot, believe me, of reasons. Every one was worth it."}, {"userName": "Mohammed", "userReviewDate": "Apr 09, 2010", "userURL": "http://www.goodreads.com/user/show/1842155-mohammed", "userReview": "Another amazing novel by Block,i kept thinking wow this is something.It was very much about Scudder himself,his struggles with alcohol that made it so strong this time too. The case was even less important than the novel before. It was complex story emotionally,i could have read 340+ pages of Matt Scudder and his problems without the crime plot,the violence. The personal struggles made it much more darker than any violence could have been. I didnt care about the fact the case,the crime plot wasnt the most interesting in the series so far. One of those few crime books that could have been as great without the exciting crime plot and if it was a mundane non-genre novel. The characters,athmosphere,emotions was by the far the most impressive thing about the novel.Its hard not get so impressed by this series when too many crime books,series are the same old stories,same formula and dont have near the same weight,realer than real characters. I could read 20 books about Matt Scudder going from and to his hotel,reading only his thoughts."}, {"userName": "Meg", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/26265979-meg", "userReview": "These books just keep getting better! Unlicensed PI Matt Scudder returns, fresh out of hospital after a bout of alcohol poisoning and on the case of a dead hooker. This book represents a change of heart for Matt - he finally acknowledges that his drinking is out of control and embarks on the 12 step program. I really like the character development as the series progresses - Scudder seemed a caricature of a hard boiled gumshoe in the first book but he becomes more human with each book. So happy that I've still got a dozen books left in this series :-)"}, {"userName": "Bill", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "Back in the early 90s I read four of the Matthew Scudder novels. They were quite good, and just the type of dark noir I was into at the time.Eventually I had enough and moved on to many other authors and Lawrence Block fell off my radar. Until I saw a great review by Stephen for Block's Grifter's Game from the Hard Case Crime collection.I read that short story, was thoroughly impressed, and set my mind tovisiting Matt Scudder again after a 20 year break.Eight Million Ways to Die was published before the four I had read. It's not absolutely imperative to read these in order, but it is recommended not only because of minor spoilers, but to follow the process of Scudder's battle with alcoholism.From a mystery standpoint, the story is quite good, and would rank a high three or four-star read. Good, but what made the book so engaging for me was Scudder's struggle to stay sober. I was set on giving the book three solid stars (i.e. I liked it), but the very last line of the story encompassed all that had happened and rounded out perspective on Matthew Scudder's character. I'll typically bump a star for a novel that excels on some aspect,but this is the first time I've bumped two stars to make this an \"It was amazing\" read. Like I've said in many reviews, character development is number one for me, and Block did something really special here."}, {"userName": "Lynn", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/4859943-lynn", "userReview": "This book is why I read detective fiction. It's not the mystery, crimes and action, but I do enjoy reading about that stuff. I love the description of the mind of detectives and their efforts, frustrations, success and failure. Matthew Scudder is especially wonderful to read about, maybe because he has so many problems and hides his sadness. In this book, a lot of people are sad. I am so glad I eavesdropped on their lives rather than live them. Why read about a life like your own? The weather was beautiful here today and I made a nice meatloaf for supper."}, {"userName": "Col", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/12761919-col", "userReview": "Synopsis/blurb......Nobody knows better than Matthew Scudder how far down a person can sink in this city. A young prostitute named Kim knew it also—and she wanted out. Maybe Kim didn't deserve the life fate had dealt her. She surely didn't deserve her death. The alcoholic ex-cop turned PI was supposed to protect her, but someone slashed her to ribbons on a crumbling New York City waterfront pier. Now finding Kim's killer will be Scudder's penance. But there are lethal secrets hiding in the slain hooker's past that are far dirtier than her trade. And there are many ways of dying in this cruel and dangerous town—some quick and brutal ... and some agonizingly slow.My fifth and probably most enjoyable book so far in this prolific author’s series of 17 books to date. On the front cover of my edition, Stephen King blurbs “A hell of a book!” Whilst on the odd occasion I may take exception to King’s recommendations and disagree, not this time around. The book also won the Shamus Award for Best Hardcover PI Novel in 1982.When I say probably, I will qualify it by saying I was a little bit disappointed in the resolution of the crime and the motivations and raison d’être for the protagonist acting the way he/she did – I’ll leave it ambiguous to avoid spoiling anyone’s subsequent reading of the book. It’s a minor gripe to be honest, but it was a little bit of a niggle for me just the same.\tKim, a good-time girl for hire, wants out of the game. Scudder is asked to speak to Kim’s pimp, Chance on her behalf to arrange this. Chance, once Scudder has spoken to him has no objections and an amicable arrangement is reached. Kim is murdered a few short days later. After overcoming his initial scepticism, believing her pimp is responsible for the killing; Matt is engaged by Chance to track down the killer, with Chance correctly believing that now he has been eliminated from the list of suspects, the cops will scale back the investigation giving it a low priority. Scudder, with lead detective Durkin’s approval, makes his usual diligent enquiries, doggedly moving closer to some answers. The mystery in itself was fairly interesting, but for me the best parts of the book, and the other Scudder’s I have read, chart Scudder’s daily routine, his interactions with his associates and “friends”, and his general separateness. He’s in a city of eight million people and he’s lonely. My main enjoyment was derived from the characters prominent in the book and the subsequent inter-play between them. Chance, a likeable black pimp; educated, elusive, enigmatic, caring and considered in everything he did and Scudder, who at the end manages to let his stoic, steely mask slip showing his frailty. His humanity has never been in doubt, but seeing this side of him, as he tries to tackle his alcoholism was endearing.Looking forward to book six next month – When The Sacred Ginmill Closes...err actually this month, as Eight Million should have been done and dusted in May.4 stars from 5I bought or swapped my copy a long, long time ago from I know not where.http://col2910.blogspot.co.uk/2013/06..."}, {"userName": "Nathan", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/3895830-nathan", "userReview": "Woah, I thought after reading all the greats like Hammett and Chandler there were just re-hashes of their work in varying degrees of quality left. I was wrong. I am a huge fan of the P.I. genre and this might be the best work I've read. What gets me thimking is what else is out there that I havn't discovered yet and where has Matt Scudder been all my P.I. living life?I wont go into a long description of the plot but let me just say that if you're the least bit interested in P.I. stories, this is one of the best. Having read Robert B. Parker's Spenser novel Valediction where spenser becomes depressed after losing His girlfriens Susan. Over the course of the book he starts to lose grip on his strict moral code and drinks excessivley. When I finished Eight million ways to die I thought This is who Spenser might be if he continued on that path."}, {"userName": "Benoit Lelièvre", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/3634428-benoit-leli-vre", "userReview": "Well, that was dark. EIGHT MILLION WAYS TO DIE is one of these novels that expose the limitations of a 5 stars rating system, since it really should be rated 4.5/5. I liked it a lot, but I liked A STAB IN THE DARK a tiny bit better. Without spoiling anything, I can tell you that I thought the plot was utterly brilliant (a common trait of the Scudder novels), but it was so far removed from the actual story that it felt like cheating a little bit. Usually, a mystery works as some kind of dare to the reader and there's no way you can solve that one because Scudder investigates in all sorts of directions before finding it out himself (which I figured out like, 6 lines before he did).I gotta give it to Lawrence Block, though. The dialogue is stellar, he took the unlikeliest archetype (a pimp) and turned him into a fascinating character and the storyline turned upon its head so many times, I could've help by slow clap a couple times.EIGHT MILLION WAYS TO DIE had a huge standard to live by and so far (since I'm reading the books in order), it's the second best novel in the series. The evolution of Matt Scudder's battle with alcoholism would keep anybody coming back, but it's the battle against this demons and the increasing sobriety that makes him a truly special, legendary detective."}, {"userName": "Nate", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/6803829-nate", "userReview": "I honestly am SO close to giving this the fifth star...not entirely sure that I don’t want to at this point, but I still have a long way to go with the Scudder books so I don’t have a big enough sample group at this point. That said, this was a very powerful entry in this series, which has already been remarkably well-written with its own unique voice. As most readers of these books will agree, this is a mystery series where the actual mystery can often take a back seat to Block’s ever-developing three-dimensional portrait of the alcoholic ex-cop Matt Scudder, along with his usual detailed pre-gentrification New York setting and wonderful dialogue. Seriously, I can’t state how well-written Block’s dialogue is. It sounds like real people speaking organically and authentically, which I assume is hard as shit because it’s kinda rare when I notice it and go “Man, this dialogue sounds real as fuck.”The case...it’s really kind of a repeat of the case from the first book in the sense that it’s another hooker-slashed-to-ribbons-in-apartment/hotel-room, but I liked the unraveling and outcome of this one a little bit better, I think...probably most likely because the fucking culprit wasn’t straight up called out in the TITLE OF THE FUCKING BOOK, but also because I got to know Kim a little bit and thusly, unfortunately, found myself caring more. That said, I did manage to grab onto the keystone clue in this one...due to my fondness for cursing in Spanish (I did a two-week exchange program as a kid and the vast majority of my time was with other young boys who liked to say bad words. For those wondering, I absolutely did do my Citizen of the World duty and taught them all kinds of English profanity.) The obvious suspect is the victim’s pimp Chase (I don’t think it’s a spoiler to say that he didn’t do it, because Block never goes with the obvious suspect,) who is a great example of Block writing real people and not stereotypical puppets.The real heart of this book is obviously Scudder’s struggle with alcoholism. It’s always been there but I’m pretty sure he started noticing and worrying about it in A Stab in the Dark, the previous book. Let me tell you folks, I don’t have a problem with alcohol but some of these passages were teeth-grittingly uncomfortable and real feeling. The second-by-second, never-ending battle to stay away from Scudder’s beloved bourbon was so vividly rendered that I can’t help but wonder if Block himself ever had a problem with it. It never felt like an afterthought to give Scudder’s character a little bit more depth while he’s solving cases. It was a real fucking dude--obviously no hero but someone who tries to do the right thing--combating something that a lot of us deal with and not always winning. And I gotta admit, I felt a touch of manly eye-burning (NOT PRE-CRYING) at the ending. This was definitely the best of the Scudder books so far and indications are that the next one is no slouch!"}, {"userName": "Truman32", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/22271857-truman32", "userReview": "Eight Million Ways To Die, Lawrence Block’s seminal crime novel has been called the best entry in his Matthew Scudder series. And it lives up to the accolades.Scudder is a train wreck—once a cop, he is now a drunk, living in a hotel and taking unlicensed private detective cases to get by. He only marginally supports his divorced wife and children, and after a two day bender has been told in no uncertain terms that any further drinking will kill him. Into Matt’s life walks the prostitute, Kim. She wants out of the business and has hired Matt to mediate and broker her release from her pimp, Chance. Kim soon comes to the harsh reality that one of the eight million ways to die is to be horribly hacked into bloody pieces by a machete and Matt, now struggling to remain sober, vows to track down her killer.The New York City that Matthew Scudder inhabits is a rotten husk; it’s a Halloween pumpkin still on the front porch in June. It’s a dark and dreary place where senseless murder and violence are as random as the falling chip on Bob Barker’s Plinko board. It is the same city that Martin Scorsese’s Travis Bickle drives his cab through in the film Taxi Driver. “All the animals come out at night – whores, skunk pussies, buggers, queens, fairies, dopers, junkies, sick, venal”, Travis notes. “Someday a real rain will come and wash all this scum off the streets.” This novel is outstanding, and while the mystery is solid and gripping, the true joy in Block’s novel lies in the study of a man coming to grips with his alcoholism. The conflict of Scudder fighting the demons he finds in a bottle is riveting and one of the most realistic depictions of the daily struggle an alcoholic faces to retain their sobriety.The other great pleasure found in this book are Block’s wry perceptions on life and death and his ruminations of our modern society. Like John D. MacDonald and Raymond Chandler, it is hard not to feel that it is Block making the cynical observations through his popular character. And like Chandler and MacDonald, Block comes off as outraged grumpy, and curmudgeonly; unhappy with the state of affairs in our society… and it is awesome! Fatalistic, bitter, and snide, these observations are above all also true.Eight Million Ways To Die  is considered a modern classic for a reason and it succeeds on every level. If you are interested in the crime genre, a great drama, or want to just get lost in a compelling story, pick this novel up and experience the glory of Lawrence Block."}, {"userName": "Laura Leaney", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/3633494-laura-leaney", "userReview": "Now this is great genre fiction. Gritty, realistic, and interesting. Eight Million Ways to Die is a police procedural without all the artsy furbelows of some of the recent crime writing; I'm thinking of Gillian Flynn and Benjamin Black (and I like their work, believe me). The crime is a fairly straightforward affair, yet still it must be solved, and the former NYPD detective Matthew Scudder is hired to do what the police have little time or interest for. Who cares about a dead prostitute in New York City? Who cares about two? Three? The pimp does, and that's the only odd complication.When I read Block's When the Sacred Ginmill Closes Matthew Scudder was a serious lush, and he solved that case while in a near constant state of inebriation. In this book, Scudder is fighting his desire to drink with AA meetings, black coffee, and trembling willpower. It's a torture to read, and I wondered the whole way through if he'd make it. For anyone who's ever felt the need to drink, to celebrate a great day or to numb the sorrows of a painful one, you'll understand this man's agony. It doesn't take much to get him there:I went downstairs and bought a paper, and without thinking too much about it I walked around the corner and took a table in Armstrong's. My usual corner table. Trina came over, said it had been a long time and took my order for a cheese burger and a small salad and coffee.After she headed for the kitchen I got a sudden flash of a martini, straight up and bone dry and ice-cold in a stemmed glass. I could see it, I could smell the odor of juniper and the tang of a lemon twist. I could feel the bite as it hit bottom.Jesus I thought.The book is also a commentary about the city, New York City of course, but the social philosophizing of Scudder and his police contacts could apply to any city. And there are eight million ways to die there."}, {"userName": "Paul", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/4857864-paul", "userReview": "Of the Matthew Scudder novels I have read, this one is definitely the strongest.In Eight Million Ways to Die, Block really delves into Scudder's alcoholism. It was an interesting sub-plot and I found myself awash in Scudder's character, moreso than any of the previous books. Block doesn't stretch himself thin with the mystery, instead, focusing on character a little deeper.Not that the plot isn't great, but this change in style makes the book seem a little \"fuller\".Block dials it back a bit in this one and hones in on the details more as well. Hair colour, eye colour, the colour of painted nails, drifting dark shadows, howling winds and driving rain all give this story more push in the right direction.Also, I don't know about Scudder as an alcoholic, but the way Block describes some of those drinks made me feel like running to my liquor cabinet and pouring one.Underlying everything is a bleak tone, not only set by the weather, but a host of other details. It serves to give New York City a menacing presence. The passages of death from the newspaper Scudder reads every morning are realistic enough to picture them happening. Scudder finds himself investigating the shadowy world of sex-for-sale and a murderer who mutilates his victims with a bladed weapon. Trudging through a foggy world of alcoholism and loneliness, he's surrounded by death and menace everywhere he goes. It's pretty grim stuff.That's the way I like my hardboiled detective story: bleak and dark. Thumbs up for atmosphere.This is the book that made me believe Block deserves his reputation as one of the greatest detective novelists out there."}, {"userName": "Kathy", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/31175766-kathy", "userReview": "The reader can walk alongside Scudder, a former cop, now detective, through the mean streets of New York on a soul-bearing tour of his struggles with alcohol as he stubbornly follows every possible lead to solve a murder. This one feels like a primer on how to solve crime, and he is fortunate enough to have cooperation from the police - uncommon in this scenario.We meet some very interesting whores, a unique pimp and the anonymous cloud of folk who need meetings. The murderer wields a machete and his next targeted prey is Scudder.Some clips: \"Look at me. Listen to me. You're an alcoholic. If you drink you'll die.\"\"Searching for Kim's killer was something I could do instead of drinking. For awhile, anyway.\""}, {"userName": "GeSayi", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/74329711-gesayi", "userReview": "This is the first book of Lawrence Block that I read. It was the name that rose my interest at first. Reading it makes me want to drink, although I was a student in high school at that time."}, {"userName": "David", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/5547564-david", "userReview": "This novel won the Edgar Award for best mystery novel, and I can hardly think of a more worthy winner. (Correction: It was only nominated, but it definitely SHOULD have won) The Matthew Scudder series is a good one, but this book is a special entry. Every now and then, a series author tries something bolder (like Robert B Parker with his excellent Spenser book, A Catskill Eagle) or increases the word count and substance (Robert Crais with L.A. Requiem) as is the case with this book here, and a series that is good transforms into something masterful. This book is nearly twice the word count as the previous books, and it doesn't waste the surplus. The mystery is every bit as good and compelling from the way it is set-up to the twists along the way through the resolution.The rest of the word count finally fully explores what has only been a minor element in earlier books: Matthew Scudder's struggle with alcoholism. It adds this to the early '80s setting of a crime-riddled NYC and his ongoing hopelessness. The book describes his mundane struggles, his visits to AA meetings where he listens but is unable to share anything himself. It describes his highs and lows. In other words, it makes him a real flesh and blood character with a tragic flaw. As another popular reviewer, Kemper, stated here, this is one of the best novels about addiction ever written. Highly recommended for fans of detective stories who like some literary depth as well! The previous four books in this series are all worth reading, not long, and helps give further context to Scudder as a person, but for the most part this book stands alone."}, {"userName": "Bobbi", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/3514385-bobbi", "userReview": "I'm going to have to think about this a little. The plot seems much more complex than the others so far in the series, but maybe that's because in retrospect each plot falls neatly into place. Whatever the difference, there is a clear difference, and I can see why people say this is the turning point in the series. How an author can affect such a subtle change in direction without altering the tone, tension, pace or personality, I don't know. It's hard to believe a series that used to describe blackout binges could create the same tension with AA meetings and drink temptations, but he's done it. And as always, each minor character is drawn so completely. What a master of atmosphere. I don't know your city, Scudder, but you're one hell of a fine introduction - an embodiment and a repudiation of it simultaneously, as any good street detective should be."}], "description": "Battling the bottle, Scudder finds that in the mean streets of New York staying sober and alive isn't easy - not for him, not for the prostitute who wanted out and got herself slashed to ribbons, and not for a pimp named Chance who's betting his life that Scudder can't find the killer.", "title": "Eight Million Ways To Die\n      \n          (Matthew Scudder #5)", "url": "https://www.goodreads.com/book/show/402736.Eight_Million_Ways_To_Die", "average": 4.15, "cover": "https://images.gr-assets.com/books/1408931565l/402736.jpg", "reviews": 292, "authors": [{"url": "https://www.goodreads.com/author/show/17613.Lawrence_Block", "name": "Lawrence Block"}], "type": ["Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/402736.Eight_Million_Ways_To_Die", "http://www.goodreads.com/book/show/7021007-eight-million-ways-to-die", "http://www.goodreads.com/book/show/19664739-eight-million-ways-to-die", "http://www.goodreads.com/book/show/8708500-eight-million-ways-to-die", "http://www.goodreads.com/book/show/76758.Eight_Million_Ways_to_Die", "http://www.goodreads.com/book/show/2598330-eight-million-ways-to-die", "http://www.goodreads.com/book/show/13435655-eight-million-ways-to-die", "http://www.goodreads.com/book/show/4585036-eight-million-ways-to-die", "http://www.goodreads.com/book/show/2879689-eight-million-ways-to-die", "http://www.goodreads.com/book/show/39507.The_Sins_of_the_Fathers", "http://www.goodreads.com/book/show/132111.When_the_Sacred_Ginmill_Closes", "http://www.goodreads.com/book/show/402739.Burglars_Can_t_Be_Choosers", "http://www.goodreads.com/book/show/380563.Hit_Man", "http://www.goodreads.com/book/show/162938.A_Walk_Among_the_Tombstones"]}