{"ratings": 318, "userreviews": [{"userName": "Bruce Noon", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/21019738-bruce-noon", "userReview": "About Islands by Dan Sleigh: I hated this book in the way you are supposed to hate a book. Dan must have pulled the historical records. He had fires and flood to explain gaps in the history rather than trying to fill in gaps for which there was no record. I can only say that I have dreamt about the characters, hoping that things would change. Characters tortured by well meaning bureaucrats, medical records of the citizenry, prison sentences, dreams of the Orient. Life on Islands thought to be idyllic followed by hurricanes, malaria. Lost at sea and found. Following generations of African natives and Dutch and intermarriage. Hard to read, but hard to put down even after you stop reading it. Very thought provoking. Thank you Dan Sleigh for a wild and terrible journey on they way from yesterday to today."}, {"userName": "Bettie☯", "userReviewDate": "Jan 27, 2011", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Bettie's BooksThe shelving, status updates and star rating constitute how I felt about this book. (hide spoiler)]"}, {"userName": "Deanne", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/370475-deanne", "userReview": "Really enjoyed this just for the history alone, and South Africa is one of those places I want to visit.Unique way of telling the story of someone, with none of the 7 stories about the main character, but her father, her husband and five other men who know her. Sometimes difficult to see Pieternella as the main character for that reason."}, {"userName": "Arjen", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/8231908-arjen", "userReview": "On the long voyage to the Indonesian Spice Islands the Dutch East Indies Company needed a refueling station to take on fresh water, food and fuel. For this purpose they chose a bay in front of Table Mountain with Robben Island in the vicinity. Based on historical accounts and filled with interesting family, botanical, legal, trades and crafts, and ethnologic information, this fascinating novel by South African writer Dan Sleigh recounts the first landing efforts, the negotiations with the local population, and the struggles of eking out a living in a new environment with the rough contingents of the homeland population. For many of the Cape inhabitants it was only supposed to be a temporary stop on the way to live the dream in Batavia, but many got waylaid and never had a chance to leave. Sleigh sheds light on the penal code, the livelihood of people, the strategy of plying the locals into submission with alcohol and tobacco, expeditions into the hinterlands, the setting up of new farm communities, interspersed with lovely flash back to the life the migrants left behind in Europe (with lots of reference to my university town Leiden and its beautiful Hortus Botanicus). The novel is divided in a number of chapters that together cover the period from the 1650-1700’s. Each chapter is loosely connected with relatives or successors to characters in earlier chapters allowing the writer to cover a larger time period effectively while demonstrating the cyclical nature of life."}, {"userName": "Becky", "userReviewDate": "May 21, 2009", "userURL": "http://www.goodreads.com/user/show/2341546-becky", "userReview": "I cannot express how happy I am to have finally finished this book. I don't think, out of it's overlong 758 pages, there was a single part I at all enjoyed. It's a ridiculously dry telling of the colonisation of the South Cape of Africa by the Dutch \"Company,\" told from seven different viewpoints, all of which overlap to some, sometime great unneeded extent, all written with the same dry tinge of boredom. A multitude of reviewers have described this book as epic - the only thing about it that is is the struggle to get to the end. Immensely dull, a good structure in theory but wholly let down by the consistently poor tone of the entire narrative - it's impossible to seperate the tellers from the tale. Whether this problem arose in translation or not it's difficult to tell. But I don't care - I wouldn't recommend this book to my worst enemy. It's that bad."}, {"userName": "Keith", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/1380735-keith", "userReview": "halfway through; they were right when they compared to Tolstoy. Thus far I love the sweep of action all the way from the Cape to Far East and back to the Low Countries....It's not a casual read though....Last chapter not quite as enjoyable as the previous...sort of anti-climatic. Enjoyed it overall."}, {"userName": "Jennifer", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/209242-jennifer", "userReview": "This book was hard work, but not without enjoyment. Interesting way to tell a story, each chapter a different perspective about one person but also about the narrator of that chapter. I enjoyed learning another facet of the Dutch East India company, and more of the history of Mauritius and South Africa."}, {"userName": "Natalie", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/10536968-natalie", "userReview": "I listened this as an audio book last year but still remember it as a terrific historical novel. Since so many reviewers expressed negative view points, it might have been fortunate I listened to this saga but I think I would have treasured it either way."}, {"userName": "Helena", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/4536808-helena", "userReview": "Excellent read! Well researched, well written, up there with my all time favourites"}, {"userName": "Magriet", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/60200146-magriet", "userReview": "Die skrywer gee nie die storie met ŉ teelepeltjie vir die leser in nie. Selfs met die inligting wat hy in die inleiding / voorwoord gee, was ek maar goed verdwaal. Eers nadat ek ŉ bespreking van die boek gelees het, het ek agter die kap van die byl gekom. Met die eerste lees kon ek nie die boek neersit nie, ek was ingetrek in die gebeure, ontsteld, nuuskierig, verslae. Met die tweede lees (ja, al 757 bladsye) het ek stadiger gelees, betekenis van woorde nageslaan, plekke op kaarte gesoek en my probeer indink hoe die Kaap in die laat 1600’s en vroeë 1700’s gelyk het. Ek wil nou langs die Liesbeekrivier gaan stap, na die oorblyfsels van die amandelheining in Kirstenbosch gaan kyk en die kasteel besoek; plekke en dinge wat my voorheen koudgelaat het.Aan die begin van die laaste hoofstuk, Die Klerk, het ek gewonder wat dit nou eintlik met die res van die verhaal te doen het, maar tog later agtergekom hoe dit die hele verhaal saamtrek en gebeure verduidelik en die laaste hoofstuk in die lewe van die hoofkarakter saamvat. Om ŉ lang, beskrywende hoofstuk oor die Zaaimans se lewens terug in die Kaap te skryf, sou ŉ antiklimaks wees na die interessante, meestal positiewe hoofstuk oor hul lewe op Mauritius.Dit sal interessant wees om te weet hoeveel die skrywer aan feitelike gegewens verander het.Voorwaar ŉ boek wat my laat dink het."}, {"userName": "Ian", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/4599651-ian", "userReview": "Bravo to Dan Sleigh for a meticulous historical recreation of the first fifty years or so of colonisation of the Western Cape and Mauritius by the Dutch East India company. Bravo for selecting a plausible thread to run through his epic tapestry - the central character being Pieternella, the offspring of the Cape's first mixed race marriage. And Bravo to anyone who got through the whole 758 pages without at least once or twice crying out for a bit more emotion and drama. A worthy production, and an education on South African history, but it just lacked a spark to raise it above the pedestrian. To put it in South African cricketing terms, I wanted a bit more Allan Donald and a bit less Fanie De Villiers."}, {"userName": "Malcolm Retief", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/19092939-malcolm-retief", "userReview": "Well done - good read for any South African!"}, {"userName": "Jeroen Van de Crommenacker", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/37191338-jeroen-van-de-crommenacker", "userReview": "Beautiful book with a great historic background. I enjoyed it, even though in places it can be a bit overlong."}, {"userName": "Byron Varvel", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/19341521-byron-varvel", "userReview": "I originally picked this book up in the library to help me understand Dutch colonial culture as I am writing my own work that takes place in Sumatra in a colonial setting. Also, this was Sleigh's first novel himself so I thought the this novel was perfect.Honestly, this was rugged South Africa in an nutshell in a fictive tale of the pre-Boer Wars era. Sleigh did an excellent job in portraying Griqua (mixed Euro-African person in South Africa) and Indigenous South African cultures prior to Dutch contact and the sub-plot of Chief Harry was very well written as was the plot of Eva and her attempts to bridge the gap between Van Riebeeck's settlers and the Hottentot cultures. Their daughter's plot, named Pieternella, seemed to fit in justly and explains the \"choosing a side,\" complex that is evident in many mixed cultures today such as the mestizo in Mexico and others.Yet, I felt like this novel would severely lose its non-historian audience because the plot is too inter-tangled and languidly long. Eva, Chief Harry, and Pieternella could have really stood out strongly in this novel but Sleigh lacks a strong ability to put aside historical vividity to paint a canvass of a great story of great portion of Dutch and South African lore. For example in the story the Dutch surgeon who fathered Pieternella had little emotiveness from him and the cruelty and backhandedness of Dutch masculinity needed to be sharpened more so in this work. The marooning scene did not do it enough justice. Though the purview and attentiveness were admirable in this work. I gave it 4 stars because the Griqua portions of the novel were top notch and Sleigh has lots of potential to be a good author. He out-plotted himself and his themes were not colored as deeply as they should have been such as the greed of the Dutch and the courageousness of the key characters needed more attention. Decent work but had the potential to be a much better novel!"}, {"userName": "Robert", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/2744544-robert", "userReview": "I obtained Islands through play.com’s used book section and I did have to wait a bit in order to receive it.What makes it more disappointing is that the hassle was not worth it as I did not really like the book.Islands takes place in South Africa, during the mid 1600’s when it was just being colonised by the Dutch. Here we meet the South African Native Chief Harry, who was the first African to make friends with these colonisers and act as a go-between. He later inducts his daughter Korota into the colony and the whole story focuses on her relationships and interactions with the Dutch people she grew up with. Later the book then moves on the life of her first born Pieternella. In all cases there is a clash as neither culture wants to accept each other fully.Really, though, what we are getting is an extended history of South Africa, and an explaination on all the problems that occurred some centuries later. However this is the only reason why I stuck to the novel, as I found it to be very flawed.For one thing I did not find the character memorable in any way no matter how hard I tried I could not sympathize with them, I found the plot and dialogue to be plodding and in the end I began to get irritated with everything and was glad to read the last sentence."}, {"userName": "Dave", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/24504397-dave", "userReview": "Fascinating historical fiction starts off strong but wanes in the latter half. I struggled to complete the final chapter. One can only tie so many loose ends before it becomes tedious. However on the whole, the book was very interesting, informative and worth the effort.I think this story illustrates how little we really have changed over the centuries. The details of our circumstances have evolved, but our hopes and disappointments, our fight to reach orang lama or vanish into oblivion trying, our isolating struggle to keep our heads above water in a rising sea is intact and unaltered."}, {"userName": "Luke d'Araceno", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/25244094-luke-d-araceno", "userReview": "An in-depth description of early Dutch colonial days on the West Cape and Mauritius. This work of fiction is firmly based on historical events, and Google has been a great additional source to me for verifying the complex genealogical and professional links between the characters. Being a South African, the author has done a great research job to write in detail about Dutch places, culture, habits, language, etc. As for its subject - the rise and decline of the Dutch/East-Indian trading company - the novel shows some similarities to David Mitchells 'The Thousand Autumns of Jacob de Zoet'. (But don't let me be misunderstood: Mitchell rules!)"}, {"userName": "Liza", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/29223387-liza", "userReview": "This book was... well, for lack of a better term...ok. I read it because I'm going to South Africa, and it's true, I did gain a lot of valuable insight into the history and colonization of the Cape. None the less, the English translation is a bit messy, making it even harder to follow. The book is too long and just doesn't suck you in the way some other epic historical novels do. I enjoyed some parts but definitely wouldn't recommend it."}, {"userName": "Tom De", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/15886101-tom-de", "userReview": "Fantastisch verhaal over een ongelooflijk boeiende periode. De verschillende personages laten je echt voelen hoe het was om te leven en te sterven in de Kaap in de 17de eeuw. De geopolitieke rol van Nederland in die periode blijft mij verbazen. En opdezelfde achtergrond zijn er personages geschilderd met zulke details dat je je afvraagt wat feit is en wat fictie. De Nederlandse vertaling is heel sterk en aangenaam on te lezen."}, {"userName": "Jessica", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/102314-jessica", "userReview": "another meh book. only difference is this one clocked in at just over 750 pages of meh. It would have held my interest better if it had been edited to focus the plot...probably by removing around 200 pages."}, {"userName": "Janeh227", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/6929642-janeh227", "userReview": "Fictionalized history of the founding of South Africa by the East Indian Company. Explores the relations between the colonizers and the native population. Beautiful description of the peoples and lands."}, {"userName": "Lodi", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/7884818-lodi", "userReview": "The book was okay, but not more than that. Sometimes it was very interesting, but i couldn't sympathize with any of the characters. Nobody was very likable. I think the subject is really fascinating, but the style of writing can't hold my interest."}, {"userName": "Meghan Helbick rd", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/16281056-meghan-helbick-rd", "userReview": "I was expecting something more engaging, I wanted to connect to the characters, but the way it was written I couldn't. I like it for the history alone, and the last chapter that was more thought provoking. But sort of like reading a textbook much of the time."}, {"userName": "Jacqueline Zirkzee", "userReviewDate": "Feb 17, 2013", "userURL": "http://www.goodreads.com/user/show/8945410-jacqueline-zirkzee", "userReview": "An amazing and admirable effort, but very unbalanced - part of it was lively and interesting, part excruciatingly boring"}, {"userName": "Kathleen McRae", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5857651-kathleen-mcrae", "userReview": "The subject was an interesting one but I found the book hard to read"}, {"userName": "M", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/4528888-m", "userReview": "the book was okay but it was so long with too many details that did not matter. It just made you lose track of the story."}, {"userName": "Anton Bergh", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/8995959-anton-bergh", "userReview": "Superb; fascinating story of the early Cape; brings it vividly to life"}, {"userName": "Stefaan", "userReviewDate": "Jun 30, 2010", "userURL": "http://www.goodreads.com/user/show/3947073-stefaan", "userReview": "This is a truly fascinating book, but I have found shatteringly painful and difficult to read. I have currently hit the limit of my emotional resillience and need a break before continuing!"}, {"userName": "Deidre", "userReviewDate": "Nov 23, 2007", "userURL": "http://www.goodreads.com/user/show/191678-deidre", "userReview": "didn't finish it!"}], "description": "This novel of epic proportions from South Africa, set between 1650 and 1710, covers the first fifty years of the Dutch colony at the Cape of Good Hope. Beautifully rendered, this is a world and a time never before dealt with in fiction-a period when powerful colonizers took over the lands of Hottentot tribes, exposing aborigines for the first time to Western eyes and Western ways. Through the life stories of seven men-all involved with and defined in one way or another by Pieternella, the beautiful daughter of the first mixed marriage of the new colony-we gain an understanding of the vast historical forces at work. Teeming with characters, rich with lived experience, gripping in its unexpected turns, Islands is a story of greed, power, war, courage, and international intrigue, at once a meticulously researched portrait of the age and a great adventure story.", "title": "Eilande", "url": "http://www.goodreads.com/book/show/510461.Eilande", "average": 3.57, "cover": "https://images.gr-assets.com/books/1495214468l/510461.jpg", "reviews": 32, "authors": [{"url": "https://www.goodreads.com/author/show/16868690.D_Sleigh", "name": "D. Sleigh"}], "type": ["Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/510461.Eilande", "http://www.goodreads.com/book/show/1001309.Islands", "http://www.goodreads.com/book/show/2952638-islands", "http://www.goodreads.com/book/show/13052844-stemmen-uit-zee", "http://www.goodreads.com/book/show/13598653-eilande", "http://www.goodreads.com/book/show/1288530.Islands", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}