{"ratings": 0, "userreviews": [{"userName": "Emma Deplores Goodreads Censorship", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/5229326-emma-deplores-goodreads-censorship", "userReview": "Because more of my attention is geared toward understanding what's going on rather than analyzing their merits, I think I am normally more forgiving toward books I read in Spanish. Hence, picking up this one off the shelves of my university library even though no one on the Internet seems to have read it (also, books from Costa Rica are hard to find). It seemed a little odd when the book kicked off with the two protagonists discussing the merits of various types of ships in a didactic manner. Wasn't this supposed to be about an exiled president and his trusty general invading Costa Rica? Let's look back at the bookjacket... nope, this is about an exiled president and his trusty general talking about invading Costa Rica. Abandoned on page 31 due to sheer boredom."}], "description": "Juan Rafael Mora Porras, Presidente de Costa Rica, y el General salvadoreño José María Cañas, su íntimo amigo, recorren, a través de las páginas de esta novela, los pormenores de la historia costarricense de mediados del siglo XIX. Sobre la proa del Guatemala, anclado frente a la costa de la comarca de Punta Arenas, Mora y Cañas se disponen a invadir Costa Rica y derrocar al gobierno liderado por el inescrupuloso José María Montelagre, quien un año antes los expulsara del país, luego de liderar un fulminante golpe de Estado. Mientras las penumbras que anteceden al amanecer se van despejando paulatinamente, el General y el Presidente analizan los pormenores de la insurrección, llevan a cabo un recuento de los altibajos vividos durante una década en el poder, identifican la naturaleza de sus enemigos y muestran sus temores y flaquezas ante la incertidumbre de lo que puedan encontrar una vez que el desembarco se haga una realidad. Esta novela histórica transportará al lector a la convulsa Costa Rica que enfrentó la plaga filibustera, a la nación que sufrió estragos por la presencia del cólera asiático y que se tambaleó, de modo frecuente, gracias a la conspiración que merodeaba el escenario político de entonces.", "title": "El General y El Presidente", "url": "http://www.goodreads.com/book/show/29098004-el-general-y-el-presidente", "average": 0.0, "cover": "https://images.gr-assets.com/books/1455512479l/29098004.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/5208491.Rafael_ngel_M_ndez_Alfaro", "name": "Rafael Ángel Méndez Alfaro"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/29098004-el-general-y-el-presidente"]}