{"ratings": 224, "userreviews": [{"userName": "Nikki ", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I was pretty excited for Emilie & The Sky World, so I moved it up the reading queue when I got the ARC, along with the previous book which I only recently finished. It really is a great girl's own adventure story, with plenty of strong, capable women and some intriguing other races -- in the previous book, Rani and Kenar, in this book, Hyacinth. I love that while Wells has a fertile imagination, she doesn't tell all she knows -- Hyacinth leaves at the end of the book, with so many questions still hovering around it.The Emilie books are very fast-paced, and I agree with people who say they feel quite slight. Definitely not the same audience as City of Bones (my other read by Wells), but it's not the book's fault if it doesn't work with an audience it's not meant for. I mean, it's on the Strange Chemistry imprint, not Angry Robot: I'm expecting YA, and that's what you get here -- perfectly pitched, to my mind.There are a couple of nitpicks, maybe. Emilie vacillates a bit between being a total kid and a capable person, but... that happens, with teenagers, so it isn't so strange. I enjoyed the realism of her relationship with Efrain, her younger brother, and the bit at the end where she resolves things with her uncle. It isn't perfect -- it's awkward as heck -- but it feels genuine.Also loved the casual inclusion of an LGBT relationship. It just feels so... normal. Martha Wells isn't making that dumb mistake of just taking the mores of our (past) societies just to borrow the steampunk motifs that work for her. I like that a lot."}, {"userName": "Kathy (Kindle-aholic)", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/4612721-kathy-kindle-aholic", "userReview": "Book 1, EMILIE & THE HOLLOW WORLD was one of my favorite books from last year. A rousing Verne-esque adventure with a young capable lead, this was the book I wanted to read when I was a child. I immediately bought the kids their own copy.In her newest adventure, Emilie takes to the skies and deals with family as well as a new menace.This series remains one of my favorites, not just Young Adult, one of my favorite series period. I find Emilie completely refreshing. She is capable but not infallible. She has a lot of baggage, but we get to see her work through it. This is also a series that does not rely on romance, which is a nice change.There is a lot of action in this fast-paced adventure. I also like that Wells mixes in societal issues and Emilie making her own way in a world that doesn't view women & men as intellectual equals.This is a keeper for our family bookshelf.[received a review copy]"}, {"userName": "Beth", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/4644171-beth", "userReview": "Fun action story with some funny bit of lightness (the Lord with solicitors stashed throughout the town to be applied to journalists) and a rather well structured alien that I became very concerned about."}, {"userName": "Sibil", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/7679588-sibil", "userReview": "Thanks to NetGalley and to the editor. I received a copy of this book in exchange for an honest review.RTC but I'll just put down some thoughts and then I'll come back.The author has a great imagination and her world his new, original and full of surprise. It's not the best middle-grade book ever, but I enjoyed it and I know that I would have loved it when I was a teen. Emilie is a good main character and her adventures are quite captivating. I loved the imaginative writing and the world, but I wasn't too invested in the story, even if it wasn't bad."}, {"userName": "Kel", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/3221228-kel", "userReview": "This copy was provided through NetGalley in exchange for an honest review. Some things may have changed in the final version.When I requested this title on NetGalley, I somehow completely overlooked that it was the second in a series. As the first book was not readily available and the publication date was fast approaching, I decided to read the book as was and review it based on its own merits. (Theoretically, books in a series, while enriched by their predecessors, should mostly stand well enough alone.) So, big disclaimer moment: I have NOT read the first book. This review is based on the second only.What I liked:The \"other life forms\" are not at all humanoid or humans with pointy ears, and there are translation difficulties. You hear that Star Trek?Emilie is an overall likable protagonist. She has young, impetuous moments, and smarter, calculated moments. She has emotional ups and downs, but it feels realistic instead of swinging from extremes.The family themes/aspects. Emilie's family troubles are moved aside when more important matters arise, but the room for emotional growth and reconciliation was a nice touch.What I didn't like:I could mostly picture the world, and the descriptions are pretty good, but I wanted to know more about how the technology and the aether worked. Two possible culprits: Emilie doesn't know/care and/or the author explained most of it in the first book. Either way, I felt a bit in the dark.The narration. Until a third of the way in, Emilie's perspective seems to play leap frog with a less personal, more removed third person perspective, and she fades into the background when too many other characters are present/speaking. After that first third, Emilie's voice and thoughts become more apparent.Emilie's relationship speculation moment. We've just found out something major about the bad guy(s) and two pages later, Emilie is hoping that the doctor and his ex-wife didn't break up because he was still in love with Mr. So-and-so. I was like, wha? I know it was one paragraph, but it was jarring to me for several reasons: 1) I didn't read that in the doctor's dialogue. I was thinking, where did this come from? 2) It seemed out of place in a somewhat Victorian world, and 3) Emilie rarely wastes time speculating on other people's relationships. (She's usually too stuck in her own family drama, and romantic entanglements have even rarer appearances.) Why did she start now?Final Thoughts:On the one hand, I'd like to go back and read the first book and see if it fills in some of the information gaps. On the other, while the story was pretty well written and intriguing, I didn't get attached to any of the characters, which makes me a little apathetic about picking up another in this series. Still, if you like sky-ships or a Victorian sort-of steampunk with a dash of magic, you'll probably enjoy.For more reviews, tomfoolery and book talk, check out my blog, Booked til Tuesday."}, {"userName": "Yzabel Ginsberg", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/549584-yzabel-ginsberg", "userReview": "[(the missing expedition mentioned in the first chapters of the book was kind of a giveaway) (hide spoiler)]"}, {"userName": "Dragana", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/5084213-dragana", "userReview": "After a year long wait, the time has come for us to again explore strange places, meet unusual people and share new adventures with Emilie. And this time the sky’s the limit because we are travelling to the Sky World.Emilie and the Hollow World was one of my favorite books in 2013. Resemblance to classic adventure novels I have read as a child won me over from the start and it was all spiced up with fantastic elements. So, Emilie and the Sky World had a big shoes to fill.While Emilie and the Sky World has Martha Wells’ recognizable fluid writing style which is easy to read, I found it much slower and conclusively with less adventurous air than it’s predecessor. They don’t arrive to the Sky World until almost half of the book passed and I must confess that until then I was bored at times and even wondered will they ever get there. Emilie and the Sky World had a bigger intro than the first book in series!Some readers will maybe appreciate that we get to learn more about Emilie’s family background. But Emilie and the Hollow World was a whirl of adventures from the start, so I was impatient like a junkie waiting for his next fix and could not really appreciate new depths that Martha Wells added to Emilie’s character. Emilie from this book was overconfident, quick to judge, jumped into danger without thinking and too harsh with her brother. In my memory from the first book I remembered her to have much more likable personality.Martha Wells’ impressive imagination will again blow your mind with descriptions of Sky World and new creatures like you have never met before in any novel. But her descriptions felt shallower and tougher for me to buy it than before: new machines needed a little bit more explanation and theory that the world is a series of concentric circles was just mentioned.Emilie and the Sky World was not a bad book but I hoped for much much more. It’s tough being a sequel to someone’s favorite book. Maybe I complained too much and gave you wrong impression, because overall I liked Emilie and the Sky World and will definitely read next book in the Emilie series.In The End…Lovers of fantastic adventures of all ages will enjoy Emilie series by Martha Wells, especially younger audience because it’s easy to read, has no romance and feeds imagination and thirst for adventure. Who as a child did not dream to go on an exotic expedition?My rating: 3.5 starsDisclaimer: I was given a free eBook by the publisher via NetGalley in exchange for a honest review. This text is also posted on my blog Bookworm Dreams in a little bit more styled edition."}, {"userName": "Priyanka", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/27214898-priyanka", "userReview": "Just posted this review on my blog http://www.PriyankaReads.com - check out this and many more young adult book reviews and recommendations there.========Genre: Sci-Fi and FantasyAge Recommended: 10 and upI am not a huge fan of Science Fiction, which is what Emilie & The Sky World is. However, this was an Advance Reader Copy (thank you NetGalley!) and I felt compelled to read it.This book is interesting because the story takes one to different settings, but it can be a little difficult to follow because there are a lot of characters.Emilie has just returned form her adventure and is ready to take some time off. However, when she goes to her boss's house to pay a visit, her boss shows her that a type of vortex called an aether has opened in space. An aether opens the world to a parallel universe but can close at any time and trap the people out of their own universe.Emilie and her friend Daniel attempt to go through the aether and make it through. The first few times someone has tried this, the airship has never returned, so for mankind, this is amazing progress.Emilie's crew sees an airship like theirs some distance away. This airship had been monitored for some days but had not moved and Emilie wondered if the creatures inside it, if any, are dead. Emilie and her friends venture inside the other airship only to find some of their own crew missing. They see a creature made only of flowers ahead of them, and suddenly, everything goes black...Emilie finds herself in the middle of a place unknown to mankind with nobody around her except for the flower creature who is injured. The aether is going to close soon, and Emilie needs to find her way back, and soon.Emilie names the flower creature, who is unable to speak English, Hyacinth, and the two of them go on an amazing journey to get back home.Will Emilie be able to make it back to the airship, help Hyacinth, and find her friends in time before the aether closes?"}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Emilie sets sail for adventure once again, with a voyage the offers discoveries and danger and nonstop exploration. The perfect steampunk voyage for juveniles and young tweens, even those new to the series will be swept away.After some quick, subtle reorientation to her world, Wells sends Emilie off on a new voyage. With the truest dash of realism, our adventurers find that their accepted theory of a “hollow world” may be inadequate to describe the phenomena they find. Not two worlds but many, and no promise that their home is the surface world after all. Like a classic Star Trek episode wrapped in Victorian trappings, Emilie and crew go boldly to discover what new worlds and peoples have appeared. The adventure and exploration portion of the story makes up the bulk of SKY WORLD, and it was engrossing and spot on. Portions of the conflict between Emilie and a chauvinistic crew mate, however, felt like an adult theme dropped into a children’s book. Not that seeing an intrepid girl hold her own isn’t something little girls would love, but the explicit discussions about gender roles and expectations didn’t read true to the age group.Once again Wells provides a pure adventure story that is sure to sweep children away. Despite the pockets of grown up soap boxing, I did enjoy EMILIE AND THE SKY WORLD more than it’s predecessor. As this series has already taken us below and above Emilie’s home world, I can’t wait to see where her ship sets sail next.Sexual Content: None."}, {"userName": "Lara", "userReviewDate": "Nov 29, 2013", "userURL": "http://www.goodreads.com/user/show/6611335-lara", "userReview": "I enjoyed this second book in the series even more than the first one. Emilie was more mature, and the action flowed smoothly. While Emilie was still instrumental in everyone's survival, she partnered more with others for their success. The subplot with her brother was good; she was able to come to terms with the hurt in her past and she her family in a new light.One of the things I really like about this series is that Emile is not Special. Unlike many of the other characters, she doesn't do magic. She is not the inheritor of some special position. She is simply a smart and curious girl with a strong personality. She doesn't give up, she cares about others, and she is willing to take risks to achieve her ends.You'll want to read this series in order. The relationships and events of the first book are not rehashed to explain things to the new reader, which was fine. There were a handful of small references to events in the first book to jog one's memory, but not to explain anything.As I finished the book, I found myself hoping that Wells is planning at least one more in the series. I had fun with the characters and their crazy adventures."}, {"userName": "Patrice Sarath", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/1349648-patrice-sarath", "userReview": "Emilie and the Sky World was a fast-paced adventure that is perfect for the YA reader, boys and girls alike. It reminded me a lot of A Wrinkle in Time, and I can't think of any higher praise. Emilie's a great character, and so are the secondary characters -- you can tell Wells takes a lot of glee in setting up curmudgeonly, irascible, opinionated characters and then having them interact. Buy this one and Emilie and the Hollow World for th younger teens in your life and sneak it off to read when they're done with it."}, {"userName": "Leontii Cristea", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/5743122-leontii-cristea", "userReview": "Review originally posted at Jet Black Ink:I absolutely loved Emilie and the Hollow World. I called it “Neo-Vernian” and said I couldn’t wait for Emilie’s next adventure. I was eagerly awaiting Emilie and the Sky World, hoping for the same level of excitement and adventure. I wanted something just as special and unique and adventurous as the first of Emilie’s escapades. I… didn’t get this. Something… or many somethings perhaps, just did not work for me. Between having trouble imagining the various landscapes and dirigibles, I couldn’t find the same Emilie I fell for in the first book. She had been replaced by someone a little mean and bitter and although the same spirit and eventual self-awareness I knew tended to win out in the end, I found her a less than amiable companion to adventure with into this new and should-have-been wondrous sky world.Only very recently back from the Hollow World and still learning all the tricks of the trade of adventuring and exploration, Emilie is now Miss Marlende’s assistant and has secured a future away from the judgemental and overbearing Uncle Yeric. But when he shows up, demanding she leave with him, and with Emilie’s younger brother Efrain in tow, all Emilie can do is up and leave, heading towards an aether current in the sky and a mysterious airship that has been spotted—and is approaching steadily.There’s only one thing to be done: go and meet this strange aircraft and hope against hope that the travellers are friendly.Accompanied by Professor Abindon and a selection of assistants, including Daniel (with whom I was hoping for a budding romance—but no such luck!!), Emilie and the Marlendes head off into skies unknown, up and up until they find themselves in the strangest place they’ve been given to see yet. With a new world seemingly hovering above their own, and stories of an airship that went missing in the sky’s aether currents, an aircraft assumed destroyed and its crew dead, some of the plot becomes very clear from the offset and spoils some of the wonder. We have a new world, yes; we have a potential threat, yes; we have a new crisis, yes—but so many things were obvious and predictable. That was half the problem.And partly it was the pacing, which was odd. Sometimes the book ran and then would slow to a crawl without warning. There seemed to be no tangible tension, despite the situation, which naturally should have been tense and sharp. It wasn’t. Nothing was easy to imagine and visualise, from the new bits-and-pieces world made of clumps of everywhere else to the alien creature, Hyacinth. No matter how I tried, I could only picture the plant-flower creature as some kind of flowery mutated Bellsprout or other plant-type Pokemon. Which, honestly, felt silly. I couldn’t take the new creature seriously. I applaud Wells for her imagination… but I’m wondering if what she herself imagined actually translated to the page. Bellsprout-monster aside, I couldn’t visualise the technology, the ship, the anything. It felt confused and jumbled and completely out of touch with the rich imagination glimpsed in Emilie and the Hollow World.I enjoyed the dry and sarcastic tension of the professor, but found the initial mystery surrounding her relationship to the Marlendes unnecessary: I found it obvious very early on just who she was. The fact that just why there is so much tension between the professor and Miss Marlende is never explained and it feels as though it was simply forgotten—as though Wells had every intention of adding more to flesh out the bones of their relationship, but forgot. It felt unfinished—and then far too easily resolved. I enjoyed her character, but at times she became more a tool than anything else, to direct the plot and be the ‘smart one’ in lieu of Dr Marlende.As for the sibling tension between Emilie and Efrain…I would have loved it had the book surrounding it been better and it slipped more naturally into the flow of things. It didn’t. It felt tacked on to interest readers in an element of Emilie’s personal life. However, she simply proves herself as an unlikeable and petty character at times, dismissive of her brother’s wonder at her changes as more negativity in replacement of Uncle Yeric’s snide and cruel opinion. Furthermore, any resolution achieved by Emilie and her family is brief, staged and honestly the book could have done without it. The conversations were stilted despite the dialogue itself being acute and realistic. Unfortunately, the book was just… boring. It took a whole forty percent to reach the airship in the sky and for the real story to kick in. What happened in the space before? I’m not sure. A whole lot of nothing.This book was frustrating. Slow and boring and absolutely nothing like the first book. There was no spirit. Nothing. I wish that the elements I liked had been handled better, that Emilie and her brother had been a proper storyline, that there had been some evidence that Emilie has actual emotion and an emotional life instead of the peppy I-want-to-prove-myself-useful attitude she has got going on. I wanted her to love someone, or I wanted her to really hate and argue with her brother. It was all so stiff-upper-lip and Emilie just seemed snotty and uppity in response to her brother’s obvious attempts to build bridges.It’s not as though Emilie is an unlikeable character—she’s not—but somehow, whatever connection I’d made with her in the first book, was cut off. All I got was the busy dial tone; no Emilie.The book’s greatest weakness is that it seems that nothing happens, everything crawls along with no tension whatsoever. Absolutely no tension. The creatures are difficult to imagine and the overarching plot was…honestly so overdone in principal I was surprised Wells even touched it. I am so over mind-control, body-snatching. So over it. In fact: it’s on my list of Things That Annoy Me In Books. So that went well…2-star copyI thought I would love this book and I went into it with all the enthusiasm left over from Emilie and the Hollow World and its five-star review…and smacked straight into a wall. I struggled through and quite honestly wanted to get it over with as soon as possible so I could move onto something else.Dull, slow and difficult in its haphazard pacing. I…evidently did not enjoy this book. Nope. Not at all. Sorry, book; but we can’t be friends."}, {"userName": "Kribu", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/5117138-kribu", "userReview": "When I read Emilie and the Hollow World last year, I recall thinking that it felt much more like a book more aimed at middle-grade than YA. This book felt much the same; in other words, I'd consider it more than suitable for any younger / pre-teen readers who are into adventure of the grand old Jules Verne or Arthur Conan Doyle (his Challenger books, not so much Sherlock Holmes) tradition (although these books don't take place in \"our\" world) and aren't scared of some big words and pseudo-/fantastical science, but it's also very readable for older readers, whether young adults or older adults who haven't lost that sense of wonder and love adventure books of that sort.The only thing that makes me hesitate a little in calling it pure MG is something that struck me already in the first book - the pointed references to whoring and our protagonist Emilie's uncle's apparent conviction that a sixteen-year-old girl, daughter of an actress, cannot possibly amount to anything but a prostitute.But really, that's basically the only thing one likely wouldn't find discussed quite so directly in a typical MG book.As it's been months since I read the first book, I'd forgotten some of the details, but I remembered enough of the basic set-up of this world - it's somewhat, but not quite, similar to ours, technologically perhaps closest to Verne's imagination of the future and/or a steampunk version of the 19th century, with steamships and balloon-based airships, using magic and aether currents for travelling - and what's more, as the first book showed and this one expands upon, ours is not the only world. The layout of this universe seems to involve an unknown number of worlds located more or less above one another, with our heroes discovering that aether currents can be used to travel between those worlds.While I felt the set-up was explained adequately in this book, I do think this is a series that should be read in order - anyone jumping in at this point will likely find themselves either confused or somewhat bored, especially by the supporting cast of characters. That is perhaps the main issue that I had with Emilie and the Sky World, which I don't remember having with the first book: while Emilie herself gets sufficient character development, and there are a couple of new characters introduced who felt relatively rounded (as rounded as supporting characters generally tend to be, anyway), I sort of felt like the characters we got to know in the first book, especially the Marlendes and to some extent Daniel (not that we got to know him well before), were rather neglected in favour of the newer people, functioning more as filler.That said, I ended up rather liking Efrain's part in the plot - a bit predictable, perhaps, but I felt the original tension and the development of the relationship between Emilie and Efrain, somewhat-estranged sister and brother, worked well.I also enjoyed Professor Abindon's dry snarkiness - it added some much-needed occasional humour.The one new character whom I liked very much indeed was, of course, Hyacinth - a truly wonderful creation, a properly alien alien indeed. In general, I felt this book was rather more straightforward and perhaps not quite as rich in plot twists or adventure as the first one, but if I was in any doubt about the rating, Hyacinth alone was, to me, worth an extra star.Other things I liked - which, in an ideal world, shouldn't really even need an extra mention, but since not only are there sadly few true old-style adventures with a girl as the protagonist, but there's an even bigger lack of old-style adventures with, well, girls who are not white as the protagonist. Wells' fantasy world setting is one that has its share of problems, most notably the role of women of action and erudition still being questioned in some circles, but it appears to be wonderfully balanced as far as people of different skin tones go; most of the main cast of characters are of Southern Menean origin, meaning varying shades of brown, and there is no \"default\" as the Northern Meneans' fairer skin gets mentioned with equal neutrality.These books are largely romance-free, so there's very little dwelling on relationships of any kind, but there's a casual mention of a same-sex relationship that is taken as perfectly normal and not shocking for anyone. I also liked Emilie's development in this book. In the first book, she was a stowaway, a girl thrown by accident into a daring, dangerous adventure; in this one, having just returned from the Hollow World trip, there's a bit less of wide-eyed amazement and due to Efrain's presence, we get to see the more irritable, less trying-to-be-nice side of her. I felt this rang true - Emilie isn't a perfect being but a normal human girl who doesn't always feel charitable or saintly, but neither is she blind to reason or too stubborn for her own good.I really hope this isn't the last Emilie book - I've enjoyed both books so far and with the way Emilie and the Sky World ends, not on a cliffhanger (it's a nice enough ending and ties up this book's adventures well) but in a way that is certainly open to more adventures, it does seem likely there will be more.* ARC of this book was provided by the publisher through NetGalley in return for an honest review. Thanks!"}, {"userName": "Jage", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/4801110-jage", "userReview": "fun series, fast paced with interesting worlds. my only complaint wouls be that we didn't dig into anything too deeply but as each novel stands on its own and it is for younger readers (i would say early teens) it works."}, {"userName": "Stephen", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/6767684-stephen", "userReview": "There are many different kinds of adventure stories, and just as many variations to make them stand apart. In Emilie & the Sky World, Martha Wells presents a young female protagonist striking out to make her own way in life. This book is a sequel to Emilie & the Hollow World, so readers who have read that book will already know the steps that Emilie has taken toward independence. She has left the oppression of an overbearing uncle to find excitement and freedom working with a team of explorers. Through her previous adventure, she has discovered her self worth. She knows she’s capable and trustworthy, a travelling companion her fellow adventurers can rely on. But this time around, they are taking to the sky to travel to a realm plagued by mysterious, malevolent creatures, and along the way, Emilie must deal with the sibling rift between her and her brother. Through exploration, sibling rivalry and dangerous foes, Martha Wells weaves a tale that brings female adventurers to the forefront.Now as a male reader myself, I really enjoy diving into a story where the leading characters are females. The sci-fi and fantasy stories I read are typically dominated by male casts or male leads, so it’s refreshing to see something different, especially when it’s well done. Emilie is the type of protagonist I find easy to get behind. She’s likeable, capable and courageous in just the right amounts that you can see yourself as the character. None of us our perfect, but an overly flawed character can often be too much of a hurdle to surpass. Through Emilie’s story, readers get to experience her wonder and accomplishment as she explores new realms and relationships. While this story revolves around exploration, the core of it is the relationships of the characters. Emilie must deal with the strained relationship she has with her brother Efrain. Reflecting that conflict, Emilie also notices the strained relationship between her fellow explorers. Miss Marlende and Professor Abindon quickly reveal a rift between them that mimics the one between Emilie and Efrain. Both pairs of characters notice the issues between each other which helps them recognize their own issues and overcome them. It adds a nice intricacy to the plot.Adding some flavor to the book is exploration element of the story. While the familiar aspects of family rifts and finding your own self-worth ground the book with something readers can relate to, it’s the introduction of the strange and bizarre that makes it all fun. Their trip to the sky world reveals weird flying vessels inhabited by fantastical beings. One of them turns into a major character in the book. Made of plants, roots and flower blooms, I couldn’t help but picture the character as Groot from Guardians of the Galaxy. The coincidental characteristics really added to the fun of the character. Together, Emilie and the plant being are able to help out when things turn most dire.Now at the risk of revealing too much, the villains of this story deserve some attention. To maintain some level of secrecy and mystery, I’ll refer to them as the ghost pirates, which is what Emilie ends up calling them in the book. The ghost pirates are used to maximum effect, disrupting the journey, throwing everyone into peril, and forcing Emilie to rise above and beyond to help her friends. It is in her pursuit to help those she cares for that she becomes the hero. She proves to her brother that she is not a helpless girl, but a fully capable and courageous adventurer. In turn, she also earns her right to be among the Marlende’s in their strange voyage. And hopefully all her hard work and accomplishments will pay off for another adventure yet to come.As a young adult novel, Emilie & the Sky World is a book that appeals to a much broader audience. It can be enjoyed by readers of all ages. Yet it’s also a book backed by a very diverse cast. With it’s cast of determined, capable women, it lends itself to the female audience. For those looking for people of color, almost all of the characters are non-white. Even sexual diversity is touched upon. Thus, at the end of the day, you get a story that not only explores new worlds, but the diversity of our own world without being heavy handed about it. It’s a great way to do it.For readers looking for a fun exploration novel with a lead female character, Emilie & the Sky World is a great book to check out. The story delves into issues we can all relate to while also diving into the unknown and forcing us to wonder what we might do in such a situation. By creating such grounded, believable characters, Martha Wells makes it easy to slip into the shoes of the characters and see the situations through their eyes. As such, it’s a book that delivers entertainment and escapism, adventure and self-reflection. I give it a five out of five."}, {"userName": "Daniel", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/638550-daniel", "userReview": "I've been feeling very good about the books I get from Strange Chemistry and Angry Robot, so I was really looking forward to this.Emilie is a typical teen protagonist: adventurous, inquisitive, strong-willed, inexperienced.  Author Martha Wells does a very nice job of understanding Emilie and getting the reader to relate to the young girl.  It is easy to imagine the YA reader who would be most drawn to Emilie -- I picture those youngsters who, if they had been born in the 1960's or 1970's, would have been big Nancy Drew fans.  Emilie has that same sense of curiousity and 'can-do' attitude.Apparently, having finished a previous adventure (this is a book '2'), Emilie is looking to some down time.  However, after seeing a new space vortex, referred to \"aether,\" which appears to open to a new or parallel world, Emilie's interest is piqued.  The problem is -- the first few who have ventured into the aether have not returned.In a ship that seems to be a form of space-voyaging dirigible, Emilie joins a crew of scientist explorers.  The aether has currents and they struggle with the current until they see another ship, which appears to have been abandoned, except for some unusual looking plants.\n** WARNING -- SPOILERS AHEAD **\nThe plants turn out to be another intelligent life form.  Emily and Hyacinth (the name Emily gives to the plant) communicate with gestures until Hyacinth provides a translating device.  The plant forms are also trapped in this unusual world.  The aether path to (and presumably from) the world is going to close and Emily, Hyacinth, and their fellow travelers are anxious to get on their ships to return home.  Complicating matters, another creature seems to have taken control of the physical bodies of other travelers known to Emilie, but of course only Emilie and Hyacinth seem to understand this.It is nice that author Wells doesn't waste time with superfluous descriptions.  Often a reader will travel to a new world and get detailed scientific descriptions of the flora, fauna, atmosphere, etc.  This is an area where Wells gives us the descriptions that seem most appropriate for the teen character to give us.But at the same time, the lack of descriptions often left me more confused than anything else.  I'm not really sure what the aether ships look like or how they travel.  I have no idea what the basic landscape on the strange planet is like, which is important only because Emilie finds a way to hide in it.And where there is a lack of description to give the reader a visual to imagine, there is also a lack of energy and tension.  One would think that visiting a new world, having a deadline to get away, and alien body-snatchers, would make for a tight, tense book.  But that's not the case.  We move from one incident to the next, and from one character to another, with the same pacing.  Because of this, the tension fails to build, and by the half-way point we aren't eager for the next chapter because we know it will feel exactly like the one before.  We continue reading for the information and story, but the energy is gone.There's enough here that I am interested in going back to read the first 'Emilie' book, and I would likely pick up the next book (providing there is one) were i to see it in a store, but it's not a book that I would recommend with great excitement.Looking for a good book?  This book should appeal to a small sub-set of YA readers who can truly identify with the main protagonist.This review originally published in the blog Looking For a Good Book."}, {"userName": "Ashley Ferguson", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/6991532-ashley-ferguson", "userReview": "This review and more can be found at The A P Book Club*I received this book as an eARC from Strange Chemistry/Angry Robot on NetGalley in exchange for an honest review*I thought that Emilie's adventures in the Hollow World were exciting and terrifying and fun and that it would be a little bit of a challenge to live up to them. But Emilie and the Sky World took all that and made it even better! Don't get me wrong - I loved the Hollow World and the Cirathi, but I really loved reading about the Sky World and learning about new creatures and a new world and the aether. The Sky World is actually pretty terrifying. Things are constantly changing, and you never know what's going to happen. There are humans and plant creatures and a mysterious thing that might be out to destroy whatever it meets... And Emilie and her friends are always finding themselves in some sort of trouble. I mean, Daniel starts off nursing an injury from Emilie and the Hollow World, so he wouldn't be very helpful in a fight anyway. The crew has to be smaller since they're traveling skyward, so there's not any room to bring additional people to act solely as guards. And once again, it's up to Emilie to save the day and her friends.I really admired Emilie, and I'm glad that she still had some room to grow after her experiences in the Hollow World. Since this book takes place shortly after the Marlendes and their crew return from the Hollow World, Emilie has barely had any time to adjust to being Miss Marlende's assistant She's still dealing with Daniel being shot, almost being killed, seeing some of her friends killed, and with everything that Lord Iver did. Even though she grew up and had to be brave and sly and witty in the first book, she has to come to an understanding with her younger brother. I really enjoyed the sibling relationships in this book, and I wish there had been even more in the first book. My favorite thing about this book was how it read very much like a Jules Verne novel, only more modern and more fantastical. In Emilie's world, there's magic and aether currents, airships and mysterious lands, and all sorts of things that I almost wish our world had. Her adventures and the characters are very much in the vein of Verne though, and I think that fans of his books would really like this duology. It also reads quite a bit easier than a Verne novel, since the language is more updated and more tailored to today's YA crowd.Although this is a YA novel, Martha shows more things than she tells and doesn't shy away from science. I feel like there's a really heavy steampunk influence to these books intermixed with the fantasy, and I never felt like anything was \"dumbed down.\" None of the science or the magic is complicated, per se, but Martha makes the reader feel like they're in on all of it and know exactly what she's trying to get across. I think that seeing things from Emilie's perspective really helps that, since Emilie's knowledge of the aether and the spells is pretty much on par with ours. I don't want to ramble about this book too much, but I definitely think it's worth the read! If you enjoyed Emilie and the Hollow World, I would definitely recommend this sequel. It's everything the first book was and so much more! I would also recommend this book to anyone looking for a Jules Verne-type novel, or a fantasy with some sci-fi thrown in. Also, to anyone who wants a magical steampunk adventure. 4/5!"}, {"userName": "Koeur", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/21736404-koeur", "userReview": "Publisher: Strange Chemistry Publishing Date: March 2014 ISBN: 9781908844538 Genre: Fantasy Rating: 2.5/5.0Publisher Description: When Emilie and Daniel arrive in Silk Harbor, Professor Abindon, an old colleague of the Marlendes, warns them that she’s observed something strange and potentially deadly in the sky, a disruption in an upper air aether current. But as the Marlendes investigate further, they realize it’s a ship from another aetheric plane. It may be just a friendly explorer, or something far more sinister, but they will have to take an airship into the dangerous air currents to find out.Review: I like the cover art. Gives it that old timey big top feel reminiscent of the Steam Punk genre/era.The character development was scant in this “adventure”. Pedantic dialogue and petty emotions on display did little to develop the characters. About the first 40% of the novel is finding a mystery airship in the aether, flying to mystery airship, and boarding mystery airship. In between this slow boat to china, are the inner thoughts and emotions of Emilie. Emilie is about as deep as a kids wading pool. She runs around in awe of everything and then suddenly goes Bettie Davis on her brother. At no time are we lent a sense of processing that occurs at a deeper emotive level. Its all hyper-reactive, sudden and brash. You get no sense of the characters intent. The same can be said for most of the characters. There is this outward emotive quality that resides in negative form without developed qualities. Professor Abidon is a prime example. She is abrupt, negative and haughty. There is some history between her ex-husband and daughter, but no reasoning as to the emotions that boil. Put simply the characters lacked depth. Emilie and her cohorts get lost in the aether and end up the targets of exiled aether beings whom can inhabit a human and influence the minds around them. As they are searching for their comrades on a derelict dirigible of alien design, they are shifted into a composite world with one of the remaining aliens. This alien resembles a walking plant with flowers, whom Emilie dubs “Hyacinth”. Hyacinth was fascinating in every aspect. From the form to it’s thought processes. This alien was the highlight of the novel. Now the bad news. Although the technical ability of the author is really good, the story-line for this particular installment was diminished by the lack of scope. The only analogy I can come up with is the movie “Speed 2: Cruise Control”. Somehow the author tries to create all this tension within the bounds of dirigibles and a place in the aether that is an amalgamation of other places. You can have all the crash, boom and banging you want, but if it resides in or around sedentary objects, it becomes overly complex because it lacks scope and movement. Take the Romulus Buckle series. Here we also have dirigibles but with movement to other places which translates to adventure. There is never this limiting presence of stasis. Even when Buckle is engaged in battle, the scenes shift constantly to expand the scope of the event, which summarily draws the reader in.This was a real frickin’ snooze-a-thon. The target audience should be around 10-12 years old and not Young Adult. The author uses Emilie and her brother as a tool to engage the YA reader, but it is a scant attempt at an embedded genre where many authors are successful in the development of this panged age class."}, {"userName": "Nick Fagerlund", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/1254063-nick-fagerlund", "userReview": "I liked Emilie and the Hollow World, but this book is much better! (I suspect it doesn't stand well alone, though -- it jumps straight in with very little recap. Literally days have passed since the end of book one.)It's a much tighter story this time around, plotted like a classical Hollywood thriller in the Die Hard vein. Fewer exploratory and expository lulls, and in Emilie's case, a lot less waiting for other people to decide what to do.So, someone else should read this book and talk about Emilie with me, because I'm really interested in the direction her character went.Someone (and I can't remember if it was an access-locked post, so I'm keeping their identity vague) recently wrote something interesting about the fight-or-flight response -- first, that it's actually fight/flight/freeze; secondly, that \"fight\" isn't really \"fight\" but a more general \"go towards the danger and try to disrupt it;\" and third, that most people consistently tend towards *one* of those responses when confronted with something fucked up and scary. And after the events of the first book, Emilie has definitely solidified on \"fight.\"Which makes sense given the genre! Wells has written about how she wanted to reconstruct the Boys' Own Adventure genre (nearly extinct in its original form but with its DNA widely distributed and very much alive; see _Up_ for another story explicitly engaging with its classical tropes) with girls and women at the center of it instead of absent or invisible. So Emilie definitely falls into the Plucky and Helpful mold. But there's more than that going on -- she's visibly changed by what she saw and what she did on her last journey, and she's acquired a certain... I'm not sure if \"ruthlessness\" is the right term. I'm pretty sure it's not, actually. But she understands now what life-or-death stakes really means, and she's seen that she can affect the outcome of events that kids are not supposed to be able to affect the outcome of, and the combination has done a number on her.Last time, she had a plucky _willingness_ to go into danger. Now, she has a kind of shocking _eagerness._ She's starting to become what I've heard EMT describe as a \"trauma junkie.\" And she's a _really effective_ one, who operates with basically no angst about it, and seeing that in a teenage girl character is cool and kind of new. If this series were to keep going, I could see her aging into an Indiana Jones mold -- ostensibly a sensible and committed scholar, but ready to do something really ridiculous at the slightest shift of the breeze.And she's very shrewd about what having that type of personality means, too -- she has an intimate understanding of all the ways young people (and young girls especially) get underestimated, and knows that any sort of audacious and dangerous move from her is going to be super unexpected. She plays that to the hilt. And this time, her companions are ready for it instead of being like \"who is this demented stowaway.\" (I'm still kind of cheering at Miss Marlende's \"Allow me to introduce the _real_ Emilie\" bit.)Anyway, the shitty postscript to this otherwise positive review is that Strange Chemistry, the imprint that published this book and its predecessor, got shut down several weeks ago, so it's probably not going to sell much more. ARGH. You should grab an ebook or two and read these; they really deserve a wider audience than they got."}, {"userName": "Rebecca Blackwell Read", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/7466248-rebecca-blackwell-read", "userReview": "[I was hoping some of the Hollow World characters from the first novel would make a reappearance, but it wasn't likely when they were in a completely difference place for this story. I feel as if their story wasn't completely told and would like to see more of the places they came from. (hide spoiler)]"}, {"userName": "Johanna", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/15591472-johanna", "userReview": "I received a copy of this book from the publisher via Netgalley in exchange for an honest review. Thank you so much! *3,5 stars*I'm very glad I decided to go on with the Emilie series as I liked the sequel even better than the first book, Emilie and the Hollow World. Martha Wells has written an entertaining young adult adventure story with lots of steampunk elements. I love the concept of her world-building and especially the character development in this novel. The book picks up right where the last one left the reader. Emilie has just returned from her great aventure in the Hollow World, another dimension reach through the aether. Scientists have always assumed there might be more worlds that can be reached through aether currents. And they're right because one day a vessel can be clearly identified reaching through an aether current in the air. Of course, Emilie and the Marlende's have to investigate this matter and soon get their airship ready to go on another possibly life-endangering journey.I remember that when I read the last book I was a bit disappointed in the characters even though I loved the story. So I'm glad Wells concentrated a lot on character development in Emilie and the Sky World. Actually, a strong focus of the plot is on family and absolution. I really hated the way Emilie behave towards her brother Efrain. I could understand why she's angry with her family for thinking her weak and not seeing her potential. But then, she didn't exactly behave correctly herself and I felt a bit sorry for Efrain.Sometime, the writing is still a little bit off and it was hard for me to get into the book in the beginning because of that. It sounds a bit impersonal and detached. But then I soon recognized this lovely steampunky world again and wanted to know what this sky world is like.I loved all the new characters, especially Professor Abindon and Hyacinth. It's obvious that Wells wants to make a point about strong women (which she sometimes overdoes with Emilie). The professor is a blunt, highly intelligent and sometimes rude woman who you just have to like right away. Hyacinth once again belongs to a non-human species that sprang right from the author's imagination. It was fascinating to read about \"it\", the flower-like creature with the big heart that becomes a dear companion to Emilie.I also thought that maybe, just maybe, there might be a little love interest coming between Daniel and Emilie? Who knows...I'll definitely stay on board because I can't wait to see which other worlds Emilie and the Marlendes are about to discover. And now, finally and gladly, I've grown fond of the characters and want to see where their fate leads them to."}, {"userName": "Yune", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/8561-yune", "userReview": "[\"Wait.\" Miss Marlende stopped Professor Abindon with a hand on her arm. She took the vial and the hypodermic out of the professor's hands and checked them both, then handed them back.The professor lifted her eyebrows. \"Really, Vale. This is too much. Your father and I had our difficulties, but I never wanted to murder him. And if I had, I certainly wouldn't do it in front of my only child.\"Miss Marlende gave her a level look. \"I wanted to make certain that the creature hadn't possessed you and was somehow forcing him to behave this way.\"Professor Abindon's expression cleared. \"Oh, of course. Good thinking.\"\n(hide spoiler)]"}, {"userName": "Kirstie Ellen", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/18724190-kirstie-ellen", "userReview": "First of all I'd like to thank Martha Wells for a copy of this book. I received Emilie and the Sky World from the First Reads competitions. The book follows the journey of Emilie as she gets sucked into an adventure to investigate a strange airship coming through the aether (which I like to think of as a time vortex that interweaves the universe together and allows people to jump across from one place to another). Her family situation is tense, with both her parents dead and her eldest brother away she is in the \"care\" of her uncle, whom she hates. His overbearing nature suffocates her and she feels the need to get away. She finds her escape through this adventure, but so does her next youngest brother; Efrain. After sneaking aboard the ship he too fights of alien monsters trying to put together a plan that devastates others in its wake. And let's not forget Hyacinth, one of the most original and hilarious creatures I've ever read. They end up in this strange creation that the two evil creatures have made by drawing in and smooshing together parts of other worlds. It's really, really cool. I gave 5/5 to Emilie and the Sky World because of how great an adventure story it is. I haven't read the first book in the series (Emilie and the Hollow World) so I must say some things confused me a little. But the description of things in the book allowed me to pick up roughly what had gone one, whilst readers who are familiar with the story wouldn't be bored with repeated detail. It's suitable for everyone and worth reading for anyone who loves a good book. And come on, how great is the cover? Don't deny it, if you saw it in a shop you wouldn't be able to stop yourself getting a piece of this eye candy. Emilie is a great heroine, she's stubborn, she's smart and she's knee deep in action. There's definitely some tension between her and Daniel (of the wink-wink variety), and I have to say I wish he'd featured in the book a bit more. There's plenty of broken relationships that need to be fixed throughout the journey, making this an on-edge, tension packed adventure. The world that Wells has created is so wonderfully unique and refreshing that it's truly a page-turner. Wells has poured the originality of her imagination on to the pages of this book to create an inspiringly fantastical world! I certainly look forward to reading Emilie and the Hollow World in the future and hope Wells continues to write adventures for this series! Happy reading :)"}, {"userName": "Shoshi", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/60830-shoshi", "userReview": "Pretty solid paperback steampunk adventure."}, {"userName": "Aelvana", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/33911745-aelvana", "userReview": "Emilie is still settling down from her last adventure when Professor Abindon, a friend of the Marlendes, tells them she's seen something strange in the upper aetheric current. Of course, the Marlendes are always up for an adventure, and they agree to go check it out.But Emilie runs into trouble when her uncle and her brother show up---and to her delight, the complication earns her a spot with the crew. The trouble with her family doesn't end by leaving them on the ground; and soon there are signs something ominous may be underfoot.This volume picks up right where the previous left off, with Emilie and Daniel going to visit her cousin, and soon rockets right back into another adventure. This time around, with the addition of Emilie's brother and uncle, her relationships with her family have a chance to come to light. And they're nicely backdropped against the Marlende family relationships, which makes for a subtle point of contrast as Miss Marlende's relationship with her mother is so very similar to, yet different from, Emilie's relationship with her uncle or brother. Emilie's constant bickering with her brother lends her more of a personal stake in the story than she had before, and she proves she's quite capable of being petty and hurtful as well as noble and daring.The aliens this time around are a lot of fun too. Hyacinth in particular is excellent: Wells can write aliens that really come off as strange, yet relateable.The scenery, from the ship to the other world, is vivid and detailed. The only piece I didn't care for so much was a certain character who turned out to be bisexual. He appeared to have a great deal more affection, past and present, for his male lover than he had for his former wife, whom he treats as though she were never more than an acquaintance. Overall, although this is a step up story-wise from the previous book, but I don't know if I'll keep going, if there were to be more. I prefer not to read about homosexual relationships, although it wasn't a huge part of this plot. Other than that, though, Recommended."}, {"userName": "Lisbeth Avery {Domus Libri}", "userReviewDate": "Mar 30, 2014", "userURL": "http://www.goodreads.com/user/show/8282085-lisbeth-avery-domus-libri", "userReview": "The Emilie series embodies all your childhood imagination and excitement about the unknown and supernatural and compiles it all into two nice and neat little books. It's really amazing how well Martha Wells can just take all these emotions and somehow turn them into books and not just any book but incredibly enjoyable and good books!Emilie and the Sky World starts off almost exactly where the last Emilie book ended. It wasn't the best start but within the first twenty percent, the book picks up quickly when Emilie and co. go off on another exciting adventure.Practically all the problems that I had with the last Emilie book were resolved in this book, much to my great delight. The character relationships, which have always been sweet, got almost even sweeter. This Emilie book seems to focus a lot more on familial relationships - daughter and father; mother and daughter; brother and sister.The relationship between Emilie and her sibling reminded me a lot of my relationship with my own sibling. Slightly antagonistic but at the heart of it, we do love each other. I think a lot of kids will associate with Emilie and her kid brother.The minor characters added another dimension to the book and all of them made a nice addition to the story. I don't know what is it about her about I just adore Ms. Marlende. She's such a strong character and a wonderful mentor for Emilie.The world is just as beautifully constructed as in the first installment. While not as 'out-of-this-world' and fantastical as the Hollow World, the 'Sky World' is charming and wonderful in its own way. From the flora to the fauna (and everything in between), Wells proves yet again her skill in creating lovable and unique worlds.Emilie and the Sky World is a delightful installment to the Emilie series. I enjoyed the first book a bit more but it's obvious that Wells' skill in writing definitely improved. The characters are more defined, the relationships more substantial, and the story is better paced. I definitely recommend both Emilie and the Sky World and Emilie and the Hollow World."}, {"userName": "Monica", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/24364577-monica", "userReview": "Emilie and the Sky World is a fast paced steampunk novel with an extra dose of adventure. It is marketed mainly towards a YA audience, but I think that adults of any age would be able to appreciate this story. The book is a sequel to Emilie and the Hollow World, and fans of the first book will continue to enjoy the series with this installment. In addition, it is possible to read this book as a stand alone novel, and Wells sets up the plot in a way that is easy to understand and explains all the important events that happened in Hollow World.In this installment Emilie and her friends take to the sky to take part in an adventure that has them in-between worlds, and interacting with fantastical creatures from other places. This time Emilie not only has her friends to worry about, but also her younger brother, and the situation will be dangerous and fascinating at the same time.The worlds that Wells creates are vibrant, and her the creatures that are found in these worlds are amazingly imaginative. Even though the book includes plenty of danger and suspense, its tone remains consistently light-hearted. It is completely devoid of any dreariness or darkness, and seems to be the novel equivalent of a cup of tea and a sunny day in the country. This may sound strange, but it is not often that modern fantasy ends up feeling so overwhelmingly happy. Or perhaps I've simply read too much grimdark lately, it's hard to tell.The lightness of the book does mean that it ends up a bit lacking in depth. There are no philosophic quandaries or important allegories to daily life, but this is not the type of book that is trying to make a statement, or to get people to think. It is a purely old-fashioned adventure story, and it is a fun and enjoyable read.Overall I would give this book a 7.5/10.I received a copy if this book from Netgalley and the publisher in exchange for an honest review.This review first appeared at avidfantasyreviews.wordpress.com"}, {"userName": "Dhuaine", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/882572-dhuaine", "userReview": "[as it's not technically the world above Emilie's (hide spoiler)]"}, {"userName": "Lauren", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/5899910-lauren", "userReview": "Electronic ARC provided by NetGalley.Emilie and the Sky World is a fun, original adventure story with an increasingly likable female protagonist. Having just returned from their visit to the Hollow World, Emilie and company find themselves drawn into a new exploratory adventure, this time headed up a mysterious portal in the sky. I really enjoy the tone of these books. Martha Wells does a wonderful job maintaining a feeling of exploration to the narrative. The Sky World visited by the characters is an alien environment containing alien creatures, and most of what we learn about it is speculation on the part of our main characters. The lack of unnecessary exposition is refreshing. In Emilie and the Hollow World I felt that Emilie was too often sidelined, a passenger going along with events instead of someone who was an integral part of the story. I was also disappointed that we learned almost nothing about Emilie's background. In this book Emilie takes on a much more central role, and feels fully part of the narrative in a way that she did not previously. I also enjoyed the insights into her family life, mostly brought about by the presence of her brother Efrain. Emilie is a nicely pragmatic heroine. She reacts well to new situations and new creatures, and, as is rare for a female protagonist in a children's or young adult fantasy, has no interest in romance. The first book in this series was creative but a little bland in character development. Emilie and the Sky World is a nice improvement, and a fun Jules Verne like adventure."}, {"userName": "Megs", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/7070802-megs", "userReview": "Emilie and the Sky World was a fun follow-up to Emilie and the Hollow World. I love the fun-filled. action-adventure feel of this series.Emilie is a plucky, likeable young heroine. Her family troubles rear up in this book, with the re-emergence of dreadful Uncle Yeric and the introduction of her younger brother Efrain. However, Emilie doesn't let family issues get her down and brings her courage and quick thinking to another aether adventure.In this adventure, we go up instead of down and the crew heads to the sky to investigate a disturbance in the aether. While the world is fairly different, the adventure follows a similar slant to the last. There are bad guys to defeat and foreign creatures to befriend. I enjoy the message in this series that even though people may be different (it this case very different!), we can still all get along and be friends.I'm not sure if this book is officially classified as Young Adult or Middle Grade (I think Emilie is around 14), but it definitely has a Middle Grade feel to it that I really enjoy. There's no romance present, which I find really refreshing! The adventure is always at the forefront of the story, which I really enjoy.The only slight negative I have is that the action was occasionally a bit hard to follow. With strange aether physics and multiple flying ships, it can get a touch hard to follow, but this was by no means a big problem.Overall, I have really enjoyed Emilie's adventures so far and am excited for the next book to come out."}], "description": "A Girl’s Own Adventure in the spirit of Jules VerneWhen Emilie and Daniel arrive in Silk Harbor, Professor Abindon, an old colleague of the Marlendes, warns them that she’s observed something strange and potentially deadly in the sky, a disruption in an upper air aether current. But as the Marlendes investigate further, they realize it’s a ship from another aetheric plane. It may be just a friendly explorer, or something far more sinister, but they will have to take an airship into the dangerous air currents to find out. Emilie joins the expedition and finds herself deep in personal entanglements, with an angry uncle, an interfering brother, and an estranged mother to worry about as well as a lost family of explorers, the strange landscapes of the upper air, and the deadly menace that inhabits the sky world.", "title": "Emilie and the Sky World\n      \n          (Emilie  #2)", "url": "https://www.goodreads.com/book/show/17617916-emilie-and-the-sky-world", "average": 3.93, "cover": "https://images.gr-assets.com/books/1381835481l/17617916.jpg", "reviews": 53, "authors": [{"url": "https://www.goodreads.com/author/show/87305.Martha_Wells", "name": "Martha Wells"}], "type": ["Fantasy", "Science Fiction", "Young Adult", "Adventure", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17617916-emilie-and-the-sky-world", "http://www.goodreads.com/book/show/18712573-emilie-and-the-sky-world", "http://www.goodreads.com/book/show/18466047-emilie-and-the-sky-world", "http://www.goodreads.com/book/show/32758901-all-systems-red", "http://www.goodreads.com/book/show/9461562-the-cloud-roads", "http://www.goodreads.com/book/show/11834447-the-serpent-sea", "http://www.goodreads.com/book/show/13649197-the-siren-depths", "http://www.goodreads.com/book/show/321357.The_Death_of_the_Necromancer"]}