{"ratings": 1351, "userreviews": [{"userName": "Stuart Fujisaki", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/16214252-stuart-fujisaki", "userReview": "The WEB Griffin empire jumped the shark and having a 500+ page volume #7 proves it. I’d say 175 pages max for the amount of new material provided in the latest offering of the Argentina series. The author and co-author, I.e. the co-author succeeded in converting once interesting characters into parodies of themselves, while slogging them through a totally uninteresting, often confusing tale. You'd think the father would instruct the son to just stick to the time tested formula (stick to the script, stupid). He didn't listen, or more likely, thought he was Hemingway. It appears the WEB empire intends to expand into volumes #8, #9 and probably #10 – count me out. Evita made an appearance in this book so Butterworth Hemingway must be chomping at the bit to bring in Andrew Lloyd Webber as a guest B.I.S. agent or S.A.A. passenger."}, {"userName": "Christopher Taylor", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/31381002-christopher-taylor", "userReview": "This book is set at the end of WW2, when the allies were trying to clean up and capture all the Nazis and their equipment. Submarines containing riches, equipment, and art were sent out to help powerful Nazi leaders escape and set up for a \"phoenix\" rebirth of the reich, primarily to Argentina.This is a book in a long series of stories involving established fictional characters interweaving with real ones, and as such drops the reader in the middle of a saga, but not uncomfortably. There is, perhaps, too much recapping and explanation, including several sections that seemed to have been cut and pasted into the book several times.Some of the story I liked; parts about the young officer in Germany. Others I didn't care for and especially found the Peron/Evita story dull and dragging. Overall it took entirely too long to get to the main point, and other than repeated meetings by the bad guys making the same plots over and over again, the bulk of the story is the heroes planning and talking about things, and historical events.I don't really recommend the book for reading, but it does cover an interesting part of history."}, {"userName": "Joseph", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/9479701-joseph", "userReview": "Pure entertainment, fiction loosely based on history. Good research, but dialogue doesn't ring true and is sometimes anachronistic. Still good fun, light read and entertaining. And, the bad guys are really bad, the good guys are funny and heroic to the point that they stretch your imagination. All the good guys are incredible marksmen, pilots and speak three to four languages. Did I mention they are also appreciative of things liquid, especially scotch and wine. Women have chick books, men have guy books. This is a guy book with little redeeming value other than that it is a guy book."}, {"userName": "Brett Sorge", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/2221525-brett-sorge", "userReview": "This is really much better then the reviews. I suspect the others that rated this book poorly did not read the preliminary books in order. Otherwise I can see that you might be missing a lot and did not get the character development. Overall the story is pretty good and some nice dialogue."}, {"userName": "Stan", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/10106661-stan", "userReview": "Lt. Col. Frade has some interesting post WWII intel operations with his \"little brother.\" Good stuff."}, {"userName": "Scott Vanzandt", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/17331231-scott-vanzandt", "userReview": "W.E.B Griffins latest. Just a continuation of the story. You should read this series from the start!"}, {"userName": "Robert Ruppert", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/21603472-robert-ruppert", "userReview": "Only read the last book in the series but happy with that decision because it was pretty inclusive of previous facts. It covers the interesting period when the military wanted all the intelligence gathering back in their hands but Truman took the steps for the CIA. Ending was not entirely satisfying but will look for more of his books."}, {"userName": "Brandon", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/19973213-brandon", "userReview": "I thought I'd give Griffin another try since this one had an interesting premise. Once again I was sadly disappointed. Not that he isn't good at writing, only that his stories seem to all be upper echelon officer drama. The parts that could make for some good action scenes he generally glosses over the action just to get back to the soap opera style interpersonal drama."}, {"userName": "AndrewG", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/77551797-andrewg", "userReview": "Too long. Overblown and drawn out. Trying too hard. This could have been a good story if it was rewritten to move twice as fast."}, {"userName": "Kevin R.", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/1982912-kevin-r", "userReview": "TOO MUCH OF A GOOD THING?With this being (as of this writing) the final installment of the Honor Bound series, I thought I should chuck in my two cents, but I'll break it into two parts - Books I-III and Books IV-VII:Books I-III are outstanding reads. The characters are compelling, the story is well-paced and developed. All in all, THIS was the series that turned me on initially to Mr. Griffin's books. Had the series ended at a trilogy, it would rank alongside Deighton's Bernard Samson trilogies and le Carre's Smiley trilogy amongst the best I've read.Unfortunately, following a nine-year break, the decision was made to resurrect Cletus Frade and Co. Whether this was due to publisher pressure, fan demand, or the author simply wanting to extend the storyline after so long away, I don't know, but the results are mixed at best.Books IV-VII follow Frade and his merry band of O.S.S. warriors through the dying stages of World War Two, through the immediate post-war period. Frade now comes across as more of a caricature of himself, cracking out wise comments as if there was no tomorrow, and generally proving that he's a \"loose cannon.\" All four of these books are bogged down by the frequent recitations of past events, or recaps. In all frankness, this would be fine if you just picked up the series post-Book III. The reality though, is that most who are reading IV-VII have already read the previous novels, so we're left with page after page of rehashes. Probably 50-100 pages could be cut from each book if these were eliminated.Other areas where these falls short are the \"coincidental\" appearances of nearly everyone Frade has liaised with, AND their best buddies, all of whom are happy to join in the bonhomie of Team Cletus. By Book VII, when two more Germans show up and join the O.S.S. party, the reader is left with a \"come on already\" mentality. I don't think even M.C. Hammer had the entourage that Frade has by Book VII.Finally, the constant mantra of \"we'll get down to business...after we've had a drink or three,\" gets really old, really fast. Jack Higgins and Alistair MacLean novels sometimes suffer from the same thing. It's chaff. By eliminating the drinking scenes from each book, you'd chop another 25-50 pages.Ultimately, I hope this is the end for Frade and Co. It is a worthwhile series, but I'd really suggest you stop after Book III."}, {"userName": "Matt aka", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/19543467-matt-aka", "userReview": "Empire and Honor is a new genre of Action & Adventure for my book reviews but not an unfamiliar plot. This is the seventh book in the Honor Bound series but I didn't have any problem understanding the story. The book is about a few men trying to stop the Nazis, who are trying to flee to Argentina, from selling nuclear materials to the Russians.I enjoyed this book but did not find it extremely memorable. The beginning of the book is interesting with a young American soldier being put in charge of a German woman who had walked a long distance trying to find safety. He ends up having a romantic encounter with her that leaves a large impression on him than her. He ends up joining the OSS which is a group that works under the radar under the direction of President Roosevelt himself.Germans have been flooding into Argentina to escape from Europe at the end of World War 2 and Lieutenant Colonel Cletus Howell Frade, an OSS member, is responsible for helping many of them get started with new lives in Argentina. However, not all Germans are welcome in Argentina as several Nazis and the SS arrive with the plan to sell enriched uranium smuggled by submarine to the Germans.One issue I had with this story was trying to keep track of all the Argentine and German names. Check out the wiki link here if you need help keeping all the names straight. http://en.wikipedia.org/wiki/Honor_Bo...I would rate this book 4 out of 5 stars. I enjoyed the story as their was plenty of action and the characters all had distinct personalities. However, like other reviewers have stated the plot was sometimes a little confusing and I would wonder if I missed something or it just wasn't written clearly. A reviewer mentioned it was a good airplane book and it kept me interested during my long daily commute.If you are interested in more of my book reviews that cover fantasy, SciFi, superheroes and more then check out my site www.fantasyworldwriter.com and signup for my newsletter. I would also be glad to be your friend on Goodreads, Twitter, or Facebook. Matt (@citizenone3)"}, {"userName": "Paul", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/750164-paul", "userReview": "This series has now moved beyond the end of World War II and introduces new characters, which have kept it fresh and interesting as Cletus Frade and his friends – some from his hometown of Midland, Texas, and others from Germany, all now residing in Argentina – battle with Juan Domingo Peron and his ilk.But it’s also important for Cletus to keep his “Tio Juan” alive to prevent Argentina from falling into civil war, and Cletus and his friends and colleagues in from the now-dissolved OSS have to juggle that with the disintegration of their covert operation to smuggle German intelligence officers and their families out of Europe (in exchange for identifying Soviet spies in the U.S. government and with the Manhattan Project).Of all Griffin’s series, this one is my favorite. I hear it said often that his books “aren’t as good as they used to be” (and that since they are now co-authored by his son, William E. Butterworth IV, that the books are not even by Griffin anymore), but that’s simply not the case. The recent books in this series (Blood and Honor) and the one about the cops in Philadelphia (Badge of Honor) have had recent books that were in the same class as early books in those series."}, {"userName": "Sherry Wilson", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/25431547-sherry-wilson", "userReview": "I really enjoy all of W.E.B. Griffin's series. My favorites being this series, Honor Bound, and the Presidential Agent series. What was a nice surprise with this book was the introduction of a new character, James D. Cronley. Jr. who will have his own series, Clandestine Operations.I especially like these novels because there is a lot of actual history mixed in with the action and adventure. I hope this is not the last book in the Honor Bound series because I really like Cetus Frade and his crew. But I'll have to wait and see. The first book of the Clandestine Operations series came out in August and the second book will be out the end of December so I have some good reading waiting for me. I highly recommend all of W.E.B. Griffin's series."}, {"userName": "Fredrick Danysh", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/5651679-fredrick-danysh", "userReview": "LtCol. Cletus Frade, USMCR, has adapted well to his life in Argentina as an OSS agent. With the end of the war, the OSS is disbanded but the remnants are smuggling \"good\" Germans into the country to save them from the Russians. At the same time, former SS officers and troops are smuggled into Argentina in order to start the Fourth Reich and land 600 pounds of uranium that was bound for Japan. The SS try to sell the uranium to the Russians and assassinate Frade and others. A good read that leaves an ending calling for a sequel."}, {"userName": "Combatvet", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/17494138-combatvet", "userReview": "I am a huge fan of the \"Men at War\" series and a friend of mine thought this would be a good one to read along those lines. I was very disappointed, although a good story in and of itself, I found this book to be particularly difficult to follow. It was especially difficult to keep track of who what talking to whom and where they were know from, I found myself going back in the book more times just to refresh on who a particular person was which is not something that I am used to doing with most of his other books."}, {"userName": "Dan Sibbet", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/564140-dan-sibbet", "userReview": "I read the audio book, in no small part because Scott Brick is the reader here. Like the really great readers, he can use his voice to clearly portray the characters distinctly. And in this case there are lots of characters, most of them with German or Spanish accents. I did not know that this book is one of a series (learned that from the other reviewers) but is was a good read, alone. The story, with lots of period \"color\" was good, if incredible. Too many coincidences, too many pieces just fell conveniently into place. But it was a fun book."}, {"userName": "Brian", "userReviewDate": "Aug 28, 2014", "userURL": "http://www.goodreads.com/user/show/4588869-brian", "userReview": "The last of the Honor Bound series (to be succeeded by the Clandestine Operations series). I can understand some of the criticism from some of the reviews about the authors' tendency towards anachronistic dialogue and soap opera-ish (I think I have created a new word there...) drama in the characters' personal lives, but if you can get beyond that, Griffin masterfully weaves history with fiction into a highly entertaining tale."}, {"userName": "Lauren", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/9798929-lauren", "userReview": "I really enjoyed this, whereas the previous books #5 &6 were slower. This one was an enjoyable read. We got some new characters, a great plot, and a cliffhanger. I love this series. At times, the writing does get tedious, (when recapping previous books), or in the German vernacular, but this was a well written story that kept my attention. I am eager for the next in the series. Hope it comes soon!!"}, {"userName": "Meakin", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/10424972-meakin", "userReview": "The last book in a very good series. While some will object this is really soap operas for men. The ending was a letdown and this happens frequently in long series. The young lieutenantbecomes a hero kills the Nazi. All the other characters seem to disappear and we never get to understand what happened to them. This is a major flaw with a lot of authors including this wonderful Arthur Griffin."}, {"userName": "Will", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/21007737-will", "userReview": "Protecting the Gehlen Deal and the Cold War Beginnings. Frade and company find themselves ferrying Abwher Ost members and their families from Germany to Argentina, and find some old buddies who survived the Nazis and Russians and fold them in. Of particular note is a U boat carrying uranium oxide that has arrived in southern Argentina and Frade and company must find and seize it before the Russians can buy the uranium for their weapons program."}, {"userName": "Malani", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/3433647-malani", "userReview": "I read this book as a \"blind date\" with a book program at my local library. I chose this book based upon knowing one factor -it's a historical fiction. I honestly enjoyed portions of the book. it was so realistic at times I had to remind myself it was historical fiction. If you enjoy books that draw you into history deeply & have you reminding yourself it's fiction plus WWII events , then this is for you."}, {"userName": "Eileen Conner", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/2415550-eileen-conner", "userReview": "I enjoyed this book. It has a lot of action, and returning to this series is like reuniting with old friends. One ot those book series I read purely for the fun. This book picks up after WW2, right about the time Peron is starting his coup in Argentina. Clete Frade is involved in this as well as the rescue of German spies that know about the Soviets. It has the remarkable \"luck\" and right place at the right time that always seems to bless Griffin's characters. Altogether a fun read."}, {"userName": "George", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/7430981-george", "userReview": "I have read every Griffin and in order.His style has always bugged me, the repetition of the major story plots and the characters full names and ranks over and over and over again drives me crazy. I have surmised long ago he is paid by the word.This 700 page ( large print) volume 7 in the Honor Bound series could have been done in 200 pages. I am wondering if he even has an editor.I think I read these books now more out of habit"}, {"userName": "Andy", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/5210788-andy", "userReview": "Nothing much new here. Frade and company are in Argentina hunting down Nazis. His cousins and grandfather are in the country for a visit and, of course grandpa isn't all that he seems to be. He's keeping an eye on Frade for President Truman. A lot of build up and the payoff is over quickly. Not a surprise, just a constant disappointment."}, {"userName": "Jack Laschenski", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/1238978-jack-laschenski", "userReview": "Griffin at his best!Argentina in 1946.Nazis are pouring in with money and evil intent - to resurrect the nazi empire.The OSS has been disbanded by President Truman.\"Good\" Germans are trading information to the US in return for being allowed to live in Argentina.Top secret. Lots of heros.Fantastic read"}, {"userName": "Christian D.  Orr", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/16857218-christian-d-orr", "userReview": "This is the first book of W.E.B. Griffin's that I've read (I know, took me long enough, right?). Fast-paced, eminently readable, entertaining, with a fascinating look at life in Argentina in the immediate aftermath of WWII. Some of the \"family squabbling\" (for lack of a better phrase) dialogue gets pretty silly toward the end, but eh, what the heck."}, {"userName": "Barry", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/7725121-barry", "userReview": "Another enjoyable book by Griffin. But, I really do Not like cliffhanger endings and this one terminated very abruptly. Another thing with Griffin which is both good and bad is that all major characterizations are the same from series to series. In this book he adds a new character who again fits into the mold."}, {"userName": "David Freeman", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/17525715-david-freeman", "userReview": "There were several subplots introduced that went nowhere. Many of the pages were filled with needless background information. The major plot wasn't really developed at the level of expertise of the father. And, to add insult to injury, there was no closure! I turned the last page expecting more and discovered that was it."}, {"userName": "Liam", "userReviewDate": "May 09, 2012", "userURL": "http://www.goodreads.com/user/show/3258178-liam", "userReview": "Apparently, the younger Mr. Butterworth is profiting from his close cooperation with his father. Unless I am very much mistaken, the various W.E.B. Griffin series, particularly this particular example, are no longer deteriorating in quality with every new book released. This is far from the best volume in the 'Honor Bound' series, but certainly not the worst."}, {"userName": "Bonnie", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/1679313-bonnie", "userReview": "I thought this series was done and was happy to see another book as it is a very interesting story. It is full of colorful characters and situations. I am not so crazy about some of the language. Also the way so-called nice girls are ready to jump into bed - this is definitely written for guys. Were it not for the good features of this series I'd have quit midway through the first book."}], "description": "October 1945: The Germans and Japanese have surrendered. For Cletus Frade and his colleagues in the OSS, it should be time to pack up, but they have far more important things to do.Chief among them is the protection of their assets, especially the human ones. In the closing months of the war, the United States made a secret deal with the head of German intelligence’s Soviet section. In exchange for a treasure trove of intelligence - in particular the identity of the Soviet spies in the American atomic bomb program - his people would be spirited to safety in Argentina. Only a handful of people know about it. If word got out, all hell would break loose, and the United States would lose some of its most valuable sources and secrets.Meanwhile, in Argentina, a U-boat captain pops up out of the blue and surrenders his submarine and crew. And in the American Zone of Occupation in Germany, a young counter-intelligence agent pursues an unusual assignment perhaps a little bit too viorously. The consequences of both actions will affect not only Frade and company, but everthing they're working on.Now things are really going to get complicated.", "title": "Empire and Honor\n      \n          (Honor Bound #7)", "url": "http://www.goodreads.com/book/show/13593569-empire-and-honor", "average": 4.13, "cover": "https://images.gr-assets.com/books/1335611180l/13593569.jpg", "reviews": 86, "authors": [{"url": "https://www.goodreads.com/author/show/1415338.W_E_B_Griffin", "name": "W.E.B. Griffin"}, {"url": "https://www.goodreads.com/author/show/81018.William_E_Butterworth_IV", "name": "William E. Butterworth IV"}], "type": ["Fiction", "Historical", "War", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/13593569-empire-and-honor", "http://www.goodreads.com/book/show/15947824-empire-and-honor", "http://www.goodreads.com/book/show/17912978-empire-and-honor", "http://www.goodreads.com/book/show/140060.The_Hostage", "http://www.goodreads.com/book/show/1052648.Semper_Fi", "http://www.goodreads.com/book/show/644449.By_Order_of_the_President", "http://www.goodreads.com/book/show/1071085.The_Lieutenants", "http://www.goodreads.com/book/show/1052649.The_Berets", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}