{"ratings": 263, "userreviews": [{"userName": "Susan Albert", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/967151-susan-albert", "userReview": "Loved this long, intimate look into an evolving relationship between two remarkable women. From passion to deep and enduring friendship at a fascinating time in American history. But watch out for fictionalizations in the chapter intros and explanatory notes: Streitmatter adds gratuitous and incorrect detail and misleading characterizations that aren't supported by sources. Just one example (of several I've documented): the dates in the note on p. 59 are completely wrong, according to the White House Usher's Log for that week--which leads Streitmatter to draw the wrong conclusions. I've knocked my original 5-star rating to a 4-star rating because of these issues. But the letters are magnificent."}, {"userName": "Kim", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/315818-kim", "userReview": "I give this book four stars because it must have been an incredible work of scholarship to pull these together and annotate them. The letters are fascinating. All in all, however, I wish the book was written more as a narrative history with excerpts of the letters--which I think would have been more interesting to read."}, {"userName": "Beth", "userReviewDate": "May 05, 2007", "userURL": "http://www.goodreads.com/user/show/77785-beth", "userReview": "Not only was she a handsome woman, but an obsessive chronicler, dyke and letter-writer who has made me cry on account of Lorena many times."}, {"userName": "Stephy", "userReviewDate": "Jun 06, 2007", "userURL": "http://www.goodreads.com/user/show/97521-stephy", "userReview": "Now I know how she put up with FDR."}, {"userName": "Christi", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/349953-christi", "userReview": "This was an interesting insight into the life of Eleanor Roosevelt. Regardless of the nature of the relationship of these two women they both had a really strong bond and loved each other very much."}, {"userName": "Jess Kaz", "userReviewDate": "Apr 08, 2011", "userURL": "http://www.goodreads.com/user/show/5239033-jess-kaz", "userReview": "Excellent read. Makes me sad to think that the letter writing days are numbered in today's society. It's a beautiful art and this book clearly depicts the deep connection these women shared through their many letters over the years."}, {"userName": "Gabriella", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/908789-gabriella", "userReview": "Eye-opening. Read as the story of a long and slowly cooling friendship, it's touching and ultimately melancholy. I can't imagine that it would ever be embraced by women's studies departments because it is obvious that Eleanor Roosevelt is skilfully \"fending off\" Lorena Hickok for so much of their long friendship. Except at the beginning, when she was \"full on\" and probably sent very mixed signals about what she wanted from Lorena. All the same, there was a loyalty between these two women that lasted, and Eleanor did lots to try to \"help\" Lorena in her later years. I feel, though, that because Lorena never got what she wanted from Eleanor—a full-on relationship—there was a tragic imbalance of power between the women. Still, I found myself admiring Eleanor for venturing out as far as she did on a limb, going on a private holiday with Lorena, for example, early on in their friendship and when she was already first lady! Unlike many other reviewers, I didn't mind the footnotes. And the fact that Lorena had been raped by her father, revealed in the footnotes but not the letters, brought a whole new psychological twist to this tale. No wonder Lorena seemed so needy. Eleanor Roosevelt became her powerful protector for life, and she must have both loved and resented that. Congrats to Streitmatter for bringing the rest of this story out."}, {"userName": "LVLMLeah", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/1867119-lvlmleah", "userReview": "Loved this book on so many levels. Fascinating to read about Eleanor and Lorena and their relationship through their letters to each other. It is though a rather sad book in that by the end you've read a lifetime of intimate letters between friends including their endings. You kind of wish when two people share a life of love, and I'm not willing to go so far as to say they loved each other in romantic way for the whole time, or at least not on Eleanor's part, that it could go on forever and never end. And I love that the author only gave the briefest of explanations before each letter as to certain events that preceded or were the reason for the letters and didn't do too much psychoanalyzing or trying hard to spin their relationship into more than it might have been. Clearly though these women did share a passionate love story in the beginning at least and the letters are beautiful glimpse into that. It's also a fascinating book on the historical level as to what their lives were like and what they felt about politics and such during a difficult time in America."}, {"userName": "Kathy Smuz", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/30761004-kathy-smuz", "userReview": "A collection of letters written bewteen Eleanor Roosevelt and her close friend, Lorena \"Hick\" Hickok, beginning in 1933 when Eleanor began her stint as First Lady and Hick was a reporter assigned to cover her. The bulk of the letters span the first 3 years of Eleanor and Hick's relationship and show a very warm, close and intimate friendship which eventually cooled, although the two continued to correspond until Eleanor's death in 1962. The question of whether or not Eleanor and Hick were lovers is left up to the reader to decide, but based on what they wrote, I'd say it's pretty conclusive that they did in fact have a physical relationship. Not only does this provide insights into the First Lady's thoughts and dreams, but it gives her honest opinion on events of the time and her relationship with her husband -- opinions that were often concealed from the public. At times I got tired of Hick's whiny tone, but it's still a fascinating book."}, {"userName": "Rebecca Saxon", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/5661164-rebecca-saxon", "userReview": "A fascinating view into the intimate relationship between Eleanor Roosevelt and Lorena Hickok. Reading the letters there's no doubt of that they had a romantic relationship. Over the years, though, their relationship becomes more of a friendship but that doesn't diminish the importance they had in each others' lives. The letters also provide a neat glimpse into that time period and how Eleanor Roosevelt shaped the role of First Lady. Admittedly the letters are not always that exciting and I probably would have preferred to read about this in prose form. This would be a great book for any scholars wanting to draw on their letters."}, {"userName": "Rebekah", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/6217308-rebekah", "userReview": "The letters were interesting, but Streitmatter's \"helpful\" comments made Eleanor's messy letters nearly illegible and didn't help clarify what was happening so much as big the reader down. I'd have liked for less footnotes or brief italicized explanations as thoughtful, well-drawn out historical and personal literature with the letters interspersed as sourcing. As it is, I am unimpressed and have not learned much about either Eleanor or her so-called lover Lorena (as I find, after all, that I don't believe in their love affair as much as I wanted to at the start of this book!)"}, {"userName": "Sharon Younkin", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/17143330-sharon-younkin", "userReview": "This is a very interesting compilation of some of the remaining letters between Eleanor Roosevelt and Lorena Hickok (Hick). Although Lorena burned most of her letters, her obligation to Eleanor meant that most of Eleanor's letters have been preserved. Lorena did, however, destroy select letters from Eleanor, most likely those that revealed the most about their relationship. The collection does give you some insight into their complicated and challenging relationship, as well as some interesting historical tidbits."}, {"userName": "Crysta", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/98280-crysta", "userReview": "The narrative surrounding these two women is so interesting, and Streitmatter does a wonderful job of providing the context and information needed to read the letters like a story. That said, the First Lady wrote odd diary-style letters simply detailing her days and the majority of the letters in this book are hers, which makes for some slightly dull and incredibly monotonous reading in sections. As the war came on and their relationship strained, the book (and letters) became much more interesting."}, {"userName": "Jean Marie Angelo", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/4993852-jean-marie-angelo", "userReview": "How can you not love a book that has the quote, \"Had the Supreme Court over to lunch. They seemed to have a good time.\" ? Eleanor Roosevelt and Lorena Hickock were intimate friends and probably lovers. The early letters are passionate and moving. This is an intimate look at these famous women, but also a dose of reality on what it was like to live closeted and secret lives. Wish Lorena could have lived to see a more liberated society."}, {"userName": "Cindy Huyser", "userReviewDate": "Jul 01, 2011", "userURL": "http://www.goodreads.com/user/show/2453495-cindy-huyser", "userReview": "This excellent collection of letters allows a telling glimpse into a passionate relationship that continued as a friendship for many years. My biggest regret is that Lorena Hickok burned many of Eleanor Roosevelt's letters because they were indiscrete. I was slow in getting into this book in part because of the extensive footnotes, which are a bit distracting if useful (particularly in explaining the many references Eleanor makes to the people in her daily life). Well-worth reading."}, {"userName": "Janet", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/815418-janet", "userReview": "This book examined the relationship between Eleanor Roosevelt and Lorena Hickok over more than a 30 year period through the letters they wrote to each other. Their relationship certainly appeared to be more than platonic especially in the early years. However, what I found interesting about this book was how both these women tried to influence the changing role of women during the 1930's."}, {"userName": "Rachel", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/4430039-rachel", "userReview": "A must-read for an understanding of how much we owe these two women, Eleanor especially. This country's politics is so not right when we think of Eleanor being in that white-colored house for *twelve* years. It just isn't. We owe her dearly. I haven't gotten all the way through it, but it totally sheds light on so much our grandparents never discussed with us, or even if they did."}, {"userName": "Memphis", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/10256233-memphis", "userReview": "This is an amazing story about love, friendship and a relationship whose depth was never allowed to show at the surface, spanning through years--amazing journey about our history and the relationship between these two women."}, {"userName": "Ami", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/1560618-ami", "userReview": "Quite possibly *the* most fascinating book I've ever read. With all of the love and affection that each letter was sent, they also contain some serious real-talk history that you just won't find anywhere else."}, {"userName": "Laura", "userReviewDate": "Sep 29, 2011", "userURL": "http://www.goodreads.com/user/show/3330099-laura", "userReview": "It's such a great opportunity to read so many of the actual letters and the editor's notes were helpful. Having said that, I had to rank it down a little because I couldn't finish it. I ended up skimming the second half."}, {"userName": "Cathee", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/5972551-cathee", "userReview": "Eleanor Roosevelt has always been of interest to me. Her letters open up a side of the woman few if any of us know. She was able to lead her life during a time when woman in the U. S. had few to no options."}, {"userName": "Shannon", "userReviewDate": "Aug 28, 2007", "userURL": "http://www.goodreads.com/user/show/313257-shannon", "userReview": "Intimate look into the love affair between Eleanor Roosevelt and newspaper reporter Lorena Hickok. Beginning as friends, the relationship turned romantic and grew into a passionate affair. Great insight into the workings of FDR and the political force Eleanor became."}, {"userName": "Melissa Lozano", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/57464716-melissa-lozano", "userReview": "Great read This is a great an intimate read about one of my hero's. To get an inside view of love in her life and some of the workings of the White House is fun for this history nerd."}, {"userName": "Susan", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/1879479-susan", "userReview": "The letters got to be tedious because they describe the very mundane events in Lorena Hickok and Eleanor Roosevelt's lives. More interesting were the footnotes because I was able to gleam information about the era."}, {"userName": "Catherine Jones", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/5690570-catherine-jones", "userReview": "Still reading"}, {"userName": "Kristy Ann", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/2990961-kristy-ann", "userReview": "This book was an interesting chronicle of an intimate relationship set against the backdrop of a rich history of the United States."}, {"userName": "Heidi", "userReviewDate": "Jun 05, 2013", "userURL": "http://www.goodreads.com/user/show/614752-heidi", "userReview": "Reading this because I'm doing a reading of a musical based on the letters of Lorena Hickok and Eleanor Roosevelt. Fascinating relationship, fascinating women, fascinating time."}, {"userName": "Britney King", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/16049736-britney-king", "userReview": "A beautiful testament to the power of love, loyalty, and friendship; and in addition an intriguing lesson in history. Glad to have witnessed their story--in large part via their own written word."}, {"userName": "Sharon", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/28295688-sharon", "userReview": "What's not to love about reading a packetful of personal letters that disclose such a significant period in the United States, in the role of women and the personal lives these historical figures."}, {"userName": "Donna O'brien", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/23266839-donna-o-brien", "userReview": "I loved this book. Extraordinary women and extraordinary friendship."}], "description": "In 1978, more than 3,500 letters written over a thirty-year friendship between Eleanor Roosevelt and Lorena Hickok were discovered by archivists. Although the most explicit letters had been burned (Lorena told Eleanor's daughter, \"Your mother wasn't always so very discreet in her letters to me\"), the find was still electrifying enough to create controversy about the nature of the women's relationship. Historian Rodger Streitmatter has transcribed and annotated more than 300 of those letters—published here for the first time—and put them within the context of the lives of these two extraordinary women, allowing us to understand the role of this remarkable friendship in Roosevelt's transformation into a crusading First Lady.", "title": "Empty without You: The Intimate Letters of Eleanor Roosevelt & Lorena Hickok", "url": "http://www.goodreads.com/book/show/152446.Empty_without_You", "average": 3.91, "cover": "https://images.gr-assets.com/books/1388532481l/152446.jpg", "reviews": 39, "authors": [{"url": "https://www.goodreads.com/author/show/88131.Rodger_Streitmatter", "name": "Rodger Streitmatter"}, {"url": "https://www.goodreads.com/author/show/44566.Eleanor_Roosevelt", "name": "Eleanor Roosevelt"}], "type": ["Nonfiction", "Biography", "History", "Glbt", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/152446.Empty_without_You", "http://www.goodreads.com/book/show/431922.Empty_without_You", "http://www.goodreads.com/book/show/6948578-empty-without-you", "http://www.goodreads.com/book/show/19716718-empty-without-you", "http://www.goodreads.com/book/show/13144415-outlaw-marriages", "http://www.goodreads.com/book/show/573597.Mightier_Than_The_Sword", "http://www.goodreads.com/book/show/1118689.Voices_of_Revolution", "http://www.goodreads.com/book/show/923167.Sex_Sells_", "http://www.goodreads.com/book/show/8420646-from-perverts-to-fab-five", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}