{"ratings": 938131, "userreviews": [{"userName": "Ruchita", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/1844416-ruchita", "userReview": "[(Ending up murdering two school boys in the process. Uhm, major wtf there.) (hide spoiler)]"}, {"userName": "Kat (Lost in Neverland)", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/5749698-kat-lost-in-neverland", "userReview": "DNF at 52%Dear Orson Scott Card,There are over 3,310,480,700 women in this world.Sincerely, Women. Dear Fans of This Book Who Are Probably About To Make An Angry Comment On This Review:Please leave now if you don't want to get all huffy and insulted and make a comment defending the author or whatever other shit that is this book. Or, if you want, go ahead. If you're going to comment, at least read the whole review and not just a quarter of it. I'm so sick of repeating myself over and over in the comments. Yes, I bash the author first, but I do make my points on why I hated the book itself, and not just because of him.Thank you. Sincerely, Kat. First of all, before I get into the book, I'd like to say that Orson Scott Card is one of the biggest dicks on this Earth. For those of who don't know, he is openly homophobic and a hyprocrite (www.salon.com/2013/05/07/sci_fi_icon_... )). He is a Chauvinist (known to believe that women are the weaker sex and were only put on this world to make babies). He is a Mormon that, from what I've heard from people who've read his other books, tries to convert you in his own writing in his novels. Just for this author's personality, this book deserves one star. But now onto the actual book, which deserves one star in itself.The Author's Viewpoints Leak InIt starts out well enough. It's interesting and keeps your attention. But immediately, the sexism shows its ugly face;\"All the boys are organized into armies.\"\"All boys?\"\"A few girls. They don't often pass the tests to get in. Too many centuries of evolution are working against them.\"Keep in mind that this book is supposed to take place in the future. There are several things wrong with this sentence. 1. In this day and age, thousands of women are in the military and fighting for their country. They have been for decades now, and longer still. So if this is supposed to be in the future, does Card think that women will give up their ability to fight so easily? 2. Centuries of evolution working against them? On what terms? That we have ovaries? That we can have babies so are therefore unfit to fight or have the mental capacity to pass the tests boys can easily pass? This is the 21st century, genius. Women work. Women are in the army. Get your head out of your ass and look around, for fuck's sakes. CharactersI feel that Card made all the characters far too young. Ender is six, Valentine is eight, and Peter is ten. Peter has a fetish for torturing squirrels and threatening to kill his siblings. Um, okay? Is there any explanation for this strange behavior? No, because according to this book, all our kids in the future are fully functioning psychopaths. (Except the girls, of course. They're too 'mild' for behavior like that.)In the future, the army is apparently full of kids barely older than six, up to age twelve. To be trained for a war that, as far as I could tell from the point I got to, was already won. WritingThe writing was atrocious. Card switches from third person perspective to first person constantly. The first person switches are for the character's 'thoughts', but the words aren't italicized or anything so you can never tell. To me, that's a sign of bad writing. If you can't stick with one kind of perspective, than you should go back to those non-existent creative writing classes. Plot Towards the middle of the book, the plot started to seriously drag and get outright ridiculous. Valentine and Peter start planning to 'take over the world' by writing fucking debate columns. Not only is the whole 'let's rule the world' concept highly overused, it's poorly planned out. It's randomly thrown into the story like, \"Okay, we need more villains and more things happening, so let's make the ten year old girl and twelve year old murderous boy try to take over the world!......with debate columns.\" Sure. Then, switching back to Ender, who is now nine years old and a commander of his own kid army, we have our main character turning into the bullying idiots that bullied him in the beginning of the book. Has he learned nothing? Oh sure, it makes the kids 'better soldiers'. They're not even seven years old, they are not fucking soldiers. The whole story is a fucked up version of a 'kid military' which is run by controlling adults who don't want the war to end so they can remain in power. It--just--ugh. It got so tedious and irritating that I decided to give up on it. I'm not going to waste my time with a book written by a sexist, homophobic, dickwad. I'm not even going to see the movie, which is a real shame because I love Asa Butterfield. I feel bad that he was brought into such a stupid book/movie business."}, {"userName": "Hollie", "userReviewDate": "Jul 15, 2007", "userURL": "http://www.goodreads.com/user/show/193392-hollie", "userReview": "This was the first book I picked up and read all the way through in one sitting. Technically, it's not a difficult read but conceptually it's rich and engaging.\"They have a word for people our age. They call us children and they treat us like mice.\"If you can't understand that statement, you probably won't like this book. It's about intelligent children. Not miniature adults- their motivations, understanding, and some-times naivete clearly mark them as children. But at the same time their intelligence and inner strength define them clearly as people. Their personalities are fully developed, even if their bodies are not.The book is about war. About leadership. And about the qualities that make some one a powerful or admirable individual (not always the same thing). In this book children are both kind and cruel to each other as only children know how to be. It is not an easy book for anyone who understands childhood to be a happy time of innocence. Even still, the characters retain a certain amount of innocence.The questions posed by the war, by the handling of the war, are relevant today, as they were when the book was written, and as they have been since the dawning of the atomic age. Foremost is the question of what makes someone or something a monster. It is an easy read, but not always a comfortable one.I'd recommend this book for intelligent children. The sort that resent being talked down to and treated like kids. Here is a book that does not talk down to them, but understands and empathizes with them. Also I recommend it for adults who used to be that kind of child, even if science fiction is not your usual interest. More pure science fiction fans will find it interesting, as will those who enjoy exploring the philosophies of human nature and war. This book sets out to make you think."}, {"userName": "Mark Lawrence", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/4508542-mark-lawrence", "userReview": "I read this story quite a while back with no special expectations. Like most books I read it just happened to be lying around the house. I read it, was hugely entertained, and went on to read three or four of the sequels.I've heard since all manner of 'stuff' about the author but what's true and what isn't I don't know and I'm not here to critique the man behind the keyboard. All I can do is report on the contents of the book and those I can thoroughly recommend you check out.The main character, Ender Wiggin, through whose eyes we see the story unfold, is a child genius. If you're one of those people who wants your protagonist to be an average member of society, typical of his/her age and gender... step away. Ender's story is told because he is very far from ordinary. OSC employs a bunch of fairly standard story-telling tricks. Our hero is underestimated at every turn, he exceeds expectations, we know he's got it in him and we're frustrated by the stoopid people who just won't see it. There's a bully/nemisis and nobody else but us sees just how nasty he is... However, OSC manages to bake an irresistable cake using those standard ingredients and once he starts sprinkling on originality as well, you've just got to eat it all.This is sci-fi, not hard sci-fi, not soft sci-fi... let's say 'chewy'. It has a slightly old school EE Doc Smith feel to it, and you expect someone to pull out a monkey-wrench whenever the computer starts smoking, but none of that worried me. Given the date it was written there's some quite prescient stuff about the internet here, although shall we say ... optimistic ... about the ends to which it's put. Card foresaw rather more reasoned political/philosophical debate and rather less hard core porn. Additionally the inclusion of female and Muslim characters whilst not front and centre was fairly progressive for 1985 (not ground breaking but certainly ahead of the curve).This is actually a book with good messages (for the time) about equality, and one which poses interesting philosophical questions about what happens with races with orthogonal thought processes come into contact, and how far one can or should go in such situations.There definitely is some characterisation going on. We're not talking Asimov's Foundation here where brilliant ideas invite you to forgive cardboard characters. The people here are decently drawn and Ender has his own angst (involving genius psychopathic siblings) that is quite engaging. However, it's the stuff that goes on that drives the story. The war games in preparation for battling the aliens, the unfortunately named 'Buggers'. These war games and Ender's brilliance in overcoming increasingly dire odds are a major theme and I loved them.And then there's the twist. I'll say no more on that except that I was too engaged with the story to see it coming, and when it hit me ... well, I'd give the book 6* just for that moment. It doesn't work for everyone but it did for me!EDIT: I have now seen the film - which I enjoyed. The film skips a lot that's important to the book, but I found it entertaining.EDIT 2: Orson Scott Card reviewed *my* first trilogy. That's pretty damn cool!(scroll down the article)http://www.hatrack.com/osc/reviews/ev...Join my 3-emails-a-year newsletter #prizes.."}, {"userName": "Charly", "userReviewDate": "Aug 05, 2007", "userURL": "http://www.goodreads.com/user/show/254555-charly", "userReview": "Spoiler Alert***God damn did I hate Ender’s Game. I checked out Amazon and can surely see why I wanted to give it a shot. Talk about a cult following of people absolutely smitten with it. I even read some where that it’s on the required reading list at Quantico. I suppose this book could be some kind of manifesto for misfit nerds who waste their life playing video games or a source of legitimacy for motivating tired Marines sick of drilling (The book rambles on infinitely about the boy genius Ender and his laser tag in a zero gravity vacuum.) I also suppose we could kid ourselves into thinking the novel brings to light the necessity of Machiavellianism in conflict or maybe we could discuss the pathetic New Age garbage the book ended with as our annoying protagonist spreads some half crocked neo-religion amongst space colonies in which you love the enemy you are forced to annihilate. Some sort of cryptic Latter Day Saints plug by the Mormon author? There were several other things I couldn’t stand about it. First of all, like even the best science fiction, the characters were one dimensional card board cut outs. This starts with the dorky, self absorbed protagonist Ender himself. I can deal with this problem if the plot is cool enough (ala Dune). Dune, too, often times dealt with children geniuses, however it was explained and made sense in the story. We have no idea why Ender and the other children (of which 99.9% were male) are so smart. Speaking of children, did any of you guys pick up any sort of creepy pedophile vibe in this book? How many times were we told of naked little boys? Why were there references to their tiny patches of pubic hair? Why did Ender have to have his big fight naked while lathered with soap in the shower? And the corny Ebonics that the children randomly spoke in? WTF? The third rate and minuscule insight we were given about the geopolitical conditions on Earth were terribly dated. The Warsaw Pact dominated by Russia? What a cheap rip of Orwell. Lame! The side story about Ender’s genius two siblings also using Machiavellian tactics to achieve their political goals (instead of Ender’s military ones) by blogging on the internet really didn’t add up to beans in plot development if you ask me. Of course, Ender is never beaten at anything he does. I suppose we are to be awed by his victories but, strangely, his greatest triumph was his stoic willingness to use some sort of super weapon to destroy an enemy wholesale via exploding an entire planet. On the cover of my book, it suggests this book is appropriate for 10 year olds. What could a child get out this book? Boo to Ender’s Game!!!!!"}, {"userName": "J.G. Keely", "userReviewDate": "May 26, 2007", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "I was savaged by a miniature poodle the other day--wait--no, someone protested my review of The Giver the other day. If you have any pent-up rage from that college lit teacher who forced you to think about books, be sure to stop by and spew some incoherent vitriol--my reviews are now a socially acceptable site of catharsis for the insecure.In any case, one of them made the argument that children need new versions of great books that are stupider, because children are just stupid versions of normal people. Happily-enough, The Giver is a totally stupid version of A Clockwork Orange or whatever Dystopian book (actually, it's a rewrite of Ayn Rand's Anthem). Coincidentally, in my review of Alice In Wonderland, I happen to put forth my own philosophy regarding children's books. In short: they should present a complex, strange, many-faceted, and never dumbed-down world, because presenting a simple, one-sided, dumbed-down world both insults and stultifies a child's mind.However, if someone were to say that this book were a childrenized version of Starship Troopers, I wouldn't sic a poodle on them. Both present a human/bug war, deal with the issues of death, war, the military complex, human interaction, personal growth, and all that good stuff. Also, both authors have their heads up their asses and there must be a pretty good echo in there since they keep yelling their hearts out about one personal opinion or another. However, Orson Scott Card doesn't get into his pointless author surrogate diatribes until the second book in this series, so we may enjoy the first one uninterrupted. So it's a pretty good book for children, and like romeo and Juliet, it's easy to see the appeal: kid defeats bullies and plays videogames to save the world(in one of the sequels, they save the world by making angry comments on the internet--surprising that one isn't more popular here). But more than that, it's not a bad book in general, so I guess I don't have to bother defining it as dumbed-down, or 'for kids'. Then again, a lot of grown-ups seem like they need their books dumbed-down. Just look at The Da Vinci Code compared to The Satanic Verses, or Foucault's Pendulum; or all three compared to The Illuminatus Trilogy. I'm pretty sure when it comes to stupid versions of things, adults have the monopoly."}, {"userName": "Alexander", "userReviewDate": "Jan 11, 2008", "userURL": "http://www.goodreads.com/user/show/145922-alexander", "userReview": "I read this novel because it was often the favorite novel of students of mine, and I wanted to understand why. I should mention that I love science fiction, and have read it avidly since I was barely more than a child. I'm not by any means some kind of anti-sci-fi snob.The first thing that bothered me is that the novel sets adults against gifted children in a way that strikes me as bizarre. Adults are essentially evil but teachers especially. The children are inherently excellent, capable of helping each other in trying to figure out just what the adults are hiding, which is, in this case, a vast and secret war they are tricking the children into fighting for them. This was perhaps the hardest to believe of all the things thrown at the reader, and interestingly, it is hidden from you until the very end, though you can guess at it before then.What disturbed me the most is that the writing is terrible---far too much happens internally, inside the character's head--it's an emo space opera, basically--and one of the most interesting events of the book is nearly buried and the presentation of it is rushed, because it is near the end. There are many points in the battle scenes where it is impossible to understand what's happening. And the penultimate plot event, where it's revealed all of the games were not..games...could have been handled more interestingly. But the novel was overdetermined, things happening only because the writer wants them too and not because they feel inevitable, and so too many of the arrows point in the same direction. By the time Ender meets Mazer, his final teacher, my eyes rolled back into my head at the implausibility of it all. And it's worth mentioning the thing no one prepared me for was the bizarre homoerotic subtext built into the book as well, a subtext that is sometimes just a plain old supertext, on display, right beside how women in this novel are to be loved distantly and kept from real knowledge, and turned against themselves, so they can then be used to compel others.It creeped me out and I'm gay.I'm also a former 'gifted child', and was tested and poked and pushed, all of these things, made to study computer programming when I didn't want to, and I made myself fail out of their program to get away from them. But I found no commonality with the gifted children here, not as I have in other stories about gifted children, say, like Salinger's Glass family. Also, these kids are all jerks. I do hand it to Card for the ideas in the novel: blogging? Yes. It's in here, well before anyone was doing it, and it ...matters a lot, and in the ways blogging matters. Also the idea of an institution that runs on the manipulation of its populace into a distant war with an implacable foe, as a way of controlling people. And a society that has no privacy at all, not even in dreams. This novel does offer a dark picture of what life is like under these terms. Also, the idea of how a hive-mind would think differently, without language, and the complications of communicating with someone like that, that's brilliant also.I wish it had been revised--that the battle scenes were clearer, that the movement of the novel's action, the way the 'buggers' are in a race to try and communicate with Ender before he kills them, that this were more obvious to the reader, and not a surprise whipped out at the end, so that it could have lent tension to the scenes of the games and manipulation, which were only boring. And Ender's decision, to be the Speaker for the Dead, that struck me cold, because in the end, the buggers were only trying to do what everyone else in his life were doing to him: poring over what makes him tick and trying to get him to do their bidding. The novel contains a rant against style at the beginning, added by Card, called 'literary tricks' by him. I think the most interesting thing about it is that given the millions sold, it is proof that story matters more than style, even as convoluted and badly formed as this one is. In the end what matters is the questions the novel raises and the implications of the questions, and that the novel really is about something at its core, behind all of the badly rendered fight scenes. I admire style, don't get me wrong. I love it. But it would appear you can get by without it."}, {"userName": "Matt", "userReviewDate": "Jan 14, 2008", "userURL": "http://www.goodreads.com/user/show/780845-matt", "userReview": "i think 'ender's game' is the only book i've read three times. for me books often don't have repeat reading value in the same way some movies have repeat viewing value. it's probably because a movie takes two hours of your time while a novel, for me, takes a week or longer. so for someone like to me read a novel twice, not to mention three times, is really saying something [and yes, i realize the inherent snobbery in that statement].i've thought long and hard about what makes 'ender's game' so appealing. it's got a sympathetic protagonist, lots of great action, lots of heart, and a plausible twist of an ending. on those merits only 'ender's game' works. it's a lot of fun to read and orson scott card manages to inject some really moral and ethical quandries without resorting to didactism or heavy-handedness. for example, the manipulations of the battle school powers-that-be are presented and inspected, but card never explicitly paints them as the enemy. they are who they are, for better or for worse, but it's up to the reader to for his or her own opinions. same for ender and his merry band of castoffs. card understands that good v. bad is never as simple as black v. white. the world and universe are, more often than not, varying shades of gray. and the folks who inhabit that gray universe, for better or for worse, are who they are. they all have a part, they all have a purpose--even if those parts and purposes contradict each other.'ender's game' is also a great story of the value and importance of friendship. i choke up everytime ender's friends great him over the headset and the kids prepare for the final 'battle.' who wouldn't want friends like bean, petra, hot soup and the rest? i sure would.but i think the real appeal for 'ender's game' comes from the belief that we all want to believe that there's something uniquely special about us. i think it's safe to assume that most of us have, at one point or another, felt like the underdog, the castoff, the misfit, the misunderstood, or the underappreciated, and that if people would just give us a chance, we'd shine. in that way ender is very much a universal character. he embodies a small part of each ous. yes, he is treated unfairly and manipulated, but he's also the smartest kid in the room. there's something very appealing about that. at least there is for me. whether or not i'm the smartest person in the room is irrelevant, but i want to believe it. and whenever i read 'ender's game' there's a small hope that it just might be true."}, {"userName": "John Wiswell", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/147818-john-wiswell", "userReview": "This is a novel that blows past conventional ideas like \"disbelief.\" Apparently humanity, a species whose only real claim to fame is war, now stinks at war, and can only be saved by a child genius who is one part prophecy, one part bad science, and one part wish-fulfillment. Thanks to this plan, we are treated to a gaggle of super-intelligent children who seldom appear particularly clever (in fact many behave with adult maturity rather than abnormal intellect) and achieve greatness not through any great effort that we follow (rather you'll read recaps of their successful efforts), but because the author wants them to achieve these things. In this, the definitive edition of Ender's Game, there is almost nothing earned within the plot.It's a decent story, but for a book with so many events there is very little consequence or risk, and the character development is so linear and stale. That last quality is particularly cloying considering that, prodigies or not, most of the characters are children and at least one of them should develop in an unexpected way. Instead the unexpected developments we get are humorlessly absurd, like two prodigies fooling the world with a fake op-ed column that earns them political power. The ending is predictable and deliberately anti-climactic, robbing the novel of its one true punch. The trade-off is, instead of getting the thing the book was building to, you get the opportunity for sequels and spin-offs. If you liked the infallible, mostly emotionless and paper-thin protagonist, then that's a good thing. If you were hoping to have the hours you put into the book validated with some real emotion at the end, well, neither this author's definitive edition nor any other is going to help you."}, {"userName": "Stella  ☢FAYZ☢ Chen", "userReviewDate": "Jun 25, 2010", "userURL": "http://www.goodreads.com/user/show/3350026-stella-fayz-chen", "userReview": "If I fail my exams this week, I blame this book.Ah Ender's Game, how you have sat on my bookshelf for over a year before I got to you. You have been so nicely received by the sci-fi community so why did I put you off? BECAUSE I WAS STUPID, THAT IS WHY.My stupidity aside, I hope you guys will still consider this 5-star review to be credible and valid. I'll list off the pros and cons to this novel and you can decide.Pros:An adorable main character. Ender (Andrew) Wiggins was a breath of fresh air from the strong heroine of YA literature. Being a 6 year old at the beginning of the novel, I was completely caught off guard by his maturity and how sneaky he was.The tactics used in the Game.The reason the Hunger Games was interesting to me were solely due to the tactics Katniss used to stay alive, Well, guess what? Ender Wiggins just pretty much kick this Katniss chick's butt. Ender almost reminded me of Alexander the Great or Napoleon and I LOVED IT.Oh the perceptive of Valentine and Peter was also very fascinating. The political backdrop highlighted by Demosthenes and Locke was very refreshing for a science student like me. Now, I shall move on to the cons:The lack of romance.OMG WHO AM I SUPPOSE TO SHIP NOW? NO DARK, MYSTERIOUS BOY WHO THE MAIN CHARACTER CAN FEEL SEXUALLY FRUSTRATED FOR.Haha, just kidding. I am glad the focus was on Ender and his growth to his maximum potential. The lack of romantic development is one of the best thing about this novel. I find romance takes away from such a masterpiece.Just to be clear, there are no cons to this book. I am just a fool who never listen to others' opinions and it often comes back to bite me in the rear.Joke's on me, I suppose."}, {"userName": "Kyle Nakamura", "userReviewDate": "Mar 11, 2008", "userURL": "http://www.goodreads.com/user/show/986519-kyle-nakamura", "userReview": "This has to be, hands down, one of the best science fiction books written. Ender's Game is set in a disarmingly straightfoward sci-fi setting: a near future earth threatened by a hostile alien species with superior technology that seems determined to destroy the human race. The story centers on a young boy who is drafted into an all-consuming military training program at the age of 6. The program he's inducted into seeks to forge a new generation of military commanders out of gifted children, and it's sole purpose is to break them at any cost, until they finally discover someone who can't be broken. What follows is an emotionally complex and at times painfully familiar story of children struggling to accept their inner demons. Ender in particular is cursed with a brutal combination of profound empathy for others, and an overwhelming survival instinct that drives him to win no matter what the cost. It is this combination of gifts that may make him the commander the fleet needs in it's war against the alien invaders, but only if Ender can find a way to survive the burden of understanding his enemy so thoroughly that he can no longer see them as \"the other,\" but as a reflection of himself. The story is fast-paced, and Card's signature style of simple, plain language and streamlined descriptiveness serves to bring the characters front and center at all times. This book is infused with a very real sense of psychological and spiritual dislocation, and treats it's young protagonists as fully realized, intelligent, 3 dimensional characters struggling with very adult questions. Card's other signature: creating drama through ethical dilemmas, is also a central element of the story, and he does a very good job of challenging the reader to find some semblance of moral high ground anywhere. The conflicts between characters are made all the more powerful by the almost total lack of mystery: motivations and intent are laid out very clearly in most cases, and it is the reader's ability to empathize with everyone's point of view that makes the story less about winning and loosing and more about living with the consequences of either.  This book is thought provoking, emotionally complex, and ethically challenging. It's a powerful examination of conflict and violence, military necessity, family roles, and the ways in which we use the idea of \"the other\" to justify all manner of savagery."}, {"userName": "Alejandro", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "Polemical indeed\n\nBEST SCI-FI'S NOVEL CONTENDER?\nI decided to read the novel basically because the incoming film adaptation (it was \"incoming\" at the moment that I read the book) and I wanted to read the original book before of watching the film. I am aware of the controversial opinions about sensitive social subjects, but I want to keep that out of this and only commenting about my impressions about the book itself. First of all, I doubt highly that the film adaptation will be so crude in certain developments of the story mainly because of that the protagonist of the story is a child. (and I wasn't mistaken about that) And commenting about the shock made for the book, it's obvious that it's provoked due that the protagonist is a child. This very same story using an adult, even a young adult, and this book wouldn't impress anybody. \nHOW MUCH TIME CHILDREN REMAIN AS CHILDREN NOWADAYS?\nHowever I think that establishing that this is a story set into the future of humankind, I think that how the children think, talk and act here is not far-fetched.Maybe in 1985 could be......, but now? Now, children have all the access to internet just like this \"futuristic\" story sets, and now kids got \"mature\" very quickly, not a real maturity per se, but the exposure to so much information in the web and the interaction on social networks, forums, blogs, etc... make them to \"act like adults\" before their time and also it make them to lose sensibility on how treating living things.So, that angle is very visionary. No doubt about it, and maybe because of that, the book will remain as something relevant to read not matter if we enjoyed the reading or not of it.\nA BATTLE SCHOOL SHOULD BE STILL A SCHOOL?\nNow, the development.I found odd that in his life on Battle School, you only get the practices and exercises, and you only read about how Ender learn from his peers and never from the teachers, it's supposed to be a school but you never see how are \"classes\" there.It's like if he wouldn't get any valuable education from adult teachers. The book was really interesting while Ender was still very young but as soon he got a promotion to commander, I think that much of the \"spark\" of the narrative was lost. \nTO BUG OR NOT TO BUG\nIt's kind of a rule on these military sci-fi stories that they have to battle against insect-like species?Like on Starship Troopers. I guess that it's easier to get a lot of killing without provoking so much social shock. I am sure that when Peter did some awful things to one single squirrel disturbed a lot of people, me included, but killing insects? If a kid kills an animal, it's a sure signal that they have a psychopath on their hands, but killing a cockroach? An ant? A wasp? Unless you are a monk in Tibet, you have kill an infinite quantity of insects on your life and you didn't think twice about it again.So, the easiest way to make people confortable with massive killing is convincing them that they are not killing sentient life forms but dang bugs.And, yes, that not only works here, in this book, but in many dark moments in our history."}, {"userName": "Rebecca Watson", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/16078369-rebecca-watson", "userReview": "Once upon a time, there was a tiny 6-year old boy who all the other kids picked on. Little did they know that he was very special and all the adults secretly loved him even though they didn't stop anyone from picking on him, and also he knew karate and he didn't want to hurt them but he would if he had to, and it just so happens that he has to. Often. Also he spoke and thought not like a 6-year old boy but as a smug 30-year old man with a fair amount of unresolved bitterness toward his childhood.I finished this book very quickly, not because I am a misunderstood supergenius toddler, but because if I lost any momentum at all, I'd put this book down and never again be able to screw up the energy to deal with the pretentious little prick known as Ender Wiggin. I really wanted to like the book. The basic outline of the story is fine and even appealing to me: kids being trained with video games from an early age to join a war effort. But the writing was, at times, excruciating. To be fair, had I read it when I was a (fairly average, I'm sure) 12-year old, I probably would have found it more enjoyable. But as an (average, again) adult, I found it to be about 100 pages too long and filled with long passages during which I developed a loathing of the main character at precisely the moment when the author clearly wanted me to admire his cleverness, strength of character, and bold moral wrestling. \"Ooh, how deftly he wins the admiration of his peers by suggesting that bully is gay! Aah, the psychological pain he endures at being the best at strategy and physical combat! Oh, the bravery of joking with the black boy about how he's a n****r! Oh why can't he find a teacher who can teach him something he doesn't already know!\"I was also continuously distracted by sentences like, \"They pushed his face backward into the door.\" What does that mean? If they're pushing his face backward, does that mean his head hit the door? His face can't hit the door if it's not facing it.Anyway. The final act started off well enough and brought everything to a satisfactory conclusion, and then the book continued on for another 25 pages that should be considered by nerds to be as unconscionable as the final episode of Battlestar Gallactica, where all reason and logic are dispensed with in favor of some weird fantasy that pretends to wrap up everything in a nice and neat bow.It's interesting to compare this to Dune, which I read last month. Dune does a similar thing (young adult-style writing about a young boy with great powers who will save the world) but does it without making the main character insufferable. Unlike Dune, I don't think I'll bother reading any other books about Ender, the universe's tiniest supergenius."}, {"userName": "j", "userReviewDate": "Oct 21, 2009", "userURL": "http://www.goodreads.com/user/show/2863914-j", "userReview": "Lots of people have already read this book, and it's pretty much universally acclaimed, so it probably doesn't really need another review. So I just want to point out one thing that bothered me both times I read it (with a decade at least in-between at that):Isn't it weird how much time the kids in this book spend naked? The entire time Ender is at Battle School, Card constantly tells us how everyone is always sleeping naked, or walking around the barracks naked or jogging naked. And one of the major fight sequences happens in the shower, and Ender's opponent strips down beforehand so they can both be naked. And did I mention that the genders are mixed (if mostly male) and the oldest character in the book is 12?I don't know, maybe it's just me. It's not like I'm offended, it's just odd and a little distracting. Don't kids have shame in the future?This review brought to you by the word \"naked.\"------------------------------------------------Oh and I also meant to put in something about how this book predicted so much of the way politics and the internet would evolve and intertwine, and the emergence of blogging as a platform where any one person can rise to international attention through a democratized communications forum. But it didn't fit the naked theme."}, {"userName": "Lyn", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "This was a really good book. On its surface it is a great story about a young boy who goes through tremendous struggles. On another level it is a brilliant psychological character study and an observation of group dynamics. On still another level it was an intelligent allegory for violence and bellicosity in ourselves and our society. There is a listopia list that calls this the best science fiction novel. Mmmmm, maybe. I can see why someone would say so. I have heard where military organizations have assigned this for cadet reading.It is very good, certainly high in the running and on a short list of best ever. I will read more by Card and may read more of the Ender series."}, {"userName": "Tatiana", "userReviewDate": "Dec 11, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Hmmm, I find it hard to understand the level of following this particular book gets. Ender's Game is the type of sci-fi that doesn't interest me much. 225 pages about a boy playing video games, battling in zero gravity, and learning about how military works? I can work up some interest for these things, but there has to be some characters I care about. However, how exactly am I supposed to find compassion for a boy who goes from one task to another never failing and always being the best at EVERYTHING, and not because he works hard to achieve his greatness, but because he was genetically engineered to be the best? Where is the conflict and character growth here I wonder? And then the kids. I wish even one of the characters actually acted like a kid, or a human being at least. I personally only saw cardboard in every direction. I suppose there are some interesting ideas about military training, manipulation, and leadership, but I admit, I mostly found myself bored to death by numerous battles, which I couldn't visualize, and it's-so-hard-to-be-the-bestest-ever-genius whining.Listening to the author's speech at the end of my audio book didn't endear me to him personally either. He is just not a very sophisticated person, but he surely knows his audience of prepubescent boys and gamers well. Plus I have very little respect for writers who create not because they have something important to say about our society and human condition, but because they are paid 5 cents per word to do it. I think I will stick with Ursula K. Le Guin for now, whenever I am in a mood for some alien action, and resign myself to the fact that Ender's Game's cult classic status is something I will never be able to understand. P.S. I did have a blast reading reviews about the author's obsession with naked, soap-lathered little boys. How they came up with this pedohomoerotic BS, I have no idea. Did we read the same book? P.P.S. I also had a blast reading Card's raging homophobic \"essays.\""}, {"userName": "karen", "userReviewDate": "Oct 15, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "ender's game is pretty awesome, when it's not being boring.and of course it is just me - in class yesterday the parts i mentioned as being boring TO ME were other people's favorite parts. and this is all due to a design flaw in me: i am physically incapable of visualizing action sequences. in movies, they make it so easy. in books, i frequently have to reread scenes a few times before i can orient myself. throw in zero gravity and weapons that don't actually exist, and i am loster than lost.but - the parts of this that are good (to me) were very very good. why have i never read this before?? because i thought it was a total little boy book - all outer space and video games. and it is. but it is also about the formative years of a military savant - pushed nearly beyond his endurance into this pit of loneliness and pure strategy and honed into a killing machine. usually i hate precocity, but this was just brilliant. i liked so many of the characters, i loved watching ender progress, i just loved every minute of it. and even the parts i couldn't wrap dumbhead around, they were still fast-paced, even though i couldn't understand \"wait, so who is hiding behind the star?? and who has been flashed? and what does that cord attach to??\"and of course, all that it has to say about the role of ethics on the military and about the suppression of the individual in these circumstances is gorgeous.and if you like this book, be sure to check out o.s.c's many review of snacks and other sundries:this one is pretty informativei am sorry this review is crap, but i am supposed to be studying for a midterm. plus, almost everyone has already read this, so it's not like i am discovering anything here."}, {"userName": "Celeste", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/7317186-celeste", "userReview": "Full review now posted!Some books define different aspects and periods of your life. Ender’s Game for me represents the loneliness of childhood when you’re different. I first read this book when I was 9 years old and just starting the 4th grade. I was the only kid in my small class in the Gifted program at that point, which set me apart. I was an odd child, athletically challenged and socially inept and physically awkward. I had teeth too big for my head, ears too far large for my face, and hair that pencils could get lost in. My only true friends at this stage in my life were family members and books. “Because never in my entire childhood did I feel like a child. I felt like a person all along―the same person that I am today.”So when I came across Ender’s Shadow and Ender’s Game, I felt understood (by someone unrelated to me) for the first time in my life. Here were kids who were different, who were often hated and belittled by other children because of those differences, but who discovered that those differences were actually their strengths. That was an incredibly inspirational possibility that I clung to for years after reading the books for the first time, and that I still cling to when I feel like I don’t fit in somewhere.“I think it's impossible to really understand somebody, what they want, what they believe, and not love them the way they love themselves.”My copy of this book is tattered. Pieces of the cover are missing. The spine is broken. The pages are yellow. And I won’t trade it for a newer copy until it falls completely to pieces. I just read this book for the 8th time. I read it in elementary and junior high and high school, once every couple of years, just to remind myself that what made me weird could make me strong. I read it in college when I got married younger than most people and wasn’t living on campus, and was viewed as an odd duck by my classmates. I pushed it into the hands of kids I could see myself in when I became a teacher. “Humanity does not ask us to be happy. It merely asks us to be brilliant on its behalf.”I lead a small monthly bookclub for teenagers at my local library, and was thrilled when they chose Ender’s Game as October’s book. I hadn’t read it in about five years, so I was a bit nervous that it wouldn’t hold up to yet another reread, but I dove in anyway. Never have I been happier to be wrong. This book packs just as much punch for me 19 years later as it did the first time I cracked it open. “Perhaps it's impossible to wear an identity without becoming what you pretend to be.”Ender Wiggin is a genius, wise beyond his years, and he is thrust into impossible situation after impossible situation. Adults are the enemy, seeking to isolate him and push him to his breaking point. But he will not be broken. He adapts and overcomes, making friends in spite of the establishment’s best efforts. However, a time comes when he has to put the mission above his relationships, and has to stand alone. His empathy and drive and monstrous intellect are awe-inspiring, but are they enough to keep him from finally shattering beneath a weight too large for his small shoulders to bear?“There are times when the world is rearranging itself, and at times like that, the right words can change the world.”This is not a children’s book, but never in my childhood did I read another book that I related to more than this one and Ender’s Shadow. I honestly feel that this book is appropriate for all ages. If you know anyone who is different, who just can’t seem to become part of the crowd and always seems to stand out and stand alone, please find a way to get this book into their hands. Be they child or adult, this book will make them feel less alone. And if you yourself are different, if you march to the beat of your own drum even when the world demands your silence, read this book and feel understood.Original review can be found at Booknest."}, {"userName": "Will M.", "userReviewDate": "Nov 03, 2013", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "I can't believe it took me forever to finally read this. I chose to watch the movie first last year, because I remember not having the physical copy of the book yet. That was the biggest mistake of my reading life.The book is way better than the movie. I know you've probably seen that phrase a million times, but I can't fully express how it truly applies to Ender's Game. I can't find a flaw even if I wanted to. Everything seems perfectly written and constructed. I'm going to be honest and say that I hated most of the overhyped books here on goodreads, but the hype that Ender's Game received's truly deserving. It lived up to my expectations, and continued to amaze me as every page went by.The character development in this novel's truly astounding. It's really nothing like the way the movie introduced the characters. Everyone in the novel felt important, and their transformation had a huge impact to me. Valentine and Peter were both very much established, and their life journey [as children] was somewhat different, but completely interesting and amusing at the same time. If I remember correctly, the movie didn't even show that both of them  became  Demosthenes and Locke. That part of their story truly amazed me. This novel showed that age doesn't matter in making a difference. It's all about courage and knowledge to truly express what's inside your head. I didn't like Peter in the moral sense, but his violence and bullying led to Ender and Valentine's positive growth. It may have affected Ender in a bad way, but if you look at the overall change that Ender exuded, it's remarkable how violence led to success.I think I'm going to retract my statement that I can't think of any flaws. I believe the author was too harsh with his characters, too harsh in a sense that it became a bit unbelievable. Unbelievable in the sense that I haven't really encountered a child who was pushed too much that he's capable of murder. I'm not talking about Ender, because despite everything he did, his humanity was still very much evident. I'm talking about Bonzo. How could he be capable of murder, and not have any guilt afterwards. If the author presented a violent past, then maybe I could still digest the fact that he became  evil , but he was just evil like that. He expressed his anger by raging on Ender, without a concrete and well-explained reason why. That's the only  problem  I could think of, and it's not even really a problem to be honest. It's so minor that the magnificence of the novel can easily cover up this personal opinion of mine. It's not even bothering me, I just wanted to present a slight flaw so that this review wouldn't seem to kiss the novel's ass so much, even though I think it is.\n\n I've lived too long with pain. I won't know who I am without it \n\nYeah, that line in the near end says it all. Ender's a changed man, call me sadistic, but I believe it changed him for the better. He's become the strong young man he's supposed to be.The plot and character development were both amazing, as I repeat. It's original [for me at least] and the ending truly depicts that the author's not done trying to destroy Ender's humanity. I can't wait to read the succeeding novels, even the Shadow series after. This series made it to my top favorite, alongside A Song of Ice and Fire, or maybe I could just say that this is my favorite Sci-Fi book, and possibly series. If you really read the review, then it's obvious that I'm giving this the highest possible recommendation to anyone. The hype might make you cautious, but seriously, this is novel is amazing. 5/5 stars, truly remarkable."}, {"userName": "Becky", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "Ugh. Okay. I'm officially giving up on this one. So, a little disclaimer here. I do not like Orson Scott Card. As a person. I think he's a shitty human who's used his award-winning author status as a platform to advocate the denial of other humans' rights. This is detestable to me. But that is not why I rated this book 1 star. The reason I gave this book 1 star, and have given up even trying to read it, is because I do not like Orson Scott Card. As an author. This was the second book of his I've read - or tried to read- and it will most assuredly be my last. I finished the other one, but can't say I liked it, though it was... interesting. This one I just couldn't even muster up any meh over, and it's supposedly his best work. I disliked it almost immediately. I made it about 15%, and I've read about all I can stands, I can't stands no more. The writing is awful. We're told what Ender thinks. We're told what Ender feels, and does, and says, and why, and despite supposedly being in his head, I don't understand or like him at all. We're told he's a genius. We're told he's mastered calculus as a toddler, that he can hack school computers with ease. We're told that he plays game A. Then he beats it, and plays game B. In every game, the goal is conquer and kill, and he's the best at it. But we're told that Ender does that only when he's forced... but then we're told that he likes it - no he doesn't! - yes he does. He stabs the game giant in the eye and likes it, and then when the giant is 'dead' and no longer an obstacle, out of boredom, he wishes he could murder it again. Because he liked it. That's why he's The One. Duh. The ridiculous chapter-leading nameless dialogues are terrible and jarring and distracting, and they take me out of the story. Which is a very bad thing when I'm disliking and uninterested in the story as it is. The complete lack of characterization is shameful. These kids, and especially Ender, who is SIX YEARS OLD and likes to throw the N-word around like it's a frisbee, sound like adults that I wouldn't even want to talk to, let alone root for. I don't like, understand, or care about a single character in this book. Not one. Wait, I might like the Buggers, but that's only because I feel like they have to be decent if they want to rid the universe of this society of sociopaths and groomed killer children. Then there's the fact that I'm apparently supposed to believe that a society as advanced as this one, with space travel, in-body monitoring of thoughts and actions of their potential recruits, the ability to at least partially coax out genius children by specialized breeding, etc, would be so casually dismissive of female potential as to respond to a question regarding whether there will be girls at this murder-camp with \"A few girls. They don't often pass the tests to get in. Too many centuries of evolution are working against them.\" Because, apparently, only Y chromosomes can carry intelligence and females are just sub-par, even at evolution. How can they be a war leader and savior of humanity if they can't even master upward evolution, like males have? Oh, but wait... which entry tests were those again? The ones that require extreme violence? Stomping the shit out of another kid, albeit a bully, was the only test-like thing I saw that earned Ender a spot at murder-school. And it's OKAY that Ender put him in the hospital, because he was forced to do it or keep being bullied. There was no other solution. So maybe that little comment was a backhanded compliment to us of the gentler, weaker sex. Our delicate sensibilities just don't automatically run to murderdeathkill at the slightest provocation, which from what I can tell makes females completely valueless except as future-soldier-makers, so yeah, I guess we fail. Darn! I don't buy the concept of putting all of the eggs of an apparently critically endangered humanity into a single basket that consists of a child 4 years away from attaining the glorious achievement of double digit age. But wait, this war is apparently on hold while this generation of future soldiers grows up? How awesomely considerate of the \"Buggers\". I now see why they must die. /sarcasmWhich brings me to the \"Buggers\". They are aliens. Got that. Apparently, there's no possibility of aliens NOT wanting to wipe out all of humanity... because, you know, the universe isn't big enough for the both of us. I was really, really hoping for a plausible reason why these aliens would want to kill people, but I got nada. Perhaps it's explained later. Or maybe this is just fear and hatred of the unknown. I don't know, and frankly don't care all that much, but it just feels like we're supposed to just go along with the story that implies that different = bad and must be killed. I'm not squeamish or tender-hearted. I fully believe in killing off characters that need to die, even and especially if it's painful to the reader. Violence, in general, doesn't bother me, and I have no trouble reading about abuse, or death, or destruction, or brutality. But it needs to have a purpose and reason for existing on the page. It needs to be honest, and realistic, and plausible. And I didn't feel like that was the case here. It felt like it was for pure shock value here, placed with ever more aggressive offensiveness with the hopes of a reaction. \"OMG! they are just babies! Oh the brutality! Won't someone save the children?!\" And it worked, because my reaction is to stop reading this shit called a book. The racism, misogyny, hatred of the 'different', the adult condoned and encouraged cruelty and alienation of weaker or smaller children, the violence and genocidal-tendencies in a 6 year old all made me hate every minute I spent reading, or avoiding, this book, and only confirmed that Orson Scott Card is not someone whose work I will ever read or watch again. I could go on, but I'm done with this book. Writing it off and washing my hands because they feel like they've been holding something disgusting and slimy. I haven't seen anything even remotely redeeming in this book, nothing that makes me think that the rest of it would be worth my time, and I'm done."}, {"userName": "Adam", "userReviewDate": "Dec 27, 2007", "userURL": "http://www.goodreads.com/user/show/406535-adam", "userReview": "After finishing this \"classic\" of science fiction, I find myself most intrigued by the large following it seems to inspire. My next step in regards to Ender's Game is not to read the next installation, but to explore the favorable reviews. But first I have to get my own frustration off my chest... The writing is atrocious and heavy handed. Apparently, in the future, the earth is threatened by bug like aliens who are going to kill all the humans, so the international federation, for some reason not clearly explained, takes really smart little kids (instead of say, an adult) to a battle school where they play battle games, video games, etc. I guess the big kicker in the end is that the final video game little Ender plays was actually real, and he defeated a billion bugs and yay the world is saved. I guess he's eleven at this point. One of the intermittent subplots is that Ender's sister and brother are influencing political culture back home through the internet. Now, I'm sure some great speculative fiction could fill in the blanks for us, as to why only children can save the world - but basically the assumption is just granted here that these here kids are really smart. Two more quick complaints - all the interesting stuff is shoved in at the end. I had to sit through 300 frickin pages of detailed \"battles' between little kids in anti-gravity suits, and then at the end we hear about how the alien bugs have a collective mind, the ability to penetrate Enders' dreams, earth colonists taking over the bugs homes - its all very interesting for 10 PAGES and then its over. Secondly, this author is just tremendously sexist - all the women play manipulative, petulant characters bent on controlling lil Ender. Okay so my review is this book sucks except for the last 10 pages."}, {"userName": "Kathryn", "userReviewDate": "Sep 21, 2008", "userURL": "http://www.goodreads.com/user/show/1497350-kathryn", "userReview": "Not my cup of tea. Considering that the author probably intended the reader to sympathize with the main character, I disliked the main character way too much, right from the start. Also, many people will probably disagree with me but I think this book is rife with the author’s personal prejudices. Off handed comments about women and different nationalities just threw me for a loop, left me wondering why they were included when they offered absolutely nothing towards the story. Additionally, I disliked the dialogue, slang, and boring characterizations."}, {"userName": "Alex Duncan", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/2868168-alex-duncan", "userReview": "Okay, some people find this book kind of juvenile and have trouble suspending disbelief long enough to enjoy it. For those folks, you might want to move along from Ender's Game.Ender's Game is the twenty-five year old science fiction classic that's soon to be a major motion picture. Actually, the film comes out in November of 2013.Unlike many hard-core science fiction titles, this book is particularly appropriate for a younger audience. By the way, this new young adult edition of the Hugo and Nebula Award-winning classic includes an original postcript by the author, a man (Orson Scott Card) who just so happened to win the Margaret A. Edwards Award for outstanding lifetime contribution to writing for teens. One interesting thing about the interview is he reveals that the novel is all about leadership. Go figure.Back to the story...Its protagonist, Ender Wiggin, is just six years old at the novel's beginning and still a pre-teen by the time the story ends. Ender's parents have received special permission to have a third child in spite of strict population control laws in the society in which they live. His brilliant older siblings, Peter and Valentine, have all kinds of promise, but still don't have what it takes to be considered for the commander that the International Fleet (I.F.) so desperately needs.The novel asks an important question: What does it take to successfully lead men into battle? Battle comes in the form of alien invasions of Earth (two thus far). During the last invasion, mankind survived only because of the brilliance of Mazer Rackham, commander of the International Fleet.Years later, a third invasion is feared and the I.F. believes that Ender may be the commander they need. They hope he can lead them to victory should the alien \"buggers\" invade again. Ender ends up displaying the desired combination of compassion and cruelty the I.F. wants in their commander and they take him to Battle School, where brilliant children are trained in military strategy and tactics. Ender is only six years old when he is plucked to succeed Rackham and sent to the space station \"school.\"In Battle School Ender is isolated, ridiculed, bullied, and pretty much persecuted. He shows the wherewithal to survive and even thrive these difficult circumstances.Using his astonishing intelligence, the boy learns to be a leader and to act with the vengeance of a top-notch solider. His youth and small stature fail to hold him back, and Ender climbs the ranks quickly. Ender is only 12 years old when he begins commanding his fellow soldiers, earning their respect and ultimately their fear of him.The centerpiece of their education is a game that simulates battle. Naturally, Ender is very good at this game and this is the biggest reason why he becomes the youngest commander in history. Anyhow, Ender's life in the school and the various games, trials, and tribulations in which he excels are very richly described.As successful as Ender is, you discover that he's ultimately a pawn in the larger game being played and controlled by the I.F.. It's weird because you find yourself sympathizing with him and cheering him on despite him being a pawn.The political and philosophical focus of the end section of the novel may not appeal to everyone."}, {"userName": "Ted", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "As he got into the car that waited silently in the corridor, he heard Valentine’s anguished cry. “Come back to me! I love you forever!”Most readers of this review who have any interest in SF have certainly known of this book for years. It was published in 1977. I was in my early 30s then, we had our first child, and I had withdrawn from SF several years before that, really since I had left high school. So I have no recollection of the book from those days, and didn’t really become aware of it till maybe five years ago. I’ve had a copy for a few years. Finally started reading it yesterday. Finished it today.Here’s the backstory, as I absorbed it through my read. (I may not have some of the details right, it doesn’t matter.) Some takes place on earth, but most takes place in special training facilities that have been set up elsewhere in the solar system. Call it sometime in the twenty-first century? Anyway, at a time that humans had conquered space and where exploring the solar system.Decades prior to the novel’s present an alien life form had been discovered in our system, simply referred to as the “bugs”. There was a lot of fighting between humans and bugs, many lives lost, the bugs repulsed. They returned a couple decades later, and even more fierce fighting occurred, even more lives lost. Again the humans won.But now the nations of earth have banded together (sort of) in expectation that a third war will occur, when the bugs return they will return in vast numbers. So the story relates how the humans are preparing to meet this invasion: by identifying, through very early childhood, young children who are believed to have a particular ability (postulated from results of the first wars) to command in, and win, the ultimate war.Children identified are taken to space, to training facilities, starting at ages around five. They leave their families, for years, for this training.Ender is one of these children. He has an older brother who was tested and found lacking, and a sister between the two brothers, Valentine, also tried and found lacking. The quote above is taken from very early in the book, when it’s decided that Ender has passed the pre-training phase. His parents and he himself have agreed to allow him to be trained off-planet. But it’s a hard parting with his sister, they have supported each other throughout childhood against the rather brutal older sibling.Well, that’s enough of the spoiler stuff. The novel mostly takes place over the next five-plus years of Ender’s childhood.Card has written an extremely well-crafted story here. I found it hard to stop reading, always wondering what was going to happen next. Details of the current social realities on earth are revealed slowly, and influence both the telling and the flow of the story in interesting ways. A real page-turner.It’s also, in some parts, very moving.The edition I have contains an Introduction that the author wrote in 1991. This was very much worth reading. I read it after I finished reading the story, and that worked well for me.I have 119 friends who have this book in their libraries on GR. About forty of them have yet to read it. So to those, who I assume did have at least some interest in it, I say do read the novel!For other friends: if somehow you’ve never heard of it, check it out, read some other reviews. I didn’t look at it as a YA novel (when it was written I don’t think the phrase was in use.) But it is true that it has become apparently a very popular read for young people, a fact that Card addresses in the Introduction.I didn’t know until I actually read the book that there are three novels that follow it in a series. Whether I read those who knows? But this one was certainly good enough to make me consider it.A movie came out in 2013. Mixed reviews. Apparently most people thought the book, which won awards in the sci-fi field, was better.- - - - - - - - - - - - - - - - - - - - - --Previous review: Ready Player One PreviewRandom review: IN FOCUS Julia Margaret Cameron the photos of a pioneering photographerNext review: It Can't Happen HerePrevious library review: The Da Vinci CodeNext library review: Sailing Alone Around the Room"}, {"userName": "rameau", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/4884555-rameau", "userReview": "[He chooses mass murder. To add insult to injury, he writes a book about it and gives voice to the voiceless, to the dead. (hide spoiler)]"}, {"userName": "Wealhtheow", "userReviewDate": "Jul 30, 2007", "userURL": "http://www.goodreads.com/user/show/76129-wealhtheow", "userReview": "I read this book in 7th grade. I remember it so exactly because still, to this day, I distinctly remember sprinting up the stairs to get to the bookshelf to read the next chapter. It is an absolutely engrossing tale of a small boy involved in a big war, filled with heartache and camaraderie and betrayal and cleverness.The problem is that Orson Scott Card hates queer people and liberals so much that he's written a number of novels entirely about how awful they are. He posts screeds about how gay people should be put into camps. He is a hateful bigot, and I can no longer read his books without remembering that. And almost as bad, now that I'm older, it's all too easy to see how manipulative the story of Ender's Game is. Time and time again Ender commits a horrible act, but is forgiven (both textually and authorially) because he was innocent of mind, and because he was driven to it by the constant, unremitting abuse and neglect he suffers from those in authority. Looking through the book as an adult, I realized that Ender's doctrine (which Card and the characters he speaks through, like Valentine or Graff, repeatedly tell us is morally righteous) is to destroy his enemies, and then be pitied because his victims \"forced\" him kill them. It's pretty creepy. John Kessel talks about the problem of Ender-as-innocent-scapegoat much better than I over here: http://www4.ncsu.edu/~tenshi/Killer_0... (it's an excellent essay, and I highly recommend taking the time to read it).Ender's Game is a book that's really satisfying while you still feel that the whole world is against you. But once you grow up, it's too easy to see Card behind the scenes, pulling the strings."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Mar 15, 2016", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Ender's Game (The Ender Quintet #1), Orson Scott Cardعنوان: بازی اندر (اندرز گیم) - کتاب 1 از پرونده پنجگانه؛ نویسنده: اورسن اسکات کارد؛ مترجم: پیمان اسماعیلیان خامنه؛ تهران، نشر قطره، 1390، در 453 ص؛ شابک: 9786001192845؛ موضوع: داستانهای نویسندگان امریکایی - قرن 20 مپس از دوبار حمله بیگانگان به کره ی زمین؛ که نژاد بشر را تا آستانه ی انقراض پیش می‌برد، حکومت جهانی برای تضمین پیروزی نوع بشر در جنگ بعدی و حفظ یکپارچگی سیاره؛ دست به گزینش و پرورش نوابغ نظامی می‌زند؛ و سپس آنها را در نبردهایی شبیه‌ سازی شده، آموزش می‌دهد؛ تا هنر جنگ را در ذهن نوپا و تشنه ی دانایی خویش نهادینه کنند. نخست آموزش‌ها جنبه «بازی» دارد...؛‏ «اندرو ویگین» حتی میان نوابغ دستچین‌ شده نیز گل سرسبد، و برتر از برترین‌هاست، او برنده ی همه ی بازیها و برخلاف خواهر مهرورز خویش «ولنتاین»، و برادر دگرآزارش «پیتر»، دارای تمام شرایط لازم و کافی برای انجام ماموریت مورد نظر است.‏ درعین حال او چنان باهوش است که می‌داند وقت رو به پایان است. ولی آیا بقدر کافی باهوش است تا زمین را نجات دهد؟ ...؛ا. شربیانی"}, {"userName": "R.K. Gold", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/40737518-r-k-gold", "userReview": "Outside of the Harry Potter series, this is the book that taught me reading is fun. It was first assigned to me over winter break in high school and I re-read twice since then (this is also one of the first books I ever re-read). It's a well known story (and was adapted into a movie) so I dont think I need to touch on plot. I just remember getting that feeling that the imagination is limitless and you can make anything happen in the world of fiction when I first read this book. I wanted to spend all my time in the war games/zero gravity laser tag when I was reading this and I remember actually surprising myself with just how emotionally invested I was getting into Ender's journey. It's just one of those books that brings me back to my childhood and always puts a smile on my face."}, {"userName": "Katya", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/4324634-katya", "userReview": "[ in fact, given how much time Card spends jerking off his protagonist’s metaphorical cock, it’s no surprise Ender stays a virgin until his mid-thirties.  (hide spoiler)]"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Do the ends justify the means?What if the only way to save your planet from certain annihilation is to ruthlessly manipulate a young child into becoming a solder who is skilled enough to destroy billions of your enemy, to make him into a killer?With Ender's Game, the reader gets to ponder this question. I had many thoughts as I read this story. I didn't always understand what was going on. Like Ender, I questioned where the game ended and reality began. Children in the environment of this book don't get to be kids for long at all, especially when they are genius children. Instead, they become soldiers, training day in and day out to be the best, to win, to conquer their enemies. All for the purpose of defeating the alien race that Earth views as a deadly enemy (called Buggers) in the coming war. I questioned how a six-year-old kid could even grasp this. Even a genius child. As I read, I questioned the ruthlessness of adults who would put a child through these experiences. It takes a certain personality, a particular mindset to able to justify one's actions. It's hard not to judge, but then, I'm not in the same situation. And I was grateful for that.I just wanted Ender to have some peace and be able to just be a child. I cheered for him to find his way past the many mazes he was manipulated through. I didn't ever lose faith in him, because he had proven himself worthy of my faith. Even though I wondered what was the whole point of everything, I didn't stop believing in Ender. I was glad that Ender managed to find that light that kept him moving forward. Sometimes it was in the form of his beloved sister, Valentine, and other times, it was his fellow students, and sometimes it was the determination not to let them see him sweat. Whatever it was, this kid didn't break. I liked that about the book.Some things didn't sit well with me as I read. I couldn't always visualize the game setup at Battle School as clearly as I would have liked. Instead of letting this throw me out of the read, I just managed to fill in the blanks around my lack of understanding and keep reading. Maybe Card meant it that way, but it was interesting how warfare became an experience that felt more like playing a video game than a face to face meeting of enemies. I wondered where that was going, but I soon found out, and I was like, \"Are you serious?\" I don't care much for mind games and boy was there some serious mind-screwing going on in this book. Perhaps his point was that as technology advances, warfare becomes more and more dehumanized, and it takes away the immediacy of the moral questions of taking a life, and using soldiers like pawns on a board to do so. As above expressed, the ruthless treatment of children and its effects hit me hard. They did not make for easy reading for me. On one level, I understand that a lot of psychology goes into training soldiers, and I know that some of it is necessary. I just wonder where the line gets drawn. The aspects of Peter and Valentine's political experiment left me a bit cold. I wasn't sure what Card was trying to get across here. Is the political arena just a big elaborate game in and of itself, a game that has the potential to have very disastrous and wide-reaching effects? Or was he trying to say that age is just a number? Kids aren't really kids, depending on the society and the situation that the child inhabits. Still not sure about either of those conclusions I drew. As close as I can get, anyway. Lastly, the ending got a bit strange. While I appreciated the aspects about Ender gaining an appreciation for the mind (the human-like aspects) of the Bugger civilizations, things got a bit weird and abstract when Ender's empathy with the Buggers became a philosophy that turned into a religion. It felt disconnected from the story to me, and added to a certain lack of satisfaction I felt overall. I appreciate the fact that he examined how war, differing philosophies, external differences, what have you, can separate entities in a way that if we strip down all the differences, there is a lot more alike than we think.Final Thoughts:Ender's Game is a well-written work of science fiction that has a lot to say about subjects that can make for hairy discussion. Subjects that I tend to avoid discussing with a ten-foot pole. War is as old as mankind. Literature is a good sounding board to explore those questions of war and humanity. Overall, I think that this novel does a good job of staying in the story and not just acting as a soundboard for the author's opinion. I am sure that others may disagree. For myself, I didn't necessarily feel that it was a preachy work. If it was, I think both sides of the questions were adequately presented in such a manner as for me to feel that this was a book with a story that had some themes that could get a reader thinking. Not mere propaganda for espousing one person's beliefs.I liked this book a lot, but I felt the ending took it down from a five star rating for me. Also, my sense of disconnection at not quite getting some of the gaming aspects. I'm sure that others better versed in gaming or military strategy, or better read in science fiction might have visualized and understood those elements better than this reader. For what it was, this was a good book, and I can say that I gained a lot from reading it. I still have some philosophical questions running through my head now, and I feel that I have yet to make up my mind about those things, as there are always two sides to every story. So for me, that's a good experience, getting a good story and something to think about in the end."}], "description": "Andrew \"Ender\" Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip away and find the diamond inside, or destroy him utterly. Ender Wiggin is six years old when it begins. He will grow up fast.But Ender is not the only result of the experiment. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway almost as long. Ender's two older siblings, Peter and Valentine, are every bit as unusual as he is, but in very different ways. While Peter was too uncontrollably violent, Valentine very nearly lacks the capability for violence altogether. Neither was found suitable for the military's purpose. But they are driven by their jealousy of Ender, and by their inbred drive for power. Peter seeks to control the political process, to become a ruler. Valentine's abilities turn more toward the subtle control of the beliefs of commoner and elite alike, through powerfully convincing essays. Hiding their youth and identities behind the anonymity of the computer networks, these two begin working together to shape the destiny of Earth-an Earth that has no future at all if their brother Ender fails.Source: hatrack.com", "title": "Ender's Game\n      \n          (Ender's Saga #1)", "url": "https://www.goodreads.com/book/show/375802.Ender_s_Game__Ender_s_Saga___1_", "average": 4.3, "cover": "https://images.gr-assets.com/books/1408303130l/375802.jpg", "reviews": 39751, "authors": [{"url": "https://www.goodreads.com/author/show/589.Orson_Scott_Card", "name": "Orson Scott Card"}], "type": ["Science Fiction", "Fiction", "Young Adult", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/375802.Ender_s_Game", "http://www.goodreads.com/book/show/1055145.Ender_s_Game", "http://www.goodreads.com/book/show/8045789-ender-s-game", "http://www.goodreads.com/book/show/2124799.Ender_s_Game", "http://www.goodreads.com/book/show/9737.Ender_s_Game", "http://www.goodreads.com/book/show/17726574", "http://www.goodreads.com/book/show/901.Ender_s_Game", "http://www.goodreads.com/book/show/7967.Speaker_for_the_Dead", "http://www.goodreads.com/book/show/9532.Ender_s_Shadow", "http://www.goodreads.com/book/show/8648.Xenocide", "http://www.goodreads.com/book/show/31360.Children_of_the_Mind", "http://www.goodreads.com/book/show/9534.Shadow_of_the_Hegemon"]}