{"ratings": 4381, "userreviews": [{"userName": "Lisa", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "As much as I love Julian Barnes, I am divided about England, England. On the one hand, it illustrates in a satirical and sad way why England has such trouble finding its place in the world right now. Julian Barnes undoubtedly has the intelligence and skill to write a poignant satire on the state of Englishness. But maybe my timing is not the best. I found myself constantly thinking that it is not funny anymore, that it is too much to bear. Maybe Julian Barnes, in 1998, understood and captured the feeling of the future \"England 2016\" and conserved it for me to suffer through at this moment in time.I read it in a couple of hours, devouring it, waiting for hope to appear and give me a glimpse of a better future. But there is nothing but a replica of what we have already seen a million times to be expected, more of the same, but condensed to a fun park experience and lived through in fast forward. You choose what sad ingredients of English life you want to consume, and Julian Barnes with all his genius is one of the many options you have. He can not help making the list of the quintessentially English, and neither can he help joking about it. After all, he is English, as one of his characters conveniently states in defence of all his opinions.It is a very readable book, and very true in all its sarcastic absurdities. It just made a sad and hopeless impression, and I find it hard to apply the dry sense of humour of its content to the review. Too serious a feeling of irrevocable loss!"}, {"userName": "Teresa", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "This is the first work by Barnes I've given less than 4 stars, though I thought the first section detailing Martha's childhood and formation of character was great. Then the book went downhill for me, as another character, Sir Jack, took center stage in the second, and longest, section. I have no problem at all with unlikable characters (I don't need to like a character to enjoy a work), but so many times when readers say they dislike books because there are no \"likable\" characters, I wonder if what they might really mean is that the characters are boring, which is how I found Sir Jack. I understand he is part of the satirical, farcical nature of this section, but that didn't stop him from boring me, as did some of the rather long passages that lay out the progression of the Isle of Wight's becoming \"England, England.\" Unfortunately , the third section was also marred by some of that same kind of description, as what happened on the 'mainland' while the Island project was growing takes over. I did like the ending better than the middle because of its metaphors, which stopped me from giving this two stars."}, {"userName": "Christina Beeler", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/3753710-christina-beeler", "userReview": "Okay, let me start by saying that Julian Barnes is obviously very intelligent. He is witty and intelligent and well-read. BUT this book is obnoxious. It's not the worst book I've ever read by any means....it is smart and funny in parts and he has a point but the language is pretentious and showy. You have to have an English degree to get through this book (which I am in the process of obtaining). Overall, it is inaccessible. So if his point is that we prefer simulacra over the original and society has become complacent, lazy, etc., with this novel, he is only preaching to people who agree with him because only people who would probably agree with him would take the time to try to understand this novel. Additionally, it was boring. I fell asleep at least 5 times while trying to get through this book. That has never happened to me before with any other book ever. Congratulations, Julian Barnes, you're brilliant but the ironies and the parodies would only reach the highly educated and the book doesn't make me feel anything at all."}, {"userName": "Aerin", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/61519-aerin", "userReview": "The hardest books for me to review are the ones that I objectively think are quite good, but that, for whatever reason, I didn't actually like very much. This is one of those.On the one hand, I want to tell people: don't bother with this one, it left me feeling very meh. On the other, I think back on it and it was all very well put-together, filled with fleshed-out characters and unique ideas, and with some parts that bordered on magnificent. Maybe if I'd been in a different mood, maybe if I'd paid it more attention, maybe if I were a little smarter, I would have absolutely loved it. Who knows? In any case, I can't think of anything empirical to complain about.The big maybe if in this case, is Maybe if I were English, or knew a bit more about England, I would have liked this book better. I've never been to the UK, never been much of an Anglophile. What I know about England has been gleaned from tabloids, fiction, a childhood spent watching Red Dwarf and Mr. Bean, and whatever I picked up in high school history class about King So-and-So and what a jerk he was. So the nuanced satire in this book, which is largely about foreign imbeciles such as myself and our ignorance and apathy about authentic British culture, whooshed right over my head. The one thing I can say for myself is that at least I knew there was a whoosh, that I had missed something. But I still didn't love the book.The story follows Martha, a woman who is too smart and too cynical for her own good, at three points during her life. Part I is about her childhood, and the aftermath of her parents' divorce. This section, which stands alone very well as a short story, was the highlight of my experience with the book. It's sharp and painful, and it gives the reader a rounded understanding of the character's foundation. Everything that Martha does later on as an adult and as an old woman, makes sense because we've seen her undergo this childhood trauma.In Part II, the longest and meatiest part of the story, we see Martha in her late 30's, as she begins working for Sir Jack Pitman, a ludicrously pompous business mogul, who has a dream. He knows that tourists come to England to see historical and cultural landmarks, but it's all so inconvenient. Everything's so far apart; you can't see it all in one day. Transportation and money can be confusing; historical sites are often dingy or falling apart; the English people can be so unwelcoming. Tourists want to be dazzled, but reality is just so underwhelming.Pitman's solution is nothing less than to create a whole new England. He buys the Isle of Wight, a small island in the English Channel, and transforms it into a perfect miniature of everything that England symbolizes - except better.At first, his employees and the public assume he's building some kind of patriotic theme park, but that's not it at all. Pitman's vision is nothing so artificial. Although the island is filled with half-size reproductions of everything from Stonehenge to Buckingham Palace, and its residents are all hired on as actors (to portray everyone from Robin Hood to \"friendly pub patrons\"), Pitman sees it as the real deal. Why would anyone want to go to \"Old England\" - so unfriendly, so unwieldy - when they could go someplace smaller and more accessible, that has everything England ever had and more - but distilled and with the bad bits filtered out?Sure enough, the tourists flock to the island (which Pitman dubs England, England). And it's not just tourists - celebrities relocate there; landmarks are dismantled and rebuilt there, even the royal family is enticed (bribed, blackmailed, whatever) to make the island's half-sized Buckingham Palace their new home. Pitman is shrewd enough to name himself the island's Governor and then to declare independence from Old England, citing a centuries-old technicality as justification. Within a few years, Old England is rendered totally irrelevant culturally and economically. It's a slum. When people say \"England\", they now mean England, England.Martha, originally hired on as a \"professional cynic\" (whose job functions mainly included shitting all over everyone else's ideas), quickly rises within the company, and ends up overseeing the entire England, England project. But then, things start to go tremendously, hilariously awry, and Martha is left with the blame.So Barnes's main theme is the question of authenticity. If England, England is a fake - and Pitman pontificates eloquently throughout the book on why it isn't, really - why does that matter? In all apparent ways, it's better than the original. Why mourn the fate of Old England, other than for nostalgia's sake? And if you are feeling nostalgic for Old England, why not go to England, England? It's exactly the same, except better!In Part III, Martha, now an old woman, finally returns to Old England, which, having spent the last half-century in poverty, isolation and global irrelevancy, has been transformed into a shell of its old self, something totally unfamiliar - but at the same time, something completely, innately English. It has undergone a different distillation, but like England, England, has become a condensed manifestation of an ineffable Englishness. Or maybe not; maybe that's the difference between the two. Old England has reached an ineffable Englishness, while England, England is all too effable.To Martha, anyway, it's somehow just as fake as the island ever was. Which is Barnes's entire point, and which is depressing as all fuck, if only because it rang so true to me.This is one of the most unique dystopian novels I have ever read. I wish Barnes had spent more time delving into this faux-divide between \"real\" and \"fake\", rather than spending pages and pages on the corrupt exploits of the (fictional) royals or Pitman's, um, very nontraditional sexual proclivities. And I wish I had a better grasp of the general English Weltanschauung - I kept trying to translate it into American, imagining an island full of miniature Statues of Liberty and Mt. Rushmores and flag-waving Uncle Sams, but it's just not analogous for so many reasons - the ineffable \"America\" is not anything like the ineffable \"England\".Having typed up this review, I realize I do think more highly of this book than I'd thought. I didn't love the experience of actually reading it, but looking back - it really was a good book. Which is almost too perfect. The distilled, essentially fake \"England, England\" in my memory, which is the one I'm really discussing in this review, is better than the real \"England, England\" that I actually bought and spent many frustrating hours reading. How very meta.(Original review date: 18 October 2010)"}, {"userName": "Alex", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/39328440-alex", "userReview": "This was not my book. as much as i liked „the noise of time“, so much i disliked this one. This is a „talmes balmes“ of intelectually constructed phrases aimed at nothing really. Or the message of this book was so cryptic, that i didnt get it. I found it dull, boring. So as there are a lot of better books waiting to be read, i have just turned the pages till the last one reading between the lines. It started really good, the first part was full of lyric. And starting with the second part it got worse.It is about copying the original, producing a copy which is aimed to be better than the original. Ok, and ? Is it about patriotism, is it about Martha, is it about sex, is it about relationships, is it about distorted reality? I dont know really. I dont know what I read. At least for the first 3/4 of the book. If you have another alternative to this book, take the alternative. maybe it will worth your time."}, {"userName": "Praiz Sophyronja ", "userReviewDate": "Nov 24, 2015", "userURL": "http://www.goodreads.com/user/show/21693097-praiz-sophyronja", "userReview": "Considering the fact that I'm being forced to read this for my  super dull post-colonialism unit for college, I have reluctantly grown to enjoy it. But of course, I will never admit it to my professor."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "\"Damage is a normal part of childhood.\"I think I missed the entire point of this book."}, {"userName": "Tony", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/33771-tony", "userReview": "This book is in three parts.In Part I, England, a young girl absorbs the leaving of her father. She had a puzzle of the map of England. Her father would hide one piece: Cornwall, Devon, Somerset, Carmarthen, Pembrokeshire. And when her puzzle was done except for that one piece, HE would magically find it. Nottinghamshire was missing when HE went missing too. All of Julian Barnes' brilliance is here. And this brief opening will break your heart.In Part II, England, England, Martha Cochrane, that precocious girl, is now a wizened young woman. She's wonderful. She passes an interview to work for an entrepreneur and becomes a resident cynic for that wealthy man set on a new idea, creating a doppelganger country of Old England, a hi-tech amusement park that recreates all of England's history. Crazily, it works. An island with no government, just a place governed by contract and the whim of a business model. The plot is, really, pretty stupid. Yet, a few characters are richly drawn, especially Martha. And there are some wonderful moments.Martha falls for a fella, and three pages of spectacular in-bed, post-coital dialogue begin with this line of hers: Someone once had his hand where yours is.I learned that if you put a banana in a bowl with green tomatoes, those tomatoes will ripen much faster than a bowl of green tomatoes without a banana. In case you wondered about the significance, Barnes writes: Yes, Martha, but Paul isn't a banana and you aren't a pound of tomatoes.In Part III, Anglica, Barnes attempts a summing up. But really, I just wanted it to end already.I loved the great female lead and several other characters. I wish there was more interplay between them and more explanations for their actions.Stupid idea; great writing. This was the bowl of tomatoes without the banana."}, {"userName": "Andreea", "userReviewDate": "Apr 02, 2011", "userURL": "http://www.goodreads.com/user/show/1245700-andreea", "userReview": "Now that I've read Flaubert's Parrot and A History of the World in 10 1 2 Chapters - both incredibly clever and wonderful books, I like this novel even less than I did when I read it as my first Julian Barnes a few years ago. Everything I remember about it is cringe-worthy, though I must admit I don't really remember that much - a lot of gratuitous badly written sex and something about Englishness, American tourists and culture as entertainment. It's just bizarre and somehow spiteful coming from England's most Francophone contemporary writer. There are better Julian Barnes books one could read instead of this one."}, {"userName": "Girish", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/5924440-girish", "userReview": "England, England plays in the author's known obsession zone of history and it's interpretation. This time, It's England that is dissected through a biting satire. Barnes is witty, intelligent and at his cynical best till he runs out of steam around 70%. It starts with a little girl, Martha, who is fascinated by the English Counties jigsaw puzzle and the farm festival. Till her dad vanishes from her life with a piece of the jigsaw puzzle.In part II, Martha Cochran is the appointed in-house cynic for Sir Jack's mega project - to create a replica of the tourist version of England (across times) on the Isle of Wright. Martha is unapologetic, sharp and the seemingly stupid concept becomes a success! Create a replica of 'Ideal' England with it's glorious history preserved, without Government and Courts - governed by contracts only to get in the big money. So England, England becomes an amusement park with it's own version of landmarks such as Big Ben and it's own version of lore such as Robin Hood and his merry men. It is so successful that tourists stop visiting the 'Old England' and meanwhile Martha stages a coup to take over as CEO.The book is more than the story it is trying to narrate. In each corner of the book , you would come across brilliant quotes that are more a reflection of the present than relevant to the story.  \"And perhaps it was also the case that, for all a lifetime's internal struggling, you were finally no more than what others saw you as. That was your nature, whether you liked it or not.\" Unfortunately the book runs out of juice around 75%. The third part, which is a huge summing up of the impact, you just wanted it to end. You lost interest, maybe, like we do in real life - not bothered about what happened to people after their prime. Will not be the most recommended Barnes - but glad I read it."}, {"userName": "Daniel Solera", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/1429082-daniel-solera", "userReview": "I ran out of books to read at home, so I went to my college stack in hopes of finding something interesting. This book was given to me by a professor during office hours - I don't remember who it was, or why she decided that I would enjoy it, but I ended up not reading it and apparently not returning it. My bad.The premise of this novel is strange. It centers around a powerful businessman's idea to create an \"ideal\" England on an island as a tourist attraction, showcasing all the hallmarks of \"typical\" England but without the blemishes of modern culture. Caught in the mix is Martha Cochrane, a middle-aged woman who feels left behind in life.The book itself is very high-culture and self-referential, often stopping to make long, philosophical treatises on art, imitation, and authenticity. However, I felt like these expositions were in charge, relegating any notions of plot to the background. The majority of the novel is a series of conversations about the island and characters' opinions and interpretations of it. Aside from one extremely out-of-place and vulgar scene, the book reads like a very highfalutin joke that I did not have the patience (or sophistication) to comprehend or enjoy. While I did enjoy Sir Jack's larger-than-life trollish behavior, it wasn't enough to keep me interested in reading. The novel is barely 280 pages long and it took me about two weeks to get through it. What was it that I said during those office hours that inspired such a recommendation?"}, {"userName": "Cat", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/9728092-cat", "userReview": "This is more a 2.5-star rating than a 3-star one, and that is due to Mr. Barnes' writting. Because the story failed to compel me into reading it and made me feel really disappointed (a first-time thing with Mr. Barnes).It took me more than two weeks to read this rather small book (what are 266 pages, right?), which is always a bad sign. Sure, I started working in the mean time, but that is not a good excuse in this case. The fact is that I dind't feel like reading even when I could.I found England, England mostly boring and its characters completely unlikeable. The premise of reality vs. replica sounded interesting enough, but its development didn't live up to expectations."}, {"userName": "Jordan Catapano", "userReviewDate": "Dec 28, 2008", "userURL": "http://www.goodreads.com/user/show/1836620-jordan-catapano", "userReview": "Julian Barnes presents a witty yet tantalizingly frightening vision of te commodifying of culture and the jump into the chasm of hyperreality. Ripe is Baudrillardian examples of \"the substitution becoming the reality,\" England, England provides an enjoyable excursion into the future. The story employs an artfully balanced cast of characters, provocative discourse on history, memory, culture, and the implications of each for our future. I enjoyed Barnes's witty dialogue as well as his depiction of big-business, manipulative entrepreneurs as also deeply motivated and personable beings. The book is both entertaining and philosophical, which I consider the two essential to good reading."}, {"userName": "Lyn Elliott", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/10312986-lyn-elliott", "userReview": "Very funny satire on history and culture as theme park material. Being Barnes, it's more savage than gentle satire and the plot becomes more outrageous as the cast of characters play out their roles on the Isle of Wight, rebadged as England, England."}, {"userName": "Ron Charles", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "In the disturbing tradition of Orwell's \"1984\" and Huxley's \"Brave New World,\" fellow English writer Julian Barnes has produced the first classic dystopia of the 21st century.\"England, England\" is an unsettling satire of corporate ambition gone wild in a culture that values convenience above all else.Sir Jack Pitman thinks big. He rules his financial empire from a worldly cathedral of the most extravagant design. Subjects coming for an audience pass first through the Quote Room, where they can reflect upon a lavish description of Sir Jack chiseled into a monolith of slate.Having conquered every field, he laments to his sycophantic minions, \"What is there left for me?\" A secretary's body microphone immediately clicks on to archive Sir Jack's answer: \"Perhaps what I need is one last great idea,\" he muses, \"one for the road.\"Sir Jack's final idea, the concept worthy of crowning his brilliant career, is to solve the problem of Britain's long, steady decline.England enjoys the most enviable past, but the bleakest future. Its empire distributed, its wealth depleted, its military reduced, the country desperately needs turning around, and Sir Jack is up to the challenge. \"It's a question of placing the product correctly, that's all,\" he notes.In passages as brilliant as they are witty, Barnes satirizes the modern world's obsession with imitation. A French intellectual brought in to analyze Sir Jack's plan explains, \"Nowadays we prefer the replica to the original\" because originals present \"a reality which appears more powerful and therefore threatens us.\"\"Once there was only the world, directly lived. Now there is the representation,\" he goes on in mock post-structural lingo. \"It is not a substitute for the plain and primitive word, but an enhancement and enrichment.... This is where we live today. A monochrome world has become Technicolor, a single croaking speaker has become wraparound sound. Is this our loss? No, it is our conquest, our victory.... It is our intellectual duty to submit to that modernity, and to dismiss as sentimental and inherently fraudulent all yearnings for what is dubiously termed the 'original.' We must demand the replica.\"To realize his grand scheme, Sir Jack purchases the entire Isle of Wight and constructs a perfect imitation of what tourists want to see in England.Soon, wealthy buyers of \"Quality Leisure\" can experience Big Ben, Buckingham Palace, the white cliffs of Dover, Robin Hood and his Band of (culturally diverse) Merry People, the West End, the class system, Harrods (in the Tower of London), Stonehenge, thatched cottages with sheep in the meadow, snobbery, Devonshire cream, and a robin in the snow - all in a convenient weekend package.It's expensive, of course, but as a publicist points out, \"If you attempted to cover the 'originals' it would take you three or four times as long. We're merely following the logic of the market.\"Sir Jack quickly moves to declare the island's political independence and appeals to The Hague for defense against the crumbling motherland. He has no worries: Military invasion would be great publicity.This \"brave new venture\" serves as the nation's government, with Sir Jack as its \"governor for life.\" All laws are replaced with corporate rules, rights are transformed to contractual obligations, and civil functions are performed (or eliminated) by the corporation. This is Disney's \"Celebration\" town extended to its natural, though frightening conclusion.Beneath the outrageous satire, Barnes spins the sad tale of Martha Cochrane, an ambitious young woman determined to climb the corporate ladder of this faux nation.Her struggle to determine what matters and what love means in this hall of mirrors provides the novel with a degree of emotional depth beyond its clever social satire.Unfortunately, the novel is burdened by a vulgar sex scene that many readers will find beyond the pale. Though the event is crucial to the plot, a writer of Barnes's enormous talent could have aimed for more wit than shock.Cynical and dark as the book is, there's a stirring of optimism in the corporation's difficulties. la \"Jurassic Park,\" real life asserts its messy, inefficient force even under the most artificial and controlled conditions.It turns out that the human spirit isn't, in fact, so easily satisfied with replicas. Virtual reality is finally untenable because it involves only self-love. Sir Jack may never realize this - he's eventually replaced by an actor - but we've got more time.http://www.csmonitor.com/1999/0513/p1..."}, {"userName": "Louize", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/3019973-louize", "userReview": "Same thoughts from The Page WalkerLIFE IS A THEME PARKthoughts on England England by Julian BarnesI seemed to be jumping from one satirical novel to another this month. Maybe because there is something in English humour that freshen up my taste buds or washes away my reading hangover. Not that all English novels are satirical, but almost all the good ones are in my opinion.“Pounds being the real thing, and dollars the replica, but after a while the real thing becomes the replica?”The book is divided into 3 parts. Upfront, it was about the commercialization of culture, tradition and history gone wrong. A broadening of how falsehood gains Top Dollars, Long Yen; and how reality suffered in the long run, compensated, and then rekindled.”Cynicism is a very lonely virtue, you know.”The story behind the theme park is Martha Cochrane’s long struggle with life’s fogs and false realities. Marred by her father’s abandonment in her early youth, she became petulant. As an adult, she was hired as a resident cynic, and run an island of make-believe. Until, reality slithered through her facade.”The seriousness lay in celebrating the original image: getting back there, seeing it, feeling it.”The crazy part: knowing life is strange, and even though it’s a struggle, it can get better. Acceptance and recuperation only happens with willingness, so it seems. England England is a great leap from reality, an erudite satire that will prod the reader to question views on happiness and contentment."}, {"userName": "Frank", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/2442580-frank", "userReview": "It's been a very long time since I read a full novel in one sitting, and this almost qualifies. I'd started it on the bus ride home Tuesday afternoon, but spent my Independence Day in glorious languor: reading, sunning, swimming, reading, napping, reading...and late into the night.I very much enjoyed Julian Barnes' Booker-winning novel The Sense of an Ending last year so when I noticed this on the self I picked it up with no preconceptions as to plot or character, etc. What a delightful discovery. What a wonderful writer Mr Barnes is. I want to read more of him, all of him. Put him on the same shelf with Banville and William Trevor and Saramago.Interestingly enough, the subject (the underlying subject, not the actual plot) is similar to The Sense of an Ending: Memory, it's failures and distortions and accommodations. Both personal memory and collective memory. This book is hugely humorous, clever and sly, and at the same time very nearly tearfully poignant. The saddest scene came near the end when Martha—the main character—as an old woman finds a programme from an agricultural fair she has saved since her childhood. It brings back floods of memories of that day, being swung by the arms between her parents. Within the programme she also finds an oak leaf, but she doesn't recall why she decided to save this: but the reader does!"}, {"userName": "Val", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/5271574-val", "userReview": "In Julian Barnes' wonderful, funny, prescient novel the protagonist knows what tourists want to see when they come to England and he shows it to them, all arranged and neatly packaged, and completely artificial. This is Barnes, so you know that when you have finished laughing you will start thinking.The Booker jury didn't do enough thinking before they moved on to the next book.This book examines the idea of cultural identity and how truthful it is, much of what we see as true and historical is as invented and manipulated as this England theme park. Barnes is specifically considering English cultural identity rather than UK or British; the Scots and Welsh have a stronger sense of theirs and Barnes wisely stays clear of suggesting any of that might be invented."}, {"userName": "Nina", "userReviewDate": "Aug 31, 2007", "userURL": "http://www.goodreads.com/user/show/281984-nina", "userReview": "Satirical novel on reality vs artifice, history vs the commercial, and what it means to be English; with overtones of science fiction. Some really beautiful parts, some hysterically funny parts, and some overly schematic parts - not sure it all hung together, and does hit you over the head a bit with its themes.Words/ideas I have learned from this book:Hansardeau-de-nilBrancusiMurano chandelierMCC (Marylebone Cricket Club); Garrick ClubSir Francis Drake was a pirate (privateer)MitteleuropäischeembonpointMuss es seintussockhalf-timberingCaledonialèse majestéNell Gwynndroit de seigneur"}, {"userName": "Kate", "userReviewDate": "May 15, 2010", "userURL": "http://www.goodreads.com/user/show/1285613-kate", "userReview": "Going by the jacket copy, you'd think this was about nothing more than a megalomaniac's re-creation of England on the Isle of Wight. Hey, that could be plenty! But Julian Barnes delivers something much more complex and nuanced. The reinvention of the IoW as a leisure-time delivery system for quintessential England becomes the center of a thoughtful, viciously funny exploration of authenticity and reality. (Caveat: It's viciously funny if you're an Anglophile. I'm not sure any reader who doesn't get, much less get off on, Brit humor will want anything to do with England, England.)What takes this to another level is that Barnes locates his study of authenticity in the fascinating Martha Cochrane. Thank you, thank you Julian Barnes for 1) writing a smart, funny woman who's damaged, knows it, is okay with it, still refuses to settle, and (SPOILER! SPOILER!) never winds up bagging a Prince Charming, or any prince at all -- and 2) making it all look like a very palatable version of happily ever after. One reviewer whinged that there \"wasn't enough dialogue.\" Yeah -- if that's your thing, England, England is not for you. As for me, this one just found a spot on the \"most beloved books\" shelf."}, {"userName": "Rob", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/1854336-rob", "userReview": "Highly entertaining stuff from Barnes as he depicts a seedy businessman's attempt to recreate a mini-England on the Isle of Wight. The comic overtones are well maintained but there is also some depth of feeling - a twenty five page preface dealing with the early life of one of the characters is beautifully written and very moving.Dramatic events ensue including a rebellion led by Robin Hood, the defection of the Royal family to the island for cash and the shooting down of a tabloid's drone - it's marvellously inventive and once again shows what a talented and varied writer Barnes is. Only a concluding section disappoints and the book is quite a short one - the author was obviously conscious not to push his luck by extending the skit too far.Fleet Street's Ye Olde Cheshire Cheese pub is among the buildings reconstructed which is how it should be - I wonder if the Isle of Wight version only sells Sam Smiths ales too?"}, {"userName": "Kristen", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/10437664-kristen", "userReview": "I really liked this book once it got to its actual premise: the creation of a theme park that imitates England; but it was slow in getting there in my opinion. Still, the best part of the book was how the imitative English actors would assume the personalities of their historical characters: Dr. Johnson becomes a manic depressive, Robin Hood's gang turns into a real group of outlaws. All of that was very amusing, but there should have been more of it and less of the pre-Island narrative."}, {"userName": "Mayra Nakamura", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/47669954-mayra-nakamura", "userReview": "When I first began reading this book, I enjoyed Barnes' seamless prose and the absurdity of the treatment of such a serious subject for us in the 21st century, the third millennium. It does become difficult to confront yourself, as a contemporary reader, with what the novel is saying about post modern society, but Barnes manages to do so in a deliciously ridiculous, though heartbreaking, manner."}, {"userName": "East Bay J", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/384892-east-bay-j", "userReview": "Barnes’ England, England is well written and ambitious. Barnes has a talent for a turn of phrase. Unfortunately, to me, this book was just boring. I don’t know who I’d recommend it to because I can’t think of one person I know who wouldn’t find this boring. The descriptions and dialogue are the shining lights in this dark, dark cave."}, {"userName": "Laurie", "userReviewDate": "Dec 17, 2009", "userURL": "http://www.goodreads.com/user/show/991109-laurie", "userReview": "I'm stopping this on page 130 out of 275. It's still another 50 pages to get to the big plot as described on the back of the book. I don't need to be hit over the head with the funny, but I do liked to be mildly entertained while reading. So far, so boring. Love the cover though."}, {"userName": "David", "userReviewDate": "Apr 21, 2009", "userURL": "http://www.goodreads.com/user/show/2242482-david", "userReview": "Hated the ending. My least favourite Julian Barnes by a long way."}, {"userName": "Steve", "userReviewDate": "Mar 26, 2009", "userURL": "http://www.goodreads.com/user/show/2164858-steve", "userReview": "Terrible, truely terrible. I can't believe that the author who brought us \"10.5 Chapters\", \"Before She Met Me\" and \"Staring at the Sun\" could fall this far..."}, {"userName": "Fionnuala", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "This was my introduction to Barnes way back at the turn of the century. It was interesting but not as memorable as the other Barnes books I've since read."}, {"userName": "Laila A", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/15126996-laila-a", "userReview": "What the hell did I just read? I appreciate the post-modernism which echoes everywhere in the book and on so many \"levels\", but what the fuck did I just read?"}, {"userName": "Lukasz Pruski", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/2989615-lukasz-pruski", "userReview": "\"[...] there is, I always feel, a fundamental simplicity within me, because I'm a genius.\"Imagine this: in a book published exactly 20 years ago we read about a billionaire in a position of great power, a huge-scale con man, a \"corporate buccaneer\" who \"earned\" his billions by methods of \"theft, conquest, and pillage\" ruining other companies, and who is mainly known for his delight in firing people left and right. Doesn't this egomaniacal con man sound familiar? Also imagine this: in a book published in 1998 we read about England leaving the European Union. Doesn't that sound familiar? Julian Barnes' England, England (1998) has one of the most ingenious setups I have ever encountered in serious literature. Alas, the wonderful setup eventually dissolves into an aimless mess. How exasperating this novel is! What a waste of a tremendous idea!Sir Jack Pitman is the egomaniacal billionaire con man:  \"Sir Jacks's ego required so much oxygen that it seemed logical and just to him that it should be extracted from the lungs of those nearby.\"  His favorite phrases are  \"Consider yourself fired [...] You are fucking fired [...]\"  He considers himself a modern Beethoven and is working on a project that will be his Ninth Symphony. He is a self-proclaimed genius (although the reader will not know whether he is a \"stable genius\"); for instance, he employs an Ideas Catcher whose task it is to record for posterity any \"nickel-plated banality\" uttered by the Great Man (as Twitter did not exist in 1998.) He also indulges in some extracurricular activities with women: I am not courageous enough to describe the activities: please read the book. Let me just disclose that he is not interested as something as conventional as \"grabbing by the pussy.\" His tastes are more refined. Sir Jack is working on a monumental project: building a theme park that is a miniature of England. Naturally, the theme park, aimed at American and Japanese tourists with plenty of moolah (this was written before the golden age of China began), will be located in England, specifically on the Isle of Wight, so that its address is \"England, England.\" Sir Jack's team of researchers has discovered that contemporary tourists prefer replicas over the real thing: like we Americans have Venice and Paris in Las Vegas, Sir Jack will have a miniature replica of England in England. This is a phenomenally catchy idea for contemporary tourists because the replica will contain only the important aspects of England, none of the incidental ones. Exactly like people nowadays like to listen only to \"cool bits\" of classical music, just the melodious parts, the hummable themes - listening to the entire composition would be a waste of time. The experts are brought to construct a list of \"Fifty Quintessences of Englishness,\" such as the royal family, Robin Hood and his Merrie Men, Union Jack, Shakespeare, Stonehenge, etc. And indeed, when England, England begins its operation, its business thrives!The tale of England, England is intertwined with the life story of one Martha Cochrane. Abandoned early in childhood by her father she grows up to become a fiercely independent and successful businesswoman. In a memorable scene Sir Jack interviews Martha for one of the top managerial positions in the theme park enterprise. Being a genius unparalleled in the history of mankind, instead of hiring only \"yes-men\", he hires Martha as a \"no-woman.\"The novel is a powerful, bitter and biting satire on Disneylandization of our life: the cult of cliché, ersatz, cheapness, glitter, fakeness, and replicas. It ridicules the \"culture\" based on selling prefabricated emotions to people and history understood as a set of clichés. Those aspects of the novel are convincing. To me, though, the Martha Cochrane's thread does not mesh well with the satire. Also, I actively dislike the dystopian ending, a post-England, England part of Martha's story: it reads awkward and seems artificially attached to the earlier parts of the novel.Three stars."}], "description": "Jerry Batson, qui se définit comme un « accoucheur d'idées », va en vendre une assez sensationnelle à sir Jack Pitman, un excentrique milliardaire : créer sur l'île de Wight une sorte de gigantesque parc d'attractions rassemblant tout ce qu'il y a de plus typique, de plus connu en Angleterre. Cela va des blanches falaises de Douvres à Manchester United, de Buckingham Palace à Stonehenge, du mausolée de la princesse Diana au théâtre de Shakespeare.Le projet est monstrueux, hautement risqué, et voilà qu'il se révèle être un énorme succès. La copie va-t-elle surpasser l'original ? Et qu'adviendra-t-il si c'est elle que les touristes préfèrent visiter ?Férocement drôle, drôlement impitoyable, impitoyablement au vitriol, voilà un portrait de l'Angleterre comme on n'en avait encore jamais vu.", "title": "England, England", "url": "http://www.goodreads.com/book/show/100893.England_England", "average": 3.36, "cover": "https://images.gr-assets.com/books/1171471355l/100893.jpg", "reviews": 299, "authors": [{"url": "https://www.goodreads.com/author/show/1462.Julian_Barnes", "name": "Julian Barnes"}, {"url": "https://www.goodreads.com/author/show/58234.Jean_Pierre_Aoustin", "name": "Jean-Pierre Aoustin"}], "type": ["Fiction", "European Literature", "Literature", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/100893.England_England", "http://www.goodreads.com/book/show/830525.England_England", "http://www.goodreads.com/book/show/78437.England_England", "http://www.goodreads.com/book/show/13552806-anglia-anglia", "http://www.goodreads.com/book/show/6064115-england-england", "http://www.goodreads.com/book/show/1063565.England_England", "http://www.goodreads.com/book/show/1823269.England_England", "http://www.goodreads.com/book/show/10746542-the-sense-of-an-ending", "http://www.goodreads.com/book/show/25912206-the-noise-of-time", "http://www.goodreads.com/book/show/45369.Arthur_George", "http://www.goodreads.com/book/show/43980.A_History_of_the_World_in_10_Chapters", "http://www.goodreads.com/book/show/2176.Flaubert_s_Parrot", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}