{"ratings": 3374, "userreviews": [{"userName": "Andie", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/2386673-andie", "userReview": "Good thing that was a fast read. And free. What a waste of a good story line. I didn't connect with the characters at all. Sarah was ridiculous, naive, and sometimes just an idiot. I REALLY wanted to like this story. It could've been SO much better, but it felt rushed and smushed together. The only thing I loved was Victor. Frank was annoying and her work crew were just as irritating, except Beth. Ugh. I'm so disappointed and sad, I really wanted to like this."}, {"userName": "Parvathy", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/4915009-parvathy", "userReview": "Another of my entries to the list of \"Books that more people should know about\". Eternal Vows is not the most innovative and fresh concept books that you may come across as there is nothing new about the story. A woman in search of her long lost sister accidently stumbles upon a portal to another dimension. Getting married to a powerful, immortal and gorgeous King clearly on a case of mistaken identity. Escaping from the clutches of a forced marriage while trying to fight down her undeniable attraction to her husband, slipping on and ancient ring that connects her to him does not help . Ofcourse having a band of enemy immortals on her trail trying to hunt her down once and for all is not exactly a walk in the park. But being married to an immortal has its advantages. For one you also get to be an immortal and get entrusted with all this super powers and mind tricks that you cannot control but may come in handy when you are running for your life. Yes, ETERNAL VOWS has it all and manages to keep it interesting the whole time even though the formula is a little hand me down. But I am not complaining as the saying goes via trita via truta \"a frequented path is a reliable path\" and this frequented path does deserve attention. The writing is engaging and there are a lot of witty banter, funny dialogues and a number of references to the pop culture that you feel like laughing inspite of yourself. Eventhough they are inches away from death the heroine manages to sprout atlest one sentence that is sure to lighten the mood and that is one of the good things about this book. The heroine Sarah is funny and stubborn, there is no other way to define her and the hero, who doesn't like an immortal, gorgeous control freak. If anything, the popularity of the Twilight series has taught us \"Never to underestimate the power of a gorgeous immortal no matter how controlling he is\". So there you have it, Eternal Vows is a book to watch out for if you are looking for pure entertainment and a good laugh."}, {"userName": "Jayde Scott", "userReviewDate": "Mar 16, 2012", "userURL": "http://www.goodreads.com/user/show/4619356-jayde-scott", "userReview": "Ever since her sister disappeared without a trace, Sarah Larker knew something wasn't right so she became a paranormal researcher, hell-bent on finding out what really happened. On yet another investigative mission, Sarah and her researcher team arrive at the scene where her sister was last seen. But something's different this time. They hear strange noises; something's watching them. Not knowing what's going on, Sarah enters the cave and steps through a portal in time. Suddenly, she finds herself in a different world, followed by deadly giants who almost kill her...until she's saved by a mysterious immortal king. Victor claims to know who she is, and even though he despises her for no apparent reason, he wants to make her his. Now Sarah must do everything in her power to stay alive...even if it means marrying the enemy who could find out she's not who he thinks she is...I loved this book. The writing is fantastic. The story building isn't your typical paranormal romance, but includes time travel and mystery elements as Sarah has to find out what really happened to her sister while trying to save her own life. Sarah's such a lovable heroine who cares about others while Victor's strong and determined to crush his enemies and keep the woman he desires. The attraction between the two was sizzling hot. There were quite a few twists and turns I didn't see coming, and the ending left me eager to pick up the next book. All in all, a really good book I'd recommend to readers of paranormal fiction who enjoy a bit of romance, humor and mystery."}, {"userName": "Vanessa", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/64363186-vanessa", "userReview": "This book is not perfect and it has some flaws, but I really enjoyed it!The situation of a woman travelling through a portal into another time or dimension is already well known, but I definitely enjoyed that this time the main character isn't alone in that other dimension. She has her friends with her to help her and to accompany her on this journey. Also she quickly finds allies in that new world, though I must admit that I find it somewhat hard to believe that people from a medieval world would trust a complete stranger that fast and would risk their lifes to help her escape from the king. Another flaw I see in this book is Sarah's behaviour. I think she is naive and stubborn. She doesn't listen to people who have clearly more knowledge of that world. She accepts her powers and the creatures in that world without a second thought, but does not accept any help. She gets her friends and herself into trouble with that behaviour, but it doesn't seem to bother her.Nonetheless, I enjoyed the story very much. Since this book is only the first one in a series I am sure that there is a lot of potential to explore the world more and to develop the characters. So I hope that Sarah will grow and get rid of her stubbornness."}, {"userName": "Kirsten Lenius", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/9991951-kirsten-lenius", "userReview": "I almost stopped reading this a few times. Between poor word choices and major problems suspending my disbelief, I really didn't enjoy it much. The premise should have suited me down to a 'T,' but in the end, the meat of the story wasn't there. It rambled and made attempts at humor and the characters were all rather flat."}, {"userName": "Laura", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/44244213-laura", "userReview": "O.k so i loved the concept, it seemed a bit like the enchanted film but backwards......so there is victor all.....Forcing Sarah to marry him thinking she is someone else, her telling him she is not who he thinks. Even though he is one of the most powerful men in the kingdom he doesn't query this deeper just gets married tying his life to a complete stranger.Sarah who hangs out with a bunch of people who don't really know anything leading them into danger instead of going back to her husband who could protect her. Also shes got loads of new powers she cant control.But i did love the imagination and certain parts i was howling, Frank is like a gnat so annoying also think he may be Beth's baby daddy we will see."}, {"userName": "Future Slayer Girl ", "userReviewDate": "May 16, 2013", "userURL": "http://www.goodreads.com/user/show/5302761-future-slayer-girl", "userReview": "Ok, so I would like to say that this book crept up on my slowly and bit me in the butt about halfway through. I said I would like to say this. Unfortunately, I can't say that. It hit me like a sledge hammer the first page of this story. I am telling you not only is this a totally original idea that made me go, \"Ah man, why can't cool stuff like this happen to ME!\" But it had me marveling at how well written this paranormal fantasy romance story was. I was sucked in from beginning to end and I really struggled to put the book down. At one point I realized I had to sleep, it was 2AM, and the moment I woke up I finished it, then screamed when it ended and instantly went and bought book two. Victor-- Oh, hottie Victor I would let you ravage me like a medival king ANYDAY! Sarah was a strong, witty, and actual smart heroine! I am in awe of how awesome she was! The characters all came to life and popped out from the page and made me care deeply for all of them. If you haven't grabbed a copy of this yet, you must. It is free currently on Amazon and Barnes and Noble. But it needs to come attached with a morning label-- \"You can't read just one!\""}, {"userName": "Tiramisue", "userReviewDate": "Oct 13, 2014", "userURL": "http://www.goodreads.com/user/show/21148917-tiramisue", "userReview": "I hate rating books with only 1 star, but this really is one of the rare occasions, I can't do it any other way.On her search for proof that Bigfoot exists, Sarah Larker, her expedition team and Frank, Sarah's ex-boyfriend, accidentally stumble upon a portal. Seperated from each other, they have to find their way in a whole new dimension, that's not only appears to be stuck in the Middle Ages, it's also filled and reigned by supernatural forces. Sarah, mistaken for the princess of a rivaling kingdom, is forced to marry King Victor to save her own life. Her plan to wed and run with some outside help, turns out to be much more difficult than she could have ever expected. Not only is her new husband chasing after her, others are too...*** The summary of Eternal Vows seems very promising for a nice little read, some unlikely romance in a mysterious setting and a female protagonist turned accidental hero that has to figure her place in this new setting out. Unfortunately, as it turns out, that really was all just wishful thinking on my part. Sarah Larker, who, although we are told that she is oh so lovely, caring and likeable, turns out to be a naìve and flighty character with a hang for dramatics. As much as I tried (and I really did) I just couldn't find it in me to connect with her, and least of all like her. Actually, none of the characters introduced enticed any kind of redeeming quality. The only maybe-exception being King Viktor, the Immortal, but even so, his appearances were short and in between. Mostly, and this can be applied also for Sarah and Frank, Sarah's kinda-ex-but-kinda-not, who completes the love-triangle, are flat any annoying.It's not only the bland characters that bothered me, though. There are also these awful dialogues which, I'm sure, were meant to be as funny-silly-cute, as the characters themselves were supposed to come across as, but really, really didn't. For instance, Frank, who seemed unable to open his mouth and not say something cheesy and all-around improper considering the situations they happened to find themselves in. His attempts at flirting are plump and bothersome, but constant. Generally, most of the sutuations they found themselves in were filled with dialoges that didn't quite match the setting/situation. Then there is the part where the story is set in a land stuck in some Medieval times, but except for a few occasions, none of the locals seem to be that bothered by the appearance, behavior or language of the foreigners. Foreigners, who can't really be bothered investing too much effort into blending in and finding cover. Every now and then, someone will ask what a certain word means, but it happens so randomly, it feels like the author herself forgot about the setting. Everything just seems too raw and too much of a mess, more like a first draft than a finished story. There are several different ideas and aspects of the story, that would have actually worked out well, had more time and thought been put into the execution and writing! Really, the whole part about the Immortals, the portal and that connection formed through the ring, make for a good story, but as it was displayed in this book (and I can only judge from this book alone) all the good ideas drown in this wild mess of everything I mentioned above. Whether you write Fantasy or not, a certain amount of sense for characters, settings, actions, situations and dialogues, is needed. I'm not intending to sound mean to the author or anything here, I'm just very saddened and disappointed to see the good ideas displayed having gone to waste. 1,5 stars."}, {"userName": "Wendy", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/6691610-wendy", "userReview": "I really can't wait to continue this series. There is something about the story that plunges me into a world that's mystical, enigmatic and addictive. After being transported through a portal with no hope of return. Sarah larker finds herself married to a possessive king whilst getting herself tangled in a war between immortal kings. From the moment i read the blurb, i thought...  WOW.AWESOME.COOL The second you read this blurb is the second you realize that nothing can really go wrong with this book: I mean who doesn't want a powerful king to be their husband? Think of all the couture dresses, Prada, Gucci and angry sex (nothing can go wrong with angry sex). Well unfortunately this king is an over a century years old immortal being and the wedding ring he gives to Sarah, just happened to turn her into an immortal. So Sarah is on the run with Mr-royal-pain-in-the-a**, a council of immortal rulers and another enemy kingdom hot on her trail. Will Sarah survive with nothing but her smart mouth, her big fat wedding ring, her ex-boyfriend Frank and a tranquilizer?This a very short story and despite its interesting and semi-original plot, the story manages to dive into intricate subplot to enhance the story with ease. The transition and contrast between Sarah's modern lifestyle and the fantasy aspect of the story was hilarious and quite realistic. And yes the notorious: \"Is this a film?\" speech or \"Where are the cameras?\" monologue are provided. Despite having to be in dire situations, Sarah and Frank brings humour in abundance. All the pop cultural references and snarky remarks made me laugh with tears. They are funny and quirky, and loosened the tension between the readers and the book. There is a slight love triangle and a perfect a hue of fiery/hot/passionate scenes that involves our egotistical immortal king. Victor is someone we didn't get a lot of and I guess i wouldn't mind seeing more of him. Sarah has something in her that made her my new best friend. And Frank can just....he can just stay with me because every time he talks, he enlightens the most suffocating environment.[spoilers removed]Thumbs up to Christina Peebles. You my dear have created a story that is exciting and fresh."}, {"userName": "Marsha", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/1991207-marsha", "userReview": "(2.5 Stars)\"Eternal Vows\" is one of those books that starts off with a bang and then slowly evolves into a convoluted mess. I was so looking forward to reading it after reading the summary but soon learned that not enough time had been given to forging relationships between the appropriate characters.Sarah is on the hunt to prove Bigfoot exists. Unfortunately, a former boyfriend, Frank is a journalist/ reporter who sets out to debunk every case she and her team investigate. When Sarah and her team believe they finally have proof of Bigfoot's existence, Frank shows up once again. She thinks the creature is hiding out in the cave her sister, Liz went missing from years prior. Frank and Sarah enter the cave only to realize it is a portal to a different world.Once they are on the side, Sarah is mistaken for a missing princess. She meets Prince Victor who informs her of his plans to marry her. Sarah and Frank concoct a plan to obtain the wedding ring that is needed to return them to their realm. However, the only way for her to get it is to truly marry Victor. Little does Sarah know but the wedding ceremony and kiss she and Victor share will be enough to bind them together for life.While I did enjoy this book somewhat, I also had problems with Sarah and Victor's attraction towards one another. Quite honestly I didn't really care about either of them because the author did not really write any scenes with them together long enough to develop any chemistry. Much of the book is spent describing Sarah's various brushes with enemy after enemy and not enough time was invested in relationship building. The plot had so much potential but began to fall apart with each new creature introduced or special ability Sarah develops. At times I felt as if I was reading a YA book rather than and adult read. Read this one for yourself and decide. It is currently being offered for free on Amazon.com."}, {"userName": "Peter John", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/16544269-peter-john", "userReview": "Sarah Larker is a motivated and determined Bigfoot investigator. Motivated by a childhood experience in which her older sister disappeared and determined to prove the cynical press wrong about the famously elusive creature. With a group of researchers, she hunts for Bigfoot close to the very same place where her sister had vanished without a trace but thing don’t turn out quite as she expected.Eternal Vows is a witty, romantic and fantastical journey through time, other dimensions and cultural misunderstandings. Filled with romance, magic and humour; all set to the atmospheric backdrop of a medieval world, ruled with an iron rod by immortal beings with magical powers.Chrissy Peebles has a wonderful flowing writing style that infuses emotion with quick witted humour. With each turn of a page, she draws you into the story as Sarah tries to deal with the perilous and emotional situations that fate has thrown her into. I thoroughly enjoyed reading this book and look forward to reading the next book in The Ruby Ring Saga."}, {"userName": "William O'Brien", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/4230003-william-o-brien", "userReview": "Eternal Vows - Chrissy PeeblesAn amazing story line!!!A gripping magical story showing imaginative areas throughout- Bigfoot Guardians, an immortal king, knights and adventures. Sarah has an exciting trip ahead of her with King Victor in his enchanted world. Tripping through a portal inside a cave leads to an unbelievable train of story links, showing great creativity.An unusual but realistic writing style makes this a must for 'reality type viewers', certainly a challenge for the general reader type. Giggles of raw dialogue in the changing fantasy exchanges.A red-hot romance in another dimension reveals a magical gem-set ring with great powers. Fun and frolics for Sarah in this fast paced page-turner of a fantasy adventure. Without doubt, sensory overload- a wild and fun eclectic mix of fantasy elements, leading to a cliff-hanger ending!"}, {"userName": "✿Claire✿ (Tiny Owl)", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/11622320-claire-tiny-owl", "userReview": "I'm really sorry, I tried to like this book but I found it really difficult. The idea is great but I found myself getting irritated with all of the characters and the way they behaved. Especially the amount of whining that went on."}, {"userName": "Quirkyreader", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/5355311-quirkyreader", "userReview": "This was a fast, fun read. Maybe in the future if I get some more of my book piles and lists read I might continue the series."}, {"userName": "Kirby Hamann", "userReviewDate": "Apr 01, 2012", "userURL": "http://www.goodreads.com/user/show/4615820-kirby-hamann", "userReview": "Love this book it did end kind of a sudden but the main male character is my dream man dark hair blue eyes! SWOON!"}, {"userName": "Marie", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/25392972-marie", "userReview": "An exciting storyThis was a fast-paced, exciting tale. There were spots where dialogue dragged as the characters talked in circles, and right many spots where the same info was thrown at us repeatedly. However, the story itself shined through and made this a page-turner. I have to read the rest of the series!"}, {"userName": "Raquel", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/10847101-raquel", "userReview": "I got this book because it was a Kindle Freebie and the storyline description sounded like a fluffy but potentially interesting read.The beginning put me off and I was ready to abandon it at 7%, but I thought, I should give it till 15% by which point I was drawn in.I'll start with things that I liked about it. For being a solid 8, maybe 9, on the Fluffy scale, I found the characters incredibly engaging. There was some friction throughout that I think is a key factor in what made them interesting. And by friction, I mean, some of the things they did and said got on my nerves but in a way that made them slightly more real and kept them from being flat.The storyline was also really engaging. I've not previously run across a paranormal romance with quite this layout and hook. The politics and plot all interplayed very nicely and didn't stomp themselves into any major potholes. It was an engaging enough storyline that I immediately paid for book 2.And, Bigfoot!!! Awesome.Things I didn't like: No ending. I hate books that end with a cliff hanger and literally \"to be continued.\" As this was a kindle freebie, I felt less jipped than I would otherwise and between them, felt I was getting a decent value by buying book 2. I was pretty sure I wouldn't want to read book 3, so the price was right when averaged out.Frank really got on my nerves. It was clearly intentional and an effective foil, so that's more of a plus than a negative, but wow did I want to stuff a sock in that guy's mouth.It went too far into eye rolling territory for me. I expect and therefore forgive a certain amount of eye rolling in a fluffy book. This slightly exceeded my acceptable Fluffy to Eye Rolling ratio, acceptable being roughly 0.70. This was a 6 or 7 on the Eye Rolling index which was a scotche too high for my taste.But overall, fun read."}, {"userName": "Tracie Banister", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/5070200-tracie-banister", "userReview": "I was really intrigued by the premise of Eternal Vows as it seemed like a fun mash-up of several genres I like (Fantasy, Time Travel, Romance, Action/Adventure) and it did not disappoint! I enjoyed the book so much that I blew through it in less than 24 hours and was left wanting more. The author has an engaging style of writing, a lot of imagination, and knows how to inject the right amount of humor and pathos in a story. Sarah is a likable, self-deprecating heroine, so it was fun to spend time with her and see how she managed to extricate herself from all of the dangerous situations she found herself in.The character who intrigued me most in Eternal Vows was King Victor, the immortal whom Sarah marries out of desperation and finds herself forever bonded to. Powerful, magnetic, and more than a little bit scary, Victor could have very well been the villain of the piece, but there was so much spark between Victor and Sarah that I found myself hoping he wouldn't turn out to be all bad. I guess I'll find out exactly what his motivations are and how he really feels about Sarah in book two of the series, Eternal Destiny. I've already downloaded it and can't wait to find out what happens to Sarah!"}, {"userName": "Patricia Puddle", "userReviewDate": "Mar 16, 2012", "userURL": "http://www.goodreads.com/user/show/4602999-patricia-puddle", "userReview": "When Sarah Larker's sister disappears, she knows something is very strange and becomes a paranormal researcher in order to help her find out what happened. Sarah goes with other researchers to the place where her sister was last seen and when she hears strange noises, she senses something, or somebody is watching. Sarah goes through a portal, ending up in another time where she's nearly killed by giants. Then comes a mysterious, immortal king called Victor. He says he knows who she is, but seems to dislike her for some unknown reason. He still wants to claim and marry Sarah, which confuses her and she realises he must have mistaken her for someone else. Sarah has to find a way to outsmart him and stay alive, so she agrees to marry the weirdo, hoping he doesn't find out who she really is? Though Sarah and Victor are enemies, they seem attracted to each other, which adds excitement to the story.A wonderful story that's full of adventure and humour. It's definitely different from other paranormal stories that I've read. I highly recommend it. If you like Robyn Hood, you'll love this story."}, {"userName": "Jessica", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/5862081-jessica", "userReview": "First, you need to start this story knowing that it is a very light-hearted satire of the fantasy genre. What is interesting about it is that the story has the basic backbones to be a very good fantasy story, but the attempt at humor takes away from this completely. I alternated between laughing at a joke, then rolling my eyes for the next three pages of nonstop corny jokes. I think the book tries too hard to be funny, when it would still be just as good of a satire if all the bad jokes were cut and a bit more seriousness was put in their place. The whole book could have used a final edit; there are so many inconsistencies that distract from the flow of the story- for instance, at one point Sarah is described as putting her hands behind her back, then in the next sentence her hand is described as still being held. There are similar issues with places- it seems like Sarah is teleporting around all the time: one moment she's talking to someone in the crowd, the next she's back with her group on a platform."}, {"userName": "Jennette", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/7607633-jennette", "userReview": "Wow I am a little bit speechless. I actually had to sleep on it before I could figure out what to say about this book. I liked the pace of this story lots of thing happening. I never knew exactly what would happen next. There was a lot of strange unexpected creatures like Bigfoot, shape shifters, immortals and then there is the magic or maybe not magic ring.Oh, and let us not forget the portal to an different dimension. It is almost like the author took all her favorite books freaks and tossed them into a romance love triangle salad. Fun! The only disappointment for me was the lack of a true resolution at the end for any of the problems in the story. It feels too incomplete. I hope the rest of the series has better endings or I won't bother with more."}, {"userName": "Liz", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/5827305-liz", "userReview": "Story had potential but the execution fell flat. Zero connection with any of the characters. There were inconsistencies in dialogue (the \"other dimension\" characters slipped up and used some \"modern/real world\" phrasing) that jarred believability. The \"witty\" banter was annoying and superficial. Disappointingly short time spent with Victor, who is probably the most interesting character in the book (though that's not saying much). From the description, I expected an intriguing, fun, romantic romp, but every plot turn seemed so forced and unnatural that I couldn't really enjoy it. Could have been so much more..."}, {"userName": "Megan", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/24621901-megan", "userReview": "I think four stars may be too many however, 3 seems just a little too harsh.I was so interesting in this because the story is a little different. I'm curious in terms of this whole myth of big foot and turning them being into a thing from the other side. And it being an alternate reality almost.Not sure if I will carry on the books as I'm sort of bored."}, {"userName": "Ada", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/8528755-ada", "userReview": "GUYS THIS ONE IS A WINNER! I thought I was going to be disappointed... but I actually fell in love"}, {"userName": "Blodeuedd Finland", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/1962503-blodeuedd-finland", "userReview": "I started reading and was all this is so boring! DNFThen I read the blurb, and thought, fine I will push through a bit. But even when she came to the fantasy land I was all sigh, she is rather stupid, they are rather stupid. Why bother"}, {"userName": "Karen", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/11688116-karen", "userReview": "well I really liked this book by Chrissy Peebles. It reminded me a little bit of Outlander but was very different from it. I really liked the main character and I can't wait to read the next book.And see what else she gets into"}, {"userName": "Jessica", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/15121018-jessica", "userReview": "I'm not going to rate this because my ?distaste? had nothing to do with this book being bad or good. I can handle pretty much any mythological creatures in a book...but i have to say i draw the line at a heroine who hunts big foot...THAT is too weird for my taste"}, {"userName": "Faith", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/14049790-faith", "userReview": "fantastic, i read it in one day, it was spectacular"}, {"userName": "Sepideh Sahebsara", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/28424228-sepideh-sahebsara", "userReview": "love it"}, {"userName": "Melanie", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "An interesting story. Different from a lot of the books I've read, but I enjoyed it. I'm curious about continuing the series and seeing what happens next. The ending was sort of a cliffhanger :)"}], "description": "Never marry a stranger... even if he is a drop-dead gorgeous immortal king.Never pretend to be a princess.And most importantly... never slip on an ancient wedding ring you know nothing about.Sarah Larker returns to a cave where her sister disappeared ten years earlier. She walks through a portal and is mistaken for a runaway princess on the run by a dangerous immortal king in medieval times. Her plan is bold as well as daring-become this princess, wed the king, and slip on an ancient wedding ring that will unlock the portal back home. Then find her sister and run as fast as she can out of Dodge. But taking on the identity of Princess Gloria comes along with dangerous consequences; and slipping on the ruby ring comes with an even higher price.", "title": "Eternal Vows\n      \n          (The Ruby Ring #1)", "url": "http://www.goodreads.com/book/show/13543899-eternal-vows", "average": 3.62, "cover": "https://images.gr-assets.com/books/1331858238l/13543899.jpg", "reviews": 319, "authors": [{"url": "https://www.goodreads.com/author/show/5176055.Chrissy_Peebles", "name": "Chrissy Peebles"}], "type": ["Fantasy", "Romance", "Fantasy", "Young Adult", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13543899-eternal-vows", "http://www.goodreads.com/book/show/16176685-eternal-vows", "http://www.goodreads.com/book/show/13548936-eternal-destiny", "http://www.goodreads.com/book/show/15832350-the-zombie-chronicles", "http://www.goodreads.com/book/show/18624492-crush", "http://www.goodreads.com/book/show/19510198-crash", "http://www.goodreads.com/book/show/18338312-enchanted-castle", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}