{"ratings": 4199, "userreviews": [{"userName": "Kasey", "userReviewDate": "May 28, 2014", "userURL": "http://www.goodreads.com/user/show/4840230-kasey", "userReview": "Please. No love triangle. Go jump off a cliff chase.WOW WHAT A SURPRISE THERE IS A LOVE TRIANGLE. I'm honestly so annoyed by al of this. If she ends up with Chase it's literally the biggest troll from C.C. ever. Oh, going to spend most of the shadow falls series and give you a novella where it looks like she'll be with Steve but as soon as her series starts let's throw in a new guy TROLOLOL. No. Ugh, I hate Chase so much he's such a cocky dick and wow surprise surprise he lied to you again! If Della goes back to a guy who's such a piece of shit I'll lose all respect for her. Burnett is literally the only one with any sense bless you Burnett. I feel so bad for Steve and now the whole Perry thing too? Wtf Hunter? The plot besides all the stupid drama was good and is the only reason it gets 3 stars. Hopefully the last book can fix all this but if not I've lost all respect for this series which is a shame because I was really excited for it when I found out about it but noooo. Just had to have a random and very unnecessary love triangle. :/"}, {"userName": "Jasmine", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/31740218-jasmine", "userReview": "What is this about needing to choose between Steve and Chase?I WON'T HAVE ANY OF IT. If Della doesn't end up with Steve, I will be having words with C.C. Hunter. You hear that, woman? I will hunt you down.*****Update: 11/10/2014All I have to say is that this book seriously pissed me the hell off. And Chase is where all of my hatred stems from. Why can't he just die?"}, {"userName": "Hannah", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/25344122-hannah", "userReview": "Review: 11-01-14Steve I am offically done with your shit. 100% Done. Favorite Couples Quotes  Lylas:\"Della looked around. Kylie and Lucas and her mom sat chatting about selling her house. Lucas must be getting used to Kylie's mom, because he actually looked comfortable instead of miserable, like he usually did when Kylie forced him to spend time with her mom.\" (Pg. 343) Chella:\"'Wait,' Della said 'Let me see if I understand... you want me to tell her this?' Sarcasm spilled out with her words.'Yeah,' he said as if he didn't understand her issue.'Why don't you tell her?' Della slipped a hand on her hip.He made a face. 'Shes's your ghost.''My ghost? Why the hell is she my ghost?''Because she's closer to you.''Says who?' He opened his mouth and nothing came out right away. Then words spurted out of his lips. 'Because...Because...' His eyes widened as if he figured something out. 'Because she gave you the picture of Natasha. And Natasha has some connection to your family.'His reasoning made sense, perfect sense, but Della didn't want to see it that way. Refused to see it that way. She didn't want to be alone with some dead person. Sharing it with him wasn't the ideal situation, but she hadn't come up with this plan.'That doesn't make her mine,' Della insisted 'She talks to both of us. We've got joint custody here, buddy. You should have thought about this before you bonded with me And don't try to skip out of your responsibility.''It's a ghost,' he said 'Not a baby.'\" (Pg.143 )The next book comes out July 2015? And Its the last book for the Shadow Falls: After Dark? WHAT! This is NOT OKAY!"}, {"userName": "Mariam", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/6838080-mariam", "userReview": "I'm going in guys and I am so excited!I'm sure there will be plenty of \"omfg\" and \"hahaha\" and \"WHY!\" and the occasional *sobs* but thats what makes books well books :PI mean how lucky are we, when shadow falls ended I was seriously depressed for a week but we have an amazing author who decided that her fans deserved more and she continues to write I mean that makes me...And as a side note I still have unidentifiable feelings about Chase..."}, {"userName": "Andrea Heltsley", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/6600922-andrea-heltsley", "userReview": "I am remembering why I love C.C. Hunter sooo much! This book was every bit as good as Reborn. I LOVE the mysterious relationship Della has with Chase. There is so much to be explored there, not to mention that I'm rooting for them!The book was intriguing and held my attention until the last page. WTH was what I thought of the giant cliffhanger at the end of the book. I can't wait for the final book in the trilogy. I'm dying to know how everything is going to turn out for Della. Luckily there is a novella from Chase's POV coming out to tide me over. Love this book and give it five glittery stars for being awesome!"}, {"userName": "Kayla Edwards", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/24780999-kayla-edwards", "userReview": "Powerful ghosts are literally trying to spell things out. Relationships are burned and new ones are forged. It's all just a bit too much for Della to deal with being freshly reborn and bonded to Chase. That bond binds them together in a race against time as both she and Chase are flung into the bodies of two starving, locked-up teenagers. To top things off, there is a ghost encouraging them to find these teens who may or may not be alive. A ghost that just might have a few personal connections to Della...I couldn't put this book down. Once again, the world of Shadow Falls kept me completely entranced with its constant action and drama. Where I was previously so certain I knew which guy Della should be with, I now have no clue. Team Steve? Team Chase? Team Dump-Em-Both-And-Move-On? I know, I know - yet another love triangle - it's been done, blah blah blah. You're right, it has. But hey, that's real life. It would be great if love worked out perfectly and there was only one person that you're ever attracted to; a person you took one look at and instantly knew it was pointless to date anyone else. But life just doesn't work that way. Dating is rough and messy. People get hurt. That's one of the things I love about these books - the characters are all so real. Real people with real problems and real flaws who just happen to be paranormal. And the ghost whispering. I am so beyond thrilled that it did not go away with the first Shadow Falls series. I love trying to figure out the ghosts' clues along with the characters. Who doesn't love a good ghost story? And oh that cliffhanger. I strongly recommend this book and it's predecessors to anyone who loves action, the paranormal, romance, drama, mysteries, thrillers, or all of the above. It has a quick and easy readability that makes it hard to put down. From preteens to seniors, this story has quite an audience range. Everyone can relate. We've all been there or are just beginning to go through it. Remember, you don't have to be a teen to love a good young adult novel. It's for the young and the young at heart."}, {"userName": "Steffi", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/38613526-steffi", "userReview": "Crying does nothing but water the pain and allow it to growWow. Just WOW. C. C. Hunter definitely knows how to hold your breath while reading ...First of all, I found Eternal better than Reborn. Maybe this has something to do about the fact that our dear shape-shifter Steve does a bad move (sorry, I do not like boys who are too protective, who are upset instantly if you don't tell them everything the moment you know etc). Honestly, I do not trust Chase thaaaaaaaaaaat much, but Della and his relationship is complicated and we all know he's playing a big role in Della's right now. Thus, I had to laugh sometimes because of them. These were some moments, where I could see a relationship between them.As for the story ... I've been blown away. The ghost-story, Della's family drama .... woah. I got some cold shivers and was glued to the book until the very last page. And WTH C.C. Hunter what an evil cliffhanger ?!?!4.5 well deserved stars"}, {"userName": "Shelley", "userReviewDate": "Apr 16, 2014", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "**I received this book for free from St. Martin's Griffin in exchange for an honest review. This does not affect my opinion of the book or the content of my review.***Genre* Young Adult, Paranormal Romance*Rating* 3-3.5*Full Review Posting @ Gizmos Reviews 11/04/2014 as part of the Eternal Blog Tour. I am giving away a finished copy of the book to anyone who lives in the USA. Sorry folks! I am a poor person who can't afford international shipping.Review link below:http://gizmosreviews.blogspot.com/201...*Recvd 08/12/2014 via NetGalley* Published: October 28th 2014 by St. Martin's Griffin"}, {"userName": "Karina {witchling wanderer}", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/11099126-karina-witchling-wanderer", "userReview": "More reviews at A Reader Under The Sea   This book was probably one of my most anticipated books of the year after I finished reading Reborn, the first book in the series. I kind of have mix feelings. I'm in the mist of thinking that I liked it but then there were things that I hated. It's very surreal and neutral feelings for me. I really can't choose...   Reborn left us with Della almost dying but Chase saved her by giving her his blood and bonding each other. It's been said that the bond has been compared to that of a twin relationship and soul mates. But Della doesn't want to accept that.   Throughout this book she just keeps on denying it so much and it's because of the feelings that she's harbored for Steve. She doesn't want to do anything with Chase and yet she feels pain (not hurtful pain) when she's not with him. But then we learn that Steve is going to Paris with Perry after being invited to an elite school for shape shifters. It's like this big deal thing. Depending on how it goes for them, then might stay for weeks or months; if they get accepted, four years.   That really blew my mind and I didn't like it. They weren't really in the book much either. Not even half of the book. It really sucks because I like Miranda and Perry together but now there's a possible story for her. I also felt like C.C. Hunter just wrote the same story she did with Kylie and Derek when he left so that she can sort out her feelings for Lucas. It's almost the same thing with Della and Steve. He leaves so that she can figure out her bond with him. But we don't get a lot of figuring out about the bond. The story really focused on Della and her case with these two ghosts. I honestly didn't like it.   What I really enjoyed about this is Miranda dealing with Perry going to Paris. But she isn't the focus of the book so that sucks. But I feel like she's going to get her love triangle because she decided to give her old crush a chance. I don't know how I feel about that since I ship her with Perry.   Something I felt was off about Eternal is that there wasn't a lot of romance going on. Sure there were some scenes between Della and Chase but not a lot to my liking. I didn't feel like we got to see some exploration and developing between their relationship.   Then we have the ending which I didn't like either. It sort of ended with a cliffhanger. It didn't really interest me that much. But I'll probably still read the next book because I love the characters so much. I really have so much fun with them since I read the first series that introduced us to Della, Steve, and their friends. Naturally they've grown on me and I want to read more adventures with them. Now I would actually read a possible Miranda story because I always told myself that she was my least favorite character but now I'm so intrigued.   It was kind of a bummer that we didn't get to see some old characters from the original series. Some of them were only mentioned in the background or for a brief time. I really hope to see them again in the next book. That's why I enjoyed the first book because we got to see them once again.   Eternal is still a good quick read. It can be slow at times but it's still good at making you want to read the next installment. Not a lot of romance and the love triangle kind of dissipates for those who don't like them.\n\n3 Stars: I liked it"}, {"userName": "Melliane", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/3166645-melliane", "userReview": "Mon avis en FrançaisMy English reviewI was really looking forward to reading more about Della after finishing the first volume. The prequel has allowed me to wait a bit before reading this new novel and I was glad to discover the short story before this one as we learn more about the Chase’s past. The first volume had left us with a cliffy that made me impatient for the second volume. Oh yes because I was curious to see what would happen between Della, Steve and Chase.So we find our beloved heroine who must manage the bound developed between her and Chase. But what can she do? Whatever she does to forget it, it is alive and here. Yet we have Steve, the boy she likes a lot, and she knows she can not leave him. However, things could change when she learns that the boy has to leave for several months and he asks her to settle her story with Chase to see what she really wants to do next. It’s pretty sad to see Della, as well as Steve and at the same time we understand why he does so. It must be very difficult to see the girl he loves away from him in this way, especially knowing that she also works with the vampire. Hopefully everything will work out in the end but it’s true that it’s hard to say which boy I would prefer for her. Both are very different but while Steve is quite the nice guy, Chase remains opposed and his secrets could well ruin everything. Yes because it is very easy to trust the first one while we still do not know what to do with the young vampire and the end of the story changes our mind again.But in addition to this romance rather complicated, Chase and Della must work together. Indeed, it seems that two vampires are gone, locked to die alone. But the two manage to collect visions of their survival and they will do everything to try to find them whatever everyone can say in relation to their chances of success. Added to this, they will also both be helped by a ghost, a person we do not know the identity initially. But nothing is simple for Della when in addition, her family stories are added, completely turning the girl upside down who seems to have initiated many things without really knowing it.So again I had a great time and I love to follow all the heroes present here. It was a great surprise and I look forward to read more after such a purpose!"}, {"userName": "Rachel", "userReviewDate": "Oct 28, 2014", "userURL": "http://www.goodreads.com/user/show/298806-rachel", "userReview": "A mystery or a few, a ghost who demands to be heard, a super sexy but not entirely trustworthy vampire who works for the opposition, an overprotective but lovable camp leader, a fierce and determined but guarded heroine, plenty of secrets, missions and battles, and a killer cliffhanger ending are just a fraction of what makes ETERNAL a thrilling and absolutely riveting installment in C.C. Hunter’s incredibly addictive Shadow Falls: After Dark series.With family secrets still to be uncovered, doubts about a future with her boyfriend, and questions about her new abilities and what that all means, things have not gotten any easier for Della Tsang. And when she discovers that she and Chase Tallman have a connection to the Fallen Research Unit’s latest case and that they’ll have to work together to solve it, it’s almost more than she can handle.But with a persistent ghost making sure she doesn’t give up, she’ll have to set aside her reservations about working with him. Especially if her involvement could mean the difference between life and death for the two missing vampires she’s been tasked to find.C.C. Hunter delivers a second book in a spin-off series that has all the appeal of its predecessors – fabulous writing, delightful characters, an exciting and suspenseful mystery, romance, heartbreak and an ending that will leave readers desperate for the next installment. Some questions from this and the first book in the series are answered while others remain unanswered in anticipation of the trilogy’s conclusion. But enough is revealed to satisfy and to tease for what’s ahead.Fast-paced and action-packed, with a ticking clock to keep the pages turning and a multi-layered mystery that will keep both readers and characters guessing, ETERNAL is a nail-biting and utterly electrifying read. Add in tension between the main character and each of the two boys vying for a piece of her heart, surprise revelations that invite more questions than provide answers, and passages that are laugh out loud funny, and you have a sequel is unputdownable.ETERNAL is a must for fans of the world of Shadow Falls and readers who enjoy a well-written mystery that is interspersed with humor, a touch of mayhem, and a dash of romance."}, {"userName": "Jessie Potts", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/4743026-jessie-potts", "userReview": "4.5 starsWhy you should read it: You have to read Reborn first, at least to really see what Della has fully gone through. If you have time, I also think reading the whole Shadow Falls series (this is an off-shoot series) would really enrich the world Della is living in. She has become someone stronger, someone who is able to hug, to share and to open up. Della is also faster and tougher and finally doing what we knew she was capable of. Chase fans will love this book. He's got a big role to play and Della is working with him. I was a Chase fan, but the author over-used their bond and I understood why Della resented it. We also get to see a lot more of Della's family, which is interesting, and the ghost (the case they're working on) will lead Della deeper into her family's past and secrets. All in all, except for the cliffhanger (ahh!), it's a great installment. I actually liked it better than the first.Head over to the HEA blog to see what CC is working on now!http://www.usatoday.com/story/happyev..."}, {"userName": "Cecilia", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/9903759-cecilia", "userReview": "3.5 starsA bit tired about the drama that surrenders Della, but I start to really like the mystery with her ghosts! Why did Hunter use a freaking cliffhanger in the end of the book?!Read my full review at Book Obsession"}, {"userName": "Julia", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/31287712-julia", "userReview": "Inhalt: Nach ihrer Wiedergeburt muss sich Vampir Della entscheiden: Für wen schlägt ihr Herz wirklich? Und ist ein Blutsbund stärker als ein Herzenswunsch? Nachdem Della ihre Wiedergeburt nur knapp überlebt hat, fühlt sich ihr Körper fremd an. Und ihr Liebesleben wird komplett auf den Kopf gestellt, denn mit dem mysteriösen Vampir Chase Tallman, dem sie ihr Überleben verdankt, verbindet sie ungewollt ein irres Gefühl. Und plötzlich sind da auch noch Stimmen in ihrem Kopf. Sie verlangen von Della die Aufklärung eines Verbrechens, in das auch ihre Familie verwickelt zu sein scheint: Ihr Vater soll einen Mord begangen haben… (Quelle: Klappentext)Meine Meinung: Wie sehr habe ich mich damals auf diese neue Reihe gefreut. Wir erleben endlich das Shadow Falls Camp aus der Sicht von Vampirin Della. Nachdem ich vom ersten Band sehr begeistert war, habe ich mir im Januar den zweiten Teil dieser Reihe vorgenommen und wieder einmal relativ schnell durchgelesen. Ich mag den Schreibstil von C.C. Hunter einfach. Er ist sehr typisch für ein Jugendbuch und doch irgendwie schön. Man hat Della Stimme, ihre Gestik und Mimik und alle ihre Charakterzüge treffend vor Auge, wenn man das Buch liest und so macht es mir immer wieder Spaß, in die Welt von Shadow Falls abzutauchen. Im ersten Band der Reihe hatten wir eine ganze Menge damit zu tun, uns an Dellas Sicht zu gewöhnen. Dann waren da noch die Sache mit Chan und wer zum Teufel ist Chase? Die Liebe und andere Teenager Probleme waren zwar da, standen aber im Hintergrund. Dieser Aspekt rückt in Unter dem Nachthimmel sehr in den Vordergrund. Wir haben ein etwas nerviges Liebesdreieck zwischen Della, Steve und Chase und dann stellen sich beide Typen irgendwie ein bisschen als nicht so nett heraus. Sowas nervt mich ja wirklich immer und das war definitiv ein Kritikpunkt am Buch. Generell war es nicht besonders spannend. Der spannende Teil überwiegt eher am Ende und vorher war es schwer für mich, am Lesen dranbleiben zu wollen. Von den restlichen Dingen war ich aber wieder überzeugt. Della ist und bleibt meine absoute Herzensprotagonistin und ich merkte Kapitel für Kapitel immer wieder aufs Neue, wie sehr ich sie schätze. Für mich hat sie auch eine tolle Entwicklung durchgemacht. Insbesondere, was die Liebe und ihre Familie angeht. Und auch als Wiedergeborene hat sie mit einigen neuen Dingen zu kämpfen. Der Chan-Fall ist so gut wie abgeschlossen aber eine neue Herausforderung steht für Della bereit. Sie hört den Geist von Natasha und anders als bei anderen Geistern scheint Natasha noch am Leben sein. So konzentriert sich dieser Band um den Fall Natasha. Hier kommt deutlich mehr Spannung ins Geschehen. Besonders, da Natasha nicht irgendein Mädchen ist, sondern mit Della und ihrer Familie in Verbindung steht. Obwohl der Natasha-Fall für mich etwas mehr im Vordergrund hätte stehen können, war ich trotzdem wieder überzeugt vom zweiten Teil der Shadow Falls After Dark-Reihe. Nahtlos knüpft dieser an Band 1 an und auch die Gesamtgeschichte und Dellas Probleme werden fortgeführt. Das macht besonders mit dem Ende sehr neugierig auf Band 3 und ich freue mich schon sehr auf dieses Finale, das Ende Februar erscheinen wird. Bewertung: Unter dem Nachthimmel hat mir zwar nicht ganz so gut gefallen, wie sein Vorgänger, trotzdem hat es wieder sehr viel Spaß gemacht, mit Della in ihre Welt abzutauchen. Besonders die große Geschichte hinter der Trilogie wird noch einmal weiter erzählt und macht so viel Lust auf den finalen Band. Dafür gibt es von mir 4 von 5 Füchschen.Vielen herzlichen Dank an Fischer für das schöne *Rezensionsexemplar."}, {"userName": "Jessica (a GREAT read)", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/3549629-jessica-a-great-read", "userReview": "I received this ARC from the author as being apart of her Street Team for an honest review, I was in no way compensated for this review.C.C. Hunter's Eternal is Della's second book in the Shadow Falls: After Dark trilogy! Yes, C.C. confirms it's a trilogy at the back of the book. Eternal was definitely an enjoyable read, as Della was by far one of my favorite characters when it was Kiley telling her story and with Della at the helm, you know you're in for a treat!Della is dealing with being reborn and bonded to Chase in this one. She's not overly thrilled with it either. There's a lot of emotions going on when it comes to this. It definitely puts a strain between her and Steve. But soon Steve and Perry both leave the scene and are not seen again. It was sad to have them off scene--they went away to another school in Paris--but I felt like it was right in some ways for Della. Steve recognizes that there is something between her and Chase and he wants Della to figure it all out, to figure out who she wants to be with. Even though, Steve will be gone for an unknown amount of time.I found myself very attached to Steve, pretty much since he and Della worked together in Saved at Sunrise. And now with Chase in the picture, I found myself very much on Team Steve. But sadly, he just wasn't there. There was no trying to fight for Della on his part since he left, so I can kind of understand Della falling for Chase...but then the question is, is that real or is it their bond? A question Della asks herself more than once during the course of events.Although, Chase is still a fun character. He matches Della's snark head on and isn't afraid of her moodiness. They're quite the pair and working together, in a way, does get them closer together.Their case was a real doozie too! They are both experiencing visions of two vampires, a girl and guy and they're in trouble. Subsequently, that becomes their case, trying to find where these two are. They're being held somewhere dark and time is not on their side, which really ante ups the pressure in trying to find them. There's a lot of obstacles in their search and it made for an interesting mystery of sorts.Della's family also played a bit of a larger role in this one. Mainly, their secrets, secrets we have yet to truly uncover. But it keeps getting mentioned as they did in Reborn. Just little hints that there is something being hidden. I think those secrets will be at front and center in the final book, which is the next book!I enjoyed seeing Kylie and Miranda around again as well! They are still there for Della much like Della and Miranda were there for Kiley. I almost want Miranda to have her own book now too! Miranda is dealing with more heartache, it seems, than Della over Perry leaving her. I feel like that there is more to that story as well, as Della had a conversation with Perry prior to leaving. Perhaps it was due to the fact that he was leaving and that was the secret, but I can't help but feel like there was more to it than all that! But as I tend to tell myself, only time--and the next book--will tell!Eternal was an amazing followup to Reborn that continues Della's journey! The sassy, smart-mouthed vampire who's just trying to make sense of her world as a vampire and now as a reborn. She's a lovable heroine because she's never afraid to speak her mind and do what she believes is right, even if it may lead to further consequences! Eternal is a must read for all Shadow Falls fans that lets us linger just a little bit longer at our favorite camp.Overall Rating 5/5 starsEternal releases October 28, 2014"}, {"userName": "Brandi Kosiner (Brandi Breathes Books)", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/2614253-brandi-kosiner-brandi-breathes-books", "userReview": "I wanted to read Eternal because I like C.C. Hunter's writing style as well as getting to know Della even more in the last one. She is a strong and independent young lady, and I love her snarky humor. It was neat to see Shadow Falls through new eyes, because I read the original series with Kylie, and while she is a great character, she is a different species as well as different personality types.  We get to see the side of Della that wasn't wholly apparent in the other series. She begins to crave and enjoy opening up to Miranda and Kylie as well as the hugs and contact. We also get to see her and Burnett working together and get to see her loyalty through working with FRU and also Chase, who works for the Vampire Council. There are a lot of debates with the two about being faithful to their respective agencies as well as trying to sell the good points and get the other to switch over.  Della and Chase also have a lot of time together in this one, both working together, exploring their bond as well as the growing attraction between them. It was def Chase's book as we got to see her with Steve in the last one. There were some pretty hot scenes between the two as they worked together to figure out the ghost that is trying to guide Della to save a boy and girl who is trapped and dying. Holiday and Kylie try to convince Della that Natasha, the girl in Della's vision is dead since that has been their experience but Della and Chase have the visions where they are in Natasha and Liam's heads and the ghost seems to indicate that they are alive.  Della's family is interwoven in this one in ways that I never expected. Of course, Della is mourning Chan but then she learns more about her dad, uncle, aunt as well as a family member that she never would have expected. It is hard to see Della struggling with the relationship with her dad. He is strict and thinks that Della has shamed the family but she just remembers their bond and she wants to still please him and not to be seen as a failure and shame to the family.  There was plenty of action, and I loved seeing Della's confidence and strength when its the right time to use it. She is a tough gal and being reborn, she has extra strength and its awesome seeing her kick butt. It was coupled with her growing as a character, realizing the need and how much she loves her friendships, having a mentor in Burnett and Holiday and figuring out her feelings for the two guys competing for her love and attention.  The ending killed me as usual because it ties up some aspects but then drops a bomb where I was like wait. What? Why? Dang it I am going to have to wait WAY too long to figure out if its how it looks or what possible explanation is there for stopping THERE and what was he doing. Okay. I think I am done with caps lock. Maybe. Bottom Line: Great installment. Della starting to make some hard choices and discover things about her and her family."}, {"userName": "Jessica (Goldenfurpro)", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/8096484-jessica-goldenfurpro", "userReview": "This and other reviews can be found on The Psychotic Nerd\nMY THOUGHTS\nI loved all of the Shadow Falls books and the first book in this spin-of series, Reborn, so I wasn't surprised that I loved this book just as much!This book takes place not too long after the events in Reborn and I was a bit rusty on my memory of that book. Thankfully, it was very easy for me to get into this book. I jumped into this book very smoothly and my memory was quickly refreshed! Della is now bonded with Chase, which isn't very easy for her. Chase is still very mysterious and never answers any of Della's questions, though Della is still attracted to him (if asked she will deny it). We do still have a bit of a love triangle with Chase and Steve. Steve is Della's boyfriend and we see less of him in this book. Chase is in the book much more mostly due to the fact that Chase and Della are working together on a case. Frankly, I can't decide between the two...This time Della sees yet another ghost and has another mystery to solve. This ghost is constantly telling Della to \"find Natasha\". She ends up getting sucked into visions of this girl, Natasha, and a boy, Liam, both vampires trapped and waiting to die. Not unusual except that Della isn't the only one sucked in the vision, Chase is too. The two also firmly believe that Natasha and Liam are still alive and need to be saved, despite the fact that everyone else (Holiday, Burnett, and Kylie) believes that they are dead. Della and Chase have to find out where the two are being held along with going along with what the FRU and Vampire Council are wanting them to do (though, they go against the rules quite a few times of course).I just need to sit back and just talk about Della. Della is a completely different MC than most YA books. If you have read the Shadow Falls books and Eternal, than you should be very familiar with Della's unique personality. She's badass with a snarky sense of humor and an attitude. It's very interesting to see these books from her point of view.It's also very interesting and unexpected how much Della's family was involved in this book and the series as a whole. Della looks deeper and finds out things that she has never known about her family and begins to learn more about her father's dark past.\nIN CONCLUSION\nThis was a great next installment in the series! I loved the mystery and it was far from predictable. The book ended in a little mini-cliffhanger, which makes want to read the next book even more!"}, {"userName": "Steph at  Starry Night Book Reviews", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/5936753-steph-at-starry-night-book-reviews", "userReview": "Readers will love Eternal, We get to see the mysterious relationship Della has with Chase. I think they both have so much potential and I’m rooting for them all the way! This second book is a page turner! It will have you enchanted in the first few pages! There’s a lot of action going on in this second book and it’s like we are right with Della while she tries to solve the cause she gets put on! (Sorry no spoilers here you will have to read Eternal for yourself!) All and all the book was wonderfully written and I am very excited to read the last book in the trilogy. *Beware there is a cliffhanger but it’s not the kind that makes you want to scream and pull out your hair.* I recommend reading this if you have read the first one, If you haven’t make you for pick up the first book Reborn. * I have given this book as an ARC for an Honest review as I'm a part of C.C.Hunters Street team."}, {"userName": "meghann", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/22890390-meghann", "userReview": "Three and a half stars. I really enjoyed the first book in this spin off series, but I was disappointed in how different Della was in the first half of this book. She went from a snarky and badass to whiny and consumed by her feelings for two beautiful guys. Her feelings?!? Since when does Della Tsang give a damn about feelings? Serious shit is going down, people have died and all she can do is wallow because two boys like her and she kind of likes them both. Fuck that noise. Halfway through the book, Della's original personality returns. There is still a degree of wallowing, but at least other things are happening that are entertaining. And what happens at the very end is like omgwtfbbq. So first half of the book = 2 stars, second half = 3 stars and the ending gives it that half star bump."}, {"userName": "Gabrielle (TheYoungFolks.com)", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/4983769-gabrielle-theyoungfolks-com", "userReview": "\"That Perfect Love Connection\" - C.C. Hunter wrote a guest post for TheYoungFolks.com on creating compelling love interests. Read it here: http://goo.gl/L1V1yF"}, {"userName": "Jessica *The Lovely Books*", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/2621253-jessica-the-lovely-books", "userReview": "Highly satisfying! Full review to come."}, {"userName": "Lygia", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/22700323-lygia", "userReview": "C.C. please stop messing with my emotions..."}, {"userName": "Marleen Rummeling", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/24103855-marleen-rummeling", "userReview": "4,5"}, {"userName": "Gretchen Gomez", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/20133875-gretchen-gomez", "userReview": "Why does CC Hunter always leave us with a cliff hanger????????WHY?!?!?Amazing read!"}, {"userName": "meinebuecherliebe_", "userReviewDate": "May 26, 2016", "userURL": "http://www.goodreads.com/user/show/50784081-meinebuecherliebe", "userReview": "Aarrghhh CLIFFHANGER!!!!!"}, {"userName": "Bianca", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/63424361-bianca", "userReview": "It's a shame, that there's a love triangle in this, because I would mindlessly love Della's books without it. I don't understand two things:1. Why C.C Hunter apparently feels the need to add a love triangle to every single story that she writes. There's a lot of foreshadowing about Miranda's love triangle in her book. I had really hoped that, because Miranda only has one book, it'd be without one. I think it's highly unrealistic. I don't know a single person that's ever been in a love triangle, and now Kylie, Della and Miranda all three have one: nope...just no. But to be fair, this isn't a C.C Hunter problem, but more of a YA problem and it's annoying.2. Why do both Kylie and Della choose the guy, that's been a dick to them? What is so wrong with a nice gentle guy? To be fair, Steve leaving without talking to her about it was mean, but it still just felt like a plot device, to make way for Chase. And, don't get me wrong, unlike Lucas I actually like Chase, he's an interesing character and one of my favorites, but I'd like him to be a crime-solving partner to Della, not a romantic partner. They would so kick ass together. And I don't know why Della was surprised, that Chase lied to her. She knew the whole time, that he didn't tell her everything."}, {"userName": "Lisarenee", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/2038272-lisarenee", "userReview": "****My SYNOPSIS****Della Tsang is finally working for the FRU, Fallen Research Unit (think paranormal FBI), and she's just been handed her next assignment--by a ghost. Della recently worked with FRU in bringing down and capturing Craig Anthony and his crew who were illegally enslaving newly made vamps by using his family's funeral home as a front. Now a vision bequeathed her by a ghost has let her know that two newly made vampires are trapped and buried underground. As not all the vamps that Craig Anthony enslaved are accounted for, Della's betting the two vamps she saw in the vision are part of that missing number. If the two vamps are truly alive, then Della and Chase will be in a race against time to save them. For vampires can only survive for a few weeks without a fresh blood source. With only the first names of the victims to go on and very little else, the ghost makes it crystal clear what she wants....\"Find Natasha.\"****MY REVIEW****This is the second book in the Shadow Falls: After Dark trilogy. For those of you unfamiliar with the series, Shadow Falls is a school for kids who are supernaturally gifted. The school runs under the guise of a drug rehabilitation center, for most teens who go through a supernatural transformation tend to display symptoms similar to that of a drug user. They tend to distance themselves from friend and family, are secretive, and, for some--vamps in particular, stay awake at night and are exhausted during the day. Supernatural beings have a species identifying pattern which hovers in front of their foreheads and can be seen by other supernatural beings. This helps the administration of Shadow Falls easily identify which kids to select for their program. Della has been a student at Shadow Falls for several years. Della is an honest to god vampire with remarkable powers because she is one of a rare breed known as reborns. She wasn't born a vampire and she wasn't bitten, but Della, and the majority of her family, are carriers of the VI virus which, when it goes live, turns people into vampires. If a person with the VI virus has an open wound that is exposed to the blood of someone with the active virus (ie someone who's been turned), they themselves will become a vampire. Among those who get turned, a small percentage go through a second turning process which, if they survive, they'll come out with stronger powers than the average vamp. These vampires are known as reborns because, in a way, they've gone through a second vampire birth.Many who go through a rebirth never complete the process and die. Reborn vamps can increase the odds of survival of another vampire going through their vampire rebirth by bonding with them. It's sort of like a blood transfusion where antibodies are exchanged, but the process also links the two vampires together in a rather disturbing way. The two can sense each others emotions. Della is still trying to figure out just exactly what bonding with another vampire means. Chase, the vampire who bonded with her in Reborn, keeps hinting that they're fated to be together. That doesn't fly with Della who is not one to just take someone at their word whom she's only recently met. Besides, Chase has admitted he'd previously bonded to another vamp when he was reborn, so she's pretty sure a relationship and bonding doesn't automatically go hand in hand. While she does feel an attraction to the guy, she doesn't fully trust him and with good reason. Chase is holding on to a lot of secrets. Of that Della is quite sure.In this book, Della is contacted by another ghost, but the whole vision is confusing. She doesn't know if she's seeing something from the past or the present. In the vision, she is literally dropped into another person and sees and feels what they do. A pair of newly turned vampires are trapped underground and are surviving on each other's blood. Vampires can only survive so long doing this and Della doesn't know if the ghost is showing Della her past or if she is showing Della someone else's present, but Della has a strong sense the girl she jumped into is alive. She must find out who exactly the girl is to save her. Additionally, she'll have to work with Chase to accomplish it.Della is not the easiest person to get to know. She's been betrayed and hurt by many of the people she's loved. For one so young she's suffered a lot of disappointment in her life. So she guards and protects herself and doesn't give a person the benefit of the doubt, instead they have to earn her trust. For many, this would put them off. For Chase, it kind of presents a challenge and Chase never passes on a challenge.Chase is a secret person who works for the Vampire Council. Ms. Hunter does an excellent job with his character development because I, like Della, keep waffling as to whether I like him or not. Is he what he seems or is he a manipulator playing Della for a fool? Is he trying to use the bond between them to recruit her for the Vampire Council? It's hard to say.Overall, I gave this one 4 1/2 out of 5 roses. I love that Della is such a strong female character who doesn't compromise herself for anyone. I liked the mystery of finding out who and where the missing vamps were and the surprising link to Della. This one ends in a cliffhanger, but it wasn't the type that leaves you frustrated that the author left some part undone, instead it leaves you looking to the next book with anticipation. I do admit I am a little sad there's only one book left. I wonder if we can look forward to another spin-off from the Shadow Falls series? I'm crossing my fingers.Notes: I received an ARC from the author, and I'm on her street team. What that means is I love and support her books enough to try to spread the word about them."}, {"userName": "Sarah", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/23598619-sarah", "userReview": "As the second book in the series, it was good in developing depth to the story, but still not much happens. Della is having troubles with others accepting her supernatural vampire powers and hopes that she can become a paranormal investigator. The love triangle continues and she struggles to choose which man she loves the most and is torn in her decision, now with someone from her past coming into the picture. I honestly would have liked the book a lot more if it hadn't been such a twilight knock-off because with the vampires and love triangles, its practically the same. the other elements of the book are still interesting though and i like Della's friends a lot more than the guys fighting over her."}, {"userName": "Candace Wondrak", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/46403525-candace-wondrak", "userReview": "Not a bad second entry to the spin-off series. I quite enjoy Della and her sass. She has so much personality than Kylie ever did. Not a fan of what happens with the shapeshifters. Does it happen for more angst and to keep the love triangle going? I don't know, but I say, so long to them all. Whether or not Chase's motives are questionable, I do think he's better for Della, but who knows? Maybe I'll be proven wrong in book 3."}, {"userName": "Jon", "userReviewDate": "Apr 06, 2014", "userURL": "http://www.goodreads.com/user/show/4277731-jon", "userReview": "Seen at Bookish Antics!The Shadow Falls series is one of my all-time favorite series and C.C. Hunter has managed to make this spin-off series just as exciting. I absolutely loved reading more about Della’s adventures at Shadow Falls as she undergoes a journey of self-discovery. Eternal gives fans the answers they’ve been waiting for regarding Della’s family history and still delivers the amazing, heart-pounding romance that fans have come to expect from Hunter.Della has to deal with her bond to Chase, the enigmatic bad-boy whose awfully protective and refuses to tell her much about what it means to be reborn. In addition, Steve doesn’t like Della’s bond with Chase, but without the bond she’d likely be dead. To top it all off, Della is visited by a ghost one whose past is rooted in her family’s deepest, darkest secrets and Della is going to discover skeletons she didn’t know her father had in his closet.Eternal is all kinds of amazing and C.C. Hunter has proven once again that she really knows how to write a captivating romance that fans will can’t help but gush over. I personally like Chase better than Steve, but I can see why Della is so torn between the two guys — each is special to her in their own way. There are plenty of swoon-worthy and heartwarming moments in Eternal and it truly doesn’t matter who Della ends up with in my opinion. I’m fine with her ending up with either guy in the next and final volume in this series because both care about her and will treat her with the respect she deserves. C.C. Hunter always managed to hit readers with raw, powerful emotion when it comes to romance and it’s a testament to her skill that I have complete and utter faith in her that she will make the right choice for Della.I love how the Shadow Falls: After Dark series explores the importance of race and cultural values. Hunter explores whether it’s possible to maintain ones’ culture or succumb to assimilation in this modern world. Della’s family is an interesting depiction of the cultural conflicts that many people have to deal with as they struggle to maintain the values that they grew up with. I love how Della’s father may make questionable choices as he tries to protect his heritage, but he’s never shown in a negative light and that he’s really humanized in this one.Della is grappling with a ghost of her own and it was incredible to see her character undergo so much growth in this novel. I’m so happy that we get to see Della kick some ass, but also get to see a more vulnerable side of her that’s more complex and sensitive than the one we’re used to from the Shadow Falls series. I truly love Della; she’s so damn witty, strong-willed and powerful — qualities that mark her as one of my favorite YA heroines. On a side note, it’s intriguing how Della’s journey parallels Kylie’s and I truly hope that Shadow Falls: After Dark isn’t the last series in this universe (maybe we’ll get a spin-off about Miranda?)Eternal is truly a lot of fun and is filled with a winning combination of romance and action that I absolutely loved reading. I’m so excited to read the final volume in this series, especially after that painful cliffhanger and I know it will totally be worth the wait. Just when I thought I was over paranormal fiction, C.C. Hunter managed to prove me wrong with the Shadow Falls: After Dark series. Eternal is just what fans have been asking for and it’s the perfect continuation to Della’s story."}], "description": "All her life, Della's secret powers have made her feel separated from her human family. Now, she's where she belongs, at Shadow Falls. With the help of her best friends Kylie and Miranda, she’ll try to prove herself in the paranormal world as an investigator—all the while trying to figure out her own heart. Should she chose Chase, a powerful vampire with whom she shares a special bond? Or Steve, the hot shapeshifter whose kisses make her weak in the knees? When a person with dark connection to her past shows up, it’ll help her decide which guy to choose–and make her question everything she knows about herself. From bestselling author C.C. Hunter comes Eternal—a must-read for fans of the Shadow Falls series—and the sequel to Reborn.", "title": "Eternal\n      \n          (Shadow Falls: After Dark #2)", "url": "http://www.goodreads.com/book/show/19286603-eternal", "average": 4.42, "cover": "https://images.gr-assets.com/books/1392247686l/19286603.jpg", "reviews": 318, "authors": [{"url": "https://www.goodreads.com/author/show/4154802.C_C_Hunter", "name": "C.C. Hunter"}], "type": ["Paranormal", "Young Adult", "Fantasy", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/19286603-eternal", "http://www.goodreads.com/book/show/21807312-eternal", "http://www.goodreads.com/book/show/26151879-unter-dem-nachthimmel", "http://www.goodreads.com/book/show/8705784-born-at-midnight", "http://www.goodreads.com/book/show/10800916-awake-at-dawn", "http://www.goodreads.com/book/show/12866426-taken-at-dusk", "http://www.goodreads.com/book/show/13416236-whispers-at-moonrise", "http://www.goodreads.com/book/show/15745371-chosen-at-nightfall", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}