{"ratings": 244049, "userreviews": [{"userName": "Kat Kennedy", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "How To Write Popular YA Supernatural Literature AND Defile Your Spirit!Based on the popular YA novel, Evermore, and aided by countless more like it, I have compiled an easy to read and follow list of rules for writing a popular series and being able to sell out your soul at the same time. Does that sound too convenient? Well, it's unbelievably easy to do if you follow my quick and easy program!1. Create an 'Outcast' Heroine.It's important that your primarily female teenage audience can relate to your main character. So whilst you can't have your main character associate herself with being cool, it still has to be obvious to your audience that she totally is. Now, Meyer's approach of the goose-turned Swan-but was really still a goose, Bella, associated herself as 'different' and a 'loner' only to arrive at her new school and be immediately popular and accepted by almost everyone. Noel's method is different yet in a similar spirit. Her protagonist, Ever, was incredibly popular at her old school and has decided to be an outcast because she feels that she can't be accepted due to her psychic gift. She also has the ability to perceive someone's personality through the colours that define them. So instead of aligning herself with the shallow, mean and popular crowd, she aligns herself with the shallow and mean loners. It’s very important for your protagonists to be 'different' because today's youth despise the sheep mentality and so they all strive to be unique. Since they're all different in almost the exact same way, it is relatively easy to emulate this, with as little effort put into characterization as possible, in your female protagonist.As long as she shows no regard for her clothing, appearance or any kind of interest in giving a shit about anyone but herself she will easily pass with young audiences. It will be her ewniqueness that eventually draws the Perfect Hero to her as opposed to any of the usual elements such as: looks, hygiene, personality or determinable interest in the world outside their own arse.Please also remember that she probably should be a reader, preferably of Wuthering Heights or Romeo and Juliet and that she should consider everyone around her to have inferior intelligence despite the fact that her reading repertoire extends to only a couple of books.A noticeably absent family is necessary and a completely dead family makes for a better story because then she actually has a perceived reason to be a moody, antisocial, self-absorbed little bitch. Do this even though, in all likelihood, she would be all of the above with a perfectly normal family.2. Create a perfect hero.It is VERY important that your hero be perfect in almost every regard. Unlike the female protagonist who can disregard her appearance, he must not only be more attractive than a GQ model without any of the effort put into his appearance, but he must also be thoughtful, intelligent and mysterious.In no way is he to reflect almost every teenage boy to have ever existed and he must have no desire to find a partner for himself who is in anyway comparable in looks, kindness, intelligence or perfection.If he is a vampire or some such immortal then he must be ridiculously wealthy. If he is a werewolf then he is allowed to be poor but must make up for it with incredible bedroom skills.He needn’t have a personality that extends beyond mysterious, sexy and in love with the female protagonist. Naturally, in this respect, Meyers, Mead, Marr and Stiefvater are something like overachievers - but if Noel, Saintcrow, Clare, Kate and Fitzpatrick are any indication, then we need know little more about the hero other than the fact that he’s gorgeous, has a secret and is in love. History, friends, likes, dislikes, family, passions, interests, hobbies and personality flaws are all negligible information that is taking up precious space in your novel. Especially when you could be injecting more drooling from the female protagonist in place of any kind of characterization for your hero.Your book will sell better if the hero stalks, follows, obsesses over and actively pursues the heroine beyond any realm of believability. You could triple your audience just by having him watch her sleep.3. Create useless friends.It’s important to reiterate to the young adult generation that nobody other than the hero is important. Since domestic abuse begins with one partner manoeuvring the other to have limited contact with anyone else, we must strive to normalize this in literature. Thus the female protagonist shouldn’t have anyone close enough to her that she can’t break contact or eventually forget about them. It’s very important that her full focus, socialization and all of her needs are eventually devoted or met by the male protagonist. To aid this, her friends must be selfish, vain, crazy, slutty, uncaring or in other ways undeserving of the heroine’s attentions and affections. It’s very important that she never call them on their poor, damaging and graceless friendship but must lovingly worry about them for the minimal amount of time acceptable to the reader before once again completely focusing on the mysterious hero.4. Mix in a twisted, convoluted plot designed entirely to provide dramatic and sexy subplot.It’s important that the plot, no matter how unlikely, must revolve around the hero saving the heroine. The villains do not necessarily need to have realistic or conceivable motivations for their actions. As long as the hero gets to save the day at least three or four times then your book will be profitable!Please remember that the actual plot of your story needn’t truly begin until at least 350 pages into your story. The longer you can stall any interesting event occuring, the less thinking you will actually need to do.Plus - FOR FREE - extras to help 'improve' your novel, the bottom line of your sales, and the expedient destruction of your soul.-How to create a senseless mythology.Mythology is more of a concept rather than something that needs to be respected or honoured. Vampires don’t need to refrain from daylight and angels no longer need to “fall” for good they can now be redeemed like us! The good news is that creating your own mythology, disregarding anything written before, allows you to twist and bastardize the plot beyond any recognizably interesting concept!-Explanations as to why research could actually DAMAGE your profit!Research takes time, energy and intelligence. Why do it? You’ve got ten fingers (presumably) and an attention span that extends past anything that could be compared to a gnat (even if it is only barely). Simply make it up as you go! For example: Ever is psychic. Research may tell us that this has something to do with receiving visions of the future or possibly commnicating with ghosts. Yet research is boring. Instead, she is imbued with the following powers that we guess can kind of be put under a psychic umbrella if we force enough information and logic out of our brains first: Mind reading, visions of near-present and future, personal life knowledge of any person she physically touches, seeing ghosts, seeing auras, literary osmosis from touching any written object, drawing the answers from any written question placed before her and any other supernatural abilities that seem convenient at the time.-Detailed observations on why the Deus Ex Machina rocks.Tying together a plot, even if you work to keep it as non-complicated or infantile as possible, is hard! It’s much easier to ignore tying together a number of plot points in any believable fashion and instead rely on some Deus Ex Machina to come in and take care of thoughtful planning for you! -How to expand one, nonsensical idea into a series and why this is more profitable than originality!Last, but not least! Ensure that your story is somewhat open ended so that you can create a series out of it! Research shows that people, even if they are intelligent enough to see that you’re writing is becoming progressively shittier and nonsensical, will often still purchase books in the series in order to find out what happens. So rather than creating a new story with new characters, simply beat the same old horse (it needn’t really be a horse – simply a pile of shit that’s been forced into a horse-like shape) for at least three or more books in order to squeeze every last cent out of the franchise that you can!This review can also be found on my blog, Cuddlebuggery Book Blog."}, {"userName": "Blythe", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5206717-blythe", "userReview": "THE EVERMORE DRINKING GAME\nIt looks like you’ve picked up the Evermore Drinking Game, for whichever reason (but if it’s because you have an interest in reading Evermore I strongly advise against it, for your sanity’s sake). However, if you’re still not convinced to \nstay the hell away from this book\n, the Evermore Drinking Game is here to make your reading experience as enjoyable as possible (because trust me, you won’t find anything enjoyable in this book without it). The rules for the Evermore Drinking Game are simple: when you read any of the instances mentioned below when reading Evermore, you take a swig of anything. It could be alcohol (for the best results!); it could be water (sadly, with this option, you’ll still actually have some grasp of the story), coffee (but you’ll be as hyper as you’ve ever been before you reach the end of the game), or really any other beverage in your disposal. Let’s begin the game, shall we? Once again, when you read any of the following instances, take a swig. And go! - Whenever you roll your eyes, take a swig- Whenever you feel like taking a hammer to Evermore, take a swig (and maybe that hammer) Easy so far? Don’t worry – you won’t be saying that after long. - Whenever Ever (heh) is a complete and total idiot, take a swig (yikes)- Whenever someone uses a positive adjective when describing Damen, take a swig (preferably sexy, gorgeous, hot, smoking, or even combustible) - Whenever someone says “omigod”, take a swig (omigod you’re in trouble!) - Whenever Ever presses her lips, take a swig (good luck with that one, my friend) - Whenever another talent Damen has is revealed, take a swig (but Damen will probably swig better than you) - Whenever you find out something before Ever does, take a swig- Whenever Ever throws herself a pity party, take a swig (ya know, her family used to like parties...) - Whenever Ever dreams of Damen, take a swig - Whenever Damen and Ever declare their undying love for each other, take a swig- Whenever Riley is annoying, take a swig - Whenever you find a Twilight rip off reference, take a swig (man, I’m harsh!) - Whenever you feel the urge to run out the nearest window because you’re reading Evermore, take Cymbalta a swig - When (or if) you finish Evermore, take a swig, because you, my friend, conquered this monstrosityCongratulations! You’ve made it this far and finished the Evermore Drinking Game! (And if you haven’t that’s either because you’re too drunk to function and in intensive care, in the bathroom doing only god knows what, or dead.)Well, wasn’t this game enjoyable! If one thing’s for certain, it was more enjoyable than Evermore."}, {"userName": "shady boots | #20gayteen", "userReviewDate": "Feb 13, 2011", "userURL": "http://www.goodreads.com/user/show/4972138-shady-boots-20gayteen", "userReview": "Edit (04/01/2018): Commentary from Present Day MeOh man, sixteen-year-old me was so angry lmao. Bless his soul. This review was fun to look back on, since I actually did read the entire series. All six books, all terrible. I guess this was also during my Brony phase; I noticed the Rarity GIF immediately. This series was one of those ones that offended me with how bad it was, if I recall correctly.My old review (somewhere around 2012):Hokay. So. Instead of reviewing the book, I've decided I'm just going to review the whole series right here.It is, and I say this without even an ounce of doubt, the worst series I have ever read. Of all the worst things, this is absolutelyThere will be spoilers in this review, but you know, who the fuck cares?I wasted my time reading this whole series, because it was basically for nothing. I recently realized that all of Ever's \"struggles\" in this series are only for the sole purpose so that she can break the curse that's been preventing them to have sex. Thus eventually having sex. Which they do, in the last book's ending, predictably.Ever is the stupidest heroine in the history of YA. Every book ends with her making stupid choice after stupid choice. In Blue Moon, she listened to the bad guy, thus unleashing the curse that I was talking about earlier. In the third book, she chose to save her \"best friend\" Haven (who was actually a poser bitch that was barely even nice to her) over curing the curse, and by saving her she made her an immortal as well, which I could not get over cause she was insufferable enough mortal. And whadaya know, she turns into the villain in book four. Shocker.And then of course, there's Damen Auguste. Arrogant, muscular, perfect, rich. He can paint better than Picasso. He's absolutely perfect and flawless in every way possible. He's also a controlling and selfish douchebag that irritates me to no end. Honestly, that's why he and Ever are perfect for each other. Because they're both so equally annoying.And this curse thing. God, it dragged on and on for like four books with no resolution. Basically, at the end of book two, Ever listens to the villain─yet another example of her utter stupidity─and ends up getting tricked by him. Sure, she cures Damen of this \"disease\" that the villain put on him, but there's a catch: they won't be able to touch or \"transfer DNA\". Meaning, they won't be able to fuck. Of course, Ever is all freaking out about it cause she thinks that if they don't fuck sooner or later Damen will leave her, since all hot guys are like that, aren't they?Throughout the rest of the books, all Ever wants is to get the antidote, but due to her making stupid choices in every book, it never works out. And I think during book three or four or something, Damen starts to be a little more minimalistic─dressing less fancy, getting rid of his expensive car, etc─and you know what Ever does?She whines about it.Damen is actually making an effort to get rid of his cocky, arrogant self─to be a \"better person\" if you will─and you whine about it? My god, do you guys SEE how absolutely ridiculous her stupidity is? I wanted to just reach into the page and knock some sense into her.But back to the whole antidote thing, when I saw the cover for book five, Night Star, I thought \"Wow, is she finally going to get that stupid antidote already?\"And you know how she gets this \"antidote\"? She doesn't. It turns out that there's this magical tree with a magical fruit that when you eat it, it makes you \"truly immortal\". In other words, able to fuck. And no, unfortunately I did not make that up, it's actually how it goes.So in the end, they do fuck. And that's it. Done. Ever claims that they're now \"truly together\" and everyone lives happily ever after.So what was the message Alyson Noel gave? You have to have sex with someone to be \"truly together\" with them. What a powerful, inspiring message for young readers everywhere. Bravo, Ms. Noel.To put it shortly, this series is about two selfish people who want so badly to bump uglies. Further, I think that this series is nothing but a waste. A waste of time, space, paper, pretty much everything you can think of. I still ask myself every single day why I ever chose to go through with reading all of the books. I'll never get back those brain cells I lost.You may say, \"Whoa, isn't that a bit harsh? It can't be that bad, can it?\" The reason why I may come off as very angry in this review is because it's not just the horrible kind of bad, it's the offensive kind of bad. The oh-my-god-why-do-you-even-exist-on-this-planet kind of bad. The entire plotline of the series in general is pretty much the piss frosting on top of the shit cake, because all this time I'd been reading a series that's solely about two selfish asshole teenage immortals who want to fuck that they're willing to do anything for it, the female one being more desperate than a thirsty reality TV star. That's all there is to it!This is not the type of shit that tween girls should be reading and fantasizing over. They should not take the message that this book puts forth about having sex with someone being the only way to prove your love or make a relationship last. It's just disgusting and wrong on so many levels, and I can't believe the gall of the author to implant this abysmal moral on young minds. That may have not been her goal; she may not have realized it, but I thought that it was crystal clear.So I advise you, dear reader: if you value your well-being, stay far far far FAR away from this atrocity. Don't make the same mistake I did. You still have the chance to save yourselves.Take it."}, {"userName": "Kiki", "userReviewDate": "Jul 28, 2010", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "Have you ever heard of Mini Pop Kids? You know, those thirteen-year-olds who fit 24 cheap covers of mega-hit songs on to 2 CDs and pedal them on horrifyingly gaudy adverts between episodes of real 70s Scooby-Doo on Teletoon Retro? (By the way, Teletoon Retro is the best channel on television. Check it out. It's absolutely brilliant. You can watch crappily animated suggestive vintage cartoons like Dexter's Laboratory and Top Cat and The Flintstones at 3 am with short commercial breaks. Love it? Yes.)Mini Pop Kids is basically the definition of pointless commercialism, and they're so shiny. I was not that shiny when I was thirteen. I had terrible acne and I wore too much eyeliner because I thought I was emo, and I really liked wearing these frumpy ex-nursing shoes to school. In front of people.See, this book is basically the Mini Pop Kids of the YA paranormal romance genre. It's this awful shiny, cheap knock-off written on really floppy paper. It's like the gas station version of Twilight - and that's assuming that it's possible for anything to be worse than Twilight. Is it possible to be worse than Twilight? It's not like the plot even makes any sense. Ever and Damen's romance just happens randomly, one night at a party (said party being an example of how aggressively Ever takes advantage of her aunt Sabine). It's pretty formulaic YA fare: smokin' hot Lothario and cloth-eared cardboard cut-out check each other out for a while, do a little stalking, and then Adonis tells Plain Jane how much prettier and smarter she is than all the other short-skirted sluts (!!!) at school and then they kiss and fall in eternal love within about one hundred pages. Blah, blah. And there's this painful \"gotta catch the girl\" pursuit in which Ever expresses strong disinterest in Damen, but he ignores this and continues to push against her until she gives in. According to this book, \"no\" means \"keep trying\".This is dangerous, and it is bullshit. If you're disinterested in someone, you have absolutely no obligation to pretend to be interested in them. If someone pursues you but you don't want to be pursued by them, it's 200% reasonable to tell them to go away, stop it, or leave you alone.I could wax on and on about the whole virgin/whore dichotomy that tears through this book like a bull seeing red but that would be a waste of time. We already know it's going to be a sexist, racist, homophobic mess. Why do we already know this? Two reasons. One? It's a New York Time Bestseller, and sits at the forefront of most bookstore YA displays, and apparently the prerequisite for both of these privileges is appallingly offensive content. Two? It was written by someone who lives in a world where it's perfectly fine and acceptable to pat rape culture on the back, fetishize people of colour, ridicule and commodify people within the LGBTQA+ community, and to use a woman's appearance, intelligence and sexual choices to degrade her. So let's not bother with the formalities of \"this is why it is offensive\". It just is offensive, and that's that. It doesn't take a genius to work out why.You'd expect a book with such shitty content to at least have some mercy and be properly written. It isn't. It's like fanfiction, all \"hel-lo!\" and \"totally\" and with the narrator using \"I mean\" as a prefix to about 60% of her inner monologue. It's appalling. It's like Marked, because it's not even fun to laugh at. It's just cringe-worthy in it's crappiness. Didn't I say this was a gas station Twilight? Well, it is!Speaking of the narrator? Ever's a piece of shit. That's basically it. She's a huge piece of shit. She treats everyone around her like garbage and then expects them to paw at her adoringly while she mopes in her hoodie, with no makeup on her face. Okay, okay. So you think you're a wallflower and you think you have some kind of really cool selfless tragic indie life. Cool story, bro. You can do the whole self-centered teenage thing if you want, but don't pretend you're some kind of saintly madonna of a character who doesn't buy into the petty fads of the whores around you because you're just too damn obscure. That's what this book tries to do. It tries to make Ever out to be this sympathetic holier-than-thou Christ metaphor but in all honesty she's just an asshole. (I also want to add that absolutely zero research was conducted into the world of psychic mediums. Psychic abilities are very specific, and you can't just lump them all under the title of \"psychic\". Ever can read auras and see ghosts and read thoughts and...yeah, it lost me. Reading thoughts? That's not a psychic ability. Psychics don't get their information by reading your thoughts. Telepathy is in a completely different ballpark, and it's just shit like this that proves how few fucks the author gives about authenticity and integrity in her writing. And not to mention the total lack of continuity surrounding the whole thing. Ever says she sees spirits everywhere and they wave at her and stuff, but she isn't at all bothered by this? What about people who died in horrible accidents? What about angry spirits? What about the mere fact that supposedly, everywhere she goes she sees these dead people walking around like they're at the fucking carnival? She literally mentions it once, and then never again. The fact that she can see ghosts wandering around doesn't even factor into her daily life. How can this even be?)Listen, because here's something this book won't teach you: you aren't better than anyone else because you've had hardship in your life. Yeah, that sounds harsh, doesn't it? But it's true. Because you can't ever know what other people have gone through or had to deal with. And even if they haven't had any hardship, so what? Everyone is deserving of happiness. People who have average, painless lives aren't less \"street\" than you and they don't deserve to be shit on from a great height by people who've been through the wars. If you've had pain in your life and you know how it feels to be truly unhappy, then where the hell is the logic in wanting to inflict that on some content stranger?Needless to say, Ever doesn't get this. Does she have to scorn Haven and Miles? Does she really have to invade other people's privacy using her mediumship and then proceed to critique their character based on their private thoughts? What goes on silently in someone else's head is seriously none of your business. Does she have to be a huge brat to Sabine, who has also lost family members? Sabine is grieving too and Ever is old enough to realize this. She has lost her whole family and she has survivor's guilt, and you can't expect someone to be whole and cheery with this sort of weight on their shoulders, but Ever's not a little kid. She's not a tiny child who doesn't know what death and grief is. She's big enough to be able to empathize with other people.Back to no means no: if your friends try to force you into a relationship with someone, or try to force you to confess to being interested in someone that you are not interested in (like Haven does to Ever) make some new ones. If someone scares you and makes you uncomfortable, get away from them. This is an actual problem that this book normalizes - women putting up with shit. Ever puts up with being badgered into acknowledging Damen constantly. This is pretty much a phenomenon within YA. In fact, it's a phenomenon within society in general. This is what we're taught: don't be a bitch, or a prude, or the angry girl. Just humor him. Smile, be a lady.No. Fuck that. Listen - this is serious. If you are not interested in someone, or someone is making you feel uncomfortable, you are not obligated to be polite to him. If some dude comes and sits next to you on the bus and badgers you to talk, you do not have to put up with it. You do not have to talk back. You do not have to \"be a lady\" and let him enjoy frightening you.If a dude sits next to you in class and makes comments about your body, you do not have to sit there, silent and ashamed.If a dude asks you for your number and you don't want to give it to him, you do not have to pretend to forget it, or give him a fake number to avoid an argument.If a dude touches your body or your clothes in a way that makes you uncomfortable, you don't have to make the effort to move or pretend not to notice it. If your dude boss calls you \"crazy\" you don't have to laugh it off and take it on the chin.If your dude friend fetishizes your sexual preferences, your clothing and your body size, you don't have to try and twist it into a joke or pretend to enjoy the attention even though it makes you feel sick.(I have experienced all of the above scenarios and more.)Say \"fuck off\". Say \"leave me alone\". Say \"I don't want to give you my number\". See, this is the fucking problem with so many YA books like this one. \"No\" is being muddied. It's being replaced with \"maybe\". YA is telling young women that \"no\" means \"try again later\". It's this whole predator/prey formula that prowls around YA like a fucking snake in the grass, etching the gender binary in stone. What's it telling young women? Be pursued. Even if you don't want to be. That's what you're there for. To be looked at, to be touched, to be courted. To be prey. And the vice versa is what it is telling young men - you're the predator. Push, shout, beat her down. She's yours to look at, to touch, to court. If she says no, don't respect that. Don't respect her at all. Just keep pushing. Eventually, you'll wear her down.That's not consent. That's coercion. But hey! Talkin' 'bout those \"blurred lines\"!And the cycle goes around and around, getting tighter and tighter, more and more ingrained in society, until we don't even know it's happening. Until we don't think twice about sitting on a bus silently and passively while some guy stares at us from across the aisle, licking his lips and make obscene gestures with his hands. Until we don't say no for fear of being the bitch who broke the binary.I am almost done with YA, especially paranormal YA. It's just the most problematic shit. How can we all be putting up with this? This is fucked! This whole genre is fucked!I need a drink."}, {"userName": "Clair", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/3333119-clair", "userReview": "Evermore is a wonderful book. No, seriously, I mean that. Disregard the one star rating I've given it and hear me out, dang it! It's wonderful in the sense that it makes Twilight look like a masterpiece of literature. In fact, Evermore is a terrible rip-off of Twilight in the same way that most of the really popular YA novels from 2005-2010 were. Girl moves to a new town. Girl meets boy. Boy turns out to be a vampire/werewolf/fairy/some other mythological being that the author clearly only researched through Wikipedia. If you thought Bella Swan was an annoying protagonist, then wait until you meet Ever Bloom. I despise this character with the heat of ten thousand suns going into supernova. She is hideous. Absolutely hideous.Her friends, and her love interest Damen for that matter, aren't that much better either. In fact, I don't remember liking any of them. Whenever I put the book down, I tried to remember any characters I liked. And it ended up being like this: So, gentle readers... Are you ready to hear a story? In fact, it's a beautiful tale as old as time itself. Are you sitting comfortably? Then I'll begin. Once upon a time, there was a girl called Ever Bloom. Quite why her parents named her this is a mystery that reminds me of my good friends Jack Ripper and Annette Curtain. Anyway, she was pretty, and popular, and your stereotypical ditzy cheerleader. One day, she was out for a drive with her family, and their car crashed into a tree. Her parents and little sister didn't survive, but Ever did. The resulting trauma gave her psychic powers, such as clairvoyance and aura reading. And also being able to stroke her fingers across questions on exam papers and get all the answers, as well as touching books and having the entire story appearing in her head. Wow. If psychic powers are gained that easily, I think I'm going to crash my car into a tree. Wish me luck! (Disclaimer: V does not condone deliberately driving cars into trees and nor will she attempt this. She still eagerly waits to gain superpowers from the nearby nuclear power plant, though.) Now, suddenly losing everything is a horrible thing to go through (not that I have personal experience), and Ever has every right to be sad about it. However, unlike most orphans, she actually has a relative who cares enough about Ever to rearrange her entire life around her next-of-kin, and doesn't just sign her over to a foster home. Yes, Ever has an aunt called Sabine who is an incredibly wealthy lawyer who is almost never at home. Yet for some reason, Ever whines that she feels Sabine doesn't give her enough freedom. You know what else Sabine gives her? Well, aside from buying a house in California ('exile' my arse) with a gorgeous beach view, Sabine gives Ever an entire annex of the house, with all the mod cons. A dishwasher, a kitchenette, a plasma TV, a new computer, pretty much everything. This apparently restricts her freedom. Even though Sabine is almost never home.  But of course, any time anyone does something nice for Ever, she whines about it.  So even though I'd be through the roof if I were an orphan and learned that a relative cared about me enough to move across the country and give me an extremely privileged lifestyle, Ever whinges about it ad nauseam. You know some orphans who actually deserve to be sad about the death of their parents? The Baudelaire siblings from A Series of Unfortunate Events. And the only relatives I remember who genuinely cared about their welfare were Uncle Monty and Aunt Josephine from the second and third books. I know people going through bereavement have every right to be upset, but Ever is possibly the mopiest, most pessimistic characters I have ever seen in any book. She constantly wonders why people are horrible to her, and her mood swings are enough to cause the reader whiplash. Apparently, her sister Riley hasn't yet passed over to the other side, so Ever occasionally has conversations with her fashionably-challenged (who the hell thinks wearing a bright pink Juicy Couture tracksuit is a good idea?) dead little sister. When fellow psychic Ava tries to help Ever with her condition by telling her it's okay, she doesn't have to feel like an outsider, etcetera, Ever throws the mother of all hissy fits and tells Riley that Ava is a charlatan. Even though later in the novel, Ava actually helps Ever to form a psychic shield and how to block out certain thoughts. Isn't Ever a wonderful character? Anyway, let's go back to the story. Ever basically turns herself into a 'freak' by always dressing in a natty hoodie which is always pulled up. She accessories this with a pair of sunglasses and an mp3 player that's always cranked up to the loudest setting. It's quite the transformation. A transformation that isn't actually allowed in most educational institutions, since sunglasses and hoods are not allowed to be worn in most schools, and I would personally slap the shit out of Ever if she came to sit next to me with her music playing loud like that. Having it up so loud is just incredibly selfish to the other students, whether you're some walking ball of angst or not. So, it's no wonder that nobody at her new school likes her except for her fellow 'outcasts'. And oh man, these Outcasts. They're called Haven and Miles, but I like to refer to them as Goth Stereotype and Gay Stereotype. Because that's exactly what they are.  Haven is described as a goth who is doing the 'immature' (in Ever's eyes) thing of suddenly dressing in black and listening to all the music her parents can't stand and covering her once-preppy bedroom with the posters of heavy metal bands. Yes, because it's totally immature to try and figure out what your image is at high school, be it goth or prep. And I wouldn't take any advice about maturity from a girl who acts the way Ever does. Miles... holy shit, Miles. Miles is horribly written. He's always making sassy quips or doing theatre group or texting his new boyfriends. It just comes across as awfully stereotypical. I know several gay guys, and none of them come across the way Miles does. In fact, was Sassy Gay Friend (from Second City Network) around in 2009? Because that's what Miles comes across as. Oh, how I wish he'd called Ever a stupid bitch... Anyway, since this novel is a massive rip-off of the Twilight series, we've got to have an Edward Cullen show up some time or another. Damen Auguste gets some kudos from me, because at least he doesn't reach the creepy heights that Edward scaled over like a mountaineer in a pair of rocket boots. Damen and Ever meet in a biology lab an English class one day, and the school bullies who Ever now scorns wonder why the hell he'd choose her. Ever, however, is surprised to find that she cannot read Damen's aura at all. And in a shock revelation, she remembers that the only people whose auras she cannot read are... already dead. So, rather than just assume it's a fluke and that some people just don't have auras, she does nothing for ages, then when she gets serious with him, she breaks into his house and discovers that he has work from Shakespeare, and personal paintings from Picasso, among others. Le gasp. I wonder where those must have come from. So yes, Damen is an immortal with the ability to cross over into the plane where souls reside before being judged. No wonder she couldn't see his aura! There's also some lame drama in this book with Damen's ex-wife Audrina which comes across just like drama for the sake of drama. Just like Katherine's story in The Vampire Diaries, am I right? Ugh. To hell with this book. So, to conclude this (because I can't believe I've written nearly five pages about this dreck), it's a badly-written novel with some utter unlikeable characters, a main character who doesn't deserve even the minimum amount of coddling for her sad situation, and I'm shaking my head at how it became a bestseller so quickly. 1/5.(This review is also available on my blog: http://book-wyrm.blogspot.co.uk/2012/...)"}, {"userName": "Mel", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/3830243-mel", "userReview": "No. Just no. Absolutely not. I could NOT continue this book. The only minute thing I found interesting was that the car accident managed to knock the dog's balls off somehow. Other than that, I couldn't stand any more. No no no no no. Hell fucking shit no."}, {"userName": "Haleema", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/4336293-haleema", "userReview": "Back when I read this book, I didn't know what snark was. Now that I do... hehehehehehehe... Now that I do and now that I remember everything that bothered me about this book, I shall write snark. Yes, I shall.Mmmm.... snark....So let me explain what I thought I was reading with this excellent meme. Ah, yes. How Ever utterly reminded me of Bella Swan, I cannot explain in this review. I just cannot. And how Damen reminded me of Edward Cullen, I cannot explain in this review. I JUST CANNOT. The resemblances are ridiculously striking. Noel's hero must be Stephenie Meyer, right? I think so, too. The writing:Holy crap. How did Noel not see how absolutely dreadful her writing was? She must be stupid... or blind. Maybe a mixture of both. - \"I bit my lip hard...\"- \"I pressed my lips together.\"- \"I bit my lip hard...\"- \"I pressed my lips together.\"I swear I knew more about Ever's lips than Ever herself. I'm sorry. Such a crappy review that revealed nothing about how the book was. I know, but I honestly cannot."}, {"userName": "Tatiana", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Having satisfied my curiosity about this popular YA series, I can safely scratch the rest of the books (and their author) off my TBR list forever.The book starts off OK - mind-reading, auras, family drama, but very swiftly becomes just another pathetic Twilight rip-off. Same worn out story of an insecure girl falling for a mysterious/sexy/dangerous paranormal guy, same absent adults, same \"love\" without really knowing each other, same focus on outer beauty and expensive things, same gazing into each other's eyes, and same chaste sleeping in the same bed. Well, you know the drill.The characters are flat, unrelatable, stupid, and acting out of character whenever it is convenient, the relationships are shallow, the style of narration is juvenile, the mythology is full of holes, the story itself is boring, unoriginal, unexciting, and full of clichés. Pretty much, a waste of time. Putting this next to other mediocre Twilight rip-offs \"Shiver\" and \"Hush, Hush.\"Reading challenge: #1 - E."}, {"userName": "Mallory Kellogg", "userReviewDate": "May 26, 2012", "userURL": "http://www.goodreads.com/user/show/9520263-mallory-kellogg", "userReview": "This book warrants a full-on, GIF-ridden review. You've been warned.Let me start out by saying this:So.....We have Ever. Yeah, EVER. Who names their kid EVER?! (There was also Honor, Haven and Stacia, but I digress.) Anyway, who would play Ever in the movie? A light switch. Think about it. She loves him, she hates him. She loves him, she hates him. She loves him, she wants to barf at the sight of him.So she almost died and now she has psychic powers. Which, by psychic powers, she means \"being restricted to only wearing hoodies, acting like a total loon, constantly treating your friends like shit, going deaf on heavy metal, and generally being a lacking human being\". How does anyone deal with her kind of crazy? Throughout the whole book, I never did get why she kept thinking psychic powers=hoodies.Then we have Damen, with an E. Not Damon, with an O.See, even Damon with an O thinks that's dumb. Oh, and Damen's last name is Auguste. Was somebody really trying to recreate a Salvatore brother? Hm? Got a nice Italian/Spanish sounding name and dark hair....and viola! Now, he's an \"immortal\". But he drinks weird red shit (which is never fully explained and being red, sparkly and keeping him immortal I can only assume is magical unicorn blood), screws with people's heads, is insanely fast and strong, is psychic, and down-right creepy. So, I'm sorry, Noel, but you just invented the vampire. Good for you. Idiot.And he falls for the emotionless, creepy loner girl that is gorgeous but doesn't seem to notice, ala Edward Cullen. And thus the selfish stupidity ensues. He flirts with her, then her worst enemy, then her, then the enemy again. Then a bunch of pointless teenage drama happens. They make out. She decides she hates him because.....???? I never could follow why she hated him half the time. Because he didn't give up his phone number....??? Somebody dies. Ever worries more about Damen than the dead girl. Her best friend almost dies. She worries more about Damen than the best friend. Oh, and let's not forget she's seeing the ghost of her dead sister and kinda holding her hostage, saying things to the tune of \"I can't lose you too! I know you're giving up Heaven and our parents, but STILL! I need you here! Deal!\" I haven't seen this much selfishness since....uh....Twilight. And that brings me around to the Twilight rip-off checklist:1. vampire (oops, I mean immortal)- check2. human love interest- check3. mind-reading- check4. emotionless main character- check5. stupid red-haired bad girl bent on killed MC- check6. strange lovey feelings near vampire (immortal. whatever)- check7. MC hating her life and being ungrateful of everything and everyone- checkI'm sure there's more, but you get the point. If you take a shot for every similarity, you'll be dead in minutes.I hated this book. Especially when it came down to \"the power of love\" saving the fucking day. Yes, we pulled a Halo and love wins the war. Damen's wife, I repeat WIFE, is angry he's in love with someone else, (shocker!), and Ever kills her. (Granted, Drina was a crazy bitch, but she WAS married to Damen and all.) She punches her in the chest, the heart chakra, and it kills her because she's lacking in love (and Ever has so much?). I. Just. Stared.Somebody thumped an immortal's breastbone and she croaked. No, there's no punchline. I didn't make it up. This shit really happened. A 600-year-old immortal (vampire. whatever.) got taken down by a whiny little teenager with a girly punch.And what was Damen doing BOTH times Ever (the supposed love of his life) was fighting for her life against his wife? Not coming to her rescue until he was \"sure\" she really wanted to live. Let that sink in: he refused to come save her until she voiced, and voiced believably, that she really didn't want to DIE. Your wife is beating the shit out of the woman you love, and you don't DO ANYTHING?The whole story made me sick. It made no effing sense. Summerland. Sparkly red drinks. Damen screwing with her memories and trying to convince her she didn't really see him bleeding her bestie on the living room rug. The power of LOVE saving the day. SMHEver has some pretty serious trauma to deal with, but every time someone offer her counseling, help with her powers, a shoulder to cry on, she flips the fuck out and gets defensive. Like helping her NOT be a nut is the worst idea on the planet. Like the other psychic who is trying to help her let go of her guilt is the BAD GUY. Instead, she chooses to self-medicate with vodka, drive drunk and get expelled. I wanted to smack Ever. With a fish. Plus, the story was so easy to figure out I didn't even have to finish the damn book to know what had/would/was happening. There was no real surprise, although the acid-induced Summerland place was a bit of a weird shocker. More like a scene thought up while high than anything relevant. To sum it up, this book made my angry. Ever was ungrateful, bitchy, emotionless. I can't figure out how Damen is in love with her (insta-love, of all things). And Damen is the Edward Cullen-wannabe, creepy, sneak-into-your-room-and-watch-you-sleep kinda stalker.The other characters were rather pointless.In conclusion: What I wanted to do when I finished this stupid book:"}, {"userName": "J.D. Stroube", "userReviewDate": "Feb 20, 2009", "userURL": "http://www.goodreads.com/user/show/1857647-j-d-stroube", "userReview": "I absolutely loved this book. It is a bit of an easy read, but well worth it. I felt as though the author had taken some of my favorite young adult books and blended them into one solid story. This is basically a young adult romance novel with a supernatural twist. It had some humor peppered throughout it, but it was mostly just sweet. Damen was an interesting character, but he did irritate me with the Drina situation (I won't say more because I do not want to spoil it). I completely recommend this book to anyone who enjoys a good YA supernatural romance."}, {"userName": "Evgnossia O'Hara", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/43416866-evgnossia-o-hara", "userReview": "Review to come!"}, {"userName": "♔ Leah. ", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/4474199-leah", "userReview": "I have heard a lot about this book- reviews ranging from \"amazing\" to a rip-off of Twilight, any way continuing with this tragic epic tale in which I have lost brain cells and I am warning you that what you read ahead is not for the easily offended as it does contain a lot of rage, incoherence and strong language: Anyway, like most typical, shitty YA novels- it starts off with a boring, emo girl who is a ~speshul snowflake (because we are severely lacking some of these in the YA genre, of course) angsting on about the curse of her powers! “Oh how horrible it is to know that my powers actually make it obvious about what people are thinking about me even though I am such a dumb bitch that I am not able to tell that if some bastard is stalking me; I should really call the police because it is classified as creepy.” And of course how she went from an amazing blonde cheerleader with the perfect boyfriend. So perfect that she was oblivious to everything around her since no-one existed except for the people that were involved in her perfect life. Until one night, her family are killed in a car crash but only she survives, saved by an unknown stranger who you already know who the fuck it is and she gains some fucking magical powers which is useless and stupid just like everything else in this stupid book. She seems to think that her family’s death is her fault yet she lives in a big house with a Jacuzzi, pool and the luxury life - OH HOW WOE-FUL! Also she listens to the Sex Pistols because her taste in music is so ~fetch and she has the Goth friend called Haven and the stereotypical gay guy friend called Miles.Oh should I also mention that her name is Ever Bloom (because she needs a unique, special name damn you! Even if it does make her seem like \nOrlando Bloom’s\n long lost sister or maybe hint that her parents were avid gardeners). Continuing on with this epic tale of fuckery, in Ever’s English class (English? I thought this was a Twilight rip-off therefore set in a Biology class, is Noel for the first time not following a cliché?), the new boy sits next to her, obviously! How dare a fugly motherfucker sit next to Ever dearest? Meet Damen Auguste- your typical; run of the mill boring, basic asshole who is good at everything… Apparently Damen is quite the hot shit- causing one dimensional characters and even the token gay guy and Goth “all squealing over him” because all high school students are the equivalent of pigs. Then when she stops PMSing and wangsting- Ever finally catches the sight of Damen, who apparently is so fucking good-looking that she stands there like some toad and describes him with so much thesaurus rape and purple prose that it gives me a migraine. Damen Auguste- how can I describe him? He could beat Edward Cullen in \nMr. Gary Stu\n contest without batting an eyelash- apparently he was best friends with Emily Bronte, Shakespeare & other important figures of Western culture and just when you thought he couldn’t be more of a sue than he all ready was- HE CAN PAINT PICASSO BETTER THAN PICASSO HIMSELF!But then Ever gets all jealous and hurt because he flirts with a typical bitchy Barbie that you usually get from Southern California, because Alyson Noel bases it ALL on stereotypes, and that she isn’t the one who he gives a white rose to but a ~plain tulip. Honestly? Is she this much of an attention whore? Jealous of a guy who isn’t even her boyfriend? I cannot believe that every single fucking YA heroine needs a man in order to make themselves hold their shit together? I am seriously disgusted. Additionally, have you noticed how I am rarely talking about the plot? Oh yeah, silly me, there is no plot:- after all the stalking, falling in love lust with each other, and a whole load of bullshit we realise that their relationship is in danger (by relationship I mean getting each other laid) because his evil, crazy ex is back from his past life is hell-bent on ruining their epic tale of luuurrvveee… I hated the characters. Ever had no personality, merely a shell so the reader can easily fill her shoes and orgasm over the asshole that is Damen Auguste, she is a huge Mary Sue and her powers contributed nothing to the storyline and was hardly mentioned, therefore I don’t understand why Noel had to give her powers… Oh wait… Ever has to be super speshul! Also, I completely hated the fact that every single character in this book is a walking, breathing stereotype- Haven being the typical Goth who is shallow, being such a good friend that she gets pissed off at Ever for stealing Damen, then goes off with strangers and get’s herself in a whole load of shit. I couldn’t sympathise with her at all, it doesn’t take a rocket scientist to figure out not go with people who you are not familiar with. Ever heard of stranger danger? Never mind, none of the characters has any form on intellect in this book.Miles- again it seems apparent that Noel has never met the gay community so she bases it off stereotypes- his gay characterization was done horribly wrong, so badly done that if he met KURT Hummel- he would have been bitchslapped. Damen Auguste- he is a complete sissy and an assholian dickhead, first of all: he is a complete cocktease with the amount of times he flirts with Ever (with all those fucking tulips- I AM LED TO BELIEVE HE HAS SOME SORT OF FLOWER FETISH) then cuts her off. He is a terrible boyfriend: lying to her, and then dumping her ass like a million times on her own (and being the dumb bitch that she is, she runs back to him) then apologizing with stupid, cheesy fucking lines that should belong in a Harlequin novel. Also, if some guy, I don’t care how good-looking (even if he does look like Ian Somerhalder)- comes into my room, reads my thoughts and keeps on telling me that we belong together- I’d get a fucking restraining order on him and get him deported. Every other character? No personality, useless, boring etc… Hell, even the villainess was a huge yawn. The writing wasn’t anything special- I felt that Noel didn’t do much to explain, plus the mythology was terrible. Damen is not even a vampire (even though he doesn’t eat anything, but does drink some red liquid and drink her friend’s blood- how silly of Ever to come to that conclusion!) along with the re-incarnation crap. Don’t read this book unless you desperately want migraine inducing material. I honestly felt each of my braincells dying one by one."}, {"userName": "Kristi", "userReviewDate": "Oct 31, 2008", "userURL": "http://www.goodreads.com/user/show/1310688-kristi", "userReview": "I’m not surprised that I devoured this novel. I’m a fantasy junkie, what can I say. I’ve been pinning after this book for what seems like forever, so of course I had high standards. And honestly most of them were met, there were a few things that I would have loved to seen Noel elaborate on, but overall I was utterly and completely satisfied. Let’s start with characterization. Ever was a solid character, I got her guilt, I understood her struggle, and her name is Ever.... could that possibly mean she lasts forever. Secondary characters were a little flat to me, I felt like Miles was a stereotypical gay male character, I would have liked to have seen him a little more three dimensional. Damen is, hot, yes... but what is his story?! I’m hoping to learn more about him in the rest of the series. He hasn’t really impressed me much yet, but that may change. Drina as the antagonist, it think maybe my biggest complaint, the whole explanation sort of wrecked the ending for me. You’ll just have to wait and see, because I don’t want to elaborate to much on it. It’s actually one of the things I wished Noel had elaborated on a little bit more. Too far fetched maybe, or just possibly just a lack of explanation. I loved the story itself, the plot was engaging, I really had no idea what was going on. I kept waiting for one big revelation, but really it’s just revealed piece by piece which was a welcoming change of pace. The writing was marvelous! Impressive imagery! It was customary to find myself lost within the novel. \t\tI cannot wait to read the rest of the series! There is a sneak peak of the next cover in the back of the novel, and it looks spectacular! I only wish it was in color."}, {"userName": "Hina", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/4696625-hina", "userReview": "I told myself that I honestly wasn't going to read this book after my friend, Aysha, came up to me one day just praising the book. I read about twelve pages and then gave up, I had enough of all things with the words dark and romance in it after reading Twilight. Nonetheless, I just saw this book sitting on a shelf at my local library and the prospect of making a bad review about it on Goodreads just made me happy, so here we are. There might be about one or two spoilers in the book, but don't worry it won't spoil anything. It would be better to read a review than the book. So we're introduced to the main protagonist, Ever Bloom, who is basically a pathetic, vain, stupid twat. She was moved to a new school after her parents, sister and dog died in a car crash, now ever since this car crash she has the power to see the people's auras and know what the person's thinking with a touch. In other words she's a psychic, but they're extra features to this too. She is so 'distraught' by this she has a complete change of personality, from being insanely popular at her old school and then just hanging out with two vain, shallow and vaguely important people, Haven and Miles. I guess we're actually meant to feel sorry for her after all she's been through, but no, I haven't even got a teeny tiny bit of sympathy for her. We are then after about 12 pages introduced to Damen. He is the worst bloody character out of the whole book. That arsehole comes up to the school as a new student and everyone and I mean everyone is practically drooling at the sight of his good looks except one effin person and I'm sure you can guess who that is. Ever decides that she's not going to look at him because she can just listen to everyone's thoughts and is basically not interested. They are forced to sit next to each other in class (To any people who have read Twilight, I wonder where she got that from xD), they accidentally touch and Ever feel so normal (wouldn't you be freaked out?) because she can't listen to his thoughts. He flirts with her and at lunch he ends up sitting at Ever and her friend's table. After a while Ever and Damen form a 'relationship' out of god knows where-there are many parts in which our dear author here submits bits of information without us knowing, it's either that or I was too bored to notice. I also put relationship in speech marks because you cannot call it a bloody relationship. One minute we see Ever calling Damen a player and the next she's sticking her tongue down his throat. Eh? Wouldn't you be disgusted if you saw a boy that you liked being seen with another girl (even after he said he liked you) or the fact that when the two of you go out somewhere he keeps disappearing. The EXACT same thing happened to Ever but with one of Damen's hot, smoldering, sexy looks or touches Ever just melts like an ice lolly. Yep so the rest of the book is utter bullshit which encourages things like cheating, drinking vodka at sixteen, betting and much more stuff. But what I've just told you is nothing these are the things that I hate the most in the book: 1) It's sooo convenient.Oh yuss, Immortals can see people's aura's (WTF?), they are super strong, they are super fast, Ever's reincarnation, immortal serum made long long ago and many more that I have forgotten.2) Damen is described as the most perfect person in the universe. He can cook, clean, is handsome, can surf and many more things that I've forgotten, but how can a person be perfect, be talked about as perfect when there is no such thing as a perfect person. Even though he is 600 years old (wow and Ever is completely normal with that) he cannot possibly have mastered everything. It's just impossible. See The Doctor in Doctor Who is about 907 and something and he is far from perfect. Everyone knows that perfect people are boring. 3) Tulips and Summerland. When reaching the middleish part when Damen just starts to pull out hundreds and hundreds of tulips out of nowhere I was actually starting to think that he actually took his time to pick the tulips and rain them down on Ever, but the world would be in a massive crisis if it did. So dear Alyson Noel decides to make this rule which is basically you can conjure something from nothing. It doesn't make any sense, it's another convenient thing.4) Alyson Noel. The writing is poor and she hardly describes things, she tells us rather than shows us. Also the fact that she's mentioned some points in her book like Ever having no backbone and Damen being perfect etc and she's done nothing to improve it is just sad. To sum this review up I'll have to say that Ever is slightly better than Bella and Edward is slightly better than Damen, but Twilight and Evermore are just very very similar books. I advise you not to read either."}, {"userName": "Maria V. Snyder", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/1629797-maria-v-snyder", "userReview": "I'm listening to this one. I'm about half way and getting annoyed by how clueless and self-absorbed Ever is. She has a right to be in the beginning, but the time has passed for her to \"wake\" up. Plus she's mean to her little sister, considering what happened to Riley, she should be A LOT nicer. I'm willing to keep listening. The actress/reader is excellent and I'm thinking that I might not have lasted this long if I were reading the book...but that's a hard one to call :)Ugh - I did finish and it was a struggle - between the villian's monologing and Ever's flip floping and whining, I almost called it quits a number of times. By the end I was routing for Drina (not a spoiler because...duh!). Needless to say, I won't be reading any more."}, {"userName": "Μaria Vrisanaki ", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/33193128-aria-vrisanaki", "userReview": "Για να πω την αλήθεια, τα πρώτα κεφάλαια με είχαν ξετρελάνει!!! Όσο διάβαζα, σκεφτόμουν: “Ωωωω πεντάρι!” Δάκρυσα στην πρώτη σελίδα. Πρώτη φορά σε βιβλίο! Από τις πρώτες σελίδες ερχόμαστε αντιμέτωποι με τον θάνατο, συναντάμε το υπερφυσικό στοιχείο, μετά γνωρίζουμε και τον Ντέιμεν, οπότε ενθουσιάστηκα περιμένοντας να μπούμε στο ζουμί της υπόθεσης. Αν γίνονται αυτά στην αρχή, ανυπομονούσα γι’ αυτά που θα γίνονταν παρακάτω!Στην πορεία όμως ο ενθουσιασμός ξέφτισε. Το πρόβλημά μου ήταν κυρίως η Έβερ. Πήξαμε στην αδράνεια και την αναποφασιστικότητα για να έχουμε κάτι να ασχολούμαστε. Αντιλαμβάνομαι ότι αυτό που περνούσε η Έβερ ήταν ζόρικο. Τα είχε χάσει ελαφρώς, αλλά υποτίθεται πως έζησε κάτι έντονο με τον Ντέιμεν, κάτι που θα την έβγαζε από τη μιζέρια όχι που θα την έχωνε βαθύτερα σε αυτή. Βέβαια θα μου πεις έρωτας είναι αυτός… Πώς γίνεται όμως να λέει ότι αγαπάει κάποιον τόσο, μα τόσο πολύ κι όμως να τον παρατάει ΔΥΟ, όχι μία αλλά δύο φορές; Και γιατί; Το γιατί με ΚΑΕΙ! Ούτε καν για το καλό του αγαπημένου της, αλλά για να ζήσει, λέει, μια φυσιολογική ζωή.Δηλαδή με τις φούστες και τις μπαλαρίνες, με φίλους που την ψιλοεγκατέλειψαν ήταν πιο ευτυχισμένη; Εδώ κοπελιά οι γυναίκες ψάχνουν τους άντρες με μεγεθυντικό φακό κι εσύ διώχνεις το κελεπούρι που σε ψάχνει τόσες εκατοντάδες χρόνια; Θα τραβήξω τα μαλλιά μου και δεν έχω περιθώρια γιατί ήδη μου πέφτουν με την αλλαγή εποχής!Ήθελα λίγο περισσότερο δυναμισμό. Να πάρει η Έβερ τη ζωή στα χέρια της! Δικαίως ήταν πελαγωμένη, όμως από ένα σημείο κι έπειτα για μένα τουλάχιστον καταντούσε κάπως κουραστικό. Και εκεί που αποφάσισε να δείξει πυγμή και σκέφτηκα κι εγώ “τώρα Ντρίνα τη γαμ…ες”, να απολαύσω λίγο θέαμα… έληξε τόσο γρήγορα το θέμα, που ξενέρωσα. Όση ώρα χρειάζομαι για να ανάψω ένα σπίρτο, άλλη τόση και κάτι παραπάνω χρειάστηκε η Έβερ για να εξολοθρεύσει τη Ντρίνα στη μεταξύ τους αντιπαράθεση. Μου έλειψε η δράση, που εδώ είναι ελάχιστη. Το μόνο σημείο που υπήρξε περισσότερο ενδιαφέρον και με ξεσήκωσε ήταν η εξομολόγηση της Ντρίνα.Α, μιας και το ανέφερα, η Ντρίνα ήταν πολύ καλή σαν κακιά! Δεν θέλω να τελειώσει έτσι. Δεν πρέπει να τελειώσει έτσι. Απαιτώ επανεμφάνιση!Ο Ντέιμεν αν και γλυκός, τρυφερός, ιππότης, χαρισματικός και κούκλος, του έλλειπε ώρες-ώρες λίγο νεύρο. Ας πούμε στα σημεία που η Έβερ ήταν αναποφάσιστη, θα ήθελα ο Ντέιμεν να γίνει λίγο πιο δυναμικός, να επιβληθεί με όμορφο τρόπο. Στην τελική να της βάλει και δίλημμα. Σιγά μη σε περιμένουμε και σ’ όλη μας τη ζωή κοπέλα μου! Θέλεις ή δεν θέλεις???? Έχει και η υπομονή τα όριά της! Να δείτε μετά πόσο αποφασιστική θα γινόταν η Έβερ. Αν και κάτι μου λέει ο Ντέιμεν κρύβει άσσο στο μανίκι του, οπότε επιφυλάσσομαι.Σε γενικές γραμμές το βιβλίο δεν ήταν άσχημο. Ήταν ένα ευχάριστο ανάγνωσμα, αλλά μέχρι εκεί. Ελπίζω το δεύτερο να είναι πιο εκρηκτικό."}, {"userName": "Tina", "userReviewDate": "Mar 14, 2009", "userURL": "http://www.goodreads.com/user/show/1420355-tina", "userReview": "I loved the supernatural romance between Ever and Damen. They might just be my new favorite fictional couple. Beside Ever's supremely stubborn side, I liked her. You got a real understanding for why she is so stand offish, why she's closed herself off from the world. Damen is a mystery. His hot and cold attitude (towards Ever) was frustrating yet, very intriguing. Wanting to put the pieces of the puzzle together is what kept me wanting more. I loved Riley, Ever's sister. Riley is unable to move on, out of fear that her sister needs her around. As she struggles with crossing over or staying with Ever ... Ever struggles with doing the right thing and letting Riley go. There are definite similarities to Stephenie Meyer's Twilight series but, this is it's own amazing story. This is not a Twilight clone. I'll probably upset some Edward fans but ... I'm a bigger fan of Damen. August 2009 is the release for the second installment, Blue Moon. August can't come soon enough.Would I recommend? Definitely yes. In fact I've already started lending my book out."}, {"userName": "Miss Clark", "userReviewDate": "Aug 04, 2009", "userURL": "http://www.goodreads.com/user/show/1467942-miss-clark", "userReview": "Ugh. Pretty well sums up how I felt about this book. Not very original. It is a Twilightesque book that manages to cover all the mistakes of that book and never even once hits a good note. The plot makes little sense. Girl dies. Comes back. Is psychic, can read minds and see auras and hates her life because she blames herself for her family's death in the car crash that very nearly killed her. Can also see ghosts. Is considered freak at school for the way that she acts and dresses, mainly all because she is trying to block out all the psychic crap. Friends with two other misfits, who as characters were not developed in any meaningful way. Enter Damen, an Immortal creep whom Ever (the girl)instantly develops feelings for and Damen in turn toys with her on and off for weeks.And, oddly, he is the only person whose thoughts she cannot hear. Oh, my! Where have we heard that before? She loves him, she loves him not, she loves him, etc. Enter the whole past lives thing, and it would appear that Damen has been chasing Ever (or some incarnation of Ever) down the centuries, only to have her killed off time and time again. Little does he realize that Ever is always being killed by his ex-wife, Drina Poverina. Big showdown and in some very deux ex machina way Ever manages to kill Drina by hitting her in the chakra that relates to Drina's distinct lack of love. Whatever.There is a subplot to do with Riley, Ever's younger sister, who needs to move on to be with their parents and dog in \"a better place\".At end, Damen and Ever have declared their love for each other and honestly, I could not have cared less. I lost interest in these characters once, at about chapter five (I know, I should have seen it earlier), when I realized that neither of them have any depth as characters.I do not recommend it at all."}, {"userName": "Sarah", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "This was a YA paranormal romance story, about a teen psychic.I liked Ever and I felt really sorry for her the way she had lost her family in such tragic circumstances. I liked Damen too, but he was a little irritating with all the red tulips all the time.The storyline in this was about Ever having been in a car accident that killed her family, and left her with psychic powers. We then had Damen, a new boy at school, who strangely had no aura, and we spent most of the book then trying to figure out what exactly Damen was and what he wanted with Ever. I found this to be a pretty good story though, and it held my interest throughout. The ending to this was also pretty good, and I am definitely interested to see where the series goes from here. ★★★★★★★★☆☆8 out of 10"}, {"userName": "Dee", "userReviewDate": "Jan 31, 2009", "userURL": "http://www.goodreads.com/user/show/1925659-dee", "userReview": "This book started really good but then it got dumb. If you live forever and don't want anybody to know it, get some furniture. Throw away the paintings that show you in olden times. And what kind of dummy gets back together with a girl who keeps murdering his girlfriend? I wanted to be in love with this book. It was too dumb, so I couldn't. I gave it an extra star for the beginning that was really good."}, {"userName": "Wendy Darling", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "Decent writing, nonsensical plotting."}, {"userName": "Athena ღ", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/55512173-athena", "userReview": "Διχάζομαι στο πως να βαθμολογήσω, οπότε βάζω κάτι ανάμεσα σε 3,5 και 4 αστεράκια.Αν μου άρεσε? Yep, και φυσικά θα διαβάσω και το επόμενο. Ποιά είμαι εγώ άλλωστε για να αντιπαθήσω ψηλό, μελαχρινό, ομορφούλικο αγόρι? Τι με χάλασε? Ρε παιδιά, μεγαλύτερο χάπατο από την Έβερ δεν έχω ξανά δει, τύφλα να 'χει η Πέγκυ Καρρά. Τι ότι του τηλεφώνησε ο γείτονας για να του πει ότι χάλασε ο αυτόματος ποτισμός και πλημμύρισε ο κήπος του της είπε, τι ότι δεν μπορεί να τη πάει σπίτι του γιατί είναι ακατάστατο της είπε, πάλι καλά να λέμε που δεν της είπε ότι έχουν πάθει βλάβη οι μηχανές στο εργοστάσιο! Μετά από 200 σελίδες αρχίζει να ξυπνάει. Παρ' όλα αυτά προτείνω αυτό το βιβλίο σε όσους αρέσουν οι υπερφυσικές ρομαντικές ιστορίες. Και μη βιαστείτε να υποθέσετε πως πρόκειται για ένα ένα ακόμη βιβλίο με ιστορία βρικολάκων, γιατί η ανατροπή δεν αργεί να έρθει!"}, {"userName": "gwayle", "userReviewDate": "Aug 19, 2009", "userURL": "http://www.goodreads.com/user/show/2514493-gwayle", "userReview": "Hours of my life I will never get back were wasted reading this--and I rarely feel that way. Something made me keep turning the pages, but this book is horrible. The romance is unconvincing, the characters flat, the mythology annoying, and there is something cringe-worthy (the names, for one! Ever? Summerland? Haven? are you kidding me?!) on each and every page--quite a feat! It's a cheap Twilight Saga and Southern Vampire/Sookie Stackhouse Mysteries rip-off. Sure, many of the aforementioned criticisms could be leveled against those (neither series is great literature), but the first has--IMHO--a real magical quality to it, and the second is oh-so-effortlessly-charming in that irresistibly Southern way. If these books were drinks, Twilight and Sookie would be inexpensive--but very drinkable--champagne: just one more glass... OK, one more... how many have I had? oh hell, fill her up dahhhhling... *sigh* the bottle is empty, but the world is just wonderful, wonderful, wonderful ... ... ... ... ... ... *upon waking* the horror! the horror!... but... I bet I'll do it again some other time. This book, this Evermore, this colossal embarrassment of a novel, would be warm Pabst. Don't go there, no matter how desperate you are.If you are looking to capitalize on the paranormal romance experience, I suggest \nSunshine\n, by Robin McKinley, and \nA Certain Slant of Light\n, by Laura Whitcomb.P.S. I'm putting it on my vampire shelf despite the hilarious insistence that the creatures in this book are not vampires (vampires are fake!) but immortals. Oh, and there's an annoyingly stereotypical redheaded villianess (she just doesn't know how to luuuuuurve--oops, is that a spoiler?), so it goes on the redhead shelf, too."}, {"userName": "Michelle", "userReviewDate": "Jul 05, 2009", "userURL": "http://www.goodreads.com/user/show/398239-michelle", "userReview": "Stop me if you've heard this one before:Girl moves to new city. New, rich, and perfect boy shows up to school and immediately shows marked attention to girl. Boy has all kinds of odd abilities - moves fast, is drop dead gorgeous, never eats - and girl can't figure him out but can't stay away either.Ring any bells?I felt like I had already read the first hundred pages or so in this Twilight wannabe where Ever loses her family in a tragic car accident and moves in with her aunt in California. After the accident, Ever can see aura's and read minds - which causes no end of turmoil in her backstabbing and hormone driven high school. Then she meets the mysterious Damen and finds herself drawn to him even though she doesn't understand him. Blah, blah, blah, then someone tries to kill Ever blah, blah, blah and Damen tries to prove he is worthy of her love.Okay, maybe I'm more than a little harsh in this review, but I felt the story was just so flimsy. The explanations for Damen's behavior were more than a little weak and his whole history more than a little implausible. Alyson Noel gives the reader just enough a glimpse into his back story to think \"ok, I can sorta see it..\" then changes the subject and never goes back to anything more substantial. And let's not even get me started on the villain in this one shall we? One word: CARDBOARD. And how Ever escapes from her? My eyes are still a-rollin'. The one thing I did like were Ever's geeky friends Haven and Miles. Their lunchtime conversations were much appreciated."}, {"userName": "Nhi Le (The Literary Bystander)", "userReviewDate": "Oct 01, 2010", "userURL": "http://www.goodreads.com/user/show/3525540-nhi-le-the-literary-bystander", "userReview": "You know, I thought only books like Twilight, Fallen and Marked were a select few to be considered a real abomination to the YA literature scene at the moment. But alas, I found another contestant - and it definitely a shoo-in to be up there with Twilight in just God-awful terrible.In a Nutshell: New kid Damen is a dream come true to the whole school, and especially to Ever. Compared to the clutter of thoughts and auras, its a kind of silence that Ever welcomes. They soon fall inevitably in love, for reasons we can only speculate. But she soon finds out secrets about him, their relationship and the creepy stalker lady who has her talons on Damen - and is not so willing to let him go just yet. What I liked:\nSecondary Character: Miles\nYeah, that's right - the stereotypical gay high school kid. Unfortunately, just like Damien from Marked, and not Kurt from Glee -- Miles is slightly entertaining, but lacks any kind of real depth to his character. Although, maybe it's I just feel more pity for him for putting up with annoying prats like Haven and Ever.What I didn't like:My God, where do I start with this book...\nPlot and Prose\nIt's basically like Fallen -- in which an actual, substantial plot is absent, and what we are left with is pages and pages and pages about Ever and the rest of the universe swooning on about how perfect Damen is.I know I'm just nitpicking now - but I read/watch a lot of reviews where people liked the 'aura chart' at the beginning of the book. Maybe it's just a personal preference of mine - but other than maps (i.e. for sci-fi/fantasy books) and dedications - the chart was just a plain nuisance. I honestly thought Noel could have integrated and inferred what each other auras meant through her novel. But no, that would've required effort; and so, I had to constantly flick back and forth to figure out what someone's aura meant. Lazy writing, if you ask me.Now although the prose itself was your usual combination of: telling rather than showing us, generic/basic sentence and word structures and flat prose -- I just disillusioned myself into believing that what I was \nreally\n reading an fanfic written and published on the internet by some pubescent 14-year-old, as opposed to an adult female author. It made more sense in my head, believe me.\nProtagonists: Ever and Damen\nEver's a Mary Sue. There, I have stated it and that is all you really need to know. No really, I kid you not. She's got the conventional good looks, the tragic past and all these magical powers that clearly show us how 'special she is'. Having a power was not what annoyed me about her, it was the fact that she had a million of them, and it made life so much more convenient for her - but she does nothing with it. And it just amplified the 'perfect' factor for me, much to my disgust.You know, the whole back story about how Ever used to be one of the 'popular' kids was interesting -- and I wished that Noel had used this to her advantage. You know, to flesh out Ever's character so she wasn't just another version of pre-Breaking Dawn Bella Swan. But that needs thought and effort - and who needs that? We need more hot, smoldering men to ogle for a good 200+ pages or so!Meanwhile, Damen is our male equivalent -- the epitome of Gary Stu. No, I'm serious. I wish I could kid about this. But I'm not. If Ever isn't having monologues about how gorgeous and perfect he is, someone else is. Like, don't these people have lives or something? He has unnaturally good looks/physique, considerate , smart, artistic (apparently on par with Pablo Picasso himself *gags*), athletic, well read (apparently he was chums with both Shakespeare and the Bronte sisters *hisses*) and just overall so magnificent a creature, he's just good to be true. If the constant name-dropping wasn't annoying was, HE certainly was.So you have this beautiful and magical couple, who could not possibly have any flaws (especially on Damen's part, because objectifying and idealizing our romantic interest is the way to go!) -- and therefore, are one-dimensional at its best.\nMain Romance: Ever and Damen\nIt was basically a retelling similar to Bella and Edward's romance in Twilight. However, I was pretty grateful that the abuse factor was not in this. However, there was that lack of chemistry or anything between them, if you ask me. Sure, he was a comfort for Ever - but that was pretty much it. Common interest? Mutual trust and respect? More like Ever followed him around like some lost puppy. Honestly, if a guy constantly ditched me and then popped out of nowhere like everything was alright, I'd have dropped him like a bunch of hot pot-stickers!Least when she showed *some* concern/spark when it was required when she thought Damen killed Haven. Yay for the sisterhood?There was also the whole 'reincarnations' and repeated tragic love story going on. God - and I thought I would had only need to read it from Fallen. Indeed, I was mistaken. Believe me, Noel - it does not make the romance any more stronger nor heartfelt. I personally felt it was just an excuse for the lack of real love and connection between the characters.\nSecondary Character: Haven and Riley\nGod these two were shallow and annoying, it grated me to no end. My God, Haven was so bitchy and whiny -- she made Ever look like a sympathetic and likable person. Yeah, and believe me - that's saying a lot. Riley just made me glad that I never had a younger sister. That is all I'm saying.\nAntagonist: Drina\nShe was just as boring as everyone else in the book. You'd think you could be happy for someone who wanted to kill off the oh so amazing perfect couple, and God forbid - its protagonist! But alas, all she wanted to do was get back into Damen's pants, and eliminate the competition.Although there was something rather hilarious that happened towards the end of the book. For books I don't like/care much about - I do not want to spoil this one for you guys. This is something for you to find out yourselves. All I can is... well... let's just say, Voldemort would definitely get a good crack out of this because you know, literally dying from the POWERS OF LOVE - as opposed to something more realistic and probable - is a good way to kick the bucket."}, {"userName": "Merna ", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/16392157-merna", "userReview": "I felt inclined to write a review about Evermore, considering this is the worst book I have ever read (pun intended). You would be deficient not to notice the similarity between evermore and twilight. I think the author was personally saying, \"In your face Stephanie Meyer, let's see if you can write a worse love story than this.\" Twilight wasn't anything staggering, but at least it was somewhat entertaining. I read this book last year, and by now my memory of Evermore has faded. Yet, some terrible recollections remain intact. The plot. I introduce to you the most boring plot to be printed on paper. - Ever’s parents and sister die (you don't uncover how they die up until the end of the book). Why the author revealed it at the last couple of chapters... Well, only god knows. Nevertheless, I had only one thought about their death: Worst death ever. I was unable to even summon up any sad emotion for her families’ death. Imagine that. I hardly got a description of how her mom and dad were as parents. Aside, from her sister (I sort of bonded with her small sister) who was a ghost that aggravated Ever constantly. Ever was unkind to her sister, continually wanting her to go away - into the after-life, presumably because she was getting sick of her and couldn’t stand the sight of her any longer. Seriously, she's your dead sister have a little more compassion, will you? -The mysterious guy who is just as boring as Ever comes into the book. Things start getting a lot...less interesting. After, half-way through the book you find out what Damen really is. The author attempts to pull this as a huge shock. Trust me I was shocked. At the stupidity. - The antagonist rolls into Evermore, and she has to be poorest antagonist ever made (pun intended). Define: She was identical to a jealous cheerleader but with super powers. *Yawn*I will not even begin to express my feelings about the terrible characters. I loathed each character in this book. Well, besides her aunty and her dead sister. Yet, that doesn’t mean they were decent developed characters.Should I continue telling you how bad this book was , or should you discover for yourself, so you can understand my agony?What were publishers smoking when they published this book?Okay, fine I'm being cruel. This reasonably was not my cup of tea. Others do and still enjoy this book. I'm just not a part of that group. After all, everyone is entitled to their own opinion."}, {"userName": "Thomas", "userReviewDate": "Oct 03, 2009", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "You know, I really feel bad for deleting my entire review because six people liked it. I'm not sure why, as it was me simply ranting indulgently about how much I loved this book.Take into consideration that I was young and innocent and unaware of young-adult powerhouses like The Hunger Games and Shiver when I read this. As I continue to read more of this series, it continues to disappoint.What I'm getting at is that I'm not sure if I would grant this book five stars once I re-read it now, as an older and more critical reviewer. However, I would feel guilty for bumping it down without re-reading it. Therefore, I will leave Evermore at five stars even though it might not deserve it.All I remember is that Damen was hot and there was an awesome gay character. Enough said for me when I was twelve/thirteen. There might have been other positive characteristics like a plot of some kind, but once again, I forget.Adios! If you want to read some of my more current reviews or my writing in general, you can find it here.*update May 24, 2011 - so I lied, I'm bumping this one down to 4.5 stars. I still haven't found time to re-read it, but I did skim through the book at Borders the other day and found nothing particularly five-star worthy. Sorry Evermore fans!"}, {"userName": "Bark", "userReviewDate": "Nov 10, 2010", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "Sixteen year old Ever (yes, so sorry that’s not a typo) lost her family, her dog, her home and her popularity in a tragic accident. When she awakens she has the ability to read thoughts and see auras. This is not a good thing for Ever and it turns her into a “freak”. Now living with her wealthy, absent aunt, she shuns people and hides her beauty behind ugly hoodies and big sunglasses. One gloomy day a new boy arrives at the school where she is now one of the misfit freaky kids. For some reason she’s chosen to befriend a gothy bitch and a disinterested in anything but himself boy named Miles instead of the bitchy, self-involved popular kids she used to consider her BFF’s. This new kid, Damen, is all smoldering good looks and is interested in MissHoodie and she can’t read his thoughts! Ahhh, blessed silence replaces the voices in her head whenever he is near.Here I stop to let the feelings of Deja freaking Vu wash over me and lament the loss of originality in the YA world. The rest of the book follows Ever and Damen around as he keeps her in the dark about his dark and mysterious past and generally acts all dark and mysterious but because he’s sexysuperhot they fall into an obsessive dysfunctional crazy sort of love. He must really know how to work the smolder because I couldn’t for the life of me figure out when or why they were in love or how he jumped straight from wooing to almost getting her out of her panties in a blink. He was a BORING character and no amount of movie star looks is fixing that when I can’t see him! She ain’t no prize either, for that matter. She’s moody and spoiled and acts like a real nut when he finally tells her the truth about himself. I could forgive the moody, hell her family was dead, but the author didn’t work that angle to any real emotional effect. The deaths were used as means to get her to where she is, living with an aunt who conveniently works 168 hours a week so she can hook up with Damen. I should know, I lost a parent at thirteen and life was an emotional hell for a very long time. In this book, I felt none of the pain and torment that invades every pore of your being when something so earth shattering happens. Thus, many of Ever’s thoughts were distasteful and shallow to me. All she did was whine about unimportant shit and fret about Damen. Sure she could still talk to her little ghostie sister so I guess that made all the pain go away? To me it was all a bit lazy and not at all clever.So yeah I admit I’m biased but I did finish the book and it didn’t get better for me. I don’t care how much woo-woo or adventure or paranormal twisties an author throws in, if I find the characters tedious and completely lacking in emotion it’s a fail. Ever is a fail."}, {"userName": "Katrina Passick Lumsden", "userReviewDate": "Oct 30, 2010", "userURL": "http://www.goodreads.com/user/show/1964146-katrina-passick-lumsden", "userReview": "I've been devouring YA supernatural fiction lately, and after having gone through some good and some mediocre, I finally stumbled upon Evermore, which quickly proved to be neither good nor mediocre, just plain bad. Ever Bloom is the most vain, shallow, egocentric, selfish, and mentally deficient character I've ever had the unfortunate pleasure of getting to know. She begrudges anyone else's happiness, ignores her friends when it suits her, turns into a doormat at the most unlikely times, and is mean to people without reason. I've read the first three books in this series and I can honestly say I've yet to find ONE redeeming quality in her. There is nothing good. Take a spoiled, nasty cheerleader and give her some emotional baggage and a psychic gift and you've pegged Ever Bloom. She's also insecure to the point of ridiculousness. I know about insecurity, but COME ON. Damen Auguste is a walking cliche'. Devastatingly handsome, mysterious, runs hot and cold, Ever feels \"drawn\" to him and gets all \"tingly\" whenever he's around. He drives a BMW, wears designer clothes, blah, blah, blah. What is he LIKE? Hard to say since you don't really get to know him in the first book. The rest of the characters are also walking cliche's. There's the affection-deprived goth friend, Haven, who spends her time trying to get people to pay attention to her, even going so far as to attend 12-step meetings for afflictions she doesn't have (Fight Club, anyone?). She's hardly ever nice to anyone, yet for some strange reason, everyone puts up with her BS. True to form, she is also a complete moron.Then there's the flamboyantly gay Miles who dreams of becoming an actor and does nothing but text non-stop. Ever's aunt Sabine is a power attorney who's mostly absent. No real getting to know her, either. The villain of this particular installment is Damen's \"wife\", Drina, who admits to having killed Ever so many times in the past that it's now become a bore. But that doesn't seem to stop her from continuing to do so, deriving some pleasure out of being....a stalker. She has eternity and THAT'S how she chooses to spend her time? Ever is just SO important. Gag me. I wish I hadn't bought it, but hey, sh*t happens."}, {"userName": "Saniya", "userReviewDate": "Dec 19, 2010", "userURL": "http://www.goodreads.com/user/show/4048678-saniya", "userReview": "This picture explains perfectly how I was feeling while reading Evermore.Anger, laughter and yes, how could I possibly forget? Failure.Its worse than Hush Hush, better than Fallen and a total rip off of Twilight series. I felt like a hero after accomplishing reading Hush Hush, Fallen and Twilight series and now, I just have tears in my eyes after reading this because I feel like a king of the whole universe. USELESS characters, USELESS story and to sum up, EPIC FAIL book.I will rate this book 2/5 stars and now I would actually try to read Riley Bloom series because Riley is not a pain in everybody's ass like Ever. :)"}], "description": "Sixteen-year-old Ever Bloom is the sole survivor of a car accident that killed her family. Exiled to sunny California. Ever is haunted by her little sister and by the ability to see people's auras, hear their thoughts and know their entire life story by touching them. She wants to hide from the world, but when a stunningly handsome guy arrives at school, she can't seem to keep away. Falling in love with Damen is dangerous - he's not what he seems. But if Damen is her destiny, how can Ever walk away?", "title": "Evermore\n      \n          (The Immortals #1)", "url": "http://www.goodreads.com/book/show/6585977-evermore", "average": 3.59, "cover": "https://images.gr-assets.com/books/1315078092l/6585977.jpg", "reviews": 9455, "authors": [{"url": "https://www.goodreads.com/author/show/200317.Alyson_Noel", "name": "Alyson Noel"}], "type": ["Young Adult", "Fantasy", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/6585977-evermore", "http://www.goodreads.com/book/show/3975774-evermore", "http://www.goodreads.com/book/show/11111162", "http://www.goodreads.com/book/show/6134826-blue-moon", "http://www.goodreads.com/book/show/6581511-shadowland", "http://www.goodreads.com/book/show/7198988-dark-flame", "http://www.goodreads.com/book/show/7739934-night-star", "http://www.goodreads.com/book/show/9395215-everlasting", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}