{"ratings": 1232, "userreviews": [{"userName": "Erika Robuck", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/2103117-erika-robuck", "userReview": "Dear Readers,Following the breadcrumbs of dead writers through a vast and troubled forest has brought me to the gate of Steepletop, the 700 acre Berkshire estate of the Bohemian poet, Edna St. Vincent Millay. I've always been a fan of her evocative work, but while studying the Fitzgeralds, came to know her \"personally\" through two of F. Scott's Princeton friends. What I found out about her personal life was every bit as fascinating as her Pulitzer prize winning poetry. As I did in HEMINGWAY'S GIRL and CALL ME ZELDA, I use a fictional character to animate a place in time, and in FALLEN BEAUTY an unwed mother--a seamstress from Chatham, NY--is commissioned to make Millay's poetry reading tour wardrobe. To do so would be a scandal in town for many reasons, but her poverty makes the job a temptation she might not be able to refuse...I hope you enjoy FALLEN BEAUTY.Sincerely,Erika Robuck"}, {"userName": "Jennifer King", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/3041607-jennifer-king", "userReview": "Fallen Beauty is a historical novel set in 1928 in a fictional town in Upstate New York near Steepletop, the home of the poet Edna St. Vincent Millay.Like two of Erika’s previous novels, Fallen Beauty prods at the hearts of prominent American writers through the lives of other characters close to them.In Fallen Beauty, Millay consigns the town seamstress, Laura, to create her reading costumes. The way Fallen Beauty not only looks at the poet Edna St. Vincent Millay through the eyes of the seamstress, Laura, but also is told in first person through Millay's eyes as well is, in my opinion, the most amazing part about this book.Millay was a poet and human being like no other. She won the Pulitzer Prize for Poetry in 1923, the third woman to win the prize for that honor.Millay was not the docile sort of poet and writer, but the extreme opposite, known for her wild eccentricities and savage love affairs, and also her care and support of her mother and sisters.What I find most remarkable about Fallen Beauty is the way Robuck has created a world of contrasts, playing light upon dark, garishness against modesty, societal judgement with tolerance — and makes us as the readers stop to consider them all.In this story, the self-discovery in both Millay and the seamstress Laura are important and redemptive, and this is where a novel such as Fallen Beauty makes its mark on our world.Fallen Beauty is the novel to read this spring and would make a perfect book club book. Its story is unforgettable. At times, it is dark, but stick with it to the end. You’ll be glad you’ve journeyed through the story.A favorite quote from FALLEN BEAUTY: “I wish I could be a woman of the world. Instead I am a cloud woman. A tempest.” [Millay] “Do not begrudge your calling,” says Mother. “It is worthy and wild, but it does not come without a price. All things must be bought at a high cost. Otherwise you’d just live in the town and bake bread or sew things.” “Don’t you dare call sewing common,” I say. “Don’t belittle that woman. She is far from common.” “Ah, here you are. Waking up,” says Mother. “She is common. Nothing but a common girl with a bastard child. A fallen beauty. Oldest story in the book.”I highly recommend FALLEN BEAUTY, especially to fans of historical fiction."}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "The year is 1928 and Laura Kelley wants more for her life than just working at her father's store in their sleepy little town. She and her secret lover head to the Ziegfeld Follies for a scandalous night of drinking, dancing, and having fun. If her father knew what she was really up to, he would be furious. The most exciting night of Laura's life ends up becoming one that holds a huge consequence. That very same night and not far away, Edna St. Vincent Millay is trying to finish her collection of poems and is having her usual wild night of drinking, poetry, and debauchery, except this time, Millay isn't getting what she wants. A few years past and Laura finds herself in a tough predicament as she is a single mother barely surviving in a town that shuns her. There are many parallels between Millay and Laura as the townspeople don't approve of Millay's cavalier lifestyle; however, she is rich and wants to help Laura. Laura is a talented seamstress and Millay wants her to create all of her outfits for her new book tour. Doing so would bring financial security to Laura, which she desperately needs, but she would also be going against the community and her beloved sister if she takes Millay on as a client. Both women must deal with being nonconformists in a town that doesn't appreciate them and navigate through the ups and downs of life as \"fallen\" women. Erika Robuck's Fallen Beauty is a well written historical tale that truly brings to life the fascinating person that is Edna St. Vincent Millay.Read the rest of my review here: http://www.confessionsofabookaddict.c..."}, {"userName": "Harvee", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/2185693-harvee", "userReview": "I admit I was slightly shocked by the free and easy ways of the poet Edna St. Vincent Millay, who historically, had both male and female lovers and a wealthy husband who enabled and supported her in all her artistic pursuits and personal idiosyncrasies. A well known poet who became famous and relatively rich from her writings, Millay went by the name \"Vincent\" as she chased after new experiences in order to feed her artistic muse. I loved the historical details the book gives of the poet. Engrossing and revealing, the ncvel pulls us into Millay's life of contradictions. The novel makes us question whether Millay's fame and art should outweigh Laura's humility and sense of what makes for decent behavior. The author seems to prefer Laura. Who would you choose as the more worthy \"fallen beauty\"?Visit my full review"}, {"userName": "☕Laura", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/15033381-laura", "userReview": "This novel revolves around the lives of the fictional seamstress Laura Kelley and the real poet Edna St. Vincent Millay, and the relationship which develops between them in an upstate New York town. I found Laura's character likable and I had sympathy for the position in which she found herself; a single mother ostracized by her community and struggling to support herself and her child. However, this is really a character which has been presented countless times before, and I did not feel that this novel added anything new or interesting to this storyline. Edna St. Vincent Millay, on the other hand, is unlike anyone I have ever read about before. She lived a life of disturbing excess and was apparently quite a sad and troubled woman. Although this should have added an interesting dimension to the story, the writing in this book just never grabbed me or held my interest for very long. It seemed there was a lot of unnecessary detail and the story moved along too slowly for my tastes. Overall this book was just okay for me. This review refers to an ARC I received for free through the Goodreads Firstreads program."}, {"userName": "Pamela Klinger-horn", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/6967927-pamela-klinger-horn", "userReview": "Erika Robuck is back with her best work yet. Robuck once again uses a fictional character, woven into the real life tale of the glamorous Edna St.Vincent Millay, to relay her story. These two women's lives run on a parallel course as they both deal with the price of unconventional choices in a stifling small town. Fans of THE CHAPERONE by Laura Moriarty, and those who enjoyed Robuck's earlier works, will once again be enthralled with this enticing piece of historical fiction."}, {"userName": "Stacie", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/763153-stacie", "userReview": "In Erika Robuck's tale, you will find passion, intrigue, romance, and feel a sizzling energy during a very difficult time in two women's lives. First we are introduced to Laura. She is the daughter of a dress-maker who suddenly dies and Laura must find a way to take over the business. In the mean time, her sister is planning to marry an upcoming political figure and Laura has just found out she is pregnant with her forbidden lover's child. The other woman in the story goes by many names including Vincent, but is really Edna St. Vincent Millay, the famous poet. She and her husband live a \"progressive\" life in the mountains near a small village in upstate New York. They have lots of wild parties that include sex and alcohol. The people of the community are horrified to have such debauchery take place so near their homes and have shunned Millay from their lives as well as anyone who takes part in the wild parties.The story begins in 1928, a time when family loyalty, responsibility and respect are the driving forces behind everyone's choices. When Laura falls in love with someone who is not available, their one night of passion leads to a child that she is forced to raise on her own, much to the glaring eyes of the people in her community. She watches as her shop bell no longer rings and orders stop coming in. Desperate for a way to pay her bills, she agrees to make costumes for the flagrant poet. Even though she is already shunned by her community and friends, Laura must take this risk to be able to keep her shop and take care of her daughter. Each chapter we are told the story from both Laura's and Vincent's perspective. I was mainly interested in Laura's story. She was a women that I would have chosen as a friend. She had a deep care and concern for others and was passionate about her clothing designs. Vincent on the other hand, was selfish, dramatic, and narcissistic. I found her whining to be nauseating and annoying. In her world, there are no rules and she is in charge. She has no care of what others think and was extremely full of herself. I was glad her parts of the book were short. I am not a huge poetry fan, but for those that are, they will appreciate that Millay's poems are sprinkled throughout the story. When I was approached to review this book, the first thing that drew me to it was the cover. I have always felt that the cover truly is the first part in the sale of a book and this one definitely catches the eye and will make you pick it up. It is just gorgeous. I love the title, FALLEN BEAUTY as it tells so much about both Laura and Millay. Even though it was used to describe Laura in the book, it can equally be used to paint a picture of Millay's life throughout the story. As we travel through ten years in these two women's lives, we are treated to heartache and love, growth and change. How did the two women fare by the end of the story? You will have to read to find out.My favorite line from the book actually came from Vincent's story. I read an uncorrected proof and can't state for sure that this part of the book made the final cut, but I hope it did.\"If my life was a quilt, there would be squares I'd want torn out.\"Don't we all wish we could recreate past incidents in our lives? Those blocks of a quilt tell our story and no matter the pain, the blocks must remain. In the beginning, I wasn't sure I liked the book, but it grew on me as I turned the pages. I was reading it fast at first because I had a deadline, but as I neared the last third of the book, I was turning the pages more to find out what would happen. If you can get past the sordid life of Edna St. Vincent Millay, you will find much about this novel to love."}, {"userName": "Carol", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/3356446-carol", "userReview": "I love Edna St. Vincent Millay’s poems because they are simply worded and very direct. When I saw this book offered for selection on Amazon Vine I snatched it up quickly. All that I knew about the poet is that she was an American poetess.Fallen Beauty by Erika Robuck is a painful and beautiful look at Edna’s life with historical facts with an added imagined friendship between her and a town seamstress. The invention of the seamstress, Laura Kelley, provides a way of comparing Edna’s psychological struggles to those of single mother raising her child in the 1928 to 1937 in upstate New York. Edna seems like a lost soul who craves excitement, beauty and novelty while her poor counterpart wants acceptance, forgiveness and family. It seems impossible for any friendship between them but there seems to be recognition by both of them about the other. The seamstress had made one mistake that made her a fallen beauty. She ignored her father’s rules and slipped out for a night of fun and excitement with a man she could never marry. She slipped on a beautiful golden gown that she made herself and a three stranded pearl necklace and along with newly bobbed hair. From that joyful and daring evening she became pregnant and thought that she would pay for her error the rest of her life.On the same night Edna St. Vincent Millay threw a party with wild people, plenty of drink and hopes of finding a new lover. She loved extravagant clothes, surrounding and exciting people. When I was reading about Edna, I felt very uncomfortable, mostly at the beginning of the book but better after she met Laura. After that Edna seems to be not as selfish and egocentric as I had first thought. With Laura, I felt a down to earth quality and a strong love for her sister and her daughter, Grace. She was burdened by her sin but there was hope in her soul.The author researched for the facts of Edna’s life thoroughly and even visited Millay's home, Steepltop. Her feelings about her experience at Steepletop are reflected clearly in this story. It is an emotional journey to read this book. The only thing that I didn’t like was that it took a smidge too long for the two to meet.I recommend this book to all lovers of Historical Fiction and those curious about Edna St. Vincent Millay’s life.Even though I received this book free from the Amazon Vine program that in no way influenced my thoughts or feelings about this book."}, {"userName": "Melinda", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/30751354-melinda", "userReview": "When I discovered Robuck's novel was a story of Millay my curiosity was instantly piqued. I have always admired the wondrous prose of Millay as well as being acutely aware of her prickly nature and artsy lifestyle. I was unsure what direction Robuck would take, how she would portray Millay, what angle would she pursue and I will say, I was completely impressed. I commend Robuck for selecting Edna St Vincent Millay as her center of focus. Millay is as talented as she is controversial. A trailblazer in feminism, a free spirit living her life and of course her gift of outstanding poetry. The best descriptions I find fitting Millay - a quiet storm, a loud whisper, an angel of hell. I love a narrative taking two contrasting characters where a single fragile thread connects them. Robuck managed to knit two women that are polar opposites and yet show they share a common denominator. Laura and Millay couldn't be more different. The only similarity between the two, they are both outcasts in their respective town. The former for an indiscretion, the latter for her hedonistic lifestyle.Robuck did not spare the rod in her characterization of Millay. She was both brazen and respectful in displaying this grand creatures true colors. Millay mercurial, brutal, arrogant, wanton and monoclinous, sybaritic. She was also vulnerable and suffered heavily emotionally through the passing of her mother and former friend/lover poet Elinor Wylie, as well as the ending of her tryst with fellow poet George Dillon, leaving this desert rose fragile. Her noted genius and beliefs are also addressed. Both protagonists are viewed with a lens revealing their emotions and creative selfs. Laura is praiseworthy, graceful, a pillar of strength and determination. Outdoing herself, Robuck shines with the setting. Her landscape is stimulated in all facets - economic, politics, homes, fashion, and societal expectations and attitudes. Undoubtedly you clearly are absorbed in the atmosphere of the 1920-30's. Excellent story with numerous themes explored leaving the peruser plucking one or more they find fitting. Robuck deserves praise for her accomplishment, her writing style is breathtaking. Highly recommend, cannot say enough about this marvelous novel.A copy was provided in exchange for an honest review"}, {"userName": "Kristine", "userReviewDate": "Feb 03, 2014", "userURL": "http://www.goodreads.com/user/show/6025935-kristine", "userReview": "Original review found at http://kristineandterri.blogspot.ca/2...3.5 stars * I received an advanced readers copy of this book through a Goodreads giveaway in exchange for an honest review.*This book tells the story of fictional character Laura Kelley and the real life poet Edna St. Vincent Millay. Each Chapter begins with Laura's story from her point of view and ends with Vincent's from hers. Although each story is separate they intertwine as the book progresses and a relationship is built.I thoroughly enjoyed Laura's story as she found herself in a situation that marks her in her small town community and leaves her ostracised and struggling to make ends meet. She struggles to keep her dress shop in business and pay bills when the community members refuse to give her business. Although I enjoyed her character and sympathised with her struggles, I did find her story to be a little slow at times. What I really wanted to know about Laura's story was not revealed until the final few chapters and it felt a tiny bit rushed and anti-climatic by that point.I have mixed feelings when it comes to Vincent's story. Although I sympathised with her sadness I didn't overly like or enjoy her character. I found her to be selfish, unstable and felt that she brought a lot of her pain on herself. If I'm honest I have to say that the pages written in her point of view were a bit of a bore and I found myself skimming the paragraphs. As the story progressed and interactions between Vincent and Laura began I felt a disconnect from them. I couldn't really feel the bond that they were creating. I did however really like Vincent's husband Eugen.I always enjoy historical fiction because I can experience what it was like to live in a different time where views, morals and judgements were so different from what I know. This story does not disappoint in that sense. Although not a perfect story it was an enjoyable read."}, {"userName": "Andrea", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/5167618-andrea", "userReview": "After finishing her 4th novel, I am more than sure that Erika Robuck is my favorite contemporary author. Her writing is superb. She is able to effortlessly combine style and substance. I never feel like I am bogged down with details or heavy writing; at the same time the way she describes people, events, and feelings is precise and lovely. I enjoy the mysteries that she involves (in this one as well as \"Receive Me Falling\"). Her characters never fail to grab me and keep my attention. They are genuinely believable, flawed, and human. The historical characters and events seem to be well researched and Robuck never assumes her audience comes in with no knowledge of the past, which is refreshing; this keeps the story moving at a brisk and enjoyable pace.I really enjoy how Robuck combines history and fiction, adding in characters she has created to the actual life events of her subjects. I knew very little of Edna St. Vincent Millay before reading this book but I am intrigued by her and would like to learn more. I was reminded of \"The Scarlet Letter\" while reading this story and I believe that Robuck's next work will involve Hawthorne; I wonder which work inspired which? However she was inspired to write it, I know for certain I will be reading it as soon as it is released!"}, {"userName": "Sara Hauser", "userReviewDate": "Jun 10, 2014", "userURL": "http://www.goodreads.com/user/show/28791580-sara-hauser", "userReview": "This book was the best book I've read in quite a while. I had not read Erika Robuck prior to this, but intend to check out her other books. I'll be checking out Call Me Zelda from the library today! I loved the story and the characters. I think her writing was spot on. She made me visualize the scene and I could really feel for each of the women. So many authors over-describe setting, clothing, etc. just to use elaborate language. Ms. Robuck was able to capture all the detail with her writing without overselling descriptors. There was nothing predictable about this story, and I wasn't able to put it down during the last half of the story as secrets came to light. Thank you goodreads for recommending this book, and thank you to the author for introducing me to Edna St. Vincent Millay."}, {"userName": "Dianna Rostad", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/9928617-dianna-rostad", "userReview": "Fallen Beauty crackles with erotic tension and the determination of a poetess to wield sexual power over others as inspiration for writing. Robuck takes you deep into the mind of Millay, enlightening and shocking her readers in turns between sympathy and something akin to voyeurism, judgment is the only sin. Written in dual, first-person narratives, Robuck has taken her writing to another level of sophistication, and it was an absolute pleasure to read and experience Edna St. Vincent Millay alongside the story of a lonely seamstress, a Fallen Beauty. Who would think that a Pulitzer prize-winning poet and a seamstress could have so much in common? But the way these two outsiders come together is nothing short of brilliant."}, {"userName": "Tanya C", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/15749814-tanya-c", "userReview": "I rec'd this book for free through Goodreads First Reads. I really enjoyed this book and found myself really feeling for the main character Laura. I felt she had to grow up way to fast due to all the circumstances in her life and she seemed to lose out on so much.With the other main character, Vincent, boy I have to say I found myself feeling disgust, pity, sadness, and even some empathy. I was surprised after to learn that she was a real person. I find myself wanting to know more about her and her poems.All in all, I started this book and finished it in an afternoon. I found myself pulled into the story and will recommend this book!"}, {"userName": "Charlotte Guzman", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/27974009-charlotte-guzman", "userReview": "I truly ended up loving this book. I didn't know what to expect and was pleasantly surprised of the lessons learned. Love, forgiveness, not judging a person until you know them. The characters were brought to life by the author and I loved them all playing their parts. This is my first book by this author and can't wait to read another."}, {"userName": "Jim", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/4407044-jim", "userReview": "Having read and reviewed Erika Robuck's first two works of fiction, Hemingway's Girl and Call Me Zelda, I looked forward to reading and reviewing her newest novel, to be published in March, Fallen Beauty featuring the American poet Edna St. Vincent Millay, her husband Eugen Jan Boissevain, the central character Laura Kelly - a scandalized single parent from the local village near Millay's upstate New York mountain top home Steepletop, and a cast of small town characters who add depth and dimension to the story.I was more than pleasantly surprised. I was amazed (and at times, uncertain) at the mercurial narrative from start to finish that had my mind and emotions all over the map from start to finish. In my opinion, Robuck's narrative style, capturing the edgy and uncertain life of both Kelly and Millay (both of whom fit and illustrate the title Fallen Beauty) is one of the biggest pluses of this book.Robuck also does an effective job of significantly contrasting the bohemian lifestyle of Millay with the restrained and conservative life of Kelly and the town she lives in. She does so by effectively using the backdrop of the late 1920's and the entire decade of the 1930's as well as the background of the two main characters - a well traveled and very open living poet and a small town conservative girl whose passionate night with an unnamed character results in a pregnancy she courageously choose to keep and raise. This is accomplished by alternating chapters between Laura and Millay telling what is going on around them and within them as the story unfolds. The ever growing tension both between them, within themselves, and with the other characters in the book is not fully resolved until late in the book and then in a dramatic way.There are many themes running through this novel. I will leave other readers to determine the one to two themes which catch their attention. For me, one of the most important themes involves Kelly's daughter, aptly named... Grace.In both a physical and a very symbolic way, especially as noted in Grace's observant thoughts about the developing sculpture of the Virgin Mary, Grace is who brings Millay and Kelly together through her honest and childlike ways, and, I think faith in them and in the larger context of what is often believed about grace. Robuck's insertion of her at various times into the story often, I think serves as a signal of hope and... well, grace in the midst of aging, financial hardship, loss of innocence, loss of love, shame, guilt, and finding meaning in life.With good attention to detail of the time period such as in the description of a 1920's and 30's small town and the personalities, trends, and styles of that day, Robuck has created another wonderful piece of historical fiction which truly looks into the issues of life and, well... the issues, challenges, and possibilities of faith, hope, and love. I honestly admit that it took me a while to warm up to this story and I had some uncertainty as I read it. But when I finished it, I was glad that I did so. And since I finished it I have continued to ponder it.I rate this book a \"Great' read!Note: I received an uncorrected proof of this book from the Amazon Vine program in exchange for a review of it. I was not required to write a positive review."}, {"userName": "Viviane Crystal", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/2682057-viviane-crystal", "userReview": "A seductive, jaded poet presents as a liberal woman in 1928 upstate New York. Anyone who knows her wants to drink, eat, and embrace free love with her, with no reservations on a daily basis. The same group from town, who are riddled with jealousy but who secretly join her bacchanalian parties, condemn her as an immoral witch. The last group is emotionally shattered by this free love style which has sucked up spouses in a parasitic, hallucinatory embrace, the ultimate betrayal for committed couples. Yes, this is the poet, Edna Vincent Millay, known as “Vince” or “Vincie” to those who have entered her embrace, the woman who leaves behind tormented bodies and shattered souls, the woman who needs these lovers and worshippers to inspire her creations of amazingly sensitive and famous poetry. One might call her bohemian or a torturer, but while reading this novel the reader is enchanted by her poetic, truthful comments or conversations. The reader is thus as easily seduced by this poet who seems to exude the truth of beauty and the beauty of truth, principles which one may come to understand but which yield to daunting costs and shattering revelations.While Millay forges ahead in her campaign of ravishment, a young woman living in the town next to the countryside where Millay resides is suffering her own betrayal and shame. Remember, this is 1928 and to fall in love and bear a child out of that love but outside of marriage is anathema to any law-abiding middle class resident. Christianity is used more as a tool of condemnation against Laura Kelley, who attempts to ignore the critics but whose shame for being an unwed mother of a beautiful child never leaves. She is also a talented seamstress, whose business declines after she gives birth to a witty, fearless little girl and is abandoned by a former lover who remains unnamed for a very long time.Complications follow involving Laura’s sister, a revered female leader in the town, a group of Gypsies, and a sculptor. Secrets are revealed as the relationships of all begin to fragment. The beauty in this novel, however, has to do with Laura’s significant skill in creating beautiful dresses and gowns reflective of the Jazz Age, the time in which men and women yearned to be rid of all rules, laws and boundaries. Poetry is an accepted art but at the time the creators of beautiful, liberating clothing was admired by many but worn by only those daring enough to “not care” about conventional values. The creation of both gifts is depicted in exquisite details which can be relished by any sensitive reader. Yes, Edna or Vincie, as well as Laura, suffer in order to generate beautiful and liberating art. Many aspects of several mysteries are revealed and both women mature (having nothing and everything to do with art) and both evolve into memorable, dynamic characters. The rest is indescribable but MUST be read and experienced through one’s intellect and soul. Transformation follows for all, including the reader. Delightful historical fiction and highly recommended! You won’t want it to end at all!"}, {"userName": "Karen M", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/4764034-karen-m", "userReview": "A fictional creation, Laura Kelley, and a fictionalized creature, Edna St. Vincent Millay, appear in two intertwined stories, moving in and out of each other’s lives. Laura is living a life scarred by one Infamous act which has left her barely earning enough for herself and her child, an outcast in her hometown. Edna is living a life dedicated to her writing and to living a scandalous life by society’s standards in which she is supported by her devoted husband Eugen. The lives of these two women cross because Edna’s secluded home rests high on a mountain above the same small town in which Laura lives.A woman’s life in a small town in the 1920s is still fraught with restrictions put upon her by society, especially when both parents have passed away and everyone seems to have their eyes upon this unmarried seamstress. Laura’s married sister and her husband seem to sit in judgment of her, although even they have had their secret moment of disgraceful behavior.Edna, whose friends call her Vincent, becomes the fuel for gossip when she asks Laura to create a gown for her. Laura at first refuses fearing her situation will deteriorate even more but finally she acquiesces and fashions a purple gown for her. Edna is physically attracted to Laura and continues to pursue a relationship with her but Laura is ever mindful of already being in a parietal situation with the women of her town and fears matters could become worse than they already are.This is the story of two women, one living with disregard for society and living her life the way she chooses and the other trying to remain unnoticed and hopeful that one day she will be allowed to slip back into the mainstream of her little town instead of living on the fringes. As the book progresses they each find the other fulfills a need. Edna seeks inspiration from Laura’s beauty and hidden strength and Laura begins to admire Edna’s courageousness in openly living her life as she wants.If you’re familiar with The House of Mirth you will know that Edith Wharton’s book is also a condemnation of women being controlled by societal standards as is Fallen Beauty. The two books are completely different stories but the underlying themes are very much the same.This was a well written character driven book which I enjoyed reading. The character development, which for me is so important, made it very easy to visualize the people and their actions and reactions were extremely believable for their characters. I also thank the author for the obvious amount of research that she did before writing this fascinating story.This book was won as a FirstReads giveaway."}, {"userName": "Laura Kay Bolin", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/5159657-laura-kay-bolin", "userReview": "http://anovelreview.blogspot.com/2014...In order to preoccupy herself and not think of the lover who has left her, Millay focuses her attention on the local seamstress, Laura Kelley. Laura, herself is a Fallen Beauty in the town of Chatham (just outside New York). Millay fixates on Laura and Laura is in desperate need of financial help. The two unlikely woman create a unique relationship, and eventually help the other to move forward.Millay (or Vincent as she is commonly called), is a very passionate poet. I wavered on my feelings towards her a number of times--which I believe looking back makes sense. She seemed very emotional and immature. Yet, there were times she was very wise and helpful.On the other hand, I adored Laura. She has been shunned by her community and is doing the best she can to support herself and daughter. She just deals with her lot in life and tries to almost hide from the town. I wanted good things for her and I wanted her to stand up for herself. I wished her sister Marie would have been more observant to what Laura was going through. Millay really was good for Laura even though she didn't realize it at the time.FALLEN BEAUTY reminded me a bit of Peyton Place (the movie, I haven't read the book). The town is judgmental and in everyone's business and there is always one woman who takes it upon herself to bring others down. And oh the the surprises!!!Once again, Erika Robuck writes a suburb novel bringing a historical writer to life. I will say, the first few chapters were more impassioned than I was prepared for. Robuck plunges right in and lets the reader understand the rawness of Millay. Millay was clearly intuned with her sexuality and allowed it as her muse to create stunning poetry.Robuck's writing is breathtaking and captivating. She does justice to the poet. FALLEN BEAUTY took my breath away, I did not want to put it down. As I read, I was 'in' Millay/Laura's world. By far the best book I've read this year and my guess it will be one of the best books I'll read this year. Robuck is an amazing writer, breathing life into historic writers. Do not miss this book!"}, {"userName": "Barbara Mitchell", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/3367337-barbara-mitchell", "userReview": "Some time ago I read Hemingway's Girl by Erika Robuck and loved it so much I was anxious to read this one. This is her third book featuring a famous person from the Roaring Twenties; the other was about Zelda Fitzgerald and I haven't had a chance to read that one yet.As in the others, Robuck creates a fictional woman who becomes involved (or ensnared) in the life of a real eccentric artistic type. In this one it is Edna St. Vincent Millay who can hardly be overdone in eccentricity. Our fictional heroine is Laura Kelley, a small town seamstress who has an illegitimate child. The little girl, named Grace, is adorable and a delight for her mother, but both are shunned by the holier-than-thou leading citizens of the town. The father isn't named but we know he still lives in the town, and I had the wrong man in mind until near the end of the book.Out in the country nearby is a large house where Millay and her husband live. The townspeople gossip tirelessly about the wild drunken parties that go on there, especially since they know men who have been seduced by the poet. Apparently Millay and her husband have an \"open\" marriage, anathema to the rest of the world in that part of upstate New York.Laura's only friend is her sister but that relationship is strained as well. When no one will bring work to Laura and her electricity is shut off for nonpayment of the bills, Millay asks her to make an at home gown for her. She pays ahead of time and Laura relishes working with rich fabrics, but she is afraid to let anyone know that she is sewing for the \"witch.\" More orders follow for Laura's own designs. Such rewarding work.Although I loved the character of Laura and enjoyed the up-tight townspeople, the real reason to read the book is this look at Edna St. Vincent Millay. I had read something about her before so I knew what kind of person she was, but I believe fiction is the way to really get to know her and her lifestyle. She was so self-centered it's hard to believe, but that's the way it was.Highly recommendedSource: Amazon Vine"}, {"userName": "Alicia", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/1806073-alicia", "userReview": "I am endlessly fascinated by the characters Robuck chooses to write about and also the unimaginably beautiful way Robuck puts a sentence together. Every word drips and I must slow to catch it. She focuses on writer/poet Edna St. Vincent Millay and her lifestyle during the '20s and '30s in Chatham, NY at her estate called Steepletop. She combines this woman's eccentricities with the sins of a \"common girl\" Laura Kelley who has become pregnant after she consummates an affair with a married man, who remains a mystery until the very end, and is ostracized by the townspeople. It is as much about small-town gossip, redemption after hurt, survival (especially for both women), and many other layers to this onion. The vivid descriptions of the characters' situations beg to be re-read, from Agnes, the widowed high-society lady of the town, whose son-in-law ends up being the father to Laura's child, and succumbs to a heart attack weeks after the town learns that it was him. There's Father Ash who is outed as coveting Laura from afar when his journal, his private feelings, are shared with the town. There's loving Gabriel, a wounded veteran, who seeks the affection of Laura. Marie, Laura's sister whose husband had sex with Millay at a wild party. But it's Laura who I am more interested in than Millay at times. The care, sacrifices, and beauty of Laura's life comes alive within the pages as she struggles for work sewing, not only because it's her passion, but because it's her livelihood and she's doing it for her 'bastard' child, Grace, an innocent in all of this, but who enjoys relationships with people like Gabriel and Millay. I could write an essay about the layers, the pain, the sacrifice, the hurt, and every other passion that lies within the book. Robuck is a master storyteller."}, {"userName": "Marcie", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/3910792-marcie", "userReview": "Erika Robuck has written several novels pairing famous authors, Hemingway, Fitzgerald, and now Millay, with ordinary people. Except ordinary is hardly a word to describe them. Because these other people are very strong characters as well. While I liked Hemingway's Girl and Call Me Zelda, Fallen Beauty is by far my favorite. I don't know much about Edna St. Vincent Millay, but this book has definitely painted a good picture of her. Millay was far ahead of her time. In today's day and age, we wouldn't think much about her lifestyle, but in 1920 she was quite a character. She was not afraid to live out loud. In the book Millay has almost an obsessive behavior about wanting to get close to the main character, Laura Kelley. She believes Laura will be the muse to her writing.Laura grew up in a small town, where everyone seemed to live a perfect life on the outside. She is shunned by most of the town when she has a baby out of wedlock. My heart broke for this character. She suffers a great deal in this book, but she also finds her strength. And I've never so badly wanted to punch fictional characters before. Even in the end, Robuck gives you an understanding of why some of the characters act that way, and you can't help but pity them.Fallen Beauty evoked an array of emotions from me. I was hooked from the first page to the last. I also loved the time period in which this book took place. There is something about the glitz and glamour of the twenties that draws you in. This is a great read, and I can't wait to read Erika Robuck's next book!Read more at http://www.2readornot2read.com/2014/0..."}, {"userName": "Catherine at The Gilmore Guide to Books", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/1873196-catherine-at-the-gilmore-guide-to-books", "userReview": "Fallen Beauty is the story of a lovely young woman, Laura Kelley, who pays the price for one night of passion by becoming pregnant. It’s 1928 in upstate New York and her decision to keep her child, despite the father’s unwillingness to acknowledge her, changes the course of her life. Both her parents are dead and so, at age nineteen, she is left to run their dress shop alone after her sister leaves to get married. Her talents are prodigious but not enough to sway the opinions of the local women who shun her so she struggles to support herself and her daughter.At the same time as these more mundane aspects of life unfold, there is an alternate universe operating in a remote mountain town nearby. The renowned poet Edna St. Vincent Millay lives on an estate with her husband and hosts parties known for their wildness and free love attitudes. All is in the name of Millay’s work and she draws inspiration from everything around her. There is no repression in her life or her work so when she hosts a party and Laura’s sister attends, wearing one of Laura’s creations, it brings Laura’s talent to Millay’s attention. The problem? Millay’s wild lifestyle and the fact that she slept with her sister’s husband means that despite the much needed income a wealthy patroness would bring her, Laura does not want to makes dresses for her. When circumstances force her to work with Millay she is less than impressed by the poet’s intensity and extreme behavior.The rest of this review is available at The Gilmore Guide to Books: http://gilmoreguidetobooks.com/2014/0..."}, {"userName": "Beth Mills", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/8314474-beth-mills", "userReview": "Those who only knowEdna St Vincent Millay through her poetry may be startled by Robuck's portrayal of her as a selfish, needy, but wildly talented hedonist ( which is definitely borne out by biographical fact.) In Fallen Beauty we have the picture of a poet driven by her art, desperately seeking sensation to feed her muse and keep the poems coming. Residents of the small town near Millay's home, Steepletop, observe her unconventional lifestyle with both fascination and moral outrage. Observing all this is Laura, a young seamstress who is also looked down upon by the town because she has borne a child out of wedlock and refuses to reveal the father. While struggling to make a life for herself and her young daughter Laura is drawn into the poet's orbit by orders for elaborate costumes for Millay's tours which stimulate Laura's own dormant creativity. It is fascinating to watch both women struggle with the competing demands of talent and relationships as well as the need to be true to themselves set against the cost of flouting convention. The portrait of both the real and the imagined woman are equally affecting and make for a fascinating story."}, {"userName": "Stephanie", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/23783330-stephanie", "userReview": "5++++ stars!!!! I received this book as an ARC and I absolutely fell in love with it!!! This is a very intriguing story that keeps you reading until the end. I was unfamiliar with Edna St. Vincent Millay before reading this book and I found her very interesting. Her and the other main character, Laura-a single seamstress with a child- are both relatable in their own ways to the reader. The story revolves around their lives and what happens once they meet. Based on historical facts of Millay's life, the decade and the way life was at the time, the story is one that pull at your heart strings for multiple reasons. The author has a way of writing that makes you feel like you are right there sharing everything right along with the characters. Her way of describing scenes, the characters, costumes, clothing, feelings, etc. are just terrific. Nothing but high praise for Erika Robuck and Fallen Beauty!!I highly recommend this book to other fans of Historical Fiction.(sorry, I'm not great at reviews)"}, {"userName": "Christine Rebbert", "userReviewDate": "May 25, 2014", "userURL": "http://www.goodreads.com/user/show/2413207-christine-rebbert", "userReview": "This was a selection for Sykesville Tuesday morning book club, and while I had not finished reading it at the time of the meeting, I wound up really liking it when I did finish. This is a story about Edna St Vincent Millay in the late 1920's and her relationship with a local dressmaker, a \"fallen\" woman who has had a child out of wedlock and is ostracized for it in the little town in the Berkshires (Mass.) I was a big fan of Millay's back in my 20's, and reading about her of course inspired me to go back and read some of the favorites that I'd laboriously hand-copied into a journal some 40-odd years ago. I even brought my favorite to the book club and read it out loud (sonnet ii). (And I wasn't the only dork who'd brought in a poem to read.) The book club meeting was enlivened by a call-in from the author, and we got to talk and ask questions for about 15 minutes; pretty cool. So, interesting story, well-written, and inspiring in the sense of wanting to read more about Millay, and more BY her."}, {"userName": "Barb", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/849475-barb", "userReview": "Different books for different readers or as my mother says \"different strokes for different folks\". I've never been a romance reader, I have a hard time suspending my disbelief and not rolling my eyes at the many contrived misunderstandings, coincidences and leaps to instant true love that the romance novels seem to invariably include. I know there are many readers who enjoy those books for the pure escapism they offer and I'm not judging them. But I'm not one of them and I know we are not going to enjoy the same type of books. I do think those readers will more than likely enjoy this novel.This book is easy to read but it lacks subtlety and depth, the characters aren't well developed and the dialogue isn't very authentic. It has some annoying coincidences that turned me off and I found that I just didn't care what happened to these characters. I'm marking this one \"not for me\" but I know that there will be many who love it."}, {"userName": "Elizabeth", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/8704843-elizabeth", "userReview": "4.5 stars for the Millay chapters, 2.5 stars for the Laura chapters, so 3.5 stars as a compromise. (I see some other reviewers have had the exact opposite reaction.) For me, Millay/Vincent was a totally compelling character, with such a distinct voice and unusual outlook on the world. No, she's not likeable, but I found her fascinating. I only wish there had been more about her background and what made her the type of woman she was. The Laura chapters were fine. Robuck is an excellent writer, with a lovely descriptive style. But for me, those chapters dragged compared to the melodrama of the Vincent chapters. Again, others may completely disagree--it's just a matter of personal taste. And I did appreciate that the author created a bit of a mystery by not revealing the identity of Laura's lover until the very end.I received a copy of this book through a publisher's giveaway in exchange for an honest review."}, {"userName": "Teddy", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/271544-teddy", "userReview": "The story of Fallen Beauty is told in turns from the two Main Character, Edna St. Vincent Millay and Laura Kelly, an unwed mother/seamstress. It is fiction but Edna St. Vincent Millay is the famous poet from the mid 1930. She routinely packed auditoriums for her readings. Laura Kelly was a fictional character.It took me awhile to warm up to this story but I am glad I stuck with it. It captures the time and place and once I got use to it, the writing was exquisite! Because Laura was an unwed mother and the way the priest in the town was portrayed in the story. It sometimes reminded me of ‘The Scarlet Letter’ by Nathaniel Hawthorne. However, it really is much different with a much different ending. That’s about all I can say without giving major spoilers but if you like historical fiction, the Jazz Age, and/or literary fiction, you should read Fallen Beauty! I highly recommend it!"}, {"userName": "Beth", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/2920332-beth", "userReview": "Love and obsession, questions of loyalty and desperation, and the hard lines of judgment are powerful themes in FALLEN BEAUTY. The glamour of the Jazz Age comes to life, and Erika Robuck’s writing talents and impeccable historical research shine. Though I’ve read many of Edna St. Vincent Millay’s poems, I knew nothing of her life, and I found her excesses alarming. But in Robuck’s capable hands, those excesses are balanced with the creation of the character Laura, and she becomes the perfect counterweight to Millay’s outrageous lifestyle. The secrets and self-discoveries of these two polar opposites are stitched together in a story that is as fascinating as it is thought provoking.FALLEN BEAUTY is wholly original and unputdownable, and it’s sure to be a big hit among historical fiction fans. Highly Recommended."}], "description": "\"Without sin, can we know beauty? Can we fully appreciate the summer without the winter? No, I am glad to suffer so I can feel the fullness of our time in the light.\"Upstate New York, 1928. Laura Kelley and the man she loves sneak away from their judgmental town to attend a performance of the scandalous Ziegfeld Follies. But the dark consequences of their night of daring and delight reach far into the future...That same evening, Bohemian poet Edna St. Vincent Millay and her indulgent husband hold a wild party in their remote mountain estate, hoping to inspire her muse. Millay declares her wish for a new lover who will take her to unparalleled heights of passion and poetry, but for the first time, the man who responds will not bend completely to her will...Two years later, Laura, an unwed seamstress struggling to support her daughter, and Millay, a woman fighting the passage of time, work together secretly to create costumes for Millay's next grand tour. As their complex, often uneasy friendship develops amid growing local condemnation, each woman is forced to confront what it means to be a fallen woman...and to decide for herself what price she is willing to pay to live a full life.\"Lovers of the Jazz Age, literary enthusiasts, and general historic fiction readers will find much to love about Call Me Zelda. Highly recommended.\" –Historical Novel Society, Editors' Choice", "title": "Fallen Beauty", "url": "http://www.goodreads.com/book/show/18114124-fallen-beauty", "average": 3.76, "cover": "https://images.gr-assets.com/books/1385351628l/18114124.jpg", "reviews": 210, "authors": [{"url": "https://www.goodreads.com/author/show/2867287.Erika_Robuck", "name": "Erika Robuck"}], "type": ["Historical", "Fiction", "Historical", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18114124-fallen-beauty", "http://www.goodreads.com/book/show/18484520-fallen-beauty", "http://www.goodreads.com/book/show/13485500-hemingway-s-girl", "http://www.goodreads.com/book/show/15810873-call-me-zelda", "http://www.goodreads.com/book/show/23281845-the-house-of-hawthorne", "http://www.goodreads.com/book/show/6313435-receive-me-falling", "http://www.goodreads.com/book/show/36247512-hockeystrong"]}