{"ratings": 3725, "userreviews": [{"userName": "Cara", "userReviewDate": "Aug 20, 2009", "userURL": "http://www.goodreads.com/user/show/1876075-cara", "userReview": "Before I really knew what was happening I was done with this book. It draws you in so quick, and is such a breeze to read it's hard not to gobble it up in one sitting. I had thought to read it again before I did a review, but I felt like I had to write one now.It's in verse so at first that gets some getting use to. No worries there is a sufficient amount of dialogue, so it never feels too \"poemy\". You'd think with the length of this book you wouldn't feel attached to the characters or that they wouldn't be three dimensional, but they totally are. Each one had a unique quality to bring to the book.The book begins innocently enough. Alice is dealing with the death of her mother, getting used to a new sister, new mom, her wonderful boyfriend, and the rocky relationship with her friend Claire. Things change drastically when Alice, Ivy (her new born half sister), and Vic (her new stepmom) get stuck in a snowstorm. This forces all involved to see each other in a different light. I was shocked to realize I liked this so much. It was so short and to the point, but never felt like something was missing. It gives you the message that things bigger than us are at play in helping us. Something we need to hear every once in awhile.Oh I have to mention how symbolic the whole thing that happens to the guitar (can't say what happens, kind of would be a little spoiler). I also found that her boyfriend's name being Blaze was kind of fitting. You know her being in all that cold and her \"Blaze\" was part of what kept her going."}, {"userName": "Ash", "userReviewDate": "Sep 02, 2009", "userURL": "http://www.goodreads.com/user/show/1884487-ash", "userReview": "Alright, I admit that at the beginning I wasn't all that excited about reading this. It's in poem form and I don't usually understand poems. People in poems are usually really depressed, which in turn makes me depressed or totally confused. I found this book surprisingly easy to read though. It's strange at first because the sentences sound kinda choppy, but you adapt pretty quickly and the words start to flow much better.Quick Overview: Alice has lost her mother to cancer and has to deal with a dad that pushes her away because she reminds him so much of her. She still hasn't gotten over the fact that her mother has died and time hasn't done much healing. She's angry at her dad and doesn't like her stepmother, even if everyone else seems to think she's nice. She's also a new big sister, but she doesn't feel like pretending to be a happy family. The only bright lights in her life are her friend Claire, her great boyfriend Blaze, and playing her music. So when her dad and her stepmother Victoria tell her that they're all going to Victoria's family for Thanksgiving she's not happy. But something happens that forces Alice to look at the life she has and to \"find the gift in the little things\".First off, I absolutely HATED Alice at the beginning. I thought that she was totally selfish and mean and it made me really want to stop reading the book. It also annoyed me that it constantly talks about how much she kisses and loves Blaze. Even if Blaze proves to be a great guy I kept thinking: Alright I get it, they love each other! But seriously the second half of the book totally makes up for it! It was so beautiful and I loved how she bonds with Victoria and Ivy. I thought the thing about teen sex was dealt with really well, and she decided not to do it for the right reasons. I was so worried about how everything would end, and I was very satisfied with the outcome. A very beautiful story, you just have to get through the depressing beginning. It's totally worth it."}, {"userName": "Bonnie", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "3.5 starsInterested in more of my reviews? Visit my blog!’Memories fall like snowflakes upon my dreams.’The StorylineAlice lost her mother years ago but it changed her deeply despite the fact that everyone else around her has moved on. Her father has remarried a woman named Victoria and they’ve just had their first child; Ivy. Not able to accept this new family of hers, she remains as distant as possible. The two constants in her life are her best friend Claire and her boyfriend Blaze.On the way home from Victoria’s parent’s house, Alice, Ivy, and Victoria get stuck in a snow bank on the side of the road with very little to survive on. Despite the dreadful situation, it does allow Alice and Victoria to get to know one another and Alice finally begins to realize that there really is happiness still left in the world.My ThoughtsFinding out that this was written in verse I immediately moved it up in my list. I’m new to discovering this writing style but it’s become an instant favorite of mine. I did enjoy the writing of Lisa Schroeder; it was chalk full of beautiful, vibrant lines. The story itself was enjoyable despite its predictability, although I did not anticipate it being quite as religious as it ended up being. This was an extremely quick read that still manages to showcase each of the characters nicely and makes them thoroughly relatable. I definitely enjoyed it and will be adding Lisa Schroeder to my list of authors to look out for.”…it’s no use going back to yesterday, because I was a different person then.”"}, {"userName": "Emerald", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/18077289-emerald", "userReview": "“Wonderland is here now.Don’t know what we might see.Yesterday’s gone forever.But my future’s up to me.What a future it will be….”"}, {"userName": "Laura", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "Words Words Words…I have completely fallen under Lisa Schroeder’s enchanting and magical way with words. Such power and emotion rise out of her seemingly simple, straight forward and beautifully strung together words. Ms. Schroeder gut punched me more than once with this one!Far From You tells the story of Alice and her journey of pain, loss and growth after her mother’s death. Her father has moved on and remarried with a new baby on the way—so where does Alice fit in now? I can still feel the hole in Alice’s heart in my own. Loss, emptiness, grief, selfishness, spirituality, passion, love, and so much more are all captured and conveyed in these words and pages. Alice’s loss, longing, and love of family warmed my heart and pulled me right in. I felt almost safe within the words.How? How can verse style evoke such a reaction out of me with just a handful of words on each page? Verse books used to terrify me, but now I am just in awe! The mystery, power, and love of words will never cease to bowl me over. The same can be said for Ms. Schroeder’s writing! A truly beautiful experience.Alice's story inspired me to try to find love in new ways, let go of some anger, and see the little things again that make me smile. See what she does to your heart.“The waveof emotiongrowsbigger and bigger,becoming a tsunamias I pound the seatwith my fistover\tand overand over\tand overand over,\tharderand harder\tand harderand harder\t\tand harder,until my hand hurtsAnd I SCREEEEEEEAAAAM”"}, {"userName": "Lisa", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/1083438-lisa", "userReview": "This is my second book, about a girl, Alice, who is a singer/songwriter."}, {"userName": "Anna", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/5744962-anna", "userReview": "Oh how I love Lisa Schoeder's writing style. She just kept it small yet so full of emotions. Reading in verses excites me especially when it comes to her books. And this is a second book that I've read from her and honestly, it never disappoints me.Reading her works is like reading a diary where you get to see real and raw feelings that doesn't sound exasperating at all. Alice thinks she is left alone. Her mother died, her father remarried and the bad news is he's having a baby. All what's left of her is the comfort of her loving boyfriend, Blaze, which for me is too good too be true. I find Blaze to be such an amazing boyfriend, really. But it doesn't look so real the way he is way too inlove with her. Anyway, Alice just dislikes her stepmom so much but with a simple test of fate, she realizes people are actually good in there own way. They do not try to replace who was missing but simply fill up the space to make it more whole again. I love the concept of the story how it focuses on great maternal love which I think is very divine. The story just jumped out of the pages and before I realize it, I was done. It wasn't such a sad ending but it looks to be a very good beginning for her with regards to the thought that she has the opportunity to start a new life. \n\n\"Funny how times go on, things change, and yet, some things stay exactly the same.\"\n\nxx"}, {"userName": "Heather ", "userReviewDate": "Jan 31, 2010", "userURL": "http://www.goodreads.com/user/show/1776907-heather", "userReview": "WOW. Is all I can say...I picked up this book at my local library and started it earlier today. The entire book is written in prose. Each chapter a new poem. For me, it was a nice break from the every day writing style we are used to. I finished it in a couple of hours because I couln't put it down.Alice deals with the grief over losing her mother to cancer, adjustment to a new family dynamic, doubts of faith, and near tragedy. It is a beautifully rich yet down to earth and raw look at what it feels like to lose someone and have them replaced by new and strange people. I think it is a great read for any teen who has gone through trying to adjust to a new step-parent, or the loss of a parent. Alice also struggles with the question of abstinence and it is handled by her boyfriend Blaze in a mature and loving manner. I love that she held on to that belief and was supported in her decision.The story touched at heart strings as Alice feels enveloped in a comfort and peace that is not of this world. She feels her life has been touched by an angel in the moments she struggles to save the life of her newborn half-sister. I was brought to tears by the encompassing process of healing and hope.An absolute Gem. Five out of five stars! See the book trailer here: http://fireandicephoto.blogspot.com"}, {"userName": "Valerie", "userReviewDate": "Sep 01, 2009", "userURL": "http://www.goodreads.com/user/show/1879727-valerie", "userReview": "In the beginning I didn't like Allison. Mostly because she was so self-pitying and selfish. She wanted her father all to herself and therefore resented her stepmother. She, in a way, just refused to be truly happy (except when she was with Blaze). Allison did make some good points and I could forgive her some because she was hurting but she could've at least TRIED to make things better for herself. She grows during the course of the book, well mostly when she is trapped in the storm with her stepmother and half sister. She realizes that it isn't all about her and also that she will always have her mother.I like that the one relationship that held true was the one Allison had with her boyfriend. She struggled with her other relationships. In most of the books I've read, it usually the other way around. Its something refreshingly different.The poetry format put me off a bit at first but I could follow easily. The format added good emphasize when the author was trying to make a point. I felt for Allison. I could see her uncertainty, sadness, and pleasure come out of the story. I thought it was good writing if you didn't catch that. A lot of emotion for such a short book."}, {"userName": "Tanja (Tanychy) St. Delphi", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/4465641-tanja-tanychy-st-delphi", "userReview": "It's simply unbelievable how Lisa Schroeder expresses emotions so beautifully in her books, every line is on a right place. ..Wonderland is here now.Don’t know what we might see.Yesterday’s gone forever.But my future’s up to me.What a future it will be…."}, {"userName": "Kristina Čechová", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/5231162-kristina-echov", "userReview": "Oh,Lisa! And I thought I wouldn't cry!Tak tohle byla má prvotní reakce po přečtení další knihy z pera této talentované autorky. Nemá smysl se neustále opakovat, jak jedinečný styl psaní Lisa má, jak umí chytnout člověka za srdce, jak ho umí ponaučit, vzpamatovat se z reality a chvíli nechat popřemýšlet, na čem tady na zemi v našich životech doopravdy záleží. Je to láska. Vždycky to byla, je a bude láska. Ne jen k přátelům a k našim partnerům, ale také k rodině a k lidem, kteří se bez našeho přičinění objeví v našich životech. Kdo ještě neudělal tak významný krok pro sebe samotného a nepřečetl si alespoň jedno dílko od Lisy, měl by tak určitě co nejdříve učinit. Já osobně se stále divím a teď se můj div po přečtení další knihy jen prohloubil, proč a z jakého důvodu jsme se ještě nedočkali překladu. Knihy od Lisy jsou sice řazeny jako YA literatura, ale jako romány ve verších by měla být přístupna všem. Všichni všech věkových skupin by se měli poučit. Všem by tyhle romány hodně daly. Hodně lidí by si poplakalo a cítilo by se přitom tak, kruci, příjemně. Far From You je další z těch knih, kde se setkáváme se ztrátou člověka a smrtí jako takovou. Odmítáme se učit \"znovu\" žít, odmítáme se podvolovat nátlaku ostatních, že je už na čase jít dál, vedeme si svou a truchlíme si v tom svém životě a světě a trápíme tak i ty ostatní. Každý má na všem vinu, každý se chová, jako by nám v životě nic nechybělo. Neuvědomujeme si, že se z nás, kdysi skvělých lidí, staly trosky a sobečtí lidé. Ale jakmile se dostaneme do momentu, kdy jsme sami takhle blizoučko vlastní smrti, stačí doslova pár chvil, pár krušných okamžiků a pláčeme sami nad sebou, když si vše uvědomíme. Ale, zaplať pánbůh, že k tomu vědomí dojdeme. Zaplať pánbůh, že ještě víme, kdo jsme, a že se umíme najít."}, {"userName": "Vanessa", "userReviewDate": "Aug 24, 2009", "userURL": "http://www.goodreads.com/user/show/2660371-vanessa", "userReview": "At first I was worried that Alice's tale would be just another teen angst story, but written in captivating verse, Lisa Schroeder's words caught my attention right away. Alice Andreeson, a normal girl with normal problems, felt amazingly real to me. Dealing with her father starting a new marriage after her mothers death, we saw Alice her in her happy moments and sad moments. I was impressed that we even saw her traveling through the very same daydreams I have as she deals with her friend's surprising betrayal. Any reader will be able to relate to Alice's universal feelings of loneliness and eventually hope as well as their own capacity for bravery once Alice's harrowing adventure through a blizzard takes shape. At the end of the book I couldn't help but wish for the opportunity to brush up next to some of the dangerous situations Alice had, just so I could say I've done it! I highly recommend Far From You to anyone looking for a quick and exciting read."}, {"userName": "Seanna", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/71482741-seanna", "userReview": "My reading teacher gave this book to me to read, at first i was skeptical about it i don't know why i was skeptical i just was. But after I read the first poem I knew this was going to be a great book. Guess what... it wasn't just a great book it was a amazing book. Lisa Schroeder is a great author but the sad part is my reading teachers other books written by Lisa Schroeder were misplaced. Now we must wait for the new books to come in and I am really excited. Lisa Schroeder's books give a good input on things that maybe happening in your life and helps you along the way. In this book its about a girl who's mother died and now she has to deal with her step mother which she hates but later on in the story her opinion changes"}, {"userName": "Michelle. D.", "userReviewDate": "Sep 12, 2010", "userURL": "http://www.goodreads.com/user/show/3699649-michelle-d", "userReview": "I really, really, truly loved this book!The story was great, amazing! The events throught out the book were so memorable and beautifully written. Man, it was so beautiful. Let's move on now.When you read this book(if your a girl), you have to love Blaze. The way he is described and the way the author makes him act, is so whats the word... AMAZING! Man, Blaze is like the perfect boyfriend. If he were real, I would totally go out with him. Int he book, he is described as hot, sensitive and is an awesome kisser. Man, I love Blaze.He's just so AMAZING!Moving on...Claire. Honestly, I had a natural dislike for Claire. I don't know why. It's the same dislike that I have for Justin Bieber. Claire, she's just not, great. Ya know. Her character is great, it's just her thats not great(to me)...This book is a bit contraversial. It has lots of things to do with god. Blaze doesn't like god. Claire loves god. And for Alice, it's an on and off situation. I can't technically say anything about the religious aspects in the book since I'm not Christian or anything, but, some stuff in the book might, I said might, make some Christians annoyed or upset. The music in this book is AMAZING! The author wrote them beautifully and meaningfully. I really liked the first song that was introduced in the book. It just spoke to me. And when Claire was all up in Alice's songs saying that they were too depressing, I was like, kinda pissed. Alice's music is sooo amazing.Ivy, the baby. Even though she was the baby in this book, she took a big part. I don't wanna say why because that would be spoiling it but, yeah. I love the name Ivy!There's also the sex aspect of the book. Sex is a very important matter to Alice in the book. She had many thoughts about it. Though sex wasn't one like a major issue that took a huge part in the book. It was interesting when it was.Let's go back to Blaze. Just kidding. A big part in this book is art and music. Alice's mom was a amazing artist. Art and music wise. Alice says that she got her art abilities from her mom. And I agree. It's sad what \"happens\" but I think it made Alice relize things.I love the whole idea of Alice being named after Alice in Alice in Wonderland(woah).I think it's just great being named after people in books. It just makes me happy.Overall, the book was amazing and it was just AMAZING!!!!!!!!!!! I recommend this book to everyone! Man, it was just so amazing! Man, amazing. Huh, just, simply amazing.P.S. Love Blaze. :3"}, {"userName": "Bianca Rowena", "userReviewDate": "Dec 28, 2015", "userURL": "http://www.goodreads.com/user/show/45700145-bianca-rowena", "userReview": "This was my first time reading this new style of novel writing I'm seeing around more and more, where it's made to look like a poetry book, lots and lots of white space, some pages only have one or two sentences on them. I was pleasantly surprised, I actually enjoyed reading this way. The pages turned really fast. The author captures moments of emotion that I really felt (with her boyfriend, missing her mother). But I rated it 4 stars for the authors writing ability, she's a good writer, not for my personal likes and dislikes as to story preference. I would have rated it 3 stars for my personal preference, because I would have much rather had Alice grow to like / understand her step-mother better over a more gradual change of heart rather than a crises, that's just me though. I didn't like the crisis very much for two reasons, 1. I've had a baby that was 3 months old and I found the crisis unbelievable at times (even 4 hours at Walmart with a newborn would have been more traumatic in real life than the many days they go through in this book) and, 2. when I was able to stretch my imagination to believe what was happening, I found it really depressing and the hopelessness too draining, like it went on and on. Being in a situation like that with a newborn is just too disturbing to think about (for me), it's just one of those things I don't think a person could write about unless they experienced it first hand. The writing itself was great and the book was a good read for anyone who hasn't actually had a newborn of their own. I personally would not have forgiven the father as easily as Alice did, not for a long time. He should have been there, he shouldn't have gone on his business trip, it's his fault, he should have been there for his newborn, I really dislike him. I was so angry with him through the entire book and still dislike him even now. I think Alice is a lot nicer than me :P"}, {"userName": "Laura", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/1895058-laura", "userReview": "Far From You is a story about overcoming the immense pain of loss and having the courage to love. Sixteen yrs. old Alice is dealing with the loss of her her mother and her sudden gain of a new step-mom and baby sister. The only seemingly good thing in her life is Blaze and her music.Without much warning, an innocent trip gone wrong leaves Alice to confront her feelings and to have the will to survive.Lisa Schroeder's writing is completely subliminal. The words on each page just flow through you, resonating and leaving you with so much to think about. It's easy to identify with Alice even in you haven't had a loved one pass away. It's easy for everyone to grasp an idea of pain she feels in the novel. Reading this book made me think over my own life. It makes you want to be stronger, more courageous.This is a fantastic read if your like me and on short time. I think readers will like the verse style since it's \"easier on the eyes\" and seems to go by faster.I don't know if its a necessarily a good thing since it's so good, and I wanted it to go on, but I'm definitely going to read this again. I'd love to see more YA books by Schroeder and I hope she continues to write."}, {"userName": "Eyterna", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/3887400-eyterna", "userReview": "I think i read this soon after a tragedy in my own life. It was very encouraging to read this book, and found it very inspiring. When you feel solitude whilst surrounded by people. You don't need to be put in her situation to feel the raw hunger and need to be with someone. And in her situation, many a time it feels like a kilogram of salt is poured onto gaping wounds, and you wonder, \"Why doesn't anyone see this?\" Whilst this book shows the rare occasion that someone may see the pain you don't express, the truth is, a lot of the times, no-one actually knows until you tell them.Then, it kind of becomes too late, you're so used to being the one that's \"ok\" and \"fine\" that when you try to, or begin to attempt to say something, one uncomfortable look from others, or your own analysis of the terrible change of mood of everyone would clamp your mouth shut. But then there are times when it is appropriate to say something, to express yourself when at other times you cannot. Grasp those times tightly, and don't lose the opportunity.Miracles are rare, but if you can catch one, make sure to treasure it."}, {"userName": "Jenn", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/4357926-jenn", "userReview": "I absolutely loved this book. As someone who has had a stepmother (or two) in her life, I can completely relate to Ali's emotions in almost every way. I love that she lost herself in her music and her boyfriend, and felt so alienated from her family even though it was partly her fault. It's so true of how teenagers are. But the best part, in my opinion was just her overall growth. It was tense reading about her stuck in the snowstorm with her stepmother and baby sister, and I was constantly worrying if they would all make it through ok. But seeing Ali's perspective change, letting her guard down enough to allow her to see things differently was such a tender thing to read. By the end of the book I was crying my eyes out. I really liked I Love You, You Haunt Me, but this book has officially made Lisa Schroeder a must read author for me. Loved. It."}, {"userName": "Medeia Sharif", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/2533986-medeia-sharif", "userReview": "Alice’s mom died of cancer years ago and her father remarried. She dislikes her stepmom and doesn’t feel close to her newborn half-sister. She finds solace in writing songs and being with her boyfriend. When she’s stuck in a car with her stepmom and half-sister during a snowstorm, Alice reevaluates her life and her rocky relationships with others. When the snowstorm worsens and hours turn into days Alice feels the sensation of someone or something, perhaps a guardian angel, watching over her.I was bawling by the end of this book—yes I’m a crier, but only if a book is awesome and beautiful and sad. FAR FROM YOU is a verse novel and goes by quickly, but in fewer words than a prose novel the author packed in so much emotion that I marveled at her style."}, {"userName": "Nidah (SleepDreamWrite)", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/29874933-nidah-sleepdreamwrite", "userReview": "I was putting off reading this for a while now and finally, FINALLY, got around to reading this. Pretty sure a lot who read this, wasn't sure about the beginning. But you know what it does pick up and gets better, interesting, but better. The writing was really good, verse and all. Don't know else to say that others haven't said already. So yeah, pretty good."}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I really think that the Alice in Wonderland allusion/metaphorical novels are getting a little old by this point. I've seen at least three, both self-published and bestseller, in just the past year, and this book was no exception. Although I did like the character of Alice herself, I found this novel to be way too predictable."}, {"userName": "Angela", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/7373882-angela", "userReview": "I love this. It’s so beautiful. I don’t know what else to say about it. It’s just so beautiful.My only complaint is that it’s too short. WAY TOO SHORT. The pages just fly by. I feel like I spent no time at all reading. Ahh, it’s absolutely amazing. <3"}, {"userName": "Hazel (Stay Bookish)", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/5614985-hazel-stay-bookish", "userReview": "Actual rating: 3.5The prose is lovely! I definitely need to read Lisa Schroeder's other verse novels."}, {"userName": "oliviasbooks", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/2843533-oliviasbooks", "userReview": "2011, 4 stars:: Really lovely. It's a keeper. 2014: I have to add the missing star. The rereading experience turned out to be even better than the primary jump into the snow."}, {"userName": "Miss Bookiverse", "userReviewDate": "Jan 07, 2010", "userURL": "http://www.goodreads.com/user/show/1250419-miss-bookiverse", "userReview": "[Wie schon zu Beginn vermerkt, konnte ich den Schmerz über den Verlust von Alices Mutter nachvollziehen. Dennoch fand ich es kitschig sie in Form eines Engels zu Alice zurückkehren zu lassen. Alles in allem hat es zwar gepasst, dass das Mädchen in höchster Not, möglicherweise kurz vorm Sterben, eine Erscheinung ihrer Mutter sieht, aber die Autorin hätte das Wort Engel einfach nicht mit ins Spiel bringen sollen. Das programmiert Kitsch doch irgendwie schon vor.Ähnlich fruchtig geht auch das Ende von statten. Nachdem Alice und co. gerettet wurden, kehrt das Leben wieder zur Normalität zurück. Alice hat nun einen Draht zu ihrer kleinen Schwester und ihrer Stiefmutter gefunden, sie verträgt sich wieder mit ihrer besten Freundin, hat den Tod ihrer Mutter einigermaßen verkraftet, ihr Vater widmet ihr wieder Aufmerksamkeit und auch ihr Freund liebt sie nach wie vor (Blaze stand ich übrigens das ganze Buch lang skeptisch gegenüber, seine Figur war so seltsam angelegt, als könne man ihm nicht vertrauen). Friede Freude Trallala. Es macht zwar Sinn, dass man viele seiner Einstellungen nach so einem einschneidenden Erlebnis ändert, aber es war doch ein bisschen zu viel des Guten. (hide spoiler)]"}, {"userName": "Gracie B", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/71482830-gracie-b", "userReview": "If you don't like this I recommend this it's in story format. I love this book even though I hate poetry."}, {"userName": "Sara Waldo", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/32057862-sara-waldo", "userReview": "I like how she writes in verse. I like her stories"}, {"userName": "Clairyssa Mahaney", "userReviewDate": "Sep 06, 2016", "userURL": "http://www.goodreads.com/user/show/34636288-clairyssa-mahaney", "userReview": "Personal Response: I gave it a 5 out of 5 stars because this book had a great storyline. It had an amazing learning and understanding experience for any person. I liked this book because it showed how two worlds came together. Far From You displayed the heartache and difficulties of two different people and how their lives were not so different than they think. Alice thought Victoria was a horrible person and trying to take her father away from her. When really Vic was still trying to get used to having two new kids brought into her life. I will always feel a strong connection to this book because it reminds me a lot of my stepmother. I thought she was awful just like Alice did with Victoria. In the end of the book it expressed how much love they both share for each other now and how closer than family will be. Plot: Far From You, was a book about a girl named Alice and how she viewed life after her mother had passed away. Her father remarried, Victoria, and had a new baby girl named Ivy. Alice did not want to be a part of the \"happy\" little family, her father thought they had become. When she had to go on a trip to see Victoria's parents, she found a new view on how she saw her \"evil\" stepmother and little sister. On the way home Alice woke up to Ivy screaming and Victoria crying, when she realized they are stuck in the middle of a blizzard she was furious. After a few days Victoria and Alice became best friends and she noticed she wasn’t that bad, Alice found a new friend in her. Characterization: Alice Anderson- Alice was about 16-18 years old, her mother had passed away a few years ago, she felt the loss and grief of losing her mother. After her father remarried she did not want anything to do with them. Alice spent most of her time in her room writing songs or hanging out with her boyfriend,Blaze, and best friend, Claire. When she went on a family vacation, Alice just wanted to curl up and die. The whole time spent as a big \"happy\" family, in her eyes, it is just more bull crap. She found a new light when they head home just Alice, Victoria, and Ivy. Victoria Anderson- Victoria was Alice's new stepmother. Vic tried to stray away from Alice because she felt she hadn't warmed up to Vic to much yet. But in Alice's eyes, Vic could not stand her, which was not the case. When they get stuck in the blizzard Vic learned about Alice, she was there for her and would never try and replace her mother.Blaze- Blaze was Alice's boyfriend and they were both crazy for each other. When Blaze wanted to go all the way with Alice, she said no and it started an argument. Then they both ended up together in the hospital after the blizzard. Claire, Alice's best friend, was also there and they all apologized. Blaze then realized that Alice meant more to him than anything. Impact of setting: Far From You took place in modern times around the New York, Rhode Island area. The area of this book was very important because when they got stuck in the blizzard it could not be in a place where it never snowed or was always hot. The time of the book was also very important because it told the reader where and when the story was taking place. It was easier to understand while reading. Recommendation: I would recommend this book to girls in any grade from seventh and above because it's very important learning experience. It shows that the reader cannot just judge someone based on the way they act or look, they have to talk to them and understand how they feel about what goes through their mind. It also shows when a person going through a hard time who can be there for them and how some people feel during that time. This book is a great example of both."}, {"userName": "Karin", "userReviewDate": "Dec 20, 2008", "userURL": "http://www.goodreads.com/user/show/72729-karin", "userReview": "It has been years since Alice lost her mother to cancer, but she still hasn’t recovered. The three things that give her any peace at all are writing and playing music, her best friend Claire, and her loving boyfriend Blaze. Sadness covers her like a blanket and prevents her from enjoying some of the new things going on in her life.Alice’s father has remarried and he and his new wife are expecting a baby. Alice feels nothing but resentment toward Victoria, the new wife, and the baby that is on the way. When Ivy finally does arrive, Alice doesn’t even go to the hospital to see her and doesn’t want anything to do with her once she comes home.Alice is devastated when her father tells her the whole family is going to visit Victoria’s parents over Thanksgiving break. She is forced to ride the whole way sitting next to Ivy in the backseat acting as a human pacifier in order to keep her quiet. While Thanksgiving is relatively painless, Alice is ready to get back home. With her father called away for a work emergency, Victoria and Alice must make the drive home alone. A big winter storm is moving into the area fast and Victoria decides to leave a little early to stay ahead of it. Alice takes a Tylenol PM to prepare herself for the ride so she can get some sleep and not be expected to talk to Victoria or take care of Ivy. When she wakes up with the car stuck in the middle of nowhere surrounded by nothing but white, she realizes she may have made a mistake. Maybe she should have been paying attention.Lisa Schroeder weaves together individual poems to create a heart-wrenching story of love, loss, and healing. Alice is forced to take stock of her life and decide what really matters. Working together with Victoria becomes a necessity, not only for their survival, but for Ivy’s survival as well. Alice’s struggle with her family and faith come alive for the reader as we experience everything through her eyes. The relationship between Alice and Blaze is refreshing. The devotion the two have for each other is rare for two teenagers in this day and age. Readers will be brought to tears while reading this incredible story of personal triumph and transformation. For more information about Lisa Schroeder and her books visit her website at http://www.lisaschroederbooks.com."}, {"userName": "Mikyla Reeck", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/46816944-mikyla-reeck", "userReview": "Personal Resonse: I think that this was a very good book. I never wanted to put the book down and always wanted to keep reading. It really caught my attention.Plot Summary: Alice, a teenage girl, is living with grief of her mother's death, even though it was a year ago. Alice's parents were still together when her mother passed away from cancer. Her dad moved on from her death and got remarried. After a couple years of being married Alice's dad and new wife Victoria are having their first child together. Their new child, Ivy, was not something that Alice wanted to happen, but she learns to love her towards the end of the book and really cares for her. A couple weeks after Ivy being born the new family went to visit Victoria's parents. This was a long trip there and Alice does not talk much. Alice thinks that Victoria does not like her but she learns that she does not. Alice and Victoria have had a rough start but are doing great at the end of the book. On the way home from the trip to her parents, it is just Victoria and Alice because her dad had to leave for his job. They are on there way home when a blizzard starts. Victoria gets stuck in this blizzard. Alice blames getting stuck on Victoria and then gets into a big argument with Victoria. They do not have much gas left and they have to stay warm. They are out there for two days before Victoria goes to get help. Alice goes another day by herself with Ivy. By the end of that day Alice starts fire to try and stay warm. The next morning Alice is found by her dad and the search team that Victoria got together. It was a rough couple days but things get better for the new family.Characterization: Alice is a teenage girl living through a moment in life with her mothers death. It has been a rough year for her but things are starting to look better for her. Alice and her boyfriend always stay on good terms, but her best friend, Carrie, get into a fight. This makes Alice upset again, but in the end they figure everything out.Recommendation: I think that anyone looking for a really good and fast book should read this book. It is also a book that could make people realize to not hold grudges on people because they can be good people."}], "description": "Lost and alone...down the rabbit hole.  Years have passed since Alice lost her mother to cancer, but time hasn't quite healed the wound. Alice copes the best she can by writing her music, losing herself in her love for her boyfriend, and distancing herself from her father and his new wife.  But when a deadly snowstorm traps Alice with her stepmother and newborn half sister, she'll face issues she's been avoiding for too long. As Alice looks to the heavens for guidance, she discovers something wonderful.  Perhaps she's not so alone after all....", "title": "Far from You", "url": "http://www.goodreads.com/book/show/6654646-far-from-you", "average": 4.08, "cover": "https://images.gr-assets.com/books/1328336530l/6654646.jpg", "reviews": 449, "authors": [{"url": "https://www.goodreads.com/author/show/588558.Lisa_Schroeder", "name": "Lisa Schroeder"}], "type": ["Young Adult", "Poetry", "Contemporary", "Romance", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6654646-far-from-you", "http://www.goodreads.com/book/show/4732517-far-from-you", "http://www.goodreads.com/book/show/7103898-far-from-you", "http://www.goodreads.com/book/show/1832749.I_Heart_You_You_Haunt_Me", "http://www.goodreads.com/book/show/6556855-chasing-brooklyn", "http://www.goodreads.com/book/show/8922087-the-day-before", "http://www.goodreads.com/book/show/6645867-it-s-raining-cupcakes", "http://www.goodreads.com/book/show/13553217-falling-for-you"]}