{"ratings": 10025, "userreviews": [{"userName": "Cait • A Page with a View", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "guys, it's WEREWOLVES ON THE TITANIC.The overall story wasn't quite my cup of tea, but I think someone who's more into the whole YA paranormal scene would have fun with it. I just loved the premise so much that I had to see what on earth the story would be about. I DID love how the author was so careful to not fictionalize any real person's life. She invented any significant figure who needed to be in the story and the whole author's note was just really cool."}, {"userName": "Cait", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5254851-cait", "userReview": "I rated this book 3.5 stars, and there are some slight spoilers, but they're not that huge. So read it now........if you DARE! Let me start off this review by saying that I love love love love  love  the American cover for this book. It has everything I want: it's got raised lettering, different textures, and it's oh so tantalizingly shiny. I'm seriously obsessed with it right now. Sometimes I just sit in my room for hours just stroking and thinking about the many dirty things I could do with it, because I'm totally cool like that.*drools just thinking about it*Ahem......but  anywayssss....  on with what this review should be about: the inside of the book! Is it sad to say that I liked the male love-intrest a lot more than the MC? Because I really really enjoyed Alec a lot more than I ever expected to. I mean, it's about a werewolf. On the freakin  Titanic.  First off; Claudia Gray knows how to write a damn smexy character, and I could really picture his character and how he looked inside of my head. And I also loved his backstory; I just wanted to know as much about him as I could, and my heart always bled for him when we find out how much his curse has really destroyed his life. However, unlike a certain  other  character from  Twilight  a different novel that will remain unnamed, he just doesn't sit around twiddling his thumbs and feeling sorry for himself. He's actually trying to  change  and figure out a way to ease the pain and suffering that he has caused his father and, when he needs to, he'll put his love for Tessa aside in order to do what is best for the greater good, which is something rare that you don't see too often if the wild and dangerous world of YA novels these days.And I did like Tessa. She's definitely not the most stand-out female MC that I've ever read, but she was... nice. She wasn't a total idiot and said some very funny things sometimes. I didn't like the insta-love that happened with her, though. I got the typical:  a weird zing went through me, our eyes met, my heart got stuck in my throat, and I couldn't stop staring at him insta-love.  Blah. I've had enough of that in the 180+ books I've read on Goodreads and the hundreds, if not thousands that I've read on my own, so she lost a bit of respect with me there. She did have a backbone for the most part through the novel, and it was nice knowing that she was going to leave their service as soon as she got to America, which was why she was trying to be good with her employers, and that at least she was  thinking  horrible things about them.Also, the Brotherhood is freaking scary and messed up; I really like how Gray wrote them into the story. They were good suspense and really helped me connect to Alec's pain. Because Alec is just freaking awesome, and I love Alec. Oh, and one of the biggies that really made me like this book is that they  actually  have sex! It wasn't descriptive, though, Grey just tells you through Tessa that they did, but that's a hell of a lot better than many authors I've seen. I really just don't get it. What's so wrong with sex, authors? Most kids in this day and age have heard about it by sixth grade , if not earlier, from TV or some other source. Hell, some kids  are fucking selling pot to their peers at the ripe 'ol age of six.  I guess what I'm trying to say is  get over sex, authors!  America at least and most people that read YA these days are practically desensitized to that touchy (he he I'm punny) subject, so either write about it, or make your MC a nun. Or make them a nun, have sex with the priest, and get kicked out or something, dammit!Here's some of the things I didn't like, however. I really didn't like Tessa's family that she served, and not the hate dislike, I didn't like them because they weren't developed well by Gray. I felt like a lot of scenes with them were just re-recycled and just used over and over again. Tessa walks in. Tessa helps Irene. Lady Regina/Layton walks in and says mean things to Irene or Tessa. Tessa is frustrated. Tessa leaves. Tessa finds Alec. And it just goes on, and on, and on in the never-ending loop of boring repetitiveness to where I basically knew the nuts-and-bolts of what was going to happen before she even walks in.  Bo-ring! And the ending was kind of......weird. I felt like that she just threw how Alec was able to survive because she needed to figure out somehow for him to come back. It didn't feel natural and the solution was basically thrown at me out of left field. I mean, the ending was cute that they could be together and all blah blah blah, but I feel like it should have happened  differently  than it did.In the end this book is a nice, light read, with a freaking adorably smexy love interest and an interesting enough premise that just slightly fell through. The writing was never stellar, but it was good enough for me to give it 3.5 stars, so if you're looking for an easy read that's not a series, pick this one up  and buy the freaking book so that you can pet it!!! Ahem....I um... I mean..Happy reading! Yeah....that's what I meant."}, {"userName": "Rebecca", "userReviewDate": "Jul 24, 2010", "userURL": "http://www.goodreads.com/user/show/2150074-rebecca", "userReview": "For years, Tess Davies has worked as a maid for the Lisle family at their manor house in England. But she has always dreamed of a better life, and now that she has saved up enough money, she has decided leave her job. And she gets the perfect opportunity when she is chosen to accompany the Lisles on an ocean voyage to New York. A new country is the perfect place to start a new life. And they are sailing on the maiden voyage of the largest, most elegant ship ever built, the RMS Titanic.Shortly before boarding the ship, Tess meets Alec Marlowe, a handsome first class passenger. He saves her life - then warns her to stay away. Alec clearly has a terrible secret, but Tess is drawn to him despite that. The two quickly find themselves falling in love, but the biggest obstacle to their relationship isn't their different social classes. An evil brotherhood of werewolves is stalking Alec, determined to force him to join them - and now they are after Tess, too. And as if that wasn't enough, they will face a far greater danger before the voyage is over.I have been fascinated by the story of the Titanic for many years (even before the movie was released) so when I first heard about the plot of Fateful, I was a bit aghast at the idea of a novel about werewolves set on the Titanic. But I'll read just about anything set on the Titanic so I knew I had to read it, and I'm really glad I did, because this book turned out to be really good - it's one of my favorite books I've read recently, and probably my favorite paranormal romance ever. I loved the romance between Tess and Alec. They were adorable together and it was so sweet how protective and caring he was towards her, unlike in some paranormal romances where the guy acts like a jerk because of some supernatural curse that made his life miserable and the poor girl falls in love with him anyway for some reason. If you love historical romance, paranormal romance, or books about the Titanic, I highly recommend Fateful.Disclosure: Review copy provided by publisher."}, {"userName": "Dixie Marie", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/2712247-dixie-marie", "userReview": "As if the movie didn't make ne cry enough! This book put me in constant tears near the end! I thought we were gonna have the Titanic movie all over again! Thank God we didn't."}, {"userName": "Lea", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/5152540-lea", "userReview": "Hands down, this book was absolutely incredible. Fateful was a retelling of Titanic's story combined with a unique paranormal twist-- it had my heart racing and left me speechless by the end. I burst into tears at multiple parts of the story, because it was that good at drawing me in and making me feel emotionally invested in the characters-- even the minor ones. The writing was both beautiful and powerful, and the story, despite being paranormal, was very true-to-life and accurately followed historic accounts of Titanic's fate. Altogether, Fateful was one amazing book!The romance between Tess and Alec was done so well. Their love was genuine and not superficial, and I loved reading along to see their relationship develop, despite the fact that there were so many barriers between them. Not only is Tess a third-class servant and Alec a first-class heir to a major fortune, but Alec also happens to be a werewolf who has no control over changing into a monster every night. These two things work against Tess and Alec being together, but Claudia Gray had me totally convinced that their love was strong enough to overcome all odds. By the end, like I said, I was crying so hard I could barely read, I kid you not! It was just a very touching and beautiful story.The historical account of the doomed voyage of the Titanic was done perfectly-- you really felt like you were actually there on board. The whole time I was reading, I knew that the inevitable was going to happen eventually, and I was on the edge of my seat the entire time, wondering when it was coming. Just like when watching the movie Titanic, (which, by the way, I LOVE, so this review *might* be a little biased!) every character and every relationship became that much more important and special, because you know in the back of your head what they're all about to go through...Claudia Gray notes at the end of the story that all of her characters, except a few famous ones who make \"cameo appearances,\" were fictional, because she didn't want to be disrespectful towards those who went through the unforgettable disaster. I loved that she did this. Even though it is an alternate history with a paranormal twist, I thought that nothing was ridiculous or took lightly the actual story. And the account she tells of how the Titanic sunk, and what those people went through? Once again, I was bawling. Finally, the ending was spectacular. Crying aside, I actually gasped out loud at one point, I was so freaked out-- I won't give it away and tell you, but I will just say, the ending was totally unexpected and I could not put the book down for the last 100 pages or so. I stayed up until almost 2am to finish! ***Because I am a big history nerd, I DO have to state however, that if Tess had been on board Titanic as a servant to a first-class family in real life, she would have had a cabin close to the first class rooms, and not have stayed in Third Class-- Titanic was simply too big for servants to be stowed in Third Class, since it was too far away from First, so rooms were reserved for them near the families they served for convenience sake. But I can understand why Claudia changed this factual detail, since it gives us a look at all parts of the ship and all aspects of life on board for the different classes! I will just end this review by saying that this is one book I highly recommend to all my fellow book-lovers. If you love paranormal romance but want something different than vampires or fairies, or if you love historical fiction that is done really well-- get Fateful and make it your next read! It definitely was one of the best books I have read in a long time, and I'm so happy I discovered it!Lea @  LC's Adventures in Libraryland"}, {"userName": "Isa Cantos (Crónicas de una Merodeadora)", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/20954985-isa-cantos-cr-nicas-de-una-merodeadora", "userReview": "Cuando iba a empezar a leer este libro estaba como \"OHMYGOD, ES DEL TITANIC, QUÉ GENIAAAL\", luego empecé a leerlo y fue como \"hmm... okay, sí, se desarrolla en el Titanic, pero normal\" y al terminarlo pensé \"bueeeeno... siguiente\". Mi punto es... tú no quieres terminar un libro y que te deje sin pensar ni preguntándote qué habrá pasado con los personajes, no; lo que quieres es cerrar la última página deseando que hubiera más historia, que hubiera una página más. Y, bueno, Aguas Oscuras me dejó en blanco. No hubo fangirleo, no hubo sufrimiento... nada, ni una chispa. Este libro cuenta la historia de Tess, una chica que trabaja como sirvienta de una familia bastante reconocida de Inglaterra y que se embarca con ellos en el Titanic. En medio del afán de la Sra. Lisle -su jefa- de encontrarle un buen marido a Irene, su hija, Tess conoce a Alec, un caballero americano que está retornando a su país. Entre ellos dos va a surgir un interés inmediato que van a tratar de combatir porque ¿cuándo en la vida se ha visto que un hombre de dinero se case con una sirvienta y más en 1912? La cosa aquí es que, pronto, Tess va a descubrir un gran secreto: los hombres lobo existen, hay dos en el Titanic y ambos se detestan. Si bien al principio me chocó un poco lo de situar un romance paranormal en las cubiertas del Titanic, dije que le iba a dar una oportunidad por más extraño que me pareciera. PERO mi problema al final no fueron los elementos sobrenaturales, sino la falta de conexión que tuve con la historia. Sencillamente pasaba páginas esperando que lo que pasaba entre Tessa y Alec me produjera algo, cualquier sentimiento, pero nada... creo que no me creí su relación y eso fue lo que hizo que el libro no me convenciera mucho. A pesar de todo eso, creo que los dos personajes principales, Tessa y Alec, e incluso algunos secundarios como Myriam, George, el padre de Alec y Mijail están muy bien construidos. Todos tienen secretos y una personalidad bastante interesante; todos tienen objetivos diferentes e intentan alcanzarlos en este libro de una manera u otra, sea ayudándose o destruyéndose entre sí. Algo que me pareció muy positivo del libro es que tiene una muy buena documentación por detrás. Yo, que soy una friki del Titanic... y por friki del Titanic no me refiero sólo a la película del 97 sino a los hechos reales, puedo dar fe de que Claudia Gray investigó bastante para no escribir cualquier cosa que se le ocurriera. En el libro se menciona a un montón de pasajeros reales e incluso se alude a datos curiosos que no mucha gente sabe. También me gustó que Claudia Gray le diera algunas páginas y pequeños diálogos al Sr. Andrews, un hombre que, de acuerdo a todos los datos de la época, era encantador y una gran persona, pero que murió en el naufragio, sin siquiera intentar salvarse. Pero bueno, ese es otro tema y me estoy enrollando xD."}, {"userName": "Kristi-The Book Faery", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/4387706-kristi-the-book-faery", "userReview": "THE FAERYS VIEWFateful was so much better than I thought it was going to be. Truthfully, I wasn't expecting it to be as thrilling or captivating as it was.Just goes to show that you can't always 'judge a book by the ship it's about! My original thought was: \"Okay, Faery Chica-here's how it's probably going to go---Doomed Titanic + Lovely yet Helpless Servant Girl + Tortured yet Good-hearted Werewolf = Tragedy on the lower decks that only the werewolf can save the poor servant girl from\".I envisioned scenes from the movie Titanic only Jack's a bit furrier, Rose is demure and trades in her silk dresses for homespun cotton and an apron all while Celine is singing her heart out in the background [Faery's humming/singing/whistling 'The Heart Must Go On....] FAERY FARTS!!! I'm STILL singing it-Dangnabbit! For the love of FAE, get that song outta me head! Ahem...I digress.... on to the review part...I couldn't have been more wrong! Fateful was so much more and so different from my original and I admit, close-minded first thoughts. The synopsis doesn't do the book justice; I can only hope that the reviews do.Tess is a ladies maid for a prevalent family that is leaving London for America via the Titanic. The Lisle family, aside from Irene-the daughter and Tess's responsibility, is arrogant and horrid to those they see as beneath them, which is all but the finest nobility. Tess is a fantastic character, she's had to fight her way through life and at her young age she has decided to start over in America. Tess is compassionate and kind but she also has a stubborn side that combined with her street smarts will make leaving the Lisle's and starting over a challenge she feels confident in making. She's tired of being walked on and knows in her heart that better things await her. It’s a dream that she’s had since hearing of their trip and one that she is determined to make a reality.When Tess meets Alec aboard the Titanic, they quickly form a bond. Alec is the son of a wealthy business man and it soon becomes apparent that Alec and his father are not only hiding a very big secret but there is one very nasty Mr. Marlowe who can help Alec with this very big secret but only at a very steep price. Mr. Marlowe also has his eye on Tess and will stop at nothing to have her. The characters in Fateful are all wonderfully described; I enjoyed the secondary story's going on amid Tess and Alec’s story along with the description of the Titanic. That era is fascinating to me, it’s sort of a turning point in so many different ways and Ms. Gray captures that beautifully.Fateful is truly captivating and a page turner! Ms. Gray weaves a tale around the tragic loss of those aboard the Titanic with a spellbinding story of love, loss and betrayal. The ending is absolutely perfect and this is a book that I would recommend to all friends of all ages. It's just that good!"}, {"userName": "Christie", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/3386809-christie", "userReview": "[ Oh and what would be even better is if the man doesn't die at the end, maybe since he's a werewolf he can just come back to life with the full moon. That would be awesome!  (hide spoiler)]"}, {"userName": "melissasbookworld", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/34871171-melissasbookworld", "userReview": "3.5 stars for this wonderful titanic-retelling.I really liked the characters in this book, even the 'nasty' ones, our 'villains', because they are all really well developed and they come across as realistic and believable, keeping into account that this all is happening in 1912. I came to care for Alec and Tess a lot and I really liked the added minor characters as well. Great characters are so important I think, and these characters already made sure I came to love this book a lot, despite knowing beforehand how the rest of the book would turn out. Gray has a talent for writing great main characters. Tessa, being a servant to a first class family on the ship, was a really interesting pov. And Alec, the first class passenger whom builds an intense relationship with Tessa, was soooo lovable! Grey really knows how to write lovable male characters *swooooon*I liked the added paranormal twist into the story, but somehow it also felt - in hindsight - like it was completely unnecessary to write into this story-line as well. I get where the author's coming from; wanting to add a nice paranormal twist to it all since a lot of the story-line development would be predictable since it's historical facts being written about. But if the paranormal twist wouldn't have been in there, it would've been ok to me as well because I just really liked reading about the characters and the titanic-setting more than I liked the paranormal elements to be honest hihi. I've been obsessed with the story of Titanic ever since I was a young girl and this has been my first titanic re-telling to date, so I was really excited beforehand to find out how the author used original elements of the well-known disastrous story of the 'unsinkable' Titanic. I can't say I'm disappointed because Gray's been able to really 'transport' me into this world, this setting and experience it all alongside the characters and made me feel all the feels. The angst, especially in the last part of the book, felt so palpable and I felt so sad - as I always do thinking about the disaster of this majestic ship hitting that iceberg - because the way Gray wrote about all those people dying.. it was beautifully done. I can't imagine what it must've been like for the people back than who died or survived, who experienced the sinking of this ship, but I think Gray did a good job on portraying this scene. The difference between first and third class was really palpable, as it was back in the days as well. Great writing! I loved coming across different characters, residing on different classes on the ship. From first class passengers, to third class passengers, to crew of the ship. Gray wrote a great diversity of characters into the story-line, as you would expect with this story, set in 1912. Taking into account that this is a stand-a-lone, I really think, overall, Gray did a great job with this YA historical fiction. Given the amount of pages used for this story, everything is developed really well I think. The added paranormal elements were okay to me, but I think it's just really personal as to how you experience the added paranormal elements. It was a nice way to add some 'spice' to a young adult historical fiction though. Overall, I really enjoyed this read and picked it up anytime I was able to. I loved the Titanic elements; the fictional ones and the real facts/characters she wrote about - the author explains about it all a bit more in the acknowledgement, which was really great I think; her telling more about how this book came to be and what was and what wasn't real and/or fiction and why she chose to write it that way. If you like knowing this book contains historical fiction, a great setting, some added paranormal elements, great characters, angst and a really likable romance, this is definitely a book you should give a try! I really liked this stand-a-lone novel about, regarding one of the most interesting historical happenings to date."}, {"userName": "Colleen Houck", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/1163228-colleen-houck", "userReview": "The description of the ship and its sinking felt so real, it was like I was there. So curious about the dagger and what it could do. Love the idea of the Order of the Brotherhood. The heroine was so plucky and likable and love Alec too."}, {"userName": "Tatiana", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/22783852-tatiana", "userReview": "Клаудия Грэй «Обреченная».Юной Тесс предстоит путешествие через Атлантику, в Америку, где она надеется начать новую жизнь. Но в день отплытия происходит странное - девушку едва не разорвали волки. И случилось это не в диком лесу, а на улицах Саутгемптона. Если бы не помощь загадочного незнакомца, Тесс никогда не поднялась бы на борт великолепного трансконтинентального лайнера. Но на этом ее приключения не заканчиваются - на борту \"Титаника\" с ней происходят удивительные и зловещие события, которые заставят Тесс поверить в невозможное. В том числе и в любовь вервольфа.Грэй медленно, но верно вошла в список авторов, чьи книги я обязательно буду покупать и читать. Ее серия «Вечная ночь» у меня в десятке любимых школьных вампирских романов. «Обреченная» - интересная, динамичная история, про девушку-служанку, которая работая на богатую семью, все время терпит унижения, но при этом девушка не отчаивается. Взойдя на борт Титаника, у девушки есть план – по прибытию в Америку, оставить ненавистную службу и начать новую жизнь. Эта поездка полностью изменит ее жизнь. «Обреченная» - это одиночный роман, так что можно простить, что автор не очень подробно разработала злодея, но он в книге есть, и он появляется и задает жара сюжету. Хотелось бы побольше узнать про таинственную организацию, но книга не резиновая и автор довольно понятно описывает основы. Есть в романе любовная линия – милая, быстротечная, практически ненавистная мне insta-love, но Тесс и Алек настольно простые и приятные персонажи, что и это я автору прощаю! Да, они знаю друг друга всего пару дней, но им веришь и им хочешь сопереживать! Оценка: 5 из 5"}, {"userName": "Rachel", "userReviewDate": "May 31, 2011", "userURL": "http://www.goodreads.com/user/show/2499225-rachel", "userReview": "Now, in all fairness, I probably would've given this book four stars were it not for the Titanic setting. I rank it right at four stars story-wise, but the Titanic makes it solidly five. I've been fascinated with the story of the Titanic since I first saw the movie, which was at least ten years ago. Though James Cameron's movie incited my love, I went further and read several books on the ship. Needless to say, anything involving the Titanic catches my eye, though not always my fancy.I liked the way Ms. Gray gave many real officers and passengers cameos without making them characters, with the exception of Thomas Andrews. She mentions this in the author's note and I definitely agreed with her reasoning. With the concept of the story being so based in fantasy, the reality of the sinking and the death of those poor souls would not have been a comfortable juxtaposition for most, and definitely not me. As for the story, I can't complain. I didn't find the plot too stuffed with extras, just enough to make every scene interesting. The characters are developed and very likeable, and what girl could really resist Alec? While the story has a closing that could stand alone, I would be among the first in line for a sequel, even though it obviously won't be set on the Titanic, and that alone testifies to how much I enjoyed the book. :)"}, {"userName": "Meli", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/5087694-meli", "userReview": "Fue predecible de principio a fin, incluso los pequeños detalles que no hacen mucho a la historia fueron cantados, pero -aunque por momentos me aburría- es una lectura más bien rápida y entretenida y aunque cae en mil tópicos es bastante distinto por el contexto en el que se desarrolla.Al acontecer en el Titanic, hay un aura de tragedia envolviendo la historia desde el comienzo que hace que la tensión sea constante, indiferentemente de si la historia es buena o mala. De hecho, creo que sin el Titanic no me hubiera gustado, ya que la trama en sí no es nada que ya no hayamos leído otras miles de veces. Pero esto le da otra perspectiva. Los capítulos que más me gustaron fueron los últimos. Las escenas del naufragio y todo lo que le sigue son muy angustiantes y están muy bien logradas.En fin, se supone que es un libro autocunclusivo, pero por cómo acaba no me sorprendería que apareciera una continuación algún día."}, {"userName": "Leah (Jane Speare)", "userReviewDate": "Oct 06, 2010", "userURL": "http://www.goodreads.com/user/show/4019095-leah-jane-speare", "userReview": "As soon as that first sentence is read, you're unable to put down this book. It's a very unique genre. One would try to classify it as historical fiction, tantalizingly laced with paranormal aspects. While the story is being told, in present tense, reading it I sometimes forgot that the ship they were on was actually the Titanic, until some critical moments, and then suddenly you remember the big, almost silent part of the plot; the doomed voyage. My hands were literally so sweaty with anticipation by the last 20 pages that i had a hard time keeping a grip on the book. I love the flow of Fateful, how the details of everything, the characters seem so real. Claudia's really outdone herself this time."}, {"userName": "Estefanía Álvarez", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/44650869-estefan-a-lvarez", "userReview": "3.5/5 Me ha gustado, pero alguna cosilla cojea un poco."}, {"userName": "Rachel (The Rest Is Still Unwritten)", "userReviewDate": "Sep 17, 2010", "userURL": "http://www.goodreads.com/user/show/2406353-rachel-the-rest-is-still-unwritten", "userReview": "*Firstly, thank-you to Harper Collins Australia for sending me a copy of this book to review*Fateful caught me from the beginning. It took me on an incredible journey of love, danger and tragedy. It made my heart soar before breaking it as I knew it eventually would, only to have it heal me once again and leave me with endless hope. There’s no denying that the story of the Titanic isn’t a powerful one. It has been ever since the beginning, and in this book Claudia Gray creates a tale that transports you to another time and place. It’s beautiful and romantic, but hauntingly tragic as events come to pass that we all know are inevitable even before reading this tale.Going into this book I knew that it would have to end it pain at some point; that many of the characters we met on the ship wouldn’t survive that tragic night, but that didn’t stop me from loving them regardless. Born to a time of high class and wealth, where difference of importance was a common thing, all these characters were captivating and wonderful. Some were well bred, but still kind as we saw with Miss Irene. Others were born to a lower class, yet still strong as individuals and soul as we saw with kind George, sweet Ned, feisty Myriam and honourable Mr Marlowe who loved his son no matter what. Of course there were the cruel ones as we saw with Lady Regina, Layton and Mikhail, but they gave the book a strong foundation and made it seem more realistic to that time. Each and every character had their own story aboard the Titanic and their own past that made them such colourful characters to read about. Tess was a great lead to read about. She came from humble beginnings, and she was just a normal servant girl from those times who happened to want more from life. She knows her place in life and who she is, but she wanted the freedom that only fleeing her employer could give and believed the Titanic was her ticket to that. One of the things I loved about Tess was that she was so normal; of course she had vulnerabilities and she was scared but she was strong too. I thought she reacted to learning about werewolves with a healthy amount of fear, but she saw them in a good and balanced light over time and none of that changed her growing feelings for Alec. As for Mr. Alec Marlowe....swoon. What can I say? Born to wealth, he was haunted by what he was now was and the things he did. He’s just the kind of man a girl can dream would sweep her off her feet in those times and days. He was a nobleman, but none of that mattered to him when it came to Tess. He treated those around him who weren’t quite in the same position as he was with respect too. He was sexy and charming and fell completely in love with Tess, eventually making a selfless act that would save her life. Despite the events of the Titanic, or perhaps even because I knew how it would end, the relationship between Tess and Alec was so romantic! Both were so different, and from different classes, but the sparks between them were beautiful and their relationship was passionate and real. It was refreshing to have Alec’s family support his romance with a woman of a lower class and to have them have his father’s blessing. It was nice not having this as an obstacle for them and instead seeing them face a completely different threat. Tess and Alec connected and had a bond that nothing—not what he was, not difference of status, not even the ocean itself--could break. It was pure and so intense to read about. I’d be lying if I didn’t mention that some scenes, especially towards the ending of this book, had me very emotional. When you love certain characters and follow them on their journey, only to have it end in such a tragic, be it inevitable way, it’s very sad. I can see the beauty in the way Claudia Gray has written the tale and her characters and I’m so pleased to have read their story. It was impossible not to get swept up in this intense, passionate tale and I held on through it all; unable to stop reading as the characters found their feet and each other. The pain and sadness of the ending didn’t over power the hope and promise found at the very, very end and it was equal balance happiness and tragedy. This book is an incredible journey that will draw all number of emotions from readers and will stay with you, long after you turn the last page!"}, {"userName": "Kayleigh {K-Books}", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/3996633-kayleigh-k-books", "userReview": "Review posted on K-BooksFateful ReviewI honestly had no idea how I was going to feel about this book. I instantly thought it would be something that I would enjoy. I am a huge fan of the story of Titanic and I love paranormal books so a story that mixed the Titanic and werewolves sounds like the perfect book for me. Yet I was still very reluctant to start this book. I think this is mainly because I have read the first 2 books in Claudia's Evernight series and I wasn't a big fan of them so I was unsure how I would feel about another of her books. Also I have been in a reading rut and every book I started I couldn't really get into it. However, I was pleasantly surprised. I absolutely loved this book. I am so glad I decided to pick it up and I could definitely read this book again and again.Tess is a servent girl for a wealthy family moving to America via the Titanic. She can't wait to get to America and start a new life. She doesn't expect to start falling for one of the wealthiest passengers on board and she certainly doesn't count on getting sucked into his dark world. Alec is a werewolf. He hates what he is and he can't wait to get to America and start a new isolated life alone where he can deal with his problem without being a burden to his family. When he meets Tess he is amazed how the servant girl can make his feel, hopeful about the future. But can both survive the journey that all readers know is doomed?I loved this book. I loved it right from the first few pages. I loved seeing the Titanic through a servant's eyes and I think this is a very fresh twist on the story. Tess is such a great character. She is strong and hopeful and when faced with danger she is not a whiney character who would sit and cry she is strong and she used her brain to try and sort through the problem. She wants to save everyone, especially Alec and the family she serves even though most of them threat her like crap.I loved Alec. He is the character that every girl will fall for. He is the good guy who just wants a normal life but he has this dark force inside of him that he is desperately trying to overcome and keep his humanity.Throughout the book I got so distracted by the werewolf part of the story and the fights between the evil werewolf and Alec and Tess that I would almost forget that they are aboard the titanic. I got about 80% through and then it dawned on me that nothing in the memorable Titanic story had happened and started to think surely they should have hit the ice berg by now. When they did I wasn't surprised, we were all expecting it and it was impossible for it not to happen. However that did not stop me crying my eyes out.This book had me crying so hard, I was praying for a happy ending for Alec and Tess and I really couldn't see it happening which made me cry even more.This is definitely a heart-wrenching story, I was laughing and happy with the relationships between the characters one minute and just heartbroken and sobbing the next.This is one of the best books I have read in a while and it has definitely got me out of my reading rut. I will definitely re-read this book again and again and I can't wait to see what Claudia Grey will come up with next.If you were not a fan of her Evernight series don't write all of her other books off as this surpassed that so much and I am so glad I read it."}, {"userName": " Lissa Smith Reads'~Bookaholics Bookshelf Reviews", "userReviewDate": "Oct 25, 2011", "userURL": "http://www.goodreads.com/user/show/5324453-lissa-smith-reads-bookaholics-bookshelf-reviews", "userReview": "4 Wow Stars!Although CG notes that she researched the Titanic while writing Fateful, at some point she choose to deviate from historical accuracy and chose a more practical route supernatural—drama. CG gives us for example in her Author notes, “Myriam would almost certainly have boarded the ship at Cherbourg rather than Southampton; servants traveling in third class was so unheard-of that I’m sure Tess’s handy key was unheard-of too; and the Titanic had no “seventh officer.” Rather than fictionalize the life of an actual officer aboard the ship, I chose to invent George Greene and his position onboard. In fact, I worked around real individuals on the ship as much as possible.” CG goes on to state that, “Writing a big paranormal romance set amid a real disaster would have felt disrespectful if that story were not firmly and totally a fantasy, one that didn’t make claims about the behavior, motives, and culpability of anyone actually onboard.” A decision that I am sure to this day; she has left her no regrets. CG does however have a few real-life passengers make a cameo in the book. CG states that designer Thomas Andrews served as an unofficial advisor. She also states that there were some historical points that, despite all her research, she could never clarify and couldn’t find solid answers, so she made her best guess. A more interesting fact that CG shares with us is, “Moorcliffe and the Lisles are fictional as well, but Tess’s life as a servant is not exaggerated. Everything from her bad mattress and the frozen water in her morning basin to the lack of electricity and plumbing in the servants’ quarters is historically accurate.” CG finally states; “I first conceived of this book while visiting the traveling exhibition of Titanicartifacts in New York City.” CG found that she had a newfound enthusiasm and soaked up as much detail as she could before adding it to the book.Wow!! When I started Fateful, I had no idea what it entailed. I never bother to read the category; it was a chance to read and express my voice and/or excitement about what I was reading with in a small group. The opening drove me nuts. Written in the first person point of view it took CG until chapter two let the reader know whom POV we were reading. Nevertheless, CG managed to shock me in many ways. First, leading the reader on with a description of a man with too-pale skin and then having him vanish much too fast. It leads the reader into thinking vampire. Then CG surprises you with a wolf in the city that is chasing after Tess. After this CG lends another shock as the servant girl a boards the Titanic with her (finger quotes) **masters**. However, this is not where the story begins. A mystery, full of tender moments unravels its self as you read. The characters are well rounded and full of life. You will find yourself wrapped in the fictional life of Tess and all those who surround her on her maiden voyage. As dreadful as everyone (I mean anyone with an ounce of heart.) will find some characters, light is shed on their behavior. Soon you find yourself sympathizing nevertheless, in the end a tiger never changes it stripes. Despite the fact, some characters are vile; you will find your self-loving others.CG did an excellent job weaving this story together and if fail to stick with the book and hold out you will miss and in creditable original story that will leave wanting just a little more…."}, {"userName": "Lisa", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/4011534-lisa", "userReview": "Originally posted at Read Me Bookmark Me Love MeI fell in love with Fateful immediately - with the book and the original concept itself. Supernatural creatures, power struggles and tragic romances…. What's not to like? This novel was written exceptionally well, with a perfect balance of romance and action. Readers are constantly on the lookout for trouble as the sinking of the Titanic is inevitable. Will this standalone novel have a happy ending or be suitably tragic? You won't know until you read it!Tess Davies works for the Lisle family in Southhampton, keeping the eldest daughter, Irene, looking her best whilst dodging the tongue lashings of Lady Regina, the wife of Viscount Lisle. Out of everyone in the family, Irene is the only one who treats Tess with any respect or gratitude, with others such as Layton, the only son and heir, taking advantage of their power and so-called position in the upper class. It was difficult to watch Tess struggle with these insolent characters as she's kind at heart, emotionally strong and innocent. The divide between classes is massive, and it's all you can do to cheer on the workers and hope the Lisle family (sans Irene) fall overboard into the freezing ocean! The friendship between Tess and Irene is very sweet, even more so when you see the sacrifices Irine makes for her maid.Tess can't help but continuously run into the same two men, Alexander and Mikhail. Mikhail is a predator, dead set on recruiting Alec into the Brotherhood and terrorising Tess for his own twisted pleasure. With his dangerous werewolf curse, Alec initially tries to stay away from Tess but the inexplicable attraction between them grows quickly, with neither able to resist the other. Even as a wolf, Alec finds himself unable to hurt Tess, his human self overpowering the beast. It was exhilarating to see them discover each other and overcome the many obstacles onboard the Titanic. Cruel families, scary stalkers, hungry wolves and icebergs - run!! Sweet, powerful and all-consuming is how I'd describe their relationship. I loved it! They're always there for one another and nothing can tear them apart. You really don't know what to expect from this story. Anything can happen!I won't spoil the ending, but I will say that it is perfect for this story. Fateful with stay with me for a very long time and I'll only be continuing it in my mind. Stand-alones drive me insane because I always want more! Brilliant writing from Gray - I'm looking forward to more from her!"}, {"userName": "~Tina~", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "I'm a huge fan of Claudia Gray and her Evernight books, but to tell you the truth I was a bit weary about going into this book. A book concept about the Titanic fascinated me since I have always been haunted and charmed by it's story. The idea of werewolves also fascinates me since it's well... werewolves and I'm a paranormal junkie. But. The Titanic and werewolves together? Really?I shouldn't have been concerned since Gray did a terrific job. This is what storytelling is all about. Being creative, inventive and not be afraid to bring in something unique and out there. Props for Gray! Fateful is a book that quickly enchanted me. I loved the fine details about the ship itself and became very much invested in these characters.Poor Tess, right from the very first chapter she seems to be made into a target and I'm not just talking about the wolves. She's constantly threatened or attacked and there was one point where I got frustrated, wishing some peace for this character already. There are very few people who are kind to her and yet Tess remains brave and strong and true. She was a wonderful character. I loved how much she believed in Alex even though he couldn't, wouldn't, believe in himself. Tess and Alex are such a sweet couple and very much deserves to be happy.The evil dude in this was indeed quite evil. I loathed Mikhail with ever fiber of my being. Don't you just love it when you feel strongly while reading?All in all I thought this was a great stand-alone experience that has a touch of everything. Historical, romance and paranormal and I'm looking forward to climbing back into Gray's Evernight world again in her next book Balthazar!!"}, {"userName": "Savannah (Books With Bite)", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/3381656-savannah-books-with-bite", "userReview": "I have to admit that when I started this book, I was a little skeptical how werewolves in the Titanic would work. It worked. Ms. Gray wrote a compelling story that filled me with the history of the Titanic, it's passengers, and a love that I can read over and over again!First off, the story line. I really love it. Like loved it so much I can't get enough of it. Once I stared the book I am immediately taken back by amazing writing, setting me in the Titanic. Ms. Gray did a great job in taking the reader back in time. Placed on the Titanic and in Tess's shoes, the reader is thrown into a world like no other. The characters of the book were awesome. I really enjoyed the main character, Tess. She is a servant girl just trying to make her way to the US. I loved the Tess is not your normal servant girl. She has hopes, dreams, and expectations that she set out for herself that she is reaching no matter what the cost. I also loved the drama with the family she worked for. It had my heart racing and fleeing for hope as I read about Tess and the troubles. The love interest in this book is simply fantastic. I loved watching Tess become more than what she is, taking risks, making choices that could change her life forever! The love in the book is overflowing the pages and the sacrifice made made me weep! The addictive romance will have you in love with the book!!I never would have thought that this book could work but man, it did. It is the perfect balance of historical fiction with a great love! Weaved with loads of paranormal aspects, Fateful is a book that you are not willing to put down. Once you start, it will enslave you till the very end! Dark and engaging, Fateful is a must read!*Implied sex, curse words*"}, {"userName": "bookaholic_kim", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/46045830-bookaholic-kim", "userReview": "The book goes back to 1912, an era where social ranks matters the most. This kind of setting fascinates met for it gives me glimpse to how life was back then. The story caught my attention with it having wolves and surprisingly no vampires and the ship being called titanic. So basing on those two things the story has its mystery unrealistic thing going on and a romance that bloomed in titanic. It is a cliché but I still enjoyed it and I want more of Alec and Tess."}, {"userName": "Alyssa", "userReviewDate": "Jul 23, 2010", "userURL": "http://www.goodreads.com/user/show/2753251-alyssa", "userReview": "I adore Claudia Gray (a pseudo, in case you didn’t know), as both a person and a writer. I followed her blog up until it became the non-active type it is today, finding her to be sweet and generous, as well as incredibly personable and friendly. Her debut series, Evernight, is one of the only vampire texts that I can stomach nowadays, and trust me, that’s not a compliment I dish out to everyone. The moment I’d heard she was working on something different, my excitement – as well as my guard – shot up. Was I excited she was working on something new? Of course. Was I thrilled – and admittedly, a little nervous – that she was taking on the RMS Titanic as a scenery? Absolutely. Was I pleased with her description – for most of it, yes I was pleased.But little old anxious Alyssa just couldn’t stop fretting over one little detail: the werewolves. How could someone who wrote vampire fiction so fantastically fast forward to the other end of the spectrum, in turn to write of the creatures of the moon? How could someone who was so on top of the me-drink-you-blood party decide to write something so…different, risqué, overdone? Fret did I. Luckily, I was anxious for nothing.Claudia Gray eases her way by vampires and the States and ships herself across the ocean to London, England, where Fateful sets off. She focuses in on a very special ladies’ maid named Tess Davies, who simply wants to rid herself of the plights of serving others and wants to indulge in a new life in America. She leads us towards the RMS Titanic and introduces us to Alec, a boy with a secret and a disarming smile. And when she brings us to the end of what’s bound to be an unfortunate tale, she leaves us with feelings of both hope and grief over the very real event in which this book is involved in.I tried really hard to find something wrong with Tess and Alec. I took out my looking glass and I searched up and down the pages for what you’ll usually find in a YA paranormal these days: a desperate protagonist, a controlling love interest, a love triangle, a predictable plot. Fortunately, Gray has studied her paranormals and has taken a different approach in writing her own – what I found in Fateful was a bittersweet story complete with action, romance, political intrigue and a very sophisticated and well-tackled take on the tragedy that was the sinking of what had been considered “The Unsinkable.”Although Tess could be considered judgmental and stuck-up, I understood that her attitude was based on her times’ society and her position as a ladies’ maid. Without much schooling, Tess still proved resourceful and intelligent, something I look for in heroines. The other characters were enjoyable reads, too. Alec was, to me, nothing special as a love interest, but he wasn’t an ass and he wasn’t too gentlemanly. He played the part of the werewolf – as did the Big Bad Wolf Mikhail – exceptionally well, especially since Gray’s take on werewolves was as twisted and captivating as her twist on vampires in her previously published books.The werewolf mythology in Fateful wasn’t anything like I’ve seen before, although I am a little sick of the whole creature in all. Please don’t mistake me, though: I don’t think Gray wrote Fateful with werewolves simply because it’s what’s in – I’m pretty sure it’s because she knows she writes paranormal well and because she wanted to add something sure to her tackling of the Titanic tragedy. Gray, although placing some annoying stereotypes in – I hate that automatically rich people are considered snobs and the epitomes of rudeness – her writing was stunning and worthy of my envy and fascination.*The novel could have so easily could have sunk. The Titanic is a pretty large thing to tackle, something pretty monumental and real. Since it truly existed and sunk, its case being one of the most popular – and unfortunate – disasters in history books, it would have been very easy to find Gray’s twist on the story distasteful and wrongly executed. Gray states her research was extensive in the Authors Note, and truthfully? I thought she very wrote a stunning story. It tackled love, it tackled tragedy, it tackled a powerful storyline. As beautifully rendered Cameron’s film of the historical event, Gray has written a novel that will touch many readers to smiles and tears.4.25/5*I may not have werewolf senses, but I certainly smell the opening and possibility for a sequel to Fateful, something I’m not sure I support or don’t care for.I was provided my ARC copy from the publisher. Thank you to HarperCollinsCA and HarperTeen for the review copy."}, {"userName": "Jess", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/2524799-jess", "userReview": "The best part about the book--and the sole reason it gets 4 stars--is the almost-ending. I'm not going to put it under a spoiler tag, because everyone should know this already, but man, I could not stop crying when the ship was starting to sink, and Tessa was describing how there weren't enough lifeboats, and the overall feel when fifteen hundred people know they're about to die. It's heartbreaking, really. I think that was the thing that made me cry during the James Cameron Titanic. Not Jack and Rose, but the hundreds of people that were going to die. And it really hits hard, since it actually happened. This may be a work of fiction, but it was still based off a tragic historical event. The romance is shoddy, and completely insta-love, but I think it's worth enduring to get to the meat of the story with the werewolves and the Brotherhood."}, {"userName": "Esmeralda Verdú", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/6005302-esmeralda-verd", "userReview": "Aguas oscuras ha conseguido emocionarme, atraparme y fascinarme en todos y cada uno de los sentidos. La autora consigue mezclar fantasía (hombres lobo) y realidad (Titanic) y crea una historia totalmente original y bonita. Con unos personajes entrañables a los que a más de uno cogerás cariño y una protagonista genial, valiente y decidida. El ritmo de la lectura no decae en ningún momento y no querrás parar de leer. Aventuras, hombres lobo, amor, amistad y un inevitable final. Si todavía no has leído esta novela, ¿a qué esperas? De verdad, merece muchísimo la pena. ¿Quieres otra razón más para leerlo? Es autoconclusivo.Lee la reseña completa aquí: http://fly-like-a-butterfly.blogspot...."}, {"userName": "Maria Clara", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "En realidad es un 2.5. Cuando vi el libro en la librería y leí su sinopsis supe que tendría que leerlo. Y, aunque la historia es buena, no me a convencido del todo. Sus personajes son demasiado fríos, racionales a la hora de tomar una decisión extrema. Y el final... bueno,..."}, {"userName": "♫Rose4ever♫ ~ Katerina  Mikhailov  ~    (Team Dimitri/Gale/Jace)", "userReviewDate": "Nov 14, 2010", "userURL": "http://www.goodreads.com/user/show/4079924-rose4ever-katerina-mikhailov-team-dimitri-gale-jace", "userReview": "Sounds awesome!!!!oooo the TITANIC!!!!!!!!!!two of my fave thingstitanicand WEREWOLVESand of course Claudia Gray is a great author! :)"}, {"userName": "Heidi", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/5463965-heidi", "userReview": "Three stars: Set sail on Titanic with some werewolves.Tess hurries down the cobbled street.  Anxious to get to the shop to fetch the laces for  the boots of her employer.  The shadows are lengthening, it is a dangerous hour for a young lady to be on the street.  Men leer on the corner and Tess is reminded, yet again, of her vulnerability as a maid.  She scurries along, dreaming of her imminent freedom which will hopefully begin in a week's time. She is to set sail on the Titanic with her employers to America, where she plans to give her notice and begin a new life.  Suddenly a man dashes around the corner and grabs her hand, informing her if she wants to live to come with him.  Frightened she follows.  To her horror, wolves come running down the street.  Wolves here in Southampton?  Once the beasts melt into the shadows, the man releases her and she runs home terrified.  The next day on the Titanic, she is threatened by a strange man, trying to steal her employer's valuables.  Her rescuer is, once again, the strange man from last night, the wealthy Alec, heir to his father's steel fortune.  Things are not as they seem, Alec has a secret, he is a werwolf, pursued by a dangerous organization known as The Brotherhood.  They are powerful group of werewolves looking to coerce him into servitude.  Tess unwittingly finds herself caught in the power struggle, while losing her heart to Alec.  Will she be killed by the malicious leader of the werewolves or will she die during the sinking of Titanic?   What I Liked:I love a good historical book and Ms. Gray does an excellent job of bringing the Victorian era alive.  I especially enjoyed learning more about the life of the people who were in service to the wealthy.  Their lives were difficult, and they had little chance to dream and have their own lives away from the employers.  The Titanic is an excellent microcosmic example of the class divisions.  We follow Tess as she navigates from her quarters in the third class steerage up to the lofty decks of first class to serve her wealthy mistress.  I liked learning more about the barriers facing the working class.I love anything pertaining to Titanic, I know I am not alone in my fascination with the doomed liner.  This week being the centennial anniversary of the sinking, I wanted to finally read this book.  Ms. Gray takes us into the heart wrenching terror of the sinking and presents us with a star crossed pair of lovers caught in the danger.  I really admired Tess.  She is a young lady caught in very trying circumstances.  At a young age, she was forced along with her sister to give up her schooling and enter a life of service to help her family.  Her mistress is definitely a nasty woman.  In spite of everything, Tess rises above it all and maintains her dreams of freedom and a new beginning in America.  Time and time again, she is forced to hold her tongue against the nasty barbs. I don't know if I could handle that type of treatment.  Once she meets Alec, she again is faced with the cruel divisions of class.  A third class girl like her could never be with a first class boy like Alec, yet she dares to dream.  She has so much courage.  Definitely an admirable lead.  I especially appreciated that Ms. Gray did so much research on the lives of the servants during this time period.  She uses the information to create a vivid picture of life for the servants.  It was an eye opening experience to learn, even at the beginning of the 20th century, that people in servitude led such bleak existences. And The Not So Much:I was excited to read this story hoping to glean more information about Titanic.  Unfortunately, I was disappointed.  Titanic was really not a big focus in the story, except of course, for the dramatic chapters covering the sinking.  The story delves more into the paranormal aspects of the werewolves and Titanic is, for the most part, nothing more than a backdrop.  At the end of the book, the author discusses her details on the Titanic and I was not happy to discover that much of it was fictionalized.  If you are looking to read this for the Titanic aspects, you may come away a bit discouraged.This book utilizes, yet again, the famous Titanic love theme of a pair of lovers, one from first class, the other from third, who meet and fall madly in love over the span of four short days.  Then comes the dramatic iceberg collision and sinking and you are left wondering if they will survive.  Unfortunately, even despite the paranormal twist of the werewolves, I was bored of this well worn theme.The added werewolves were fun, but there was some flaws in the story.  Without going into too many spoilers, one of the werewolves runs loose on the ship and inadvertently kills a man.  There is a discussion about destroying the \"dog\" and then it is decided to wait until they dock to get it tested for rabies.  Then the whole issue is forgotten.  For me, this whole scene is ludicrous.  First of all, if a werewolf terrorized people and killed someone, there would be a big uproar.  Second it is just not realistic and I found it really detracted from the story.  The same thing with the ending, again I won't go into too much detail, but overall it just didn't work for me.Fateful is a book that recounts the life of a servant girl on board Titanic.  While I did enjoy the character of Tess and learning about her life as a maid during this time period, I was overall disappointed in the book.  The Titanic is for the most part just scenery until the sinking and many of the elements are fiction.  The werewolf theme is also a bit far fetched and has flaws and overall just did not fit well into the Titanic setting.  The book was entertaining but I can't wholeheartedly recommend it.  If you are looking for a book with exceptional detail, historical accuracy and a believable paranormal twist, I would recommend you read Destined by Allison Kraft, instead.  Favorite Quotations:\"Beauty is no guarantee of goodness;\"\"Because the big trunks they're hefting, the bundles of clothes the women hold close---those aren't supplies for a sea voyage.  They're the foundations of a new life.\"\"His gaze is dark and devouring.  Something blazes within him as he looks at me, but I can't tell if it's anger or desire.\"\"It's impossible to spend years of your life in a house with a woman who thinks you're lower than dirt and not let it get to you from time to time.\"\"There is something wild about him even in his human form, something that wants always to be free.\"\"It's so odd to think that these people I've come to know-- the ones society puts in three different boxes---might all be friends if things were just a bit different.\"\"Around me, in each direction, the ocean stretches out to every horizon.  Even aboard this enormous ship, I am one small speck in infinity---so entirely alone.\"\"The sun has begun dipping below the horizon---a sliver of orange-gold light sliced by the dark line of the ocean.\"\"Even in death, it matters whether your dress had been trimmed with lace, or whether  your shoes were polished oxfords instead of worn brogues.  It's the difference between a grave your loved ones can visit and being dropped into the water in a sack with stones at your feet.\" Posted @ http://rainydayramblings.typepad.com/"}, {"userName": "Mundie Moms & Mundie Kids", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/4397975-mundie-moms-mundie-kids", "userReview": "A compelling story with an enticing paranormal romance, an engaging story line and a beautiful retelling of the heartbreaking tragedy of the Titanic, Fateful is a book that I sat and devoured in one sitting. Claudia Gray has written a story that is captivating, well researched and incredibly written. Aside from being a paranormal story, I loved the historical part of Fateful. Claudia did a brilliant job with her detailed writing and how she handled the entire voyage of the Titanic. Even though I knew what was going to happen, I was so engaged with the romance, the paranormal twists and everything else that was happening, that my worries and fears for who would survive subsided until the moment the ship hits the ice burg. Claudia threw in some fabulous twists that kept this story well paced and kept me hooked until the very end. I thoroughly enjoyed being taken back in time and feeling as though I was aboard the Titanic with this great cast of characters. There's few books that I read and end up enjoying most every character I read about, and Fateful is one of them. Claudia's characters are so well written, in-depth, and despite some of them being paranormals, they felt believable to me. It wasn't hard for me to fall in love with some of the main characters and even the secondary characters, as they were easy to imagine, and even the villain was easy to despise. He was so well written. Talk about a fabulous evil guy. The story is centered on Tess, a servant girl from England who's traveling with the family she works for to the US. I really admired Tess's strength. She's had to deal with a lot of crap in her life, but that doesn't stop her from wanting to fulfill her dreams. In fact it makes her that much more determined to follow them. Tess inadvertently finds herself in the middle of a world she had no idea existed, and that puts her life in grave danger. Her reactions to some of the events that unfold aboard the Titanic are really credible. I'd be in state of shock if I found myself witnessing some of the things she does as well.The romance is so awesome! I love a well written time period romance. I really enjoyed the way Claudia developed the relationship between Alex and Tess. It's not a rushed, instant love kind of romance, but a well thought out, well written one that develops through out the course of the book. Alex is such a fabulous love interest. He's a tortured soul, but in a way that I totally understood why. He and Tess really bring out the best in each other. There romance is so addicting, I couldn't get enough of it! The sacrifices they make for each other totally made me cry! Not that I didn't except to cry since the story is set on the Titanic. Fateful has the perfect blend of historical references, romance and paranormal activity that fans of Claudia Gray, romance, history and paranormal books will really enjoy this one. I am in love with this book and it's ending is fabulous! I'm not sure if this is going to be a series or have a sequel, but whether it's a stand alone or not, this is a book I highly recommend picking up. There is some very mild language and an implied sexual scene. This is a book I'd recommend to readers 13 yrs & older."}, {"userName": "Eliza Rapsodia", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/6561375-eliza-rapsodia", "userReview": "2.5Parece una verdad universalmente reconocida que Claudita y yo no nos llevamos del todo bien. Hace un par de años leí Medianoche, el primer libro de su saga de vampiros y no pasó de ser un libro normalito que me desaburrió un par de días pero no quise seguir la saga. Otro día aburrido tiempo después leí Balthazar, libro spinoff también de la misma saga Medianoche y bueno aparte de las risas y el rodar de los ojos,también es un libro entretenido a pesar de lo ridículo que es a ratos. Este libro llegó involuntariamente a mis manos el año pasado y lo primero que pensé fue que Claudita y yo nos volvíamos a encontrar.Lástima que esta vez tampoco sea para sorprenderme demasiado.Inglaterra, 1912. El trasatlántico más famoso de todos los tiempos está a apunto de zarpar y personas de todas las nacionalidades y las clases sociales viajarán en él. Entre ellos la familia Lisle, una familia con más nombre y abolengo que dinero y como no, irán en primera clase. Tess Davies tiene 18 años y es la criada de esta familia. A pesar de que Irene Lisle, de la que es criada es amable y comprensiva con ella, el resto de la familia es un espanto. Tess no ve la hora de usar los ahorros que ha ido recolectando hace mucho para cuando llegue a Estados Unidos, va renunciar a su trabajo y buscarse un mejor futuro en el país de las oportunidades. Pero la noche antes de partir, cuando se dirige a una tienda por unos cordones la ataca un hombre lobo (en serio), pero es salvada en último momento por un joven que resulta estar guapo. A pesar del miedo, Tess logra llegar sana y salva a su casa. El siguiente día zarparán y todo será diferente.Todos conocemos esta historia, TODOS hemos visto Titanic un trillón de veces. Yo la vi por primera vez en VHS y estaba partida en dos cintas porque así era en la época. Pero hombre, ¿que podrían contarme de nuevo sobre esta famoso y desafortunado barco? ¿Sobre el desastre marítimo más importante de todos los tiempos? Pues que a la autora se le ocurrió la idea de ambientar una historia de amor paranormal en el megabarco más grande de la época. Nunca había leído algún libro de ficción ambientado en un escenario real como es el Titanic. Pero empecemos a hablar del libro propiamente y de lo que me gustó y no me gustó.Reseña completa: http://rapsodia-literaria.blogspot.co..."}], "description": "A tragic tale about falling in love on the world's most infamous ill-fated sea voyage as heroine, Tess, discovers darker secrets that lie beneath the doomed crossing. and a hidden brotherhood that threaten to tear her lover from her forever.", "title": "Fateful", "url": "https://www.goodreads.com/book/show/9874342-fateful", "average": 3.9, "cover": "https://images.gr-assets.com/books/1327541927l/9874342.jpg", "reviews": 1504, "authors": [{"url": "https://www.goodreads.com/author/show/1192311.Claudia_Gray", "name": "Claudia Gray"}], "type": ["Young Adult", "Fantasy", "Historical", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/9874342-fateful", "http://www.goodreads.com/book/show/10429017-fateful", "http://www.goodreads.com/book/show/12995861-aguas-oscuras", "http://www.goodreads.com/book/show/12015520-fateful", "http://www.goodreads.com/book/show/12516676-fateful", "http://www.goodreads.com/book/show/11332955-fateful", "http://www.goodreads.com/book/show/2722413-evernight", "http://www.goodreads.com/book/show/3054684-stargazer", "http://www.goodreads.com/book/show/6421588-hourglass", "http://www.goodreads.com/book/show/17234658-a-thousand-pieces-of-you", "http://www.goodreads.com/book/show/6619499-afterlife"]}