{"ratings": 2074, "userreviews": [{"userName": "Anthony Vacca", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/27183668-anthony-vacca", "userReview": "Didn't quite scratch that itch of mine for stories that make existentially desolate use of the down 'n' dirty American South, and are peopled with the hopeless and the damned blindly eking out their violent lives. For more of that, say hey to Joe. Like that previous novel, Father and Son begins with a seemingly cold narratorial remove from its cast of down-and-outs and downright despicables; but unlike Joe, which maintains that voice and ultimately uses the distance from the character's thoughts and feelings to deftly characterize them through their actions versus their words, after the first hundred pages Brown switches to a more intimate relationship with the thoughts, feelings and memories of the many fathers and sons that plague this novel. But a bad novel this does not make. From the three books I've read and the few interviews I've investigated, Brown was an author who consciously chose to push himself as a writer with each new work, testing what he can do with his own artistic craft. I respect the shit out of that. So while this novel doesn't quite succeed with its attention to its characters' psyches, and though it winds down with an ending that doesn't quite live up to its themes, which are no less than the stuff of Greek mythology, Father and Son is still a grungy ride through 1960's Mississippi and is replete with grimy roadhouses, drunk driving, murder, cruelty to children, greasy sex and even a mean-spirited monkey. Also this title is a deceptive one because there are moms, too."}, {"userName": "Diane Barnes", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I am still in shock at how great this book was, and how close I came to not reading it at all. It was one of the October choices for the group \"On the Southern Literary Trail\". There are 2 choices each month and I like to read at least one of them to get in on the discussion. The other choice was \"The Bad Seed\" by William March, and since I remembered the old movie with Patty McCormack as the evil child, I put it on hold at the library. But \"Father and Son\"was available on the shelf so I checked it out, brought it home and looked through it. The cover picture was a little off-putting, the synopsis of a released convict going home to terrorize his town and family didn't sound like my kind of thing, so I laid it aside. Meanwhile The Bad Seed never showed up, I finished the book I was reading, October was passing, the discussion threads I glanced at were interesting (bar monkey?), so I decided to read a few pages to see where it took me. Where it took me was deep into Mississippi in 1968, deep into the southern cadences and slang that I grew up with, deep into dark family relationships and secrets of real people who loved and hated and did the best they knew how to do with what life had given them. It took me into a story so riveting that I even cared about Glen, the evil man who caused so much pain, and I desperately wanted him to find a way out of the darkness that enveloped him.This book took me back to a time when phones were on tables in houses, and if it rang and no one was home, well, too bad, you missed the call. When you reached into the cooler and pulled out a short coke, when you needed a church key or a can opener to drink a beer. And there was a lot of beer drinking going on in the novel, but there was a can opener in every car, hanging on strings on the porch just in arm's reach, in boats and coolers. Larry Brown brought the time and his characters to life with never a false note.I was a third of the way through the book before I read the author bio, and was shocked to learn that the author had died of a heart attack in 2004. What a loss that was. But his books did not die with him, so I'll read his other books and recommend him to other people. So, a big fat thank you to whoever checked out \"The Bad Seed\" and didn't bring it back on time."}, {"userName": "Shaun", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "Loved, loved, loved this...So good on so many levels. A fine piece of Southern Gothic, indeed.The title Father and Son(the perfect title) resonates throughout and serves the story on many levels. The language is simple and clean, even subtle and quiet, yet so many of the scenes were so well-constructed and vivid that I felt myself absorbed while reading in a way that doesn't always happen. Like many, I see the story unfolding on the big screen of my mind as I turn the pages, but unlike many stories where the characters and the scenes are fuzzy, ill-defined images, these were crystal clear.The weaving of the various characters, lives, and their stories was also flawless, and the grand finale?...one of the best I've read in a long time.Would recommend to fans of other Southern Gothic writers like William Gay, Tom Franklin, and Ron Rash.Good stuff, so good I will now have to read all his other works. Sadly, like a number of great writers before him, he passed away way too early. He died in 2004 (from a heart attack per wiki), still in his early fifties."}, {"userName": "El", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "Larry Brown's Father and Son is what falls into the categorization of Southern Lit, and more specifically, Grit Lit.Not all Southern Lit is Grit Lit. The former would be like Flannery O'Connor, who wrote about the grittiness of life and real issues occurring, especially in the Deep South, but it wasn't violent (or if there was violence, it served a greater purpose in the story). The latter would be like Harry Crews (from the one book I've read by him), Larry Brown (from the one book I've read by him), and Cormac McCarthy (who I haven't even read beyond The Road yet, and that's not one I would classify as Grit Lit, but the others, from what I've heard, would). I haven't spent much time with William Faulkner yet, but I think he falls in with Flannery up there, and I'll find out one of these days.I'm beginning to realize I may not be a particular fan of Grit Lit.I don't mind harsh truths and violence. It's a part of life, and I can accept that. I know the Deep South has been known for this through the years as being an especial part of their lives, and again, I can accept that. But when I read a lot of these authors who write about these things, it's not so much they're saying \"This is a way of our lives\", but rather \"Let me try to shock you.\" And I don't like that.In Father and Son we have a man who has just returned from prison for murder, and he's right back on the same road when he gets back to town. This would be a fine story already, just based on that, but it starts immediately with animal abuse which is difficult for me to read. There's some animal abuse throughout, and while it's not always in-your-face, it's still there, and as a champion for all things animal, it was hard for me to stomach.On top of that, then there's also the sexist treatment of women. Ugh. There's no real point to that in this story, other than to show just how reprehensible every male character in the book is. There's assault and rape and it comes across as gratuitous.But, alright, maybe I'm just being too nitpicky about the social issues that concern me in our society already.If you were to ask me the difference between the characters, I wouldn't be able to tell you. I remember the one who came back to town, but there's nothing about him that sets him apart from any other male character. There are several male characters and there's nothing differentiating them from one another. Very little description (if any) of who they are and what makes them tick. And the women are portrayed the worst. They are all interchangeable. Maybe the size of their breasts are different, but I never made any connection to any of them either, because they were mostly only there for the amusement of the other characters.I wanted to enjoy this more than I did. It's one of the 50 books on this list of Southern authors I found recently, but I was left feeling cold and disinterested by the end. I'm not sure what sets this book apart from others like it. I can see how others enjoy it, but it's not my preference. The good news is it does read quickly."}, {"userName": "Dawn", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/24821592-dawn", "userReview": "The setting and characters in this story are so vividly alive in my mind as bits and pieces of reality that I can hardly separate the two. I can see real faces and real places in this novel so it is very hard for me to truly make an unbiased review of this novel . To me Larry Brown wrote Father and Son as one of his finest novels ever. It is a novel that moves from conflict to uncomfortable conflict constantly as his characters stay in motion. The whole book is like a thunder storm building up into a huge downfall with lightening striking and tornadoes touching the old ground in light places until finally the story crashes or ends in its inevitable ending . Then, the world can be made right again and go forward. Father and Son displays just how volatile certain relationships with one person can be. The two together cannot always occupy the same space. Good and evil cannot always occupy the same space for a length of time . Sooner or later there will be a battle. This story was much more complicated than I am explaining here . Larry Brown will grab you from page one and take you on the wildest , most horrific ride a Father and Son relationship struggle can carry you in a way no other writer ever will. That is all ..."}, {"userName": "Larry Bassett", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "Here is something by and about Larry Brown to get yourself ready to read Father and Son. Always good, I think, to know a little bit about the author. He says, “I try to start with trouble on the first page, trouble on the first page.” So, here it is. Trouble for seventeen minutes: http://www.youtube.com/watch?v=dw1cr2...Now, I recommend that you read Father and Son and get to know Glen. He didn’t feel much like spending the whole day looking for a job. It was probably going to be the same story everywhere he tried when they saw that missing three-year gap and found out he’d been in the pen. He’d have to answer all their questions, humble himself to a bunch of pencil-pushing assholes with their little chickenshit paychecks and rules and hours. Their time clocks to punch. He didn’t want any of that anyway. He just needed about a hundred dollars. That would keep him going for a while, just until he got on his feet. There are not enough bad names to accurately portray Glen.But he did release the prize fish rather than kill it.Irredeemable? Just a little uncertainty about that.But very little. His last words? “I’m sorry.” And he is. I liked this book a lot, four stars worth, and look forward to spending more time with Larry Brown."}, {"userName": "Jamie", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "Oh, whoops. OK. I’ve been reading this book “over a month” but really I was reading Provinces of Night five more times (not kidding) and this only took something like three days, because it was good, so good, and dark and brutal but Larry Brown kind of good. It will stick with me, I can tell from the time I’ve already spent thinking about Jewel and David and Virgil and Mary, and it didn’t do what I feared, which was make one man too good and the other too evil. No, both are drawn in shades and they’re living and breathing and it’s all the more unnerving. I keep going back to look up sentences, trying to figure out how Larry Brown gets to places so complex with prose so straight and simple. The cover blurb claims the model is Faulkner but if Faulkner is anything it’s dense and opaque and Father and Son is pure transparency."}, {"userName": "Carol", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "This was a very dark, raw and unfiltered tale. The blurb on the back cover describes this novel as a “classic story of good and evil.” No kidding! Even so, I was mesmerized – sometimes disturbed, but always compelled to finish the book."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "Another home run hit from the late great Larry Brown. I loved this book."}, {"userName": "Ed", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/4643472-ed", "userReview": "More \"literature\" than crime fiction, Larry Brown takes us on a slow train ride of life and death set in the grinding poverty, alcoholism and tragedy of rural Mississippi of 1968. Glen Davis is released from prison after serving three years for vehicular homicide and wants revenge on everyone in his life he believes wronged him. Turns out, that's a long list, staring with a bartender and his pet monkey and ending with his elderly teacher and mother of his half brother Bobby, the County Sheriff.Glen holds onto his tragic past with a violent hate he wields like a club while the people in his life try to move on with their lives. His father Virgil, a WWll survivor of the Bataan Death March, still loves his wayward son and tries to make him fell welcome. His brother Puppy, also loves Glen and wants him to settle down and build a happy life. Jewel, the mother of his child, finally understands what Glen is all about while falling for Bobby, the County Sheriff. Bobby wants to make peace with the violent and unpredictable Glen before trouble starts but mostly, he years to start a new life with Jewel and her son David. Everyone is striving for happiness in a very tough world - except Glen.This book is somewhat of a departure from the usual crime fiction/thrillers I usually read. Beautifully written, I could actually taste the cool, long necked Buds while fishing for catfish on a humid afternoon in 1968 Mississippi. Larry Brown evokes those very human qualities of love, hate and retribution in tangibly unique way. An awesome read I'll not soon forget.............Ed"}, {"userName": "Jimmie", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/16204583-jimmie", "userReview": "This is my first Larry Brown book; it will not be my last. Brown's writing is phenomenal in his ability to paint characters outside of most people's experience as well as describe settings in such a way that I found it hard to comprehend--a description of the trailer \"home\" of a minor character is worth the reading of the book. After reading Serena recently, I am again struck with the main character's lack of compassion, empathy in his thoughts, intentions, and indeed actions. Yet just when the reader is convinced there is no humanity left in this individual, Brown gives him a breath of regret for what he has done and causes the reader to react to the surprise of feeling some compassion for him. In fact, throughout the book, the characters are revealed to be quite different from previous judgments the author has set the reader to assume/judge. This is not a predictable story line--at least, it was not for me.The suspense is not resolved until the very last pages of the book. Brown caused me to certainly \"turn the page\" although I sometimes did that with dread of what might happen next."}, {"userName": "Kirk Smith", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "My second that I have read by Brown and I am understanding him a little better. His slow pacing sets a mood and it just can't be rushed. By the second chapter there is a bloody bar fight with a mean little yellow-fanged monkey that left me laughing and shaking my head. Lots of action and violence, I plan to vote this in the top five on a list: \"Country Noir\". Larry Brown is a real trickster. He creates lousy mean characters that as soon as you are ready to write them off as unredeemable killers, he takes you out with them for a day of fishing and you start questioning yourself that maybe they have some good in them, and next you are questioning why you should even be judging them. Very complex characters and very satisfying, tension builds till the last pages. Looking forward to his others I've saved FAY, maybe one of his best, for last."}, {"userName": "Michael", "userReviewDate": "Apr 02, 2009", "userURL": "http://www.goodreads.com/user/show/2065514-michael", "userReview": "This story is the anthisis of \"The Prodical Son.\" In this work it isn't the repentent son coming home to ask forgiveness but a rebellious malcontent fresh from prison after serving time for vehicular homicide.Bobby Blanchard is the sheriff. He had put Glen Davis into jail after Glen had run over and killed a young boy. To add to the drama, Bobby is in love with Glen's girlfriend, Jewel, who is the mother of Geln's illegitimate son.The action takes place in the few days after returning from prison. Glen is a vicious drunk who treats everyone with hatred including his father, Vernon, who survived the death march to Batan but was disabled in that historical disgrace. Glen is only back in town for a day when he takes his father's rifle and kills a local bar owner that he had a grudge with. Brown has written a compelling novel describing an aspect or rural Mississippi during the early days of the Viet Nam war.  There are influences of John Steinbeck in the dscriptions of the poor, the numerous misfortunes that seem to befall them and the acceptance of tragedy as a way of life. It is almost as if some of the characters of \"The Grapes of Wrath\" settled in this small Mississippi town instead of traveling to California. Another influence is in Charles Dickens with the connections between characters. In this story, Vern had an affair with Bobby's mother before Vern was drafted and was unable to marry her when she became pregnant. Bobby's mother, Mary, married another man who was later killed in the war but Vern later married Emma when she became pregnant.That child was Glen and through his life, Emma poured hatred to her son in the belief that Vern was still having an affair with Mary. In short, this is a supurbly written story with tragic and heroic figures at a crossroad. Once finished, the story of Glen and his half brother Bobby will stay with the reader for a long time. Highly recommended."}, {"userName": "Mel", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/2030264-mel", "userReview": "It is hard to describe with words the impression this story made on me. This is a very haunting dark and violent story; one that I believe will stay with me for a long time. I felt like I knew these people, and spent time with them in their hard luck little town. I wish I would not have had to spend any time with Glen but I got to know him too.I didn't like him although there were times when I thought I could give him a chance but he just would not let me like him. He just was unable to act like a decent human being. Truth be told, I wanted to put a gun to his head in parts.  I grew to really like some of the other characters. People like Mary and Bobby and Virgil. I really did like Virgil.I wanted to go fishing with him and sip an ice cold beer with him on his porch.  This story takes place in a mean world where people do their best and sometimes that is still not good enough no matter how hard they try but they keep on going. They persevere and they try to help each other out, no matter what the personal toll may be. Parts of this story will give you the chills other parts will make you just rejoice at the human spirit. It will stick with you. You can't help but be moved by this story. Another one for the best reads stack. I must be having a lucky streak with all of the good books I have been reading lately but I have to also give this one 5 stars. Highly recommended if you enjoy Southern Lit. This one will haunt you for a while though."}, {"userName": "Ruth Turner", "userReviewDate": "Sep 03, 2014", "userURL": "http://www.goodreads.com/user/show/17861817-ruth-turner", "userReview": "I only discovered southern literature when I joined Goodreads and I've read some amazing books since then. When I saw all the great reviews for Father and Son I was sure this one would be added to the ever growing list. Not so.It took me nearly half the book to get interested. The characters were flat and bland, so much so that I had trouble keeping the who's who straight.The writing was choppy at times and rambling at others. I found myself re-reading sentences or paragraphs trying to clarify what the author was telling me.The story line was excellent; dark, disturbing and at times difficult. It ended up being a good read after all, just not a great one."}, {"userName": "Angela Herring", "userReviewDate": "May 08, 2007", "userURL": "http://www.goodreads.com/user/show/80153-angela-herring", "userReview": "When I finished it I was shaking. This is a beautiful, horrifying story of a man just released from prison in Oxford,MS and all and everyone that waits for him at home. The characters in this book are so much more fleshed out that in Joe, the other Larry Brown book I've read, although the outlines of them seem to exist in the latter as well. These characters -- and there are a few -- are real, dynamic, interesting, scary and compassionate. Even the killer himself. Definitely read it. Larry Brown is something like Faulkner and Hemingway combined, with a little bit of Flannery O'Connor mixed in as well. Crisp, quick sentences, brutal, drunken scenes and incredible, feeling people."}, {"userName": "Josh", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/10773168-josh", "userReview": "Quick geometry review.....three sided shape? Triangle. Four sided shape? Square. Five sided shape? Pentagon. Hanging in so far? OK, six sided shape? Hexagon. Now, for the one that applies to this book, for all the points.....seven sided shape?Well, the answer to that quiz is the descriptive shape I would use to outline this one. Not your typical love triangle book of predictable proportions, but a love heptagon (I admit, I hit up my friend Google to be sure I was correct). Did you ace the test? Perhaps. Will you love this book? Well that depends on your leanings.For me, it's a five star. All the elements of Larry Brown that I love: gritty, distinctly Southern, luridly descriptive, themes of good verses evil with arguments that make you consider both sides. He has a way of working in elements of great unbelief that work somehow and an ability to twist multiple story lines together which at first seem somewhat disconnected only to later be an interrelated part of the story. Faulkner-esque without having to ramp up your brain while also taking care to retrace all the steps as you go. Brown gets into gear quickly, and never really lets off the gas. If you can't hang through and in some ways find way to connect with the unsavory side of life you might avoid this one, but where's the fun in that?"}, {"userName": "Lawyer", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "Review forthcoming. I recommend Larry Brown as a must read for those interested in Southern Literature."}, {"userName": "B. R. Reed", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/32410049-b-r-reed", "userReview": "I must say that I had mixed feelings about this book. Larry Brown is skillful at developing good characters and writing about place, in this case the Oxford, MS area, but I was having a little difficulty getting at the overall theme or point of the story. It opens with a young 20-something named Glen Davis being driven home by his brother following release from prison. Glen just served three yrs at Parchman for manslaughter after killing a young boy while driving drunk. One would think a little contrition might be in order but young Glen is mad at the world and is full of hate and anger. Almost 100 pages into the book I was still trying to determine the source of Glen's anger. Early on I sensed a High Noon type of showdown coming between the local sheriff, Bobby Blanchard and Glen. Glen's return home gets off to a very violent start and for the next five or six days of the story there is plenty of hate, meanness and violence before it concludes. There are some interesting family relationships that I won't reveal that stretch credulity. There is a love interest (Jewel) shared by \"the good\" (Bobby) and \"the bad\" (Glen). Glen only seems to have tender feelings for deer and fish (he was a little hard on one particular \"bar monkey\" - funny) and is not at all interested in his 4 yr old son. The reader knows that things are not going to end well. Perhaps Brown was making a comment on nature vs nurture? Is meanness in one's genes or is it fueled by the environment in which one is raised? As is typical of a Larry Brown story there is plenty of alcohol consumption, impaired driving, cigarettes, coffee and some sex. Cold beer is central to life. I found it interesting that this story was set in 1968, a year of great turbulence in America, however, about all that is mentioned about anything outside of the story is a young man getting ready to ship out to Vietnam. Perhaps the story is a microcosm of the turbulent scene in 1968 America? I can tell you that the sheriff had his hands full (especially on Fri and Sat nights) and could have used more deputies. I don't see any comparison between Faulkner and Brown as writers other than the Oxford setting. Faulkner was an artist and an innovator writing about universal themes. Brown developed into a solid writer and storyteller but there is no evidence of genius in his writing. My view anyway. I would recommend the book and would say that it was a story that kept me interested though the ending fell short for me. I did enjoy Brown's book, Joe, more than this one. Thanks to Laurie of \"the trail\" for recommending Larry Brown to me."}, {"userName": "Donna Everhart", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/7077811-donna-everhart", "userReview": "I've been on a Larry Brown kick since last October when I visited Square Books in Oxford MS and purchased LARRY BROWN, A WRITER'S LIFE. Larry Brown was born in Oxford, and his stories take place in small towns nearby, and throughout MS. After reading this biography by Jean Cash, I was so intrigued, I bought BIG BAD LOVE, FACING THE MUSIC, JOE, FAY, FATHER AND SON, BILLY RAY'S FARM, and A MIRACLE OF CATFISH. I think the only two books I don't have are DIRTY WORK and ON FIRE.Either way, this is my review of FATHER AND SON which I just finished a couple nights ago. I've loved all of LB's books thus far, but this one has been my favorite.FATHER AND SON was the sort of book I would think about during the day, anticipating the time when I could pick it and start reading where I left off. I usually only get to read at night and I found myself going to bed earlier and earlier, just so I could get back into the story.Glen Davis is one of the main characters, and the \"son,\" and Virgil is his \"father.\" It's a story about not only their relationship, which is tenuous at best, but also many others who are an integral part of their lives. His brother, nicknamed \"Puppy,\" the sheriff, Bobby Blanchard, Jewel, the love interest of both Glen and Bobby, and Mary, Bobby's mother. Glen has just come out of prison, but not really. Because to me, he's imprisoned within his own mind. He is mad at the world, and especially his father. Actually, he's mad at many people, and prison hasn't helped him forget all the wrong's he believes have been heaped on him. As I read, I kept hoping Glen would have an epiphany of sorts, a come to Jesus awakening that would mellow him out, make him forgive. But Glen is a hard man, out to settle scores.The book is written from many different points of view so you get where each of the characters are coming from. I felt sorry for Virgil, who is an old man wishing his son would do right. I had empathy for Jewel's predicament, having a child by Glen, hoping and waiting for him to do the right thing, and Bobby Blanchard, LB's \"good guy,\" was somebody we'd all want for Sheriff in our own hometowns. The interactions of these characters lays out a complex history with secrets that are slowly revealed as the story moves on. As with many of LB's books, the writing is tight, crisp and full of imagery and descriptions. If you've never been to MS, or anywhere in the deep south, reading his stories will make you feel like you've been there."}, {"userName": "Ron", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/3961732-ron", "userReview": "I'm giving this novel 4.5 stars and rounding up to 5. It's a good read, a page-turner; shocking at points, funny at others. As a story set in small town Mississippi during the 1960s, it invites comparison with Faulkner, and has plenty of Faulkner's melodrama, but without the convoluted prose style and endless sentences. In the opening pages there are two murders and the killing and mutilation of a monkey. This is followed by scenes of heavy drinking, desultory sex, rape, street fighting, shootings, more drinking, breaking and entering, theft, more sex, assault, all set against a history of more of the same. That's the steamy Faulknerian pot-boiler part that keeps you turning pages.What Brown brings to the mix is a fascination with the absolutely ordinary routine of daily life that his characters live in the midst of all the melodrama. During the handful of days during which the action of the story takes place, we get to spend a lot of time with several of his characters: an old widower living alone with his dog, an unmarried mother who works as a fry-cook in a diner, the sheriff who still lives with his mother, an ex-con just out of prison, his hapless brother with a trailer house full of kids, who loses his job, and a retired school teacher who's grown son was fathered by a local married man.As the long, hot summer days and nights pass, one after the other, Brown follows his characters, each often alone with their thoughts, at home, at work, or just driving their cars. The pace between sudden bursts of plot is slow, unhurried. Brown notes the passage of the sweltering sun across the sky and the eventual storms that bring rain. And you become absorbed not only in the gradual flow of daily activity and the small talk that disguises deeper yearnings and sorrows, but in the Faulkner-like ghosts of a violent and passionate past that continue to haunt the present.The book is true to its title, being full of layer upon layer of references to fathers and sons, and in particular the emotional damage done when sons die young and suddenly. A quick count in the novel yields five dead sons, whose fathers live on after them in various states of grief. In some ways, the narrative flow is almost biblical. The old man with his good-son, bad-son offspring bring to mind Adam, Cain, and Abel. Or David and Absalom.I recommend this novel to anyone interested in the writers of the Deep South. Brown has certainly earned his place in that tradition."}, {"userName": "Frau Sorge (Yuki)", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/7712794-frau-sorge-yuki", "userReview": "I know it's very different setting, but I heard it all the time while reading Father and Son:I was driving up from TampaWhen the radiator burstI was three sheets to the windA civilian saw me firstAnd then there was the copAnd then the children standing on the cornerYour love is like a cyclone in a swampAnd the weather's getting warmerI was getting out of jailHeading to the GreyhoundYou said you'd hop on one yourselfAnd meet me on the way downI was shaking way too hard to thinkDead on my feet about to dropWent and got the case of vodka from a carAnd walked the two miles to the bus stopGot on the bus half drunk againThe driver glared at meMet up with you in InglisThumbed a ride to Cedar KeyIf we never make it back to CaliforniaI want you to know I love youBut my love is like a dark cloud full of rainThat's always right there up above youThe blurb says that it all about evil eating up man's soul. There's no good and there's no evil. The book of Larry Brown is beautiful and terrifying story. It's rough and heartwrenching at the same time, full of violence and yet I couldn't stop reading.Highly recommended."}, {"userName": "William", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/10400389-william", "userReview": "The story is told in third person but with a lot of stream of consciousness thrown in, much like the last novel I'd read, American Rust by Phillipp Meyers. The problem with this technique, if it is a problem, is that it results in quite a bit of repetition from various characters' points of view which slow down the novel without necessarily advancing the plot. I have been fascinated by how these Southern writers employ Romantic elements, such as using the setting--time. landscape, and weather--to reflect the characters' psyches or tensions. I also thought that the character of Glen is inconsistent; obviously, he is always making excuses for his bad behavior, but towards the end, there are other characters who join in saying what a hard life he has had. Well, if he has had a hard life, most of it is of his own making. Last comment, I was somewhat surprised that the protagonist and the antagonist only confront one another once at the beginning of the book, although the protagonist is looking for the other the whole novel and you are sure that there will be the ultimate showdown at the end. It doesn't happen. Neat trick."}, {"userName": "Rachel", "userReviewDate": "Jan 23, 2008", "userURL": "http://www.goodreads.com/user/show/419307-rachel", "userReview": "(written 6-03)Wow. Larry Brown is a master craftsman - I like him even better in the novel form than in short stories. he gives you just the right hints, keeps you just enough in the dark to stay interested, reveals past events not through narrative but through natural speech, like it would actually happen. The southern slang dialogue is perfect. Glen's five days home after he gets out of prison are awful. He murders, rapes, gets drunk and wrecks his car, neglects his son, he's bad news. Refreshing to have a main character you love to hate. Bobby, the sheriff, is the perfect foil. I love the way Larry Brown writes, but I would like to see him write some different subject matter. It's all beer, whiskey, cigarettes, women, pickup trucks, tragedy and hopelessness. Maybe that's just his world. It's depressing in a way and comfortable in another. Great novel."}, {"userName": "Aramys", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/49336560-aramys", "userReview": "Tremenda."}, {"userName": "Danielle", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/5709804-danielle", "userReview": "I had high hopes for this book going into it but I rapidly found myself surrounded by one dimensional characters, no one of which I could find likeable (except possibly David). Adding to my dislike was the fact that I found the tone dull. Sometimes a simple style adds to the story, but in this case there was no character development or plot twists to be enhanced by a minimal style.[return][return]I didn't dislike the book to an extreme because there was nothing in it to make me invest enough in it to care that strongly. In the end, I was left with a shrug that it was over and a complete readiness to move on to my next read."}, {"userName": "Chilly SavageMelon", "userReviewDate": "Jul 13, 2007", "userURL": "http://www.goodreads.com/user/show/190820-chilly-savagemelon", "userReview": "This is the first Brown I've read, sort of Bukowski (without the sardonic humor) meets Jim Thompson in the Southlands. Nice telling on the backstory of various interweaving characters and their current motivations. Brown brings something back from the land of misery and hangovers to create a novel everyone might relate too. Authentic in the telling, grit in the details. If nothing else, and homage to what a DUI paradise the rural 70's were..."}, {"userName": "Lisa", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/223374-lisa", "userReview": "I love a Southern novel and this one had all of the Southern elements. A great listen as the narrator had a true back country Mississippi red neck accent. May be too much for some listeners but as a former MS resident it wasn't too much for me. Suspense and down right unlikable characters. I remember many references to author Larry Brown from Booktopia Oxford authors and I finally read Larry Brown."}, {"userName": "Stephenson", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/16676263-stephenson", "userReview": "solid southern gothic, heavy on the darkness. as a father to two sons, many of the passages hit home, and also made me glad that our lives aren't nearly as fucked as the fathers and sons in this novel. I love Larry Brown."}, {"userName": "Doug", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/9248545-doug", "userReview": "To qoute David Allan Coe, \"...I told him it was not the perfect country and western song because he hadn't said anything at all about Mama. Or trains. Or trucks. Or prison. Or getting drunk.\"Well, I contend that Larry Brown has written the perfect Southern novel. This book had drinking, fighting, cussing, and single-wide trailers. It had church, family, and community. In other words it had both the bad and the good of growing up in the rural South. It even had a monkey for goodness sake! I was blown away. Five stars is not enough. I just wish it hadn't taken me so long to find this book and this author. On the plus side, I can now look forward to reading everything else that he wrote.Nothing loses me quicker than an author who tries to write about the South without ever having lived in the South. Three or four pages into this book, I flipped to the back cover to see exactly where in the South this man grew up. Larry Brown was authentic South. Larry Brown was Devil's Brew on Saturday night, Lord's Supper on Sunday morning kind of authentic South. So many times while reading this novel, I found myself thinking, wow, I remember that. For example, where I come from, people really do take food to the house of a family which has lost a loved one. Lots of food. He used words and phrases that I grew up using. So real for me. The story was great. The characters were wonderful. I could keep on gushing, but I will just say that I highly recommend this novel to anyone who appreciates a good heartfelt story. No matter where you are from."}], "description": "This classic story of good and evil takes place in the rural American South of 1968. After being released from prison, Glen Davis returns to his hometown only to commit double homicide within forty-eight hours of his return. Sheriff Bobby Blanchard, as upright as Glen is despicable, walks in the path of Glen’s destruction and tries to rebuild the fragile ties of the families and community they share. Dark secrets that have been simmering for two generations explode to the surface, allowing us a chilling glimpse at how evil can fester in a man’s heart and eat up his soul.“This is the novel that will live with you day and night.” — Kaye Gibbons“Cancel the competition for the suspense thriller of the year. Larry Brown has already won it with Father and Son.” —St. Louis Post-Dispatch“Larry Brown is one of the great unsung heroes of American fiction... His work is a reminder of a reason to read.” —San Jose Mercury News", "title": "Father and Son", "url": "https://www.goodreads.com/book/show/256109.Father_and_Son", "average": 4.12, "cover": "https://images.gr-assets.com/books/1388729151l/256109.jpg", "reviews": 161, "authors": [{"url": "https://www.goodreads.com/author/show/31125.Larry_Brown", "name": "Larry Brown"}], "type": ["Fiction", "American", "Gothic"], "outlinks": ["http://www.goodreads.com/book/show/256109.Father_and_Son", "http://www.goodreads.com/book/show/7534712-father-and-son", "http://www.goodreads.com/book/show/33225319-padre-e-hijo", "http://www.goodreads.com/book/show/377993.Joe", "http://www.goodreads.com/book/show/888492.Fay", "http://www.goodreads.com/book/show/539933.Big_Bad_Love", "http://www.goodreads.com/book/show/377994.Dirty_Work", "http://www.goodreads.com/book/show/377991.Facing_the_Music"]}