{"ratings": 15228, "userreviews": [{"userName": "S.L. Jennings", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/13533465-s-l-jennings", "userReview": "I can't wait to share this heartfelt story with you all! FOF will be out July 18th!Tons more teasers to come on FB!S.L. Jennings author page...Come see me!My Blog"}, {"userName": "Lisa", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/6010839-lisa", "userReview": "Maybe I know, somewhere deep in my soulThat love never lastsAnd we've got to find other ways to make it aloneOr keep a straight faceAnd I've always lived like thisKeeping a comfortable distanceAnd up until now I had sworn to myself that I'm content with lonelinessBecause none of it was ever worth the riskBut you are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionI've got a tight grip on realityBut I can't let go of what's in front of me hereI know you're leaving in the morning when you wake upLeave me with some kind of proof, it's not a dream, ohYou are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionYou are the only exceptionAnd I'm on my way to believingOh, and I'm on my way to believingParamore, The Only ExceptionFear of Falling by S.L. Jennings was a book I almost gave up on. To be completely frank, I had a very hard time liking Kami at the beginning and with my dislike came this emotional detachment. I even stopped reading the book for some time and picked it up once again to give it one more go. When I began reading once again, things changed for me. I saw Kami in a new light and I have to admit that Blaine’s swoony magnificence played a big role in turning things around for me. With respect to Kami, there came a point in the book where her fears, pain and suffering were so powerful and tangible that I could not help but feel for her. Fear of Falling went from a book that I could barely get through to one that was unputdownable! I am so glad I have this one a second chance.KAMI:\nI was never one to believe in fairytales. I always figured that when things were too good to be true that they were just that – a beautiful lie.*Sex was my band-aid over the bullet wound that was my scarred psyche.\nFear of Falling is essentially about twenty-three year old Kamilla Duvall. Kami’s tragic past has shaped her. Molded her into someone who believes they are not worthy of being loved and also incapable returning that same emotion. Kami lives her life utterly paralyzed by her fears. She has somehow accepted that this is how she is and somewhere along the way Kami stopped believing in her own happiness. Perhaps she never believed in it from the start. Things change unexpectedly when she meets a sexy tattooed bartender one night at a bar. The attraction was undeniable. However, for once in her life, it was much more than simple chemistry. Never being one to rise to the challenge, Kami does what she always does...she runs. BLAINE:\nHe was frighteningly beautiful; a rare work of art that needed to be admired and thoroughly explored.\nBlaine Jacobs is this sexy and mysterious bartender/ bar owner who is battling his own inner demons. The tragedy in his past has left him mentally scarred but he has somehow pushed past his inner turmoil and opted to simply live his life. I loved how infectious he was, how you could not help but like him (and swoon over him) immediately. When he meets Kami for the first time at his bar, her sadness called to him. Something deep within him shifted and he somehow knew that Kami was worth the pursuit.S.L. Jennings definitely wrote about a tough subject matter in this book. Like I mentioned earlier in this review, at first I was not so sure about Kami. I didn’t like how she was towards the opposite sex and how that made her seem so callous. Once I got more of her back story, I began to understand where she was coming from. The unimaginable hell that she lived in for her entire young life created such deep, deep layers of pain and self-loathing. This is a girl who does not really know love or understand it. Therefore, how can you receive and give something that you are incapable of understanding? She had horrifying things done to her as a child which made her associate love with something that was evil. All this was ingrained in her psyche from a young age. When Blaine comes into the picture and begins to show Kami how life could be different and what love can feel like, I truly did understand her fear. I further understood that with Kami it would be a long journey, one that would have many ups and downs in order for her to finally reach that final place of peace. One thing that I commend this author on is the fact that she took such a damaged girl and brought her to life. I literally felt Kami’s pain. It poured off the pages of my kindle. I will forever remember Kami as one of the most intensely broken girls that I have ever read.What happens when you desperately want to save someone who does not want to be saved???To me, Blaine was utter perfection. Blaine was simply a beacon of light in the darkness that was Kami’s world. He gave Kami hope in her world of heartbreak and torment. I did at times think he was too good to be true but this is a romance and what’s a good romance without a very shiny white knight? Blaine takes it upon himself to be the one that saves Kami and I think that he never really understood that she needed to be the one that saved herself until he was slapped in the face with Kami’s hurtful ways. This need to save Kami, to heal her, is something he immersed himself in and fought so hard for. One thing you are unable to deny is his love for Kami. It was as fierce as it was all consuming. All in all, Fear of Falling is a tale about a very broken girl. It is her story of how she finally managed to get to the place where conquering her demons was no longer so frightening to her. It is a story about how she finds love, but also learns how to accept it and bask in its warmth and tenderness. Not all women who have been abused and scarred find their Blaine. Kami did. And, it is beautiful. To have this author tell a tale with so much heartache and then give us insurmountable joy is worth the journey that it takes to get there."}, {"userName": "Christy", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "5 Origami Stars!!!!!\nMy name is Kami and I am constantly afraid. And the thing that scares me the most is the very thing I want.\u2028Kami has spent her whole life afraid. Afraid of what? The answer to that is simple... pretty much everything. It all stemmed from her abusive childhood. There are only two people in the world she trusts, feels safe with. Her best friends, her family, Dom and Angel. She doesn’t let anyone else in. Ever. Then one day, she meets him... Blaine. He changes everything. \nBlaine is instantly enthralled by Kami. He wants to know her. From the moment he first meets her, he can tell something is different about her. Kami gets a job in Blaine’s bar. The more he gets to know her, the more he wants to know. For the first time ever, Kami is slowly letting someone in. Blaine see’s the fears Kami has. All he wants to do is shut them off. \n“Your fears are not you. Do you hear me? They don't define who you are.” \n \nKami’s fears are much more complex than Blaine could have imagined. She has some real reasons for her fears. They might seem a little extreme and excessive, but once you hear her story, it all makes sense. \n‘The real monsters aren’t stalking in the shadows with masks and butcher knives. They don’t have fangs or claws. They’re all around us, hiding in plain sight. That’s why they’re so scary.”\n\u2028Kami and Blaine’s relationship is complicated to say the least. Kami is broken. Her fears consume her. No matter how much Blaine trys to help her... \n\n“You can't expect to save someone that doesn't want to be saved.” \n\n\u2028But he’s always there. No matter what. He is falling in love with her. All he wants is to help heal her. For her to know that he is there. She can trust him. \n\n“Don't worry,\" he smiled, pulling me into the hard warmth of his chest. \"I've got you. I'll always catch you when you fall.” \n\n\n\n“Fear isn’t all you have. You have me. If you want me, you have me.”\nBlaine is breaking down every wall Kami has ever put up. And it scares her. It scares her more than anything. She can’t fall for him. Sometimes, no matter how hard you try... you can only shut off your feelings for so long. This is my absolute favorite part of the book. \n\n\n“He was't just my exception. He was my reason.”\n\n\nBlaine was the best. Tattooed, pierced. He was so supportive, loving, patient, kind, and understanding with Kami. I can’t express to you how much I adored this man. He gave her so much hope. So much encouragement. \n\n“You’re a fighter, babe. You aren’t afraid. You aren’t crazy. You. Are. A. Fighter.”\n\n Blaine made her feel like she could trust someone again. Possibly love someone for the first time. Kami had Blaine from the beginning. No matter what she was going through, he was going to be there for her. He wasn’t letting go. \nThis is truly one of the most beautiful love stories, but it’s not always a happy story. It’s got a lot of dark parts. Kami’s past is ugly. It broke her, shattered her. When Kami finally starts to let her walls down, something happens. Someone from her past comes back. I lost it. It made me a nervous wreck- I was fearful for Kami, heartbroken and devastated. This is such an emotional story. From page one, all the way to the end, you will feel. Feel for Kami and her horrific past. Feel for Blaine and everything he’s going through. And oh my God.... Dom and Angel. Dom’s story broke my heart. I just absolutely loved these characters. In the end, Kami realized there is only one real thing to be afraid of:\nI’m not afraid Of monsters and ghostsBut the thought of losing youIs what scares me the most.\nFear of Falling was a real story, about real people with real issues. Kami’s story is gut-wrenching. Kami might seem weak at first. Once you know her story, you will realize just how strong she really is. She has been through so much tragedy, so much pain, she thought there was no way to ever get away from it. No way she would ever be able to conquer her fears.But sometimes, life surprises you. Sometimes, someone can come along and change everything. \nBlaine was my more.\n\u2028Beautiful. Emotional. Powerful. Inspiring. A tale of a girl with a damaged past, who is fearful, suffering and broken. But more importantly, it’s a story about love, overcoming those fears, and hope. There is always hope, and life is always beautiful!"}, {"userName": "Kristin (KC) - Traveling Sister", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/4971692-kristin-kc---traveling-sister", "userReview": "*2.5 Stars*The beginning of this book had me. Its gripping intro proposed an intense storyline filled with a mystery that would surround darker issues. While the dark topics were present, they merely served as a backdrop for an otherwise 'fluffy' story. The inconsistent plot, although somewhat intriguing, unfortunately never seemed to reach its full potential. We're initially introduced to our heroine, Kami, who suffers a crippling anxiety derived from a grotesquely abusive childhood. Her tragic past was revealed through flashbacks, and was painful to witness. She deems herself 'unlovable' and has remained emotionally scarred and unattached for years. Enter Blaine...Blaine was an immediate attraction for me Kami. Sexy, strong, mysterious--and battling demons of his own. I loved their initial flirtatious banter and was excited to see things play out. Blaine was patient, understanding, and just a perfect source of security for Kami. Almost too perfect. This is where the story began to lose me...Kami and Blaine's complex relationship, although extremely sexy, rode an emotional roller coaster for the entirety of this story. While Kami's reluctance to let her guard down was warranted, the scenarios began to play on repeat and completely swallowed up the plot. The ending presented more intensity, but some of it seemed slightly over-the-top. The writing had its moments of brilliance and truly thrived during the reflective narration. The character dialogue was natural and blunt, giving off a slight KA vibe at times. Blaine would randomly and frequently come out with these Confucius-like pep talks—which was both astounding and bewildering.Although this story didn't work for me, I did appreciate and respect its powerful message against domestic abuse and felt that it was handled tactfully, but with vigor.\n\nBook Stats:\n▪\t Genre/Category: Contemporary Romance ▪\t Steam Caliber: Extremely steamy▪ Romance: Complex and shaky. Instant connection.▪\t Characters: Sexy, sweet hero. Broken, abused, and guarded heroine.▪\t Plot: Inconsistent. Emotional love story with darker elements. *Domestic abuse involved*▪ Writing: Natural. Insightful moments. ▪ POV: 1st Person: Alternating Dual Perspectives▪\t Cliffhanger: None"}, {"userName": "Angie - Angie's Dreamy Reads", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/8524618-angie---angie-s-dreamy-reads", "userReview": "This Review is Posted at Angie's Dreamy Reads“A story of a tortured, abused, broken girl but a love strong enough to heal even the most broken of souls.” - Angie’s Dreamy Reads\n“Life happens......Unfortunately, many of us found that out earlier than some. We found out just how awful life could really be. We found out that monsters were, indeed, real. They walked among us. They looked just like you and me. They came in the form of people we loved and trusted the most. The people whose only job was to love and protect us.” - Kami\nIt took me a little while to formulate my thoughts after I finished reading Fear of Falling and this review was extremely hard to write. There was something about Kami's story that resonated with me deeply. Her fears. Her thoughts. Just honestly her! She was the reason that I loved this book. Sitting back and thinking about it I'd describe this book as a hurricane. It hits you hard and floods each and everyone of your five sense, causing a raging storm within your mind and body. You want to escape the hurt, the pain, the angst, but you can't! You're trapped, being whipped around in the wind, thunder and torrential rain that is Kami and Blaine's relationship. These two beautifully broken people are destined, like the stars in the sky, to be each others safe house, each others escapes. Through the ebbs and flows of their rocky relationship you see glimmers of light within Kami and Blaine's tortured pasts. The sky clearing one cloud at a time. Hope glistening like raindrops on the tips of a flower petal. These people need each other. They need each other like you and I need our next breath to live and in that need, that desperation, that longing Kami finds healing and I think Blaine does too. Is it a pretty story? No. Is it easy? No. But sometimes in life there's nothing pretty or easy. Kami has suffered through the worst and most unimaginable forms of abuse and Blaine has been through his share of trauma too. Healing when you’ve been broken, battered and abused is not easy. Fear can be gripping and that...THAT is the point of the book. You can choose to be whole, healthy and happy. No matter what’s happened to you, you can make a choice to not allow the evil, horrible life experiences you’ve had have power over you. You can choose life and to live. You are worth that choice. You are worth every moment of happiness and bliss. You can find love, live life and be whole. NO ONE should ever take that away from you. I would absolutely recommend Fear of Falling. Abuse is not pretty but I think S.L. Jennings does a beautiful job of laying it out there for us. She paints that picture and our hearts bleed for these characters. A definite MUST READ! What is Fear of Falling about?I can’t remember the last time I felt completely safe. Security seemed more like a luxury to me, reserved for those who were fortunate enough to have picture perfect childhoods. For those who didn’t bear the ugly scars that keep me bound in constant, debilitating fear. I’ve run from that fear my entire life. But when I met him, for once, I couldn’t run anymore.He scared the hell out of me in a way that excited every fiber of my being. It wasn’t the tattoos or the piercings. It wasn’t the warmth that seemed to radiate from his frame and blanket me whenever he was near. It was just…him. The scary beautiful man that threatened to alter 23 years of routine and rituals, and make me face my crippling fear.My name is Kami and I am constantly afraid. And the thing that scares me the most is the very thing I want.“Don’t worry,” he smiled, pulling me into the hard warmth of his chest. “I’ve got you. I’ll always catch you when you fall.”And just like that, Blaine had staked his claim on the untouched part of me that no living soul had ever moved. He had captured every fear, every reservation, and crushed them in the palm of his inked hand.I wanted to talk a little about Kami. I never suffer from “whiny girl complex” when reading! I really don’t! The girl could be needy, broken and completely frustrating but I always try to look deeper and explore what this girls been through and why she’s doing the things she’s doing. With Kami her layers of self loathing go deep. This sweet girl has never know an ounce of love. NOT.ONE.SINGLE.OUNCE. She has lived her life in a cocoon of torture. Can you imagine what that would be like? To see the unimaginable? To have the unthinkable done to YOU? Can you imagine seeing these things from the time you were a little girl and knew NOTHING better? These things are INGRAINED into your psyche. They are what form and mold your mind and thoughts. Kami was molded by nothing but complete fear and hatred. All she knows is torture and pain. So when Blaine comes around she can't just give into him. She can’t just release all of her pain like he.s the answer to her prayers, some kind of God saving her. NO! It’s taken YEARS to get to the messed up place she’s at and it will take YEARS to move past that. This girl is BROKEN, TORTURED, DESTROYED. She is beautiful in spirit but mentally she is an absolute mess. So let me tell you prepare yourself for a girl that doesn’t just give into the guy right away. She puts up a fight. A damn good one. She’s scared and when fears the only thing you’ve ever know it’s not just a quick thing to let go of. You have to work your way through that and Kami had a TON of stuff she had to work through. \n\" The scariest part about love isn't love itself. It's letting go and plunging into the unknown. It's trusting someone with the very most sacred part of your heart. It's allowing yourself to feel something foreign and uncharted, despite how much it terrifies the hell out of you\" - Kami\nBlaine.....I think Blaine was amazing. There were moments in this book were I actually got a little pissed at him but unfortunately I can’t put that in this review because I’d consider it a spoiler. Blaine has his own set of problems. Ones that make him feel like crap and have mentally scarred him as well but the difference between Kami and Blaine, is that Blaine, chooses to live and not let it hold him down. Now, he hasn’t been through what Kami’s been through so it’s easier for him to make that choice, IMO, but to me he represents life and hope for Kami. God...does he love her! He nurtures her and really wants to understand her. Kami is far from easy to deal with and I think that Blaine really gets that. He knows just what she needs and he tries to be everything he can for her. You see him struggle with the need to take her pain away. It's a need that saturates his soul and takes over his body. He wants to make her smile. He wants to heal her. And it's hard for Blaine to consistently be pushed away. Sometimes you can't save someone that doesn't want to be saved. You can't help someone that doesn't want to be helped. Sigh.....Blaine really hangs in there. He truly does. His love for this girl is FIERCE and If I had to describe him in one word it would be AMAZING. \n\"Kami, when you know, you know. And you don't fight it. You don't deny the inevitable. You free fall because you know there's someone there to catch you on the other side.\" .....\"You don't have to be afraid of falling. Just close your eyes, let go, and know that I'll always be here with arms outstretched, ready to catch you.\" - Blaine\nOverall I think you'll love this book. Kami and Blaine are incredible and S.L. Jennings writing is fantastic. Not only are Blaine and Kami fabulous but the supporting characters are pretty awesome as well. I would highly encourage you to take the leap. Try this book. There is a story here that's going to leave you thinking for hours. No matter what life hands you HANG ON, FIGHT and know without a shadow of a doubt that you are worth so much. You can have a good life just DON'T GIVE UP! My rating is 5 stars."}, {"userName": "DKristin", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/6655835-dkristin", "userReview": "Fear of Falling is essentially a love story, it is also a life story. It's a dichotomy of how people can be so resilient and adaptive that they can move forward after the worst atrocities but also be so fearful of the path that life has taken them down that they cannot believe that a HEA is in the cards for them...\nKami\n\nKami has lived a life of fear, of pain, abuse, and it has left her with the belief that she is unlovable. Unable to give or receive love... \n\nBut when she meets Blaine something shifts. She starts to want things that she never has before. But is she strong enough, is she good enough for love...  \n\nBlaine\n\nBlaine has his own past filled with pain... but he is drawn to Kami. He wants nothing but the best for this woman who has walked into his life and blindsided him. He doesn't know how to help her especially when she keeps shutting him out... \nBut even when he tries to let her go, he just can't walk away. He wants to be strong enough to save her, he wants to be good enough for her to trust him, but will his own past stand in the way... \nLove is always complicated, never easy, and always worth the fight. Will love and the promise of what it can bring into their lives be enough for Blaine and Kami? LOVE \n TRUST \n FEAR \n HOPE \nFear of Falling is a beautiful story about love, trust, fear, and the hope for more than just surviving life. \n***ARC provided by author in exchange for me to: \"promise to keep the funny ass GIFs coming! ;)\"*** IT'S LIVE!!!!!!!!!!!!! http://amzn.com/B00DYVX8TM Warning: While the events in this book may be fictitious the themes of abuse, mental illness, and the lasting effects of trauma are very well written."}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "FREE on Amazon US today (1/17/2016)Stand-alone book 1.BLURB:I can’t remember the last time I felt completely safe. Security seemed more like a luxury to me, reserved for those who were fortunate enough to have picture perfect childhoods. For those who didn’t bear the ugly scars that keep me bound in constant, debilitating fear. I’ve run from that fear my entire life. But when I met him, for once, I couldn’t run anymore.He scared the hell out of me in a way that excited every fiber of my being. It wasn’t the tattoos or the piercings. It wasn’t the warmth that seemed to radiate from his frame and blanket me whenever he was near. It was just…him. The scary beautiful man that threatened to alter 23 years of routine and rituals, and make me face my crippling fear.My name is Kami and I am constantly afraid. And the thing that scares me the most is the very thing I want.“Don’t worry,” he smiled, pulling me into the hard warmth of his chest. “I’ve got you. I’ll always catch you when you fall.”And just like that, Blaine had staked his claim on the untouched part of me that no living soul had ever moved. He had captured every fear, every reservation, and crushed them in the palm of his inked hand.http://www.amazon.com/Fear-Falling-S-... FREEBIES are often good for MORE than one day, I have gathered all my FREEBIES on a special shelf: Kindle-freebies (currently over 500 books)https://www.goodreads.com/review/list..."}, {"userName": "Rag", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/25192009-rag", "userReview": "[ that it was getting dragged. She should've told him sooner that she loved him (hide spoiler)]"}, {"userName": "Elizabeth (Liz)", "userReviewDate": "May 11, 2013", "userURL": "http://www.goodreads.com/user/show/5495317-elizabeth-liz", "userReview": "Wow.  Wow, wow, wow.  I don’t know where to start with this one, honestly.  Fear of Falling is just one of those stories that makes it difficult to put my experience into words, and the reason for that is because I experienced so much!  Every feeling, every emotion, every reaction was in play while reading this book!!   Here was my initial reaction, via Goodreads, immediately after finishing Fear of Falling: Review To Come.....but, really? This doesn't even need my lame attempt at a review. July 18th is your friend, folks. Buy the book, grab your Kleenex, your favorite box of wine, then put on the 'DO NOT DISTURB ME' Face of Doom and lose yourself in this one! Tears and a wonderfully surprising amount of laughter + THE BEST epilogue = Perfection.  I still stand by this statement, and I really don’t believe the book needs my poor attempt at a review…but, I’ll do my best to expand on my initial thoughts just a bit. Kamilla (Kami) Duvall was truly the center of this story and for very good reason.  The last thing I want to do is give too much away.  I actually want to give very little of the story away because I strongly feel the reader needs to experience everything without knowing the entire storyline beforehand.  What I will say is that Kami was probably one of the most damaged and fearful young women I’ve read about in a long time.  At times, it was almost easy to forget that fact because she hid quite well behind a near-impenetrable wall, a mask, of normalcy, flirtatiousness, precociousness and lively humor.  She and her two roommates and best friends, Angel and Dom—Angel, a lesbian rocker, and Dom, a slutty man-ho, both with terrible pasts of their own, as well as huge, caring hearts—were all, essentially, alone in the world, and they became a support system for one another.  There were even moments where I wondered if the three weren’t far too co-dependent and allowed some enabling to go on.  But, even then, I couldn’t possibly find a way to fault them for surviving in the best way they knew how, given their individual histories.  Kami did not—as in, not ever—allow men to get close.  Sex was one thing, intimacy was a whole other ballgame…one she adamantly refused to play.  Well, never say never.  Enter, Blaine… Oh. My. Word.  Blaine.  He was tatted, pierced, built like a you-know-what, had his own very sad past and owned a bar named Dive.  Ummm…yeah.  S.L. Jennings had me at that very moment.  ROARRR!  Blaine was a hot, sexy man-beast, and I wanted to just rub up against him and purrrr.  The very best part, though—and I mean the very best—is the fact that he was such a genuinely decent, good…good, good, good…man.  Gah!  What I wouldn’t do for a man like that!!  Patient, understanding, kind, sexy (hey, how did that sneak in there again?!), loving.  I feel I can’t adequately express just how unbelievably patient, understanding, kind and loving this man was.  God knows Kami was justified based on her horrific past, but wow.  He put up with a lot from her, and I never recall him getting frustrated or angry or pushing her in any way.  All he wanted, the only thing he wanted, was to love and support her.  He was a beautiful, beautiful man, and calling him that in no way detracts from how…manly and sexy this dude was.  I want a Blaine.  Someone find me a Blaine!!! Blaine and Kami, together, had a combustible chemistry from the moment they clapped eyes on one another!  Mercy, these two were sexy!!  The tension kept ratcheting up between them, and I was waiting and waiting for the explosion.  So.  Worth.  It.  Even aside from their sexual relationship, simply watching the two of them grow together, learn about one another, build a tentative relationship…it was so lovely.  Their moments together were never wasted, and each built perfectly toward the conclusion.   One thing I have to mention, which I honestly wasn’t expecting, is the amount of laughing I did while reading Fear of Falling, and I loved it!  Kami, Angel and Dom know each other so well, and they have this ridiculously funny, crude sense of humor that unites the three of them.  I so love when an author can successfully combine pain and humor in the same story.  As I’ve said before, it makes perfect sense as we often use humor to cover pain, and, as human beings, we also aren’t ever feeling only one emotion.  S.L. Jennings did this really well, and, in doing so, it helped to balance out the heavy weight this story would have been buried under without it.   Now.  This has to be said, as well.  There are heavy, serious subjects in Fear of Falling.  Each of the characters has experienced such pain in his or her past, and it helped to shape who they became.  However, as with anyone who has suffered a traumatic experience, that experience does not define that individual.  Or, it shouldn’t.  In my opinion, Kami was allowing her past to define her, and in order to be able to move forward, she had to find a way to let that go.  God knows, this was not made easy for her, particularly as there was unfinished business from her past.  I’m pretty sure I held my breath for most of the last 15% or so of this book, in between sobs.  That last 15% is a doozy.  I was terrified, furious, heartbroken and sick to my stomach.  Then came the last several pages and the epilogue… That epilogue had me so joyous I was grinning from ear to ear, even while I cried and cried and cried.  I adore a good epilogue!  Well, this wasn’t a good epilogue.  This was a fan-freaking-tastic epilogue, and I’ve re-read it multiple times already!!  I plan to read it a dozen times more, as well!  It was everything I needed to see between Blaine and Kami, and it was crafted flawlessly by S.L. Jennings. See?  I was right.  This was all that really needed to be said: This doesn't even need my lame attempt at a review. July 18th is your friend, folks. Buy the book, grab your Kleenex, your favorite box of wine, then put on the 'DO NOT DISTURB ME' Face of Doom and lose yourself in this one! Tears and a wonderfully surprising amount of laughter + THE BEST epilogue = Perfection.   5 Stars*ARC provided by the author*For more reviews, please visit Sinfully Sexy Book Reviews or visit us on Facebook."}, {"userName": "Claire Contreras", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/10054133-claire-contreras", "userReview": "I want to start off by saying that I hold this story very close to my heart. It's a story that many of us can call our own. It's one that tells things that we are afraid to voice because if we do it'll become  real . It's a story about pain, suffering, abuse, and trying to break the vicious circle that we find ourselves reliving, retelling through our own lives. It's a story about hope. Kami is my hope. Blaine is my hope. Dom is my hope. Angel is my hope. They are my hope because like them, i am broken and like me, they cope.  \"I feared death when all along I should have feared life\" That sentence is Kami in a nutshell.  \"Life may not be pretty, but it's always beautiful.\" That's just a little tiny sliver of the hope Blaine gives <3.  \"Life happens. This is life, Blaine. And I don't care what you say. That shit isn't always beautiful. It's ugly. And hurtful. And abusive.\"  Thank you, SL Jennings, for giving us a beautifully written and amazing read. Thank you for stepping out of your comfort zone and delivering this beautiful story. Thank you for leaving your heart in those pages and letting us experience pain, love, friendship, and family. And thank you for giving us hope."}, {"userName": "Patrycja", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/6852653-patrycja", "userReview": "I was provided with an advanced electronic copy of this book from the author in return for an honest review. This review will be also posted on Smokin’ Hot Book Blog on 18th July.„I got you, baby. I got you, and I’m not letting go. You’re safe. I’m never letting you go, Kami.”Fear of Falling is enchanting, seat gripping novel that is unquestionably stunning and heart breaking. Once again I was blown away by SL Jennings and her undeniably fierce style of writing and outstanding story that is like no other I have ever read. I feel like every piece of my heart was torn from my breast and stumped on only to be sewn together afterwards. It’s like the last long gone puzzle who finds it right place. There is nothing better in reading that being enchanted and mesmerized by a story which becomes so close to you and your heart that you feel it pulsating in your veins. Loving equally the idea, characters and writing is a miracle and the best gift reader can ever receive. I can honestly say that I was honored to read and review fabulous, spectacular novel that will captivate hearts of Goodreads users and will rock their world.Fear of Falling is story about broken woman who’s trying to survive. Long ago she gave up on wishing and wanting normal life filled with love and happiness, now she only tries to put one foot in the front of the other and not to crumble. She’s scared of everything. For her hope is gone and love is the greatest enemy.  This. Is. Me. My situation isn’t fucked up. I’m fucked up. Completely, irrevocably, fucked up to my core”. But what Kami doesn’t know is the fact that despite her efforts to avoid commitment love will always find her. Now fighting with her gruesome past and instant attraction to hot as fuck bartender she’s spiraling down the road she did not want to go. Blaine Jacobs is tattooed and pierced man who attempts to get his shit together and live. But when he shares a sensual body shot with Kami he can’t stop thinking about that sexy woman who have alternated him in a strange way. Now he has a new aim – he wants to make her his.  “I never give up on things I want. This… you and me… it’s inevitable. There’s no use in fighting, Kami. It’s going to happen. And when you are madly in love with me, the only thing you’ll regert is not falling for me sooner.”I loved how Kami and Blaine’s relationship progressed. It is raw, painful and full of distrust, but with time is slowly alternating in something beautiful but still very fragile. Sexual tension between the two of them is always present and mind blowing. I adored every steamy scene.This novel opened up me in new ways. I enjoyed it immensely. This romance story spell bounded me like no other ever has. Fear of Falling is pure perfection which blends nicely sensual eroticism, heartbreaking love story with psychological portrait of damaged and abused young woman."}, {"userName": "Kelli C ~ Jack Sawyer's Heart", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/14931216-kelli-c-jack-sawyer-s-heart", "userReview": "4.25 Stars! ..just remember, the storm doesn't last forever. It can scare you; it can shake you to your core. But it never lasts. The rain subsides, the thunder dies, and the winds calm to a soft whisper. And that moment after the storm clouds pass, when all is silent and still, you find peace. Quiet, gentle peace.”Oh but what a storm Kami has to endure to find that gentle peace. This one of those stories where not much is beautiful. It is broken from the first words read and while the fragments may get put back together, the cracks are permanent.Fear of Falling is such a perfect title for this read, even the love story that develops. Kami is beautiful woman who basically exists in body but lacks true soul. She has endured the most ugly of abuses and her life is dominated by FEAR. Whether irrational or not, she is consumed with the dark and lives in a world where LOVE is not able to be given or received.It was completely unexpected that a tattoo'd/pierced mountain of a man with hooded lust in his eyes would be the catch in Kami's life when she finally fell. Blaine is everything good about a book boyfriend. He is the epitome of goodness for Kami and her world of barren emotion. “You can't expect to save someone that doesn't want to be saved.”This read was so emotionally awesome. The feels were everywhere from overwhelming sadness and dread to beautifully open hope found in the arms of a man who is not only a giver, but a taker. That is not a bad taking...it is Blaine holding onto a woman he sees and wants and taking her fears and making them his own.I got you, baby. I got you, and I’m not letting go. You’re safe. I’m never letting you go, Kami.The journey is not smooth. The relationship is not easy. Kami and Blaine are captivating enough but with Dom and Angel, key supporting characters, the story is even more riveting. If you are a lover of angst and not afraid to wade through the darkness to find that beauty can come from pain, then this read will blow you away. Look past the horror and the staggering abuse and see what it is about...the promise of better!"}, {"userName": "Bookhooking (Tanya Childress)", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/4940504-bookhooking-tanya-childress", "userReview": "Wow, S L Jennings has left me utterly speechless with this one! I don't care if you can only rate a book five stars. I personally give Fear of Falling 10 Big, Bright, Beautiful Blaine Jacobs Firefly Stars!!I fell in love with him, hook, line and sinker. I fell in love with this story in it's entirety, the characters, the emotional parts, the devastating parts, all of it and yes, I cried like a damn baby for the last 20% of it. Should this scare you? Hell Fucking No, unless you don't have a passion to feel and read!! It was worth every single, emotional, tear that slid down my face, every breath I held and every gasp I made for Kami and Blaine!I won't give spoilers in my review, as I never do, but if you have a hard time reading about abuse whether it be physical or otherwise then take caution when buying/reading Fear of Falling. As we all know, this is a very tough subject but at the same time a very, very real one and unfortunately happens more often than we care to think about.Ms. Jennings did a phenomenal job writing this story and per chatting with her, she took a chance writing it. I am sure some may not like it or parts of it but to each their own. I have said it once and I will never tire of saying it. I fucking loved it! It is emotional, heart wrenching, beautiful, exceptional, sad, realistic, gripping, breath taking, overwhelming, okay that is about all the adjectives I can think of right now lol so I will move on to the story.Kami is a beautiful, broken 23 year old woman who suffered immensely, as a child, at the hands of her father, literally speaking, as well as emotionally. Her mother suffered as well but in turn didn't do anything to help her daughter or their situation! Can you imagine? The two most important people in your life, that are supposed to care, love and nurture you, don't!Naturally Kami aka (Kam) believes she is fucked up, broken, unlovable, crazy and has more issues and baggage than any one person can handle. She struggles every single fucking day and I wanted to wrap my arms around her, kill her father and scream at her mother!!I feared death when all along I should have feared lifeWhy couldn't I be normal for on damn dayThese were her thoughts daily.We soon meet Kami's two wonderful roommates, Dom, who is also a victim of abuse and Angel, a woman who was paid by her own family to stay away because they could not accept her choices in life nor her lifestyle. These three are their own family and while it may be weird to others, the way that they treat one another, it is how they cope with every day life and more importantly are there for one another until of course, Kami encounters Blaine.With a look that screams bad boy, but we all know looks can be deceiving, and underneath his gorgeous body and awesome tattoos is a man I think we would all love and want in our lives. Blaine is sexy, funny sweet, romantic and has a heart of pure fucking GOLD!!They first meet in a bar where Blaine is a bartender and their heated encounter sets Kami's world on fire and afterwards, her thoughts of him, never-ending.My body's response to his scared the living daylights out of meHe had the eyes of a man that had seen things. Eyes that were soulful and wise yet vibrant and sultry. Eyes that made me want to run away, yet urged me to stay.A few weeks later, Kami soon finds herself returning to that very same bar in need of a job and from there on more sparks fly and try as they might to keep a working relationship strictly that, the resistance is soon broken and they take things further. They both find themselves enjoying everything about one another. The only problem, the way Kami feels and thinks. While none of what has happened to her in her past, her fault, she believes everything she shouldn't.There were no flowers and hearts in my world. I didn't even know they existedDom and Angel are there for her and she feels closest to them. Dom was awesome, especially considering what he has been through as well. He talks to her, comforts her and basically knows what to say.\"Your fears are not you. Do you hear me? They don't define who you are.\"We can't let them win. If we let them control us now after we've come so far, what else would we have left?\"Kami is scared for different reason, although she feels safe with Blaine and she isn't afraid of him.Blaine soon learns about some of Kami's fears and demons but that doesn't stop this beautiful man, who has been through some things in his life as well, from falling in love with her, wanting to be with her, take care of her, protect her.\"Don't worry,\" he smiled, pulling me into the hard warmth of his chest. I've got you. I'll always catch you when you fall.\" sssssssssswwwwwwwwwwoooooooooonnnnnnnnnnHe was so understanding and quite frankly I have NOTHING bad to say about him, his actions or his character! Kami tried to be honest with him, tell him all of the things she thought about herself, that she didn't do relationships, she wasn't lovable all that heartbreaking stuff that she so sadly believed, in her mind that is! But did she truly believe it in her heart?\"I know you said you don't feel anything,\" he whispered. \"But can you honestly say that you don't feel this? That this heat, this attraction is all in my head? Don't think about it; just answer. tell me what your heart wants to say and not what your head keeps trying to make you believe.\"Do you want me, baby? Tell me you want me. Tell me you feel this too.\"ummm I'll answer HELL FUCKING YEAH!Needless to say you can't deny what's in your heart but with everything that Kami has been through, the constant fear she lives with daily, no happily ever afters, only pain and sorrow and the ugliness she has seen in love. Will all of this continue to haunt her everyday for the rest of her life and push her away from what she needs and wants? Will she be able to hang on to what she feels with and for Blaine? Will he be able to handle all of this and all of her demons? Will she push Blaine away?So many questions but all of those will be answered when you buy this wonderful book on July 18th and devour every single word like I did. If you don't like it for whatever reason I have to be honest with you and say OH MY GOD WHY NOT? because this is in my top reads for this year.Don't even second guess buying this book!! I loved every single emotional, gut wrenching, wonderful, deep, dark, intense and memorable minute of it!!S L Jennings, you rock my dear woman!! Beautiful fucking story!! I am utterly speechless even after this lengthy review ,yet ironically, I could rave and write about it all day long. I could share so many quotes from the story but I WANT YOU TO READ IT FOR YOURSELVES!!I was provided an ARC from the author in exchange for an honest review."}, {"userName": "Maja", "userReviewDate": "May 12, 2013", "userURL": "http://www.goodreads.com/user/show/13801974-maja", "userReview": "5 Emotional ~ Beautiful ~ Heartbreaking Stars!♥♥♥♥♥ ♥♥♥♥♥ ♥♥♥♥♥ ♥♥♥♥♥ ♥♥♥♥♥\n“You don't have to be afraid of falling. Just close your eyes, let go, and know that I'll always be here with arms outstretched, ready to catch you.” \n ~ Blaine\n∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞This was a very emotional read. A heart touching story of Kami, a scarred and broken girl who was abused as a child. She had an abusive father and a mother, who was also scarred and did nothing to protect her. She was scarred of everything, lost, confused, fragile. Kami lived in constant fear.\n“Funny thing about life is that it never turns out the way you want it to.”\nShe didn't belive in love. She was afraid of love. Kami thought that love was bad, cruel and painful.She had amazing best friends and roommates, Dom and Angel. They were also broken people with family issues. Kami, Dom and Angel were always together. They understood and protected each other. They were together, safe.\n∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞Blaine Jacobs ~ was a beautiful, hot, smart, tattooed guy. On the outside he was a sweet, sexy, young man, but actually he struggled with his own demons. He blamed himself for his mother's suicide. He lived with guilt and pain.\n“Your fears are not you. Do you hear me? They don't define who you are.”\nBlaine adored Kami. He loved her smile, how beautiful and smart she is. He saw the pain in her eyes, and he wanted to fix her, to protect her from her own demons. \nKami and Blaine were adorable together. A very cute couple with a great chemistry. They had some bad moments, It was a very difficult to build a relationship between two emotionally broken people. \n“Love. It was the thing that bound us and tore us apart. It was our disease and the remedy of our shattered hearts. It was a sonofabitch.”\n\n∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞Blain saved Kami from her own demons, and showed her that love and life can be beautiful. She was finally safe. Love!♥♥♥♥♥\n“[...] just remember, the storm doesn't last forever. It can scare you; it can shake you to your core. But it never lasts. The rain subsides, the thunder dies, and the winds calm to a soft whisper. And that moment after the storm clouds pass, when all is silent and still, you find peace. Quiet, gentle peace.”\n\n∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞ ∞"}, {"userName": "Catarina", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/11538033-catarina", "userReview": "4.5 Origami Stars!When I started reading this book I confess I wasn’t expecting liking it so much. I assumed it was just another NA book, with a similar line story. Boy was I wrong! Well, this is I fact a NA book with a slightly similar line story, but the way its told, turn this in one great book that you will not be capable to stop reading. \t “Funny thing about life is that it never turns out the way you want it to.”Fear.Fear is everything Kami known all his life. Being abused for year after year without anyone to protect her she soon learned that monsters are real and life’s a bitch. Not everyone has happy endings. Some people just learn to survive and live knowing that their monster will never go away. So when she meets Blaine, she became even more scared than usual. Because for the first time in her life she feels safe and she knows that he will run away soon he finds out how broken she is. And there is also the thing about wanting something, liking something: when it’s taken from you the fall is hard. And she already had enough falls in her life. But Blaine has demons of his demons and it’s not willing to give up on Kami. He knows that he have to saver and expurgate her demons. Even if it is the last thing he ever does. After all, you don’t turn your back on those who mean something to you. This was a beautiful story. Kami’s and Blaine’s love is something amazing to see. Sometimes in your life will appear someone that will turn it upside-down and you know that nothing will ever be the same. This book is wonderfully written and you will not be able to drop it for a second. If you like book with strong protagonists, great supportive characters, romance, steam and some angst, than this is definitely for you."}, {"userName": "Paula ", "userReviewDate": "May 11, 2013", "userURL": "http://www.goodreads.com/user/show/2879703-paula", "userReview": "“Life happens......Unfortunately, many of us found that out earlier than some. We found out just how awful life could really be. We found out that monsters were, indeed, real. They walked among us. They looked just like you and me. They came in the form of people we loved and trusted the most. The people whose only job was to love and protect us.”\n - Kami Imagine being physically and sexually abused by the one person in your life that is supposed to give you love, happiness, and protection. It's gut-wrenching to know that any little girl would experience this kind of pain. That was Kami Duvall's reality as a child. She lived in fear of her father, who is a monster, until she was seven years old. He's a drug addict, alcoholic, mentally sick man who beat and tortured his wife and child. They eventually escaped and ran away but Kami never truly ran from the demons in her past. What her father did to her scarred her emotionally and broke her mentally. Being inside Kami's heads was heart-wrenching and almost maddening. She fears life. She fears love. She fears everything. She doesn't know what to do with the fear that consumes her. She can't let go of the past that has come to define who she is. The only people she trusts are her two best friends, Dominic and Angel, who are just as broken as she is. They're a dysfunctional family together. They're all she has until the day she meets Blaine.The moment Blaine and Kami meet, something inside her shifts and changes. She feels an electrifying, magnetic pull to Blaine. No man has ever made her feel that much. She fights what she feels towards Blaine but, no matter how hard she fights the attraction, she finds herself spiraling down a path that leads to love and commitment. Is she strong enough to love him? Will she let him love her? Or will she let the fear that consumes her cause her to push him away?This book is emotionally heavy and exhausting. Phew. It took me a while to come out of my own head when I finished it. I instantly fell in love with Kami and Blaine's story from the moment Kami walked into Blaine's bar, Dive, where she eventually gets a job as a bartender. As they work side by side, the attraction between them grows more intense. It's up to Kami to let herself be free from her pain and worries and give in to Blaine, who wants her. Bad. But even with the 'meant-to-be together' chemistry they have, I knew their story would be a bumpy road. And it sure as hell was.\n\"Don't worry,\" he smiled, pulling me into the hard warmth of his chest. \"I've got you. I'll always catch you when you fall.\"\n -BlaineI think you will fall in love with Blaine immediately like I did. He is incredibly patient, sweet, charming, and oh, so very sexy with his tattoos and piercing. Yum. The best part about him is that he is genuinely a really good guy. He treated Kami with the utmost respect. He took his time with her and never rushed her into anything. His sensual whispers and touches made my heart flitter. But even with all his sexy flirting, he knew Kami needed to be treated with care. So he took his time and was extremely understanding of Kami and all of her flaws, especially when they started to rear their ugly head with her mental breakdowns. He never freaked out and ran. He stayed. He wanted her. Scars and all. I give the man credit for putting up with Kami the way he did. She is not an easy person to handle. She would push him away and he would keep coming back. I'm not sure many guys would be that resilient to Kami's wishy-washiness and freak out moments. But, like I said, he's patient and kind.Both Kami and Blaine have broken pasts that cripple them emotionally. Blaine knows all about pain and suffering when he lost his mother at a young age. He knows that in order to gain Kami's trust and to get her to open up to him, he needs to tell her about his past. It's hard for him to open up to her but when she consoles him and listens to him, it's like a salve to his heart. And by him opening up to Kami, she starts to slowly open up to him as well. These two need each other. They need each other to heal. They need each other like they both need air to breathe - which is why I thought this love story was so beautiful. I really love how the relationship builds slowly. The sexual tension between these two kept ratcheting up more and more as the story progresses. I love how they become friends first. Blaine wanted Kami to trust him and he makes sure she does before they take that inevitable step into the bedroom. And when it was time for them to give into that kind of intimacy, it was definitely hot. So worth the wait. This is a heartbreaking doozy of a story about a young woman who has been psychologically damaged and abused. Such a horrid topic that needs to be addressed more often. Miz Jennings does not gloss over the horrific events that happen to Kami. And prepare yourself to lose your breath in the last 15% of the story. I definitely recommend this story to anyone who enjoys reading real-life, unforgettable love stories that will evoke a massive amount of emotions from your heart.P.S. There is angst. Lots of lots of angst is in this story. I just thought the reader should know. P.P.S. Grab the tissues too. Rating: B+Heat: Hot-- A Romantic Book Affairs Review\nFind us on Twitter and Facebook too!"}, {"userName": "Pam Godwin", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/10980625-pam-godwin", "userReview": "The villain in this story is a psychological condition. You can't take it down with a hollow-point bullet. You can't pass a sword through its deeply-guarded heart. It lurks in the shape of 253 stars. Kami's 253 fears.How does she fight fear when she's erected her entire life around it? Normally, I'd balk at heroine who is crippled by nothing more than herself, and scream at her to power through it. But Kami's fear is so palpable and vetted, to behave with an iron spine and swinging fists would've belied her character. Jennings is so convincing in the characterization of this poor girl, I was a glutton to experience every detail of her miserable psyche.Blaine is the catharsis in this harrowing tale of persistence and triumph. Victims of abuse lick their wounds in a myriad of ways, but the one honest salve is a sturdy shoulder to brace you through the mending. That person or persons, who accepts without question, who lends support from a distance when distance and patience is what is needed. The Avett Brothers' Perfect Space captures the essence of Kami's relationship with Blaine and her roommates:I wanna have friends that I can trust,that love me for the man I've become not the man I was.I wanna have friends that will let me beall alone when being alone is all that I need.The story is executed delicately, yet with a deep-welled power. The writing is seamless. While it's often emotionally frustrating, the best books always are. I highly recommend."}, {"userName": "Lisa", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/13978199-lisa", "userReview": "*ARC Given to Blog for Honest Review*5 “Roadrunner” “254 stars” “semi-creeper”  KissesOMG Wow…where do I begin with a book like Fear of Falling…It. Blew. My. MIND. Loved it. Beginning to end and everything in-between. Loved the characters, the story line, the flow – the sexual tension, the wit, the humor, the connections between the characters. I could go on and on and on cause guess what? I really can’t tell you what I didn’t like about this book. *breathe* So now…I will continue to babble about what I loved.Kamilla Duvall…Kami Kami Kami…oh my sweet, broken, damaged Kami. So much hurt and fear, hidden so well. Almost. She’s a gorgeous, exotic beauty and she broke me down. I shed so many tears for her. I understood her pain but all I could do was hope she would survive it. She doesn’t have a family. The closest thing she has to a family are her two best friends and roommates, Angel Cassidy and Dominic (Dom) Trevino. Angel is a burst of energy and sunshine to help see Kami thru her darkest days, while Dom understands her pain better than anyone ever will. I truly enjoyed their friendship – it’s unique and special. “You can do this,” I whispered to the reflection staring back at me. “It’s ok. You’re ok. It had to be done. You have to keep going. You can do this, Kami Duvall. You will not break. Not today.” Blaine Daniel Jacobs is a pleasant surprise. Perfection wrapped in an unexpected package. What’s there to love about Blaine? He’s got tattoo’s. Do I need to keep going? He’s tall. He’s got chocolate brown eyes, a boyish grin and according to Kami, a great head of hair. Plus his name alone…once again, Kami his the nail on the head -  ‘Blaine.God, why couldn’t he have been named something less sexy? Like Mortimer? Or Buford? Because for a name like Blaine to be attached to someone as gorgeous as that scary-beautiful man was downright cruel.’ So effing true…great name. From the outside you would never imagine what he is truly capable of. I fell for Blaine instantly and spent every click of my kindle begging Kami to see what I already knew was there.  ‘It wasn’t Blaine’s physical adornments that scared me. It wasn’t even his intense chocolate brown gaze that made me forget to breathe. It was him. All of him. My body’s response to his scared the living daylights out of me.’ So first of all, this book gave me one of the best first chapters I’ve ever read. In my life. Ever. Hands down. If I hadn’t already been dying to read this book before I read that chapter, then those pages sold me. Specifically the part involving shots. A-M-A-Z-I-N-G. That is all. You will know what I mean when you read it. *shivers* It's that memorable. And thus began my devouring of Kami and Blaine’s story. ‘For the first time in twenty-three years, I felt something. Something other than trepidation when a man touched me. Something more than the sick feeling in the pit of my stomach when I had to shatter another heart because I couldn’t let anyone in. Something so much more than the emptiness that filled my chest when I thought about the normal, happy life that I would never have.Blaine was my more.’ So when I say I devoured it, I really did. In one day mind you. I couldn’t put it down. I didn’t want to put it down. And obviously given the fact that I finished it in one day, I physically couldn’t put it down. Their story is just one that begs to be read. You feel their desire and longing to be together, but at the same time I understand Kami’s reasons for holding back. Both Kami and Blaine are just very compelling and believable characters. I was completely engrossed in them…their lives, their feelings, all of it. To me, they were very real. “I’m not looking through you, Kami,” I said only for her ears. I didn’t need an audience; I just needed her to hear me. “I’m looking into you. I’m standing here, wondering how the hell a girl so beautiful could hold so much sadness in her gorgeous green eyes. And I’m asking myself why I want – no – why I need to know what’s made her so sad. And what I can do to take away every ounce of that sadness. I need to know what it will take for you to let me in, so I can do just that.” The book is told from both Kami and Blaine’s POV’s…which surprised me at first. Not because it was confusing, just unexpected. But trust me, it was a pleasant surprise, because Blaine’s mind is a lovely place to be. I loved getting both their thoughts, both their perspectives on different scenes and encounters. Left no room for questioning – I like that. “Don’t worry,” he smiled, pulling me into the hard warmth of his chest. “I’ve got you. I’ll always catch you when you fall.” What else did I like...I liked that I went highlight crazy in this book. Not joking, 20 pages of highlights. Some of them paragraphs because I couldn’t just highlight a few lines, it was all magical, it all had to be highlighted. (Stop looking at me like I’m crazy, I speak the truth!) I liked that this book gave me that feeling in the pit of my stomach. No, I loved that. It’s that feeling that I really only get when I’m reading an angsty book and it’s not giving me what I want. Because I know at the end (hopefully) I will get what I want and that feeling is worth everything. And so much more. Plus that angsty feeling…it builds up adds up for me – of course I loved Blaine and Kami together but that push and pull just makes me crave that HEA more. Speaking of the HEA…oh…my…GOD. I need to try and come up with a better word, but seriously, I L.O.V.E.D. it. So much. Worth it…and then some. Told you, it's always worth it in the end. ‘Blaine. All I could see was Blaine. He was the muse for every song, every painting, every dream. He occupied my deepest, most intimate desires, and hindered my past pains from consuming me with his touch.It had always been Blaine. I just wasn’t ready to see it.’ So…as much as I love Kami and Blaine, their story is complete. They will always stay in my heart, but there isn’t much else to tell IMO. But there is Dom and Angel. And oh boy! Do I want their stories??? Yes…yes I do! Very much so. Especially Dom – I think he’s worse off then Kami was and good Lord that’s sooooo not a good thing. Angel on the other hand would just be a riot. There’s pain there too, but Angel is a blast in a glass and I’m all about her. I cannot recommend Fear of Falling enough, it’s a truly beautiful story about embracing the ability to love."}, {"userName": "Lelyana's Reviews", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/4110853-lelyana-s-reviews", "userReview": "“I’m telling you that I want you to be mine. Because, Kami, I’ve been yours since the first day you walked in here. And I think, on some level, you’ve been mine since then too.”\n\nat 50% of this book was okay, then I came to read the most boring 55-77% of this book. I, then read again from 78-86% and I said, well, this is better. Until then, I came to 87% to the end, and I felt like *numb* and gotten bored again....Don't get me wrong, the first 50% was okay. I really wanted to feel sorry for Kami. But this Kami annoyed me from 40% my reading.Then, Blaine, the supposed to be one helluva cool sexy hunk, suddenly became LAME and act like Tom Cruise when he fall in love. Lame. And \"not like Blaine\"It's like, \"Hey, everybody! Listen! I'm in love with this amazing woman!!\"While I didn't see any amazing thing Kami did to make him that crazy!This image keep ruining my thoughts about both of them.I mean, if she unloveable, how can she accepted Dom and Angel's love.If Kami need broken soul to love, Blaine had enough broken soul to win her love.Why did Blaine's so different?Because he's a man? And what about Dom? He's also a man, right?I just don't buy it.Honestly, I don't think Kami is good enough for Blaine. Blaine deserves better. I'm sorry. It's just, this one was not worked for me.\nBuddy read with Funzee Soiusa"}, {"userName": "L.B.", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/7321682-l-b", "userReview": "No. Words.Okay, that's a lie. I have plenty for this gem of a book. Let me tell you, I was given the HONOR of beta reading this book and I fell in love with Kami and Blaine from the first page. This story is not a gentle love story. Kami is a very broken person dealing with the horrors of her past. Her story is not one to be taken lightly. But S.L. Jennings, just WOW! She has a way with her words, and those words are woven into a truly beautiful tale of learning to heal and letting go of haunting demons to embark on the adventure of learning in love for the first time. I couldn't be more thrilled and proud of Ms. Jennings for stepping outside of her comfort zone as she brings us Fear of Falling. I don't want to give too much away, but I will say this. Kami is broken (I said this already), Blaine is HOT and AMAZING and WONDERFUL and I LOVE HIM, and together they give you a story that will touch deeply your heart. A definite FIVE STARS for me and I can't wait to see if she writes about the other amazing characters in this book. (I'm hoping she will because I am going through withdrawals already!!!!) xoxo LB"}, {"userName": "Michelle ", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/23450274-michelle", "userReview": "Still a Five Star read favorite:))"}, {"userName": "Mallory", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/9179113-mallory", "userReview": "3.5 stars"}, {"userName": "Sharon ∞❥ is an emotional book junkie ❥∞ ", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/3275325-sharon-is-an-emotional-book-junkie", "userReview": "Kindle freebie 1/6/16"}, {"userName": "E.L. Montes", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/13035872-e-l-montes", "userReview": "[image error]"}, {"userName": "Tessamari ♥Many Waters...♥ ~ Sweet Spot Book Blog", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/4597644-tessamari-many-waters-sweet-spot-book-blog", "userReview": "4.75-5 Stars\nThe scariest part about love isn’t love itself. It’s letting go and plunging into the unknown. It’s trusting someone with the very most sacred part of your heart. It’s allowing yourself to feel something foreign and uncharted, despite how much it terrifies the hell out of you.\nIt's been a couple days since I finished this book and I still don’t know what to say. I really don’t. One thing for certain is that I loved this book. This wasn’t easy an read; it’s emotional and I have to warn you, there were times where I had to put it down, take deep breaths, and compose myself before continuing. More than just that, I had to constantly remind myself of the heroine’s mindset, otherwise I would've gone crazy. \nThis. Is. Me. My situation isn’t fucked up. I’m fucked up. Completely, irrevocably, fucked up to my core. \nYep. Meet Kami, our heroine. This is her, in a nutshell. I’ve never met any character so set in her ways that it would take a bulldozer, a truck full of dynamite and a loaded cannon just to put a crack her wall. I’m not going to bullshit you, she will try your patience, but then all I had to do was remind myself that she’s extremely damaged and that alone would calm my twitchy palm. I will not go into any specifics, but just know her past is very traumatic. She does not believe in love. To her love brings nothing but pain and misery. The only people she trusts are her roommates, Dominic and Angel, both damaged in their own right. She has a connection to them in which she doesn’t have with anyone else, until she meets Blaine.\nHim. It was all him. Blaine somehow made me forget me. The me that wasn’t allowed to feel all these beautiful, exciting things. The me that didn’t believe in happy endings. The me that was unlovable, and in turn, could never ever love.Blaine was my more.I had finally found my exception.\nOh Blaine -- sweet, wonderfully sexy, tattooed, pierced in all the right places Blaine. Not only does he make me squirm and my heart beat all tachycardic, but there’s so much more to him. So much, that my review will not be able convey how I feel about our Hero. He never gave up on Kami, no matter how hard she tried to push him away. He stood by her, meltdowns and all, and still remained non-judgmental at her side. I just LOVE HIM. \nWhen you know, you know. And you don’t fight it. You don’t deny the inevitable. You free fall because you know there’s someone there to catch you on the other side. \nThere were a lot of little things that stood out for me that made this such a great read. Kami’s roommates are fantastic and I’m sure I’m not the first one to say this, but both Angel and Dominic need their own books. In addition, the narcissistic side of me loves the fact that the heroine was Asian (hi, fellow Filipino here **raises hand**). But the main and number one reason why I loved this book was because of all the emotion it evoked in me. It was difficult at times, yes, but Kami and Blaine’s story is so worth the read. Ms. Jennings: Bravo, Langaa. Bravo!"}, {"userName": "Keighley", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/3816192-keighley", "userReview": "[image error]"}, {"userName": "Cath", "userReviewDate": "Apr 27, 2013", "userURL": "http://www.goodreads.com/user/show/15280796-cath", "userReview": "To be honest I liked the beginning and middle of the book rather than the end. I just ended up getting a bit naffed off with Kami at the end. But Blaine was lovely. His pov made the book for me really. And I wouldn't mind licking salt from his neck and sucking a lime from his mouth before a shot of tequila! X"}, {"userName": "Christy", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/5782259-christy", "userReview": "Rating: 3.5/5 stars*Warning: This book deals with a lot of themes of abuse (physical, sexual, emotional, and verbal).Good Reads description:“Don’t worry,” he smiled, pulling me into the hard warmth of his chest. “I’ve got you. I’ll always catch you when you fall.”And just like that, Blaine had staked his claim on the untouched part of me that no living soul had ever moved. He had captured every fear, every reservation, and crushed them in the palm of his inked hand.I can’t remember the last time I felt completely safe. Security seemed more like a luxury to me, reserved for those who were fortunate enough to have picture perfect childhoods. For those who didn’t bear the ugly scars that keep me bound in constant, debilitating fear. I’ve run from that fear my entire life. But when I met him, for once, I couldn’t run anymore.He scared the hell out of me in a way that excited every fiber of my being. It wasn’t the tattoos or the piercings. It wasn’t the warmth that seemed to radiate from his frame and blanket me whenever he was near. It was just…him. The scary beautiful man that threatened to alter 23 years of routine and rituals, and make me face my crippling fear.My name is Kami and I am constantly afraid. And the thing that scares me the most is the very thing I want.I received a copy of this book as an ARC (directly from the author, I believe, though I signed up for it through another blog which I can't remember which it was), so I am writing an honest review about it. S.L. Jennings, I think, has a real gift for writing. And in this book, which is apparently inspired by true events, Jennings doesn't hold back when divulging every emotion that was coursing through Kami and the reasons behind the emotions.\"Shit happens. I never really understood that saying. Yeah, there were certain situations in life that were shitty, but they were just that; they were life. So it really wasn't the shit in life that was, well, so shitty. It was life itself.\"At 23 years old, Kami is living with her two best friends, Dominic and Angel, all three of whom share the commonality of having experienced pain, rejection, and abuse from those who were supposed to love them. It is what has bonded them and brought them so close together. They could rely on each other and understood the complications that could go along with victims of abuse, and they didn't judge each other for it. Given Kami's past, she is extremely guarded. She never lets herself get too close. To anyone. After an incident one night, Kami finds herself at this hole-in-the-wall bar, Dive, where she first meets Blaine Jacobs. Working as a bartender, he is immediately intrigued by Kami. Not only for her exotic beauty, but because of the mysterious and tough exterior mask that she wears for the world. Blaine can see right through Kami, and it only makes him want to know her more. Kami notices Blaine as well, with his sandy brown, just-fucked hair, tattoos, and, wait, was that a tongue ring? To Kami, Blaine is scary-- beautifully scary. He's sexy with just a hint of bad-boy, but with the amount of baggage she carries, she might as well just kiss any thoughts of Blaine goodbye right here and now. However, after some playful banter and lime wedge from a tequila shot being the only thing keeping Kami's lips from touching Blaine's, she can hardly ignore the fire, ache, and need that she felt toward him. \"This... you and me... it's inevitable. There's no use in fighting, Kami. It's going to happen. And when you are madly in love with me, the only thing you'll regret is not falling sooner.\"Kami has sworn off love for years. After the trauma of her past, how could she ever trust a man or love? Sure, she could handle physical interactions, but as soon as emotions become too heavy, she shuts down and shuts others out. But Blaine is different. Blaine makes her feel carefree and almost forget the burdens she carries with her everyday. Almost. Can Blaine possibly be the one to save Kami from herself, even if she doesn't want to be saved? Her heart wants one thing, while her head is telling her another.\"You don't have to be afraid of falling. Just close your eyes, let go, and know that I'll always be here with arms outstretched, ready to catch you.\"Ok, now I do not know what events in this book are inspired from true events, nor do I have any idea who these events are about. They could be about S.L. Jennings herself, or possibly a friend or someone else she knows. I really have no idea. The abuse described in the book are truly horrific and sad, and I am so sorry if those are the true events that inspired her to write this book. The thought of any of that happening to anyone is terrible. I, fortunately, have never experienced abuse and I truly don't know anyone who has (that I know of), so I really can't imagine what it must be like to live with a past that is described for Kami. I know that everyone deals with trauma differently, and it is not my place to judge how anyone chooses to cope with something like that. I also don't know how someone who has suffered abuse such as described in this book would handle reading the book. Perhaps it would help those who have suffered from it to connect with the book and its character, or perhaps abuse sufferers would be critical of the book. I know that after reading The Fault in Our Stars (AMAZING book, btw), some readers were upset with John Green for writing a book dealing with cancer when (they think) he has not experienced what it is like. I don't know, all I know is that this book could possibly give hope to someone who has been a victim of any kind of abuse. Moving on. I was initially very intrigued by Kami. She seemed very mysterious and I wasn't sure what her troubled past was. As the details of her abuse started to unfold, I did feel very sorry for her and understood her reservations about getting into a relationship with Blaine (or anyone for that matter). Not only did she fear getting too close to people, but she had other fears that derived from other childhood memories. She is basically afraid of life. She just kind of wants to get by, unnoticed. When she meets Blaine and spends time with him, you can tell immediately that she feels something for him, even if she won't admit it to herself. Blaine really does bring out the best in her. He is kind, and has the patience of Job (as Kami actually says in the book). He knows she has some kind of issues that she is not divulging, but he doesn't let that deter him from her. Blaine is just an all-around good guy with a good heart who has also suffered loss (though nothing like what Kami has been through). I loved Blaine, and I loved him and Kami when they were together.However, my biggest reservation about this book was that I felt like Kami's insecurities and fears were kind of getting to the point of being slightly annoying. I really hope that doesn't make me sound like an insensitive a-hole because I swear I am NOT playing down what anyone might feel if they were Kami. Just as a reader, it kind of got under my skin. Blaine tries so hard to earn Kami's trust and never does anything to make her doubt him, but she constantly is back and forth with how she wants to handle her situation with Blaine. She wants to be with him, then she doesn't, she wants to tell him how she feels, then she freaks out and pushes him away. Over and over again. I just thought there was way too much back and forth with her and I was getting a little impatient with how long it was taking her to make any progress. Additionally, I didn't feel the level of chemistry between Kami and Blaine that I wish I had. I am not sure why, but it just wasn't all there for me. Maybe because I felt like Blaine barely knew Kami before deciding he became so invested. This might be just me, though. I also felt little chemistry between Eva and Gideon in the Crossfire series, and I know that is a series that plenty of people love.Truly, this is just a personal preference as a reader. I do get easily annoyed by characters who are indecisive (funny seeing as I'm a pretty indecisive person), and I just felt Kami was feeling sorry for herself with this constant no-one-could-ever-love-me-with-all-my-baggage stuff. It just went on for a little too long for me, and it wasn't until maybe the last 25% of the book that I felt something big enough happens to get my interest back and care about the characters again. While I did love Blaine, even he wasn't enough in the middle 50% of the book to keep me in an I-cannot-put-this-book-down stage. Is it a bad book? Not at all. There are a lot of emotional elements and I think Jennings is a good writer, but for some reason it just didn't elicit the kind of emotion that other books have elicited from me. However, it is a good story which I enjoyed (just wasn't totally in love with it), filled with lots of heartbreak, but a happy ending. Overall, I give it a 3.5 out of 5 stars. Fear of Falling will be released on July 18.I want to thank S.L. Jennings for providing the ARC of this book. I am grateful to be able to be among the first to get to read Kami's story."}, {"userName": "Lesley", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/12463905-lesley", "userReview": "Imagine a sudden paralyzing feeling, gripping you. Feeling as though you can’t breathe and as if your heart has stopped but is running a marathon all at the same time. Sweaty palms, tunnel vision and tingling extremities. All you know is fear. An all-consuming fear that chills you to the bone, a fear that strips your sense of reality. Nothing grounds you. Anxiety overtakes you and panic ensues. Yes, that’s a bit of what someone may feel when they have a panic attack. It’s what Kami dealt with on a daily basis, among other things. “So it really wasn’t the shit in life that was, well, so shitty. It was life itself.”Kami, our beloved main character, feels broken and not worth it. Who would want someone so…so….f*cked up? Kami feels her baggage is too much for anyone. She avoids all major forms of intimacy, with the exception of her two best friends, Dom and Angel. They are her family and the only ones who understand, because they are f8cked up to. Kami lives by a set of strict rules. She lives by these rules to feel safe, to feel in control. Because when Kami loses or falls out of her routine, anxiety kicks in. Fear comes. All 252 of them, written on origami stars. Kami was dealt a shit life, which in turn caused her to develop neurosis. Kami learned that the monsters in life aren’t hiding in the dark. We learn about her trauma as we watch her fight to not fall from her tiny sliver of safety. Blaine the crazy, fine piece of the male species has the potential to do just that. Should we add another star? 253“I feared death when all along, I should have feared life.”The sweet heart, bad-boy with a painful history of his own, Blaine is serious about Kami and tries his best to break through the shell that protects Kami. He doesn’t understand her resistance. He notices her quirks and continues to pursue her. Kami pushes back hard when she feels him getting to close. Blaine is patient and he is kind. He is always there for Kami through her unexplained moments, never once judging her or ridiculing her. But will Blaine’s patience win her over or will her neuroticism? Can he prove to her that you can trust? Can he build Kami’s faith back or will the monster come back and kill it?“You don’t have to be afraid of falling. Just close your eyes, let go, and know that I’ll always be here with arms outstretched ready to catch you. “Fear of Falling is a real book with REAL issues. We watch as Kami starts to heal and move on with her life. I enjoyed following Kami’s journey and meeting her wonderful group of friends. But the biggest thing for me was that it’s a book that I related to. I know what a panic attack feels like. I know what it feels like to be the odd man out because no one understands the panic disorder. I felt as though people thought I was crazy, Hell, I thought I was broken. As I grew older, I learned that I wasn’t and that I could learn to deal and even overcome. THAT is why this story is so absolutely beautiful. HOPE. It gives those of you with no hope and baggage, no matter how small or big that you can overcome. It shows you that you can have faith in life and people. Not everyone is a monster but the scary part is finding out and stepping away from safety. I give this book 5 beautiful stars."}, {"userName": "Terri", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/12780752-terri", "userReview": "This was a great book. It was very emotional and brought tears to my eyes. A beautiful love story about healing. I love this crazy group of troubled souls. So very touching! The friendship and the bond they share is so very special, especially with Kami and Dom. Blaine is just..well a gem! And who can not like C.J.? Love how it all came together. What a sweet ending!"}], "description": "I can’t remember the last time I felt completely safe. Security seemed more like a luxury to me, reserved for those who were fortunate enough to have picture perfect childhoods. For those who didn’t bear the ugly scars that keep me bound in constant, debilitating fear. I’ve run from that fear my entire life. But when I met him, for once, I couldn’t run anymore.He scared the hell out of me in a way that excited every fiber of my being. It wasn’t the tattoos or the piercings. It wasn’t the warmth that seemed to radiate from his frame and blanket me whenever he was near. It was just…him. The scary beautiful man that threatened to alter 23 years of routine and rituals, and make me face my crippling fear.My name is Kami and I am constantly afraid. And the thing that scares me the most is the very thing I want.“Don’t worry,” he smiled, pulling me into the hard warmth of his chest. “I’ve got you. I’ll always catch you when you fall.”And just like that, Blaine had staked his claim on the untouched part of me that no living soul had ever moved. He had captured every fear, every reservation, and crushed them in the palm of his inked hand.Author Disclaimer: Abuse is real- verbal, emotional, physical and sexual. It takes place all around us; it doesn’t discriminate against race or gender, wealth or poverty. It affects us all- those of us who’ve had to live through it, or watch it happen, even those of us who’ve only heard about it. We are all affected. We are all forever changed. This is not a story for the faint of heart; this is the story of one woman’s very real struggle through a world against her, the people who hurt her, her real life demons and the people who showed her that every gray sky, no matter how dark, has a sun waiting to break through.***Inspired by true events***", "title": "Fear of Falling\n      \n          (Fearless #1)", "url": "https://www.goodreads.com/book/show/17254226.Fear_of_Falling", "average": 4.12, "cover": "https://images.gr-assets.com/books/1368159690l/17254226.jpg", "reviews": 1332, "authors": [{"url": "https://www.goodreads.com/author/show/6572969.S_L_Jennings", "name": "S.L. Jennings"}], "type": ["New Adult", "Romance", "Sociology", "Romance", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/17254226-fear-of-falling", "http://www.goodreads.com/book/show/18212438-fear-of-falling", "http://www.goodreads.com/book/show/22227607-taint", "http://www.goodreads.com/book/show/17154753-the-dark-prince", "http://www.goodreads.com/book/show/17232332-dark-light", "http://www.goodreads.com/book/show/31424573-born-sinner", "http://www.goodreads.com/book/show/17611514-light-shadows"]}