{"ratings": 12757, "userreviews": [{"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "[ Not quite sure what to think about killing off Dancer. I totally shipped Dani and Dancer, but it seemed obvious that the new Dani had outgrown him. He had a \"heart condition.\" I'm kind of curious to see if there were any glimpses of this in Iced or if it was just a plot device to write him off for the future. I am not opposed to Dani being with Ryodan now. I don't think anyone besides Mac really understands her now. And Barrons. Why was Jo killed off? What is going to happen with Lor? He was angry, but he admitted he never loved her and forgave Mac for doing it eventually (since she was possessed by the sinsar dubh at the time). I guess Christian is totally human now again? Cruce was not undone by the song and is now basically going to try to become the Unseelie King since the original UK gave it up and just went off into the universe somewhere?? Alina was unsung, but that is not surprising. I never cared for that plot either - her coming back? Some of the nine went off through the silvers into different worlds. Kasteo went with Kat and her husband Sean O'Bannion. He (Sean) turned into an Unseelie Prince, but it was never said whether he was unsung or survived. Kat was barely in this. Apparently, she trained with Kasteo in the basement/dungeon? and became strong and bad-ass but we never get to see that.Shazam is back and I guess coming to live on Earth? That was a brief and rushed part.  (hide spoiler)]"}, {"userName": "Melanie", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "1.) Darkfever ★★★★*.) The Alpha Alternative: JZB Sex Scene ★2.) Bloodfever ★★★3.) Faefever ★★★4.) Dreamfever ★★★5.) Shadowfever ★★★★★*.) Fever Moon: The Fear Dorcha ★★★★★6.) Iced ★★★★7.) Burned ★8.) Feverborn ★\n\n“He kissed me like I was the empire he was sworn to protect and would die a thousand deaths to keep secure. He kissed me like I was a woman with a deep dark wildness that needed to be fed and he knew just how to do it. He kissed me like he was dying and this was the last kiss he would ever taste.”\n\nGod, I don't even know how to rate this book. Part of me wants to give it five stars, and ignore all the problematic things, just because it actually felt like the Fever Series I knew and loved. Yet, another part of me is all riled up and wants to give this book another one star rating, like the past two books, because KMM should know better than to put all these problematic things in another book!If I was just rating this book with my heart and soul, knowing how privileged my perspective is and ignoring how upsetting some of these themes are, I would give this book five stars, because I truly did love reading it, while pretending the rape culture wasn't there. But, luckily for my reviews, I use my mind to rate books, and this had some pretty upsetting things in it, that I will get to later in my spoiler section. I will also say that this book, especially the first part, is really dark. I was actually surprised by the brutality that KMM showed, and it actually shocked me so much I forgot about the mess that was Feverborn. Maybe it helped, because I felt like I went into this story with a clean slate from the shock value alone, but let's just say that KMM wasn't scared to kill anyone, and I truly mean anyone. Feversong picks up right where Feverborn leaves off: Dublin, and all of Earth for that matter, are on the verge of being sucked into a black hole. Mac now is harboring a host that is pretty brutal and Dani is finally getting back to being Dani and learning to leave Jada behind, while accepting her time spent in the Silvers. Dani and Mac are finally back to being friends sisters, and that's truly all I want from this series. I was living for them being all girl power, working together, and kicking ass. Dublin still is home to not only humans, but both fae courts:•\tSeelie -  the \"light\" or \"fairer\" court of the Tuatha Dé Danaan governed by the Seelie Queen, Aoibheal, who was a mortal concubine, who was tricked into becoming Fae. She's also the only one that can sing the Song of Making (which is pretty important in this story).•\tUnseelie -  the \"dark\" court of the Tuatha Dé Danaan. The Unseelie King is very mysterious, and communicates with mortals on Earth using a human form (sometimes a cute one). He also has the power to manipulate matter and create things, resulting in many people thinking he is God.Obviously, Mac and Dani have their hands very full with trying to restore the Earth before it is too late, but they are also faced with ensuring everyone else's safety. With this being the ninth book in the series, it is almost impossible to talk about anything else without spoiling everything, but I will say that Feversong did impress me much more than Burned and Feverborn, both of which got one star. KMM is definitely improving to make this series what it once was, but she still has some work to do. If you've been unhappy about the last few books, too, you can read the first five chapters for free: Here!WARNING: The next part of this review will have MAJOR SPOILERS! Please, do not continue on if you have not read Feversong in its entirety! Major, major, major spoilers from this point forward! Okay, I'm going to try to group together my thoughts in the most non-fangirl way, but I apologize in advance for this gush. I just feel like I have a million thoughts and feelings in my head and I want to get them down on paper. As I said above, I really enjoyed this book. I felt the same excitement I used to feel while flipping each page before the series was ruined! My favorite part of this story was probably the equal emphasis on Dani and Mac. Before, I felt so cheated when KMM switched the story direction back to Mac's POV, but this book felt right. I loved seeing Barrons and Mac being Barrons and Mac. It wasn't forced, or unbelievable, it was nice and made for a really great reading experience.Dani's chapters were much harder to read, but I don't mean that in a negative way, it just made for more tears. Dani's past was utterly heartbreaking to read about. I found myself sobbing at the end of each chapter. I am so excited that the next two books will fully focus on her, and I hope KMM actually stays true to it. Also, Shazam, Dani's Hel-Cat, is going to cause so much havoc - I can't wait! Even though Dani was all like: But like, no one is questioning whether or not KMM can write a good sex scene, because... she can. And people can say what they want about Ryodan, but he was awesome to let Dani experience different things, and not being a selfish prick. I know he gets so much hate for Iced, but he was a standup guy in this book. Even though I did enjoy Mac's chapters, while loving the ones involving Barrons, the Sinsar Dubh's chapters were a little insane. I mean, it made for a quick read and all, but it had a really weird fascination with having sex with Barrons. Like, I'm not holding that against it or anything, but it kept pulling me out of the story. Barrons was Barrons, so all was perfect. Barrons was my first ever book crush, so he gets away with shit I wouldn't let other male protagonists get away with. He's still so dreamy in my eyes and I'm not sure what could ruin that immersion. I like how he trusted Mac, even when he had reason not to trust her, in this book. BB&B is still one of the bookish places I wish I could visit, and I think I always will, especially with this new mysterious mural. Like, if Barrons becomes a Fae King I will seriously lose my shit, and I'm not sure how I could possibly fangirl harder. Mac being the Queen of the Court of Light was pretty unexpected, but in a good way. I liked this twist, and the scene in BB&B with the little faeries made me giggle like an idiot. The cliffhanger of Cruce not dying and remaking the Court of Darkness makes me feel a lot of negative things! Please, let this love-triangle die in Hell where it belongs. I'll write more on Cruce being a disgusting rapist later. Christian is still my favorite side character. Be still, my heart. I love this poor, brooding Unseelie Prince. I was so happy the Song of Making didn't unmake him. And, also, it's very obvious that he's going to end up with Enyo, so maybe KMM is setting up a spin-off for them or something? I was picking up that vibe, at least. Inspector Jayne turning into a Seelie Prince is like everything I never knew I wanted in this series! I was so freaking happy, and it was so unexpected! Like, seriously, I'm here for him working with Mac again, because their friendship is so great to read about.Okay, now that I'm done gushing, I'm just going to list the biggest problem with this book and why I am tempted to really drop my rating: The rape culture in this book is fucking strong! As we learned from the original Fever Series, Mac was gang raped by Cruce and three other Unseelie Princes that Barrons and Dani later killed. Cruce was imprisoned, Mac didn't think it was important enough to tell Barrons that the fourth rapist was Cruce *gags*, but everyone still saw Cruce for the gross, evil villain he truly was/is. Alright, now let's flash forward to this book, where Mac not only states numerous times that Cruce isn't evil, because there are people/books that want to destroy the world, so since that's worse than rape, then that is what is truly evil, not a little rapist. Plus, she did orgasm and enjoy herself while being gang raped and out of her mind, so, that really emphasizes that Cruce just made a mistake. *Sets fire to everything around me!* This is not okay. Rape is never okay. I will never condone a book that makes excuses for rape. Rape apologists are fucking disgusting, and this book would have been an easy five stars if Mac, and everyone else, told Cruce that, instead of making excuses or putting him on a \"lesser evil\" scale. Rape is inexcusable, period, and there is nothing else to say on the topic.Instead, KMM makes Mac kiss Cruce passionately, while telling him she could have fallen in love with him, instead of Barrons, if she would have only met him first, because that's the only way to save the whole entire world. Like, how is that supposed to sit okay with me? It feels like daggers in my heart, because I loved the rest of this book, but how am I supposed to ignore that problematic theme and inexcusable action? I can't, I just can't. \n\n“Yes, he’d raped me. I’d survived, and the nearly incoherent anger I’d felt for so long was simply gone. What remained was a chaotic world with complex politics and few with power enough to lead the various factions. My experience with the Sinsar Dubh had forever changed me. I’d encountered true evil. Up close and personal. I knew what it was. Cruce was not evil. As a Fae, he was a fine one. Exemplary even. A Fae that sometimes did very bad things to humans.”\n\nThe other thing that is a little gross, too, is Dancer's death. Okay, hear me out; I ship Dani and Ryodan. I ship them, because I feel like KMM has set them up together from the start. I completely understand people who shipped Dani with Dancer, and even the amazing Christian, but, for me, this story has always been told in a point of view that has Dani and Ryodan be end game. Obviously, there was no easy way for Dani to pick, even though she sort of tried to pick Ryodan, so KMM made the choice easy for her, while also giving a little bit of fan service to the Dancer and Dani shippers. Dani went back and forth, constantly comparing the two guys, but once I read about Dancer's condition I knew KMM was going to pull the trigger. Yes, KMM took the easy way out and it did feel a little bad, even as a Ryodan shipper, I'm not going to lie. Dancer's death impacted me unexpectedly hard. I'm totally going to understand the fans that will be upset and all of their feelings are completely valid, but I kind of liked the emphasis on how precious life is, especially in an apocalyptic world. We are all truly on borrowed time, and I enjoyed the message of how important it is to spend time doing what you love with the people you love. Besides those two things, which I know the one is freakin' huge and I definitely do not want to ever gloss it over as a minor mistake, I really did enjoy reading this. If you could eliminate that kiss with Cruce, this would be an easy five star book, which is pretty insane when I've given the last two in this series one star. Hopefully, KMM can only learn and grow and the next Dani book can blow me and my expectations out of the water, too.Also, huge shout out to the amazing Gelisvb, for listening to me cry, freak out, and gush, while reading this! <3 Blog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"userName": "Melissa", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/7311729-melissa", "userReview": "When I first learned that there were going to be two more Fever books in 2015 I was like:And then I realized that there were going to be two more Fever books in  2015 .And so I was like:I need my Jericho Barrons fix. Right. Now."}, {"userName": "Tatiana", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Oh, Feversong... A conclusion that both satisfies and also underlines how unnecessary and sloppy the last 4 books really are.Reading Feversong, I was mostly bored, not annoyed or disgusted at least, but bored nevertheless. The plot centers on finding Song of Making needed to get rid of the black holes that are poised to consume Earth. But the road to the solution is long and void of excitement or mysteries. Mac's continuous acquiring of different powers inside of her head means too much self-reflection and angst throughout this novel. (Yawn.) Looking back at my ecstasy of reading and rereading first 5 Fever books, I now can't quite believe I once had so much love for Mac and Jericho. The 4 additional books definitely undermined my interest in them forever. There is no doubt that while first 5 books contained a perfect story arc, (mostly) well thought out and planned, full of mysteries, surprises and slowly developing sexiness. The new 4 are a sloppy mess of changing narrators (who show up in one or two books and then never come back to narrate again - Jo, Kat, Christian, Lor, etc. - I say, if their voices are not important now, they shouldn't have been there in the first place, just mudding everything), weird villains (really, Sweeper, or whatever IT was?), odd or convenient magic (Alina is back somehow?) and recycled Jericho/Mac drama. These two were fine and done at the end of Shadowfever, thank you very much. The most compelling bits of the whole 2nd series of books for me were Dani's and Unseelie King/Concubine stories. I think I would have much preferred Dani lead in maybe a couple of tighter-written books instead of the actual bloated mess of Iced, Burned, Feverborn and Feversong. I'll bet if KMM could do it all over again, she would have done things differently, starting with not making Iced a pedofest. That book definitely got her off the rails for the entire remainder of the 2nd series. But, what's done can't be unmade.I expect there will be some more books in the universe, because so many loose ends still remain hanging. I am personally most interested in that bit from Burned where Jada thinks that one of the Nine is a woman. I will probably read whatever comes out next. Hopefully KMM can preplan things a little better next time and have some new interesting people doing sexy things and uncovering surprising mysteries."}, {"userName": "Alp", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/26653561-alp", "userReview": "[Dani spent every night with Dancer since she found out that he had a serious heart problem. They kissed and made out like there was no tomorrow, but never did anything more than that because she took her virginity seriously. I was a little frustrated that she didn't love Dancer enough to let him be her first. Anyway, I tried to understand her and patiently waited to get more from them.But one day, she went to Chester’s and asked Ryodan to help her find Shazam. She suddenly felt overwhelmed by guilt and sadness, and then she broke down in tears in front of him. Then, one thing led to another, she started kissing him, and then they dove deeper into the kiss. *Vomits* While she wildly kissed him, she had the nerve to compared Ryodan's kiss with Dancer's. That was disgusting. *Vomits again* She also wondered what it would be like to get naked with him. *Gags* At that moment, I think she would let him do her there in his office if he didn’t abruptly break the kiss and told her to get out.I don't care what Ryodan thought and I don’t want to know either, but what drove me mad was that Dani was angry with him because he rejected her. Then she went back to Dancer and gave up her virginity to him. It was so wrong! Their lovemaking wasn’t romantic at all. It was like she needed an outlet for her sexual frustration, and there, Dancer. So, ok let’s bang! Huh? Why abruptly decided that Dancer was the right one for her? Why it had to happen after she was rejected by Ryodan? Damn, Dancer wasn't the next best thing! He deserved better than an indecisive woman like her! And she thought her first time with Dancer was beautiful, he was wonderful, blah blah blah, as if she didn't just rub herself against Ryodan and almost had sex with him! It was f**king disgusting! *Vomits (again)*I was so mad and disappointed. I expected it to happen simply because it was meant to be! Not like this!I’m sorry if I’m such a fastidious reader. (hide spoiler)]"}, {"userName": "☆★Tinja★✮ A Court of Pizza and Laziness", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/11904521-tinja-a-court-of-pizza-and-laziness", "userReview": "OH MY GOD!!!! YESSS YESSS YESSSSS I LOVED IT!!! I was so fucking scared this would disappoint me aaaaaaaaaaaahhhhh <3 <3 Holy shit I feel like crying. Review to come."}, {"userName": "Nicole", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/40997852-nicole", "userReview": "[ While I liked some aspects of this book, I completely despised others. - WHY THE HECK DID SHE HAVE TO KILL JO? She was the main of the secondary characters, her death was useless! It's more of a how she killed Jo not why, though. She was one of the most important secondary characters, and she killed her this way? I knew she will die (read a spoiler) so while I wasn't shocked, I definitely didn't expect it to be this way, meaningless. And then, to make it worse, we have to face Lor. And Mac. He seriously dares to say that to her? Like she wanted it? I really liked when Mac snapped at him, you go girl!- Dani and Dancer.. FEEELINGSSSS . Again, another spoiler I've read. That why I emphasized on the spoilers thing. I knew he will die which didn't happen until the last few chapters! Imagine the struggle! I liked him with Dani too much, they were so sweet and cute together! I believe he helped her to be back just by accepting her. It feels like he only died to free the way in front of Ryodan to take Dani.- I respected Ryodan for holding back. Even though I prefer the savage one, I still can't see Dani with anyone else. I don't like nor hate him, but his origin interests me. And oh, now he's the saver of humanity? Are you fuckin kidding me? - Wanted to know more about the nine but sadly didn't.- I don't like Shazam/Dani thing. I understand he helped her but I lacked every emotion on the subject. - Dani chapters were my favorites! So glad to have her back. I love the new her!- While I liked to see Cruce back, I hated it when Mac justified his actions. RAPE CAN NEVER BE JUSTIFIED. OKAY?! - What's up with Mac having every power in the world?- Liked the less Mac/Jericho close scenes. For God's sake finally he's calling Mac, it was about time! Sadly, I can't see Barrons like I used to do... - I liked how Mac stood up for herself. Like she is her own girl. She had power and she unapologetically wielded it. She is finally Barrons' true equal. - I was disappointed that all the main characters came intact (except for Dancer who did soo much to help, and not even because of the battle!), especially Mac. *meh*- The ending made me feel like the story is a cycle that never ends. They obtained the song of making which was supposed to destroy every Unseelie yet, Cruce wasn't destroyed and he's making Unseelie again. Stop already. So now will he ask for the powers of the queen since he signed a compact with Mac? But he didn't teach Mac anything so can it be broken?- The song of making, oh yes. Obtaining it after all these efforts were ridiculous and so silly! Like, come on! Just that?! I hate it when authors do that, simplify the solution of a despicable huge problem! I wish she took it from the Sinsar Dubh and not Cruce! She would have at least suffered (more). I think the bracelet made him survive, I mean he needed it for a reason, right? But still, how he played them all, even Jericho was so cool. - I honestly think that the story could have ended with this book. Just remove the final chapter, make Mac the official queen, leave for Fairy with Jericho and Jada/Ryodan will get a spin-off to resolve the Nine problems (one is a girl, I so wanna know about her). - Alina thing is of course, USELESS. Hated it. Make her live then kill her, what for?Omg so many negatives lol, how this book ended up 3 stars and not 2? I don't know, maybe for Dani and Dancer. Maybe because I enjoyed the second half too much. Maybe for the concubine. And maybe because it was better than Feverborn which I gave 2 stars. Can't believe we still had one book, I don't even know what the issue will be since we're always left with cliffhangers. (hide spoiler)]"}, {"userName": "♥Book♥YouVeryMuch", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/5626576-book-youverymuch", "userReview": "Ms. Mooning has posted a Note on her Facebook page answering some questions about the new series:\"Am I writing a 6th FEVER book?Because I keep getting this question, I’ve realized I've obviously not answered it to your satisfaction:) I'm going to post here and ask that you all help me in spreading the word around.I'm currently working on a trilogy that features Dani, Christian MacKeltar, Ryodan, and the mysterious 'Dancer,' set primarily in Fever-Dublin. Each installment in the trilogy is a stand-alone mystery, however there are larger plot arcs unfolding in the background. Where Mac was introspective and her story could feel somewhat esoteric, Dani is down and dirty in the streets. Lots of details, lots of action. There’s a different feel to the two series, totally different vantage points. I’m having a blast writing it.For those of you who have been worrying—the trilogy is not YA. If I had to categorize it, I would say it straddles the line between YA and adult uneasily. I don’t pull any punches. It may be controversial in some ways. But whose teen years weren’t? LOL! Many of the questions I left unanswered in the FEVER series are addressed in this new series.Exciting news: I’ve agreed to write two more books after that. Once the new trilogy is complete, I’m returning to the core story begun in the FEVER series, and will resume writing about Mac, Barrons, V’lane, Cruce, the Unseelie king, the concubine, the Song of Making.All in all, there are five more books coming about the Fever World!Because I know you guys, I know this is going to make some of you as nervous as it makes you excited. Trust me. I’m making no compromises with the characters or the story. It’s all unfolding exactly as it should, true to itself-which means, it’s a sometimes rocky road. Dark times ahead, guys. But I write it all with genuine love for the characters, the world, and you the reader.As a final note, quit scaring Dreamworks with your demands for NC-17, LMAO. I don’t write NC-17. You have NC-17 imaginations! Sometimes I think you guys should be telling me stories!\"Also ----- DrumRoll please!!! ----- DreamWorks Studios has optioned the film rights to the Fever Series! Yay, this would be truly a treat to have the series turn into motion picture.I was hoping that there will be more Fever series as the issues and relationship between MacKayla and Dani were not completely resolved, and also at the very end of the book indicated that is the case:\"Dani was out there in the streets somewhere. Soon I would go looking for her.But not to kill her.We’d fight back to back.Sisters and all.\"I am so happy i was right =). I truly loved the series and Ms. Mooning is an amazing writer, with colourful imagination, exceptional writing and excellent story telling.Ahhh Jericho Barrons =D so many things to be said so little time lol, definitely my all time favourite male hero/character...I'll leave this space for the actual review (praying to Ms. Mooning's MUSE to complete this book as soon it is possible, and the publishing gods to publish it as quickly as possible lol)."}, {"userName": "Jelly Belly", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/5651950-jelly-belly", "userReview": "01/05/2015:I think I just died.Initial reaction: Like Christmas morning :)------------------------------------------------1/16/2017:THIS IS NOT A DRILL, I REPEAT THIS IS NOT A DRILL!!"}, {"userName": "Tanja ~ KT Book Reviews", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/4370589-tanja-kt-book-reviews", "userReview": "“Fire to his ice.Frost to my flame.Forever.\""}, {"userName": "Jilly", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Yes, I'm pulling out the 5-star review, even though it wasn't perfect. I couldn't put the book down and it got to me. I actually had salty discharge coming from my eyes at one point. What is the meaning of this sorcery? I was very much calling myself a little bitch for crying, but crying did happen. And, since I rarely cry, I got a headache. *sigh*It wasn't pretty. But, after a wine and Percocet cocktail, I'm feeling just fine now.Let me just say that if you haven't read the series up to this point, you might want to look away now.You were warned. Okay, so we have the sucking black holes that are going to suck our planet into oblivion. That's gunna suck. Cuz, we all gonna die. So, Mac & the Gang (anyone else think that would be an awesome name for an '80's tribute band?) need to figure out how to stop these suckers. I usually don't.Unfortunately, Mac is now the Sinsar Dubh. Or, it is her. Oh, and it's so evil that it's freaking hilarious. Oh S.D. gets right down to the horrific killing right away. It doesn't even start small, like most serial killers with the bug torture and the pet-killing. No, it gets down to business and takes out a main character in the most disgusting, bloodiest way possible.Whatever you are imagining, this is worse.We also get the release of Cruse/V'lane. I've always liked that guy. He is also pretty ambiguous when it comes to the rules of right and wrong. And, unfortunately for humanity, they need him. That's gonna be a problem. He's not exactly super-hero material.Oh, I stand corrected.As for Dani/Jada, well, let's remember that in our last episode she had just hopped the fence from Unstableville straight in the PsychoTown. But, don't worry, she still has the Pedo-twins, Ryo and Christian, wanting her. The hot/crazy scale is mightily tested. And yet, since they had shown their propensity for a 14-yr old Dani, maybe the whole thing needs to be on more of a sliding scale for this group.In case you are unfamiliar. Dani must be on fire! (Or was that Ryo? Oops, too soon?)But, Christian seems to be off the table, and instead we have a triangle with Dani/Ryo/Dancer. You all know that I have always been a Dancer fan. He has that geeky sex appeal and was actually the only one age appropriate for Dani. And, he was actually a decent guy to her - unlike some pedo-creep that won't be named. Just kidding. It's Ryodan. I never could get on that creepy ship. Ew.Commence the onion chopping now! As for the things that weren't perfect:Yes, there was too much \"thinkin'\", musing, rambling... But, hey, I feel like KMM wanted to catch us in the feels. And, you will really get into their heads. So, achieved!The changing of Ryodan's personality. WTH? Suddenly he is the philanthropist? The martyr for humanity? Mr. Nice Guy? Um, no. He's an ass. He was always an ass. He needs to continue his assish ways. Own it, man. I felt like this was just a way for us to be okay with a future relationship. And, oh, let's make sure all of the \"impediments\" are cleared too. This made me a bit killy. I freaking liked the impediment! *Urge to kill rising*Okay, time for another cocktail. Enjoy reading this. It has some ups and downs, but it is still a great end to our beloved series.Although, would it have killed her to write an epilogue? FFSFire to my ice, Mac.Frost to my flame, Jericho.Forever."}, {"userName": "Annie (Under the Covers Book Blog)", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/2489554-annie-under-the-covers-book-blog", "userReview": "I know a lot of people were scared to read this book. With the rumors going around, I actually found myself becoming more intrigued about the events of this book. That’s the thing about this series. You have to jump in with both feet to enjoy it.FEVERSONG is book nine in the series. If you’ve read up to this book then you know that KMM writes balls to the wall. Nothing is simple and everything wears a mask. What you think you know isn’t real and time after time KMM has blindsided me with her reveals. There are a few instances where this happened in this book, but there is one storyline that I didn’t see coming. Thinking back now, it makes sense and brings out a great sense of understand for a certain character. I experienced the same bone-deep heartbreak that I did when I first read J.R. Ward’s LOVER ETERNAL. But it wasn’t until later that the emotions poured out of me. You’re going to need some tissues with this one. Boxes of them. If you’re anything like me, you hate to see it happen, but at the same time, you can fully understand why it needed to unfold that way.We know that Ryodan is supposed to end up with Dani/Jada, but more growth needs to come from her character before that can happen. I think Dani/Jada gets put through the wringer in this one and there’s no question that I respect her a lot more now. In this particular book, I also feel like we get a little more of the old Dani instead of Jada and I loved this because if there’s anyone who deserves a little more happiness in her life, it’s Dani.Mac has come a long way from being the Rainbow Girl. I loved Mac all throughout the series, but with this particular book, she has become my number one favorite heroine of all time. The things she has endured throughout this series are tragic, heartbreaking, and stunning. Not only is she physically strong, but her will is one of the most beautiful things I have ever read. If she was pitted against any other UF heroine, there’s no question Mac would come up on top.I obviously have to mention the writing because KMM’s writing is spectacular. Highly detailed yet she doesn’t paint the picture for you. She allows you the freedom to put your own spin on it. A lot of my friends have lost patience with KMM’s writing and I think it’s a big shame. The thing with KMM’s writing is that everything she does has a roadmap, but there are other paths that run parallel to the story we are seeing that only converge when she wants it to. If you’re not willing to be patient and be jostled around a little bit, then this series isn’t for you. If you are though, man, you’re going to get the ride of your life.I don’t believe this is the end. I feel like there’s so much more to explore with these characters and despite every tragic thing they’ve already been through, miraculously, I can see more growth from these characters. I can only hope that KMM continues on with these characters because they have been immortalized as some of my faves on my shelf. FEVERSONG is the best of them all."}, {"userName": "SHOOKITHA TEA", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/13182378-shookitha-tea", "userReview": "3.5- NO SPOILERS -----Ok!! So this is it! The last book with Mac and Barrons. I’ll be 100% honest here and say I’m a Dani/Jada stan chomping at the bit. So my hopes going into reading this were: PLEASE LET THERE BE SOME TIME FOR DANI ALREADY. My hopes were met. Jada finally gets her time in this one. As a Dani lover I’m finally,  somewhat , satisfied. But let me back up and talk about the book as a whole. There were some things I liked and somethings I felt kind of disappointed in. Let’s start with Mac, I was kind of impressed with Mac in this one? Which is something I never really thought I’d say. I really enjoyed seeing her and Barrons’ relationship evolve as they BADLY needed it to. I freakin loved reading Macbook’s POV, it’s a lot of sociopathic fun lol. There are some things I feel disappointed in when it comes to Mac’s storyline but seeing as I'm not really all that here for her anyway, it's alright. There's something in their last chapter of the book that was a major wait, WHAT!!!! At least for me anyway. There’s a POV from the Concubine aka Aobeivielelsods. I can’t be bothered to look up the correct spelling. Honestly, if you enjoy the whole UK/Concubine storyline I think you’ll enjoy these chapters a lot. I’m just not one of those people lol, I wanted to skip those chapters so badly. But I will say in the end, I really liked where that storyline goes. Dani. My fave. I love her so much and that sure as shit doesn’t change in Feversong! I love her even more. Dani’s the epitome of a tragic hero. But I’d really freakin appreciate it if she could have a little less tragedy!! Stop making me cry K Mo!! Her ending is bittersweet. I won’t accept this as an overall ending for Dani, though. Hell no, I need some more sweetness up in here. Luckily it seems to me like K Mo isn’t finished with my girl.I liked that there were less POV’s in this one. A lot of the characters don’t really get closure but that was to be expected since it seems K Mo has more plans for this series or perhaps a spin off in the future. I’m glad she made the decision to focus on the main players.  Overall, the rating has been pretty hard for me to decide between a 3.5 and a four. I would say I'm pretty hard on the ratings of these books. Normally, a 500 pg book I could read in one sitting is an automatic 5 star read. But my relationship with these books is SERIOUS and requires more close attention than that lmao. Some scenes I could read over and over again while others I had trouble getting through once lol. The book is a pretty somber affair which, overall I liked but it’s hard to do a reread of. I would say this book didn’t fully satiate my needs the way I thought it would! like.. I’ve still got a fever! Maybe that was the intention if there’s still more to come, I’m not sure but it would make sense. ------FEVERSONG on sale date: 1-17-17!& the wait begins."}, {"userName": "♛Tash", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/5451856-tash", "userReview": "Dear book gods,Please guide KMM's hand as she writes Feversong. May it have less balls and more story. PS - nobody cares about the Unseelie King and concubine POV, please illuminate KMM that they'll be better off in an optional novella."}, {"userName": "Ferdy", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "[Likes: -I thought Mac was going to be a useless wallflower again, but thankfully she was proactive and useful once she finally figured out how to kick the Sinsar Dubh out of her body. Also, there was a lot less of Mac saying and doing stupid things, as well as less of everyone around her taking the piss out of her idiocy and disrespecting her. No-one wants to read about a dolt. -Mac standing up to Lor, and his double standards and epic hypocrisy. Who the hell did he think he was moralising to her and getting on his high horse about Jo?! The guy has no room to talk the amount of bad he's done. I cheered when Mac killed him. -The end of boring Jada. Well, she was still there every now and again but Dani was more or less back in charge. So yea, there was some actual personality to her. -Dancer and Dani finally getting it on, they were great together. I really thought KMM was going to have peado Ryodan pop Dani's cherry, thank fuck that fucked up shit didn't go down. I only wish Dancer/Dani had gotten together sooner, they literally only had two nights together, and then he was killed off. Seriously?! Is that all Dani gets before she ends up chained to a millennia old guy who's experienced everything with countless different women. She needs a lot more experience with love/sex/relationships with a load of different guys before she's shackled to paedo Ryodan. But since this is UF/PNR she'll be in cold freeze for years mourning Dancer until Ryo ignites her fire again or some rubbish, and then she'll conveniently forget all about Dancer because he won't compare to the awesome, macho, peado, abusive Ryo. -There was finally communication and growth between Mac and Barrons, and they were so much more interesting because of it. I don't know if I like them as endgame anymore, but at least they were entertaining and fun to read about in this one.-The Aiobheal/Zara/Unseelie King ending was rather enjoyable. I was expecting once Zara got her memories back she would be all over the Unseelie King again, but thankfully she wasn't. Her wanting to go back home and be mortal was far better than the usually sappy romance. -Barrons sticking up for Mac, took him bloody long enough. I don't know why in the last couple of books he was cool with everyone pissing all over Mac and threatening her, it was bizarre. At least in this one he managed to get around to acting like he cared for her and respected her.-Barrons being the leader again, instead of Ryodan's bitch. The Nine's hierarchy shouldn't be messed with. Yes, they're all alphas or whatever but the main leader is Barrons and that shouldn't be changed and messed around with just so one of the other Nine can look sexier and more badass when their story comes around.-Christian and Enyo, that could work. Dislikes:-The Sinsar Dubh chapters, after all the build up I expected it to be somewhat engaging, but the Sinsar Dubh's POV turned out to be one dimensional, dull and dreary.-There was way too much inner monologue, and none of it was particularly gripping, just everyone banging on in a convoluted manner about their feelings and thoughts in what I'm guessing was supposed to be a profound or eye opening way, but it came across more corny and idiotic to me.-Wasn't impressed with the anti-climactic and very convenient way the black holes, the Sinsar Dubh, and the Unseelie problems were resolved. Mac literally just sang everything better, I know the Song of Making was always meant to solve all the problems but it was all so easy and meh. It would have felt less magic-song-solves-all-the-problems if the Nine suffered or Christian died, but all the main players survived. At the very least Christian, Cruce and Sean should have been killed off, as they were all Unseelie and thus should have died with the rest instead of them being given plot armour. -The first book was set in 2006 and only a year has passed story wise between that one and this one, yet they've been numerous tv/movie/pop culture references that have occurred well after 2007. It made zero sense and took me right out of the story. And let's say that even if the timing worked out, considering the world is apocalypse-like, I highly doubt big budget tv shows, movies, music would still be being made.-Why was Mac and everyone else blaming her for the murders the Sinsar Dubh committed? She was possessed and pushed out of her body by the greatest evil ever, it wasn't like it was an evil version of her that did it. The Sinsar Dubh was solely responsible. It pissed me off how Mac kept blaming herself for killing Jo and the others when no part of her did, and it was in fact a whole other, separate sentient, parasitic being that committed all those atrocities. Why did none of the characters get that?! -I had to laugh at how Mac called Barrons her 'sun, moon and stars' when she knew that was how he felt about his old love/his son's mother. And it was even funnier when he recycled the 'sun, moon, stars' thing from the bigger and better love he had back in the day to say that to Mac just to shut her up. He already had that exact same sentiment about another woman, and since he shared a child with that woman and she was his world, Mac in comparison seems like a pale substitute that won't even come close to his past love. As irritating as Mac can be she still deserves better than being second best. I guess when the rest of the Nine get their stories, they'll end up with second bests as well as they've no doubt already had their one of kind, epic loves before. -Jo's death was disturbing, she was killed off in a horrible way. She was a good character and had lots of potential. I really do think she was only killed off because of the masses of Jo haters. Apparently, Jo was the worst person ever for deigning to get it on with Ryodan (who by the way was the one who manipulated her into a relationship just to get at Dani, at least Jo had genuine feelings for him), and then she was even more evil for moving on to Lor instead of wallowing in self pity. The misogyny surrounding her character is beyond ridiculous, and I wish KMM had given her a voice and a story, maybe that way she would have been more liked instead of being everyone's punchbag.-Couldn't bring myself to care about Shazam, Dani's obsession with him has started to get irritating.-Rapist Cruce and all the rape apology/excuses. Nope, not having it. He should have been killed off/punished but instead he's still going strong. I'm beginning to think he's going to end up being a 'hero' in future books. I hope that doesn't happen, especially when there are much better characters than the sulky, weak rapist. -Still hate Ryodan, wish he would permanently die. That's all. -Inspector Jeyne becoming a Seelie, is he just cool watching his wife and children age and die whilst he gets to be immortal and eventually move on with new family and love?! Ugh, no. He should have been kept human. The same goes for Dageus, so he'll watch his wife and kids age and die as well, and then forget all about them (except for when he wants to be angsty) and inevitably move on to the next shiny toy?? No thanks.-What the hell is Mac? Is she fae or immortal, if she's not fae then how is she the Seelie Queen? And if she is fae won't she lose her soul? Also, why is Barrons so against turning Mac into one of the Nine, the Nine's curse seems more like a gift than a curse, they have great powers and can do almost anything, and they have each other.. So why would it be so bad for Mac to become one of them? Surely, it'd be better than being fae?I'm guessing the next book/series arc will be purely Dani/Ryodan related, I'm not looking forward to that so I'll probably skip them and wait for a better series arc.  (hide spoiler)]"}, {"userName": "Kira", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/7247640-kira", "userReview": "2.5 starsA few things were good, but most of it was incredibly disappointing. The first third was boring as hell and repetitive. Then it got interesting for a while. By the halfway mark I was annoyed and stayed that way for the rest of the book. The only reason I finished this so quickly is because I knew if I put it down I'd never pick it back up again.I could have lived without the many chapters from the sinsar dubh. Yeah I got it quite early on that it was evil. I didn’t need to read over and over again about how it wanted to kill. I didn’t think Aoibheal’s POV was necessary either. I just didn’t care about what she was going through. Those chapters took up a lot of page time without revealing anything useful. The Dani backstory chapters were interesting but had absolutely no effect on the story whatsoever.The Dani/Ryodan/Dancer love triangle was obnoxious. The way that played out really pissed me off. It was done in a way that would manage to appease everyone regardless of who they shipped. I hated the way it ended. I wanted Dani to make a definitive choice instead of waffling about who she preferred for the whole book. When she made that choice, I wanted it to be a happy one. Her reasons for doing what she did were based more on circumstance than her own wants and needs.So much angst and tension, just to be majorly let down.Dani finally found a good balance between her new and old self. Aside from the love triangle bullshit I really liked her. Mac finally got her shit together. It would have been better if it could have happened earlier in the series. Things ended up for Mac the way I thought they would in regards to what she turned into. There had been hints about magic being drawn to her earlier in the series. It was unfortunate that she and Barrons weren't more open with each other. They were still committed and trusted each other completely, but I wasn't feeling the passion.Cruce had an important role. A different side of him was seen in this. He was still a temperamental bastard but opened up a little with Mac. They had more heartfelt conversations than Mac did with Barrons, which seemed wrong for the final book. It was good that he and Mac came to an understanding. It was sad in a way. I really think he would have done anything for her. OTOH it was disappointing that Mac moved past her issues with him so easily. Obviously I didn't want her to be permanently traumatized by what he did to her, but she brushed it off like it was nothing. It was bizarre that she put so much trust in him. It felt like an attempt to make Cruce into a good guy. Although I've always like Cruce, that ship sailed a long time ago.Ryodan is a douchebag of epic proportions. I've never liked him. I can't buy into his sudden shift into being a good guy. The guy is hundreds or possibly thousands of years old, and now he suddenly decides to change? Not fucking likely. It seemed like his character changed to make a potential Dani and Ryodan relationship more palatable. Many of the side characters' storylines were essentially dropped. WTH was going on with Daegeus? Or Kat? What was the significance of the Shazaam subplot? It had no bearing on anything. Virtually nothing happened with Christian. WTF are the nine? Why wasn't that explained in the last book? It should have been. Honestly IDK why I continued to read this series. It went downhill after the fifth book. Scratch that. Downhill is too light of a term to describe what happened. This series got so bad so quickly it's like it plunged off a cliff. There are too many useless POV. The books drag and are mostly filler. Things didn't end the way I hoped they would, but I still felt the need to know how it ended after investing so much time in the series."}, {"userName": "Sophia Triad", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "260117DNFI have reached 50% of the book and I simply cannot focus to finish it.Maybe it is my fault. I will give it another try after a few weeks, because it's not fair for the book.No rating for now...---------------------------------------170117Everything pauses until I finish this!I suppose I start from chapter 12...---------------------------------------BEFORE 170117You can now read chapters 1-11 on author's webpage for free before the official date 17/1Unfortunately, my final rating has already lost one star because I hated the fact that Sinsar Dubh had for dinner one of my favourite characters...“Master of adaptation and evolution, I slide more surely in my skin with each breath, enjoying the complex albeit imperfect elegance of what I possess. I inhale long and slow, swelling first my abdomen then lungs with air. Breathing brings an assault of unfathomable stenches, but I will acclimate.”Sinsar Dubh is out to play: “I would run if I were you” Bad bad book!!!"}, {"userName": "Olivia Ban", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/63970736-olivia-ban", "userReview": "[I feel like I'm in the minority here, but I liked Iced. Dani's story was a fresh change from Mac's and I wanted KMM to follow up on it. Once I realized that wasn't gonna happen, I wanted Dani to at least have good storylines. The split personalities and Dani becoming the leader of the sidhe-seers were interesting plots for me and I wanted to see where it would lead. However, Feversong pretty much destroys all of it:Split-personalities? Gone. Apparently Dani only called herself Jada to be taken seriously. The Abbey and the sidhe-seers? Gone. The abbey is nearly destroyed and sidhe-seers are scattered only to be restored by the great and powerful Mac. They all cheer for her because duh she's Mac and she's the biggest, most badass, most beautiful, hottest, strongest superhero ever. (I threw up a little in my mouth writing that)her relationship with Ryodan? b*tch what relationship? See, this is the part that I am majorly pissed at. Iced hinted a possible future romance -KMM even said Ryodan was going to surpass JZB- Burned and Feverborn had those tension-filled bits that made me hope for a proper development in their story. I invested in these characters. I invested in their story. But I got Dani and Dancer in Feversong and honestly, I didn't feel it. Not. One. Bit. And what's even sadder is this book expects me to believe that Dani was in love with Dancer all along. I got the gist of what was gonna happen btw them a few chapters before it actually happened and it felt like watching a trainwreck. In the previous books, everytime Dancer implied that he wanted to be more than friends, Dani pretty much acted like she had a terrible Dancer-induced headache and retreated. So what changed so fundamentally that she is suddenly in love with Dancer and \"sex with Dancer would be love-making but sex with Ryodan would only be sex and nothing more\"? And it is not Dancer's heart disease that changed things because if that were the case, it would be love out of pity and that is not what Dani claims she feels. She claims she has loved him all along but only admitted this after finding about his condition. This just felt flimsy and forced to me. I couldn't invest in their relationship and it made me enjoy this book a lot less. Another big issue for me was Mac. Like, way to beat a dead horse KMM... Her story was told beautifully in the first 5 books and it wrapped itself up nicely. All I got from Mac's chapters in Burned and Feverborn were headaches from rolling my eyes too much because they were all about sex, hotness, odes to Barron's genitalia or her inner monologue about how awesome she is. I hoped we would get more Dani and less Mac in this book but alas I was wrong. To be fair, her constant sex and hotness talk diminishes in this book but that is because she keeps talking about how her life sucked before and she is bigger, badder, stronger now. Seriously Mac, get over yourself and STFU already. This is not a rap song. There were parts which I liked such as Alina's farewell, or Shazam's appearance (honestly, he might be my favorite character in this book), Zara and Cruce... but truth is they weren't enough. This book had a closure for Mac and Barrons. It resolved their problems and their storylines. However, I already got that in Shadowfever. I expected different and frankly, so much more from Feversong. I feel sad tbh.  (hide spoiler)]"}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "3 stars  I HAD SO MANY ISSUES WITH THIS BOOK The Fever series (1-5) is one of my all time favorite urban fantasy series, it's darkly original and so compelling. I even LOVED Iced, Dani is my favorite character.But then people had to go and whine about how annoying Dani was and blah blah blah and Moning caved to them, and then we got stuck with this disappointing hybrid of a spinoff series.I just wish the last three books were Dani like it had originally intended to be. Her parts of this book were the parts I loved and ate up and wanted more of. Instead, we got boring repetitive passages of the book with WEIRD CAPS ALL THE TIME RAGE DIE DIE. <----- No me gusta. I found myself skimming all of the parts with the Book POV and Mac POV and only thoroughly reading the Dani ones.I gave this a three because the parts I enjoyed I really loved. Near the end I was sobbing over what happened to a beloved character. But honestly this book was sloppily done with random character deaths that didn't seem necessary and Dani having a weird three way romance that was kind of resolved?I saw Moning announce on Facebook that she will be writing another Dani book. I am so ready for that book, I will be buying it on release day because I love Dani and Ryodan. Fingers crossed she sticks with it."}, {"userName": "Yodamom", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/2905141-yodamom", "userReview": "I can breath again, I was holding my breath for those last few chapters. The final days with these beloved characters was intense and very satisfying. I rolled through the whole emotional scale on this last ride, happy, sad, nervous, ugly crying, fear, stressed, doubt, anger and joy. I also suffered from insomnia, this book invaded my dreams, waking me several times a night with a flash on energy as my mind mulled over the last few pages. The book ended in a wonderful way fitting for these fabulous characters.I am very happy that I found this author and series, both are in my top 5. Barrons my fictional book boyfriend, will forever be etched into my being, he was an incredible character. He might be my favorite but I loved them all, over the years even in the difficult stages.Thank you KMM for all your genius and time."}, {"userName": "Vilma Iris", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/15777655-vilma-iris", "userReview": "With Feversong, Karen Marie Moning dramatically drops the curtain on the Fever series. Bold and brilliantly layered, deeply emotive and all consuming, the story curves full circle as Mac and Dani try to save the world. Theirs has been a story of transformation, of finding the strength within to become who they’ve chosen to become, to wield the gifts they were given. No doubt fate has dealt them a bad hand, taken each to places dark and ugly. And in this final push, they must reach for the magic inside themselves to survive the world’s unmaking.\n“Look back and you stay stuck in a lost, forever unattainable past. Look forward and you live.”\nBlack holes paint the skies, ripping humanity from their place, tearing the Earth open wide. Only the Song of Making can thread together its seams. The Sinsar Dubh has possessed Mac, leaving a bloody trail across Dublin in its obsessive quest for power. Ruthlessly evil and terrifying, the Sinsar Dubh does things that ought to shatter a person irrevocably.\n“I am ceaseless, relentless, hungry as a tsunami. My will is stronger, my aim unencumbered, my desires greater. I always win.”\nTrapped within the recesses of herself, Mac must fight its evil to regain control and recover the mysterious song. Her past, her insecurities, her strengths all tangle together begging to be unwound in a way where she can understand how to escape the confines of her cage.\n“I’m ready. Only one of us is getting out alive. It’s going to be me.”\nBut even if Mac can best the Sinsar Dubh, the song remains a mystery, the Seelie Queen is nowhere to be found and Cruce is once again causing trouble.As the clock begins to tick its final countdown, alliances between enemies must be forged and gambles must be taken despite the potential for great loss. Sacrifices for the greater good have never been felt so deeply.The transformation of both Mac and Dani culminate in Feversong—understanding who they are, how they feel, the decisions they must make. I’ve always loved that although they are each incredibly powerful, they are also so relatable. Their sisterhood has seen tremendous ups and downs. From times of self-isolation to times they’ve stared down Death, they’ve made it out, heads held high.And of course, who they’ve loved has shaped them in ways they never could have imagined. We’ve seen the love between Barrons and his Rainbow Girl evolve throughout the series. It’s never been clearer how powerful both of them are… both Alphas ready to do what must be done. But what I thought was so beautiful, so ingenious, was seeing how in understanding their own power, their own individual strengths and gifts, they were finally able be vulnerable to each other in a way they’ve never been before.\n“I hold this man sacred and always will. He’s my sun, moon and stars.”\nLoyal fans of the series, like me, will love every moment, every page. As one now expects from the incredibly talented Moning, gasp-inducing surprises await. Don’t forget the tissues too.✦ ✦ ✦ ✦ Follow Vilma's Book Blog:  Website | Facebook |  Twitter  | Instagram"}, {"userName": "Fresiako", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/9036582-fresiako", "userReview": "[ I want so bad for this to be:But give Dani more of the main POV in this book please. No more Georgia-magnolia-drinking-sweet-iced-teas-with-my-daddy-bullshit.  (hide spoiler)]"}, {"userName": "Terri ♥ (aka Mrs. Christian Grey)", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/6014919-terri-aka-mrs-christian-grey", "userReview": "I'm sad it's over. Then again, I'd thought it over 5 books ago and we got it back.A lot happened in this book. But there were errors/plot holes. One of the last ones was Mac saying late in the book that she wondered at how only 2 days before Jada had a meltdown. Yet they'd been in the silvers and out, and more time had passed than the 2 days even before they entered the silvers but after the meltdown.Mac and Barron's have such an interesting relationship. They don't hug and show intimacy like most couples. So when most of the book went by with fade to black scenes, I didn't feel while reading the only intimacy this couple shared. And it left them distant to me. Plus, the rest of the series wasn't fade to black.The thing with Dancer felt contrived out of thin air to allow a certain someone to have their cake and eat too. Personally I cried at one point. I wish I didn't have to live through that, tell vs. show please. I did like that that storyline went the way it did until the end of it. It felt right for reasons explained in book.Lots of hanging threads. I don't know if anyone else felt like Christian had wanted Dani. In one book, he thought about her a lot. Yet, that was never brought up in this final book.There is so much left open but that's not my reason for my rating, though Deagas a favorite of mine was sorely missing.The book felt rushed and like KMM felt she had to cram so much in to finish it off, things went missing. Why was Deagas reintroduced into this series yet nothing came of it???Lore, Kat, Christian, Dani, Riodan and even Mac and Barron's all felt unfinished.I might be somewhat disappointed, but I'd jump on another book or a spin off."}, {"userName": "Sharon ∞❥ is an emotional book junkie ❥∞ ", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/3275325-sharon-is-an-emotional-book-junkie", "userReview": "4 - 4.5 ★'s From the moment I first started reading the Fever series, the only thing I wanted was for Mac and Barrons to be together and to be happy. And that was a struggle...we had to go through so much to get to this...the end of their story arc. There were a lot of crazy things that happened and then even crazier things. It was hard to keep it all sorted. To figure out what in the hell was really going on was just an absolute mind f*ck. So, whether you love this series or you hate it, the bottom line is getting answers...but that would be too easy and we all know that KMM just doesn't fly that way. What we do get is some closures and some \"okay, I can live with thats\" and that's good enough for me. As you know from the ending of the last book, Mac was in a bad spot. Suffix it to say, it's quite the ride. The Sinsar Dubh has lost its ever lovin' mind but fortunately Mac is not the same person she was when the series started. And I love, LOVE, love who helped her get there. We get A LOT of Mac and Barrons...unfortunately not enough of the steamy kind IMO BUT...we do get to see a softer side of Barrons. That's right you heard me...Barron's softer side. I never thought I would see the day but it has come and it is magnificent. ~sigh~ Of course, he is super growly and that will always be my favorite!And there is a ton of Jada/Dani in this book. And she definitely grows a lot...but there's also more of a mix of the two, like a Jani and it's a good thing. There's some Ryoden, there's some Dancer and holy hell....there's Shazam and you don't want to miss that. There is some Christian but not nearly enough. Hopefully the rumors are true that he is getting his own book. And there's plenty of Cruce...maybe too much? Another open end and possibly another book? There's actually quite a few sad parts which I was surprised about and definitely not happy about. I ~kind of~ get it but really it was just too much. Overall, I think most people will be happy with the book. It's like all the others with about a million bits of information slammed in it but this time, the good outweighs the bad. Now the only problem is waiting for Dani's book(s).(Prior to review...)I'm really sad that it's over! :( LOVE the cover and here's an excerpt (3/24/16):http://www.ew.com/article/2016/03/24/...My body doesn’t move as planned. It shudders, flops, and goes limp. “Stiff from being on the table so long,” I tell Jada, who watches me with narrowed eyes. I contract my abdomen, bend at the waist, stabilize my upper body, rotate my hips, shift my legs as a unit over the side of the gurney, and touch my feet to the floor.I stand.I AM.Desire. Lust. Greed. And the path I choose to supremacy.Master of adaptation and evolution, I slide more surely into my skin with each breath, enjoying the complex, albeit imperfect elegance of what I possess. I inhale long and slow, swelling first my abdomen then lungs with air. Breathing brings an assault of unfathomable stenches, but I will acclimate.Every thought, every emotion MacKayla Lane experienced is filed in my meticulous mental vault, but during my incarceration in her body, I couldn’t see, I couldn’t hear, I couldn’t smell.I was—as she is now—trapped in a dark, silent prison, my only connection to the world an attachment I forged to her central nervous system through supremacy of will and relentless trial and failure. My existence was a smattering of complex electrical charges, intricate patterns without substance. Although I spied on her life as much as possible, I was able to seize and use her body, hands, and eyes only once, for brief duration. All else was diluted, second-hand perception absorbed from within, but for that overcast, rainy day I killed the Gray Woman and Mick O’Leary.The power. The glory. That was the day I knew I would win. Those clumsy, debilitating hours I rode a body for the first time.I require time to perfect control.I. Require.I draw myself up inside, gathering the enormity, the ancientness, the hunger and storm of my being and expand into the imperfect biological vessel I’ve claimed, saturating, possessing every atom. I fill my blood, my bones, my skin. I turn the full force of my regard upon Jada, blink once, and reveal myself. My eyes, reflected in the stainless-steel door of a commercial freezer unit behind her, fill with obsidian until no white remains.She changes color. Fear impacts the nerves that connect brain to heart, constricting circulation. The blood vanishes from her face, leaving freckles upon snow. Her eyes widen, her pupils dilate and freeze. The scent of her body alters to one I find … intriguing.I experience all of this with my own senses. It’s incomparable. My mere presence reprograms the anatomy of those around me.Power.I was made for it.I would prefer to shred her flesh from bone, but several things prevent me. I smile with my new face.“I would run if I were you,” I tell her softly."}, {"userName": "Jay", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/10633920-jay", "userReview": "2 very disappointed starsSPOILERS AHEAD (Also, it's more of an incoherent rant as opposed to being a mature, well written review. Sorry :p )Honestly, nothing happened in Feversong. I mean, people were running around but all in all, I can't remember a single thing that happened between 30% and 80%. There were no fight scenes. The villains didn't feel threatening at all. No character development. No loose ends being tied up. We did get a lot of inspirational inner musing from practically everyone though... About choosing to be a victim vs. a champion. And making your own destiny. The power of friendship. And um... hope.I'm serious, 50% of this book is just waiting for Tumblr to quote it with a pretty background. See, I read my first Karen Marie Moning book last November when I stumbled across her Highlander series. I really liked them so I jumped into her Fever series without a second thought (even though I knew it was ongoing and since I'm an impatient little shit, I tend to put those on my \"Wait for Series to End\" shelf) The first five books all got 5 stars from me, then I skipped #6 because it was all from Dani's POV (the kid was annoying), and gave 4 stars to #7 and #8. I had pretty high hopes for #9, especially as it was going to be the last one in the series (meaning: no more cliffhangers, HEAs all around, and me face-down on the floor in a puddle of my own tears).Ah, I was so naive and innocent back then...We left book #8 with an \"Oh, shit!\" moment as the Sinsar Dubh possessed Mac and world was ending and people were dying and yes these things have been happening for the past 3 books BUT BOOK #9 WAS GOING TO BE THE LAST ONE SO THIS TIME IT ACTUALLY MATTERED.I remember being worried about how KMM would manage to tie up everything in a mere 500 pages, seeing as so many characters were running around and how involved they all were in this complex story. I shouldn't have worried.Because she didn't do it.Remember Alina, the girl who started it all? Mac's sister? Died and came back to life? Kind of a big deal since Mac avenging her was basically the plot for the first 5 books? Yeah, she has like four sentences in this.Remember Kasteo, the enigmatic guy who doesn't speak at all because a thousand years ago The Nine killed the woman he loved since they couldn't risk their secret getting out? Self exiled to the basement gym? Where they just locked Kat in who might actually \"thaw\" him? Two random little sentences. (And Kat, she trained there to be stronger yet didn't have a single fucking fight scene in Feversong)Speaking of, remember how important it was that NO ONE knew what The Nine were? How they killed anyone and everyone who could have exposed them? The main conflict in Mac and Barrons' relationship??? Yeah, well they practically ran around shifting in and out of their beast forms. Or talking about it. Or getting caught on camera. I feel like Feversong was just a rough first draft. It should be 200 pages shorter. And 200% cooler. I'm absolutely gutted :((P.S.: Surprisingly, Dani was actually rather likable in this and I'm looking forward to her books. Huh, who would have thought..."}, {"userName": "Jennifer", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "I've waited a long while to immerse myself back into Karen Marie Moning's Fever world. I was so excited, so much so that I began to fear I would be disappointed and it would be my own fault. No fear needed though, it was perfection! I remember feeling that the \"song\" and black hole elements were getting a bit redundant as the story progressed but there were so many other new and critically engaging elements that would follow so it didn't negatively impact my enjoyment AT ALL. This series finale brought stomach-churning suspense, magical revelations, Moning's classic humor, perspective-altering quotes, both surprising and lovely romances, and tears...yes, balling, bloodshot-eye tears. Sigh. This may be the final book in the series but the characters are far from finished. On her facebook page, Moning announced that the next book she will write will be a Dani novel. \"It does not pick up where Feversong ended, but at a different time. The title is High Voltage.\" No release date is set but it is tentatively expected in the early months of 2018. I can't fecking wait!!!!!My favorite quote:\"Things never stop going wrong. Life isn’t about waiting for peace to arrive, it’s about learning to thrive in the midst of war.\"2/10/17: It took me fifteen days to read this but it was everything I hoped it would be ♥Full review to come."}, {"userName": "♥Rachel♥", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/5481477-rachel", "userReview": "[ that way maybe we would've had a more satisfying conclusion with those two. I know it was apparent that they'd probably someday end up together but it would've been nice to actually witness it! I was also disappointed that she killed off Jo. Yes, I wanted her gone in Iced, but when she took up with Lohr that was all kinds of interesting! So WTH? She finally makes a character not annoying and then kills her off? Also, why not more with Kat and Kasteo? That story line seemed to hold a lot of promise and then nothing?!  (hide spoiler)]"}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "Feversong is good enough.That means it was heading to be a complete disaster but somehow it redeemed itself. That doesn’t mean it’s perfect. It's not even great. But I absolutely adore this series and because of Mac and Barrons-and even Dani-I'm saying it's good enough. KMM made the right moves and I'm a sucker for HEAs.“Strong enough that I was no longer afraid to be gentle. Powerful enough that I could be vulnerable. Scarred enough that I could understand and tread lightly around the deepest scars of others.”"}, {"userName": "Cristina•●♥Ƹ̵̡Ӝ̵̨̄Ʒ♥●•", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/6491858-cristina", "userReview": "... so sad, because this is the last book with Jericho & Mac. But happy, with their 'in love' finale :D“My philosophy is pretty simple—any day I’m not killing somebody is a good day in my book.I haven’t had many good days lately.”- MacKayla Lane* * *“Nothing is Hell. Nothing is where MacKayla is now.It’s in breaking things that you understand them.It’s in understanding them that you control them.The Unseelie tremble before me.As will the world.”- Sinsar Dubh* * *“It made me want to ensure that every experience I had really counted. That it be the best it could be, or not happen at all. I didn’t want to rack up bad memories, no regrets.”- Dancer* * *“You are the best of both worlds: the ice and power of a Fae queen, the passion and fire of a human.”- V'lane / Cruce / Unseelie Princes* * *“Sometimes I really did feel like I had two different people inside me, even though I knew I didn’t. One version of me was drawn to Dancer and another was a moth, obsessed with Ryodan’s flame. They evoked completely different qualities in me.”- Jada* * *“The moment I killed him, the poison inside me vanished. I was weightless. Free. I was born that day. I needed the vengeance. I needed to kill him. Right or wrong, that’s who I am. Sometimes people take too much from you and you have to take back.”- Ryodan* * *“Rainbow Girl. We’ll find each other again. Somehow.”- Barrons"}, {"userName": "Mizuki", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/16842102-mizuki", "userReview": "[the possessed Mac goes wild and kills everyone in sight...expects Dani because no one hurts Dani! (hide spoiler)]"}], "description": "Black holes loom menacingly over Dublin, threatening to destroy the Earth. Yet the greatest danger is the one MacKayla Lane has unleashed from within: the Sinsar Dubh—a sentient book of unthinkable evil—has possessed her body and will stop at nothing in its insatiable quest for power.The fate of Man and Fae rests on destroying the book and recovering the long-lost Song of Making, the sole magic that can repair the fragile fabric of the Earth. But to achieve these aims, sidhe-seers, the Nine, Seelie, and Unseelie must form unlikely alliances and make heart-wrenching choices. For Barrons and Jada, this means finding the Seelie Queen who alone can wield the mysterious song, negotiating with a lethal Unseelie prince hell-bent on ruling the Fae courts, and figuring out how to destroy the Sinsar Dubh while keeping Mac alive.This time, there’s no gain without sacrifice, no pursuit without risk, no victory without irrevocable loss. In the battle for Mac’s soul, every decision exacts a tremendous price.", "title": "Feversong\n      \n          (Fever #9)", "url": "http://www.goodreads.com/book/show/23401438-feversong?from_choice=true", "average": 4.37, "cover": "https://images.gr-assets.com/books/1458832493l/23401438.jpg", "reviews": 1576, "authors": [{"url": "https://www.goodreads.com/author/show/48206.Karen_Marie_Moning", "name": "Karen Marie Moning"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/23401438-feversong", "http://www.goodreads.com/book/show/12446825-feversong", "http://www.goodreads.com/book/show/112750.Darkfever", "http://www.goodreads.com/book/show/7304203-shadowfever", "http://www.goodreads.com/book/show/6050298-dreamfever", "http://www.goodreads.com/book/show/344262.Bloodfever", "http://www.goodreads.com/book/show/2702704-faefever"]}