{"ratings": 38316, "userreviews": [{"userName": "Florencia", "userReviewDate": "Jun 23, 2013", "userURL": "http://www.goodreads.com/user/show/21575078-florencia", "userReview": "Reading Borges is always a challenge. When you read his stories, it seems you are reading everyone else's. There is a lot of references in his work, and if you want to truly (kind of) understand it (or begin to), you have to do a little research. He ends up being an invaluable teacher. Labyrinths, mirrors, libraries, dreams, fantasy, religion, philosophy, epistemology. My love for philosophical literature began with this author. My all-time favorite story is “Las Ruinas Circulares”; the power of thoughts. “Con alivio, con humillación, con terror, comprendió que él también era una apariencia, que otro estaba soñándolo.” What a beautiful line to end a story. (I prefer quoting Borges in his own language, my language. I do the same with English-speaking writers. Being able to read JLB in Spanish is a privilege.)\"Tlön, Uqbar, Orbis Tertius\" is another jewel with a line I never forgot:…los espejos y la cópula son abominables, porque multiplican el número de los hombres.I also liked “La lotería de Babilonia”, “El jardín de senderos que se bifurcan”, “Funes el memorioso”, “La biblioteca de Babel” (brilliant). And... I should stop here. I loved every piece of amazing and confusing literature this guy wrote. So, this is a useless, too subjective review because I absolutely love Borges' writing. Despite the fact he makes me feel plain stupid, most of the times.JLB and his blindness, nice oxymoron. He saw things beyond the ordinary human eye. He created universes, troubled authors, fake books, never-ending labyrinths and a unique way of writing about all that and more.He is one of those great writers that makes you feel like everything has already been written.May 05, 14* Also on my blog."}, {"userName": "mark monday", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Borges looked inside the swirling mind of man and made a maze of it. A glorious maze! The maze that is Ficciones is a maze built of mazes, one opening unto another, circling around and looping back, an infinity of mazes, small as the smallest of small minds, large as the universe can be imagined. Its architecture is delicate and refined; the wry wit of its creator is apparent in every twist and turn. Borges' maze gently mocks yet empathizes with the self-important, the self-absorbed, and the self-denying. He understands the foibles of man and his maze offers diverse commentaries on such things. But there are darker things lurking beneath that amiable surface; Ficciones is more than an academician's cleverly constructed playground. Beware the prickly thorns of this maze! There is anger there, under the charm and the playful games; anger at the systems of man and the futility of certain behaviors, at the machinery of government. There is sadness there too, at the thought of those who would treat such mazes as homes, at the machinations of fate.\nLike every writer, he measured the virtues of other writers by their performance, and asked that they measure him by what he conjectured or planned.\nBorges is fascinated by the concept that if something has been thought about, has acquired meaning through that contemplation, then that something has become real. Thought creates its own reality, and reality is composed of varied systems of being and behavior; thought becomes the way that reality is interpreted - and therefore enacted. Ficciones tells stories about stories: each story is about the perspective of mankind, the symbols they cling to, the metaphors they attempt to turn into living, breathing reality. Ficciones is an imaginarium; it is a weird and haunted carnival. It is a dazzling display of comic, sometimes cosmic gems... and each gem includes a seam of tragedy, fractures that can sometimes be seen on the surface but are most often buried within its heart.Oh the mysterious fallibility and hypocrisy of the human kind! Their failures and their attempts to transcend their fates! The mazes and fictions that they create - and then proceed to live in!each story title is a link to something that that story made me think about...Part One: THE GARDEN OF FORKING PATHSTlön, Uqbar, Orbis TertiusThe Approach to Al-Mu'tasimPierre Menard, Author of Don Quixote discard the downloadThe Circular RuinsThe Babylon LotteryAn Examination of the Work of Herbert QuainThe Library of BabelThe Garden of Forking PathsPart Two: ARTIFICESFunes, the MemoriousThe Form of the SwordTheme of the Traitor and HeroDeath and the CompassThe Secret MiracleThree Versions of JudasThe EndThe Sect of the PhoenixThe South"}, {"userName": "Lizzy", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "“Blind to all fault, destiny can be ruthless at one's slightest distraction.”\n Reading Jorge Luis Borges is a bewildering experience and a challenge all in one. There is no logically understanding the mazes Borges creates, but that is what fantastical-realism is all about. Ficciones is a labyrinth, beautiful and witty, of ideas and feelings that mock and conquers the reader.Borges can speak for himself, who am I to explain his brilliance and imagination?\n“When it was proclaimed that the Library contained all books, the first impression was one of extravagant happiness. All men felt themselves to be the masters of an intact and secret treasure. There was no personal or world problem whose eloquent solution did not exist in some hexagon. The universe was justified, the universe suddenly usurped the unlimited dimensions of hope. At that time a great deal was said about the Vindications: books of apology and prophecy which vindicated for all time the acts of every man in the universe and retained prodigious arcana for his future. Thousands of the greedy abandoned their sweet native hexagons and rushed up the stairways, urged on by the vain intention of finding their Vindication. These pilgrims disputed in the narrow corridors, proffered dark curses, strangled each other on the divine stairways, flung the deceptive books into the air shafts, met their death cast down in a similar fashion by the inhabitants of remote regions. Others went mad ... The Vindications exist (I have seen two which refer to persons of the future, to persons who are perhaps not imaginary) but the searchers did not remember that the possibility of a man's finding his Vindication, or some treacherous variation thereof, can be computed as zero.” \nA masterpiece, not to be missed!"}, {"userName": "Steven  Godin", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "3.5 - There can be at times circumstances that effect your thoughts on what's being read. Or even just the way that you read it. This is one of those very occasion where I will undoubtedly benefit reading again. It's clear to see why Jorge Luis Borges is regarded as one of the 20th century's most inventive writers, and Ficciones is a collection of small stories that are on a grand scale, but my overall problem was going through three or four at a time and finding them hard to digest, jumping from one to another just didn't work for me. And only read the last few days apart giving me a chance to fully think about about them, this worked so much better, but still left me feeling a bit dumbfounded. Also was not reading the best translated version, so that didn't help either. Borges never compromised himself by writing a novel but instead left a whole library of delicately structured maze-like speculations. Each one is like the Tardis – little time-machines of the imagination and far bigger within than they appear on the outside, and there is certainly plenty to keep one occupied: writers, dreamers, heretics, young men with impossible memories, other worlds revealed by secret encyclopedias, traitors transformed by betrayal, conspirators that plot their own downfall: 17 pieces, none longer than 25 pages; none shorter than a lifetime. It's difficult to pick a favourite but 'Death and the Compass' and 'The Sect of the Phoenix' were two that I read twice.I am sure this collection will grow on me, and multiple readings built up over time will no doubt chance my perception from reading the first time, into something very special indeed!"}, {"userName": "Steve", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/236411-steve", "userReview": "Metaphor              Infinity         Sophistry             Penumbra          \nSymbolic\n               LABYRINTH                 Heresiarch              Prefigured         \nPhilology\n             Nihilism                                        Maze             AllegoricalThis may not be the prettiest word cloud ever constructed, but I think it’s a fair representation of the Ficciones experience. Much of the time spent trying to solve the stories’ puzzles involves bandying these concepts about. I can’t honestly say I understood them all, but moments when something did click were exciting because the ideas behind them were subtle and cryptic. Comprehension somehow boosts us to a higher plane. The ultimate in advancement, if it can be imagined, is the universal infinitude of all experience.*The more grounded me says, Steve, aren’t you kinda, like, talkin’ out your ass? And the more grounded me answers, yes. However, I contend that Borges himself, if asked, might have said the same thing (though surely more artfully). For him, I think, it was the mind-bending absurdity of the questions he posed rather than some metaphysical (and unattainable) truth of the matter that excited him. It’s hard to describe these stories to anyone who hasn’t read them, and harder still to back what I’m saying by way of example. Instead what I’ll attempt is a bit of Borges-inspired logic that may not have been the exact point of his stories, but occurred to me as a result of reading them.If we take as a given that time is infinite, then every possible set of realities would have a chance to play out. If in one iteration I typed an O here, I could in another type an X, with all else being the same. Every single permutation imaginable could occur as each Big Bang and collapse in infinite time came to fruition. Imagine the implications! Borges did, at least in a way. In one story he imagined a near infinite library containing books with every possible letter combination. In such a place, a man could conceivably find the story of his life, though practically speaking, and without Google, it would be damned difficult. Borges also considered a single book that could contain all knowledge, made possible by pages that were infinitesimally thin. (Zeno’s paradox, as Borges mentioned, can be explained in a similar way where infinitely many infinitely small increments can be summed to something we can observe in the physically limited world.) To Borges, a labyrinth is a similar metaphor of life. Each person has a complex set of turns in a ridiculously intricate path that I think represents every decision we face – right, left, X, O, date, dump – whatever. It’s this kind of thing that the man of many places (he lived in Argentina, Switzerland and Spain) and many languages (he translated Wilde, Shakespeare, Kafka, Poe, Hesse, Gide, Whitman and Woolf among others) would have resonate for its universality and unboundedness.While I have huge respect for the man, I also feel like I’m not his ideal audience. For instance, his philological references exposed me for the literary dilettante that I am. He could also come across as a bit too academic for my taste, and at times even tedious. I will not challenge its status as a classic, though. In fact, I truly enjoyed the quasi-logical extremes he went to in pursuit of intellectual entertainment, imaginative possibilities and hard won ah-ha moments.*I liken this to the “total consciousness” that the Dalai Lama promised groundskeeper Karl Spackler in Caddyshack."}, {"userName": "David", "userReviewDate": "Jun 29, 2008", "userURL": "http://www.goodreads.com/user/show/390164-david", "userReview": "The peer pressure from my intellectually superior friends finally shamed me into reading this (as I had no Borges under my belt). Obviously from the 5 stars, I'm glad I caved in. This is a collection of 17 of his \"best\" short stories, held together merely by the thread that they are like nothing else you've ever read or even thought about. Not every story is perfection, but all are surprising, irritating, challenging and somehow rewarding. Standouts are \"Pierre Menard, Author of Don Quixote\" - a man who dedicates much of his life to the recreation of Don Quixote word for word, a stunningly insightful satire. Also, \"The Circular Ruins\" which challenges the reality of religion and even self-awareness. \"Funes, the Memorious\" about a man cursed with perfect memory, and \"The South\", a somewhat autobiographical and deceptively simple narrative that is actually an experiment in structure.Borges uses very direct, sparse but extremely detailed language. His characters are full baked from the beginning, so he wastes no time on development - it's all about the idea, the innovation, not the plot. If you read one of these tales out of context you might mistake it for a non-fictional essay, albeit with quirks. Anyway, I'm recommending this to anyone who doesn't mind risking confusion and discomfort in the the pursuit of something truly unique and intellectually delicious."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "4.5 stars, rounding up. I read and then reread several of these stories (some of them for a third time) while I was writing my final review for Fantasy Literature, and they keep impressing me more ... for the most part. My literary friends will be so proud of me! :D So here's the full review, where you can follow along with the journey of myself and my (severely challenged, but ultimately edified) brain cells ...Ficciones is a classic collection of seventeen short stories by acclaimed Argentine author Jorge Luis Borges, originally published in the 1940s in Spanish, and winner of the 1961 International Publishers Prize. These stories and mock essays are a challenging mixture of philosophy, magical realism, fantasy, ruminations on the nature of life, perception and more. There are layers of meaning and frequent allusions to historic figures, other literary works, and philosophical ideas, not readily discernable at first read. Reading Ficciones, and trying to grasp the concepts in it, was definitely the major mental workout of the year for me. My brain nearly overloaded several times, but reading some critical analyses of these works helped tremendously with my understanding and appreciation of these works … well, at least most of them.The stories in Ficciones are divided into two parts: The first part, The Garden of Forking Paths (El Jardín de senderos que se bifurcan) was originally published in 1941. The first six stories in Part Two, Artifices, were added in 1944, and the collection was named Ficciones at that time. Borges added the final three stories to Ficciones in the 1956 edition.Part One: The Garden of Forking Paths“Tlön, Uqbar, Orbis Tertius” ― The narrator tells how his search for information about Uqbar, mentioned to him by a friend and found in only one edition of an encyclopedia, leads him to Uqbar’s literature about the imaginary world of Tlön, with its fantastical culture steeped in psychological and philosophical concepts. A brief taste:The nations of that planet [Tlön] are congenitally idealist. Their language, with its derivatives ― religion, literature, and metaphysics ― presupposes idealism. For them, the world is not a concurrence of objects in space, but a heterogeneous series of independent acts. It is serial and temporal, but not spatial. There are no nouns in the hypothetical Ursprache of Tlön, which is the source of the living language and the dialects; there are impersonal verbs qualified by monosyllabic suffixes or prefixes which have the force of adverbs.Heady stuff! This twenty page story (the longest in the book) is so abstruse and heavily laden with philosophical ideas and allusions that I found it almost completely impenetrable. It reminded me of trying to read James Joyce’s Ulysses. I was so completely lost that I’ll confess I had to put this book down and retreat to a fluffy romance while I mentally regrouped for another attack on this book. Brain cell verdict: no response. They totally shorted out on this one.“The Approach to Al-Mu’tasim” ― This allegorical story purports to be a review of the titular novel, about the years-long pilgrimage of a law student in India, who murders a man in a riot and falls among the lowest of society. When he perceives a note of tenderness and clarity in one of these vile men, he concludes that it is the reflection of a perfect man who exists somewhere. The student embarks on a lengthy search for this man, whom he calls Al-Mu’tasim. We have met the divine and it is us. My brain cells concluded that, although some of the allusions are obscure, this tale is far more readily grasped than the first one. There is hope!“Pierre Menard, Author of the Quixote” ― Another story set up as a mock review of one Pierre Menard’s attempt to recreate Don Quixote ― not copy it, but study Cervantes and his world so deeply that he can write Don Quixote exactly as it was originally written. The reviewer lauds Menard’s work, which uses the identical words as Cervantes, as far richer and more profound than the original. It’s satirical in tone, but otherwise I was at a loss as to the theme and meaning of this work. The brain cells were getting restive again.“The Circular Ruins” ― A stranger makes his way into the circle of ruins of an ancient temple, lies down and begins to dream, with great purpose: he wants to dream a man, to create a son to whom he will be the father, by imagining him in great detail. It succeeded for me as a symbol of the creative process of authors, even though I’m still wading through tricky but entrancing sentences like this:He understood that modeling the incoherent and vertiginous matter of which dreams are composed was the most difficult task that a man could undertake, even though he should penetrate all the enigmas of a superior and inferior order; much more difficult than weaving a rope out of sand or coining the faceless wind.It’s still a challenge, but my brain cells are starting to feel a little more hopeful. So we moved on to …“The Lottery in Babylon” ― In the city of Babylon, a lottery morphs into an game that takes over all aspects of life in Babylon. A lucky drawing might lead you to be elevated to the council of wizards or reunite you with a long-lost love; a losing ticket might land you in jail, or get your tongue burned, or lead to infamy or death. The ubiquitous lottery seems to be a symbol of the capriciousness of chance in life and the story in general seems to be taking an ironic view of the questionable role of deity in human life. My favorite part was the sly reference to Franz Kafka in the form of the “sacred privy called Qaphqa,” where informants can leave accusations for agents of the Company that runs the lottery. The brain cells were quite amused.“An Examination of the Work of Herbert Quain” ― This is another satirical review piece, purporting to review four (non-existent) works written by a (fictional) author. Borges playfully explores the labyrinth concept in different ways in each of these works. This story, frankly, didn’t leave much of an impression on me.“The Library of Babel” ― One of Borges’ most famous stories, “The Library of Babel” posits a universe in the form of a library made out of connected hexagonal rooms, each room filled with books and the barest necessities for life. Each book contains 410 pages, with 40 lines of 80 letters each. There are 25 letters and punctuation marks in the alphabet. The Library contains every possible combination of those letters. Most of the books are complete gibberish, of course, but like the Infinite Monkey Theorem says, if you have enough monkeys banging away on typewriters for long enough, eventually they’ll write Hamlet. But life for the people dwelling in this library is profoundly frustrating, even depressing, since only a vanishingly small percentage of the books make any sense at all. Borges explores the ways that people react to this, with several nods to religion and philosophy. Mathematicians have had a field day with this book’s concept, figuring out how many books such a library would contain. Per Wikipedia’s article on this story, there would be far more books in this library (1.956 x 10 to the 1,834,097th power) than there are thought to be atoms in the observable universe (10 to the 80th power).“The Garden of Forking Paths” ― Dr. Yu Tsun, a Chinese professor of English, is living in Great Britain during WWI. Dr. Yu is spying for Imperial Germany for a psychologically complicated reason: he wants to prove to his prejudiced German chief that a person of his race, a “yellow man,” can save the German armies. Yu discovers that an MI5 agent, Richard Madden (an Irishman who also has equivocal feelings about the nation he is serving, due to his nationality) has captured another German spy and is on the verge of finding him. Dr. Yu goes on the run. The plot is thickened by the fact that Dr. Yu has just found out the location of a new British artillery park. How can he pass that information to his German handler before he’s captured? This is the first story in this book that has a substantial plot to go along with the play of ideas; hence, I enjoyed reading it more than the previous tales. The concepts in it are not as mentally challenging, although the labyrinth imagery and philosophical conjectures resurface toward the end. Still, “The Garden of Forking Paths” was straightforward enough that my brain cells didn’t hurt too much trying to wrap themselves around the story.Part Two: Artifices“Funes the Memorious” ― Borges, as narrator, meets up with a young Uruguayan boy, Ireneo Funes, who has the ability to tell you exactly what time it is without looking at a clock. When Borges returns to this village three years later, Funes is now crippled from being thrown by a wild horse, but his mind is unimpaired. The narrator realizes that Funes also now has an infallible memory, with perfect recall. But the depth and detail of Funes’ memory makes it impossible for him to grasp general, abstract ideas.To think is to forget a difference, to generalize, to abstract. In the overly replete world of Funes there were nothing but details, almost contiguous details.This tale was, again, a little too opaque and short on plot for me to really enjoy. The brain cells were grumbling a little.“The Form of the Sword” ― In this story, which deals with themes of identity and betrayal, the narrator is passing through a town and asks an “Englishman” whom he meets there (actually an Irishman) about the terrible, crescent-shaped scar across his face. The Irishman tells a story of his involvement in the battle for Irish independence, and his dealings with a disagreeable, cowardly man named John Vincent Moon. There’s a twist to this tale, echoing the Irishman’s portentous comment that “[w]hat one man does is something done, in some measure, by all men.”“Theme of the Traitor and the Hero” ― A man named Ryan researches the death of his great-grandfather, an Irish nationalist hero named Fergus Kilpatrick, who was assassinated and is now viewed as a martyr to the cause of Irish independence. Something about the manner of Fergus Kilpatrick’s death strikes Ryan as enigmatic, a series of events that are like “circular labyrinths” (that image again!), oddly echoing elements from Macbeth and Julius Caesar, Shakespeare’s classic tragedies of betrayal. In “Theme of the Traitor and the Hero” the conceptual aspects of this tale don’t override the compelling plot, and this was one of the stories I really loved.“Death and the Compass” ― Erik Lönnrot, a highly intellectual detective, works to solve a strange set of murders by figuring out the pattern underlying them and the clues left by the murderer, referencing the unspeakable Hebrew four-letter name for God. Lönnrot foresees a final murder, but can he prevent it? As Lönnrot explores the house where he has deduced the final murder is to occur, once again we have maze-like imagery:On the second floor, on the top story, the house seemed to be infinite and growing. The house is not this large, he thought. It is only made larger by the penumbra, the symmetry, the mirrors, the years, my ignorance, the solitude.This detective story had enough philosophy in it to make it intriguing and give it more depth than a typical mystery, but not overload my brain cells, which are feeling like they’re now on a roll.“The Secret Miracle” ― A Jewish playwright is arrested by the Nazis and sentenced to die by firing squad. All he wants is the ability to finish up a play he has been working on, his masterpiece. A divine voice tells him that he will be granted the time to do this — even though he is set to die the next day. But God works in mysterious ways, and the playwright is able to weave “a lofty invisible labyrinth in time.”“Three Versions of Judas” ― In yet another mock literary review, Borges reviews three imaginary works by Nils Runeberg about Judas, the betrayer of Christ. Borges-as-Runeberg recasts the character and nature of Judas in three different, heretical ways, including as a righteous man who knowingly accepted his role as the person who would force Jesus to declare his divinity, and even as another incarnation of God Himself. He challenges our comfortable religious views.“The End” ― A shopkeeper, who has suffered a paralyzing stroke and is lying on a cot, sees and overhears a confrontation between a Negro man, who has been hanging around the shopkeeper’s store, playing his guitar and waiting, and a man who rides up to meet him. Their conversation makes it clear that the black man has been waiting seven years for this meeting. As mentioned in an editor’s footnote, this brief, bleak story is essentially a coda to a famous Argentine 19th century epic folk poem, “Martin Fierro,” about the life of a violent gaucho. In a famous scene in the poem, Fierro crudely provokes a black man and then kills him in the resulting knife fight. Several years later, in this story, Fierro is an aging man with some regrets for the life he has lived, and whose free and lawless gaucho way of life is passing. Once I really grasped the connection between the poem and this story, it became one of my favorites in this collection.“The Sect of the Phoenix” ― There is a group of people in all societies and times, tied together by the Secret that they share, which Borges coyly never reveals. Is it sexual intercourse? Or perhaps more particularly, homosexual sex?In the prologue to Artifices, Borges comments:In the allegory of the Phoenix I imposed upon myself the problem of hinting at an ordinary fact ― the Secret ― in an irresolute and gradual manner, which, in the end, would prove to be unequivocal; I do not know how fortunate I have been. Of “The South,” which is perhaps my best story, let it suffice for me to suggest that it can be read as a direct narrative of novelistic events, and also in another way.“The South” ― This is one of my favorite stories in this collection, as well as Borges’. The main character is Juan Dahlmann, a mixture of German and Spanish ancestry, whose life is mundane but who dreams vaguely of a more romantic life, inspired by the Flores side of his heritage and the Flores ranch in the South that he owns but has never visited. One day Dahlmann brushes his forehead against something in a dark stairway and realizes afterwards that he is bleeding. He develops a life-threatening infection and is taken to a sanitarium for treatment. After many excruciatingly painful and feverish days, he recovers, and decides that he will take a trip to his ranch to convalesce. He travels out of the city on a train, feeling as though he is traveling into the past, and has an unexpected confrontation as he nears his final destination. Or does he? You decide, but several clues in the text ― a mysterious cat, a spitball that brushes his face, a dagger tossed to him by an old gaucho ― have led me unequivocally to my own conclusion. The brain cells, by the way, were completely engaged by this tale, which was complex and layered enough to make me think, but didn’t lose me in a labyrinth of difficult-to-grasp ideas.Repeated labyrinth imagery, scenes of deception, and challenges to our perceptions of what is real echo throughout the stories of Ficciones. These stories are often elusive, twisting out of your grasp or revealing unexpected depths just when you think you’ve got a handle on them. Even the lightest stories have several layers and hidden meanings to unpack. If you’re interested in philosophical ideas and are up for a literary challenge, I highly recommend Ficciones. The 1962 English translation by Anthony Kerrigan and other translators is excellent."}, {"userName": "Vit Babenco", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/19283284-vit-babenco", "userReview": "To me Fictions by Jorge Luis Borges is the ultimate anthology of short stories… I find in it everything I ever want to find in literature: reality and surrealness, fables and parables, legends and myths, mysticism and philosophy, history and fantasy and an endless enigma.“I owe the discovery of Uqbar to the conjunction of a mirror and an encyclopedia. The mirror troubled the far end of a hallway in a large country house on Calle Gaona, in Ramos Mejia; the encyclopedia is misleadingly titled The Anglo-American Cyclopaedia (New York, 1917), and is a literal (though also laggardly) reprint of the 1902 Encyclopœdia Britannica. The event took place about five years ago.”Yes, use a combination of mirrors, labyrinths and books and you too will be capable to live an idyllic, fabulous and mysterious life whenever you wish… “With one quick look, you and I perceive three wineglasses on a table; Funes perceived every grape that had been pressed into the wine and all the stalks and tendrils of its vineyard. He knew the forms of the clouds in the southern sky on the morning of April 30,1882, and he could compare them in his memory with the veins in the marbled binding of a book he had seen only once, or with the feathers of spray lifted by an oar on the Rio Negro on the eve of the Battle of Quebracho. Nor were those memories simple—every visual image was linked to muscular sensations, thermal sensations, and so on. He was able to reconstruct every dream, every daydream he had ever had.”A perfect memory and ability of perfect vision turns into a curse and we understand that our capability to forget is actually a divine gift.And Death and the Compass is an utmost detective story, an utter post-noir tale for me. I believe that this elaborate maze of misconceptions, false steps and deception was a main influence on Foucault's Pendulum by Umberto Eco.“There are more things in heaven and earth, Horatio,Than are dreamt of in your philosophy.”"}, {"userName": "Mateo", "userReviewDate": "Jan 09, 2009", "userURL": "http://www.goodreads.com/user/show/1879747-mateo", "userReview": "Todavía no supero este libro. Creo, el mejor de todos los libros de cuentos Borgianos. Todavía no supero que los habitantes de tlön no crean en el espacio y su lenguaje este compuesto de una sucesión infinita de verbos. Todavía no supero la concepción de un empresa como la Pierre Menard, que buscas escribir el Quijote, me rindo a ayudarle en lo que pueda. Todavía no supero la daga, ni los laberintos, ni los tigres, ni el sur, ni las bibliotecas, ni al otro...Todavía no supero a Borges."}, {"userName": "PGR Nair", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/5003369-pgr-nair", "userReview": "( Note: This is an article I wrote in 2009 to mark the 110th birth Anniversary of Borges. Therefore, some of the stories I cite here may not belong to this collection. I thought to post it here as this book is the most cited. If you plan to buy a book of Borges, buy this one or Labyrinth and other stories as both contain the same set of stories and translators. His best translators are Norman Thomas di Giovanni and Anthony Kerrigan . Stay away from the translator Andrew Hurley)THE BINOCULARS OF BORGES \"Time is the substance of which I am made. Time is a river which sweeps me along, but I am the river; it is a tiger which mangles me, but I am the tiger; it is a fire which consumes me, but I am the fire. The world, unfortunately, is real; I, unfortunately, am Borges.\"No Latin American writer of twentieth century has achieved such iconic status as the Argentinean writer Jorge Luis Borges (Pronounced as Bor-Hess. 1899-1986). During his life, Borges wore many hats. He was, variously, a poet, an essayist, a short-story writer, a librarian, and, for a short time, a poultry inspector. As a hauntingly original essayist and short story writer, his three or four dozen short stories and essays is mentioned in the same breath with the tomes of Thomas Mann or James Joyce. This blind octogenarian (His was a particular kind of blindness, grown on him gradually since the age of 30 and settled in for good after his 58th birthday) became a legend in his own time so much so that ‘Borgesian’, eventually became a common neologism like the adjectives “Orwellian” or “Kafkaesque” .In his life, Borges was an extremely shy person and possessed an exceptional modesty that makes him endearing. Though a supreme writer, he always underrated his writings as an escape from the boredom of a blind man. I can vouch his humility from reading the countless interviews that appears in the book , “Conversations with Borges”. His face lights up when anyone praises his work; yet he habitually conveys the deep stillness of a man with few illusions about himself or the world. He also conveys sweetness and wisdom, those refinements of perception that sometimes accompany old age. \"Beside real short story writers,\" he says, \"my stories hardly exist.\" Perhaps no writer of modern times was as bookish and multilingual as Borges. His aristocratic upbringing, cosmopolitan outlook and exposure to different cultures gave him a universal mind. As a precursor of the \"Magical Realists\", he ingeniously mixed philosophy, fact, fantasy and mystery in his stories. They are written in dense and challenging prose. Unlikely images and situations are woven into a richly complex tapestry that arouses questions of identity and the self, of reality and the possibility for dreams.Intellectual Labyrinths , time, space, infinity, memory, mirrors (Borges delights in the multiplicity of things; he is fascinated with mirrors because they multiply) and libraries are some of the principal themes in his works. Borges' stories take place in a world that is half commonplace, half fantastic. Dreams occur within dreams; time loses its significance. What counts is momentary impulse and observation.Economy, grace, humor and precise sounding historical and referential details and ingenious plots are hall marks of his style. The great Peruvian writer Mario Vargas Llosa in his “Letters to a young Novelist” lauds Borges as the greatest prose stylist in Spanish language. He says: “Borges’s style is unmistakable and functions extraordinarily well, giving life and credibility to a world of sophisticated intellectual and abstract ideas and curiosities. In this world, philosophical systems, theological disquisitions, myths and literary symbols, reflection and speculation, and universal history are the raw material of invention. Borges’s style adapts itself to its subject matter and merges with it in a powerful alloy, and the reader feels from the first sentences of his stories and of many of his essays that these works have the inventive and sovereign quality of true fictions, that they could have been told in this way, in this intelligent, ironic, and mathematically precise language-not a word too few, not a word too many-with its cold elegance and aristocratic defiance, privileging intellect and knowledge over sensation and emotion, playing with erudition, making a technique of presumption, eluding all sentimentality, and ignoring the body and sensuality”. Vargas Llosa says that Spanish was suddenly \"purified,\" \"intellectualized\" by the inimitable prose style of Borges.Among his stories, my personal favorites are, “The Aleph”, “Garden of Forking Paths”, “Death and the Compass”, “Pierre Menard”, “The secret Miracle” and “The Circular Ruins”. Let us dwell on the themes in some of them . In his story “Funes the Memorious”, a gaucho is confined to bed for the rest of his life after being thrown by a horse. He hardly cares. The fall has miraculously sharpened his perception so that his memories are boundless: \"He knew by heart the forms of the Southern clouds on the 30th of April, 1882, and could compare them in his memory with the mottled streaks on a book in Spanish binding he had only seen once and with the outlines of the foam raised by an oar in the Rio Negro the night before the Quebracho uprising.\" Borges contrasts this world of heightened perceptions due to total memory with the real world of clumsy generalizations. Another famous story titled “The Aleph” tells about a point in space that contains all other points. Anyone who gazes into it can see everything in the universe from every angle simultaneously, without distortion, overlapping or confusion . The story explores his fascination with infinity. And in an imaginative murder mystery called ‘The Garden of Forking Paths’, considered as one of his best, time is envisioned as a complex network of planes on which spatial events may occur independently of one another—unless, of course, the planes happen to intersect accidentally. Burges’ fictional universe was born from his vast and esoteric readings in literature, philosophy, and theology. He sees man's search for meaning in an infinite universe as a fruitless effort. In the universe of energy, mass, and speed of light, Borges considers the central riddle time, not space. He believed in an infinite series of times, in a growing, dizzying net of divergent, convergent and parallel times. This network of times which approached one another, forked, broke off, or were unaware of one another for centuries, embraces all possibilities of time.In the story “Death and the Compass”, murders in the four corners of Paris are matched to the four Hebrew letters of the name of God. The killer in this story leaves clues indicating religious motives: a distortion of kabalistic tradition in which murders reveal the divine name, letter by letter. Seeing that the first three murders form an equilateral triangle on the map and took place at regular intervals, the detective Erik Lonnrot pinpoints the time and place of the final murder, only to discover he has been set up for a trap: A common outlaw has lured Lonnrot there to murder him. The detective knows this but he is so fascinated by the pattern that he goes anyway, thus solving the mystery of his own murder.One of Borges’s most famous stories ,‘The Circular Ruins’, unfolds a pitch-perfect fable of riddling existence in the twentieth century . A wizard retreats from the world to a location that possesses strong mystical powers: the circular ruins. There, the wizard tries to create another human being from his own dreams. Sleeping and dreaming longer and longer each day, the magician dreams of his young man becoming educated, and wiser. After time, though, the wizard can no longer find sleep, and he deems his first attempt an inevitable failure. After many sleepless nights, the wizard dreams of a heart; vaguely at first, but more and more clearly each night. Years pass and the wizard creates the boy piece by piece, in agonizing detail. The wizard calls upon the god Fire to bring his creation to life. Fire agrees, as long as the wizard accustoms his creation to the real world, and that only Fire and the wizard will be able to tell the creation from a real human. His creation is sent to a distant temple of the god Fire, and becomes famous as, because it is not real, it can walk through fire unharmed. The wizard hears of this, but at length he awakes to find the ruins ablaze. As he ultimately walks into the flaming house of Fire, the wizards notices that his skin does not burn. \"With relief, with humiliation, with terror, he understands that he too was a mere appearance, dreamt by another.”The color and grace of his stories lies in his use of marvelous adjectives . For example, look at the line , “No one saw him disembark in the unanimous night” which is the opening line in the story ,“The Circular Ruins”. What an odd adjective, “unanimous”. It is so odd, in fact, that one is sorely tempted to put something like “all-encompassing”, so as to make it “comprehensible” to the reader. Similarly many such weird adjectives and adverbs , violent and unexpected metaphors such as \"the readers at their studious lamps\", “nebulous grey beard”, “concave hands”, “immortal monkey”, “Clouds of smoke which rusted the metal of the nights” are sprinkled in his fiction and poetry . Disparate imageries and clinical contextual details in describing a place sometimes create a surreal landscape reminiscent of a Dali. The overall effect of his language is simply magical.The unemphatic style of Borges often achieves effects with a single exploding word or phrase, dropped almost as though off-handedly into a quiet sentence: \"He examined his wounds and saw, without astonishment, that they had healed.\" This laconic detail \"without astonishment\", coming at the very beginning of \"The Circular Ruins\", will probably only at the end of the story be recalled by the reader, who will, retrospectively, see that it changes everything in the story; it is quintessential Borges. Borges' writing has often been called intellectual, and indeed it is dense with allusion. But it is also simple: the sentences are almost invariably classical in their symmetry, in their balance. To conclude, Borges was a world-class artist-a brilliant, lyrical miniaturist, an uncomplicated genius who could pose the great questions of existence on the head of a pin. Reading him might alter the way you look at everything, including yourself. The perfection of his language, the extent of his knowledge, the universalism of his electrifying ideas, the originality and inventiveness of his fiction, and the beauty of his poetry still continue to enchant the literary minds all over the world."}, {"userName": "Morgan", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/1656680-morgan", "userReview": "Ok, I'd tried to read Labyrinths years ago and found it dry and dull. I thought that perhaps I just wasn't in the proper state of mind, or perhaps wasn't well read enough to get it. I'd also come off of a Calvino kick, so Borges felt boring. Fast forward to me thinking that I really should commit to Borges and give him a real chance.I have to say that hard a hard time with this book. I only really like one story The Babylonian Lottery. The Circular Ruins, The Library of Babel, The Garden of Forking Paths and The Secret Miracle being alright and scant few others like An Examination of Herbert Quain and The End only fair.Most of the time I feel like I'm stuck as some shitty academic after-party listening to the drunken rambling of a self-indulgent lit professor trying to make himself believe that he is the smartest guy in the room. I get the references, but most of this just isn't that interesting. It all comes across as clinical, with a tone of little Jack Horner self satisfaction staring at his thumb saying \"What a good boy am I.\" Let me write you a Borges story:I could write a longer story dear reader, but instead I will keep to laconic prose. I met Arkadiusz Juhász when he threw a crust of bread at my head and laughed in that way that he does. At the time, I was simultaneously reading De Natura Deorum, Hasidic Kabbalah, and Discours de Métaphysique. [Fill page one with nonsense that isn't all that important to the story, feels otherworldly, and serves only to offset and confuse the reader]. At dinner Arkadiusz Juhász described the labyrinth in his mind. He had an experience the likes of which you will never have. Jews are mysterious. He solved a puzzle that he created for himself and figured out that he is Shakespeare and everyone wrote Henry V for it has always existed. There is a long history of naming a thing, but in reality everything is the same. Arkadiusz Juhász felt disjointed from the world and wandered and time passed with little result. Perhaps he was in a sanitarium with black circling walls. Arkadiusz Juhász has written a collection of essays to describe the effect of his travels. Here is the list: Darkest Jungles 1898; The Diminishing Return 1900; Checkers and the Vanishing Point 1904; The Breadbox 1904; The Unhappy Happenstance 1906 (unfinished); Ur Nuts 1907; Life in a Ziggurat 1909 (never actually written); The Aching Feather 1910; Critical Analysis of Being Spanish 1912 (writen in Portugese and German). [Describe some of these essays]. Arkadiusz Juhász confessed to me that he was really a war criminal. But, I later found out that he may not have been. Arkadiusz Juhász died of a brain hemorrhage in 1951."}, {"userName": "Jacob Overmark", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/41670556-jacob-overmark", "userReview": "A dream within a dream It was a fascinating first-acquaintance with Borges, an author who has been staying with me for a long time, a house-ghost, a little of this and a little of that, a glimpse into my subconscious and all legends and myths in one place. Cleverly wrought essays on Swedish scholars and secret societies planting false information and a lot of babble – I clearly get the impression that Borges never minded hearing himself speak, and being spoken of. The best short stories are the ones set free of time and space, stories that easily could weave into each other if they were allowed to, they are dreamlike labyrinths of the mind. 3 stars for too much “Listen to me I´m a genius”. 4 stars for stylistic mastery, 4 stars for the great influence on world literature. Rounded up to 4 stars."}, {"userName": "Nickolas the Kid", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/28908169-nickolas-the-kid", "userReview": "Έδιτ 1Στις \"Μυθοπλασίες\" ο Μπόρχες μας οδηγεί στον μαγικό του κόσμο και η διαδρομή περνάει μέσα από λαβύρινθους, καθρέφτες, ψευδεπίγραφα και μαθηματικούς γρίφους!Κάθε διήγημα είναι και μια πνευματική άσκηση για τον αναγνώστη. Ο Μπόρχες μας καλεί να λύσουμε τους γρίφους και να εξερευνήσουμε μαζί του τον χρόνο και τον χώρο. Ένας μάγος φτιάχνει έναν καινούργιο άνθρωπο/μαθητή από όνειρα, ο ίδιος ο Μπόρχες με τον Μπιόι Κασάρες ψάχνουν για μια φανταστική χώρα που ίσως υπάρχει, ένας συγγραφέας θέλει να ξαναγράψει τον Δον Κιχώτη, το σύμπαν παρουσιάζεται ως μη πεπερασμένη βιβλιοθήκη, ένας Κινέζος χάνεται στον κήπο με τα μονοπάτια που διακλαδώνονται και πάει λέγοντας… Αυτές είναι μερικές από τις ιστορίες με τις οποίες, ο συγγραφέας με αριστοτεχνικό τρόπο γραφής και λεπτό χιούμορ φτιάχνει έναν μαγικό κόσμο γεμάτο εικόνες συμβολισμούς και οφθαλμαπάτες…Ο Μπόρχες σε κάνει να θέλεις να διαβάσεις. Να ανατρέξεις σε βιβλιοθήκες και να ψάξεις για την θρησκεία, την φιλοσοφία, την μυθολογία… Κι αυτός για μένα είναι μια από τις μεγαλύτερες επιτυχίες των \"μπορχεσιανών\" διηγημάτων!5/5...ΥΓ: Πως να μην δώσει κανείς 5 αστεράκια σε ένα βιβλίο που ξεκινάει με συζήτηση του συγγραφέα με τον φίλο του Μπίοι Κασάρες για την χαμένη πόλη Uqbar που δεν υπάρχει σε καμιά εγκυκλοπαίδεια παρά μόνο σε έναν χαμένο τόμο ενός παλιού εγγράφου...***Εξαιρετική η μετάφραση του Αχιλλέα Κυριακίδη"}, {"userName": "Denisse", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/8759700-denisse", "userReview": "Read for the 2015 Reading Challenge: #12 A book of short stories.  Beautifully written, addictive, but complicated must of the time. Definitely worth reading. The stories cover a wide range of topics in an exquisite form. Para lo corto del libro se tarda uno en leerlo. Borges escribe muy lindo pero hay algo en estas historias que me hacían sentir intimidada, no se que fue. Los temas que tratan son muy variados, así que seguro hay alguno para ti. Las que a mi mas me gustaron fueron: Tlön, Uqbar, Orbis Tertius; Las ruinas circulares; La biblioteca de Babel; El milagro secreto; Tres versiones de Judas.Todas empiezan ligeras y se tornan algo confusas conforme les para después tener sentido al final, si las llegas a entender, yo no las entendí completamente todas, y creo que por eso ayer que lo termine me dejo con una sensación rara, como de limbo. Me explico? Eso si, todas las historias tienen un buen final. O al menos a mi me gustaba como las terminaba el autor, incluso cuando no había entendido nada y tenia que meterme a Internet para hacer un poco de investigación XD -Dios bendiga a Google-De todos mi mas favorito fue: La biblioteca de Babel. Te deja unas imágenes en la cabeza preciosísimas y me encanto como abordo el tema del Universo. \n\"Quizá me engañen la vejez y el temor, pero sospecho que la especie humana -la única- esta por extinguirse y que la Biblioteca perdurara: iluminada, solitaria, infinita, perfectamente inmóvil, armada de voumenes preciosos, inútil, incorruptible, secreta.\"\nComo católica hecha y derecha, me causo mucho conflicto la historia Tres versiones de Judas, la verdad nunca se me había ocurrido ver esa parte de la historia de esa manera, y me sigue dando conflicto y probablemente me lo seguirá dando por toda la eternidad, ya que básicamente Judas es considerado El traidor por excelencia. Pero como lectora, me gusto mucho el relato. No se si exista pero este libro seria bueno releerlo en una versión anotada por alguien que capte todo lo que hay que captar. No se, yo apenas me estoy metiendo en este tipo de lecturas con suma inteligencia detrás del autor, así que todavía soy medio cabezota XD Creo que hay relatos muy ligeros y bellos y otros bastante cargados de inteligencia. Pero esa mezcla hace que el libro en conjunto sea toda una experiencia. Aun así recomiendo el libro, pero piensa de verdad si ya estas en ese punto como lector/a como para subir ese escalón (personalmente, yo todavía me siento como a mitad de darlo y no darlo), porque un libro tan lindo como este merece leerse cuando haya que leerse no cuando a uno le plazca y después no entender ni j y decir que esta raro o malo o lo que sea. Ahora, que si te gusta el realismo mágico, definitivamente ten en cuenta este libro."}, {"userName": "Dolors", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "“You who read me, are You sure of understanding my language?”\nJorge Luis Borges, “The Library of Babel” Even though I read Borges’s \n“Collected Fictions”\n in Spanish, my native tongue, I have to confess I didn’t understand half of it. Presumptuous of me to think I would. Famous for being the founder of postmodernist literature and influenced by the work of fantasists such Edgar Allan Poe and Franz Kafka, whom I adore, I was naive enough to assume I would be able to untangle Borges’s labyrinthine, almost rigorously mathematical style to form a coherent opinion of his short narratives. I was also deceived by the apparent simplicity of the tales which turned out to be complex, condensed and thought provoking meditations about philosophical and existential issues.Borges’s enormous erudition, which might be appealing to others, worked the other way round for me, leaving me mostly frustrated by the multitude of literary allusions from cultures around the globe which I struggled to connect with the meaning of his surrealist inventions. It seems this proved to be too much of a strenuous task for my ignorant self.The blurred line between reality and dream challenged comprehension in tales such as \n“Tlon, Uqbar and Orbis Tertius”\n where Borges depicts an ideal, metaphysic world made real by the power of imagination.The same idea is reinforced in \n“The Circular Ruins”\n, in which a man is able to create a son only dreaming about him. Later, after the man accomplishes his goal, much to my astonishment, he discovers that he in turn is being dreamt by someone else. The tittle, which also notes the mythical temple where the man appears out of nowhere (maybe time travel?), might also carry the analogy of the infinite repetition which can be seen in a circle, a geometric figure which has no end and no beginning. Like the act of this neverending regression of dreaming and creating process presented in the story.I was most disturbed by the oppressive idea \n“The Library of Babel” \n conveyed to me. We are introduced to a Library whose cataloguing system consists of hexagonal and identical galleries to classify the infinite books it contains. The inhabitants of this Library know the answers to all their questions lay somewhere, among the books, although the probability of being able to find those answers is close to impossible. The central conflict of the individual intellect and the physical manifestation of the infinite chaos is portrayed with negative connotations, pointing out the futility of trying to establish order in a chaotic universe, which reminds me of the insignificance of human beings.\n\"The Babylon Lottery”\n follows the same line of thought in presenting a detached narrator who depicts life as a labyrinth through which a man wanders without control over his own fate, which is governed by ruthless uncertainty. Here again there seems to appear the issue of trying to put order in a fragmented, indecipherable universe ruled by randomness.My favorite one was \n“The secret miracle”\n probably because I could identify with the need of Hladík, a Jewish poet and the main character, to freeze time when he is arrested and condemned to death by the Nazis. I found the way Borges manages to portray the subjectivity of time simply brilliant, especially in the scene where Hladík is being executed. Everything seems to end in a second for the rest of world except for Hladík whose prayer is answered in the form of a precious year in which everything becomes paralysed so that he can mentally finish the last act of his half-written play. \n“Funes the Memorious”\n is similar in the way it deals with the curse of having an extraordinary memory to absorb details and subtle changes at a precise moment but not the capability of abstraction needed to control our acts.It is in \n“The South”\n, \n“The Shape of the Sword”\nand \n“Three versions of Judas”\n where Borges’s metafiction is most palpable with the multiplication of character identity, combining historical facts with detectivesque narrative techniques.I think I can sense the lurking forces behind Borges’s mathematical concision, audacious adjectives and unusual ideas, I think I grasp his need to defy understanding to make his point about incomprehensible concepts such as infinite, time and reality. I even feel strongly attracted to the notion that reality can be seen as a mere convention and that the true nature of things is vacuous, existing only in conditional relationship with other things. It is language which ultimately creates illusion and builds meanings. And it is the dreamer who creates reality as the writer creates the possibility of a reader.The problem is that all these feelings didn’t implode in within me, I had to struggle against Borges’s detached, metallic style to get them through. Maybe I shouldn’t have read all the tales in one sitting, maybe Borges is that kind of author to read sparsely, one story at a time, like a rare, exquisite delicatessen to let all the flavors fuse and wholly impregnate the senses. It might not be very orthodox, but these three stars are meant to be a rating referred to my own inadequacy to truly enjoy this novel rather than directed to the novel itself, which I am not that fool to recognize as a genuine, exceptional work of art."}, {"userName": "Franco  Santos", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "Si alguien me preguntara quién es el autor con la mejor prosa que he leído, sin lugar a dudas contestaría Jorge Luis Borges. Cada uno de sus cuentos explota en lírica y bucea por existencias sutilmente cambiadas que te ofuscan en un mundo aparentemente conocido en el cual una magia utópica y soñadora es realidad.¿Es pesado? Sí. ¿Algunos cuentos, por no decir la mayoría, son casi incomprensibles? También: Borges nos ultraja nuestra capacidad de intelección. Aunque si después buscan su significado, van a encontrarle sentido a todo.Pero, a pesar de ello, les aseguro que leer a Borges es una experiencia, es un viaje que en su recorrido se pueden apreciar paisajes nunca vistos. Cada uno de los relatos de Ficciones te besa de manera diferente, y cada uno de esos besos te va a enamorar de manera diferente.Entréguense a este autor, a su mayúsculo vocabulario y a su sublime prosa; a la brillantez de sus historias y déjense caer para volver sin ser los mismos que eran antes."}, {"userName": "K.D. Absolutely", "userReviewDate": "Nov 08, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "For me, reading has always been like connecting your brain to that of the book's author. Since January of this year, I have already finished 100 books and I never had experienced delving into a mind as scintillating as that of Jorge Luis Borges, the Spanish author of this strangely amazing (or amazingly strange) book - FICCIONES which means FICTIONS.To understand the book, you really have to slow down and reflect on each phrase. It is different from reading Salman Rushdie who I find confusing because of the terms and phrases that maybe a Indian-English person can only understand. Jorge Luis Borges uses familiar words and phrases but they are often stated in confusing way so much like his \"forking paths\" with the thoughts going into different directions that you have to choose where you want to go or believe.His imagination is spectacular and limitless. It goes beyond the imagination of a child which is amazing considering that he was already past his middle life (working in as a director in a library) when he wrote this novel. Years later he lost his sight which I thought must have enhanced further his imagination. Entry in his Wikipedia says that he lived with his mother and he had a secretary to write down his thoughts in his twilight years.I agree that he must have felt bad not winning the Nobel. His literary style is far beyond advanced than what I saw (and liked) in the likes of G. G. Marquez, S. Bellow and J. Steinbeck. Again, if what is stated in the Wikipedia is accurate, he lost his chance for a Nobel because he got his earlier awards on writing from a communist leader, Pinochet.I remember a story my brother Tata J when I was in high school. It was about the song Vincent (starry/starry night...) which, according to him, actually referred to the painter Van Gogh. During his time, people laughed at his paintings because they \"could not understand\" them. This is the same as those people who rated this book less than amazing (five stars). They just don't know how to appreciate a mind as beautiful as that of Jorge Luis Borges."}, {"userName": "Teresa Proença", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "Este livro fez-me sentir com cérebro de pulga. Não sei se gosto disso……devo gostar pois, em vez de desistir, li e reli cada conto há média de um por dia e, até ao conto/dia seguinte, ia “ruminando” sobre o seu significado. No principio, ainda me iludi e convenci-me de que se fosse paciente e persistente iria ficar a entender, minimamente, o universo Borgeano. Qual quê! Quanto mais lia mais me afundava em confusão. Mas, estranhamente, também me sentia cada vez mais enfeitiçada com o livro, quer pelos temas abordados, quer pela forma como Borges o faz. Foi uma leitura difícil que me exigiu uma atenção absoluta tendo de, há mais pequena distracção, reiniciar o conto desde o principio.Alguns contos aborreceram-me um pouco (aqueles que menos entendi?); outros deslumbraram-me; e há um que, suspeito, me assombrará até ao fim da vida…Não vou falar de cada conto e tema(s) associado(s). Tenho lá eu competência para isso!(universo religião livros escritores labirintos sonho realidade Ficções…)Entretanto, já comprei mais uns quantos “Borges”. Tenho esperança de que no próximo a ler – O Aleph – me sinta, pelo menos, com cérebro de mosca…Nota: Isto de pontuar um livro com estrelas, por vezes, é muito complicado. Há livros em que a decisão é fácil (basta avaliar o grau de interesse que o livro me despertou); noutros - porque o grau de interesse e prazer que a sua leitura me suscita não é sempre linear - torna-se um “problema matemático” e tenho de ter em contas diversas variáveis, nem sempre constantes para cada livro. Bolas! Nem com fórmulas me consigo decidir…vai ter de ser com um-dó-li-tá…ou então, recorro mas é à estatistica, cuja moda é 5…(eu devo estar a ficar doida…tenho de ler menos…ou mais…)"}, {"userName": "[P]", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/40516522-p", "userReview": "I owe the discovery of El Matrero to Harper Lee. Five years ago I was spending the evening with my friend Renaldo Compostella, and, as was often the way, literature was our main topic of conversation. Renaldo, who always, or certainly more than I, kept an eye on forthcoming releases and bookish news, happened to mention the scheduled publication of a new novel by Harper Lee, the American authoress famous for To Kill a Mockingbird. The ensuing discussion was notable not for what we had to say about Lee and her work, but because it led Compostella to bemoaning the lack of specific details concerning the publication of the recently unearthed novel by Jorge Luis Borges. My friend, in so casually dropping this information into the conversation, must have thought that I was aware of such a discovery, but of course I was not. Borges wrote a large number of intelligent, speculative, metaphysical short stories, but he did not, to my knowledge, ever write a novel. Compostella expressed surprise at my ignorance and asked me if I had ever read Ficciones, a small [roughly 140 pp] volume of the Argentine’s stories, comprising two collections, The Garden of the Forking Paths and Artifices, in which, he said, the novel was first referenced. I replied that naturally I had read it, but that I did not recall any mention of a novel, either within the text itself or within John Sturrock’s introduction. My friend laughed and said that I must have skipped the footnotes. I assured him that I had not skipped anything, and, as I had a hardcover Everyman’s Library edition [Alfred A. Knoff, 1993] in my apartment, I took it down from the bookshelf and handed it to him, with the instruction that he find me the relevant page.Compostella opened the slim volume and, as it often the case when you pass someone a book, flicked through it, seemingly distracted from the matter at hand. Indeed, he was keen to talk about the story Tlön, Uqbar, Orbis Tertius, which he called a particular favourite. Compostella’s opinion was that it was about ‘Godlessness and playing God,’ which, despite my desire that he find the footnote in relation to Borges’ novel, piqued my interest. Tlön, Uqbar, Orbis Tertius involves Borges’ search for, or investigation into, a number of books that outline every aspect of an imaginary planet or civilisation, including their language, customs, psychology, and so on. It seems to me that the story is about many things, about language and how it directs thought or the way that one approaches your world, about the possibilities of human imagination, about mirrors and how different cultures are a distorted reflection of your own. Compostella conceded all of these ideas, but pointed out that prior to the invention of Tlön the only person responsible for the creation of a planet or civilisation was God; that if human beings start to create planets etc then God is unnecessary, because he becomes just another man. I was of course very interested in all of this, but, being aware that it was getting late, I had to draw my friend’s attention back to Borges’ novel. Compostella again flicked through Ficciones and came to a stop somewhere in the centre, in the middle of the story The Library of Babel. He turned one particular page, page 63, over and back numerous times. It is not here, he told me, by which he meant the footnote that he had seen, which, he assured me, was present in his own first edition copy of Ficciones, but was evidently absent from mine. At this point I considered it a fine joke at my expense, and bundled my friend out of the door.However, about an hour later my telephone started to ring. It was Renaldo Compostella. He told me that he had just arrived home, that he had dug out his copy of Ficciones, and had indeed found the footnote. Your copy, he said, must be subject to a printing error, or perhaps, as a later edition, the footnote had been expunged for reasons we can only guess at. I asked him to read me the footnote, which, it turned out, was very short: ‘Very soon I hope to complete and publish my own novel.’ Although this information, this promise or tease, was certainly interesting, my excitement was tempered by the lack of concrete information. I reminded Compostella that Borges was a writer who consistently imagined unwritten books, often even outlining their plot, like in the story The Approach of Al-Mu’tasim. I also pointed out that part of his appeal is that he did not draw clear lines between fact and fiction, that one was never sure in his stories what was true and what was not, because nearly everything he wrote appeared plausible. Moreover, Borges, so often described as an impersonal author, was actually the most personal, in that he almost always used himself and details about his own life as part of his fiction. So, it did not seem too much of a stretch to suppose that the novel he refers to is itself a fiction, an imaginary novel, and that the suggestion of its existence was part of a [not out-of-character] labyrinthian game he was playing. However, my friend replied that for years he had thought this too, but reminded me that it had recently been announced that the novel had been unearthed, and it was currently being readied for publication through Penguin in the UK and US. Well, this changed everything, of course. I asked him how I could find out more, and he said that if I googled Borges and El Matrero I was bound to turn up numerous articles, as the discovery was a big deal in literary circles. At this, I thanked Compostella and hung up the phone and switched on my computer.After googling the recommended terms I was introduced to various articles, including pieces in the Guardian, The Independent, Le Monde and El País. However, according to the articles that were returned by my search El Matrero was not written by Jorge Luis Borges, but by Pierre Menard, a previously unpublished protégé of the Argentine’s. At first glance, this suggested that my friend had jumped the gun, and was not perhaps in full possession of the facts, yet, being a fan of Borges’ work, and having read all of his collections numerous times, I was aware that the name Pierre Menard actually features in Ficciones as the author of Don Quixote. The story, called, in Spanish, Pierre Menard, autor del Quijote, appears to be about a fictional French writer, who re-writes Don Quixote word-for-word. The central idea being that this newer version, Menard’s, is richer than the original because it can be viewed in terms of more recent world events, by which we mean more recent than 1602, of course.In light of these articles, I was forced to ask myself, did Pierre Menard actually exist? Certainly, while one would assume that he did not, as Borges claimed, re-write Don Quixote, this naturally does not mean that, if he did exist, for surely he is dead now, he did not write the recently unearthed El Matrero. And yet if he did write the novel, why exactly is this a cause for excitement? It is worth noting that the story in Ficciones featuring Pierre Menard is, at least partly, concerned with authorship and plagiarism, is about who, if anyone, owns a work. So one might wonder, as indeed does Caroline Hurst in the Guardian, whether Pierre Menard is simply a pseudonym for Borges himself, that Borges wrote the novel as Menard, as one of his own fictional authors. Yet other commentators reject this idea, claiming, perhaps rightly, that as the footnote does not specify a title, or suggest a plot or theme, the novel referred to in Ficciones is not El Matrero.Even after a more extensive internet search I could not turn up any information relating to a writer called Pierre Menard, except in reference to the Borges’ story that has already been discussed. Therefore, I decided to reread The Library of Babel, which, as already noted, Renaldo Compostella claimed contained the footnote that first makes mention of a novel by Jorge Luis Borges. The Library of Babel, or La biblioteca de Babel, imagines the universe as a vast library, which houses every possible book, featuring every possible permutation of letters, and which, as a result, will contain many volumes of pure gibberish but also every possible piece of information, including that relating to the future and to your own life. If Compostella was to be believed, it would indeed make sense that it is here that Borges would mention the novel that he had apparently been working on, as it would, naturally, also exist within the library of Babel. However, the veracity of the information contained within the footnote now seemed even more doubtful. In the footnote, as passed on to me by Compostella, Borges mentions a novel that he hopes to complete and publish, but ‘hopes to complete’ only suggests that he has started it, when in fact he may not have put even one word down on paper. I may hope to complete a marathon, without ever taking part in the race. Furthermore, the library would of course still contain a copy of his novel, regardless of whether he had started it or not, because it contains copies of all books, past present and future.Weary of mentally going round in circles without any real progress I put the matter out of mind, and vowed to wait for the publication of Pierre Menard’s novel, El Matrero, hoping that this would make everything clear.*Postscript. Some months after the night described above, the novel El Matrero by Pierre Menard was published to rapturous acclaim, being voted the book of the year in many publications, newspapers, magazines. This critical praise was so intense that the public caught on, and Menard’s book was the year’s biggest seller. Indeed, Menard’s reputation became such that it was almost universally agreed that it was he, and not Borges, who had written Ficciones, The Aleph and so on, because only someone as talented as Menard could possibly have written those stories. Jorge Luis Borges, ran popular opinion, was merely a pseudonym for, a creation of, Pierre Menard, whose life has become the subject of endless speculation."}, {"userName": "Jim", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/6020795-jim", "userReview": "This collection of short stories is a great introduction to Borges' fictional universe. At times his stories read like a non-fiction article or book review, but Borges sort of sneaks up on you and gives a tug at your conception of what constitutes real versus imaginary.I would say that some of the stories are more engaging than others, but that's just a matter of personal interest. They are all worth reading, and recommended, especially to those who enjoy magic realism, fantasy, and sci-fi books."}, {"userName": "Linda Abhors the New GR Design", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/8619142-linda-abhors-the-new-gr-design", "userReview": "I'm more a fan of \"Artificios\" than the actual \"Ficciones\" collection, though \"El Jardin\" remains one of the better ones from Ficciones. Reading this collection for my Boston book club made me realize that, having taught Borges short stories over the years and reading for my exams as a graduate student, I thought that I had read all of them.But I hadn't; I encountered a few new ones here, namely \"The End\", which puts an end to the Martin Fierro story. So I've erased Borges from my \"read\" lists and will reread each anthology. Like Quiroga and Cortazar, he's been anthologized so often that one can find the same short story in several collections, thus making it seem as though you've read them all.I tend to like \"Artificios\" more than \"Ficciones\" b/c the stories in \"Ficciones\" are less what I consider short stories, and more Borges positing his new ideas/concepts. Several really don't contain any plot or plot twists, just the possibility of other dimensons/worlds. Great stuff, especially when you consider that they're his first stories ever, written after a severe head injury. But I do remember, both in grad school and now, \"skimming\" some of these. Once you've grasped the idea of what he's proposing (the infinite nature of the universe, chaos, the only truth is fiction, etc.) then there's really no need to determine whether or not text X truly existed, or whether Borges made it up. Wonderful to do if you have the time and are so inclined. I remember being frustrated/feeling guilty with this in grad school, thinking that I had to look up each and every reference to these works, or that I was less erudite for not knowing. Also, there's a new one every two sentences, so it really broke up the \"stories\". Now, I just get the concept and plow through a lot of those references. That's why I prefer \"Jardin de los senderos que se bifurcan\" and the stories from \"Artificios\"; they're more in the line of actual stories, that do contain a plot but also posit some of those same ideas and concepts (the way, for example, \"La muerte y la brujula\" is similar to \"Jardin\" in its structure, a variation on the same theme, if you will)."}, {"userName": "Xanthi", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/39404032-xanthi", "userReview": "Ο Μπόρχες με πήγε σε μέρη όπου δεν έχω ξαναπάει. Πήγα μια βόλτα σε έναν από τους αμέτρητους λαβύρινθους της φαντασίας του. Θέλω να επιστρέψω στις ιστορίες του ξανά και ξανά, σαν σε κυκλικό βρόχο, για να δω το επόμενο παιχνίδι της φαντασίας διαβάζοντας ξανά την ίδια ιστορία! Γιατί κάθε ανάγνωση χαρίζει και άλλη απόλαυση!"}, {"userName": "Emre", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/41725723-emre", "userReview": "Ne kitaptı be! Buraya ne yazsam eksik kalacak, o yüzden denemiyorum bile. Sadece, muhteşemdi."}, {"userName": "marco_izner", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/37078471-marco-izner", "userReview": "Ci vorrebbero parole e parole, infinite pagine, per descrivere quello che in realtà è un testo così poco voluminoso, costituito da piccoli tasselli, i quali sono però delle gemme, dei gioielli: ogni loro frase è un mondo, ogni sintagma può essere un indizio o un punto di svolta; un paragrafo potrebbe avere la densità di un romanzo, un racconto incarnare una tradizione, una intera enciclopedia apocrifa, l’eterno ritorno dell’uguale così come l’incapacità dell’uomo di comprendere la vastità dell’universo e di assorbire tutte le possibili declinazioni del sapere. Davanti a Finzioni – titolo migliore possibile per un’opera di tal fatta – e dinanzi a Jorge Luis Borges, il lettore deve scegliere se essere un semplice lettore o se trasformarsi in un devoto del Grande Signore della Letteratura. Sarà solo quest’ultima strada a fornirgli la chiave per capire le sfumature, i dettagli, gli inganni, i giochi, le trappole, le analogie, il divertimento; la perfezione e la bellezza nascosti, ma allo stesso tempo limpidamente rivelati da queste prose brevi, le quali possono essere lette come ognuna a sé stante, come più variazioni sul medesimo tema o quali fulgidi esempi di arte: della possibilità che anche l’essere umano ha di stupirsi e di stupire l’altro. Con queste premesse, penso sia arduo per chiunque descrivere un libro che parla benissimo da solo, pur chiamando a sé, per forza di cose, una valanga di commenti, riflessioni, chiarimenti; quanto meno, questo è ciò ch'è accaduto a me, che nel leggerlo in modo lento e ponderato ho riempito gli spazi bianchi delle pagine con domande e suggestioni; in gran parte dei casi, appunti, frasette che tentavano di riassumere il riassumibile, per paura di perdere il filo del discorso; per timore di non trovare l’uscita del labirinto. È inevitabile constatare quanto il labirinto incarni il nucleo di Finzioni: se avventurarvisi dentro è rischioso, poiché quasi impossibile uscirne e ritrovare la strada, il tutto si fa più decifrabile se lo si osserva dall’alto, in un disegno geometrico perfetto e comprensibile, dove il percorso diventa tracciabile ed eseguibile col solo utilizzo di una matita. Per questo motivo, all’apparenza banale, lo scrittore argentino può rappresentare un ideale ponte tra il modernismo e il postmodernismo a venire; ma siccome quest’ultima categoria non garba a tutti, e ad altri è quasi venuta sul gozzo, si può affermare che Borges è l’uomo dell’eterno presente che abita il passato, con un piede nel futuro. Un perfetto abitante della sua Biblioteca di Babele, la quale come lui racchiude in sé una sterminata conoscenza ed erudizione. Ma Borges è anche Pierre Menard, l’autore del Don Chisciotte, dunque il lo scrittore e il ri-scrittore per antonomasia, il creatore di apocrifi per eccellenza. Come scriveva Calvino, Borges è il campione della brevità, dell’efficacia; e io ci metterei pure della molteplicità, da non confondere con duplicità, la quale va troppo stretta all’infinitezza dei sentieri che si biforcano in queste Ficciones. Se Borges è l’uomo capace di far coincidere l’assassino con l’investigatore che gli sta dando la caccia, per lui sarà uno scherzo far sì che Giuda possa essere sovrapponibile alla figura di Cristo; ed essendo Cristo il Dio che si è fatto carne, Giuda è allora uguale a Dio? E a questo punto, Jorge Luis Borges è(ra) Dio? Da agnostico tendente all’ateismo, mi verrebbe quasi da risponder di sì, con nemmeno troppa ironia. Ma allora, dico io, noi tutti siamo Dio, almeno in potenza?Ecco, non sta a me né ad altri stabilire se Borges fosse o meno Dio: di sicuro, questo genio (un appellativo che nessuno potrà mai negargli) è un mago nel far scattare nel suo lettore tali cortocircuiti e vicoli ciechi. Del resto parliamo del signore del labirinto e dello specchio; colui per il quale chi legge deve fingere che i libri (fittizi) da lui descritti esistano sul serio; quello di Orbis Tertius, del sofisma delle nove monete di rame, dove se l’uguaglianza è congruente con l’identità allora le monete sono una soltanto: cosa che può accadere se si applica la geometria di Thlön, sia visiva sia tattile, che ha al centro la superficie e non il punto, secondo la quale l’uomo modifica le forme circostanti mediante il suo spostamento. Se poi Thlön è un pianeta inventato dagli uomini che ha invaso e sostituito il mondo reale, è pur vero che tale artificio prende il posto del caos esistente, ed è dunque decifrabile rispetto al reale. Thlön non riscrive un passato, ma il Passato; non un mondo, ma il Mondo; di conseguenza, Pierre Menard non riscrive il suo Don Chisciotte, ma il Don Chisciotte, che in automatico scavalca quello di Cervantes, pur essendo quasi identico ma più denso, più ambiguo, in un’ottica nella quale ambiguità è sinonimo di ricchezza. La tecnica di Borges-Menard è quella del reiterarsi dell’applicazione delle attribuzioni erronee, dell’anacronismo deliberato, per il quale si può giungere a credere che L’imitazione di Cristo parto di Celine o di Joyce; e che mette in discussione le discrepanze tra sogno e veglia, tra vita e morte, tra finzione e realtà. L’uomo è quindi consapevole della sua natura di mera apparenza, del fatto che magari c’è qualcuno che in questo momento lo sta sognando, dando ragione al Prospero della Tempesta shakespeariana il quale dice che siamo fatti della stessa sostanza dei sogni. E Borges aggiunge: siamo come la Lotteria a Babilonia; la nostra vita non è che una interpolazione del caos nell’ordine del mondo; fermo restando che per l’autore di Finzioni il mondo può comunque avere un senso ed esser spiegato, anche e soprattutto per mezzo dell’invenzione e dell’impostura narrativa, la quale, al pari dell’opera di Herbert Quain, può trovar posto nell’Universo, nella Biblioteca di Babele, all’interno della quale ogni voce può venir collocata; anche quella di ognuno di noi, quanto meno di noi europei, visto che «non c’è un europeo che non sia uno scrittore, in potenza o in atto». Un po’ come dire che chi impazzisce dietro ai testi letterari sia un possibile Uomo della memoria tale e quale a Funes. Dire poi a Borges che usa e sfrutta il tema del doppio sarebbe quasi offensivo. Lui, in effetti, reinventa il doppio rovescia i punti di vista: fa raccontare la storia di Vincent Moon da un’altra prospettiva allo stesso Moon, per far sì che questo, agli occhi del narratore – e del lettore -, non risulti un infame; un po’ come accade con Cristo e Giuda: il Traditore e l’Eroe che in fondo sono la stessa cosa, e qui ci si arriva sempre tramite il tortuoso ma ordinato percorso labirintico, che l’argentino architetta grazie all’armonia prestabilita leibniziana e agli eleganti misteri di Chesterton, riconfermando a più riprese l’immensa grandezza del suo sapere, la sua unicità frutto anche dell’ibridazione della sua educazione inglese frammista al suo essere comunque attaccato alla sua terra ispano-americana. Vogliamo poi discorrere del Borges che ferma il tempo per permettere a un uomo di completare la sua opera teatrale, facendo ritorno in un discorso nel quale il mondo (la vita, l’universo, tutto quanto), Dio, lo spazio e il tempo fanno da assoluti padroni. E cosa aggiungere alle quattro scarse (solo numericamente) paginette della Fine, dove la suggestione labirintica è per l’ennesima volta riproposta e trasfigurata nel ripetersi di un arpeggio di chitarra: una payada de contrapunto, una gara di canto e musica improvvisata, colonna sonora di un duello tra un uomo e l’uccisore del fratello; una figura per cui la sfida musicale diviene lotta all’ultimo sangue col coltello e viceversa, in una circolarità in bilico tra sogno e realtà, passato e presente, ordinario e meraviglioso, paralisi e movimento, concretezza, astrazione e infinita stasi del quotidiano. Bisogna esser dei maestri, ma anche dei mostri, per riuscire a sintetizzare tali innumerevoli elementi in un racconto tanto breve, come avviene anche nella Setta della Fenice, brano in cui si cristallizza la storia di una congregazione religiosa e di un suo rito riconducibile all’atto sessuale, spiegazione che lo stesso Borges confermerà in seguito (ma non dentro a questo libro). Il Sud, testo che chiude la racconta (perlomeno nell’edizione italiana dell’Adelphi, che contiene anche i racconti aggiunti in un secondo momento dall’autore, tra cui anche quello in questione), era uno dei favoriti dello scrittore tra quelli della sua produzione, probabilmente perché già dal nome lo si può leggere come una summa della sua poetica e della sua identità, non solo di letterato – sempre sia possibile fare una cosa del genere. Anche qui seguiamo le vicende di un personaggio irrimediabilmente scisso, in una sorta di sogno nel sogno, dove gioca un ruolo fondamentale lo stato confusionale e nebuloso di un uomo al quale sembrerebbe permesso di scegliere la sua morte: quanto meno, se viverla o sognarla. Opterà per una morte nella immensa pianura da lui già vista dal finestrino del treno: una morte romantica come quella di un suo avo. La simmetria e il leggero “anacronismo” sono l’asse portante del Sud, sviluppato su un continuo diramarsi di storie su storie, come la città che si “lacera” in borghi e sobborghi; uguale al volume (incompleto) delle Mille e una notte che il protagonista porta con sé tutto il tempo. Penso d’aver scritto abbastanza. Non me ne voglia Jorge Luis: lui avrebbe saputo dir tutto in tre righe, magari tirando in ballo anche Omero, Quintiliano, la Bibbia, Quevedo, la mistica ebraica, il romanzo d’appendice, Kafka, Dante, la filosofia tedesca e orientale, la letteratura inglese, Samuel Johnson, la metafisica, Poe, De Quincey, il poliziesco e così via. Se uno volesse terminare la lista, ci vorrebbero almeno un altro migliaio di parole e diverse centinaia di periodi: potrebbe davvero risultare un lavoro dei più infiniti. Immagino allora che la cosa migliore sia invitare ogni lettore del pianeta alla lettura di questo libro e del suo pazzesco autore. Per quanto mi riguarda, l’avventura nel labirinto di specchi può dirsi definitivamente iniziata."}, {"userName": "Edward", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/5895486-edward", "userReview": "The Garden of Forking Paths (1941)Foreword--Tlön, Uqbar, Orbis Tertius--The Approach to Al-Mu'tasim--Pierre Menard, Author of the Quixote--The Circular Ruins--The Lottery in Babylon--A Survey of the Works of Herbert Quain--The Library of Babel--The Garden of Forking PathsArtifices (1944)Foreword--Funes, His Memory--The Shape of the Sword--The Theme of the Traitor and the Hero--Death and the Compass--The Secret Miracle--Three Versions of Judas--The End--The Cult of the Phoenix--The SouthAfterword, by Andrew HurleyA Note on the Translation (from 'Collected Fictions')Acknowledgments (from 'Collected Fictions')Notes to the Fictions (from 'Collected Fictions')"}, {"userName": "Roy Lotz", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "17 August, 1967: I just finished Ficciones today. I also received it today. That is, today, three weeks ago; I mean, three weeks ago, today. (Three groups of seven, totaling twenty-one; or, in Arabic numerals, 3 x 7 = 21.)I read the book once a day, for each of the days since receiving it. (A total of twenty-one times; 21/1 = 21.) The first week, I read the book in a different mood per day. I started off neutral. The next day, I recalled annoying instances from my past to put myself in an angry mood. I followed a similar procedure to make myself sad, lonely, elated, etc.The second week, I performed a different experiment. I imagined myself in a different decade every day. On Monday, I was in the twenties; on Tuesday, the thirties; etc. The third week I experimented with different substances: inebriates, hallucinogenics, opiates. Today was simply nicotine. And now I’m finished.The book—which was given to me by one of my colleagues at the university—is a masterpiece of ambiguity. Every piece can take on an infinitude of different meanings; every sentence can make reference to any historical epoch, or follow the logic of any altered mental state. It is as if every point in time and space has converged in the pages of one book.It was written by one Jorge Luis Borges, who seems to have published nothing else during his lifetime. After failing to find out even the most basic information about the man, I asked the colleague who had given it to me. He said that he had received it in the same way I had—given by a friend.Postscript. 14 December, 1973: I moved two months ago. I only include this piece of trivial biographical information because, during my move, I happened upon this little volume again. I had, apparently, forgotten, and broken my promise to my friend to give the book away. Perhaps I subconsciously cherished it too deeply.But seeing the tattered thing, sitting at the bottom of an old, wooden chest, set off my curiosity. I decided that, when I was all settled, I would pursue this question of Borges to the very end.The answer took several days and nights in the university library. The first clue appeared as I perused a facsimile of the original handwritten manuscript. Something about it struck me as funny. I looked more closely, wracking my brain for what it was. Then, on a sudden, I had it: the handwriting. The handwriting of this book was the very same as another author: Vladimir Nabokov.This realization set me on the right path; I’ll spare you the sundry details of my research. It appears that Jorge Luis Borges doesn’t exist. He never existed. The book of short stories released under the name is a kind of literary practical joke. The culprit is not a man, but a team, which consisted of T.S. Eliot, Henry James, and of course Vladimir Nabokov. In the winter of 1915, the three met in Fleet Street, London; by chance, they had all decided to take a tour of Dr. Samuel Johnson’s previous residence (a national museum now).After their tour, the three went to a nearby bar. Amid the drinks and laughter, it appears a scheme was hatched. The premise was this: what if an author thought that, instead of books being about reality, reality was about books. That is, the mountains a kind of visual commentary on Plato; the oceans, footnotes to Tacitus. This thought amused the three authors so much, that they immediately set about creating this fictional writer.Thus, they divided up the stories among themselves, and set to work.* The final result ended up more splendid and magnificent than any had dared hope. The book was published, under the pseudonym Borges; it was felt that a Spanish name would attract less attention. Due to the obscurity of the author, the book enjoyed only a cult following. But the book's few readers report having life-changing experiences.It appears that the three authors attempted a second volume, but quickly gave it up. The first was too perfect to be surpassed. A disagreement between Nabokov and Eliot put a definitive end to any further hopes of the project continuing. *Unfortunately, it cannot now be precisely determined who wrote what. Several critics have since made guesses. The conceptual pieces are commonly guessed to be James’s; the absurdist stories the work of Eliot; Nabokov is often hypothesized to be a kind of redactor and scribe to the project. Of course, this is all mere conjecture."}, {"userName": "Sandra", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "E’ difficilissimo commentare questo libro. La maggior parte dei lettori lo definisce un capolavoro assoluto, un “classico contemporaneo”. Per me è stata una lettura assai complessa. Borges è uno scrittore per un lettore “erudito” –che non sono io-. Mi mancano le conoscenze letterarie di base per capirlo a fondo. E così scrivo di quel poco che sono riuscita a comprendere.Innanzitutto il titolo: andando avanti con la lettura ho capito il perché del titolo. Finzioni significa astrazione dalla realtà e immersione nell’immaginifico, nel fantastico. Non c’è nulla di concreto nei racconti contenuti in questo volume: il simbolismo e l’astrazione permeano ogni storia, a tal punto che la realtà fantastica sembra più vera della realtà stessa.L’emozione che ha suscitato in me la lettura di questi racconti è stata senz’altro l’ammirazione di fronte al Genio che scrive storie con una forza immaginifica insuperabile, che trascina il lettore in un mondo che sembra privo di logica ma che invece trova nella creatività dell’intelletto umano una logica superiore. Il mio atteggiamento di fronte ai brevi ma memorabili racconti è stato un “ohhhh” di meraviglia, come una bambina davanti a una cosa nuova mai vista prima. E così è stato per il racconto “Pierre Menard, autore del Don Chisciotte”: un don Chisciotte che sembra identico a quello di Cervantes ma è invece diverso perché “opera sotterranea,infinitamente eroica, impareggiabile”. Ugualmente per “la biblioteca di Babele”, una biblioteca dove c’è tutto ciò che è possibile esprimere in tutte le lingue del mondo, biblioteca che perdurerà anche dopo che la specie umana si sarà estinta: illuminata, solitaria, infinita, perfettamente immobile, armata di volumi preziosi, inutile, incorruttibile, segreta. E che dire de “la morte e la bussola”? Un breve racconto giallo che è, a mio parere, perfetto nella struttura .Al termine di questa lettura sono arrivata alla conclusione che è un libro da rileggere più e più volte, che va meditato e riflettuto. E che importa se alcuni racconti non li ho capiti, se ci sono riferimenti filosofici a Platone, Kant, Leibniz, Schopenhauer,Berckeley i cui nomi sono vaghe ombre nella mia mente, ricordo degli anni di liceo e nulla più, che importa se ci sono richiami ad autori stranieri che ignoro! Mi sono detta:”li capirò alla prossima rilettura…”"}, {"userName": "Eliasdgian", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/46058585-eliasdgian", "userReview": "Στο φαντασιακό σύμπαν του Μπόρχες απλώς αρμενίζεις. Χωρίς πλοηγό και μπούσουλα, ανοίγεις πανιά κι αφήνεσαι στο ταξίδι στους χωροχρονικούς λαβυρίνθους της σκέψης του. Πότε πότε απαντάς και κανέναν καθρέφτη, που άλλοτε δείχνει την αντανάκλασή σου κι άλλοτε το βλέμμα σου τον διαπερνά για να λαθροκοιτάξεις κόσμους παράδοξους, βιβλία κι επιστολές που χάθηκαν στην αχλή του χρόνου και που μια μέρα θα επιστρέψουν στην αγκαλιά μιας αιώνιας βιβλιοθήκης. Μυθοπλασίες του σήμερα, του χθες και του πάντοτε, διηγήσεις έμφορτες συμβολισμών και κάνα δυο ιστορίες αμιγούς μυστηρίου συνθέτουν το γίγνεσθαι τούτης της συλλογής διηγημάτων∙ και μια σειρά από διαφωτιστικές υποσημειώσεις του Αχιλλέα Κυριακίδη, στις οποίες χρειάζεται απαραίτητα να καταφύγει ο αναγνώστης, έστω κι αν είναι απολύτως αβέβαιο ότι θα μπορέσει έτσι να βγει από τον Λαβύρινθο [σημ.: σε συνέντευξή του ο πολυβραβευμένος μεταφραστής του συνόλου του έργου του Μπόρχες είχε κάποτε πει: «Ο Μπόρχες δεν θα σου διδάξει πώς να βγεις από αυτόν τον Λαβύρινθο – θα σου διδάξει πότε (και, κυρίως, πώς) να παραδεχτείς ότι χάθηκες»]. Τέσσερα αστέρια ή μήπως τέσσερις ψευδαισθήσεις αστεριών;"}, {"userName": "MJ Nicholls", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "The all-stars from this collection—‘The Library of Babel,’ ‘Pierre Manard—Author of Don Quixote’, ‘The Garden of Forking Paths’ and ‘Death and the Compass’, and so on comprise some of the finest and first pangs of the postmodern in book form. Reading the Sainted Borges feels at times like difficult math(s) homework or taking a primer in logical philosophy, and the dusty archaism of his references can make the stories feel like relics from the 18thC (both a plus and a minus), otherwise, the engaging fables and parodic quasi-academic pieces utilising the pomo hall-of-mirrors trickery are to be cherished, even if one is not convinced by Borges’s omni-importance among almost every living 20thC writer out there. This collection was absorbed into Labyrinths minus the stories ‘The Approach to Al-Mu’tasim’, ‘A Survey of the Works of Herbert Quain’, ‘The End’, and ‘The South.’"}, {"userName": "M. Sarki", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/5562041-m-sarki", "userReview": "http://msarki.tumblr.com/post/8547458...As I was reading these stories, these ficciones, I was wondering where I might have heard this Borges voice before. And as I read it seemed to me that each story was important in its own rank as if derived from a serious study of an ancient text or the pouring over of history books detailing in no small measure the accounts that made up the results of whatever was being set forth. Of course, because the original Ficciones were written in Spanish and then translated to English, the stories additionally allowed me to consider that some of the numerous facts and details presented were possibly “made-up” and mingled together with others which obviously were not. The entire practice of a Borges composition was basically lost to a reader like me who is not “up” on his ancient history and could no more in these given instances discern a truth from a bald-faced lie. Nonetheless, the stories were written and translated with such abundant grace and were so well-crafted their meaning mattered little to me as I was obviously in the presence of genius, which is such a joy to behold when it actually occurs to me. Still, it bothered me incessantly as each story ended with the same result of my not understanding what I had just read but enjoying it nonetheless. I am apt to want to quit on something I do not understand, but the words were too powerful and crafted for me to end our affair. Throughout my reading there wasn’t one story that made more of an impact on me than another, but taken as whole it reminded me by the end that another writer, a contemporary, whose voice I realized sounds just like Borges, or at least sounds like the translation of Ficciones that I am reviewing here. It felt a bit uncanny for me to think of my writer-friend Jason in light of reading a book written so long ago. I know Borges died blind in 1986 and was born in 1899. I know he originally published the first edition of this book in 1944 or thereabouts. Besides this unique voice I heard on every page, what made me think of my contemporary as I read Borges was that confident, loving tone of a very good teacher, a scholar relating something he found so interesting that he wants to excite us with his discovery too. The tone comes from a very nice man, a gentle soul who is humble and totally unpretentious even though his gifted presentation flies way over my head and is so far out of my league of understanding. Perhaps, for some readers of this text, understanding is not so hard to come by. But for me it was nearly impossible. In order to not frustrate myself I began to read these stories much as I read Gilles Deleuze say, and of course Jason Schwartz, and attempt to glean what I might from their words and simply enjoy the rest. I doubt there will ever come a time when I know enough history to connect more to these short stories, but I do know I expect I will not derive more pleasure in my newfound understanding than was my first exposure and initiation into this world. But lo and behold miracles do occur and the last story filled my void. The understanding that had been missing over the last days spent with all these Borges pages came headlong to me, and not delivered as I was present in my trance as I had been in while reading the stories prior to this last one titled The South. No, for this one, the last one, I was fully alive and awake for his scrumptious ending of the way life goes sometimes. But instead of topping my already generous day I was directed by a Borges order to press on, that silly, my time had not come, as neither the hero’s had nor his aggressor’s, and that a knife fight must and will ensue, and the results are not a given though perhaps it could be perceived as somewhat predictable."}], "description": "The seventeen pieces in Ficciones demonstrate the whirlwind of Borges's genius and mirror the precision and potency of his intellect and inventiveness, his piercing irony, his skepticism, and his obsession with fantasy. Borges sends us on a journey into a compelling, bizarre, and profoundly resonant realm; we enter the fearful sphere of Pascal's abyss, the surreal and literal labyrinth of books, and the iconography of eternal return. To enter the worlds in Ficciones is to enter the mind of Jorge Luis Borges, wherein lies Heaven, Hell, and everything in between. Part One: The Garden of Forking Paths Prologue Tlön, Uqbar, Orbis Tertius (1940) The Approach to Al-Mu'tasim (1936, not included in the 1941 edition) Pierre Menard, Author of the Quixote (1939) The Circular Ruins (1940) The Lottery in Babylon (1941) An Examination of the Work of Herbert Quain (1941) The Library of Babel (1941) The Garden of Forking Paths (1941) Part Two: Artifices Prologue Funes the Memorious (1942) The Form of the Sword (1942) Theme of the Traitor and the Hero (1944) Death and the Compass (1942) The Secret Miracle (1943) Three Versions of Judas (1944) The End (1953, 2nd edition only) The Sect of the Phoenix (1952, 2nd edition only) The South (1953, 2nd edition only)", "title": "Ficciones", "url": "http://www.goodreads.com/book/show/426504.Ficciones", "average": 4.46, "cover": "https://images.gr-assets.com/books/1388197956l/426504.jpg", "reviews": 1752, "authors": [{"url": "https://www.goodreads.com/author/show/500.Jorge_Luis_Borges", "name": "Jorge Luis Borges"}, {"url": "https://www.goodreads.com/author/show/34771.Anthony_Kerrigan", "name": "Anthony Kerrigan"}, {"url": "https://www.goodreads.com/author/show/223300.Anthony_Bonner", "name": "Anthony Bonner"}], "type": ["Fiction", "Short Stories", "Classics", "Magical Realism", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/426504.Ficciones", "http://www.goodreads.com/book/show/2307015.Ficciones", "http://www.goodreads.com/book/show/239598.Ficciones", "http://www.goodreads.com/book/show/16564.Fictions", "http://www.goodreads.com/book/show/2235497.Ficciones", "http://www.goodreads.com/book/show/20579877-fictions", "http://www.goodreads.com/book/show/30651149", "http://www.goodreads.com/book/show/18538650-fic-es", "http://www.goodreads.com/book/show/2223330.Ficciones", "http://www.goodreads.com/book/show/25084462-finzioni", "http://www.goodreads.com/book/show/3653644-finzioni", "http://www.goodreads.com/book/show/30713.Ficciones", "http://www.goodreads.com/book/show/17717.Labyrinths", "http://www.goodreads.com/book/show/5787.The_Aleph_and_Other_Stories", "http://www.goodreads.com/book/show/17961.Collected_Fictions", "http://www.goodreads.com/book/show/109237.Selected_Poems", "http://www.goodreads.com/book/show/16568.The_Book_of_Imaginary_Beings"]}