{"ratings": 465, "userreviews": [{"userName": "Steven Peterson", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/1677868-steven-peterson", "userReview": "In 1884, Charles \"Old Hoss\" Radbourn won 59 games for the Providence Grays. This is the story of that almost unbelievable season. It is also the story of a hard-nosed man in a rough and ready sport.The story begins with a brief biographical sketch of Radbourn, who grew up in Bloomington, Illinois. He enjoyed life in the Midwest, hunting being a favorite pastime. He also enjoyed baseball. We see the start of his career and his eventual signing a contract with the major league team from Buffalo. After a short-lived tenure there, he entered the major leagues next with the Providence team. We read of his feats in 1883, when he won a remarkable 48 games--and ended the season with a sore arm.1884 began inauspiciously, as Providence acquired a second strong-armed prima donna pitcher (Charlie Sweeney). Sweeney and Radbourn were not exactly bosom buddies, and much animosity existed between them, not helping the team chemistry. Radbourn's arm was stiff at the start of the season. How would he perform? This book captures the hard work, the success, and the pain of pitching so many innings (678 innings pitched in 1884--after 632 in 1883). To make a long story short, Sweeney bolted and Radbourn agreed to pitch almost every game with a sore arm if he were reimbursed appropriately. From that point on, he pitched in almost all his team's games.There is a rather tender (but thinly supported) talk of his romance with Carrie Stanhope, a woman with a probably dubious past. One of the recurring themes that is somewhat problematic of the continuing references along the lines of \"Carrie might have been at the stadium that night.\" The thinness of information on their relationship seems to impel the author to create something that he really has no evidence for.Radbourn never equaled the performance he had in 1883 and 1884. The author notes that his subsequent career was not so brilliant and that his wrecked arm prevented him from doing so well. But Old Hoss still won about 140 more games, so the statement seems somewhat of a stretch.The book closes with his brief and rather sad post-baseball life, graced by life with Carrie Stanhope. By now, his relationship with her is much better fleshed out.For those who want to know something about this amazing season, Edward Achorn's book will fill a void. Some questions for me: He does seem to stretch to fill in the relationship between Carrie and Old Hoss. Old Hoss still had a lot of success after the 1884 season. Finally, it would have been nice to have had Radbourn's career pitching statistics appear in this book."}, {"userName": "Brian Eshleman", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/5862823-brian-eshleman", "userReview": "Same game, different era, VERY different era. 59 is the number, and a number without mystery as it begins the title of the book. But after accompanying the last pitcher to get 59 wins in a season on his grueling odyssey to that total, the final tally manages to be surprising anyway.George Will's comment in Ken Burns' Baseball series that the early game was one played by tough, hard men who knew how much worse their other choices in life were seems appropriate to describe the book's hero as well as his teammates and opponents. Travel was arduous. Comforts were meager. Fans were violent. Management was calculating. Players were used for what they could provide in the immediate and then dispatched to experience life's other unfairnesses.I don't doubt that reconstructing the life of 19th-century ballplayers from florid newspaper accounts and scant corroborating documentation was difficult, but the author has done a remarkable job given his disadvantages. The reader feels as though he can relate to the players in the elements that to them more normal but to us as baseball fans 130 years later seem alien."}, {"userName": "Joel", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/9058325-joel", "userReview": "In 1884-the early days of professional baseball- a pitcher named Charles Radbourn won 59 games; a major-league record which is highly unlikely ever to be broken. He did this by pitching nearly every one of his team's games down the stretch, as they pursued (and eventually won) the National League championship; an insane workload, even for the time period (when pitchers were expected to work many more innings than they do today). He would get up in the morning with his arm so sore he couldn't lift it, but with methodical massaging and stretching and exercise, his arm would eventually loosen up enough that he could pitch another game.To anyone with an interest in baseball history, he is a legendary player; and yet, few know much about him as a person, or about his life beyond 1884. So this meticulously-researched book is highly welcome; and it successfully transforms the impressive statistics into a complex human being. For fans of baseball history, I would call this a must-read.The question is, how much interest would a non-baseball fan have in this book? For some people, I'm sure, the answer is \"none\". Part of what makes baseball history so interesting, though, is the way that it mirrors and sheds light upon the history of America as a whole; and a good writer such as Achorn makes sure to convey in detail the background of the times in which their chosen subjects performed. In the course of this book- set primarily in Providence, Rhode Island- we learn a great deal about what life was like in 1880s America; even readers who have little interest in baseball may find that worthwhile.The most unsatisfying aspect of the book is Radbourn's romance with the woman he loved (and eventually married); Carrie Stanhope, who owned a boardinghouse which may- or may not- have doubled as a bordello. Little seems to be known about their history together, and apparently none at all about what their relations were like in 1884; but that doesn't prevent Achorn from speculating. At various times he suggests that Stanhope may have attended some of Radbourn's games; that, in his darkest hours, he may have received advice and support from her; that his failure to attend a post-season celebration may have been because he and Stanhope were celebrating privately. He even suggests that Radbourn's exceptional efforts that year were his attempt to prove himself to Stanhope and win her love. Individually, all of these suggestions are plausible enough; take them all together, though, and one can't help noticing that Achorn has built this love story out of pure speculation. Still, we do know that they eventually did marry (and pretended to be married for years before that), so it's not as though there's no story there. Too bad the real story is irretrievably lost."}, {"userName": "Richard", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/1357580-richard", "userReview": "I enjoyed Achorn's \"The Summer of Beer and Whiskey\" about the baseball season of 1883, so I went back and read this earlier book of his, \"Fifty-Nine in '84\", that tells the remarkable story of one Charles Radbourn who now holds the major league pitching record of 59 wins (in a 114 game season). Actually, the book covers more than just Radbourn. It covers his entire team, Providence Greys, and all of the National League leading up to and continuing through the 1884 season. Achorn also spends a lot of time describing life in America in 1884, which I found very interesting.In style and technique, this book is similar to his later effort. If you only wanted to read one of the two, your best best would be to pick the teams you are more interested in: Providence and Boston (and to a lesser extent, Chicago) which would be this book, or St. Louis, Cincinnati, and Louisville (and to a lesser extent, Pittsburgh) which would be the \"Summer\" book. For a neutral reader, I'd say the books are equally good.As is the style these days, Achorn uses endnotes instead of footnotes. 1 demerit for that, but I didn't change my overall rating for the book because of it."}, {"userName": "Darrel", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/6217140-darrel", "userReview": "For all baseball fans who have dared to argue the unanswerable question - who was the best pitcher in MLB history? - I submit the name of Charles Radbourn. Written by Edward Alchorn, this book would have to be considered a landmark achievement in recorded baseball history. Such a season has 'Old Hoss' Radbourn had needed to be told and Alchorn had done a remarkable - even incredible - job of researching and telling that story here. He also vividly recreates the era of bare-handed baseball, the men who played it, the people who became MLB's original 'fanatics' and the differing layers of public perception of professional baseball at that time in American history. While this book may not appeal to the average baseball fan, any fan that wants to understand the development of baseball from it early roots as a fledgling professional sport to it's current recognized state as 'America's Favorite Pastime', this book will definitely provide some clear insight and pique your interest for more baseball historical reading."}, {"userName": "Bruce Niedt", "userReviewDate": "Jun 26, 2010", "userURL": "http://www.goodreads.com/user/show/2395303-bruce-niedt", "userReview": "One of the best baseball books I've ever read, this is a fascinating and thoroughly researched history of the early days of baseball, and the year 1884 in particular, when one \"Old Hoss\" Radbourn won 59 games as a pitcher, a record that will never be broken. The author describes in detail how the game was in some ways the same, yet in many ways different, from the game we know today. He follows Radbourn and his teammates through that amazing season when his Providence Grays won the National pennant and the first-ever World Series. Drawing heavily on the journalism of the day and later interviews with those involved, Achorn describes Radbourn and the people around him in detail, and he effectively sets the scene against the backdrop of late 19th-Century America, as it became increasingly urban and industrialized. I highly recommend this book."}, {"userName": "P.J.", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/4300835-p-j", "userReview": "If you are a baseball fan — especially of the history of the game — this book is for you.This is the tale of Charles “Old Hoss” Radbourn(e), who pitched the Providence Grays to the National League pennant in 1884. That he did that wasn’t just the story, however. It’s of how he took the Grays upon his back and carried them to the championship by winning 59 games (or 60, pending on sources) during the regular season. Despite pain and without the courtesy of modern training regimens, Old Hoss did something likely never to be duplicated in the game of baseball. (Or, base ball, as it was known back then).Edward Achorn takes us through a bit of Radbourn’s career, but specifically the 1884 season. His writing style is interesting, especially as he shows a bit of the 1884 “sportswriter” way of doing things. His research is deep and it shows that some things will never be uncovered as at times he has to presume or assume certain things, but makes sure to point out things like that. It was, after all, 1884 and I’m quite sure certain things were not recorded as they are today.Achorn takes us through Radbourn’s battled with fellow star pitcher Charlie Sweeney and manager Frank Bancroft. He gives us glimpses of some of Radbourn’s colorful teammates, such as catcher Barney Gilligan and first baseman Joe Start. In fact, Achorn gives us a solid glance for most of the 1884 Grays, showing some interesting folks along the way. He also does a good job in showing some great battles Radbourn and the Grays had with heated rivals the Boston Beaneaters and Chicago White Stockings (who would, eventually, become the Cubs).Old Hoss Radbourn was quite a character. Quiet and trying to stay out of the limelight, he was something else and he’s portrayed well in this book. The reader really gets a chance to dig into this person and get to know him as well as possible, considering he died before the turn of the century into the 1900s.If you love baseball history, this book is probably something you could delve into. It’s filled with interesting things from the game’s early years.Now for my thoughts…THE GOODI had been looking forward to reading this book for a while. I finally ponied up and got it for my Kindle (though I think a hard copy might be better, considering some of the items Achorn has picked out to have as images. Some of the things were hard to read on the Kindle, such as scorecards and such, but that’s not Achorn’s fault by any means).The research in this book is quite good. It really paints a good picture not only of what baseball was like in 1884, but what life was like in those times. Things weren’t easy. Baseball wasn’t easy. With no gloves, it was quite tough to play the game. Especially being as the National League, at that point, had switched to the new pitching rule to allow overhand delivery. Catchers took a beating. Players took a beating.This book shows all of that.The descriptions of the players, rivals and game was excellent. I could easily picture the stadiums, the players, the uniforms, the pitches and outs by the way it was written. It took me back to 1884, which is something I would want in a book like this.The best part of this book is the history, without a doubt. The game as it is today is nothing compared to 1884. It really shows one what the game has done over time to blossom and grow. If I could hop into a time machine and morph back to 1884 to watch a game between Boston and Providence at Messer Street Grounds, I feel I would be aptly prepared because of this book. I would gladly pay 50 cents to watch that game.THE BADThe book tends to get jumpy at times. With quite long chapters, Achorn bounces around a bit in each one. He’ll start on something, which will then lead to a side story or two. Then, he’ll pop back to the original story. At times, it got confusing and frustrating to read this style. It might have been good to have some sub-titles and such inside the chapters, just to break it up a little. I liked the side stories, don’t get me wrong, I just didn’t like that it seemed at times that they just showed up etc.And this might be the journalist/English teacher in me, but sometimes the writer would use a quote and say something like “Bancroft recalled…” I understand that the quote came from the research and from a newspaper or something along those lines, but I would have liked to have seen a little more attribution with it. To be fair, the back of the book has so much attribution, it’s not funny. Still, it’s something that was pounded in my head during college and during my years of working at a newspaper, so sometimes I cringe when I see things like that!OVERALL THOUGHTSAgain, I would highly encourage baseball history fans to read this book. It’s an excellent read. However, it’s not what I would call a “page turner.” It’s not one of those books that I couldn’t wait to get back to or would sit reading for several hours each night. With the long chapters, I often found myself reading one chapter in a night and calling it good. There were a few times I would go a couple of days without reading. But I was always interested in the next chapter and in watching how the season unfolded. I never wanted to stop reading the book, which is a good thing, and I did really enjoy it. It’s a slower-paced book that really gave a history lesson. For that, I was happy.RATINGOriginally, I wanted to give this something in the 3.5 range, but after thinking about it, I think it’s a solid 4 stars. It’s a strong read. Though the style, at times, is maddening, overall it’s a very good book and worth reading. Especially if you are a baseball or baseball history fan.On a side note, you can see Old Hoss in modern times on Twitter (@OldHossRadbourn)."}, {"userName": "James", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/5810205-james", "userReview": "Old-time ballplayers are often critical of today's pitchers, who are protected by pitch counts, bullpens, and the five-man rotation. Starters of prior generations worked on only three days rest and were expected to finish what they began. It wasn't uncommon in the 1960s for pitchers to log 20 or more complete games and upwards of 300 innings a season.What a bunch of wimps.Charles \"Old Hoss\" Radbourn started 73 games in 1884—and he finished them all. Radbourn established the big league record for wins that year with 59—in a 112-game season—while logging 678.2 innings. For most of the second half of the year, he was a one-man rotation. At one stretch Radbourn made 22 consecutive starts for the Providence Grays, winning 19 of them. This incredible campaign, in which he led his club to its second, and last, National League pennant, is chronicled in Edward Achorn's \"Fifty-nine in '84.\"The workload took its toll. Radbourn battled such intense pain late in the year he needed help from his manager just to get dressed. He was never the same pitcher in subsequent years, going 144-127 the rest of his career after winning 140 games and losing 56 from 1882-84. Jealous, stubborn, and driven by a rare offer of free agency, Radbourn fought through the pain on whiskey and guts until Providence clinched the pennant on Sept. 26 with nearly three weeks to play.It was a finish that seemed implausible in mid-July, when the club suspended Radbourn for throwing a game, suspecting he was on the verge of jumping to the upstart Union League. The temperamental star was in a snit because Charlie Sweeney, his fellow pitcher and rival, wasn't carrying his share of the workload. With the new league dangling big dollars in an attempt to lure him away, Radbourn considered leaving, a move that would have earned him a permanent blacklisting from the NL. Sweeney made the jump instead, clearing the way for Radbourn's run at immortality.As a reward, Bancroft offered his star his freedom at the end of the year. But Radbourn re-upped with the Grays, staying in Providence where he frequented a shady boarding house run by the lovely Carrie Stanhope. Achorn details the couple's relationship, from Stanhope's checkered past to their eventual marriage and premature deaths, both perhaps owing to syphilis.A native New Englander who has lived in Providence for 10 years, Achorn paints a vivid picture of life there in the 1880s. Crawling with prostitutes, and crooked cops who would allow them to operate, the city was a rough place, where one risked one's safety and wallet by walking around after dark. That Wild West flavor carried over into the ballpark, where Grays fans were renowned for their belligerence toward opponents and umpires.Not that some of the visiting players and arbiters didn't deserve the rude reception. Rival clubs from Boston and Chicago brought men who weren't above any dirty trick that would help them win a game. The umpires, who worked alone, were often cowed enough—or crooked enough—to let them get away with it.The game took a big step toward the product we know today with the legalization that year of overhand pitching, something many hurlers were illegally doing for several seasons already. Moundsmen were allowed a running start within the pitcher's box and released the ball from as little as 50 feet away from home plate.A longtime fan of 19th-century baseball, Achorn expertly captures the game's nuances, as well as the travails of its weary pitchers. The deputy editorial pages editor for The Providence Journal made extensive use of the archives of the Providence, Boston, and New York papers, but he didn't stop there, researching the genealogies of Radbourn and Stanhope and even digging into Sweeney's sordid family. He also spent quite a bit of time at the Rhode Island Historical Society, wanting to properly place Radbourn's accomplishments into the context of his era."}, {"userName": "Bruce Hesselbach", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/13517492-bruce-hesselbach", "userReview": "One of the greatest feats in sports history was the 60-12 season posted in 1884 by Old Hoss Radbourn. Although he is in the Hall of Fame in Cooperstown, and was celebrated in his day, modern baseball fans know little about him. This book changes all that. Achorn does a wonderful job of bringing Radbourn to life. Radbourn was feisty, rebellious, and crafty, a hard drinker and a hard worker. He had a great fastball and a good curve ball. He was an early pioneer of the screwball. Above all, he had pinpoint control and he was so unpredictable that batters were totally baffled. In 1884 he had a 1.38 ERA, pitched 73 complete games, and struck out 441 batters. After that, he pitched and won all of the games of the 1884 World Series. In his career he posted 309 wins. While the book does recount the excitement of the 1884 pennant race, it also provides a picture of the times. The love affair of Radbourn with Carrie Stanhope, and the tragedies that befell both of them, make this more than just a book about a forgotten baseball legend. There is one thing that the author does that I disagree with. In recent years it has been fashionable for baseball writers to recalculate and change the statistics of 19th Century baseball players. Thus, Hugh Duffy's record breaking average in 1894 is either .440 or .438, depending on the source. Some .400 hitters were demoted to hitting .389 or thereabouts. One 40 game winner has been demoted to a \"mere\" 39 wins. It often depends on the scoring: what is a hit; what is an error; what is an official game. In the case of Old Hoss Radbourn, Achorn decided that in one of Radbourn's 60 wins, where two pitchers were used in the game, the win should have gone to the other pitcher. Hence the title of this book is \"Fifty Nine\" instead of \"Sixty\". Since Radbourn's contemporaries scored the game to give him the win, since he has been credited with 60 wins for well over a hundred years, I think it is ridiculous to now come back and rescore the game to give him a lower total. Some baseball records will never be broken. Chief Wilson's 36 triples will stand as a single season record forever, because stadiums are not cavernous enough and long ball hitters are swinging for the fences and clearing them. Radbourn's record will never be duplicated because no team will ever dare to risk injury to their star pitcher by pitching him so often.  The turbulent times of the era have been well portrayed in this interesting book. The author does a remarkable job of uncovering facts to bring the legend to life for the attention that the former hero deserves."}, {"userName": "Donald Crane", "userReviewDate": "Sep 16, 2011", "userURL": "http://www.goodreads.com/user/show/5703279-donald-crane", "userReview": "Really interesting story primarily about Hoss Radbourn, a pitcher for the Providence Grays (a National League team at the time) in the mid-1880s, and how he won 59 games during the 112-game regular season. He started 75 games and completed them all, including 16-, 15-, and 14-inning games. He pitched 679 innings during that season, and had a 1.38 earned run average. For anyone who follows baseball and knows that starting pitchers now start 30-32 games a year and might throw as many as 240 innings in a season, rarely completing games, Radbourn's accomplishments are eye-opening... but not uncommon for his era.As the author describes it, Radbourn's shoulder and elbow at the end of the 1883 season were virtually held together with baling wire and sealing wax - likely having a torn rotator cuff at that point from overwork in 1883. His arm hardly had a chance to heal over the winter, and then he undertook his unparalleled season in 1884. So how was baseball different in its early days? The pitchers didn't toe a rubber, but pitched from a pitcher's box, and could do whatever they wanted for a windup as long as they delivered the ball from the box. Fielders did not wear gloves. Catchers, unbelievably, wore only fingerless leather gloves on their hands, no chest or shin protection, and only a rudimentary wire mask. (And catchers' hands were routinely mangled, fractured, contused, or lacerated from foul balls.) Hitters wore no batting helmets, and being hit by a pitch was simply \"no pitch,\" not \"take your base.\" (So pitchers could plunk batters at will, except that the pitchers also needed to hit in the game.)Amusingly, the author on more than one occasion references games in which the umpire (there was only one for each game) would wave his arms, halt play, and someone from the stands would emerge to present a large bouquet of flowers, or perhaps an oil painting, to a favorite player who had achieved above and beyond the call of duty in his recent play!As someone who grew up in Rhode Island, the descriptions of Providence in the 1880s were fascinating, though it didn't seem like the most savory place, with apparently rampant prostitution, gangs, and an overall wild west mentality. The general sense that came across was that most people had hair-trigger tempers and didn't hold back when they flared.This was a very entertaining and informative read, especially if you are a baseball enthusiast."}, {"userName": "Paul Pessolano", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/4877713-paul-pessolano", "userReview": "“Fifty-nine in ‘84” by Edward Achorn, published by Smithsonian Books.Category – Sports/Baseball Publication Date – February 22, 2011Okay sports and baseball fans, if I told you a pitcher won Fifty-nine games in one season would you believe me? Yes, it is true in 1884 a pitcher by the name of Charlie Radbourn did it for the Providence Grays. This was a time when baseball was played barehanded, yes, no gloves, barehanded.This book tells the story of baseball at its rawest. It was a sport that was brutal and bloody (remember barehanded). It was a sport that players not only hard drinkers but womanizers as well. It was a sport that had few rules and those were mostly ignored. If you weren’t cheating you weren’t trying. No one thought anything of trying to maim another player to get him out of the game. Many players were poorly educated, and gutter language was part of the game. Umpires were a sorry lot, many of them knowing only the fundamentals of the game and were not beyond calling plays based on their own likes and dislikes. Umpires were also taking their life in their own hands because it was not uncommon for the players and fans to accost them, sometimes beating them severely.Radbourn, like many pitchers of the time, was one of only two pitchers carried on a team. In his historic season, Radbourn was the only pitcher for Providence for over half the season. This means he was pitching just about every other day and sometimes days in a row.A great read for the sports fan that not only tells the story of the “greatest pitcher of all time”, but the early beginnings of our National Sport. It is interesting to see how some baseball lingo and rules came into being."}, {"userName": "Jack", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/1062937-jack", "userReview": "I lived in Detroit in 1968 when Denny McClain won 31 games for the Tigers. That was a big deal. While pitchers will break the 20 game mark, no one has reached 30 games since then.But go back 126 years ....This is a wonderful book with a ton of information about baseball in the mid 1880's and what American was like back then.. Charles Old Hoss Radbourn pitched for the Providence Grays -they were a professional ball club who along with the Boston Beaneaters, Detroit Wolverines, New York Gothams, Chicago White Stockings, Cleveland Blues, Buffalo Bisons and the Philadelphia Phillies made up the National League. The National League was the oldest professional baseball league at the time. In 1884 the Grays played 122 games (that is only league play. The also had dozens of exhibition games). Old Hoss pitched in 75 of those 112 games; he started 73 of those games.All 73 games he started, he completed. No going 6 1/2 innings and calling in a relief pitcher. You started a game, you were expected to finish the game.He pitched a total of 678.2 innings from a pitcher's box that was just 50 feet from home plate. By the way, foul balls did not count as strikes then. Today it's a big deal if a pitcher throws 250 innings.Of those 75 games, he WON 59, a record which still stands today. For 2 months, Radbourn was THE pitcher for Providence, starting every game. No three days rest. The only rest he had was on Sunday (no ball playing on the Sabbath) or when a game was rained out.It is a great story and the author Edward Achorn has a wonderful writing style that breathes life into the rough and tough baseball world of the 1880s.I loved it!"}, {"userName": "jersey9000", "userReviewDate": "Dec 02, 2012", "userURL": "http://www.goodreads.com/user/show/5239189-jersey9000", "userReview": "Allow me to preface this by saying I know nothing about baseball- either it's modern incarnation or this, early \"bare knuckle\" style. I do, however, love history books, especially ones that use a topic to branch out into deeper historical narrative. This book does exactly that; in the tradition of Salt and Cod (two awesome books, by the way), it uses the early growing pains of baseball to work through the growing pains of post Civil War America. Coming away from this book, I have a new respect for baseball, and a profound level of respect for these early pioneers of the sport. Any baseball fan should read this,and I think anyone who likes reading history stuff would enjoy this as well.The story of Old Hoss Radbourn is, quite frankly, amazing. The amount of determination, grit, and skill this man had is unbelievable. I also like the honesty of the author; he did not attempt to deify his subject in any way, and his flaws make him all the more compelling. I learned a lot about baseball, and learned more about America's \"coming of age\" years. I think this makes a great companion to The Great Oyster and would put this book up with one of my favorite history texts. Well done, sir."}, {"userName": "Jason Walker", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/1808061-jason-walker", "userReview": "While on the outside this appears to be a baseball book it really isn't. This is a 19th century Americana chronicle with sections devoted to temperance, tobacco, prostitution, politics, travel, the meat industry and life in general. Everything is framed around the pitcher Old Hoss Radbourn, his team, rivalries, the woman he loved and the team he threw for, the Providence Grays. He won 59 games in a single baseball season, something that will never be bettered. It's rare to have a 20 game winner now. But if that is the core the book really comes alive as the author brings in so many other aspects of life. As he read the microfilm for the sports section he must have also kept notes on the front pages and found the names of the other players in the book which include politicians, singers, tobacconists, parlour house owners, gamblers, owners, industrialists and all the filth that comes with being human and fallible. If you want some nostalgia and a good book, this one is fun and serious at the same time. The personalities jump off the page and seem like you have known them forever."}, {"userName": "Tim Nordstrom", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/5994185-tim-nordstrom", "userReview": "Fifty-Nine in '84 is a great biography of the man who holds the likely unbreakable single-season wins record for professional baseball. More interestingly, this book gives a great overview of the early days of professional ball, a gritty, blue-collar period when players used their bare hands, did anything to win (up to and including cheating, thanks to having just one umpire on the field), and often flamed out before they reached 30, their bodies battered from the abuse of the game. This is a great book for any baseball fan who wants to understand the origins of the professional game and what its early pioneers went through. Topping off a great story and solid writing are a slew of photographs of the players and the period."}, {"userName": "Paul Brandel", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/3985821-paul-brandel", "userReview": "Edward Achorn does a great job of writing about Charles Radbourn.He chronicles the rough and tumble era of baseball in the 1880s.Back then there was a 2-man rotation,not 4 or 5 man rotation!Ball players had to bereal rugged and durable,especially the pitchers. Also enjoyed the authorwriting about what was going in the New England area and the rest ofAmerica during that time period.  One of the best sports books I've ever read!"}, {"userName": "Al", "userReviewDate": "Jun 25, 2010", "userURL": "http://www.goodreads.com/user/show/1151318-al", "userReview": "If you like baseball history, this book is definitely recommended as it recounts the 1884 season when the game was in its infancy and played very much differently than today. Old Hoss Radbourn's season with the Providence Grays is chronicled as he set the single-season record for pitching victories which has never been surpassed. The author also provides an excellent look into life in America during the 1880's which makes the book even more interesting."}, {"userName": "Jarvis", "userReviewDate": "Dec 08, 2013", "userURL": "http://www.goodreads.com/user/show/26011382-jarvis", "userReview": "This is probably one of my favorite baseball books. We always here about the great baseball heroes of early 20th century: Babe Ruth, Ty Cobb, Hank Greenberg, etc. But we never here about the amazing players of the 19th century who endured so much more physically and economically. Its a telling story of how much baseball has changed in its hundred plus year history. The grittiness, passion, and athleticism of these forerunners of the great American pastime can't be forgotten."}, {"userName": "San", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/3024182-san", "userReview": "I love this book so much! It had baseball, which I love, but it also gave me an insight into late 19th century America and the drama of that time. Thoroughly recommended."}, {"userName": "Spiros", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/245237-spiros", "userReview": "An interesting account of an eventful season in professional Baseball (or Base Ball, as I believe it was still being called). An entente had been reached between the two Major Leagues, the older National League and the less hidebound American Association (Chris Von der Ahe's \"Beer and Whiskey League\"), whereby each would honor the other's contracts. At the same time St. Louis millionaire (amazing how everything seemed to come out of St. Louis) Henry V. Lucas had created an upstart League, the Union Association, which was threatening predations on the two established Leagues (Bill James, in a long chapter perplexingly located in the 1870's section of  The New Bill James Historical Baseball Abstract, puts paid to the idea that the Union Association ever was a Major League). And the 1884 season concluded with the first World Series, a three game exhibition between the National League Champion Providence Grays and the American Association pennant winning New York Metropolitans. Standing prominent in the events of the Season were two Providence Gray pitchers, the established Charlie \"Old Hoss\" Radbourn (or Radbourne), a consummate veteran, and Nuke LaLoosh-like upstart Charlie Sweeney, a hard drinking rookie from San Francisco. The two men could obviously not exist in the same 8X8 clubhouse, and the enmity between the two came to define the Grays' campaign.On the whole this is a pretty good account of that season, ably set in the social context of life in New England and America of the time."}, {"userName": "Dan", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/2568078-dan", "userReview": "Enjoyable story of the 1884 baseball season focused on \"Old Hoss\" Radbourn, who won 59 games that year. The baseball story is great, but what makes the book is how diligently Achorn recreates the time. Lots of interesting facts: the origin of the term 'bleachers', how before deciding on uniform numbers baseball tried to get each different position assigned a uniform color; also, lots of interesting facts about America in the 1880's---a much more dangerous place than America in the 2010's. One anecdote concerned another star pitcher who dropped out of baseball due to alcohol and ended up getting in a bar fight and firing 13 shots from his pistol into the bar....and got off when the matter was discreetly dealt with by the police."}, {"userName": "Terry", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/559251-terry", "userReview": "Having selected this book to revel in stories of barehanded baseball and the remarkable achievement of Old Hoss Radbourn, I was rather impatient with the lengthy excuses into the social history of the 1880s. The second half of the book was admirably focussed and delivered a vivid picture of a game that was radically different, yet surprisingly similar, to today's style of baseball."}, {"userName": "Adam", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/19119431-adam", "userReview": "Could do without the Carrie Stanhope portions that are pure speculation. Interesting stories of 1880s baseball but not written in a very compelling way."}, {"userName": "Todd Stockslager", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/43477226-todd-stockslager", "userReview": "Glory DaysWhile Springsteen's can't-let-go friend \"could throw that speedball by you, make you look like a fool boy\", 19th-century Major League baseball's best pitcher set his amazing record with a mixture of speed, guile, and strategy. That record--winning 59 games in 1884--is so far beyond today's numbers that fans today can barely relate.But baseball, as Edward Achorn does a good job documenting for us, was a different game, starting with the barely--bare-handed fielders, mound-less pitchers, helmet-less hitters, and sometimes fence-less outfields made for a very different game. The softer ball kept in play for a full game made long drives and home runs rare. Pitchers started almost every game they finished. Substitution was only allowed for injuries, so replacing a pitcher meant bringing a position player to the mound and banishing the disgraced pitcher to that player's vacated spot.Even the travel and weather conditions were different then--the great volcanic explosion on Krakatoa on the far side of the world resulted in the coldest and wettest summer in memory, keeping crowds down and resulting in games played under cold, wet (further reducing the ball to mush as the game progressed), and windy conditions all summer. And road trips meant long train rides sitting up in coach--owners wouldn't cut into profits to pay for sleeper berths; trips to Chicago and Detroit (the distant \"Western\" division teams then) took three days.Achorn documents all these differences from today's game, not to diminish Radbourn's accomplishments, but to distinguish them. After a brief biography of the Old Hoss, the rest of the book is a game by game journey through Radbourn's glory days--which started with his arm in agony and some question whether he would even be able to pitch in '84 after \"throwing out\" his arm in the previous year. In between game accounts, Achorn weaves accounts of the players, the teams, the towns, and the fanatics of the 19th Century Major Leagues. It becomes clear that baseball was \"America's game\" then and for decades to come not just because of its popularity but because of its perfect mirror of the best and just as frequently the worst of America.Perhaps the weakest part of Achorn's story is the outside-the-lines account of Radbourn's relationship with the widow Carrie Stanhope. This isn't due to his writing abilty, which is fine, but to the lack of historical documentation, a problem that lurks in the background through the entire account. While Achorn has done a superb job of researching the official documentation of the era (newpapers, government and business records, and formal letters), the lack of extensive personal anecdotes and documentation is reflective of both the absence of celebrity reporting in the time, and of the fact most athletes would hardly have been considered celebrities in those days anyway. So Achorn does what he can with the thin documentation of Radbourn's relationship, but it is mostly speculation. Knowing the players of the era, what they thought and felt and how they lived outside the lines, remains the realm of fiction.Between the lines, Radbourn and Achorn shine. The game-by-game pitching lines of Radbourn's season in the appendix, couched in the universal and timeless baseball language of statistics we can understand and relate to today's game (as much as the game has cuanged in the 125 years between, the numbers never change), document the amazing season in powerful specificity. The game has changed, but Radbourn remains one of its greatest pitchers, of any era. Thanks to Achorn for bringing him back to life for a few more Glory Days."}, {"userName": "Brian Meehl", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/3107323-brian-meehl", "userReview": "This is a great peek into the story of a phenomenal pitcher, an eccentric team, a wild season, and an era of baseball that is barely imaginable and so entertaining compared to the sanitized era of baseball today."}, {"userName": "Jeremy", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/1310936-jeremy", "userReview": "Sometimes you read a book and it blows your mind.In the 1880's people played baseball barehanded. Pitchers routinely threw more innings in a year than modern pitchers throw in three. And they didn't throw significantly slower or with less trauma to their arms and they didn't have talented orthopedists, whirlpools, or even the concept of icing down after a start. Twenty wins in a season was considered mediocre. Now twenty wins is phenomenal. Careers were brutally short.It's in this context that Charles \"Old Hoss\" Radbourn was regarded as the best pitcher of his era. Some say he's the best of any era. He won 59 games in 1884 while pitching in constant pain, leading the league handily in wins, ERA, and Ks. In one stretch he pitched in something like 20 STRAIGHT games and won 18. He single-handedly carried the Providence Grays to the NL pennant and then won all three games of the first World Series. If there is a more amazing sporting feat, I haven't heard it.Achorn's book was eye-opening to say the least. It revealed characters and events that I had no idea about, even as an avid baseball fan. I am moderately obsessed with the '300 win club' and can't tell you how many times I've scanned that elite list and looked over Charles Radbourn (309 wins) and written him off as so many modern sportswriters do as a 'deadball' pitcher. As if that somehow detracts from his greatness. I think that fact only adds to his greatness. Pitchers from this era were expected to pitch every game (or every other, at the very least) from start to finish, including extra innings. On their off days they were expected to play in the field (usually the outfield) since substitutions were illegal and if the starting pitcher got into trouble he couldn't be taken out of the game and would have to be swapped with someone already in the lineup. They had to field a number of positions and be pretty good with the bat as well. The very best, like Radbourn, actually hit above .200 which is not stellar, but is certainly better than most modern pitchers. Imagine playing the most grueling position on the field day in and day out while still being that productive at the plate. It staggers the mind.All in all a great read that really brings the deadball era to life, though I think there's little reason for non-baseball fans to read it. Notwithstanding Achorn's working in of Radbourn's romance and a historical view of Providence and America as a whole at the turn of the century, it is a book simply and purely about baseball and an amazing baseball player."}, {"userName": "Brian Sauer", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/18115634-brian-sauer", "userReview": "What a great read. This was a really good look into baseball in the 19th century. My first taste of it and I loved it. I'd recommend this book to anyone that loves baseball and/or wants to know more about life in the late 19th century. It was really well written and shows how folks were not that much different then than they are today."}, {"userName": "Bob Andelman", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/1836449-bob-andelman", "userReview": "I love baseball. I grew up a New York Mets fan and stayed with them until St. Petersburg landed the Rays a dozen years ago.When I was a kid, I read dozens of baseball histories, from biographies of individual players such as Mickey Mantle and Babe Ruth to overall histories of the game. I was never a great baseball player in the sandlots, but I loved it nonetheless.I even wrote a book, Stadium For Rent, about the Tampa Bay area’s 20-year effort to land the team that eventually became the Rays, so I know a little about researching the past.But I would never have imagined myself writing the biography of a once outstanding 19th century pitcher now obscured by the accomplishments of thousands of ballplayers who followed him.That, and the fact they just didn’t write down sports and biographical details 125 years ago the way we do now.But that didn’t stop Providence Journal deputy editorial pages editor Edward Achorn. A baseball fan and historian, he heard about the amazing accomplishments of one Charles “Old Hoss” Radbourn and became obsessed with rooting out more details and sharing his story with a modern audience. His new book, Fifty-nine in ‘84, captures a bygone era in ways that few baseball fans could have imagined.I hope you will listen to my Mr. Media podcast interview with Achorn, available here: http://mrmedia.com/2010/08/cy-young-o..."}, {"userName": "C Baker", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/25295401-c-baker", "userReview": "I am fascinated by professional sports in the late 19th and early 20th centuries. While the players may not have been as big, fast, or strong and modern athletes, they seem a thousand times more rugged and tough. This book focuses on a pitcher who played in the barehanded era who holds the professional baseball record for most wins in a season at an unbelievable 59. Charles Radbourn, or “Old Hoss,” played from 1880 to 1991, mostly with the Providence Grays. In 1884, pitching nearly every day, which is something I can not even fathom, he compiled his 59 wins. This book is mostly about the life and playing days of this taciturn hero, mostly forgotten by all but the most studied baseball historians.But the book is more than a biography. It also provides a glimpse into what baseball was like in an era where pitchers pitched frequently, you caught the ball with your bare hands, and violence and dirty tactics on the field of play were the norm not an aberration. To sit back and think what a rugged, brutal, physically demanding, and even debilitating game baseball was in the late 1800’s is simply mindboggling.This book is an excellent addition to baseball history. While the author does provide a bit more day to day detail than was probably needed, it is a fascinating read and one those who love baseball history should enjoy."}, {"userName": "Bob", "userReviewDate": "Nov 29, 2010", "userURL": "http://www.goodreads.com/user/show/3521339-bob", "userReview": "The story of a pitcher who won 59 games in one season, would flip off photographers, and even inspire one of the funnier fake Twitter feeds around now (@oldhossradbourn) had never been adequately told. Achorn gives it a good shot, but the book seems padded with information about life in Providence in the 19th Century that doesn't seem to add a lot of insight. Radbourn was not a well-educated man, so there isn't a lot of primary source material.Achorn relies heavily on the newspaper accounts of the time (1884), which are often a bit fanciful in their descriptions of games. There is a lot of information on syphilis in the 19th Century, although it's not any more graphic than watching an HBO series.The 1884 NL pennant race was far from dramatic, which makes Radbourn's quest to pitch in nearly every game for his team down the stretch more a case of his manager just not wanting to spend the money to get a second pitcher after the other pitcher on the team, Charlie Sweeney, was kicked off of it after several bouts of insubordination combined with drunkeness."}], "description": "In 1884, Providence Grays pitcher Charles \"Old Hoss\" Radbourn won an astounding fifty-nine games—more than anyone in major-league history ever had before, or has since. He then went on to win all three games of baseball's first World Series.   Fifty-nine in '84 tells the dramatic story not only of that amazing feat of grit but also of big-league baseball two decades after the Civil War—a brutal, bloody sport played barehanded, the profession of uneducated, hard-drinking men who thought little of cheating outrageously or maiming an opponent to win.   It is the tale, too, of the woman Radbourn loved, Carrie Stanhope, the alluring proprietress of a boarding-house with shady overtones, a married lady who was said to have personally known every man in the National League.   Wonderfully entertaining, Fifty-nine in '84 is an indelible portrait of a legendary player and a fascinating, little-known era of the national pastime.", "title": "Fifty-Nine in '84: Old Hoss Radbourn, Barehanded Baseball, and the Greatest Season a Pitcher Ever Had", "url": "https://www.goodreads.com/book/show/7662052-fifty-nine-in-84", "average": 4.03, "cover": "https://images.gr-assets.com/books/1348417570l/7662052.jpg", "reviews": 74, "authors": [{"url": "https://www.goodreads.com/author/show/3350672.Edward_Achorn", "name": "Edward Achorn"}], "type": ["Sports", "Sports and Games", "Nonfiction", "Biography", "History"], "outlinks": ["http://www.goodreads.com/book/show/7662052-fifty-nine-in-84", "http://www.goodreads.com/book/show/8618896-fifty-nine-in-84", "http://www.goodreads.com/book/show/11470835-fifty-nine-in-84", "http://www.goodreads.com/book/show/16043552-the-summer-of-beer-and-whiskey", "http://www.goodreads.com/book/show/17819679-inventing-baseball"]}