{"ratings": 8959, "userreviews": [{"userName": "Angela M", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "As it is in most books about the holocaust, there are scenes in this book that are so difficult to read but it is rightly so. Even after so many years, it is still so important that we are reminded of these horrific acts. Mothers are torn from their children; women are herded off the trains and told they would be reunited with their children after their shower which we know was the gas chamber; children are shot at point blank range. We need to remember that even though this is a novel, these things happened and I thank the author for reminding us.Christopher, born in Germany and raised on the island of Jersey, falls in love with Rebecca, the Jewish girl that he has befriended since they were six. When Rebecca is taken to a concentration camp in Germany, Christopher because he is German decides to fight for the Reich. But his motive in joining the SS and working for the Nazis is to find and save Rebecca, the love of his life. When he is told that she is dead, Christopher uses his position and cash that he has access to because of his job as accountant of the valuables of the Jewish people coming into the camp, to try and save as many women and children as he can from the gas chamber. This did not seem too far-fetched to me because we know that in real life there were Germans who helped save Jews.This is not just a story about the holocaust, but it is a love story and it is one that reflects a sense of the goodness of people and a sense of family. So why three stars? I would give it three and a half stars if I could , but there was just something lacking in the writing for me. The style was too simplistic at times and just didn't convey the emotion I wanted to feel from these characters. The story itself was compelling and there are some memorable characters. I would recommend it because it retells an important time that we shouldn’t forget.Thanks to Lake Union Publishing and NetGalley."}, {"userName": "Michele Whitecotton", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/7388454-michele-whitecotton", "userReview": "This book was like a rare gem that you aren't looking for, but just stumble across by mistake. I had never heard of it or the author before and it showed up on the free kindle book list one day. I'm usually not a fan of love stories but I'm facinated by the Holocaust so I decided to give it a shot and it turned into one of the best books I've read in a long time. It wasn't a cheesy-romance kind of love story, it was a beautiful heartbreaking love story that spans several decades. It literally breaks your heart. It starts out when they are children and progresses through one obstacle after another. I think the message here is that love can withstand even under the most dire of circumstances. Aside from the love story, this book is also a history lesson. It goes through the motions of WW2 and eventually ends up at Auschwitz. It gives a first person look at the camp thru the eyes of the SS. It describes the monstrosities of everyday life at the camp being told by someone who hates every minute of it. The character, Christopher, shows us the lies, the death, the complete disregard of human life while struggling with all of it. Unlike the other SS men, he hates everything about it and is only there for one reason....to find Rebecca. I would give this book 100 stars if I could. I can't possibly stress enough how wonderful this book was or how much I loved it. It was stellar and I highly recommend it."}, {"userName": "Alona", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/10731908-alona", "userReview": "So, I thought I am doomed to automatically love any WWII book... In this book I did not feel the connection between the two MCs and I could not feel for them the way I should have.The story line, of a Jewish girl and a German, childhood friends, that falls in love and what happens to them during WWII, should have captivated me, but it failed to do so.It got better at around 80% but then it failed, for me again, with an ending that was rushed and not as emotionally right for the story.Shame :("}, {"userName": "Becky", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/2453991-becky", "userReview": "I'll read most anything about World War II and the Holocaust, specifically, because I find it morbidly fascinating. So obviously this book was appealing and with the good reviews, I figured it would be a win.This book is about Christopher, a German national living on an island that is considered Great Britain's territory, and Rebecca, a Jewish national. They meet as children and develop a close friendship sustained throughout the years, and Christopher's family becomes Rebecca's replacement family in lieu of her often drunk, abusive parents. Rebecca eventually leaves the island to escape their treatment, but eventually returns to reunite with Christopher. This is right around the time Germany takes over the island they're living on, and while Christopher tries to protect her, eventually Rebecca is registered as a Jew and is forcibly removed from the island. When Christopher learns that she would have been sent to a concentration camp, he pulls some strings to get himself sent to Auschwitz as an SS officer. While there he desperately searches for Rebecca while trying to maintain his sense of self and help as many Jews as he can. But will he find Rebecca alive, and even if he does, will she be the same Rebecca who left? I found sections of this book to be very moving and well-written; specifically the descriptions of the concentration camps and the treatment of the prisoners. I felt the love story between Christopher and Rebecca to be a bit stilted and awkward, and although it was supposed to be the focal point of the book, I got much more enjoyment out of Christopher's time at the concentration camp and his efforts to aid the Jews in his care. It seemed as though the author themselves felt more at east with the historical fiction writing than the love story. Would still recommend for those interested in World War 2 fiction!"}, {"userName": "❤Marie Gentilcore", "userReviewDate": "Oct 28, 2014", "userURL": "http://www.goodreads.com/user/show/8707630-marie-gentilcore", "userReview": "I am so glad to have won this from Goodreads First Reads! It was an excellent book that I enjoyed very much even though it was sad to read about the atrocities at the concentration camp. The story starts out harshly with Christopher as an SS officer at Auschwitz. Then, we are taken to the beginning when a young Christopher first meets Rebecca on the isle of Jersey. Theirs is a deep friendship and love, but outside forces strive to keep them apart, first Christopher's father and then World War II when Rebecca who is Jewish is sent for relocation. As the story progresses we learn why Christopher became an SS officer and all that he has done to find his beloved Rebecca. This was a beautifully written book. I look forward to more by this author."}, {"userName": "Shannon", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/2035107-shannon", "userReview": "I just finished Finding Rebecca and all I can say is \"WOW\". It was extremely hard to read some of the scenes, and not because they were overly graphic, but because it left a mental picture, and a feeling of overwhelming sadness to think that this really did happen. And it was just a small glimpse of the horror that took so many innocent lives. I think that everyone should read this book, and never forget what kind of brutality really went on at those concentration camps. Well done Mr. Dempsey!"}, {"userName": "Krista", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/7350563-krista", "userReview": "I wanted to like this book, I really did. I've read a lot of WWII historical fiction novels, I don't think I've ever rated one a one star before. Until now that is.... This book had such great potential, however, the characters had no depth, no feeling. They read like robotic characters with no emotion. The relationships in the book, whether it be a parent, a love interest, a fiancé, a spouse, an abusive parent, had no emotion. It was like the author was trying to purposely put no emotion in his book.Then, I couldn't understand, one of the main characters Rebecca. She didn't care about anything. There is a war going on around her, (an emotionless war according to the author). People are telling her there are people/Jews starving, dying, being taken away. Rebecca is Jewish. Still she is a brain-less idiot about the war. \"I want this to be over\" she says, \"I want to ride my bike\", \"I want to live my life\" and darn it, \"I don't care if they take me away or kill me\". Ok, well if they take you away or kill you, you can't do those things! \"I will be safe\", \"what's the worst they can do\", \"I want to live\", \"I want to be here\", \"I want to have a life\" she says. Really? You do understand what everyone is telling you right? There is a war going on!!!!!!! There is people/Jews being taken away and killed... \"I want to ride my bike\"!!! Oh my goodness really, you are void of emotion. Even a lack of caring for yourself. It's like the lights are on but no one is home or listening or seeing! It's very annoying.....Then when you think she can't be less unrealistic in this setting. She has an unrealistic relationship with her abusive father. One second she left because she can't be beaten anymore, then she is back to live with him, then she leaves, then she loves her abusive father no matter what, enough to risk her life to warn him (oh wait she doesn't care, eye roll). She is not only void of emotion, unrealistic, now add a confused over grown child that cannot make her mind up if she was abused or not? I think the author really needs to research people who are abused in life and how they really act. Also fear, Rebecca is fearless. Not in a good way, but that is not surprising with a girl with no emotions. By now you know all the reasons why I don't like this book and had to stop reading it. Oh, wait there is 1 more! This is the first WWII book that drags and drags and just when you think it can't drag anymore....your asleep! Overall, I tried to make it to half way through, to give it a better review. But the further I got in the less I couldn't stand it! I want to add a song to this book, Mr. Roboto!!! (for all you 80's fans) Words of advice historical fiction fans, save your money and your time."}, {"userName": "Ange H", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/21166492-ange-h", "userReview": "THIS REVIEW CONTAINS SPOILERSThis was an infuriating book. The concept was fascinating; but it contains a central plot hole that is so huge, and bothered me so much, that I forced myself to finish just to see if the author explained it somehow. He did not.The story focuses on Christopher and Rebecca, who have known each other since their childhood growing up on an island off the coast of England. He is German, she is Jewish. Besides the plot hole mentioned, the love story between them lacked heat and didn’t provide the emotional core needed.These two main characters continually act in ways that threaten not just their own best interests, but their survival. As the Nazi occupation spreads toward them, Rebecca refuses to leave for a safer location to wait out the war, as Christopher keeps asking her to do. Christopher and his father, as German nationals, are pressed into service for the Fatherland when the takeover finally comes. With this cover, they are able to keep Rebecca hidden - until she idiotically takes it upon herself to march down to Nazi headquarters and register as a Jew, putting both herself and her protectors in danger. She is quickly deported. Christopher is devastated by the loss of the love of his life. He and his father are at least suspected to have hidden a Jew, and although they lose their assignments they are not punished more harshly, which doesn’t ring true based on what we know of Hitler’s regime. But even more incredible, when we next meet Christopher, he has somehow risen through the Nazi ranks and scored a plumb assignment at the Auschwitz concentration camp. His plan is to find Rebecca and bring her to Auschwitz so he can save her. It would seem to be obvious to absolutely EVERYONE in the world except for Christopher, that he needed to make sure he had lots and lots of allies within the extremely corruptible walls of Auschwitz. He was put in charge of “Canada,” the part of the camp responsible for receiving the inmates and collecting all valuable, which put him in an ideal position to bribe and grease all the palms that would be needed for his audacious plot to have any chance of success. This is where the huge plot hole I mention comes in. Instead, of capitalizing on this golden opportunity, he soon notices that everyone in camp is skimming off their share of the loot. So he establishes strict new procedures and organizes raids to weed out all the cheating. Why for the love of God would Christopher do this? It turns everyone in the camp into his mortal enemy and ensures that every other SS officer was watching him like a hawk, out to get him in any way possible. Besides dooming his plan to save Rebecca, this fatal miscalculation on his part directly led to the death of the little girl, Anka, who had miraculously survived the gas chamber and was being hidden by the inmates. In the larger sense, why should he care if the guards were taking money? All that Christopher accomplished was to ensure that MORE money would get to Hitler, thus potentially prolonging the war he hated This enormous void of logic made the book, in my opinion, a complete failure."}, {"userName": "Wanda", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/12836621-wanda", "userReview": "This book really touched me - an insightful account of the dark history of the Holocaust. The cattle trains arrived at the train station in Auschwitz. There were 1200 people on the train, built for cattle transport. The people huddled together on the train, their throats raw from thirst, and clinging to their children who would soon die. The SS went into the train with guns drawn and dead bodies were thrown out of the rail cars. The selection was started and two lines were formed, one of younger, fitter looking people and then the rest, the older people and the children. The line with the younger was about one or two hundred, and they were marched off to Auschwitz. The rest of the people, easily a thousand, were told that they were brought to Auschwitz - Birkenau to work and they'd be safe and well fed. They were required to shower and be disinfected. Much of the fear had been lifted and the people were herded through an entrance of a flat roofed building. But, the unthinkable happened - there were SS men on the roof, carrying metal canisters and wearing gas masks. The contents of the canisters were poured down the chimneys, and the screaming began. The story shifts to years earlier - 1924. Christopher Seeler has left Germany, with his family, to the island of Jersey, the largest of the Channel Islands. When Christopher is 6 years old he finds a distressed 6 year old girl, Rebecca, on the beach. The story evolves around Christopher and Rebecca for a number of years.Time goes by and in the summer of 1939 there was fear everywhere. The Nazi hatred, led by Hitler, is like nothing ever known. The Nazi's blame the Jews for everything and begin a process of cleansing the population. The Nazi's invade Jersey and the five year occupation begins. Rebecca is identified as a Jew and deported to Germany in 1943. And the story unfolds as Christopher becomes an SS officer in Auschwitz and begins his search for Rebecca.This novel completely absorbed me from beginning to end. Finding Rebecca is a poignant and heart heavy story that will remain in your thoughts long after you read the final page. The novel is rich in historical detail with strong characterization. The topic of the Holocaust brings with it deep sadness - a horrible realization of what occurred at that time. The horrors that Hitler put on the Jewish people will stir your soul. On my list of favorite books. 5 stars."}, {"userName": "Nicole Overmoyer", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/5671169-nicole-overmoyer", "userReview": "Eoin Dempsey’s historical novel FINDING REBECCA is the sort of book you really want to be real. You want to have some confidence that a real human being somewhere in time did the things that the character he’s created did in the time and place he put them. But even knowing that Dempsey’s creation is fictional, that these things are products of imagination put into a series of real events – this is enough to remind you that life isn’t always cut and dry and still, in the end, sometimes the good guys come out on top.World War II fiction can be tricky. Authors run the risk of seeming too careless with some of the darkest moments in human history. Novels that aren’t researched are easy to spot by anyone who pays attention. Dempsey is neither careless nor uninformed.Yes, it seems a little extreme that a German-born boy on of the isle of Jersey might fall in love with a Jewish girl just as the Nazi rise to power. Yes, it seems a little extreme that the German boy might join the SS with the sole purpose of finding the Jewish girl who had been sent to the concentration camps. Other things happen that seem a little less extreme, not actual facts but just things that might stretch the imagination of someone who knows the history.But World War II was an extreme time.FINDING REBECCA starts like a love story and it stays a love story.It’s not easy to read. You question the motives of the people. You question what you would do if you were them. You judge the people for what they do and you wonder if it’s all worth it in the end. You realize that maybe the trick of it all is being able to live with yourself in the end.FINDING REBECCA is available for purchase now. (I received a copy of FINDING REBECCA through NetGalley in exchange for an honest & original review. This review is cross-posted on my blog and NetGalley & Goodreads accounts.)"}, {"userName": "Julie Dalrymple", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/4708982-julie-dalrymple", "userReview": "I came across this book by accident and it pulled me in from the beginning. It's a gorgeous, heartbreaking story, difficult to read, but ultimately thoroughly satisfying. It's a story that will stick with you, make you appreciate all you have in life and provide a better understanding of the horrors that took place during the holocaust."}, {"userName": "Sarah", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/6459063-sarah", "userReview": "Wow! What a diamond of a book! It's powerful in its Holocaust brutality, in its vivid emotions, and characters. If you're going to read any fictional book on the Holocaust, make it this one. To me, it's the epitome of what a Holocaust fictional book should be. Now that mention of Holocaust brutality... Definitely keep that in mind while reading this. This book pulls no punches. It portrays the Holocaust exactly the way it was, with all the violence and evil that conveys. From gassings, shootings, and the destruction of miracles/hope, this book will tear your heart out, stomp on it for awhile, then give it back to you with some duck tape for good measure. So read with caution.That being said, the overall message of hope and love in this book makes up for the extremes it goes to in portraying the Holocaust. Through Rebecca's and Christopher's love story and the story of how Christopher is able to keep his humanity and save others, the reader gets a glimpse at how bright the human spirit can shine, even during the horrors of the Holocaust. Even though Rebecca isn't even physically present for a good half or more of the book, her presence as Christopher's motivation and her \"spirit\" keep her front and center in the minds of the reader. I liked that their relationship never got the pat happy ending that is so common in so many books. Even towards the end after the Holocaust has been survived and post-WWII Europe has scarred our individuals, there are still bumps in the road to happiness and a full relationship. Yet for all that, the love these two share is timeless and soul-deep. This is a romance for the ages.The struggles Christopher goes through to weave his way through horrors and mind-numbing evil is the meat of the story for me. I felt for him during every confrontation with the Final Solution and every failed rescue attempt (prepare the tissues, peeps!). His triumphs are all the more sweeter for these horrific failures. Christopher's constant fight to keep those he can safe and to somehow balance out the horrors of the Holocaust with his light is a story I never got tired of reading.One last note I have to point out is the author's efforts at historical research. Not only does the author plop his readers down directly into Auschwitz and Nazi-occupied Jersey through historical detail and atmosphere (though there's plenty of that!), but he incorporates actual historical events into the narrative. I've personally read about/heard about two distinct events in Auschwitz that really brought this novel home to me, to know these events actually happened (though maybe not exactly as written in this novel) just hit me in the gut. Fantastic job on the research, Eoin!I can't get enough of this novel. Though incredible historical research, a vivid and realistic portrayal of the Holocaust, and characters/romance that stay with the reader, this book is destined for the favorites shelf. It comes highly recommended if you're looking for a Holocaust historical novel to enjoy and think about."}, {"userName": "Sharon Jones", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/9590034-sharon-jones", "userReview": "Lately I have been interested in history/fiction novels and specifically those about WWI and WWII. My education as a young girl was deficient in the history past Christopher Columbus and very deficient regarding European history. I have read a number of books trying to ascertain why the wars began; what brought people to that place, what motivated them and what their lives were. Now that I have read enough to allow me the knowledge of the why, I now want to read about people and their experiences in a fictional setting.Finding Rebecca was a real eye-opener as to the make up of the SS and the reaction of the Germans to what they found to be happening during the \"rein\" of Hitler. This was a hard to put down book with characters that had moral strength beyond what one would assume would be present. The lead character, Christopher, a misplaced German who became an SS officer, was an individual with only one commitment; to find his lost love. As life would have it, one cannot achieve just one goal without stumbling across other challenges and this was met by Christopher with astounding strength. I was horrified by what was done as this story went into far more detail than I had ever experienced before. I was not looking for the horror of what had happened, just an insight as to how people managed to exist and move forward.This story had an underlying theme representing the love of two people but more poiginant was how they dealt with life during and after the war.I would recommend this book if one is trying to see into the \"soul\" shall we say of individuals during difficult and impossible times."}, {"userName": "Stephanie", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/4519035-stephanie", "userReview": "I have to say that I was moved to tears and anguish at the atrocities of the Nazi Camps that are described in this story. The authors does not hold back on the brutality and utter evil of the Nazi SS. This is probably the most profound, emotional historical fiction book on World War II that I have read in a long time. At first I had to take the story in small dosages. Not because it wasn’t written well. Quite the contrary. The story was told so well that as I said above, I was moved to tears…Each character in the book played an important role in the story and Christopher’s courage and honor to find Rebecca is extraordinary. What he witnessed and had to endure in Auschwitz will be forever stamped on my soul.One can tell when reading this story that the authors detail to the Nazi Camps are extremely well researched and I admire the authors attention to the history of how the Nazi’s fooled for a time or deceived-if you will- all for their evil gain. Even many of the Nazi were brainwashed and really thought what they were doing was right. There was much I have to admit I didn’t know about and it was brought to light in this book.I will remember this story for a long time to come and I highly recommend it.Stephanie M. Hopkins"}, {"userName": "Christina", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/7538720-christina", "userReview": "Stayed up late finishing. I love historical fiction and memoirs. I own many memoirs of true accounts from the Holocaust. I love the cover. And was thrilled for a weekend to read. Unfortunately, I thought it dragged...not because of the subject matter but the pacing, unnecessary details, unfortunate skipping important moments... I really wanted to like this novel and characters. Was disappointed. I didn't even feel connected to Rebecca or Christopher in this story--just pity for the actual history we know is true, that real tragedies like these surely occurred. The story has all the bones for a powerful read but it needs to be tightened. There are better written true accounts of this horrific time like \"Mischling Second Degree\" by Ilse Koehn. But I was at least satisfied with the happily-ever-after."}, {"userName": "Sarah", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/5880981-sarah", "userReview": "I don't often wrote reviews anymore sine i have a toddler and a business, but, i feel i need to with this one. I must admit, i almost stopped reading it- i almost stopped several times, it is so moving, so sad, so terrifying, and so heartbreaking. I am a history major with 2 masters degree's, i have taught the Holocaust to HS and MS students countless times over the last 12 years. I have even gone to the WWII museum in NOLA several times. I KNOW what happened, i believe that these things happened, but reading this book made it all so much more real. If i could, i would want my students to read it. though it is gory, there is no sex. there is references to rape but the word is not used, that i remember. lets just say this was amazing and should be a book everyone reads."}, {"userName": "Linda Harper", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/36320356-linda-harper", "userReview": "ChillingOne of those books which should be required reading for all Americans over sixteen. We all need to be reminded of the atrocities levied on innocent people simply because of their race. If our younger generation isn't educated about these true events it can happen again. It's a terrible, chilling, achingly difficult book to read but please read it and recommend it to your friends. It's distressing to realize there are people out there who are denying the killing of millions ever happened - don't let them succeed."}, {"userName": "Stacey", "userReviewDate": "Dec 16, 2014", "userURL": "http://www.goodreads.com/user/show/3328199-stacey", "userReview": "I found this novel to be your typical holocaust novel in that it was a story had all the elements of novels taking place in this time frame. Lovers torn apart by war, the horrors of the concentration camps, miscommunications, etc. There was nothing that really set this novel apart from other Holocaust stories in my opinion. Overall, a decent story but it's not a Holocaust story I would recommend over others. I would recommend The Lost Wife instead."}, {"userName": "Cindy", "userReviewDate": "Nov 09, 2014", "userURL": "http://www.goodreads.com/user/show/22982246-cindy", "userReview": "Disappointing. For such a promising subject, the writing was flat and didn't evoke much emotion. The love story lacked passion, and the war story lacked excitement. The subject matter is very well know (at least for me), and the author didn't really bring anything new or interesting to it. It felt more like a reporting of events with some dialog thrown in, and it was frankly a slog to finish. I guess I prefer a more literary writing style, where the author shows rather than tells."}, {"userName": "Laurie", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/4971208-laurie", "userReview": "This is lovely love story set against the backdrop of the horrors of WWII. I wanted to rate it higher, but I found the writing stilted at times, and often did not feel the emotions the author was trying to portray. A little more polishing and better editing could make this a great book instead of just a good book."}, {"userName": "Tabitha Acree", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/6322464-tabitha-acree", "userReview": "I will definitely consider this one of my favorites. I didn't want to see this book end. Loved it!"}, {"userName": "Twobchelm", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/28529562-twobchelm", "userReview": "Life was easy before the Nazi’s invasion, this is a story of survival while pretending to be an SS officer.Christopher found many ways to deceive his fellow officers saving hundreds of children from the gas chambers and helping many prisoners to make it out alive. All the while searching for his lost love who was a Jew. Many lives were lost but many saved by one man’s bravery."}, {"userName": "Stephanie", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/4519035-stephanie", "userReview": "I have to say that I was moved to tears and anguish at the atrocities of the Nazi Camps that are described in this story. The authors does not hold back on the brutality and utter evil of the Nazi SS. This is probably the most profound, emotional historical fiction book on World War II that I have read in a long time. At first I had to take the story in small dosages. Not because it wasn’t written well. Quite the contrary. The story was told so well that as I said above, I was moved to tears…Each character in the book played an important role in the story and Christopher’s courage and honor to find Rebecca is extraordinary. What he witnessed and had to endure in Auschwitz will be forever stamped on my soul.One can tell when reading this story that the authors detail to the Nazi Camps are extremely well researched and I admire the authors attention to the history of how the Nazi’s fooled for a time or deceived-if you will- all for their evil gain. Even many of the Nazi were brainwashed and really thought what they were doing was right. There was much I have to admit I didn’t know about and it was brought to light in this book.I will remember this story for a long time to come and I highly recommend it.Stephanie M. Hopkins"}, {"userName": "Bonnye Reed", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/10604067-bonnye-reed", "userReview": "GAB This was an excellent book about the inhabitants of the Isle of Jersey from 1924 until the end of WWII, and how WWII divided loyalties and relationships. We follow Christopher and Rebecca from their first meeting at six years old until they meet again in New York in September 1954. The war years are well researched and the protagonists are portrayed sympathetically. The details are intricate and the story flows well. This was a hard book to put down, and is one I will keep, to read again. If you loved The Guernsey Literary and Potato Peel Pie Society you will enjoy this book, as well."}, {"userName": "Amanda", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/819561-amanda", "userReview": "I can handle implausible if it's well written, and I can handle bad writing if there's a good plot. This was completely unbelievable, flat/one-dimensional characters, and painfully cliched, stilted, and disjointed. Really don't know why I finished it, except for my compulsive nature."}, {"userName": "Mirel", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/3454492-mirel", "userReview": "[ Characters need to act within their natures, and we need to be able to see their natures and understand them better for their acts to seem believable for them. We are told about the characters, but we don't really see or get to understand what makes them tick, what makes them who they are. And these are only a few of the very many holes in the story and the book. In short, neither the history nor the romance worked for me. There are so many Holocaust books out there that are so much better, I wouldn't recommend wasting your time on this one. (hide spoiler)]"}, {"userName": "Beverly Laude", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/16226166-beverly-laude", "userReview": "I have read a lot of books set during the Holocaust and decided to give this one a listen. A lot of the reviews mention that they don't believe that there were any SS Officers or Nazis that had any redeeming qualities. I find that hard to believe and even though this is fiction, I would like to think that some so-called Nazis had compassion and did what they could to try to save Jews being held in the concentration camps. Reviewers also mention that the book contains too much graphic detail about the atrocities that occurred in the concentration camps. DUH! Why would you read a book about the Holocaust and not think that some of the atrocities would be mentioned? Most of the actual violence is only hinted at, not graphically described.I do agree that Christopher becoming a high ranking SS Officer assigned to Auschwitz is highly unlikely to have happened. He was too young, had lived outside of Germany for most of his life and had a long-term relationship with a Jewish girl.However, if you enjoy a romance that surpasses obstacles, death, atrocities, decades and so much more, give this book a chance. The writer does a great job conveying the love between Rebecca and Christopher. And, yes, there is a HEA ending, so don't despair!I listened to this book on Audible and the narrator did an excellent job. He didn't try to imitate a German accent, but did vary his voice for the different characters. And, you could really feel the emotion in his narration."}, {"userName": "Cinthia", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/17081082-cinthia", "userReview": "A love that endure the test of time. I love and hate war stories, I love learning about history and how some people made it out regardless of the evil hiding about. Rebecca and Christopher’s story was different from what I’ve read, sure I’ve read about auschwitz and Jewish people being abused and love making it through it all but I never had read about a German putting it all up on the line even his life for his love, a Jewish girl. I loved this story because Christopher was such a great character. He risked his life for Anka, that bit about Anka felt so familiar to me like I’ve seen it somewhere else before, so I didn’t know how to feel about it, she was a teenage Jewish girl that was gassed in the gas chamber but made it out of there alive, then the sonderkommandos his her and one day she was discovered by the Nazis and killed along with the ones hiding her, anyways, I was glad that Christopher was able to help Rebecca’s father even after he found out Rebecca had been killed, I was devastated when I found that out, all Christopher did to find her was for naught but alas, SHE found him, in New York of all places, years later... even though she was a spy and wanted to bring down the Nazis she decided to return to Jersey and make a life with Christopher!!!! I loved that Christopher adopted a Jewish girl too! He is my hero!!!"}, {"userName": "Rachel Levy", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/20761295-rachel-levy", "userReview": "After reading the reviews, I expected to like this book more than I did. I did like how it personalized the war with the characters and their love story. Christopher becoming an SS officer to look for Rebecca certainly gave it a different perspective, but it also gave it an unbelievable aspect as well. How did he become a SS officer when he was from English speaking island of Jersey? While his family was from Germany, they left after the first war and Christopher knew little of the country his family came from. The author did not touch on this at all, in fact jumped right over it. Towards the end the author jumped from Auschwitz to the New York and I actually thought I missed some pages. It was abrupt and not expected. I did like the ending so that brought me back around after the sudden change of scenery and time towards the end of the book.Overall it was a good book, the storyline intriguing and the characters rich."}, {"userName": "Marie Massart", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/65952382-marie-massart", "userReview": "Can't put downReal tear jerker. Loved this story. Anyone interested In holocaust reading should read it. Any movie or book that's made you feel the reality of World war 2 this story by far makes you realize the reality of shell and back and what even tragedy. Can do to bring someone back to you."}], "description": "Nothing could keep Christopher and Rebecca apart: not her abusive parents, or even the fiancé she brought home after running away to England. But when World War II finally strikes the island of Jersey, the Nazi invaders ship Rebecca to Europe as part of Hitler’s Final Solution against the Jewish population.After Christopher and his family are deported back to their native Germany, he volunteers for the Nazi SS, desperate to save the woman he loves. He is posted to Auschwitz and finds himself put in control of the money stolen from the victims of the gas chambers. As Christopher searches for Rebecca, he struggles to not only maintain his cover, but also the grip on his soul. Managing the river of tainted money flowing through the horrific world of Auschwitz may give him unexpected opportunities. But will it give him the strength to accept a brave new fate that could change his life—and others’ lives—forever?", "title": "Finding Rebecca: A Novel of Love and the Holocaust", "url": "https://www.goodreads.com/book/show/16240798-finding-rebecca", "average": 4.1, "cover": "https://images.gr-assets.com/books/1354662005l/16240798.jpg", "reviews": 655, "authors": [{"url": "https://www.goodreads.com/author/show/6620682.Eoin_Dempsey", "name": "Eoin Dempsey"}], "type": ["Historical", "Fiction", "World War II", "War", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/16240798-finding-rebecca", "http://www.goodreads.com/book/show/21796172-finding-rebecca", "http://www.goodreads.com/book/show/22485178-finding-rebecca", "http://www.goodreads.com/book/show/23465439-finding-rebecca", "http://www.goodreads.com/book/show/22486223-finding-rebecca", "http://www.goodreads.com/book/show/35889209-white-rose-black-forest", "http://www.goodreads.com/book/show/25106163-the-bogside-boys", "http://www.goodreads.com/book/show/17797900-killer-whale"]}