{"ratings": 11951, "userreviews": [{"userName": "Jane Stewart", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Above average action suspense. Former military guy can investigate without following the rules.I liked the way Nathan notices, analyzes, and talks about details. There a hint of Sherlock Holmes to him. He’s a sniper, helicopter pilot, good at fighting, and wealthy from his security business.Bad guys are dealing in explosives. FBI tries to find them. Bad guys kill good guys. A retired FBI guy asks Nathan and his partner to help as a favor. Nathan does not have to follow FBI rules. He can torture to get information if he needs to. We watch Nathan gather clues, learn things, find the bad guys, etc. That part was good. There is no stupidity. The ending is happy for the good guys.One thing that was weak for me, I would have liked more unusual characters. Something to provide the unexpected. The main characters here were typical FBI and military types. I recently read Mr. Mercedes by Stephen King. He had a 40-year-old woman with OCD called Holly the Mumbler. She did odd and unexpected things - which was the best part of the book. Jack Reacher (by Lee Child) has his oddities with his wandering lifestyle and toothbrush. In comparison Nathan is more normal and typical.For sensitive readers, there is a torture scene at the beginning and some brief torture later. Sometimes torture is difficult for me to read, but I was ok with this. I liked the way the author did it.DATA:Narrative mode: 3rd person. Story length: 364 pages. Swearing language: strong. Sexual content: one scene briefly referred to, no details. Setting: current day various U.S. locations. Copyright: 2012. Genre: action suspense."}, {"userName": "Richard", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/3391253-richard", "userReview": "Okay first off with me being a writer I hate to rate a book 3 stars. I loved the storyline and the book had very memorable characters with healthy back and subplots. Me being retired military as well I can appreciate the research that was done to be as close to honest as you can be in a fiction novel. Now the negative WAY to many flowery words and over the top descriptions of scenes that never caught on. I caught myself skipping 3-4 pages at a time and missing absolutely nothing.. It's almost like the book needed a hundred more pages so it was filled with fluff... Man I hate writing reviews like this, but I have to be honest as I receive emails and questions about my book reviews on a daily basis.. This author has a ton of talent and a great way of spinning a story, but this one missed the mark..... Sorry"}, {"userName": "Gail", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/24033272-gail", "userReview": "I am a Jack Reacher fan so I picked up this book when I had run out of Lee Child novels. The main character is a millionaire, security specialist, torture surviving, ex-military sniper. The beginning of the book is rather goofy - Nathan defends a group of call girls (one of which is his main squeeze) from a difficult customer. This encounter does not blend well with how Nathan ultimately shows his personality and abilities when he goes up against the Bridgestone brothers. But, once the main story line begins - when Nathan and his partner finally get their ghillie suits on - the story is very engaging. As snipers, the action is different than a Jack Reacher six-on-one fight but is fun none the less. I have started the second book in the series."}, {"userName": "Arlene", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/1474479-arlene", "userReview": "I accidentally read the second book in this series (Forced to Kill) first, and while it worked as a standalone, I would have gotten more out of it had I read THIS ONE first.Purely stated, it's a wonderful book. I loved the characters and felt the plot line was engaging to the end. Nathan McBride deserves to be right up there with Jason Bourne and Jack Reacher in the \"badass loner you definitely want on your side when everything hits the fan\" category of heroes."}, {"userName": "Ian", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/45972388-ian", "userReview": "Got this book on Amazon for $1.99 because i was waiting for a couple books from the online library and needed something to read.What a great book! well written and the characters had great depth to them! Can't wait to read more from this series."}, {"userName": "Joe Stamber", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/4900418-joe-stamber", "userReview": "Forget every hard-ass, smart-ass, super-cool, lady-killing super-hero you've met before... Nathan McBride is the One. Invincible? Check. Smart? Check. To cut out a lot of checking... Can do everything that anyone in the world would ever want to do but be better at it than anyone else? Check. McBride is an ex-Marine turned super rich business man with ladies swooning at his feet, who is in more demand than Ghostbusters.First to Kill is a decent, if fairly predictable, plot for a thriller. The action scenes are exciting and the story is well written. Like many action thriller protagonists, McBride is a bit too good. And then some. The attention to detail can get a little eyeball rolling at times. McBride doesn't pick up a gun, he picks up a 79mm Smith & Glock Attenuated Groil Snake-Barrelled Piston Hammer with Infra Purple Night Vison Articulated Scope. He doesn't put his shoes on, he picks up his left Horace Gershwin Combat Brogue and slides his Timothy Cooper green stockinged foot into it before pulling the laces tight then looping one lace... well, you get the idea. Jeez, how about crediting the reader with a little intelligence?Despite the criticisms, First to Kill isn't much different to many other action thrillers out there, so I shouldn't be too harsh. I listened to it, rather than read it, and I think this probably improved the experience. I'm pretty sure I'll be listening to the follow up Forced to Kill so I must have enjoyed it really! If you like action thrillers and don't mind rolling your eyes a few times and having everything spelled out, First to Kill may well fit the bill."}, {"userName": "William Brown", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/5098968-william-brown", "userReview": "5-Stars! A Crackling Good Action-Adventure Story“First to Kill” is the first book in what is now a four book series of action-adventure thriller novels from Andrew Peterson featuring the lead character, Nathan McBride. He is a cerebral CIA Special Ops contractor and ex-Marine sniper who is still healing from an earlier mission that went badly wrong. McBride gets called out to help the FBI track down the grandson of a retired FBI director who has gone missing on an undercover assignment to penetrate a radical white supremacist, arms smuggling group. Series books are very much in vogue these days. I usually dislike them, because I feel they all-too-often cheat the reader. To me, a story should be distinct and complete from cover to cover and not simply a teaser to get the reader to buy yet another book. I don’t know how the next three books in the series will work out, but this one is a crackling good action-adventure story. Peterson does a very good job on the two main criteria to achieve that ─ he has created a unique, compelling main character, and an excellent, twisting and turning story line. In Nathan McBride, we have a thoughtful, quiet, and very lethal ex-Marine who thinks before he acts. Four a change ─ unlike Mitch Rapp, Scot Horvath, or a long list of others ─ the bullets don’t bounce off this guy, or anyone else in the story. They get hit, they bleed, and the often die. This isn’t just another action-adventure shoot-em up, it is good well-crafted fiction. I will read more of these, and so should you ─ great for the beach, pool, or long airplane ride.William F. Brown is the author of 5 thriller novels with over 300 Five-Star Reviews: The Undertaker, Amongst My Enemies, Thursday at Noon, Winner Take All, and now Aim True, My Brothers. They are all available on Kindle and now on Audible Audio Books. You read about them at billbrownwritesnovels.wordpress.com"}, {"userName": "Almney King", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/41385574-almney-king", "userReview": "4 Stars! Hands Down. When I said I was looking for a D*** Good Book, I found it! \"First to Kill\" is a heart-pounding, roller-coaster of a thriller featuring Nathan McBride, an ex-Marine sniper and his old partner Harvey who come out of retirement for a private job issued by long time friend Frank Ortega, a high-profile government official. Ortega's son, James, an under cover CIA op, as been kidnapped and presumed dead. Together, Nathan and Harvey must track down those responsible for James' disappearance. As the pieces fall together, Nathan and Harvey find themselves in the middle of a dangerous cat-and-mouse game involving CIA secrets and a dangerous group of bomb trafficking brothers known as the Bridgestones. \"Fist to Kill\" is a beautifully paced book. Intense, emotional, and written with such vivid details, the story and characters come to life beautifully. The action and events are gripping and believable, the characters leaving you even more on edge! I'm eager for the rest of this action-packed series."}, {"userName": "Jaiph", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/15768632-jaiph", "userReview": "Been looking for a good action-thriller series...unfortunately, I'll have to keep looking. Main character Nathan McBride is a confident no limits protagonist, fairly common for the genre, but for all his bluster makes dumb move after dumb move usually resulting in the death/injury of those he is working with or civilians in the nearby vicinity. He is also an avid subscriber to Torturers Monthly despite the fact his \"interrogations\" typically result in misinformation.The author dedicates a surprisingly large amount of time to developing the relationships between McBride and his various colleagues which is admirable in theory, but in practice the dialogue is quite forced and often not very believable. The action does have its moments, just nowhere near enough to make me feel like I was reading anything other than a rejected script for 24."}, {"userName": "Arlene", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/1474479-arlene", "userReview": "I just finished my second reading of this book, and I enjoyed it every bit as much the second time around. I don't often re-read books, so the ones I choose to reread have to feel like I'm visiting an old friend.I stand by the opinion I first gave when I discovered these books: Nathan McBride can stand tall and proud as a hero every bit as engaging as Child's Jack Reacher or Ludlum's Jason Bourne. McBride is a former Marine sniper scout with some serious post trauma issues. Peterson is an expert at giving you a good idea of what this man went through without falling into the trap of overdescribing. Trust me, start reading this book and you'll be rooting for McBride to start kicking ass."}, {"userName": "Kirk Kaiser", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/18347806-kirk-kaiser", "userReview": "Love the seriesI'm a fan of characters that continue though a series of books. I like to see development. This will be my new favorite series"}, {"userName": "Monchari S", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/9040269-monchari-s", "userReview": "Another great crime-action fiction with a new hero!!!Nathan McBride (and Harv ? (∩_∩*)ゞ）Story is in very fast pace....so fast so that you almost can't put it down..I felt the 4th quarter of the book was a bit too rushed, but it didn't effect to the story as I thought.Well, I like Nathan a lot, but I have to confess I love Harvey more (laugh).I think Nathan was a bit too much talkative for his character.I laughed many times when he talked or told the details of the matters he insisted to some people 'it's secret' and 'tell no one' (and you made it 'tell many ones' by yourself, Nate...(^_-)-☆) While Harvey, the sidekick, is more discreet and more cool sometimes. I love the relationships between this two characters so much.It's close...very close、and very impressed (萌え！！♥ ← for someone who can understand what I want to say♪).The other novels (besides Sherlock Holmes) I love all has single hero (Jack Reacher, Dr.David Hunter, Roy Grace, etc), not pair. I do really love 'pair' (male-male partners) pattern in this kind of fiction. It makes the story more excite and way more cool in many aspects.The matter that impressed me most was that the author has various knowledge in many fields.Not only law enforcement institutes or military matters, but also specific details in arms and vehicles (included chopper! of course). That made the story so real when you read."}, {"userName": "Nick", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/724379-nick", "userReview": "I picked this book up at a book event, where the author was promoting and signing it, but hadn't gotten around to reading it. The cover blurbs somehow didn't grab me.Once I finally picked it up, I found it to be a pretty good book of the \"hunt down the bad guys at all cost\" genre.While the anti-terrorist plot was nothing special, the relationships between the central characters were pretty interesting. I found certain plot elements hard to believe, like a 3rd-generation FBI agent blowing his undercover assignment in such an inept way, but that was the central McGuffin at the start of the book. Also, the romantic elements seemed a little forced. As the story slowly unfolded, I was more willing to forgive the writer for the few lapses. There is a sizable body count, but no more than necessary to tell the story the author wanted to tell.This book isn't great literature, but it's a big step up from some of the \"kill it before it dies\" dreck that is often foisted off as \"action-adventure fiction for manly men\"..."}, {"userName": "Perry Martin", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/17176115-perry-martin", "userReview": "Andrew Peterson's 1st book in the Kill series featuring former Marine Sniper, Nathan McBride narrated by Master of the spoken word Dick Hill, is a great book. I would compare McBride to Lee Child's Jack Reacher in a lot of ways except he didn't walk away. Nathan became a covert CIA operative. When he did retire and walked away he was certain his life would slow down and he could rest.When a deep undercover FBI Agent disappears along with 1 ton of Semtex explosive the Government reaches out to Nathan McBride. He has a set of skills that are unique and necessary to find the missing explosives. But when he is caught between the crazy ideas of the Semtex thief and the FBI Agents who will stop at nothing to find their missing Agent, McBride must walk a narrow line to find the explosives before something unspeakable happens. You will love this book and there are 3 more available at Audible.com."}, {"userName": "Freda", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/7886250-freda", "userReview": "I think it is to violent for me. I guess as I get older I think \" Do I want to waste my time on a book I am not enjoying.\"  Andrew Peterson sounds so much like Lee Childs that I had to check to see if this was a pseudonym for Lee Childs. So many phrases that are reminiscent of his writing. I will give the second in the series a chance."}, {"userName": "Lori K", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/3651251-lori-k", "userReview": "I liked this book but I think it would have been better if it left off the romance part. It didn't add anything and it just irritated me. The women were all weak, most were \"escorts\" or helpless. A few were helpless escorts."}, {"userName": "ElaineY", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/1301782-elainey", "userReview": "This was okay in the first half but I started getting bored and didn't bother with the last two chapters. I was still more engaged in it than a Jack Reacher book so I guess action-thrillers really aren't cuppa....sigh, back to serial killers?"}, {"userName": "George", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/25915766-george", "userReview": "It was in all ways an okay book. I \"liked\" it, didn't love it like some of the Patterson or Clancy titles, but didn't hate it either. It was your average mediocre shoot 'em up novel with a few hole & some serious issues in believability regarding the Government & FBI."}, {"userName": "Rick Gillispie", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/36749117-rick-gillispie", "userReview": "One badass sniperThis was a great start to the series. Nathan McBride is one crazy sniper and this first story going against some crazy brothers proves it. A must read."}, {"userName": "Anita", "userReviewDate": "Apr 12, 2012", "userURL": "http://www.goodreads.com/user/show/6681986-anita", "userReview": "Not my style. Pretty unbelievable main character"}, {"userName": "Ira Brandstein", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/31503091-ira-brandstein", "userReview": "This book needs to be a movie!Felt like Jason Bourne meets Mission Impossible. Good thriller that’s hard to put down. When I catch my breath, I’ll look for the next book"}, {"userName": "Angela", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/16812081-angela", "userReview": "Absolutely loved this book! I am a huge Reacher series fan and I think McBride is even a bigger bad a$$."}, {"userName": "Rithun Regi", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/16593444-rithun-regi", "userReview": "What a thriller of a book taking me through the mind of a scarred soldier who inspire of being brutalized can still have a positive outlook in life.A story of friendship between Harvey and Nathan!!Made me long for such a deep friendship!!Could not put the book down!! Finished it in a day"}, {"userName": "Lyndall", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/63159364-lyndall", "userReview": "Loved it. The first Andrew Peterson book I have read. I will definitely be reading more of his Nathan McBride series"}, {"userName": "1Moody R", "userReviewDate": "Oct 21, 2015", "userURL": "http://www.goodreads.com/user/show/48064500-1moody-r", "userReview": "First to Kill\tFirst to Kill is the first novel of the Nathan McBride series, which follows the actions of Nathan McBride, a retired Black Ops Recon Sniper and CIA Operations officer. This book is the story of his attempt to hunt down members of a domestic terrorism ring after they set off a bomb that nearly kills his girlfriend. The brothers are both on the FBI’s Most Wanted List and are highly trained and dangerous. \tMuch of Nathan’s past is not revealed until later in the book, but you learn that one of his missions went sour and he was captured in Nicaragua. There he was tortured for days by a sadistic interrogator. Nathan has three massive scars slashed across his face, and dozens more on his torso, made so that it looks similar to a checker board. He is eventually rescued by his best friend, Harvey, but this traumatic event leaves him scarred much worse than the ones on his body. After returning from Nicaragua, Nathan has severe depression and paranoia issues. Harvey desperately tries to keep his friend in a good mental state but it is very difficult. Nathan attempts suicide but fails. Finally, Nathan has an epiphany and gets his life back together. Nathan and Harvey start a home security business and become very successful and fairly wealthy. He meets Holly and they begin a relationship. Holly works for the FBI as their Head Special Agent in Sacramento. \tOne day Nathan and Harvey receive a call from an old friend. This friend’s grandson is an undercover agent and hasn’t reported in nearly two weeks. He was investigating a domestic terrorism ring that deals explosives all over the country. It turns out this friend is actually the former Head of the FBI. He wants to keep this off the books, so he has to privately contact two men he trusts to go and save his grandson. They begin investigating and find out this ring is run by three brothers. Nathan and Harvey raid their compound, killing one of them. However, the other two escape and are hell bent on revenge for the death of their brother. After they find out the FBI and Nathan and Harvey are behind this, they bomb the Sacramento field office, killing 27 people, Holly was nearly one of them she now walks with a permanent limp because of this attack. After their successful attack, the two brothers decide to make a run for the border. They have millions of dollars in cash buried in a remote area. By interrogating of the brother’s contacts, Nathan learns this location and beats them there. A firefight ensues, and despite eating a bullet and nearly being mauled by a mountain lion, Nathan and Harvey manage to kill the two brothers.\tThis book was a very good action-adventure novel. I really liked the interaction and relationship between Harvey and Nathan, but the romance with Holly seemed unnecessary. Overall, I give the book a 4/5 stars!"}, {"userName": "michael alan cast", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/41310177-michael-alan-cast", "userReview": "HERE ARE FACTS on these tactically BELIEVABLE stories!Okay, I have read a lot of apocalyptic novels, High Scfi, and covert operations books lately. I love when a story is told by someone whom obviously knows what their talking about. Like this (nice lengthy) novel by Andrew Peterson; the author obviously has either been in the armed forces, or has done a mountain of research. These BELIEVABLE novels are hard to find actually. Believable, AND interesting is even harder to achieve. There is no telling how many stories I started into ONLY to find out that everything is too convenient. Or they write about equipment and weapons only in the barest bone sense. Like one author that kept explaining how her character would \"pull the hammer back on her trusty Glock pistol...??? Almost everyone knows that Glocks don't HAVE a hammer to clock back...Anyway, I have started many, and just stopped right around the one hundred page mark. I just delete them and hope they go away and pray that the Big A doesn't ask me to review them. Well thankfully I found this new series and have already acquired the next two in the series because Peterson is good....really good. HERE'S A SHORT SUMMARY, NO SPOILERS: Nathan is an ex marine s pier. A good one. Perhaps the best. He is captured and tortured nearly to death in a conflict. He, Nathan, was saved barely in time. Years have gone by, and he and his partner own a lucrative home security business. They certainly don't need the money, but every now and then, Nathan and his partner (his partner AND ALSO his spotter from the marine days) take on a mission. It not for money. Not for the thrill. Nathan in truth hates killing, but sometimes their special skills are needed to protect our country against threats that can't be ignored. Threats that can not be handled by official channels. Threats that need Nathan's special sells."}, {"userName": "Josh Smith", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/19937065-josh-smith", "userReview": "An undercover agent gets caught. The FBI enlist the help of a former superstar agent turned businessman and give him leeway to break every law in existence.The whole plot is pretty basic and straight forward. The book itself is good. Not stellar. Not jaw-droppingly amazing. Not horrendous. Just middle-of-the-road good.Nathan himself might as well be Superman since everything he does is of impeccable caliber and nobody can top him in anything. The greatest sniper the world has ever known. The greatest womanizer walking the planet. The best businessman on this hemisphere. The most in-shape guy ever who can beat the ass of everyone on the planet and keeps a keen eye out on every single interaction within a 50 mile radius. He even has the ability to spot every undercover agent in every government agency. This guy can even divide by 0 and truck over Ray Lewis.He just needed some weaknesses really. Everything he did was too flawless. It made him an unrealistic character and made the entire book a bit too predictable. Speaking of the entire book; it could have done with a bit less fluff and buff. Everything was exceptionally detailed and I found myself spacing out while reading and after half a page I didn't miss anything. Half a page of details on a helicopter. Another half a page on what he wore that day. Another half a page on him slapping handcuffs on someone. Despite all this I did enjoy the book and I'll definitely read the entire series. It was more interesting than anything. The story was easy to follow and the action scenes definitely kept the pace up. 4 stars."}, {"userName": "Frank Mikes", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/20741380-frank-mikes", "userReview": "This was a pretty good book with a strong plot and an interesting lead character. Nathan McBride, the hero of this book, is a damaged veteran, literally scarred by his time as a CIA sniper. Now, working as a security contractor, he becomes involved in a high stakes criminal conspiracy.The pace of these books is very good, although I found there was some general over-simplification of how things work that went on 'off-screen'. There was also a little telegraphing of how things worked.While the main character was complex and certainly not one dimensional, I found that he was curiously naive about issues other than those that would involve a CIA operative. The company he co-owns makes him a mulit-millionaire (part of the simplification mentioned before) but he seems to know very little about money and values it even less.Also, Nathan McBride benefits by the author having all things turn out well for him, at least for the most part. He's amazingly lucky. However, he does suffer a fair bit throughout the book as a counter to this luck so it isn't too onerous.The worst thing I found about the character though is his almost supernatural fortitude. Over the five days or so of the book, he gets about 6 hours sleep gets beaten, shot twice and suffers a double compound fracture but keeps going and can even tell a joke or two.On the whole though, this is, as I said, a pretty good book and is a fun, easy read."}, {"userName": "T. Justin", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/22119039-t-justin", "userReview": "In many ways this book reminded me of Stephen Hunter's Bob Lee Swagger series. Andrew Peterson's knowledge of military procedure and sniper craft seems authentic (or at least well researched), and his characters are both believable and interesting.My criticisms of his book actually have nothing to do with his the technical aspects of writing. His story was well-paced, exciting, and fun to read. His use of dialogue was both believable and flowed naturally.His main character, Nathan McBride, however, starts out as someone I genuinely liked and was invested in. However (SPOILER ALERT), halfway through the novel the woman he'd been involved with was injured and a new FBI lady started working with him. And while he didn't overtly ogle her, it was made plain that he seemed to forget all about the injured lady agent he'd slept with and was all about the new girl. I came away from that with the sense that McBride might be a complete asshole! Haha. Which is possible. Fine. I'm okay with that, but it was clear by other things the author Peterson had written about McBride that he was supposed to be less of an asshole and more of a tough guy with feelings like the characters we love in other--similar novels (see my comment about Bob Lee Swagger).In spite of that, I'm willing to give book two a try. I'll have more to say then."}, {"userName": "Msjodi777", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/5903985-msjodi777", "userReview": "I read about this book in a blog post about audiobook narrators (no, I don't remember where it was, I'm old, I forget stuff easily). Dick Hill said that he really enjoyed doing this series. Well, since Dick Hill is one of my favorite narrators, I just had to listen. Wasn't disappointed.For some reason it reminds me a bit of Jack Reacher. We have a former Marine (Reacher is Army), sniper, (Reacher wasn't a sniper, but is an excellent shot,) someone who knows how to \"get the job done.\" But we also have a man who has a partner and best friend, (Jack is completely alone) who is a successful business man (Jack works part time jobs wherever he lands) a man who is wealthy, (don't really know how much Jack has, but while he has enough, he is definitely not wealthy). But both men have that \"don't mess with me attitude.\" A man's man that women can dream of. Nathan and his partner Harvey are sent on a mission to try to save a young FBI undercover agent, who is the son of one of Harvey's friends. And the story takes off from there. There are more twists and turns with a few red herrings to spice things up a bit. Lots of action. Lots of shoot em up, but without the gory details. Not great literature, but I enjoyed it."}], "description": "Ten years ago, a botched mission in Nicaragua ended covert ops specialist Nathan McBride’s CIA career. Now he utilizes his unique skill set in the private sector—until the night Frank Ortega, former director of the FBI, calls in a favor. A deep-cover federal agent has vanished, along with a ton of Semtex explosives, and Ortega needs them found—fast. Because for him, this mission is personal: the missing agent is his grandson. And Nathan McBride is the only man he trusts to save him.But it quickly becomes clear that something bigger than even Ortega could have imagined is at stake. Within days of accepting the assignment, McBride finds himself trapped between a ruthless adversary hell-bent on revenge and a group of high-ranking federal officials who will stop at nothing to reap their own brand of justice. Here there are no rules, no protocol, no backup. Only McBride…", "title": "First to Kill\n      \n          (Nathan McBride #1)", "url": "http://www.goodreads.com/book/show/6630751-first-to-kill", "average": 4.06, "cover": "https://images.gr-assets.com/books/1356545953l/6630751.jpg", "reviews": 503, "authors": [{"url": "https://www.goodreads.com/author/show/1544549.Andrew_Peterson", "name": "Andrew  Peterson"}], "type": ["Thriller", "Fiction", "Mystery", "Action"], "outlinks": ["http://www.goodreads.com/book/show/6630751-first-to-kill", "http://www.goodreads.com/book/show/3931026-first-to-kill", "http://www.goodreads.com/book/show/12719609-first-to-kill", "http://www.goodreads.com/book/show/18915418-first-to-kill", "http://www.goodreads.com/book/show/17124087-first-to-kill", "http://www.goodreads.com/book/show/16079213-option-to-kill", "http://www.goodreads.com/book/show/11953868-forced-to-kill", "http://www.goodreads.com/book/show/20528595-ready-to-kill", "http://www.goodreads.com/book/show/24965570-contract-to-kill", "http://www.goodreads.com/book/show/30141628-right-to-kill"]}