{"ratings": 414, "userreviews": [{"userName": "Esil", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "3+ stars. There's so much I like in Wayne Johnston's novels, but First Snow, Last Light didn't quite come together for me. Johnston is a Newfoundland writer, and he writes about that province with so much love and humour and a touch of melancholy. He creates brilliant characters, fearlessly takes on morally fraught topics and writes beautifully. But First Snow, Last Light felt like too big a serving of all that's good about Johnston's writing. Set between the 1930s and 1960s, the story mostly focuses on Ned Vatcher, whose parents vanish when he is in his early teen years. As the book unfolds, Ned obsessively tries to find out what happened to his parents. Along the way, he becomes a generous but difficult and grandiose personality in a Newfoundland that has recently divisively voted to join Canada. This is the third in a trilogy, but it certainly wouldn't be necessary to have read the last two to read this one. It features some recurring characters, one of my favourites being Fielding -- six foot tall woman journalist with a tendency to melancholy and self destruction. As is his talent, Johnston has again created big difficult characters and a dark story, mixed in with Newfoundland's unique history. In this case, at times, it felt like too much -- too many tormented souls struggling with too many strands of complex personal history. But that is Johnston's style. I loved how he pulled it off in The Colony of Unrequited Dreams and was interested in how far he went in The Son of a Certain Woman. Not so much in this one. But I will definitely continue to read his books. He's an unusual talent who writes about one of my favourite places in Canada. Thank you to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Krista", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "As Nan Finn said of people who went missing in the woods at twilight, they had been led astray, not by fairies but by snow when there should have been no snow, a rogue blizzard when winter was a month away, led astray by the pale, bewitching light of late November, the lulling light of sunset in the fall.\nFirst Snow, Last Light is the third volume in Wayne Johnston's Newfoundland Trilogy, and having now read all three, I get the feeling that this series wasn't pre-planned as such from the beginning; that Johnston simply decided to revisit an old idea (and his most striking character, Sheilagh Fielding) two more times over the years. Because I've read the first two books in this series, it would be hard for me to say if this one stands alone as a compelling read, but taken as a whole, it's a satisfying, if uneven, trilogy. Note: I read an Advanced Reading Copy, so excerpted quotes may not be in their final forms.\nThe Vanishing Vatchers. I was left with nothing but the setting of their lives, the stage, the props and costumes, the performance that only I had fallen for and which had moved on to somewhere else. That its run was done, everyone but I believed.\nFirst Snow, Last Light begins with a short second-person introduction: “You” arrive home from school to a locked and unaccountably empty house – your recluse mother has always been there to greet you before – and even after you go get your coach, Father Duggan, from school to come and wait with you, your parents never return. The narrative then begins properly, from the point-of-view of Ned Vatcher, the boy whose devoted parents mysteriously vanished one November afternoon in 1936 when he was fourteen. Told in a straight timeline from 1936 to 1961 (with some of Ned's childhood memories woven in at the beginning and moving a bit beyond at the very end), the perspective jumps from Ned to Sheilagh Fielding (and a couple other characters, including whoever intermittently comments on Ned's sections, calling him “you”), and we watch as Ned grows up an orphan; eventually earning a Track & Field scholarship to Boston College and returning to St. John's to become a millionaire by transplanting the American ideas he had learned while away. The nagging mystery of what happened to Edgar and Megan Vatcher was enough to keep me engaged, but the overall plot – the poor boy gets rich and devotes his life to finding his parents at the cost of his own happiness – felt a little thin. And while I had been looking forward to reading about Fielding again, there were fewer scenes of her verbal jousting to enjoy than the last time around, and then everything I have grown to love about the wry dipsomaniacal giantess is upended by this:I spent the balance of the war setting down an alternative version of my life, which I called The Custodian of Paradise and which I fancy I might someday publish. Such was the measure of my despair that I devised a fictional existence that was far stranger, far more fantastic than my real one.Whaaaat? The interesting parts of Fielding's history – the self-exile, the Provider and his delegate, the reason behind the fallout between her parents – is all “fictional”? It just makes her dissolute life seem even more pathetic, and I wish Johnston hadn't reduced her so. I appreciate that we get to see how Fielding's life turns out (even if I can't quite believe the number of marriage proposals she receives over the years), but I didn't like how it turns out. And in the end, I didn't much care for how Ned's storyline pans out either. Still, it's pointless to complain about an author not writing the story I wanted to read.\nI turned round and rested again, facing west now, up the Bonavista as the section men said, toward the continent of Newfoundland, the intersection of the main line and the branch, the never-glimpsed wilderness from which the question we had failed to answer had been borne to us, the country that would never be discovered or forgotten, the colony of unrequited dreams that would never be acknowledged as a nation except by those of us who made it one.\nHere's my overall takeaway: I think that The Colony of Unrequited Dreams was a work of genius; a five star literary interpretation of Newfoundland's history. The Custodian of Paradise was an interesting reworking of the first book, filling in the perspective of Sheilagh Fielding; probably Johnston's most compelling character. The timeline of First Snow, Last Light begins just before the end of the first two volumes, and through the story of the enterprising Ned Vatcher, references how Newfoundland modernised itself – transforming from British colony to Canadian province – but this book doesn't really add much to the understanding of Newfoundland; it lacks the big picture historical events of the first book and the community-level strictures of the second. Other than to tie up Fielding's story – and she felt pretty peripheral to its plot – I don't know what the overall point of this book was. Even so, I was looking forward to reading this book and am glad I did. I recommend it to other completionists."}, {"userName": "Diane", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/7172184-diane", "userReview": "We begin with a 14 year old boy, Ned Vatcher, who comes home from school to discover his parents are gone. They've disappeared without a word on the day of the first snow storm of the winter, in St. John's, Newfoundland, November 1936, leaving him behind. Ned has come home from school to an empty house and a mystery. He runs to his sports coach from school, Father Duggan and ends up with his father's family, a family of fishermen who have already lost one son to the sea. He grows up to make a life for himself in media and other businesses but his parents' disappearance continues to haunt him. What happened to them? Why did they leave him behind?A couple of years ago, Wayne Johnston wrote a fictional account of the life of Joey Smallwood, the first premier of Newfoundland called The Colony of Unrequited Dreams. It featured a female journalist, the enigmatic, alcoholic and reclusive Sheilagh Fielding. First Snow, Last Light is told from Ned's point of view and also from the point of view of Fielding, which is great because she was such a strange and engaging character in that first book. Johnston also wrote The Custodian of Paradise which is mainly about her though I haven't read that (yet).Ned's parents' disappearance colours his life as he grows up and becomes a wealthy businessman in Newfoundland. Sheilagh Fielding had made friends with his father and reconnects with Ned, his adopted son, Brendan, and  Father Duggan. The novel follows their lives while we wait to see if the mystery of Ned's parents ever gets resolved. There are twists and secrets, and the ghosts of the past haunt them all.Wayne Johnston is a very talented writer and his characters are complex with many layers. Ned is not particularly likeable, nor was Smallwood in Colony of Unrequited Dreams but Fielding is again the best character in the book. I wonder if the trilogy of books isn't really her story, rather than those of Ned Vatcher and Joey Smallwood. I really enjoy his books and they haven't let me down yet.This was a Netgalley book for review. It is released in September 2017."}, {"userName": "Andrea", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/3151157-andrea", "userReview": "A brilliant story,familiar characters that resonate with the heart and mind.I was drawn into the lives of every single character that was written about in the pages of this book. I was stunned by many revelations and the ultimate twist in this tale of families, secrets and lies told for what those who told them believed was a good reason. I wept for the ones who were left behind to pick up the pieces. Wayne Johnston is a brilliant writer whose work is beautifully crafted and touches a cord in the fragile part of the human psyche. A heartfelt thank you to the author and the publisher."}, {"userName": "David", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/30564033-david", "userReview": "It didn’t work for me. First Snow, Last Light, opens in the second-person, present-tense voice. Lost me there. Shifts into multiple first-person voices. Marginally better. Fielding appears first in her column. Some magnificent descriptive passages of the Newfoundland landscape. Otherwise, basically treading water. I like Fielding, and I find the narrative is livelier when she is near the centre of it. And there is some satisfaction in the ‘comeuppance’ department for at least one figure who has been on the edge of the story since The Colony of Unrequited Dreams. As ever, Confederation plays a role in the plot. I thought it an improvement on Son of a Certain Woman, but remain generally dissatisfied. [from not a lot later] Sometimes I get obsessed with why I have any kind of reaction to any book. This one bothered me so much that I re-read it in pretty much a single sitting. It’s a different book and a more interesting book (not necessarily better) when read with the mysteries all explained. Makes me wonder if The Divine Ryans is my favourite mostly because, in the process of using it in about a dozen courses, I’ve read it so often. Perhaps, ideally, every book should only ever be reviewed by someone who has read it three or four times. But, reality."}, {"userName": "Penny (Literary Hoarders)", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/3727008-penny-literary-hoarders", "userReview": "I read First Snow, Last Light first, and perhaps should have read The Custodian of Paradise before it, (I do own that one too) but, I don't think my not reading it suffered the story in First Snow, Last Light. It would definitely have provided more of the past/ background story for Shelaigh Fielding since she was a major character in First Snow and is the focus in Custodian. Both Ned and Fielding are chasing and haunted by ghosts in this story. Ned is left alone at 14 when his parents vanish without a trace. Fr. Duggan and Fielding become the major influences in Ned's life. Fielding is unravelling from the loss of her children, twins she gave up at birth. Ned's life is consumed with trying to find out what happened to his parents - the Vanishing Vatchers and invests all his money, energy, everything into this mystery. By the end the mystery is admitted to Ned and reveals the layers of tragedy and betrayal in the Vatcher family. I did feel it a touch too long and drawn out but as the ending comes together this turns into a fine piece of storytelling. I will go back now and read The Custodian of Paradise. I suspect it will be a good reading experience and may just enhance First Snow, Last Light that much more for me - kind of in the way of what happened when I read Itani's Tell before reading Deafening. There were quite a few pieces that fell nicely into place for me by reading them in reverse order, so I suspect this could very well be the same when I read The Custodian of Paradise with it's focus on Fielding.** Edited to add: I read The Colony of Unrequited Dreams (and even The Navigator of New York ) YEARS ago too. Colony is the first in this trilogy but the lengthy distance in years reading it to First Snow doesn't impact it negatively or anything."}, {"userName": "Jessica", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/24109999-jessica", "userReview": "WARNING: Minor spoilers are afoot. In his saga of page-turners known as the Newfoundland Trilogy, Wayne Johnston has given his readers a truly gripping protagonist in the character of Sheilagh Fielding. A columnist with an emotionally tense past, readers instantly fall under her spell in The Colony of Unrequited Dreams, prompting them to continue reading her life story in The Custodian of Paradise. Ultimately, everyone who picks up one of Johnston’s novels will love Fielding for her honesty – which can, at times, be brutal – and her unconventional femininity which proves, without a shred of doubt, that a woman can be tough as nails and a little ruffled by the world while still being remarkably beautiful, inside and out. Furthermore, her biting wit and intelligence will make readers adore her unconditionally, page after page. Now, in the trilogy’s conclusion, First Snow, Last Light, readers follow Fielding on the tumultuous journey that is her relationship with the Vatcher family, who are a complicated troupe. Edgar Vatcher is a Rhodes Scholar and an Oxford man, serving under the corrupt politician, Sir Richard Squire, during the 1930s, and alongside him are his wife, Megan - a passionate Londoner whom he weds after an accidental pregnancy and whom never gets over her homesickness after moving to Newfoundland - and their young son, Ned, who serves as one of the novel’s dual protagonists. Readers quickly learn that Edgar and Megan Vatcher vanish without a trace on a stormy November day in 1936, leaving Ned with no parents and, even worse, no idea whatsoever where they went nor what happened to them. When the suggestion is made that they could one-day return, his grandmother’s response is that “you never know” (pp. 132) – and never knowing often coincides with never moving on. Ned’s only solace comes in the form of Father Duggan, his track and field coach, and Sheilagh Fielding, who was a close friend of the family before the Vatchers’ disappearance – or, at the very least, was a close friend of Edgar and Ned Vatcher. After the Vatchers’ vanishing act, readers then follow Ned as he grows up without them and Fielding as she watches him mature. Therein lies one of the most interesting aspects of First Snow, Last Light; while it is, at its core, a mystery (and Edgar and Megan’s disappearance remains the driving force of the text), solving the case of the Vanishing Vatchers is not all that the novel is about. It is not Sherlockian in its formula, but rather Dickensian; Ned Vatcher becomes, in a sense, an orphan vagabond similar to Oliver Twist. His parents’ uncertain and untimely demise always lingers in the back of his mind, but it does not stop him from living an adventurous life. He goes to college in Boston, bartends in New York City, and encounters an array of vibrant characters along the way - some good and some bad - before returning to St. John’s. Subsequently, the story strikes one as more of a bildungsroman for Ned than a who-done-it about his mother and father’s disappearance. It is through the character of Ned Vatcher that Johnston has solidified a figure in the novel who is just as unforgettable and iconic as the fiery Sheilagh Fielding is throughout the entire trilogy. Whereas the latter will always be remembered by readers as the quirky columnist who fearlessly knocks bowler hats off of sheriffs and writes stunning articles that you never want to be on the wrong side of, Ned Vatcher will be remembered as Newfoundland’s very own fictionalized Wolf of Wall Street who brings the hustle and bustle of New York life to St. John’s with his tabloid newspaper and countless other business ventures. As he grows older, his attitude has the capability to make him downright dislikable as a result, what with his “reputation for eccentricity” (pp. 206) and his greed, emphasized through how his “money seems to multiply itself” (pp. 177). Yet, it is hard to dislike a millionaire who adopts an orphaned child and is still, decades later, determined to uncover the truth about what happened to his own beloved parents. Ned is as endearing as he is problematic, but isn’t everybody?Just as Ned spends the text constantly trying to figure out what happened to Edgar and Megan, even while he’s busy accumulating a fortune, so too will readers of the novel. Within the bildungsroman that is First Snow, Last Light, Johnston has planted subtle clues and motive regarding the Vanished Vatchers that can easily be missed the first time around if one is too wrapped up in other elements of Ned and Fielding’s story. Perhaps that is the whole point; the subtlety of the clues leads to the resolution of the mystery being just as surprising to ensnared readers as it is for Ned. However, if readers prefer for the mysteries that they consume to be wrapped up with a neat little bow, wherein the detective smokes his pipe and deftly unravels exactly what happened and how he knows that his conclusions are accurate, First Snow, Last Light might just leave them aghast, for it does not at all feature your traditional mystery novel conclusion. While we do learn, via confessions, what happened to Edgar and Megan Vatcher in November of 1936, Ned – and, subsequently, the readers themselves – are left without closure regarding the incident as there is a troubling lack of proof. There are never any bodies discovered to mourn over. There is only a version of the truth that is spoken, but never shown. For that reason, while Johnston’s mystery novel may not be conventional, it is extremely true to reality. Most of the time, mysteries – particularly those involving disappearances – go unsolved and, if evidence does turn up, it often turns up too late for anything to be done or for the loved ones of the disappeared to be consoled. First Snow, Last Light is thus an eloquent study in grief and how, even when questions are finally answered, closure can still be lacking."}, {"userName": "Janice", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "I had high expectations for this book, and I was disappointed. Had it not been for a strong ending, I would have trashed this book. Had it not been for The Syndicate Book Club, I wouldn't have finished the book and would have missed the strong ending.There wasn't one character that really drew me in except perhaps for Sheilagh. They were all flawed and unlikeable. Generally, that doesn't bother me and is not a deal breaker for my enjoyment of a book.I had thought that the story would be more of a mystery than it was. Instead, it was more an examination of family dynamics marred by tragedy, fettered by alcoholism and destroyed by blame."}, {"userName": "Nancy Croth", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/11906477-nancy-croth", "userReview": "I am giving this book a 4 star even though I think that Johnston over-wrote it. There was a period in the middle when I thought I was going to bail but I am glad I kept at it. Good character development allowed me to empathize with many of the characters. I love how he describes the landscape of Newfoundland! In the same manner as Colony of Unrequited Dream, he captures the wild, rugged, almost unforgiving beauty and power of the landscape. In much the same way, he depicts the hardiness and strength of the Newfoundland people. The narration alternates between Ned Vatcher to Sheilagh Fielding who we met first in Colony. This dual perspective approach brings a depth to the story that helps the reader connect with all of the characters.A long but worthwhile read!"}, {"userName": "Sharon", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/1585572-sharon", "userReview": "A real page turner from page one! A mystery that illuminates the history of Newfoundland."}, {"userName": "Tess", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/32894729-tess", "userReview": "5 stars"}, {"userName": "Margie O'Connor", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/39269763-margie-o-connor", "userReview": "Great story. A mystery unfolding so could not wait for the end in a good way. Was great to catch up with characters from previous WJ novels."}, {"userName": "Sheila Craig", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/10920159-sheila-craig", "userReview": "This one just didn’t do it for me. I think I enjoyed The Colony of Unrequited Dreams because it was fiction rooted with an actual historical figure and real historical events. While I was delighted to take up again with the wonderful Sheilagh Fielding, I felt that Ned, the main viewpoint character, was rather unapproachable. The entire novel revolves around solving the mystery of the disappearance of Ned’s parents. It just took too long to get there, and the resolution was too convoluted and unlikely to sustain my interest. Happy to be done."}, {"userName": "Doreen", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/8083149-doreen", "userReview": "Fourteen-year-old Ned Vatcher returns home from school one day in 1936 to discover that his parents, Edgar and Megan, have disappeared. Though he has to live with his paternal grandparents, Nan Finn and Reg, it is Father Duggan, a Jesuit priest, and Sheilagh Fielding, a friend of his parents, who become his most stalwart supporters. Cyril, Edgar’s brother, also remains an important character in Ned’s life, though not always in a positive way. Various points of view are provided, but the focus is on Ned and Sheilagh. Ned’s entire life is driven by his parents’ disappearance. He realizes that “to find out what had become of them would be the main goal of my life.” He also decides that unlike his parents who were destitute and debt-ridden before their disappearance, “I would never want for money if I could help it, no matter what I had to do to get it.” Unfortunately, he ends up losing himself. He becomes “deaf to the tones of my own life” and feels “There simply was nothing at the innermost of me.”Characterization is a strong element in the novel. Ned is a dynamic character who changes as the years pass. As mentioned, he is shaped by the mysterious disappearance of his mother and father; he spends his life “lamenting the loss of things [he] never had” and loses himself; at one point, he is pointedly told, “’I know who and what I am, Ned Vatcher. Not everyone can say the same.’” Besides Ned, there are other characters who are fully developed. Nan Finn and Sheilagh Fielding are among the most memorable. Both are sharp-tongued, targeting those who displease them. Nan Finn, for example, had no sympathy for Megan who was very unhappy in Newfoundland and yearned to return to London: “’I can tell by those eyes of hers. It’s a wonder dinner gets cooked what with her being so busy bawling and wishing she was there instead of here. . . . What do people do in London? . . . Sit around and talk to each other with their eyes closed. I better keep busy or I’ll get bored and long for London.’” Sheilagh’s targets are the rich and powerful; she writes a regular newspaper column in which she exposes their foibles and hypocrisies. Sheilagh appears in the previous two novels of the Newfoundland Trilogy: The Colony of Unrequited Dreams and The Custodian of Paradise. Both titles are actually mentioned by Sheilagh. It is not necessary to read these books first, but they do provide background to events which are mentioned in this third book. This book brings Sheilagh’s story to a close. It has been a while since I read the first two novels in the series and I think I may go back to them. Abandonment and disappearance are central motifs in the novel. Edgar and Megan disappear and leave Ned feeling abandoned. Sheilagh disappeared from the lives of her children and ends up feeling abandoned herself. Prowse abandoned Sheilagh and his children and in the end “There was no sign in [his eyes] of anything.” Phonse, Ned’s uncle, vanished at sea on a calm day and was never found; Nan Finn, in particular, tries to understand what happened to him. Ned adopts a child but makes a fateful decision which he comes to regard as his worst mistake, “his sin against his son, which was all too similar to the one that Edgar and Megan committed against him – abandonment to the hands of strangers.”Even Newfoundland is abandoned when there is a vote to join Canada; Sheilagh muses about “the colony of unrequited dreams that would never be acknowledged as a nation except by those of us who made it one.” Appropriately, the books about Newfoundland that are collected by both Edgar and Ned are lost or damaged. And it is surely significant that The Last Newfoundlander loses his voice because of a botched operation.As a former English teacher, I loved the many literary allusions. Sheilagh has a room in a brothel; she paraphrases T. S. Eliot’s “The Love Song of J. Alfred Prufrock”: “I grow old, I grow old. In the rooms the women come and go, talking of Mike and Al and Joe.” Ned alludes to Joseph Conrad’s novel when he speaks of being “in quest of the heart of no one’s darkness but my own.” Shakespeare’s Julius Caesar makes an appearance (“’I come to query Cyril, not to please him’”) as does The Tempest (“’We are all such stuff as murder is made of’”).One theme is that “you can taint your whole life by doing one thing wrong” so “even a good man might be the engine of a tragedy.” This theme is mentioned both at the beginning and the end and developed through the lives of several characters. Though the book is more than a mystery, interest is certainly maintained throughout as to what happened to the Vanishing Vatchers. Just like Ned, the reader will find him/herself trying to learn what happened to Edgar and Megan and why no trace of them was found. There are sufficient clues given so an astute reader may guess the solution. I have enjoyed Wayne Johnston’s previous novels and this one is no exception. It is great literary fiction with memorable characters, carefully developed themes, and a strong sense of place. Note: I received an eARC of this book from the publisher via NetGalley.Please check out my reader's blog (https://schatjesshelves.blogspot.ca/) and follow me on Twitter (@DCYakabuski)."}, {"userName": "John", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/17788622-john", "userReview": "If I could rate this with a half star I would have given it 4 and 1/2 stars. Like the other two Wayne Johnston books I've read (Son of a Certain Woman and Custodian of Paradise) I really liked First Snow, Last Light. There is a dark undertone to this one just as with his others, but also some great humour, even in some pretty bleak scenes. Fielding is her usual cantankerous self and often the source of much of the dark humour. Wayne Johnston gives you an inside look at Newfoundland and the St. John's community with a variety of voices in his characters that always ring true from start to finish. I still haven't read the first of this series, not having realized there was a series until I got going on this one, so will be reading the Colony of Unrequited Dreams sometime soon. Hopefully, it will still work even though I'm doing it the wrong way around. If you haven't heard of or read Wayne Johnston yet, you're really missing something. He's a highly underrated Canadian gem who can weave a mean tale of woe, mystery and good ol' fashioned Newfoundland humour as well as anyone out there these days."}, {"userName": "Barbara Wambolt", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/27724146-barbara-wambolt", "userReview": "Oh my goodness. The first thing I want to say is thank you for choosing me to read this book. I love the author Wayne Johnson and I loved this book. I received it about 6 weeks ago and I wanted to just savour it and I saved it to read on an upcoming trip to Newfoundland. I started the book on Sunday September 17 and finished it in the terminal in Port Aux Basque on Friday September 22 on our way home. I loved every page, every word. I could have read it much faster but I didn't want it to end. I have \"The Colony of Unrequited Dreams\" on my shelf so tell me if I was excited to win this book or what. I go to Newfoundland once a year with my husband on his September trip and this is his last trip because he is retiring but I would go to bookstores in Gander looking for this author. I enjoyed the ending and how I was so surprised by it. What can I say, I am thrilled to have this book on my bookshelf and I don't save very many. I loved the characters and how their lives mingled. Oh my goodness I just loved it all.Good job, well done Mr. Johnston.A fan for sure, Barbara Wambolt"}, {"userName": "Jane", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/14350303-jane", "userReview": "The strange, almost hillbilly-esque Vatcher family dominates this, the third of Johnston's interconnected volumes set in St. John's, Newfoundland. At age 9 Ned Vatcher arrives home to find his house cold and empty, his parents mysteriously gone. A Jesuit priest named Duggan steps in to stay with Ned for a few weeks while there's still hope that his parents will return. Sheilagh Fielding, last seen in The Custodian of Paradise, is there too. She was friends with Ned's parents, with his father at least. Ned ends up living with his bizarre grandparents - grandmother Nan Finn is the living definition of a shrew, while dumbstruck grandfather Reg scribbles confessions for the local priest and lies almost comatose; the apparent reason for this being the death of his best-loved son, swept away and drowned by a rogue wave while fishing in peaceful waters. Fortunately, Father Duggan is able to help Ned escape to college in Boston, and in time Ned becomes a wealthy businessman, constantly obsessed by and devoted to discovering his parent's fate. Meanwhile, we learn more about the strange life and loves of Sheilagh Fielding. A good read!"}, {"userName": "Virginia Van", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/51598118-virginia-van", "userReview": "When 14 year-old Ned Vatcher, only 14 comes home from school one winter day in 1936, he finds the house empty, his father's car gone the family car missing, and his parents missing without a trace. Murder/ Suicide? Had they run away and abandoned him? Finding out what happened to them becomes his life's obsession. Ned is taken in by his father's family, his grandparents, Nan and Reg, his Uncle Cyril and others, who are themselves haunted by the death of Ned's uncle Phonse, mysteriously lost at sea on a calm and sunny day. Two other people care for him as well: Father Duggan, a Jesuit priest, and Sheilagh Fielding, a boozy journalist whose satirical newspaper column pokes fun at the local elite. Compelling characters, a strong sense of place and a secrets piled on secrets makes this novel a great read."}, {"userName": "Carole", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/8276857-carole", "userReview": "Once again, Wayne Johnston has written a terrific story starring brilliantly portrayed characters and the vividly described setting of Newfoundland. The novel is based on the mystery of what happened to Ned Vatcher’s parents when they disappeared one day after school when Ned was just 14 years old. Johnston expertly creates a cultural setting for the story which makes it very complex and fascinating. Ned is a difficult character to like despite his childhood trauma but he is still very interesting. However, it is Shelagh Fielding, a journalist who previously appeared in Johnston’s earlier work, The Colony of Unrequited Dreams, who holds our complete attention. The shifting point of view is managed extremely well and adds a good deal of depth to the story. First Snow, Last Light is an excellent read."}, {"userName": "Sherry Monger", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/5548515-sherry-monger", "userReview": "Wayne Johnston writes of Newfoundland as though it were another character in the story - he writes with admiration and love for its tenacious grit and plucky determination. Johnston's characters are always eccentric, and hardy enough to survive on this often harsh and unforgiving island. Ned Vatcher comes home from school one day, to find his parents gone. There is no note and no explanation as to their whereabouts. Ned doesn't know if he has been abandoned or whether they have come to a bad end. Thus begins the mystery of this novel. The redoubtable Sheilagh Fielding is back, as reclusive and hard nosed as ever. Her friendship with Ned helps him through difficult times and while he eventually becomes a rich, successful business man - Ned is unrelenting in his quest to find the truth about his parents' disappearance."}, {"userName": "Janet Trull", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/30491972-janet-trull", "userReview": "It seems ages ago that I read Colony of Unrequited Dreams, the story of Joey Smallwood and Newfoundland's unique political history. Sheilagh Fielding was the savvy journalist who called out the misogynists and cronyism and and corrupt decision-making. In First Snow, Last Light, Sheilagh's back. With scraggly long grey hair and an alcohol addiction, she isolates herself by living in a room at a run down hotel, among the ragged people. She develops a strange relationship with Ned Vatcher, the central character in this St Johns mystery, as he becomes obsessed with finding his disappeared parents. His dad loved Sheilagh, too, even though she was a dangerous adversary. Not your typical Newfoundland story, but engaging to the end."}, {"userName": "David", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/9861663-david", "userReview": "A Tolstoyan novel of Newfoundland, as only Wayne Johnston could write, so that you feel the rocky, windblown landscape and the complex troubled people in your bones. Doris Lessing once wrote that: “once I say that words like good/bad, strong/weak, are irrelevant, I am accepting amorality, and I do accept it the moment I start to write a story, a ‘novel”, because I simply don’t care. All I care about is that I should describe Willi and Maryrose so that the reader can feel their reality.\" I would not call it amorality; I would call it an all-embracing sort of love, and in Wayne Johnston, this caring for/ love radiates through even the most vile of characters. A novelist at the height of his considerable powers."}, {"userName": "Daniel Kukwa", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/3885089-daniel-kukwa", "userReview": "If I was able to, I'd probably rate this 4.5 stars, as it is a bit more rambling and a bit less razor-sharp focused than \"The Custodian of Paradise\"...but only by a hair. If this is the end of Wayne Johnston's Newfoundland cycle, featuring the character of Fielding, then it's a magnificent, exhausting, triumphant end...an ode to the indomitable human spirit, and all the demons that get in the way of that indomitability. Bleak yet beautiful, rock hard yet delicate simultaneously...just like Newfoundland itself."}, {"userName": "Mar", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/7281574-mar", "userReview": "This book, while listed as third in the trilogy can, stand alone. Fielding, who figured prominently in books 1&2 is a main/constant character, but the plot does not revolve around her so readers don't necessarily need to know her back story. Basic plot surrounds a young boy who comes home after school to a dark empty house and spends his life trying to figure out what happened to his parents and what happens next for him. His sense of abandonment impacts his choices, and breaking the cycle of coping with pain also takes courage."}, {"userName": "Wendy", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/11450806-wendy", "userReview": "I usually like Wayne Johnston's novels, but I must admit that I don't know whether I would have finished this one if Sheilagh Fielding hadn't been in it. I really liked Ned in the first half of the book, the young boy deserted by his parents with no clue of their whereabouts. However, once he becomes rich and spends all his time drinking, he becomes a boring character. Fielding spends all her time drinking too, but she is much more interesting. Now I want to read The Custodian of Paradise, which is Fielding's story. She refers to the title at one point saying that it is a novel she wrote."}, {"userName": "Rebecca", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/1934015-rebecca", "userReview": "Sheilagh Fielding is one of my all time favorite characters. The Custodian of Paradise had some weird things happen, but the things *happened*, so I went along, because Johnston writes so well and because Fielding is so fabulous. Now the third book is all, \"Oh, wait. No those things didn't happen after all.\" This third book has Fielding basically saying, \"All that stuff I told you in the previous book? Well, LOL, I just made it up.\" I am so disappointed - and really feeling kinda crushed. Betrayed, even. Sigh."}, {"userName": "Liz Craig", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/19267163-liz-craig", "userReview": "Wayne Johnston is simply a treasure, and First Snow, Last Light is pure gold. Intricately and exquisitely plotted, it leads you step by step to a breath-taking \"reveal\" that on looking back leaves a reader gasping and thinking, \"Well, I never saw that coming!\" Then, you mentally revisit every way station along the storyline, and it's \"Wow, why DIDN'T I see it?\" That's when you truly see the work of a master craftsman and storyteller at its fullest and finest. Breath-taking. Exquisite. Magical. Poetical. First Snow, Last Light is a story to be savoured. For a lifetime."}, {"userName": "Ellen", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/5277472-ellen", "userReview": "I enjoyed this book, and powered through it in a couple of days. Wayne Johnston's writing is so readable and the mystery was well crafted. Sheilagh Fielding's character (revisited from 2 previous Wayne Johnston books) was a delight. I really get a kick out of her character. This was just a nice, easy read with the lots of \"Newfoundlandisms\"; or maybe they are \"Johnstonisms\", but nevertheless, quite enjoyable."}, {"userName": "Gail", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/56540779-gail", "userReview": "Loved this trilogy, loved all of the characters, especially Nan Finn. Appreciated the happy ending for Fielding. If anyone can weave in Newfoundland's history while capturing the landscape, weather, family life and Idiomatic personas from Canada's east coast Wayne Johnston can deliver!! The only thing missing is their unique accent, lol. Award winning material just the same. Oh, and yes there is a priest involved front and centre. Surprised? Nay."}, {"userName": "Gerard", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/64767439-gerard", "userReview": "Although I liked the opening first few chapters the story seemed to move so slowly it was hard to hold my interest. I am a big fan of the author but must admit I am totally disappointed with this particular book. I gave it a 3 star because he describes NFLD with such authority. He also has such interesting character development that it is hard to not to relate to them. Too bad the story line was just not appealing and dragged on without a purpose of solid conclusion."}], "description": "In the last of the trilogy of Newfoundland novels that began with the critically acclaimed, prizewinning and internationally bestselling The Colony of Unrequited Dreams, Wayne Johnston brings us an epic family mystery told in two voices: that of Ned Vatcher, the first Newfoundland media mogul, and the ever-fascinating Sheilagh Fielding.Ned Vatcher, only 14, ambles home from school in the chill hush that precedes the first storm of the winter of 1936 to find the house locked, the family car missing, and his parents gone without a trace. From that point on, his life is driven by the need to find out what happened to the Vanished Vatchers. His father, Edgar, born to a poor family of fishermen, had risen to become the right-hand man to the colony's prime minister, then suffered an unexpected fall from grace. His mother, Megan, London-born and already unhappy in St John's, spiralled deeper into despair. Was it murder? Was it suicide? Had they run away? Most of all, why had they left their only child behind? Ned soon finds himself enmeshed in another family, that of his missing father and the poverty from which the man somehow escaped. His grandparents, Nan and Reg, his Uncle Cyril and others, are themselves haunted by the inexplicable disappearance, years before, of a third Vatcher, a young man who was lost at sea on a calm and sunny day. Two other people loom large as Ned builds an empire to insulate him from everything that brought his parents down: a Jesuit priest named Father Duggan, and Sheilagh Fielding, a boozy giantess who, while wandering the city streets at night, composes satiric columns that scandalize the rich and powerful. In Ned, Fielding sees a surrogate for her two lost children, the secret that dogs her throughout her life, while Ned believes the enigmatic Fielding to be his soulmate. The novel builds to a spectacular conclusion, the solving of the bizarrely interwoven mystery of all the Vanished Vatchers. Only Wayne Johnston could create such a mix of larger-than-life, myth-making characters and amazing plot twists that leave us contemplating not only the tragedy of the Vatchers but the impossibility of resisting the forces that compel us to act in ways we thought we never could.", "title": "First Snow, Last Light\n      \n          (Newfoundland Trilogy #3)", "url": "http://www.goodreads.com/book/show/33877397-first-snow-last-light", "average": 3.88, "cover": "https://images.gr-assets.com/books/1497979514l/33877397.jpg", "reviews": 73, "authors": [{"url": "https://www.goodreads.com/author/show/54816.Wayne_Johnston", "name": "Wayne Johnston"}], "type": ["Fiction", "Cultural", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/33877397-first-snow-last-light", "http://www.goodreads.com/book/show/34461312-first-snow-last-light", "http://www.goodreads.com/book/show/95230.The_Colony_of_Unrequited_Dreams", "http://www.goodreads.com/book/show/870385.The_Navigator_of_New_York", "http://www.goodreads.com/book/show/296742.The_Custodian_of_Paradise", "http://www.goodreads.com/book/show/11691235-a-world-elsewhere", "http://www.goodreads.com/book/show/17262157-the-son-of-a-certain-woman"]}