{"ratings": 4650, "userreviews": [{"userName": "Aj the Ravenous Reader", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "Sorry for the long review/s lately. I seem to have a lot of things to say these days. Good thing for you, there’s this reading process called skimming. Lol! This is about the story of two people, one trying to blend in but who just seems to stand out more in the attempt and one who effortlessly stands out because of being very different and how these two people who don’t seem to matter much find a way to matter so much to each other.Before this, it’s been quite long since I’ve read an NA novel. TBH, I’ve been avoiding them because a lot of those I’ve read (although are good) seem to exhaust me or depress me or make me cry. In other words, a lot of them are tropes.Admittedly, you’ll find NA tropes here but they are surprisingly good that they don’t really come off as tropes. You’re allowed to hurt me if I used the word tr...trite one more time.  Yes, it’s told in alternating POVs of Gray and Dylan (just like in most NAs) but they narrate their stories in easy, simple language without attempting to torture your emotions or punish your brains. It’s actually a lot of fun reading their POVs because one is downright sarcastic and the other is just weirdly cute and funny.  Yes,  eyes are inevitably described here but not in that super detailed recurring annoying way.  Yes,  the heroine is pretty (like any NA heroine) but Dylan here isn’t the perfect, gorgeous, sexy heroine type. She’s more the lanky but cute, annoying type whose weirdness overshadowed her looks, who looked ordinary and odd from a distance but still exudes a striking quality. She’s got freckled nose, crooked teeth, wears baggy pants and still manages to look pretty and there’s no transformation, guys. There isn’t! She’s carefree and free-spirited and finds beauty everywhere and have so much appreciation for life and she reminds me so much of a favorite character, Stargirl. Best of all, she is entirely independent and knows what she wants in life. Too good to be true? Well, life is full of surprising possibilities, isn't it?   \"Why bother asking somebody permission to be yourself?\"   Yes, the hero is handsome (like any NA hero) but Gray isn’t the smoking hot, alpha male type. He’s more of the quiet and cute who doesn’t really know it type and who prefers to keep his profile low by not wearing shirts buttoned down halfway to reveal hairy muscled chest. He wears plain shirts, jeans and flip flops, yes flip flops (setting is Phoenix in summer).You don’t hear me say this often but I ship Gray and Dylan! <3 Here’s how I picture them. Lol! Yes, there are bed scenes (just like in any NA novel) but from a scale of one to five, five being pornographic and one being sweet, I’d say those in here are somewhere between one to two. Even their first time is so cute. ^^ I can’t help but laugh.  \"Should I just throw myself at her? Should I undress myself or let her do it?...\"  And look at that yellow book cover with a cactus. That’s perfect! The one I read was that with black cover with the boy and the girl about to kiss and I didn’t like it one bit. I wouldn’t have given it a second glance had Weng not recommended this to me. So thank you, my friend. For a New Adult, this truly deserves five stars. Highly recommended for anyone looking for a refreshing NA read! <3"}, {"userName": "Pearl Angeli", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/31514572-pearl-angeli", "userReview": "“When your world’s become one person, how do you prepare to let her go? How do you get over someone you know you’ll never forget?”\n Before I started this book, I was really excited because everyone seems to like it, most especially my friends on Goodreads. Seeing the synopsis and the sweet reviews, I told myself that this book must be really good because it definitely sounds right up my alley. Unfortunately after reading it, I realized that it’s completely different than what I was expecting, and sad to say… the book was not for me.I love the fact that the author was able to come up with such a sweet and innocent romantic concept in this book. Katie Kacvinsky was able to hit such notes that entail an emotionally-driven love story. The concept was fairly well done and the writing style was also beautiful.I think my main problem with the book was the characters. I was having a hard time liking them. Gray was a grumpy and a bit of a snobby guy at first– which did not make a great impression. For me, first impressions last and well, it definitely applied to me when his character was introduced. Dylan, on the other hand, fell a little over-the-top. I can’t seem to find her interesting at all despite the descriptions the author put into her. She was high-spirited, animated, and bubbly but for some reasons, I could not genuinely like her and get invested with her. I also think she was weird in a worrying way. Who in their actual mind will give names to everything? Like her car, plants, and even her freckles?\nShe tells me she names everything. Even her freckles. She turns her arm over and introduces me to two freckles close to each other on her forearm, Blake and Stacey. She claims they got in a fight with a third freckle, Meredith, farther up her arm near her elbow. I don’t encourage the conversation any further.\n Well, I also won’t encourage myself to entertain these thoughts any further as well. Lol.I also think the book was too descriptive. It lacked some movement. Also, there were some parts that are quite unrealistic, like how they started going out together even if they’ve just met like, few hours ago? And also how their conversation went deep in an emotional level after few minutes of talking during their first date.Anyway, this book really has lots of potentials to make me feel drawn. I like the ending. I think it was sweet. But like I said, it was just not for me. As thoughtful as the story appeared to be, it just didn’t get me.Raing: 2 Stars(This book was recommended to me by my sweet gorgeous friend AJ. Thank you, AJ! :) Check out her beautiful REVIEW on this book, guys!"}, {"userName": "Kathe L", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/25921490-kathe-l", "userReview": "Mann, what can I say about this one? That it was exactly what I needed and that's why it deserves 5 stars? But then, how can I give it this rating if it isn't perfect and I wanted more from that end? I was confused for days, only to decide that I would write the review first and then decide on the rating hahaWhat can I say about Dylan,  this girl that completely stole me? At first, I was certain she was a dream. I mean, how can someone be like this? But then, people always try to be a Dylan, daily. So, I wasn't crazy in my admiration of her. She is fierce, determined, compassionate, crazy, wants to travel the world, does the most crazy things and still, manages to be awesome in all of this, not caring with what people think of her (bonus points for that).In theory, we all want to be carefree, spontaneous and adventurous, but we have life in our way and Dylan doesn't care about that. She wants to meet new people, new places and new cultures. “I think about the people I’m going to meet. Where I’m going to end up,” I say, and zoom in on a pink and white striped rock wall that looks like a candy cane.“Wouldn’t it be nice to know?” he asks.” “I take the picture and hop off the car. “I love not knowing. My entire life has been predictable,” I say. “I just want to imagine it for a while.”And we have, on the other hand, a damaged boy that Dylan wants to \"fix\".Gray has faced something terrible in his life and because of that, he is miserable and depressive. When Dylan arrives, things start to change and it is fantastic to see them. Like, someone changing your life so much, to the best. He gets to know her completely and so does she; they are amazing people that your learn to love with all their qualities and imperfections. They were a bit too wise, for my liking. It usually never bothers me, but in this one... I don't know. I wanted them to do mistakes, to act like teenagers, because they are, and we do not know all the answers, like Dylan.But that's a personal thing - I do like characters best that do a lot of weird and wrong things. Don't be mistaken, this is a book that's def a you should read it book! The end? I thought it was... Okay? But I really wanted it to be something that would surprise me a lot, in a good way. But I still liked this a lot. I laughed, swooned, and learned a lot about life, something I'm usually not comfortable with doing but with this book, I liked learning things. It made me happy to see how I could relate with Dylan - it was refreshing. If I could give an award to a book, it would be this one. The award to the book that surprised me the most and that made me appreciate life to the fullest."}, {"userName": "Masooma", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/26677122-masooma", "userReview": "He is cold but she is hot. She is illogical and irrational while he analyzes logic and counts reasons. He's a snail basking in the shades but she is a rabbit hopping hither and thither. He has a pessimist outlook but she is an optimist. He's Gray and she is Dylan. Where Gray is a slow song more precisely Why not me. She's a fast song like Tik Tok She thinks he's a challenge, turns out he is interesting. He thinks she's weird, turns out she is as unique as a fingerprint. Both are opposites, both complement each other, are compatible and fix each other like pieces of a puzzle. Hence, they find themselves dancing along to the tune of love. But while Dylan is a bird with soaring wings and Gray is a solitary bird, comfy in the bars of permanency, can these two love birds strive and thrive together?First Comes Love offers the dual POVs of Dylan and Gray. Dylan's narrative is full of simple truths and philosophies. Whereas, Gray's account abounds in loss and lust. While there is little offered in the fields of differing styles, the contents of the two POVs are definitely different.The writing is a casual, conversational one with less dialogues and more narration of 'What we are doing' and 'How is everything'. This makes the writing a bit monotonous and at times, due to this, I felt like I was zoning out.Additionally, the writer also offers to tour her readers around Phoenix and LA. But, I think, love stories aren't really my cup of tea so I wasn't really enjoying it to the max. Nonetheless, for any person who loves romance/New Adult, this maybe a good read because it offers good chemistry, developed characters, sightseeing, photography and lots of music. For a golden and more reliable review, click here to read Aj's spectacular review."}, {"userName": "Daiane", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/32806732-daiane", "userReview": "Actual rating: 3.5 stars\n'Life is a story. We can make it a Harlequin romance, a mystery, a memoir. We can make it pamphlet-size or an ongoing series.“I want mine to be exceptional”'\nThis book is about the development of a relationship between two people who are completely opposites. Gray is this grumpy depressive guy who just wants to be left alone. One day, he meets Dylan, a overly energetic girl who is really pushy and likes to live life at its fullest. \n“My theory is everybody sucks. So, my conclusion is I don’t need anybody.”\nMost parts of the book is from his POV. I was actually glad for this as even though he has this don't-get-near-me vibe, he is really believable. We get to know his life, his dramas, his feelings. I could feel how alive he was, his happiness, his sadness, his love. \n If you only focus on the things you leave behind, you’ll never go anywhere.”\nOn the other hand, we got some of Dylan's POV. At first I really liked her. She liked to study people, help them and she felt happy doing this. I was almost getting my popcorn.Then I noticed I liked her from Gray's POV. It was like he put her in an altar and I got to the conclusion that he was the best person there. He saw her as this hero who makes he want to do better things to the world.\nShe can’t seriously think I want to be her friend. I give off all the warm welcomes of a Keep Out sign.\nDylan was the right person to help Gray. I really enjoyed reading as he came out of his seclusion and started to live again. She always had great messages and advice to give. Sometimes she was so random that all I could think is \"Okay, she should stop with her drugs...\" After a while these messages started to came out forced. She looked like she read too many great books with great messages that she was spreading those knowledge to the world without being in contest. Maybe she should just put her messages in a book, sell it and go live her life. Maybe that is what the author did. Go figure...\nThe first thing I notice about people are their eyes. It gives them away. You can tell how alive they are. How genuine. How deep they feel and how much they wonder. Kim’s eyes are dull and glazed over like they’re empty, like she doesn’t really see people. She just sees herself.\n\nPeople try so hard to be accepted, they turn into a walking stereotype. They’re pathetically easy to predict. They’re insecure and try to mask it with whatever product corporate America is currently marketing. And they always let you down. \nIt wasn't only in cheerfulness that they were different. While Gray had this ball of feelings exploding and making him alive, Dylan couldn't make me feel anything. She judges others about how their eyes looked empty, how they are consumed by society and that in the end, they are like empty shells. But with her analyzing everything, there were not a lot of feelings there. It was like SHE was the empty shell. \nIn my baggy jeans and messy hair, I know I don’t fit into this plastic palace. But I don’t want to fit in. That’s when no one notices you. You leave a longer impression when you’re brave enough to stand out.\nI think she tried really hard to look like she wasn't trying hard. She tried to be someone who doesn't care about appearances but she tried too much to be labeled as someone like that. \n I fell in love with a desert boy with blue eyes\nThe \"like/love\" came too fast. Too subtle on Gray's part, as I don't know what the heck was happening with Dylan even though I was reading her mind. It was almost an insta-love. She passes from the insane girl to the most interesting person in the world in a time space of 2 days. All in all it was still a good book. It was still inspiring full of creative questions and messages and it made me laugh. Maybe I would have liked it more if I had only read Gray's POV. And maybe my friends will want to have my head (sorry Aj!) but I think it just wasn't for me."}, {"userName": "Rachel Maniacup", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/37103769-rachel-maniacup", "userReview": "This book is recommended to me by AJ,my ever loving sister, and I want to thank her for being my greatest source of great books.^^This book is a beautiful story that when you started reading,you'll be glued to the pages. It is a story of two people who are completely opposite in most every way. The girl,Dylan is a smart,free-spirited,outgoing,open, and adventurous person.And I just love her! She's so cute and funny in a quite simple way that makes her unique and extraordinary.The boy,Gray on the other hand is a typical loner,snarky,closed off,mysterious,distant guy who prefers to be alone.Their story starts when Dylan went to Phoenix for the summer. She then met Gray(thanks for the geckos,hehe) and Gray suddenly became her tour guide,haha! When Dylan found out the reason why Gray is a cynical guy, it intrigued her more that she had set her self a goal..to help him and bring out the best in him. And while she does,they become friends and their friendship grows into a romantic relationship..a sweet amazing chemistry you thought would never happen between them,you couldn't help but swoon,especially when Gray was already the one swooning over Dylan and falling crazy in love with her.So far,Dylan and Gray are the best characters I've ever read in a love story I guess I liked the most,because theirs is a story you wouldn't want to end.This is my first book of Katie Kacvinsky and I'm sure It won't be my last. Her writing is well written and unique,I didn't expect that this NA contemporary is as good as Colleen Hoover's Maybe Someday.So to those of you who are looking for a cute,realistic love stories, I highly recommend you this unforgettable and remarkable book!^^"}, {"userName": "Jenny", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/38962215-jenny", "userReview": "“It's amazing how far you're willing to go when someone believes in you” I was hesitant to start this book,because there are very few NA books which I have really  liked .So thank you Aj for recommending this to me because I wouldn't have picked it had you not mentioned about this wonderful book ^^This book is beautifully written.First Comes Love is a story about Gary,who lives in his own world and doesn't let himself get attached to anyone after he lost his sister.And Dylan is complete opposite.She is funny,crazy;as in literally,cute,and full of life. Both characters are opposite in every way,still they become friends and starts their journey by becoming friends,visiting different places,doing crazy things,and falling in love.This book is from both Dylan and Gary's POV,and I really enjoyed it.I started liking Gary more after he met Dylan, because he changed a lot and actually started enjoying his life,his thoughts were really interesting to read.“I’d rather fail miserably pursuing my dreams than succeed at something I have to settle for” Dylan's POV was filled with crazy thoughts,but I also liked her alot.That girl could never think like a normal person.She didn't want to settle.She was optimistic about everything.I loved the way she wanted to live her life;travelling to different places,getting to know other people,and she also loved everyone.“First I thought she was crazy. Now I'm crazy about her.” I really liked how from being friends,they both started falling in love with each other,it was so cute!There were also some funny scenes in which they both did crazy things. I enjoyed reading this book! The story was simple yet beautiful and was filled with so many emotions that I just had to love it. It had been a long time since I read any book with only romance,and I am glad that I picked this because this is a kind of book which can lift up your mood and make you smile with so many cute moments! I loved the book,though the ending seemed okay to me,hence the 4 star rating."}, {"userName": "Eunice", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/6078895-eunice", "userReview": "I had the impression that this was an emotional book when I first saw the blurb. But turns out it was actually the opposite. Because not long after I started reading the book I find myself laughing with the characters. It was actually a fun, sweet and highly amusing read. And although that may sound like this is just an ordinary light and fluffy read this book never lacks the depth most emotional books carries. It was delivered in a way that would make you think and understand life lessons and insights easily without having to feel and encounter intense or sad emotions. And Katie Kacvinsky really did an amazing job in doing that. The characters in this book are just really remarkable. I adore Gray and Dylan. They're both relatable and genuine characters. Dylan is a very interesting girl. She's fun, does a lot of random things, and could be really weird and crazy most of the time but in a really good and refreshing way. Gray was a very real and lovable character. His problems and the emotional baggage he carries forced him to close himself to other people. He built up walls around himself and kept people at arm’s length and thought that he would never need anyone. Not until he met Dylan and his walls started coming down. Although this was narrated in both povs of Gray and Dylan, I think the story focused more in Gray's development and growth and how upon meeting Dylan everything started to change in him. His pov, even with all those things I describe about him that would make you think he's an emotional or fragile kid, was actually very fun to read. I had a lot of laughs with his thoughts and idea and I just love the realness and honesty with it. Here are some of Gray's lines I really loved:“First I thought she was crazy. Now I'm crazy about her.” \"She smirks as she applies some Chap Stick to her lips. I'm jealous of Chap Stick.\"\"We slump down on the leather couch and contemplate what to get my mom. Well, she contemplates what to get my mom. I contemplate kissing her.\"\"I turn the light off and catch my trophies out of the corner of my eye and I think of all the award I would give to her. Best Kisser. Best Lips. Best Everything.\"It was amazing to see the story of these two different people unfold. How they first met, how their relationship grew from companionship, to friendship then lovers. How both their characters and personalities developed through each other, how they discovered things and how their take and perspective in life changed after meeting each other. Kate Kacvinsky wrote it in a way that is just so utterly endearing and so natural with the right mix of humor and fun.Their love story didn't come easy, there were ups and downs too especially coming from their differences and different goals in life but through with that they were able to realize what they really wanted, what to do with their feeling, decide and take chances and make everything work. The ending felt like a bit cut short for me or maybe it's just me wanting more. But really, I wouldn't mind if this was longer. I would be more than happy to see more of Gray and Dylan's story.To conclude, this was such a fun, sweet but also really insightful read. I laughed a lot with Gray and Dylan and was touched by their relationship and how they overcome problems through the help of each other. And yes, of course I swoon a lot with them too, there were some pretty hot moments actually here that I, of course, devoured. And just to tease you, I'll leave you a quote from one of those moments:\"I take a step toward her and reach out to take the warm, damp washcloth from her hand. It has smears of makeup all over it. I stare down at her soft lips, puffy from all the scrubbing, and hesitantly run my thumb across them. I feel Dylan shudder when I touch her. Or maybe it's me. I hold her face in my hand and look in her eyes and she offers me the smallest grin, and that's all I need. My eyes fall back to her lips. They look warm and soft and inviting...\"So there it is, if you want more of swoon-worthy and hot moments I recommend you start reading this now! LOL! Read this! :DThis review is also posted at Book Overdose"}, {"userName": "♥Rachel♥", "userReviewDate": "Oct 26, 2011", "userURL": "http://www.goodreads.com/user/show/5481477-rachel", "userReview": "3.5 StarsDylan is a free spirit looking for anything new to experience, and relishing the random in life. Noticing what others overlook, like Gray. She is intrigued by him, notices him even though he does his best to blend in, and this is what makes him stand out even more to Dylan. Gray, appropriately named, is in a cloud still reeling from the loss of his twin sister, he goes about life trying to keep everything and everyone out. If he stays numb, he won’t get hurt. That is until Dylan forces her way into his life, much to Gray’s annoyance. His first impression of her is: awkward, bizarre, and disheveled. She doesn’t care what people think, she was born with a “judgment proof shield.” Gradually, Gray’s feelings change from annoyed to fascinated. Dylan opens life up to Gray again, getting him to look at the world again, and open up about his sister. He starts to remember the good things and celebrate her life instead of remembering the pain, and this is exactly what he needs to heal. Soon Gray looks at Dylan with fresh eyes and falls hard. But can anyone hold down the free spirit that is Dylan? While I did enjoy this story, there was something I felt that was lacking. At the heart of the issue is Dylan. For some reason I didn’t connect with her character, she felt a little contrived, and I had a hard time feeling she could be an actual person. I had no such problems with Gray. Even though he was moody and prickly at first, you could easily see why. I felt for him, I got him, and when he opened up and let Dylan in, I was in love! Dylan’s words: “I don’t let myself get attached to people, but Gray does. That’s why he hardly lets anyone in.” Every quote that I was swooning over was from his head, his POV. Let me tease you with one: \nI stare down at her soft lips, puffy from all the scrubbing, and hesitantly run my thumb across them. I feel Dylan shudder when I touch her. Or maybe it’s me. I hold her face in my hand and look in her eyes and she offers me the smallest grin, and that’s all I need. My eyes fall back to her lips. They look warm and soft and inviting. My heart is pounding. I close my eyes and lean down and press my lips against hers.\nEven with my issues with Dylan, the writing in this story was beautiful, unique, and moving. Ms. Kacvinsky’s descriptions were almost poetic without being over the top. She clearly has talent, and I would like to pick up more of her work in the future. I must say something about the cover, because that's what initially drew me into reading this story. Isn't it the most swoon-worthy thing you ever saw?! *sigh*You will find this review and more at The Readers Den."}, {"userName": "Marla Mei", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/11172432-marla-mei", "userReview": "4.5 starsFirst Comes Love is the book that you can never pass up. (Of course you can, but I tell you, you shan't!!!) It will sweep you off your feet and ignite those dormant butterflies in your stomach. Now, as the cynic that I am, I do find it hard to believe that I actually said that, but yep I just did. Usually, this kind of story would've earned interminable insults from me for being too far-fetched but with First Comes Love, it was just different. Maybe it was the author's writing, the plot development, the characterization or maybe just everything about it. This book has simply enraptured me just from its very first pages and I couldn't put it down no matter how heavy my eyelids already were. I swear almost half of my copy of this book has been highlighted!!!! Though the story was about a boy and a girl who fell in love, I wouldn't consider this as purely romance. The relationship between Gray and Dylan started out as acquaintanceship with Gray seemingly reluctant at first with the the quirkiness Dylan shows. Gray has built walls around himself after his twin sister died but then he meets Dylan, the girl who reminds him of the sister he lost. And being with her reminds him of who he was before - happy, spirited and full of life. Dylan was the very last person Gray thought he'd be interested in. But Dylan was just so vibrant and altruistic and carefree that it got impossible for him to spend a day without her.\n“First I thought she was crazy. Now I'm crazy about her.”\nThe only flaw I did see was the fact that somehow, a person like Dylan can never be real. First, she's a wanderer, a vagabond. Is it just really easy for her parents to let their 17-year old daughter hop from one place to the next? Don't they care for their daughter at all? Second, how it was very easy for Dylan to just leave Gray for her desire to see the world and discover herself. She says that if they are really meant to be together, then fate will bring them back together again. But can't Dylan see? It was fate that brought them together in the first place. It's already brought them together. Why still test fate when it has already done it's job? I do believe in fate but I just don't really see what Dylan did happening in real life. Why let go of someone when it's already in front you? Maybe she's just really different, is all. Which brings us back again as to how Dylan can't be real.So you see, the only reason I didn't fully give this a five-star rating was because of Dylan but all in all, this was still a great read. And oh! Check out some of these quotes that made my heart hurt and the reason why my whole copy of this book is now almost full of highlights:\n“I couldn't sleep,\" she confesses.\"Why not?\" I ask.She smiles at me. It's this sweet, innocent smile, and it makes my heart stammer.\"You didn't kiss me today,\" she says. \"And I wanted you to.” \n Cheesy but <333.\n“Most people hold their fantasies out of reach, as if their desires are a mountain they could never summit. They settle for living at the base of the mountain instead. There aren't as many obstacles, or avalanches, or unexpected delays. But they'll never be able to see the view from the top.” \n Roger that.\n“But pain's like water. It finds a way to push through any seal. There's no way to stop it. Sometimes you have to let yourself sink inside of it before you can learn how to swim to the surface.” \n SO. DEEP.There are more so just read the book!!!!"}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "Oh,wow. This story is something else. Something I've never read before. Really special. The blurb doesn't begin to describe how awesome Gray and Dylan are. These characters! I love them! They are so real! I could gush about them for ages. Oh, this lovely, lovely book! It was so wise and quotable! If I persuade only one person to read this book I'd be so happy. That cover is misleading and distracting. Don't get me wrong, I like it but it doesn't really show Gray and Dylan as they really are. Something like the cover of \n by Simone Elkeles only with Gray's cap and Dylan's baggy jeans. Our heroes- Gray and Dylan go to the local community college. Gray is a loner and as he said, numb to the world. That all changes when he sees Dylan taking pictures of two geckos 'talking' (aww :D). She sees Gray is acting defensive and decides to help him come out from his shell. What she didn't expect is falling in love with him. Eight months ago Gray's twin sister, Amanda died and since then his family hasn't been living a full life. They never talk about Amanda or to each other. Gray avoided his friends and eventually they all stopped coming around and gives up his scholarship to play college baseball. Dylan wears baggy jeans and carries her camera with her everywhere. She is a free spirit and does a different thing every day. Every day is a new challenge and she convinces Gray to loosen up and join her adventure and road trips. She eventually helps him heal and he finally confronts his parents. Even though his sister is dead, he is still alive and deserves attention. And now I found out there's a sequel! I had no idea! Hope it's as good as First Comes Love. Check out this review and much more over at YA Fanatic."}, {"userName": "Donita Luz", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/18877120-donita-luz", "userReview": "\"You're never going to experience anything if you wait around for perfect conditions. Look at the sky, Gray. It's gorgeous. It's perfect right now, and you're miss-ing it.\"\n I felt like those words were directed to me. Remember that time in college when you have to review for an exam, that you start highlighting important things in your book, only you ended up highlighting ALMOST every paragraph, sentence there is, because you're worried that you might miss something important? Something that might help you later on? Yeah, that was exactly what I felt when I was reading Love comes first. I felt the need to remember and absorb everything for life references later on. Weird?First Comes Love is light and refreshing read. There are reasons why contemporary romance is one of my least genres. Cliche, if I must say, but Katie Kacvinsky, completely caught me off guard. This is my first from her, although I have her other book, Awaken, on my TBR for like forever. If I ever had any doubt reading that book it's gone now. Katie's writing is lyrical, intense and simply mesmerizing. It's one of the reasons why I couldn't stop reading, I actually devoured it in one sitting! Gray is a mysterious, anti-social, aloof person who gives out a go-away sign vibe anywhere he goes, ironically, this was the same reason why he somehow caught the attention of Dylan. Dylan who's a complete opposite of him. Dylan who live life to the fullest and Dylan who always see the best in people, a complete opposite of him who is just going on the day, living, just by the mere fact of existing, his way of guarding his heart if you ask me. Dylan is the most random person Gray have ever met and the least person he expected to change his life, for the better. And no, I'm not exaggerating. Ever heard of the right love at the wrong time? Because that's exactly what this book is about if you ask me. Some may say this is too cheesy, hell, I would probably say the same thing, before... but this book just taught me quite a few things about love and relationship I've never had the pleasure of experiencing. Love comes first made me realize just how close-minded I was when it comes to relationship. I gave practical advises, I could see a way out right away, I thought I was being practical and realist, when in truth, I was being insensitive. I know now that it wasn't the best way to do it. That sometimes, we don't only have to put ourselves on their shoes, but we also need to live their life to fully understand them. I didn't know if I made the book justice with this review, but all I can say is, this book is a bucket of overflowing feels. Hopeless romantic people will definitely love this book but realistic and practical people may find this overly cheesy for their taste. I'm inbetween, you see, depends on my mood, :) For me, the experience is exhilarating and refreshing and I love it!Thank you so much to my friends for encouraging me to read this book despite my tendencies to shy away from contemporary romance! <3Check out their reviews here:Aj the Ravenous ReaderHenz"}, {"userName": "Joy (Cheery♡Reads)", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/3826621-joy-cheery-reads", "userReview": "Wow. This was so awesome. I love everything about it and I just can't pick one quote to share. The whole book itself is a memorable quote. It made me laugh, cry and fall in love with it all over again.This is one hell of a book and Dylan is one crazy, lovable character. She has all these eccentric and insane ideas. She is full of life and is literally living life to the fullest. She is like a hurricane that tosses you inside out and upside down. She is like the sun that shines so bright you have to shield your eyes. But she stays. You remember her for all her quirkiness because she refuses to be normal. She outshines and she stand out.Gray is such a wonderful and great guy. He shuts himself off from the world and life itself. He lets each day passes by as it is until he meets crazy Dylan. He is stubborn and determined. He is sweet and adoring. I love his devotion and the depth of love he has for Dylan. He knows what he wants and how he feels. He holds on to it and doesn't let go. He is like thunder and lighting and the moon that orbits around the earth. His chemistry, attraction and love with Dylan are undeniable and like dynamites. It blows up in your face and leaves you breathless, wanting for more.First Comes Love is truly memorable and a keepsake. The ending left me dreamy and imaginative. It was a perfect end and start of a new beginning. Katie, you are awesome and I look forward to reading more of your writings.This is one of my favorite quotes. For those who have read this book, you know where it is.But I know who I love. And I'm figuring out that might be enough to live for.\""}, {"userName": "Natasha", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/5541180-natasha", "userReview": "Wow, I am the first one to review this book, UMMM no pressure. LOL. Dylan and Gray are very strong characters! This book has so much great life advice in it. Kudos to Katie for such a great imagination and writing ability. I love how Dylan \"suffers from creative outbursts!\" :) One paragraph from this book really stuck with me and I relate to it so much in my own life. \" I think everyone's caught up in these tiny narrow minded-minded worlds and they're deluded enough to think their world exists in the center of the universe. Relationships only happen when it's convenient. You have to walk on eggshells for people because thats about how strong they are these days. And you can't confront people, because if you do, that brittle shell of confidence will crack. So we all become passive cowards that carry a fake smile wherever we go because God forbid you let your guard down long enough for people to see your life isn't perfect. That you have a few flaws. Because who wants to see that.\" Who can't relate to that! Although I understand why, I felt like Dylan was being selfish for choosing seeing the world & self discovery over her love for Gray. First off I think she is pretty well self discovered. And second she can do both. It isn't fair for her nor Gray to just let go when they have such a perfect love! Katie is a new author, this is her second book. However she writes like she has been doing it FOREVER! I really really like her mind, her stories, the way she tells them pulls you in and sucks you up! I hope we get much much more from you Katie! Thanks for the HONOR to review your book! Wish it came out sooner."}, {"userName": "Kyra", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/31172066-kyra", "userReview": "Rating:  4 stars! A perfectly imperfect love story.FULL review here:https://deardariamorgendorffer.wordpr..."}, {"userName": "Sharlaine ", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/5311709-sharlaine", "userReview": "[image error]"}, {"userName": "Donish Henry-Cole (BookItWithDon)", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/43792673-donish-henry-cole-bookitwithdon", "userReview": "3-3.5 Stars! Words for this book:  Grief. Friendship. Love. Second chances. First love. Hope. Inspiration. New beginnings. This book is about two individuals who find one another at different times in their lives while being complete opposites. We have Gray who realistic, grumpy, sarcastic and likes to be alone but on the other hand we have Dylan, who is energetic, hopeful, free spirited, lives life to the fullest and open minded to everything.  (Gray and Dylan are SO catdog) Gray and Dylan meet one day and from that day on Dylan has been by Gray's side unasked and willing. The book was mostly from Gray's POV, and I'm happy it was because I like reading from men POV's more than females sometimes. Even though Gray is grumpy and sarcastic 90% of the time, I enjoyed seeing him grow and open up throughout the story because I could feel his pain, happiness, and love and I found it to be beautiful.  “Hey, God, did I do something to piss you off? Because I'm starting to think you enjoy twisting the knife in my heart every chance you get. If too much happiness dares to encroach on my life, does some siren go off up there? Uh-oh, Gray's too happy right now. We can't have that. Time to shit all over his life again.” We also have Dylan's POV and at the beginning of the story, I found her to be weird and unique. I liked that she wanted to help Gray open up and be the person she saw he could be. I find it admirable when an individual can help another person with their problems and stick by their side through it all instead of just brushing them off. I admired Dylan's determination, but that is also something I was annoyed with. Like I said, I liked Dylan at the beginning of the story and admired her but then I felt like it started to get to be too much? She would start to be too nosey/push in Gray's life and she would randomly say/do things for no reason that I swear she found on google and she would say/do it just to remind Gray she was 'different'. I liked her better from Gray's POV, and I probably would have continued liking her if she honestly didn't have her own POV. When I read that she named her car, I was like  'okay'  , but when I started reading that she names her freckles, and that they speak to each other? I started getting a headache with her.  'She tells me she names everything. Even her freckles. She turns her arm over and introduces me to two freckles close to each other on her forearm, Blake and Stacey. She claims they got in a fight with a third freckle, Meredith, farther up her arm near her elbow. I don’t encourage the conversation any further.' The highlight of the book for me was when Gray and Dylan 'first' got together. I found it to be so innocent, hilarious, sweet and adorable (GOD BLESS that It was in Gray's POV). I could honestly feel Gray's happiness through that scene haha. Gray giving himself a pep talk was probably the funniest part in this whole book. “I shut the door and try to pee, but my dick's already sticking straight up at the ceiling. Great. I'm sure she caught that minor detail. We haven't even kissed yet. I shake my head and do my best to pee. I pull my pants back up, trying to make my hard-on less obvious. I stare at myself in the mirror and splash cold water on my face to calm down. My face flushed.I concentrate on one critical thing. Last, Gray. You've got to make it last. No two pumps, you're done. Don't be that guy. You're stronger than that.Think sports.Try to name every candy bar you can.\" I can see why everyone loves this book because don't get me wrong it's great but It's just not my cup of type?  STILL  read it though and you guys let me know your thoughts on it and if it's different from my opinion. For more reviews! Click below :)"}, {"userName": "Rachael Wade", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/5369812-rachael-wade", "userReview": "\"I feel like I violently teeter between these two selves. And I've decided to chase my wild side. I don't want to have any regrets. I think the worst mistake in life is to wonder, What if? I'd rather fail miserably pursuing my dreams than succeed at something I have to settle for.\"Wow. This book sent me all over the map. I went from liking it, to disliking it, to loving it in the end. It drove me crazy. I think the hardest books to review, rate, and enjoy are those that tear you straight down the middle. You know, that 50/50 love/hate relationship thing that drives you nuts. When there are so many wonderful things about the story yet certain things that prevented you from adding it to your 5-star favorite shelf. I’m convinced that our favorite shelves are comprised of books that ended the way we wanted them to, depending on our mood during that particular time in our life. I'm sure that's why there’s not a universal favorite shelf for everyone. Our experiences with stories are so, so personal. Those factors are what (I think) contributed to the wide range of emotions I experienced while reading this book.First, I love the author's voice and style. She really writes beautifully and I loved that this didn't feel like a typical YA contemporary romance. It had real heart and made you think. And upon reading the little extra at the end where she discusses her inspiration for the story, I fell in love with her voice even more. Maybe it’s because I can completely relate to where she was coming from. But it’s the message at the end of the story, and the author’s note on inspiration, that made me love this book in the end. We’re all sort of torn between two worlds, two “what-if” versions of ourselves, two alter egos. As human beings, we’re naturally attracted to safety and stability. Sensibility. Logic. And yet we all have a free spirit. Some more than others, but I really do believe we all have at least a small curiosity or desire to live freely, to live an adventure and make the most of every second. Some people never tune in to that part of their spirit. Some are too afraid. Or too content where they are. There are a million reasons people cling more to safety than a life with wings.And at its heart, that’s what this story was about. Teetering on that in-between line...wanting to commit to something and make it your home (whether that’s a physical person or place) or committing to nothing but your freedom and breaking away from anything that ties you down. This is where Dylan drove me nuts, and where I empathized with Gray. Somewhere around the 50% mark, Dylan's character became a little too much for me. Her dare-to-be-different attitude and off-the-wall dialogue was just a bit too weird for me...and not in a cool way. She was already grating on my nerves, but by halfway through the story, I was officially tired of her. And when she decided to do what she did toward the end, I seriously disliked her. Then, thank God, she learned from her mistake and made the right move. There is such a thing as compromise, and being “tied down” to someone does not mean you have to give up your wings. That’s probably why I was so angry with Dylan toward the end. Because personally, I’m equally a free spirit and love having a place (and the love of my life) to call home. There is always a way to make it work, to satisfy both kinds of dreams. So I couldn’t grasp for the life of me why she had to make it so black and white. Why it had to be all or nothing. I sided with Gray completely on this, so I liked his character much more. Additionally, his humor and sarcasm were great and it was satisfying to see him come out of his shell and come back to life. Even when he changed, he was still himself. It wasn't this drastic, unbelievable kind of development...it was realistic. I’d recommend this book to anyone looking for a realistic YA romance that offers more than just your average boy-meets-girl-they-fall-in-love theme. This story will make you think about life, how you value it, your desires and dreams, and what you’d be willing to give up to go after them. Most of all, it’s about learning what a real regret is and how to recognize one before it’s too late."}, {"userName": "Alex", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/10042648-alex", "userReview": "\"But there are also some terrible words,\" she continues. \"Like membrane. And moist. And protoplasm.\"I received this book as a birthday present about a year ago, and really wanted to read it. And I ended up not getting a chance to for a really long time. And thank goodness I picked it up a couple days ago because I loved it. It was hilarious, awkward, exciting, and romantic. It really is the way first love is. I wanted to shout to the skies when I found out both Dylan and Gray were virgins. You know why? Because that is way more realistic then Gray being a huge player who sleeps with any girl with a rack, and Dylan being a scared virgin who's sheltered. Screw that plot-if you're looking for a more interesting story, here's the one you've been looking for.Gray and Dylan where character's that were so special to read; they were really real. The book First Comes Love is fun to read. It is a little short for my liking, and the ending kind of bothered me a bit, but ignoring that, it was a great story. Gray and Dylan seem like total opposites. Gray is to himself, and can't be bothered, whereas Dylan sees the light in everything. She did random acts of kindness throughout the entire story and it made me pleased to see a character so selfless. They may seem like an unlikely match, but they went great together. Dylan's philosophy on life was exactly what I needed to read because I needed something fresh.\"Totally exposed, with no regrets. You can tell this cactus lived; it has the battle scars to prove it. Why go out looking perfect and put together? It means you didn't experience anything. You didn't take any risks.\"The love story was fun to read, especially as it was developing. I mean, it's almost like you're laughing at the characters; I laughed when Gray stared at that girl's boobs in the beginning and just wanted to tell him that in about 3 months, nothing like that would matter to him. He loved Dylan, and Dylan loved him. I loved the scenes with Boba because Dylan and Gray really seemed so great together in those moments.I was happy to see that, when they did have sex, it wasn't ridiculous. Come on, you know what I mean; in new adult books where the virgin just so happens to be amazing at sex. It was awkward the way first love is. I also really enjoyed getting to be in both Dylan and Gray's heads, reading what they were experiencing.I close my eyes and lean down and press my lips against hers. For how skinny Dylan is, for how lanky and strange and goofy and hyper, kissing her is a totally different experience.\"This (^^) was one of my favourite lines the in the book. It shows that not all love stories include a buff, built man, and a woman with huge boobs and curves. The humour in the book, like I said, is also great. If things get heavy or frustrating, Katie Kacvinsky does a great job of incorporating a few laughs to lighten the subject.It's an honest, beautiful romance that really shows the awkwardness and joy of first love.Favourite quote:Modeling, huh? That would explain why her thoughts rarely extend beyond her body. Apparently food encourages not only fat cells, but thinking-two things models seem to be missing, from my experience of knowing a few in high school."}, {"userName": "Claire - The Coffeeholic Bookworm", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/19367448-claire---the-coffeeholic-bookworm", "userReview": "Oh yes, finally! Thanks so much to my GR friends, Donita, Henz and AJ who suggested this book. Forgive me because it took me a while to read this. After the ordeal I've been through a month ago, I know I deserve this book. Finally, yes I've read this. Now let it be known that I'm utterly in love with this novel. \n“I couldn't sleep,\" she confesses.\"Why not?\" I ask.She smiles at me. It's this sweet, innocent smile, and it makes my heart stammer.\"You didn't kiss me today,\" she says. \"And I wanted you to.”\nAmong the book boyfriends I have loved, I think Gray didn't fit their category. He was brooding, reserved and unforthcoming. Felt like I wouldn't last a day with him looking morose and feeling detached all the time. But there's a reason to his aloofness and unorthodox behavior. That I understood. That made me sympathetic and empathetic about him. And that had drawn Dylan to her. Yes, Dylan, the exact opposite of our main character. Careless, happy, life-of-the-party, danced like nobody's watching. She didn't want to just sit and sulk and stay stiff. She faced the world with a smile because she thought the world needs it. When she looked at photographs, she saw the beauty in it and ignored the flaws. She's the best friend I've always wanted to have.\n“Because if you’re lucky enough to have people in your life that make you happy, that inspire you, that move you, you need to devour each moment you have together because you never know how many of those moments you have left. These people are sacred.” \nBoth characters faced challenges and ordeal in their lives but they were dealing with tragedies differently. When Gray saw the world through Dylan's eyes, he realized what had been missing in his life. He contemplated, he reasoned, he smiled. He changed. I was definitely having a throwback moment after I read this book, my gosh, I felt like a youngster and I was loving it. I loved Dylan and Gray's complicated relationship. The way they looked at the brighter side of things, the way they faced the darker side and the way they talked about their lives. The ending was quite hurting but I managed to keep my eyes from tearing up because I know, there's still a Second Chance. \n“I don't want to lose you,\" he says.I stop because I finally know what I need to say.\"Gray, I'm not yours to lose.” \nFirst Comes Love is like a ticking time-bomb, every minute gets you excited, every first time makes you want for the second and the third. If this book is a lightning, boy I'd be glad to have been struck by it. I think, Kate Kacvinsky might just have climbed her way to my top favorite authors list."}, {"userName": "Keertana", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "Rating: 3.5 - 4 Stars Katie Kacvinsky, the author of First Comes Love, describes her book by saying, “this book is half dream and half reality, half experiences I've had and half experiences I would love to have,” and she couldn’t be more right. First Comes Love is a love story unlike any other – not because of its originality, but because of its characters. The GoodReads summary of this novel barely provides the reader with a true glimpse of the depth and potential of this story, so I began this novel barely knowing what to expect. Surprisingly, I found myself caught up in the unique writing style, provocative perspective, and refreshing young romance. After the death of his twin sister Amanda, Gray has closed himself off from the world. Now, he has no friends, his relationship with his parents barely exists, and he’s quit baseball, the very thing that kept him tethered to life. So, when he meets a strange young girl over the summer requesting him to give her a ride home, the last thing he expects is for his life to change. Dylan however, is unlike any other girl Gray has ever met. She pushes aside common clichés and stereotypes, living each moment as if it’s her last and not caring about what the rest of the world thinks. She puts others ahead of herself and when she meets Gray, she is struck by his enigmatic personality. Slowly, an unlikely friendship and eventual romance begins to form between the two. Yet, the summer is coming to a close and Dylan is on vacation in Phoenix, the sweltering town that Gray calls home. When it comes time for them to part ways will they be able to do it? Or is what they have truly just the emotions of young first love? This novel perfectly captures the emotions, feelings, and confusions over a first love. I really enjoyed reading it and the love story was original, compelling, and believe-able. I loved the way it slowly unfolded and the pacing was perfect. The relationship between Dylan and Gray transitioned perfectly from strangers to friendship to attraction to love. Furthermore, I loved that this book was about more than the romance. Dylan is a whirlwind of life, philosophies, and vibrancy and she is able to re-awaken the inner Gray who seems to have disappeared after his sister’s death. The death of Amanda truly shaped not only Gray and his family, but also his relationship with Dylan which I thought was very important. It made their connection that much more real and tangible to me. Yet, despite loving the plot and the romance of this novel, there were still a few faults with it that tended to grate on me. First and foremost: the writing. Kacvinsky writes in a unique manner which can come off as juvenile at first. In a few scenes, she tends to revert to paragraphs describing what Dylan and Gray spoke about or what they did opposed to writing out their full dialogue. “We did this…and then this…and then this…” or “She said this…and then this…and then I said this…” At first this didn’t affect me too much, mostly because I didn’t notice it at first. However, as the story progressed, this method was employed more often. That’s not to say that there wasn’t dialogue in the novel, because there was, especially during the first half. After that, I felt as if the dialogue was selective and whatever the author revealed to us through the dialogue was important, special, and very purposefully worded. In some instances, this worked very effectively. The reader does not want to know their entire dialogue about coming up with interesting questions to pose to strangers or their conversation about the random acts Dylan decides to do every day. The important aspects were in dialogue and all their conversations appeared that way too, but towards the middle I felt as if this style caused the writing to drag a little. I began to skim through the paragraphs, jumping straight to the dialogue. However, this style was used very selectively and rarely and although I enjoyed it for the most part, other readers may not like it as much or it may become slightly cumbersome. First Comes Love switches perspectives between Dylan and Gray and to me, I always felt as if Dylan’s perspective was distant. It was so hard for me to relate to her. I enjoyed this book as much as I did because I could see why Gray loved Dylan, what made her unique and special through his eyes, but I couldn’t quite see the same way in Dylan’s perspective. Gray’s point of view dominated the story, which was fine with me, but I almost wish the entire story was written from his perspective. There were some critical and important scenes that needed to be told from Dylan’s point of view, but either than that, I enjoyed Gray’s perspective a lot more. Another aspect of this book that I was slightly upset about was the explanation of Dylan’s decisions. Dylan is hyper, she constantly needs to move, and she wants to travel the world. Love and being tied down by relationships don’t fit into her plan, but reading this novel, I would have never comprehended this part of her. I felt as if the only reason I understood Dylan’s decision so well was because it was, in many ways, similar to Katsa’s decisions in Graceling by Kristin Cashore. The two novels and characters are completely different, but in regard to their decisions about relationships, they were a little similar. Nevertheless, I really enjoyed First Comes Love. The love story is bittersweet and will tug at your heart, the relationships are tight and well-written, the plot is engaging and slow to develop, and most importantly, the characters are memorable and unique. A small part of me wishes that there was a chapter or two more before the ending since it was a tad bit rushed, but overall I really liked the conclusion. Perhaps what I loved most about this book was the character growth and development. Both Dylan and Gray go through immense transformations because of their relationship and that was truly heart-warming to see. Furthermore, their relationship is so real. It’s not all hearts and flowers; they struggle through their problems, but they overcome them. Also, the understanding between these two was unbelievable. They both accept each other for who they are and change one another’s lives for the better, which, in my opinion, is an important aspect of true love. First Comes Love had a lot of potential to be a better book, but I thought it was beautiful just the way it was too. There are definitely parts of it that I wish were better written, tighter, or had been expanded, but ultimately, I really enjoyed reading this. I simply couldn’t put it down and was kept all night reading this gripping love story. Kacvinsky’s characters will make you think and ponder your own life and, more than simply having read a book by the end of it, you will feel as if your life has changed a little too.  So many people worry their lives away. They take themselves so seriously. They try to fight time and aging and gravity and death. They spend so much time stressing and planning and over planning that they miss out on living. I never want to be like that. I never want to waste time. After all, we’re just passing observers, as insignificant to these giant formations as a speck of dust. So we might as well appreciate the view and enjoy the journey."}, {"userName": "Mike", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/938018-mike", "userReview": "Well...I just don't know what to think about this. I've been teaching for 30+ years, and I've raised two girls of my own. But I'm new to writing and publishing, even newer to the Young Adult genre. I remember years ago, probably '86 or '87, Fayetteville, Arkansas, was splitting at the seams because someone at the school had selected The Chocolate Wars as required reading for one of the English classes, and I can't remember which. A group of concerned citizens had purchased and entire page in the local newspaper and printed a section of the book with the words that couldn't be printed in the paper redacted so community members would know that a great deal of the content was not suitable for public viewing.It's been 25 years, and Kacvinsky's book includes the F-bomb several times, but never for the act. It is pretty graphic, not about the act, but the sexual relationship between the two main characters become intense and frequent at one point. Before their first episode, Grey goes into the bathroom and we read his description of the scene. \"I shut the door and try to pee, but my dick's already sticking straight up at the ceiling.\" This is followed by some very honest discussion about how he feels to have had sex, \"I do the 'I just got laid' walk for days after our trip to Los Angeles.\" Later, he explains that he's getting better at this, \"I've figured out ways to touch Dylan that makes her legs shake. Her back arch. Her breaths come in gasps, her voice in groans.\"I don't want to be a Puritan! The inside cover says, \"Ages: 14 and up\" and also, \"Grades: 9 and Up.\" So I'm trying to imagine myself as an English teacher, reading this with my students...or a dad, reading this with my 14 year old daughter, and I just can't see it. My daughters never dropped the F-bomb in front of me, and I never talked about my erect dick in front of them. How could we, as a matter of shared literature? Otherwise, this is a great book. Grey has lost a loved one, and Dylan is the One who jump starts his life-batteries again. Kacvinsky has done an incredible job teasing out a relationship between two unlikely people, you know, the kind you end up with, from introduction to commitment. There's plenty of wisdom nuggets to chew on as well as great explanations of how falling in love, dealing with loss, and being separated from the one you love truly feels. I marvel at the writing...I'm just a little unsettled by the content.I sure hope my YA expert friends weigh in on this. I think I'll start a discussion here on goodreads so I can get a better concept of YA literature.Mike"}, {"userName": "Jude", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/4418048-jude", "userReview": "When I saw the cover of First Comes Love I said Yes. When I read the summary, I said Hell Yes. When I read the book I was like Huh? Now do not get me wrong, it was a great story, but different from what I pictured. In my opinion, the cover has this sort of epic-passionate-romance feeling, and the summary makes Grey seem like such a dark and mysterious person and that Dylan is so full of life - which is true but, they don't seem like the extraordinary-human-being sort of characters. He isn't this super handsome guy that's Oh-so-tortured and she's here to save him. No, they are, in fact, like normal people, simple mortals - and it was fantastic.I hadn't noticed this, but usually in books, the main characters seem to be in this pedestal; they stand there and you know they won't be coming down. I mean, let's face it, Harry Potter and Edward Cullen are not gonna be walking through Walmart anytime soon. The characters in First Comes Love were actually believable, I can easily imagine Grey, and he was also creepily similar to me (in how we think). The love story was beautiful and normal and simple - or as simple as relationships get, it was bumpy, fun, charming and exasperating. Everything a good love story should be, everything normal relationships are.The only, let's say 'flaw' I could find in the book was that Dylan didn't seem really believable at times. It's as if Katie Kacvinsky - author - made her far too positive and full of light, that she seemed unrealistic. She was a nice character, but Grey really was the one that shined through the novel. Even if he was usually really down and a pessimist, I think he was the best. One of my favorite characters of all time, he knew who he was and Katie Kacvinsky did an excellent job at portraying him.I got so many things out of this novel and it is most definitely a keeper. One of my favorite stories, I will definitely hold this one close to me and my little heart :)"}, {"userName": "Damaris (GoodChoiceReading)", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/2378096-damaris-goodchoicereading", "userReview": "First Comes Love is an emotional and beautiful story. First Comes Love has crawled into my heart and will never leave. For such a tiny book, I had no idea it would make me feel the way that it did while reading it. It’s now days later and I can’t stop thinking about the two main characters. First Comes Love is a beautiful story about two young teens who discover themselves through one another. Dylan lives in the moment. She doesn’t care what others think about her and she is a very adventurous person. She is not sure what to do with her life, but she knows sitting around isn’t going to help her. Dylan goes and stays with her aunt for a while and this is where she meets Grey, who is a loner and keeps his distance from everyone. He doesn’t have friends and doesn’t really care to make any. The first meeting between these two had me laughing out loud at almost every sentence. Grey thinks Dylan is crazy, and Dylan thinks Grey is her new best friend. It was hilarious! I really enjoyed reading about both characters and watching them grow throughout the book. Grey has to be one of the hottest characters ever. I fell in love with him right along with Dylan. I felt every emotion they did. Kacvinsky did such an excellent job at capturing their emotions and putting it down on paper that it wasn’t hard at all to put myself in their shoes. Dylan changed Grey’s life, and Grey taught Dylan that love is worth everything. I loved every minute of it! The only complaint I have is that the one time I find a standalone book… it’s less than three hundred pages. I wish it was longer, but then I think about it and the way the story went and everything that happened, I honestly think adding anymore to it wouldn't have been a good idea. Everything was perfect! I really like the way Katie Kacvinsky writes.I highly recommend this book! It’s a fast read that will leave you with butterflies and craving more!5 out of 5 Stars!"}, {"userName": "Joy (joyous reads)", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/4352734-joy-joyous-reads", "userReview": "Gray - Loner. Angry. Caustic.Dylan - Vagabond. Genial. Happy.Told from alternate POVs, this is a story about two opposing personalities who learned the intricacies of human relationships; from the sensibilities of new found friendships, the adrenaline rush of falling in love, and the complexities of making a fragile relationship work. It's not going to be easy and it would take a lot of brutal honesty, never-ending soul searching, compounded by difficult sacrifices. At the end of the day, would it all be worth it?This book had me by the title right off the bat. I'm a big romance reader (believe it or not) and First Comes Love comes at a perfect time when I needed to get back to my love of reading. I fell in love with Gray's and Dylan's light and dark, yin and yang personalities.Going in, I knew there would come a point when I had to break out a box of tissues. I was misty-eyed on some parts but it also had enough comic relief to balance it all out. Dylan's quirky rose-coloured take on life and the simplicity with which she found the goodness out of everything and everyone gave a whole new meaning to optimism. It was fun reading her character.This book was a beautiful story about two people who had to see themselves through each other's eyes. Gray needed to see himself the way Dylan sees him in order to accept and face the irrefutable reality that his family remain frozen in their grief and what he had to do first before he could help everybody else. She managed to show him that moving on from a tragedy doesn't mean he was disrespecting a person's memory but an act of honouring their legacy. Dylan, on the other hand, had to learn through Gray that sometimes, finding oneself means letting a piece of yourself go. It's not about surrendering or changing who you are. It's about making room for another person in your constantly moving island.Gray's response to a tragedy that has befallen his family was to hide and cut himself off from any forms of social interactions. Dylan, on the other hand, thrived on being seen and heard and felt in such a way that people would remember her. The differences in their personalities was not the only highlight of this book but the writing itself was, in a word, pretty. I have no idea how Kate did it but she made every mundane human activity seems so beautiful here. Never have I ever wanted to grab this book and book a flight to Arizona simply because I wanted to be where the characters were.Verdict: Heartwarming story about life and family. Realistic, sweet, borderline-frustrating romance. What else could you possibly want?"}, {"userName": "Henz", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/19767615-henz", "userReview": "I was intrigued to read this book because of my friend  Aj… (^^) Thank you dear. I thought this is a lovely book, it’s refreshing to read it under the New Adult genre where most of them are all sexed up, although I like a steamy book every once in a while but they tend to be boring and shallow at times however \nFirst Comes Love\n is just right. It’s what I needed after the endless annoying main characters I’ve been reading so far. No eye-rolls and cringing for me here just smiles, “aww’s” and sighs.The story is told in an alternating POV; Dylan, a free spirited girl, who is into photography, an oddball that's what she is. She spent her summer in Phoenix and met Gray, the gloomy guy who shuts himself from everyone and like all cliché they met. You know what, we all get to meet people but it’s in how we are able to let a person into our lives and change us, that becomes special. Ok I’m starting to get cheesy here but that’s what I feel after reading this book, it’s like full life lessons.\n“But I don’t want to fit in. That’s when no one notices you. You leave a longer impression when you’re brave enough to stand out.”\nI feel like Dylan can be my best friend, she’s weird and unpredictable, she’s kind of crazy but her character has depth, her mind thinks differently and I’m mesmerized just to be able to imagine talking to this girl. And Gray, oh my Gray, he’s like my new book boyfriend, he very adorable and sweet and he always say the right words, how he described something is just perfection. \n”Sex with her is numbing and intoxicating. Something like a narcotic mixed with miracle. Sometimes it’s a rush like skydiving, and other times it’s just a smooth ride, like floating in the middle of a calm lake. It’s like standing next to a hot fire’s shooting sparks, or walking on the sun and then rolling in the snow. It’s like plate tectonics and hailstorms and lightning and earthquakes and hurricane-force winds all happening at once but then everything suddenly stops moving and your mind draws a blank and everything’s really peaceful. It’s like you’re mind explodes and all that’s left inside your body is heat.”\nI am so turned on! Hahaha"}, {"userName": "Elliedelights (Eleonor Dale)", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/20891439-elliedelights-eleonor-dale", "userReview": "This novel is life-changing. It opens your mind, your heart, your soul to a new, enthralling perspective. The title didn't really capture my interest and what made me read this book & borrowed it from the library was because of this -- \nIt piqued my curiosity and without moment's notice, I was reading it and couldn't even put it down. I quickly fell in love with the characters, especially Dylan. She's spontaneous, random and boring was never in her vocabulary. I think the book cover is not misleading at all, I think it expressed the strong passion of Gray and Dylan for each other. They're just so in love. Also, this isn't your typical romance novel. In fact, they are not the perfect, good-looking fictional characters we always read in every fictions now a days. But these two are the MOST normal, MOST ordinary yet they are the MOST magical & MOST remarkable fictional characters I have ever read.TO THE STRANGER WHO LEFT THE POST IT ON THIS BOOK: You were right, it sure changed me too. Thanks, if not to your note I wouldn't have discovered this wonderful book. :)"}, {"userName": "BlebeTanja", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/3669346-blebetanja", "userReview": "This was something else.Can't really put my thoughts to paper, but I can tell you this book is amazing. And the characters are nothing like you've read before. I need book #2 asap."}, {"userName": "Katie", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/49065550-katie", "userReview": "The cutest romantic novel I've read!"}, {"userName": "Punya Nayak", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/19535800-punya-nayak", "userReview": "[ Gray is the classic loner with secrets he is reluctant to share, a classic secret that has been used plenty of times to form a character, a quirky character like Dylan's and so on (hide spoiler)]"}], "description": "Like his name, Gray is dark and stormy. Dylan, a girl always searching for what's next, seemingly unable to settle down, is the exact opposite: full of light and life. On the outside, they seem like an unlikely couple. But looks can be deceiving and besides, opposites attract.What starts as friendship, turns into admiration, respect and caring, until finally these two lone souls find they are truly in love with each other.But staying in love is not as easy as falling in love. If Dylan and Gray want their love to last, they're going to have to work at it. And learn that sometimes love means having to say you're sorry.", "title": "First Comes Love\n      \n          (First Comes Love #1)", "url": "http://www.goodreads.com/book/show/12180204-first-comes-love", "average": 3.82, "cover": "https://images.gr-assets.com/books/1328837002l/12180204.jpg", "reviews": 566, "authors": [{"url": "https://www.goodreads.com/author/show/4143266.Katie_Kacvinsky", "name": "Katie Kacvinsky"}], "type": ["Romance", "Young Adult", "Contemporary", "New Adult", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/12180204-first-comes-love", "http://www.goodreads.com/book/show/15814564-first-comes-love", "http://www.goodreads.com/book/show/12986563-first-comes-love", "http://www.goodreads.com/book/show/8665876-awaken", "http://www.goodreads.com/book/show/12393223-middle-ground", "http://www.goodreads.com/book/show/17393016-still-point", "http://www.goodreads.com/book/show/17883553-finally-forever", "http://www.goodreads.com/book/show/16148583-second-chance", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}