{"ratings": 63, "userreviews": [{"userName": "Tarrin Lupo", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/5447408-tarrin-lupo", "userReview": "I was not sure what to expect from this book, but I have to say I was pleasantly surprised. I am a history nut, so I picked it up thinking this was a historical fiction. I quickly figured out it was more like a fantasy crossed with a historical fiction. I really liked how the author grounded his work with real history but then added some gods and magic into the mix. It was an interesting style that was pretty unique, but I have to admit it grew on me and by the end I really enjoyed it. I liked the interaction the hero has with the Three-Hearts, Outlanders and Mexica. To be fair, I have to say you really have to focus sometimes on what is going on or you will get lost. There are many characters and gods. Also the characters sometimes have outer body experiences, so if you don't pay close attention , it can be a little difficult to figure out want is going on. THANKFULLY, the author added a very handy list of characters and terms in his prologue which I found extremely useful. This was an excellent idea. Mr. Briggs did an excellent job capturing the time period and keeping the story interesting and moving. If you like your fantasy based on real history you will love this book, go buy it now!"}, {"userName": "Sarah Castillo", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/5868392-sarah-castillo", "userReview": "Austin Brigg's debut novel, Five Dances with Death, is a historical fantasy set during the time of the Spanish Conquest in Mexico. It follows the story of Wasp, the war leader of the Tlaxcalteca, who are besieged by the Mexica.This book is fantastic. I just need to get that out there straight off. If you're at all interested in historical fantasy, or non-western thought, or Meso-American history, go ahead, go to Amazon and buy it. You won't regret it. Unless you hate gore and violence. It's not overly graphic, but descriptions of human sacrifice and war are common topics here.It isn't purely historical, however. There is some mysticism and magic going on, but it serves as a device to allow us to see the big picture. Of course it would be difficult to express the scope of goings on without this intervention. In some books this might have been a little heavy handed on the part of the author, but here it is also used as a way for us to explore the mythology of the Azteca and to further understand our character.There's a glossary at the beginning of the book that I didn't read before starting, because the Kindle book starts after it and I don't always go back to check if there's a map or a glossary. This time I had to go back and check because Nahuatl is a tongue twisting language and I wasn't familiar with all the nations that we were talking about.On maps, I only had an idea of the areas that were talked about because I live in Texas and am pretty familiar with Northern Mexico. I hope that in the next book the author includes a map, because I'm afraid most people probably aren't familiar with the territory, and the travel in the book can get a little confusing for the thorough reader.This book is action packed, emotion filled, and character driven. Wasp is compelling, as are his rivals and his wife. I couldn't put this book down without picking it right up again to see what happens next.The only complaint I would have is that the dialogue doesn't feel natural all the time. But I hesitate to make that complaint because on the other hand, the dialogue also feels like it's translated, which does make the book feel very... legitimate? The conquistadors' dialogue does not have this problem, in the small portionsNot only is this a great book, but I also feel it's an important book. So little fiction is written in the voice of native Meso-Americans, and even less is written solely in this voice and with the backing of solid history. Being half Mexican-American, these histories are a part of my history, and a lot of the time it feels like a history that is not appreciated. In many books and schools, the history of Mexico starts with, \"And the Spanish came and found...\" Books like this remind us that there's more than just that story. There's also the ones who found the Spanish, to their peril.Austin Briggs is going on my list of authors to look out for, and I'm excitedly waiting for the next installment to this series. See my interview with Austin Briggs at my blogCheck out my other reviews at my blog"}, {"userName": "Lisa Reads & Reviews", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/5395843-lisa-reads-reviews", "userReview": "Five Dances with Death is a historical/fantasy adventure in which, much like the sorceress Plume plunges her husband into ethereal travel, the reader is firmly immersed in a distant time and place to live in the mind and body of Angry Wasp as he tries to save both his country and his daughter during the onset of the Spanish conquest of Mexico. The writing is a perfect blend of description while maintaining the feeling of having been translated, which grants the the storytelling an authentic voice. In places, the dialogue is both shocking and humorous. The internal dialogue shows such truth and heart, I found myself growing fond of the rash young man who danced with both demons and nobility. Often I found myself stopping to reread lines that were especially insightful. In one example, Angry Wasp was asked how he and a trader could both want the same thing, yet they could never agree on anything. Angry Wasp replied, \"Time after time, your ideas betray the very principles we warriors believe in. You want to ignore insults. You wish to befriend invaders. You want to risk your head to see the obvious.\" I love the combination of primitive and noble thought--the adherence to ideals pursued to their absolute end. Even when Wasp has his greatest desire in hand, he will not betray the guiding principles of his life to attain it. The struggle is fascinating, as is this \"Aztec Supernatural Adventure Novel.\"This novel reminds me of another that I enjoyed, Prophets of the Ghost Ants. (I seem to be intrigued by rash and imperfect young heroes on the road to greatness.) Those brash warriors make me wince, yet their actions are never boring. So many NY Times-tooted books that quickly draw large followings seem --often, but not always-- to be shallow, or empty. I'm finding gems among debut writers without all the marketing hype to launch them. I do hope they find their audience as well. I found nothing to complain about during the entire read of this novel. --And that is highly unusual. I'm now a fan of Mr. Briggs, and am looking forward to the sequel."}, {"userName": "Katy", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "“Five Dances with Death” is a historical fiction novel, based on the time when the Spaniards were just beginning their advances into Meso-America with their related destruction of the indigenous culture, religion and independence. Wasp is the war leader of the Tlaxcala and he has been learning sorcery from his wife, Broken Plume, in his attempts to find his daughter, Dew, who he lost into slavery when she was just a baby. He achieves his searches through astral projection, basically, and during one episode his wife takes him to the coast, where the Mayans live, and shows him the boats of the Conquistadors. He becomes obsessed with the outlanders, and tries to convince the ruling council that they must fight them. However, the council is more concerned with the Mexica, under the rulership of Stern Lord.It’s hard to really describe the plot – Wasp changes a great deal throughout the book, but at the same time remains essentially the same inside – a simple man, a warrior. Based upon other historical fiction novels I’ve read that covered this period in history, this book is quite well researched; many of the people and places are historically accurate, and that makes it even more interesting. It also led to a couple rants by me about the way the indigenous people were treated by the Spaniards, but that’s a different matter.I highly recommend this novel to those who are interested in the Meso-American tribes, particularly those who existed around the time of Cortez and Montezuma. This book is not as gory as many I’ve read – at least one of the books I read went into such detail about the rituals and sacrifices that it turned my stomach on occasion. This book references many of the gods and some of the rituals, but doesn't get into a great deal of detail, making it a bit easier to read for those of a more squeamish bent. Check it out – it’s a good read and I’m looking forward to the next books in the series."}, {"userName": "Elizabeth Marshall", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/5832336-elizabeth-marshall", "userReview": "What an absolutely amazing book this is.I started reading it almost exactly twenty four hours ago and have literally done nothing else since. You don’t believe me? Well I dimly noticed the sun rise over the hills this morning and wondered when it had set, because the last memory I had was switching my kindle on yesterday and starting to read.Austin Briggs is a man of immense talent, skill and knowledge. Through this book he has brought to life a people and a time long since lost to our world. There is no skimming or flowering of facts. Austin tells the history just as it was, at times harsh and brutal, gory and stomach turning, magical and fantastical, heart breaking and beautiful. This story has it all! This book is not a history lesson; it is not pure fantasy either. Austin Briggs has found the perfect balance in historical fiction and I passionately recommend this book to EVERYONE!"}, {"userName": "Leona", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/2664586-leona", "userReview": "Review of Five Dances With Death, Dance One Austin Briggs has written a good historical/supernatural book about the Aztecs of Mexico. The book begins in 1516. It also relates to the Spaniards as well as the Mayans, Olmec and Toltecs, people of Mexico. The \"outlanders\" are the Spanish who came in ships. The Aztec Empire is called \"One World\".Angry Wasp is searching for his daughter, Dew, who was captured by his enemy, Talon. The beginning of the book has Angry Wasp and Talon at the ballcourt for the game to get Dew back . I have seen the ballcourt at Chichen Itza and was told there were sacrifices for the losers. There is gore but anyone who has studied these cultures will not be surprised at the violence. The names in the book have somewhat been changed because they are hard to read; for me, I did not have much of a problem. I am glad I have studied the Maya, and also taught school children about them, and I have studied the Aztec somewhat, because it made the book more interesting and easier to read. Many of the words and happenings were familiar to me. The language of the Aztec was Nahuatl. I recommend the readers copy the Notes at the beginning of the Five Dances With Death which has a Quick Pronunciation Guide, Names of Places and Tribes, Historical Names and Gods so when they read they will have as good guide. I would have liked a map to help locate the area.This is a supernatural book and Broken Plume, wife of Wasp, is a sorceress from Blue Cloak Mountain. She sends Wasp into the Void where he becomes a \"twin\" of himself where he can have a out of body experience. Plume has warned him not to go too far. There are a number of characters and they all blend together, Wasp has his father, his wives and children as well as other leaders form other clans. The book begins with the search for Dew but somehow she is not the main part of the story. The book is fast track and there are many twists and turns. The language is fine and no sexual portions. List of some characters are: Angry Wasp, his father Angry Wasp the Elder, His first wife Broken Plume, Talon, his enemy, Stern Lord ( Montezuma) who was leader and ruler of the Moonnwalk People and One Grass of Sacrifice, a young woman. Some gods are Feathered Serpent (Quetzalocotal), God of Rain (Tlaloc), and Smoking Mirror (Tezcatlipocal). This is the first book of a series and the end of the book will leave you wanting to see the next \"chapter\". I give it a five star. There is a quality of writing and I did not find any typos. Five Dances With Death is in the first person with Angry wasp as the person; I think it helped make the book personal. I will recommend this to my local library because they have recently acquired the option of e-books for the patrons.The reader will learn something about the ancient cultures of Mexico. http://austinbriggs.com/aztec-history...http://austinbriggs.commnleona.blogspot.comLeona Olson"}, {"userName": "Sassy Brit", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/1003021-sassy-brit", "userReview": "Five Dances With Death: Dance One charted the highs and lows of a Nahuatl man, warrior and leader of the Tlaxcala people, Angry Wasp, as he searches for his missing daughter, Dew, during a time where the Monetzuma War rages and a Spanish invasion lead by their dreaded leader, Hernán Cortés, draws near.I applaud author Austin Briggs’ ability to pack much thought-provoking research and many insights into this book which makes the mysteries of the Aztecs, their beliefs and rituals, stand out from many other eras commonly used in historical fiction. His use of his lead character’s smoke-induced out of body experiences also adds an interesting, fantasy, shamanic-like slant, where Wasp has been taught by his wife, Broken Plume, to step inside another person’s mind (the art of instant travel) and appear before them, many miles away, showing the author’s colossal imagination can fly nearly as high as Wasp.Although Wasp never gave up his search for his long lost daughter, he did seem to swash-buckle his way through the story with little mention of his daughter for a fair while. In addition, the actions of the lead characters must have the most significance as they are responsible to move the story forward and make it interesting, yet at the beginning I didn’t quite get this feeling from Wasp. Maybe it was because his language was stilted at times, or it was just a clever trick by the author to keep Wasp’s language and character within his time period, but he took time to grown on me. Although, I did find his adventures full of facts and amazing chunks of information, which kept me in this historical fantasy setting and piqued my interest enough to finish it, I felt the story lacked that gripping ‘how-does-it-end?’ touch.Excellent moments include the action fighting scenes, and the author’s meticulous attention to historical detail, from which I learned a lot of interesting facts about Meso-American society and culture. Wasp’s habit of jumping out of his body (as his double) straight into the next big fight without contemplating the consequences meant that through his transcendental experiences he cleverly met up with some unlikely and seemingly random but useful characters along the way and a surprise ending, no less.I also appreciate the author’s choice of not going for the real ‘tongue-twisting’ Aztec names like Citlalpopocatzin and Quiahuixtlan, which can be so long and hard to read, they distract the reader from the story. In addition there is a quick pronunciation guide, explanations of 'Places and Tribes' to familiarise readers with the real places and people of Nahuatl, old Mexico, during Aztec times for those historians among you. A thoughtful gesture if ever I’ve seen one."}, {"userName": "Vanessa Wu", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/5771483-vanessa-wu", "userReview": "If I weren't such a clean-living teetotaller, I'd recommend that before starting this book you down a stiff glass of crème de cacao and take a deep draw on some devil's weed. It's heady stuff and it makes me want to get high.However, being a rather fragile Asian who falls over after a sip of spirits, I had to be satisfied with several cups of Choco Aztec Spice Yogi Tea (readily available from Amazon).I was right there in the thick of the action, though, whirling my sword in battle with the Mayans, chatting with sorcerers, cheating death and having weird out-of-body intercourse with my wives.It made me wonder why more people haven't written novels about the Aztecs. It was a civilization that had everything: magic, sports, adventure, legalized narcotics, and a really wild underworld. But I suppose most authors would baulk at the research. Austin's has been meticulous and it shows, even though he wears it very lightly. The narrative has an elegant simplicity that carries you ever forward as you join the hero on his strange shamanic quest.Although the battle scenes are vividly described and the hallucinogenic episodes are haunting, the passage I most enjoyed was in Chapter 15 when the hero, Angry Wasp, meets One Grass, the Princess of Paynala, who stoically anticipates being raped by the victorious Sea People. 'She moved closer. “When we were given to them this morning, one of them, a man with orange hair, grabbed my hand, pulled me close, and licked my ear. They all laughed. He'll force me today, won't he?”'But a fate more terrifying than rape awaits her, for her captors are murderous followers of a foreign god. They intend to drown her as a sacrifice. Tense with expectation, our incorporeal hero gives chase:'I hastened to where One Grass was. The priest was dragging her into the sea amid the wailing of the other girls. Thick, fragrant traces of a heavenly substance filled the air around her, making my whole being throb with desire...'Suspense combined with sensuality always gets my attention and in this chapter it is sustained. I won't tell you the climax. I wouldn't want to spoil your enjoyment. Let me just say that, after Chapter 15, another nine chapters of thrilling action lie in store in this magnificent book."}, {"userName": "Shomeret", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/1842352-shomeret", "userReview": "The protagonist, Angry Wasp, is in some ways like most men. He tells another warrior that women aren't important. Yet his sorceress wife is not only more powerful than Angry Wasp but his actions show that he cares deeply about her even though he doesn't express it. I found him a very believable character.Angry Wasp can also be unexpectedly insightful. His shamanistic abilities which he acquired through his wife's teaching assist him in this area. I very much appreciated the spiritual aspect of this book. Other novels I've read dealing with the peoples of Mexico during this period make a travesty of their religious practices. It's as if their spirituality were all about bloodletting. Austin Briggs provides us with a deeper view of these complex cultures.This was the first book that I read on my new Kindle. I was impressed. I'm looking forward to Five Dances With Death: Dance TwoSince I didn't have a blog when I wrote this review, I decided to feature it as one of my top reads in the first half of 2012. See the June blog post dealing with being at the halfway point in the Around the World challenge at http://www.maskedpersona.blogspot.com"}, {"userName": "Johanna", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/4768008-johanna", "userReview": "It was certainly a one of a kind story setting. I don't think I've ever read a historical fiction novel set in south america, no less in the 1500s. The book is in many ways a story of death, and Austin displays just how brutal (by our means) and war-mongering the indians of that time were. But among all sights of war, it is also a story of religion, belief, and of protecting ones family. Wasp, the war leader of a small indian nation faces many struggles while seeking for his lost daughter, pleasing the gods with offerings, as well as standing infront of a coming clash between the white skinned \"boat folk\".I will certainly look forward to the follow-up."}, {"userName": "Quentin Stewart", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/4220571-quentin-stewart", "userReview": "Austin Briggs does an excellent job of put historical events into an interesting story. The beginning of the conquest of ancient Mexico is the setting of Angry Wasp's attempts to save his people. The book gives us a view of what it might have been like for the natives who faced the first contacts with the Europeans. His first contact comes as he and his wife are searching for his daughter who has been enslaved by an enemy tribe. He becomes fascinated with these \"outlanders\" and wants to learn more about them. He soon realizes that they are interested in conquest more then trade. His mission now becomes trying to get his ruling council to realize that they must make a stand against these \"outlanders\" before it is too late. But many of his contemporaries see the outsiders as being their chance to join them and defeat the Aztecs.The conquest of the Aztecs seems to capture peoples' interest. Many have wondered how so few could have conquered so many, but we need to remember that many of the neighboring tribes of the Aztecs sided with the Europeans because they were tired of being in the virtual enslavement of the Aztecs. This bit of history comes out in \"Dance One\". Briggs does an excellent job of giving us a view of what day-to-day life might have been like among the tribes of Central America at this time. They were not only vassals of the Aztecs but in many ways they were also slaves of their God who demanded prisoners of war to satisfy his hunger. Briggs discusses the economy of the area and the trading that took place among the tribes of kingdoms, all of which was controlled by the Aztecs, unless one used the illegal routes that the traders and merchantmen knew were there.Overall a very good and interesting historical fiction. I look forward to the next \"Dance\" to see what Wasp does next to attempt to stop the incursions into his peoples' territory. Even though I know how the story turns out Briggs' description of the people and culture is excellent and interesting."}, {"userName": "Cassandra ", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/5702064-cassandra", "userReview": "Different from anything I have ever read before, “Five Dances With Death” by Austin Briggs is definitely an intense read. It’s very apparent that a lot of research went into the creation of this story. The writing is extremely descriptive and the world came alive. It felt like I was in an environment similar to “Apocalypto” with magic and sorcery added into the mix. Even though there were some fantastical elements, it still read more like historical fiction to me than fantasy. It felt very real. Wasp, the leader of the Tlaxcala people, is on a mission to get his daughter back from the slavers that took her. He refuses to give up looking for her. Everyone tells him to “move on”, but he can’t. His wife, Broken Plume teaches him a little magic. He decides he has enough knowledge of magic, and against the advice of Plume, goes farther than he ever has before. Wasp doesn’t realize until it’s too late, that he is in trouble. I was constantly getting angry with Wasp. He is always jumping into action, without thinking about the consequences of where those actions would lead or listening to the better judgment of others. Wasp soon discovers that his wife Plume is a way more powerful Sorcerer than he ever realized and becomes suspicious of her. Wasp never gives up searching for his daughter, Dew. One dangerous adventure after another, Wasp throws himself into all kinds of trouble where he has to fight for his life. At one point, Wasp plays a serious game with Stern Lord and my palms were sweaty and my heart was beating hard--gambling with other peoples’ lives, ripped out hearts…heavy stuff, but that’s why it’s so exciting. There is a lot of death, and sacrifice in this story. If you are interested in historical fiction, this book is just for you. You will enjoy it."}, {"userName": "Jojo", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/3711932-jojo", "userReview": "A moving story about the man, Angry Wasp and his attempt to fight against the Spaniards to defend the Aztec Empire. What makes this historical fiction intriguing was the introduction of dark sorcery and demonic creatures. Briggs does a splendid job walking the fine line between history and fiction.The story is fast-paced with lots of action but it's also quite emotional, as we see Wasp feverishly look for his lost daughter. Speaking of him, Wasp is a strong character who is very driven, to the point of recklessness, to get what he wants. He doesn't like to listen to other people's advice but he will if he deems it necessary. He is also a bit of a misogynist but it seems fitting for the setting and the time period.One thing I have some issue with is how it felt as if the search for Wasp's daughter is pushed to the side. Obviously, the invading Mexica would take priority but it felt awkward to me. Wasp spent a long time looking for her and suddenly has to stop and is fine with it? Also, perhaps it's because of his character (what do I know about Aztec warriors?), but Wasp seems emotionless at times. I can't think of a good example at the moment but he seems to not react to something that would be traumatizing to someone else. I like strong characters but if they're too strong, it's hard to sympathize with them!Overall, it is great story that anyone who likes historical fiction should read. However, there is talk of human sacrifice, slaves, and plenty of abuse so I wouldn't recommend it to any young readers.Won in a giveaway in return for an honest review"}, {"userName": "Lyn (Readinghearts)", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/2124637-lyn-readinghearts", "userReview": "This book is the debut novel of a new series by author Austin Briggs, and if the title is any indication, I am expecting five books. I certainly hope that this is the case. Briggs crafts a beautifully written story centering around Wasp, the war lord of the Tlaxcalteca, a tribe of the Aztecs. This first book takes place as the various tribes of the Aztecs are warring with each other in the perennial fight for land and mastery within the Aztec nation. At the same time, the Spanish Conquistadors have just landed, which of course will complicate matters. I have had an ongoing love affair with the Native American cultures since I was in high school, including the Aztecs, Incas, and Mayans of Mexico and South America. For my part, I think that Mr. Briggs captured both the mysticism and brutality inherent in the Aztec culture perfectly. He highlighted their belief in mysticism and use of hallucinogenic substances to further out of body experiences without making it seem too modern or 20th century. At the same time, he gave his characters personalities that allowed them to seem \"modern\" and not at all archaic. The perfect balance, in my opinion. Being the first book of the series, we were introduced to a lot of characters and ideas in this book that I am excited to see develop as the series progresses. In fact, my only complaint regarding this book was that the ending was rather sudden, definitely leaving me wanting more. I hope the second book comes out soon."}, {"userName": "Ns", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/3040548-ns", "userReview": "Five Dances with Death tells the story of Angry Wasp, war commander of the Tlaxcalteca army in the early 1500s. His story is a mystifying one with a strong supernatural element. There are two things that are important to Wasp, finding his daughter, who has long been lost as a slave and defending the welfare of his people. It is with the first reason that his story begins with a ball game that gives him the opportunity to win his daughter, Dew back. He loses the game but not the battle and soon with his rise to leader of his people, he sets in motion a supernatural journey that has him playing fire with life and death. At the center of it all is his first wife, Broken Plume, a powerful sorceress who guides and leads him into a world of dark magic. Sometimes real and other times surreal, Wasp faces danger in every way. Like Wasp, I found myself intrigued, confused and desperate for him to find his way.The story takes a deep look into life and death. Although, Wasp's world is a savage one, the traditions and rituals regarding death makes an interesting balance. As Wasp journeys deeper into this supernatural world he faces choices and sacrifices that will change his family and his people. Where the story begins with a personal mission to find his daughter, it comes full circle, but it is the journey that is most compelling. Five Dances with Death took me into a different and unexpected world."}, {"userName": "Elise Stokes", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/4187698-elise-stokes", "userReview": "(Not suitable for readers under 18)Hands down, Austin Briggs knows his stuff. His years spent researching the history of the Aztec Empire and the Spanish Conquest is evident in the first installment of this dark tale that he masterfully weaves in a fluid and engaging writing style. He paints a vivid picture of the Aztec life, fascinating and at other times shocking, due to the violent nature of the Aztec culture and religion. Excellent writing is meaningless, however, if the characters don’t leap off the page, grab you by the collar, and yank you into their world. The characters breathe life into a story, and Angry Wasp takes this responsibility seriously, capturing the reader from the get-go as a desperate father trying to win his enslaved daughter back in a game. When he loses, we feel the blow too. We know how the story ends for the Aztecs, but we don’t know Wasp’s story yet, though his first dance with death makes one thing clear: Wasp the Warrior will not go down without a fight."}, {"userName": "Naomi Blackburn", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/3849903-naomi-blackburn", "userReview": "I agree with the Goodread reviewers who felt this book was totally different than what they were expecting. I felt like I could have been reading a contemporary novel instead of one set in the time of the Aztecs with how Austin wrote the book and allowed the reader to get to know the characters, yet just when I thought I had my reading pattern set, it switched. I never got bored while reading this book."}, {"userName": "Malvina", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/6451100-malvina", "userReview": "An interesting read, recommended for those who enjoy or love historical fiction."}, {"userName": "E.S. Wynn", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/3299881-e-s-wynn", "userReview": "If this book had been my introduction to historical fiction (instead of Johnny Tremain) I might have tried to follow in Austin Briggs' footsteps (instead of Asimov's!) Five Dances With Death: Dance One is a fascinating foray into Nahuatl culture (native Mesoamericans) that captures the ritualistic, spiritual and all-pervasive violence of this distant and (to me) mysterious setting.I can honestly say that from the start, Dance One grabbed me in a way that few books can, filling my mind with Briggs' exquisite details, the lavish way he paints each elegant element of not only “One World” but also the spirit world that binds and effects everyone who treads into or through Nahua lands. At the core of its fast-paced and exciting narrative, Dance One carries a beautiful expression and exploration of an almost unifying spiritual “theory” which sheds light on and captures the mind within a world of omens, spiritual doubles and persistent, hungry gods who tempt mortals and swallow souls in an endless game of evolution and creation. There is a mysticism that clings to everything (even the names) in Briggs' work that is rich and powerful, one that brings to mind the talent of such great authors as Storm Constantine and Neil Gaiman without losing focus on the story, the setting, or the voracious, visceral, animal heart that makes this book so gripping and so intriguing.Beginning as a downtrodden hero story introduced by a comprehensive collection of opening notes that translate and explain various terms, names and places mentioned within the story, Dance One starts with action and finishes with action as the main character (Wasp) struggles to get his enslaved daughter back first from the cocky villain (Talon) and later from the clutches of another who is not above using her as a bargaining chip against Wasp and his nation. The invasion of the conquistadors that occurs in the midst of Dance One swells as the story does to become not just as a physical event, but one that has spiritual consequences as well. In the end, the whole thing rolls and swirls into a stirring and profound conclusion that highlights a struggle of ideals-- should Wasp risk the loss of the gods and spirituality of his nation to ally with the untrustworthy “outlanders” (conquistadors) against his sworn enemies, the Mexica (as others have done) or should he instead face the unknown and stand tall, apart from all those who would cast aside their gods or trample the lives of others? To say that Dance One is an incredible work is not to do it full justice. Five Dances with Death: Dance One is a masterpiece, and I can't wait to read the next book in the series."}, {"userName": "Mayra", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/4121711-mayra", "userReview": "If you’re a fan of historical novels, are interested in the Aztecs, and would like to try something different, you’ll enjoy Five Dances with Death: Dance One, by Austin Briggs.Written in first person from the point of view of Angry Wasp, the story begins in 1516, during the era of the Spanish Conquest in Mexico. Angry Wasp, military leader of Tlaxcala, wants to keep his nation safe and search for his lost daughter, Dew, whom he’d lost to one of the leaders of an enemy tribe, a man named Talon. Though Wasp has now captured Talon, the man won’t reveal the whereabouts of Dew. The war with this enemy tribe, the Moonwalk People, is now a personal matter, though Wasp doesn’t want to make this evident to his people.One of Wasp’s wives, a sorcerer well-educated in the magic arts, teaches him to have out-of-body experiences – that is, to travel in soul and spirit while his body stays in the safety of his village. It is in this \"tricky\" state, which is hard to fully control, that Wasp makes a twin of himself and meets with Stern Lord, the most powerful man in the world and ruler of the Moonwalk People. Stern Lord is aware that Talon is being kept prisoner by Wasp and isn’t happy about it. Thus begins Wasp’s dance with death as he tries to stay alive and discover what happened to his daughter.Magic, history, sorcery, mysticism, spirituality, fantasy, and magical realism combine to create an original, intriguing story that will capture your imagination. Briggs writes with attention to detail, making his world come alive. I enjoyed the dialogue and descriptions and especially seeing the world from Wasp’s perspective. My only problem with the story is that in the beginning the issue of finding the daughter seems important but later on it sorts of falls to second place. This didn’t stop me from reading but it did get my attention.Since the book is self-published, I was also surprised by the quality of the writing: excellent and free of typos or grammatical mistakes. I really appreciate when a self-published book is so well copyedited. In addition, the story seems very well researched and I found interesting all the cultural information, especially the segments on sorcery and sacrifice rituals. Briggs has been researching the Aztec Empire for over 10 years and his knowledge comes through in the writing, without hitting the reader over the head or slowing down the pace with information dumps. In sum, this is a novel worth reading and I recommend it if you’re particularly interested in Aztec history and culture."}, {"userName": "Hannah", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/2004101-hannah", "userReview": "I was almost immediately struck with the unique feel he gives to the book. It's centered around an Aztec village, Tlaxcala, where a man, Angry Wasp, has lost his daughter to a warring tribe and is trying to get her back by any means possible.I loved the idea that death was present throughout the novel. It wasn't depressing or dark, but simply a fact. I also really enjoyed the setting and the realistic feel of it. You can tell that Briggs has the knowledge necessary to write a story about the Mexica people -- it never felt like a gimmick, or like that was the focus of the story. It was merely a richly interesting setting in which he told the story of Angry Wasp. The game of bean-throwing (the actual name eludes me at the moment) was especially intense. Briggs expertly creates tension and release between the characters.Although the story was compelling, some of the dialogue felt a little trite. I enjoyed most of the Moonwalk People's language, some of it felt a little haughty. I found this odd seeing as they were supposed to be the savages -- perhaps that was the intention, that they were trying to appear better than they were. There were also a few misused words, where an editor with a sharp eye and a heavy hand could have fixed. Although, for a self-published book, it was well done.The setup to this story was brilliant, and I was drawn in immediately. It's ending was satisfying enough to interest me in reading the next book. The only problem I had with this novel was the middle -- at times I desired to put it down or to skip ahead to see what happened in the end. It seemed like the plot shied away from what I really desired to know, and focused on the politics of the many tribes. I'm sure this will interest some, but it wasn't my cup of tea.Overall, this book was well detailed and interesting because of it's uniqueness and sincerity of setting and character development.Stay tuned for an interview with Austin Briggs on my blog about the Adopt and Indie program and about his book, Five Dances with Death: Dance One."}, {"userName": "Tess", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/722677-tess", "userReview": "Well, this took a really long time to read. Partly, this was because I only had it as an ebook and until I got my smart phone a month ago I had to read the book on my laptop, which was uncomfortable and hard to do. That aside, the story was a very unique experience for me.I'm not familiar with this time and place, so names, rituals, even the locations in the story were confusing. Events were also very confusing. The author kept losing me as the character Angry Wasp jumps from sorcery trances to being captured by enemies to blood filled festivals and then into battle. Each thing seemed very exciting, but events were choppy and so hard to follow.The story was interesting, however, because I know very little about these cultures and the author knows quite a lot, so he shares their cultures as much as possible. It's interesting to read something from a non-Western viewpoint.This is book one. The story ends a little abruptly, and with all the difficulty I had reading the first Book, I'm not sure I want to try the rest of the series. I'll have to re-evaluate later."}, {"userName": "Julie Salinas", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/5207189-julie-salinas", "userReview": "This was an interesting read, but I could only say that when I got to the end. The book starts with promise, using a culture not written about often from the mid americas. The war chief, Wasp, and one of his wives lost a child to another tribe, but they don't know where she is. He also is the leader of the warriors and senses the danger coming to the lands, strangers coming on ships that don't speak the language and pose a threat. As I said, there is promise, but this was a slow read for me as so much of the start of the book is Wasp in some strange drug induced state where his spirit goes in and out of different worlds, perhaps real but maybe not. The last half of the book was much more interesting. I think a little less of the fugue state could have enhanced the book and made the story flow a bit easier. This was a little more of an academic read than one for escapism, but I did truely enjoy the potrait of the culture, as brutal as it was."}, {"userName": "Cyn", "userReviewDate": "Feb 02, 2012", "userURL": "http://www.goodreads.com/user/show/4122566-cyn", "userReview": "The author has a gift for writing and I would have rated it higher if it weren't for the fact that the protagonist of this book/series is not a likable character in so many ways. When I stumble onto such characters, it affects my overall satisfaction with a book; thus, the removal of a star from a piece of writing that would have normally earned a four star rating from me. Also, the fact that the people/culture represented in this book didn't see anything wrong with the ritual sacrifices of human beings (that it was even considered an 'honor' by the victims of such sacrifices) made it difficult if not impossible for me to identify with them in any way.Having said that, the book was still an interesting read - I recommend it for anyone who enjoys supernatural fiction with a twist. The twist for me was the setting."}, {"userName": "Nicole Roberts", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/3931291-nicole-roberts", "userReview": "This book is all bout Aztec culture and mythologies. I don't know much about the culture or the mythologies so this was hard to follow in some places. I really appreciate that the author adjusted the names from the original language, only because it would be difficult to follow if you are not familiar with the language to begin with.I thought the story was semi-interesting, I think my lack of full attention is due to my own ignorance on the culture. I more than likely would not follow up on the next book."}, {"userName": "David Leroy", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/7200818-david-leroy", "userReview": "I really enjoyed reading this book, and I think the authors choice of using mystical experiences, out of body, or remote viewing in the context of this culture and time is brilliant. Plus, it is very interesting to follow the \"mystical warrior\" new challenges, in the unfamiliar world, who was once young, confident, and strong in the physical world."}, {"userName": "Karen", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/3764388-karen", "userReview": "I have always been interesting in history so I always like reading books with any connection to it. I enjoyed the writing and characters of Five Dances but I feel like I missed something along the way. I may re read it to get a better feel, see if I did indeed miss something."}, {"userName": "Ali Crain", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/11033402-ali-crain", "userReview": "I really wanted to like this but it was a difficult read for me."}], "description": "In the days before the Conquistadors, Angry Wasp is fighting to keep his family and his small Aztec nation alive.Slavers have kidnapped his daughter. His wife has turned to powerful sorcery. His people have challenged Montezuma's dominance and now face extinction. And the Spaniards have begun their march inland. Now Wasp must rely on his military prowess, wit and even dark magic to regain his family and protect the independence of his nation, as he begins a desperate journey that will forever change the fate of the Aztec people.", "title": "Five Dances with Death: Dance One", "url": "http://www.goodreads.com/book/show/12251599-five-dances-with-death", "average": 3.71, "cover": "https://images.gr-assets.com/books/1396932763l/12251599.jpg", "reviews": 28, "authors": [{"url": "https://www.goodreads.com/author/show/5072746.Austin_Briggs", "name": "Austin  Briggs"}], "type": ["Historical", "Fantasy", "Fiction", "Science Fiction Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/12251599-five-dances-with-death", "http://www.goodreads.com/book/show/12150787-five-dances-with-death", "http://www.goodreads.com/book/show/17557419-how-to-build-a-powerful-writer-s-platform-in-90-days", "http://www.goodreads.com/book/show/25815612-a-question-of-obsession", "http://www.goodreads.com/book/show/26098450-under-the-cuban-sun", "http://www.goodreads.com/book/show/23309992-die-if-you-lie", "http://www.goodreads.com/book/show/23257055-tommy-hopps-and-the-aztecs"]}