{"ratings": 13441, "userreviews": [{"userName": "Colin", "userReviewDate": "Aug 19, 2007", "userURL": "http://www.goodreads.com/user/show/51647-colin", "userReview": "Flight has a great narrative voice, and addresses important themes of revenge, violence, historical trauma and forgiveness. Alexie combines his poetic skill and humor adroitly to address these complex themes. Yet the book was still rife with the major issues that turned me off from Alexie several years ago, that are part of why I think he remains so popular with white people in particular. He writes that all Indians are alcoholics again (including our narrarator), even going so far as to offer a pointed defense that it's not part of racism to do so, but rather the truth. (This, i would imagine, is in specific response to critiques about his perpetuation of this stereotype from Native scholars).Also, literally every female character in this book is only discussed in terms of her sex appeal. While some may dismiss that in this book as the hormonal POV of a 15 year old male, (which Alexie does near the end) to me it is a continuation of a pattern that Alexie has shown for years. Women in all of his books are one dimensional sex objects or mothers. Nothing different here, and it really got on my nerves as I was reading.There was also this glorification of white people throughout the book, and it really was unclear if that was part of the main character's internalized racism or because it sells more books for Alexie to talk about how great white people are. I think it's a combination of both. The post-9-11-pandering, pointless subplot about the dangers of trusting resulting in inadvertently giving flight lessons to a Muslim terrorist who you thought was your best friend is too annoying to even go into. Ick. The ending was way too neat and cheesy, with our main character finally learning to trust again after finding a happy adoptive home with a white cop, his firefighter brother, and their family. With a major theme of the book being this mixed Native kid trying to figure out what it means to be Native, this ending rings false. Also, his severe acne, which serves as a metaphor for his self-hatred and truama, gets cured. I love \"disability as metaphorical tragedy.\"In sum, I'm not Alexie's biggest fan. I still think this book is worth reading though. I like most books that involve time travel, and this book illuminates some complex political/emotional themes using that as the device, even with all its faults."}, {"userName": "Matthew", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "A quick but powerful read! I was not sure what to expect right after starting or if I was going to get into it, but it ended up being quite amazing. This was my second Sherman Alexie and I continue to be impressed.Flight is a bizarre story that is a bit coming of age and a bit magical realism. The different \"lives\" the main character experiences are difficult, controversial, and possibly uncomfortable to consider. But, they help lead to a beautiful redemption that is uniquely crafted by Alexie.If you are looking for an emotional journey that might lead you to tears, but will definitely make you question humanity, Flight is the perfect little novel for you."}, {"userName": "Anna", "userReviewDate": "May 21, 2007", "userURL": "http://www.goodreads.com/user/show/90953-anna", "userReview": "Sherman Alexie's Flight was a quick read, a much sparser book than his first novel, Indian Killer. That earlier work was more dense, much darker. I actually appreciated that first novel very much -- it was an angry, despairing book that captured well the continuing struggles and tensions of a modern-day rez-Indian and its dark, unrelenting sensibility was disturbing yet poignant too.At the LA Times Book Festival, I heard Alexie talk about Indian Killer which he says he hates. He felt it was so angry and basically was his reaction to all of the pressures and conflicting expectations for him to be a mouthpiece for \"the Indian Experience.\" I actually think it was an engrossing novel, nevertheless.Anyway, what it has to do with Flight is that Alexie's wife pointed out to him that this one was his Indian Killer rewrite. This one is about an Indian teenager foster kid -- unloved, unwanted, and unhinged -- who at a moment of sheer death and destruction in contemporary times, is plunged back into time to relive in different personas, seminal moments of sheer death and destruction in Indian history in America.But this is a different novel. It's shorter, breezier almost. And has a redemptive ending. And tho' at first, I was wondering if perhaps Alexie had lost his touch with the too short chapters and the quick-cut jumping around of the character into different bodies and periods of time (making me compare it unfavorably at first to Octavia Butler's Kindred, a much more masterful time-jump-back novel dealng with the legacy of slavery in the South), there's a scene that he inserts about 3/4s through that is just KICK-ASS and completely turns the tales on their heads. It becomes a more intimate take on sins of the father and is ultimately about what Alexie described (in ironic, yet beneath, maybe quite sincere) \"the kindness of strangers\" and \"forgiveness.\"He said at the Festival that he could've written the darker ending -- did in fact write several -- but in the end \"I just didn't want to put that shit out there.\" And in light of the fact that the novel was released in April 2007 -- around the time of the Virginia Tech incident -- Alexie said he felt well-satisfied with that decision, despite any critical knocks for doing so.And I actually agree. I'm still mulling over that ending he chose. I almost feel like these days, the darker endings are becoming the trite ones. So in a way, a redemptive ending may be the weird, edgy twist, after all."}, {"userName": "Michael", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "Alexie continues to spin sly subversive themes with this satiric tour of the condition of Native Americans and their antecedents in history. Zits is the name our teenaged narrator calls himself in this first-person account (“My real name isn’t important”). He’s flippant and lonely and angry, the epitome of alienation. And brave in his stubborn resistance to both the brutality or liberal patronizing of his 20-plus sets of foster parents he has been placed with. His Indian father ran off when he was born and his white mother dies when he was young. He has no idea what kind of Indian he is, and the only ones he knows are homeless drunks in the streets of Seattle. Zits’ drifts into a friendship with a radical kid who inspires him toward a rebel act of armed robbery of a bank. As the book jacket reveals, he gets a rude series of lessons on hate and violence from a series of involuntary time travel trips into the past. He inhabits the bodies of others in history, young and old, Indian and white. He experiences a camp of Lakotas gearing up for Custer’s Last Stand, and on the other side of things, a cavalry troop preparing to massacre a band of Indians. Other “visitations” get closer to his personal history or expand to scenarios of infidelity, domestic violence, and terrorism. The comic absurdities in these visions begin to transform into meaningful truths for Zits and a dose of empathy begins to infect his heart. I love how a core of sentimentality and play in Alexie’s tales helps the hard medicine of his vision slip past my defenses. It was short and engaging in its surprises and action, but compared the big emotional impact I got out of his “Reservation Blues” and “The Toughest Indian in the World’, this one was a harder challenge for me to suspend disbelief over."}, {"userName": "Emma (Miss Print)", "userReviewDate": "Nov 25, 2007", "userURL": "http://www.goodreads.com/user/show/75857-emma-miss-print", "userReview": "Published in 2007, \"Flight\" is one of Sherman Alexie's more recent novels. His critically acclaimed YA debut \"The Absolutely True Diary of a Part-Time Indian\" came out a few months after \"Flight's\" publication. Together these novels illustrate how teen narrators can comfortably inhabit both adult and young adult novels. More about that later.The book starts with a simple request from the narrator: \"Call me Zits. Everybody calls me Zits.\" In other words, the narrator has no name. Given the structure of the novel, this choice actually works. Throughout the story, Zits is rarely called by any kind of name that would be termed as his own. The opening line also tells readers everything they need to know about Zits. Specifically that this fifteen-year-old half-Irish, half-Indian kid doesn't think enough of himself to bother using his own name. Worse, Zits is pretty sure no one else thinks much better of him.Orphaned at six and in foster care since he was ten, Zits has slipped through the cracks and is truly a lost soul. After an unceremonious exit from his twentieth foster home and his latest stint in the kid jail in Seattle's Central District, Zits starts to think that maybe he doesn't really need a family. Maybe what he needs is some kind of revenge. But things don't go as planned. Instead of punishing the white people who are abstractly responsible for his present situation, Zits finds himself on a time-traveling, body-shifting quest for redemption and understanding.Zits' first \"stop\" is inside the body of a white FBI agent during the civil rights era in Red River, Idaho. From there he moves to the Indian camp at the center of Custer's Last Stand, then a nineteenth century soldier, a modern pilot with his own variety of demons and, finally, Zits finds himself in a body more familiar than he'd like to admit.As many other reviewers are quick to point out, \"Flight\" is Alexie's first novel in ten years. Unlike previous works, where characters and plots intersected (even in his short stories), this novel remains disjointed. It's the kind of book that could easily be seen as a grouping of short stories. Except that each segment follows Zits' spiritual evolution. For this reason, the novel is obviously much more character driven than plot driven. But Alexie makes it work.I consider flight to be adult fiction. Zits is a teen, so it could be YA, but that fact is largely irrelevant to the main machinations of the novel--which is why it's an adult book but \"True Diary\" whose narrator is close to Zits' age is a YA book. Finally, a word on the ending of the novel: It's optimistic. There is some talk that the ending is too up, that things come together a bit too easily. In terms of the plot that could be true although I'm more of a mind that the ending was already in the works from the beginning (the fact that \"The wounded always recognize the wounded\" and other events support me in this claim).Some have claimed that the happy ending might be reason to suggest that \"Flight\" is a YA book because only a book written for teens would have such an abrupt ending. That's bogus. This is an adult book that teens can enjoy and the ending doesn't change that. After reading this novel it becomes clear that Zits has been through a lot. Way more than any fifteen-year-old should have to take. For Alexie to end the novel in any other way would have been a slap in the face both for Zits and the readers invested in his fate.\"Flight\" is a really quick read (I finished it in a day) and entertaining throughout. The novel doesn't have the depth of character found in \"Reservation Blues\" or \"True Diary\" but the story remains different enough from Alexie's usual work to make \"Flight\" a refreshing departure nonetheless.You can find this review and more on my blog Miss Print"}, {"userName": "Mario", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/16628840-mario", "userReview": "Is revenge a circle inside of a circle inside of a circle?Earlier this year, I read The Absolutely True Diary of a Part Time Indian, and I absolutely loved it, so I decided it would be a good idea to pick up another book by Alexie. So I picked up Flight. And honestly, I didn't expect to like this book as much as I did. It wasn't as good as Diary but it was still really good. I went into this book not knowing anything about it, so I was pretty surprised with how the plot unraveled. This book even had a couple of twists that really surprised me. In conclusion, amazing and heartbreaking book with an even greater message."}, {"userName": "Catie", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "I love books that make me stretch and consider and think, but this book has no subtlety. Reading this book is like being hit in the face with a sledgehammer over and over again. I mean sure, it’s a sledgehammer of compassion and nonviolence and I quite agree with its form and purpose and all, but getting smacked with it still smarts. I need for messages and ideas in fiction to be woven into the story more closely; I need to work at their meanings and root them out myself, so they feel like they’re mine. With this book all I felt by the end was a strong urge to scream, “I get it!”“Zits” is a teenage boy who has lost both of his parents and been shuffled around dozens of foster homes. His is filled with disappointment, pain, and rage. He feels separate from the rest of humanity, and he lashes out at those who try to help him. One night, in jail, he meets another boy who is beautiful and persuasive and calls himself “Justice.” Wrapped up in Justice’s incendiary ideas, Zits commits a horribly violent act and winds up getting shot. But instead of dying, he awakens inside the body of a white FBI agent. What happens next is a journey through time and different lives, where Zits witnesses both sides of war and violence.There are definitely parts of this book that I like. I think that Gus’ story, with the “little saint” and the Indian boy is the most well done. The last journey that Zits takes is one that I was expecting and even hoping for, but it’s just too heavy handed, like most of the others (although, I’m not sure that I really understood that whole part with the parakeet). The ending is ridiculously unrealistic, so much so that I feel like it cheapens the rest of the book.Sherman Alexie is no doubt a very talented writer, but I recommend that you read some of his other titles before this one. I guess that I wouldn’t recommend reading this book. One can easily receive the same information (and with a lot more grace and brevity) from the following quotations. I suggest you just read them instead!“An eye for an eye will only make the whole world blind.”Mahatma Ghandi“Peace cannot be achieved through violence, it can only be attained through understanding.\"Ralph Waldo Emerson\"Returning violence for violence multiplies violence, adding deeper darkness to a night already devoid of stars... Hate cannot drive out hate: only love can do that.\"Martin Luther King, Jr.Perfect Musical PairingSaul Williams – Banged and Blown ThroughSaul Williams writes powerful, angry, revolutionary music which I think relates well to Zits' mental state at the beginning of this book. This song is all about how broken we are on the inside."}, {"userName": "BrokenTune", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "[Btw, his real name is Michael.  (hide spoiler)]"}, {"userName": "Clint Jones", "userReviewDate": "Feb 08, 2008", "userURL": "http://www.goodreads.com/user/show/889784-clint-jones", "userReview": "I love this book!!! However, I must say, with a bit of sadness, that this is not Alexie's best book. Alexie is at his best when his prose is poetic, thought provoking,and humorous all at once. And, while this book certainly has its moments, it fails to substain the sentence-after-sentence, page-after-page trance that Alexie's writing is capable of producing. What I love about this book is how it has gotten my high school students, who would normally not even consider reading a book, to consume this one in a matter of days and come back asking for more books like this to read. (Hehe...I offer them Catcer in the Rye.)I give this book to my reluctant readers and tell them \"it's about a time-traveling serial killer.\" When they come back the next day, they can't wait to get together in their Lit-circles and begin discussing the characters, \"Justice\" and \"Truth\". And, while there are a few students who get confused by the novel's quantum leaps in time, there are always some who can explain what is happening to \"Justice\", In addition, the questions raised by the changing setting provide an excellent opportunity to introduce and teach magical-realism to the newly-awakened and curious, young minds. In fact, what makes this novel a high school literature teacher's best friend is that Alexie has created a seemingly simple story that lures readers in and, yet, the novel's structure, plot, humor, sadness, relevance to life and themes are intriguing enough to fascinate the most discerning reader.Kudos to Alexie for creating rare teachable moments in which ALL students are completely engaged and engrossed, and, best of all, they are motivated by a desire to make meaning and understand."}, {"userName": "Danika at The Lesbrary", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/3796959-danika-at-the-lesbrary", "userReview": "This was incredible. I highly recommend the audio book. Adam Beach (a Native actor who was in Smoke Signals) does it and he does an incredible job. This is a story about pain and justice and most of all rage. It's about how people do monstrous things and about the cruelty of the world, but also about... hope? Survival? Shouldering the responsibility of being a stranger?There is so much emotion, especially anger, in this book. It's not something to be picked up lightly. But it tackles rage head on, and doesn't invalidate it. I found myself blinking back tears on my walk home listening to the last few chapters. I found the ending a little abrupt and too neat, and there were some elements that didn't sit right with me (the terrorism subplot, for one), but overall this hit me hard.Although this isn't a light read, it is short. I highly recommend giving this a try, especially as an audio book."}, {"userName": "Emily", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/160694-emily", "userReview": "I wept the whole way through it. This book is marvelous. It bleeds empathy and compassion and is one of the most sincere, gut-real, open-eyed, forgiving, hopeful novels I've read this year so far. I love this book. The wit and charm of the teenage boy narrator kept me giggling and grinning, and the tone switches were so subtle and genuine and seamless that I would cry and laugh at the same times. Sometimes I would just cry. I am achingly pleased with Alexie and can't wait to pick up another of his works.Don't read this book if the language is going to distract you. You're literally reading the thoughts of an at-risk teenage boy. But the journey of the book is so important--I want a fistful of boys I've known in the past three years to read it immediately. There is a pain and an honesty and love for goodness that hurts me just thinking back on the novel. I want to read it every year so I remember what it taught me.I love that it's a hopeful book. I love that it is quirky and bizarre and so brilliantly conceived. The illustrations of society and history are bitter and raw and, yes, I want to say important again. I feel like everyone should read this and let themselves be changed a little bit today. I will encourage my own teenage children to read it when I have them, I don't care what kind of language it has. There is no sex, but lots of allusions to sexual molestations. Another warning. But seriously, if these things aren't going to bother you, it is well worth listening to this narrator kid for the day it takes you to read it. The human empathy you achieve is worth it. Five stars. And a grin."}, {"userName": "Ana Rînceanu", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/28781546-ana-r-nceanu", "userReview": "This is the kind of author I could develop a literary crush on."}, {"userName": "Pamela", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/4894054-pamela", "userReview": "There are just no words to describe the impact of this book. It should be required reading for the entire human race."}, {"userName": "Daniel", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/365191-daniel", "userReview": "I am sad that \"Flight\" was my introduction to Sherman Alexie, because I did not care for it, and, given the widespread praise that he has received, I suspect that it does not represent his best work. Many things about this book did not work for me. The time-travel device is forced upon the story to serve Alexie's agenda, which in turn breezed through a few historical anecdotes that were themselves shallow. The revelations that Alexie produces in these episodes, though weighty, are not surprising. Likewise, his protagonist (I believe his nickname is \"Zits\") never gains the substance that good characters achieve.While I do not remember any clear details about this book, I cannot forget thinking that Alexie relied on stereotypes to describe his characters and deus ex machina to move them from point A to point Z. This surprised me, too, as Alexie delves into some heavy themes, including the oppression of this country's native peoples; acts of terrorism in our contemporary world; and what family means in a fractured society that strips people of their heritage and ancestry. Any one of these themes can lay the foundation for a great novel, yet, for whatever reason, Alexie combines them all with conventional material that gives no indication that it came from the pen of a mature, established writer.My ultimate reaction upon finishing this book was, \"Where the hell did this come from, and why?\" And though I am not giving up on Alexie and his work, I cannot recommend this title."}, {"userName": "gina", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/2023352-gina", "userReview": "I once was a social worker and I can tell you, Alexie delivers an accurate account in a short amount of time of the struggle of many of these kids, and why they do the things they do. I love where his mind goes. I love how he writes. The narrator did the BEST job on this book. I cannot say enough good things about Sherman Alexie. One of the best writers of our generation and I wished this was required reading for both foster parents and social workers. Aside from that, the social overview of whites against indians and vice versa is well handled. Alexie is truly a gift. I wish I had the book version so I could have quoted you some of his amazing lines. But with audiobooks you rarely are in a position to stop it, find a pen and paper, and write down what moved you. I cannot say enough good things about this audiobook and Alexie. I'm repeating myself because Alexie always leaves me a little dumb struck. He steals all my words..."}, {"userName": "Fahime", "userReviewDate": "Jun 19, 2015", "userURL": "http://www.goodreads.com/user/show/1984471-fahime", "userReview": "سومین کتابی که از شرمن الکسی خوندم و بهترینشون. داستان کتاب در مورد یک پسر 15 ساله اس با نام مستعار زیتس، از مادری ایرلندی و پدری سرخپوست. پدر در بدو تولد اون و مادرش رو ترک می کنه و مادرش هم شش سال بعد در اثر سرطان سینه فوت می کنه. پسر که شباهتش به پدرش بیش از مادرشه، با همه در جداله. بیش از همه با اجداد سرخپوستیش. داستان از اونجایی شروع می شه که بیست و یکمین خانواده زیتس رو به فرزندخواندگی قبول می کنن و ...از خاطرات صد درصد واقعی سرخپوست پاره وقت خیلی بهتره و از رقص جنگ بهتر."}, {"userName": "Autumn", "userReviewDate": "Dec 27, 2010", "userURL": "http://www.goodreads.com/user/show/4590295-autumn", "userReview": "I do not think this is a book of hate (towards any race) but a book about self acceptance. Alexie has a sardonic sense of humour, a biting tongue, but also combines this with compassion in his stories. This story is really no different than his other works, even if in this particular novel he is heavy handed with some stereotypes. Stereotypes are real folks, not in the idea that all people fit their stereotypes but that they exist. I think that is what I felt him demonstrating here--people  feel  stereotypes especially the ones directed at them. Alexie writes in a way that you can share his characters' pain. I feel what they feel. I can relate to them. I am them for a time. It is why as soon as I pick up one of his books, I can't put them down.Fifteen year old Zits is in foster care, going from home to home. The police know him well, sadly because people in authority treat the kid like crap with the exception of one police officer. His pain stemmed from his mother's death and the father that abandoned him. So many heart wrenching memories have left this young man with a huge chip on his shoulder and rightfully so. However, it imprisoned him to a life of loneliness and misery. His inability to accept himself causes him to reach out for the acceptance of others and simultaneously prove himself unworthy of people's friendship. It causes him to feel lot of anger, resentments, and internalize that he deserved a life of pain.Then one day he is given a chance to live the lives of others throughout history. To feel what they feel and be what they are. This understanding leads to understanding of all those that have passed through his life, the good people, the bad ones, the entirety of his own being. I loved it because it showed that the way others treat us is not the reflection of ourselves but the reflections of those individuals.Alexie is bold which makes the realness/authenticity feeling of this novel exceptional. So is his message. I wonder how he can write something so meaningful yet write it so simply? As an author he is both a truth teller and story teller, a powerful combination that has the profoundness to change the world one paperback at a time (in my humble opinion)."}, {"userName": "claire", "userReviewDate": "Apr 14, 2007", "userURL": "http://www.goodreads.com/user/show/15339-claire", "userReview": "I love Sherman Alexie's writing and have heard him speak on a radio program--what a loving, funny, open-hearted person. If you've ever read any of his short stories, you know how he can weave humor into seemingly dire situations. I can't wait to have a full week where I can read this new addition to his collection. OK! I've read it and WOW. It only took me about 5 hours in total. Fast-paced and raw, this book was a roller-coater ride through not only history, but the life of the beloved \"Zits\"--the teenaged main character who ended up stealing my heart. This is a great book, and as you can see by my expectant review above, I knew it would be. There is something about being an adult that often allows us to forget completely about what it is like to be a teen. Maybe it's the pain. Maybe it's the heartache, but as someone who is dedicated to helping young people survive the torture that can be the American high school, I do believe that this book is one that touches on those years with reality, heart and integrity...while also, and this is the beauty and talent of Alexie, illuminating the historical and current struggles of an oppressed nation and culture. Wonderful read. Worth more than 5 hours. I literally laughed and cried out loud. Buy it, borrow it, read it."}, {"userName": "Lila", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/4656570-lila", "userReview": "At first novel seemed so promising. Unfortunately there were several disturbing things that prevented me from enjoying it. Sherman Alexie tackles the issue of racism against Native Americans which of course I applaud. Unfortunately, in too many ways stereotypes are simply reinforced. Most of the Native Americans in this novel are either killers or alcoholics. There are no positive characters to balance them out.  At the same time, when describing white people he often uses adjectives like \"beautiful\", \"good looking\". Women ( always blond and blue eyed) are either \"hot\" or not hot.  Most disturbing of all is one of the leading character's time traveling incarnations as a pilot giving flight lessons to a Muslim terrorist who he thought was his best friend. The terrorist friend is from Ethiopia umm...Ethiopia is a predominantly Christian country. Up to now there have been no acts of terror committed by any of Ethiopia's Muslim minorities.  This little sub plot served no purpose in the story whatsoever except to further perpetuate racial stereotypes and Islamphobia"}, {"userName": "Wil Wheaton", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/2040005-wil-wheaton", "userReview": "Highly recommended, especially for younger (high school) readers."}, {"userName": "Gloria", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/1228761-gloria", "userReview": "If you haven't discovered Sherman Alexi yet, I suggest starting now. I would start with the \"Absolutely True Diary of a Part-Time indian.\" And then I would pick up this book and lose yourself in it for about a 24 hour period. It is a short read, but filled with life lessons of understanding your past so that you can better understand yourself in the present. Zits is a 15 year old foster kid who has moved from home to home, staying somewhere sometimes for less than a few hours. He is part American Indian and part Irish, though his Indian father left before he was born so he is not identified as Indian on his birth certificate. His Irish mother dies when he is six from breast cancer. Zits is in and out of jail as much as he is in and out of new foster homes. This book takes place at a cross roads for zits. He can either continue on his destructive path or take a different one. He comes to choose his path by traveling in time to inhabit different people at different times of the century. He experiences war, crime, and hatred in many forms, and through these pasts comes to a deeper understanding of what he is willing to let go of to hang on to what he really needs in his life. I gave the book four stars because it wraps up just a little too nicely at the end, but otherwise I recommend it!"}, {"userName": "Barbara", "userReviewDate": "Oct 19, 2016", "userURL": "http://www.goodreads.com/user/show/798978-barbara", "userReview": "Sherman Alexie defies genre classification, which it seems is common for Native American authors. I am assuming this is a YA novel as the protagonist, \"Zits\", is 15 years old. This book includes time travel, which later in the story just stops happening. It is set in Alexie's Northwest, and those familiar with that area know that Native Americans, especially in urban cities, struggle with social issues including racism, drug and alcohol abuse, homelessness, and more. Zits is an orphan, child of a white mother and Indian father. He is passed from foster family to foster family where he experiences verbal, physical and sexual abuse. His time traveling adventures could be interpreted as the ultimate escape from an awful life. The book is funny and crude, and violent and sad. It is definitely not for younger readers. But it provides a look into contemporary Indian life, and Alexie does not spare his reader by sugar coating."}, {"userName": "Ruby  Tombstone [With A Vengeance]", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/5973086-ruby-tombstone-with-a-vengeance", "userReview": "I like Alexie's writing, but this just wasn't written for me. It's a YA novel, and weighted heavily on the didactic side. \"How To Survive Being A Native American Youth By Encountering Time Travel & Thereby Learning All The Major Lessons in Life\" would have been an extremely accurate title.The 40+ study questions in the back make me wonder if perhaps this was written as a facilitator's guide for an \"at-risk youth\" program. I'm sure I'm being unfair, as I've really enjoyed Alexie's short fiction, but this just wasn't for me. In every sense."}, {"userName": "Julia", "userReviewDate": "Jul 06, 2008", "userURL": "http://www.goodreads.com/user/show/1303301-julia", "userReview": "Reread for a Library bookclub on race and racial issues. At my suggestion.Zits is a fifteen year-old foster kid, who has lived in twenty homes, who is half Indian and half white, whose rage, lack of identity, loneliness and guilt defines him. He goes into a bank prepared to shoot the customers. Why a bank? Because poverty also defines Zits. And he winds up time traveling and body traveling through five other people. First, is a white FBI agent who kills an Indian in 1975. Second is a mute 12 year old boy in the stinky camp where Custer had his Last Stand. Gus is an old and arthritic Indian tracker who helps a young soldier and a little boy escape the slaughter. Jimmy the pilot whose guilt and betrayal consumes him for teaching and befriending Abbad, who flies a plane into a Chicago highrise. Then he becomes a drunk, homeless, nameless, Tacoma man who turns out to be Zits’ dad. Whose own father terrorized him, and who he wanted dead as an 8 year old.The book begins with “Call me Zits. Everybody calls me Zits. That’s not my real name, of course. My real name isn’t important.” (p.1) “I have returned to my body. And my ugly face. And my anger. And my loneliness.” (p.158)In the reading guide it is asked if this is a cri-de-coeur, a phrase or genre I’d never heard of, which translates to ‘cry of the heart’ in French and means an ‘impassioned outcry, appeal, protest or entreaty.’ Yes, this novel is surely that. Review from 12/18/2007:I loved loved loved this book and am rethinking teaching Slaughterhouse V instead of this similar in story, but infinitely shorter novel. (Shorter is almost always better for my students.) Except that this one’s protagonist is a very contemporary Indian foster boy named Zits. He travels back and forth in time, to FBI agents who are killing Indians in the 1970’s, to an Indian scout, to a mute Indian boy who is with Crazy Horse, to his own father. Zits will be more immediate to my students, and is a great introduction to Alexie, to Vonnegut and Holden Caulfield, who Zits is also very like."}, {"userName": "deena kirk", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/1745063-deena-kirk", "userReview": "Quite a rough first half. It took me a bit to warm up to the fantasy element of the read, however, the \"ghosts\" of past and present come together for the boy's future. I find myself on a conflicted plane with Alexie's story in this book. I do not love the harshness with with it is told. Yet, it would ring false for the main character if he had a softer viewpoint. I lived in South Dakota during my elementary school years. My father was an FBI Agent. He was transferred to Rapid City after the killing of two Federal Agents on the Pine Ridge Reservation during an uprising. We toured Pine Ridge as a family a couple of years later. I was about 8 or 9 years old. My father kept his gun under the front seat in the car. We were not allowed to get out, but I saw the field where the agents were surrounded and executed. We also drove through the town, Pine Ridge, and I saw firsthand the skeletal nature of reservation living. The landscape-less surroundings of the crappy little trailers. They were uncared for, thrown out like their inhabitants. This is an extremely stung memory for me. He said almost nothing about his work on the reservation. I wonder what sort of sadness he had to carry around after viewing, firsthand, the sandiness of the place. As a grown woman, I see that my understanding of the \"indian's\" plight was meager. Sherman Alexie tells the truth in his books. It is uncomfortable. It is harsh. It is unsightly. I believe in upcoming years, his works will point up an open sore, that quietly persists in our country's self-image. One that will not heal itself. One that will hurt immensely to open up and scrape out, but must be addressed."}, {"userName": "Jennifer", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/1599338-jennifer", "userReview": "Flight is an apt name for this book since the theme appears throughout. In fact, I think of the book as a flight of fancy because the main character body hops from one time-period and social-economic status to the next. He is an angry, orphaned half-Indian who finds himself the body of an FBI agent on a reservation in the 70's, then a Native American boy during Custer's Last Stand, an Irish soldier during the same time period, a flight instructor during current times and finally his own absent father. This conceit was a bit awkward though the main character's voice is strong and convincing throughout. I think this book was a way to address senseless violence of the lone shooter kind and also acts of terrorism such as 9/11 but I didn't feel any great truths were revealed. It is supposed to be poignant and funny at the same time but the humor, to me, was not that funny. This was the first time I had read Sherman Alexie after seeing his name in many places over the years and I can't say that I was hugely impressed. However, I read another GoodReads review that suggested this may not be his best work. It is not, by any, means a terrible book but not particularly impressive. However, It's not long and interesting because it comes from a unique perspective. I will check out more of his books if I get the chance."}, {"userName": "Miss Ravi", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/21314656-miss-ravi", "userReview": "راوی این کتاب من رو یاد راویِ زندگی در پیش‌رویِ رومن گاری انداخت. خب چیزهای مشترکی با اون داشت ولی حرف‌هاش خیلی با سنی که داشت منطبق‌تر بود. حرف‌هاش شخصیت یه نوجوون آشفته حال و بی‌پدر و مادر رو داشت که قرار نبود فلسفه‌بافی کنه یا گنده‌تر از دهنش حرف بزنهولی نکته‌ی اصلی شاید کاری بود که توی روایت و ماهیت کتاب اتفاق می‌افتاد و کاملاً به اون جمله‌ی کوتاهی برمی‌گشت که کتاب باهاش شروع می‌شه؛جیک‌جیک؟که لازم هم نبود زیرش منبع این نقل‌قول رو بیاره چون آدم به سادگی یادِ سلاخ‌خانه‌ی شماره‌ی پنج می‌افته و چندفصل که پیش بری می‌فهمی اون نقل قول به چه دلیل اومده. قراره راوی هم مثل بیلی پیل‌گریم اتفاقاتی براش بیفته.میون این رفتن‌ها و سفر کردن‌های راوی انتظار یه پیوستگی بیش‌تر و عمیقتر داشتم نمی‌دونم چرا بعضی قسمت‌ها حوصله‌م سر رفت (با این‌که کُل کتاب رو در کمتر از یه روز خوندم) به نظرم می‌اومد چرا این آدم‌ها رو انتخاب کرده؟ فقط واسه نشون دادنِ خیانت و بی‌اعتمادی؟ ولی بدون سخت‌گیری باید بگم که انتخاب‌های بدی نبودن ولی همون نقل قول من رو یاد ساختار خیلی منسجم کتابِ ونه‌گات می‌نداخت. و چیزی که دوست نداشتم پایان خیلی روشن کتاب بود. اصولا یه هپی‌اندِ غلیظ بعد از یه عالم اتفاقات خشونت‌آمیز توی ذوقم می‌زنه. چطور همه‌چیز به این خوبی تموم شد. شاید جمله‌ای که دوست داشتم توی آخرین صفحه این بود که راوی گفت: خوشحالم اما می‌ترسم و این ترسیدن یه کم این پایان خوش رو تعدیل کرد برا من حداقل."}, {"userName": "liz", "userReviewDate": "Mar 01, 2008", "userURL": "http://www.goodreads.com/user/show/67550-liz", "userReview": "Okay, so this was my first time ever reading Alexie. I had been kind of hesitant, since he's The Indian Author, and it makes me feel bad for all the other Indian authors floating around out there (I imagine the publishers: \"Well, we got The Indian Author, we don't need to worry about finding any other ones!\"). So, I was pleasantly surprised that his writing is so good.The way the story is set up reminds me of The Law of Love, in that there's a ton of switching back and forth between other lives and times and bodies. In this case, an Indian teenager who's been screwed over by the system zips around between crucial moments in Indian history and key moments in some other peoples' lives. It's intense, and well-done, and the ending is a little too happy-tidy for me, but in a novella like this, anything too dark would have just been too much.I practice killing people until it feels like I'm really killing them. I wonder how long it would take me to really shoot somebody. I wonder what would happen if I killed ten, twenty, or thirty people. If I killed enough people for real, would it begin to feel like practice?"}, {"userName": "Jennifer", "userReviewDate": "Oct 20, 2009", "userURL": "http://www.goodreads.com/user/show/1578083-jennifer", "userReview": "Finished this on my drive home tonight. It was really good! The person reading this book was perfection. Awesome inflection - I actually believed he was the main character - which pretty much never happens with me and an audio book. I love Sherman Alexie books because I think he is a story teller and not just a writer. So the last two weeks I have listened to this wonderful story being read to me. The nutshell of the story is about the journey of a teenager named \"Zits\". He is half Native American and half Irish and an orphan making his way from foster home to half way house. Sounds kind of depressing - but it was really good. Zits goes on a bit of a journey - and you get to go along for the ride. It stirred some stuff up in me. I had some of my usual family stress dreams and a little bit of insomnia. I guess it's good though. Sometimes a person needs a little stirring up. I am sure this would be a good book to read - but I have to say that I am really very happy I listened to this in Audio Book format. I will be seaking out more Sherman Alexie audio books and I hope they are all narrated by Adam Beach."}, {"userName": "Liza", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/232443-liza", "userReview": "I’ve been meaning to read a book by Sherman Alexie for a while now, and after reading Flight, I now want to devour everything that Alexie has ever written or been associated with. Flight is the story of Zits, a teenage Native American orphan who repeatedly finds himself on the wrong side of the law. Upon meeting another lost teenager, Zits thinks he has discovered the outlet for his anger, but suddenly he is traveling through time to important eras of Native American history--both in the popular and his personal imagination--and he is forced to see the world from many different perspectives. You wouldn’t think a book with this topic would be humorous, but at times Flight is darkly hilarious. Alexie has perfectly captured the voice of a confused teen without being condescending or overly dramatic, and he manages to make you feel a part of the histories he relates. I never could envision “Custer’s Last Stand,” but now I can. While a quick read, Flight is not short on substance, so absolutely everyone should read this book."}], "description": "Flight is the hilarious and tragic story of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful, swift prose, Flight follows the troubled teenager as he learns that violence is not the answer. The journey begins as he's about to commit a massive act of violence. At the moment of decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil-rights era. It's only the first stop. He continues traveling back to inhabit the body of an Indian child during the battle at Little Bighorn and then rides with an 1800s Indian tracker before materializing as an airline pilot jetting through the skies today. During these furious travels, his refrain is: \"Who's to judge?\" and \"I don't understand humans.\" When he returns to his own life, he is transformed by all he's seen. This is Sherman Alexie at his most brilliant--making us laugh while breaking our hearts. Simultaneously wrenching and deeply humorous, wholly contemporary yet steeped in American history, Flight is irrepressible, fearless, and again, groundbreaking Alexie.", "title": "Flight", "url": "http://www.goodreads.com/book/show/3186219-flight", "average": 3.89, "cover": "https://images.gr-assets.com/books/1348906144l/3186219.jpg", "reviews": 2005, "authors": [{"url": "https://www.goodreads.com/author/show/4174.Sherman_Alexie", "name": "Sherman Alexie"}, {"url": "https://www.goodreads.com/author/show/2894286.Adam_Beach", "name": "Adam Beach"}], "type": ["Fiction", "Young Adult", "Fantasy", "Historical", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3186219-flight", "http://www.goodreads.com/book/show/52872.Flight", "http://www.goodreads.com/book/show/6387628-flight", "http://www.goodreads.com/book/show/19024059-flight", "http://www.goodreads.com/book/show/9845170-flight", "http://www.goodreads.com/book/show/4150656-flight", "http://www.goodreads.com/book/show/18689238", "http://www.goodreads.com/book/show/693208.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "http://www.goodreads.com/book/show/52873.The_Lone_Ranger_and_Tonto_Fistfight_in_Heaven", "http://www.goodreads.com/book/show/6159.Reservation_Blues", "http://www.goodreads.com/book/show/31420708-you-don-t-have-to-say-you-love-me", "http://www.goodreads.com/book/show/52877.The_Toughest_Indian_in_the_World"]}