{"ratings": 35341, "userreviews": [{"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "[“Suddenly, out of the water on either side of them came two huge penises, the males searching for their mark, moving closer to the female, producing waves that knocked the two women into the floor of the boat. Above them the two pink towers curved around looking for their target, feeling the edges of the boat, running slime across the rubber, over the biologists, poking, beating about, and generally abusing the women. The female now had the Zodiac centered exactly over her genitals, using the rubber boat as an ad hoc diaphragm.”  (hide spoiler)]"}, {"userName": "Lyn", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "I have yet to read a book by Christopher Moore that I did not like, that failed to entertain and enlighten and to simply be a very enjoyable good read. Fluke is no exception. This is the story of a couple of marine biologists who have spent decades studying humpback whales and who really just want to know why they sing. From here we get taken on another Christopher Moore ride that is as hilarious and mind bending as the last. Is he the American Neil Gaiman? I like them both and can see the similarities both in style and theme. Fluke is a fun book with some scientific weight to it, but it never gets bogged down in too much explanation and remains to the end just another great book by Moore."}, {"userName": "Marvin", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "After completing Fluke, I started to envision this fantasy scenario on how the novel came to be...Book Publisher: Thank you for coming in today, Mr. Moore. I wanted to discuss the manuscript you sent us.Christopher Moore: Yes, of course. The Song Cycles and Migratory Habits of Whales. Did you like it?BP: Well, liking it isn't really the point. It's about whales.CM: And?BP. No. I mean...It's really about whales. It's non fiction. Unfunny non-fiction.CM: But that's my point! Everybody expects me to be funny all the time. I'm so funny people do not realize how much research I do on my topics. I have a serious side. I want to inform, to research, to make a serious contribution to society!BP. But...your contract specifies a novel... a funny novel. I'm not sure people are ready for Christopher Moore the oceanographer. Isn't there some way you can change it. Put in a plot? Make it funny? Perhaps add a Rastafarian wanna-be and a crazy lady millionaire?CM: I'll see what I can do.Three weeks later:BP: I just read your new draft. I'm glad you changed the title. I must say it is really funny. CM: So what did you like about it?BP: I loved the Rastafarian wanna-be. And I loved the sci-fi elements. That's a little different than your previous works. I have to hand it to you. I not only laughed a lot but I learned a lot about whales. Your research really is impressive.CM: Thank you.BP: And I loved that gotcha moment at the beginning where the marine biologist sees \"Bite Me\" written on the tail of the whale.CM: I'm glad, because you were my inspiration for that part.BP. Why, Than...Oh.CM: Now, lets talk about my new manuscript that I sent you recently. A Concise History of European Impressionist Artists and Their ModelsBP: Uh...Yeah...I wanted to talk to you about that..."}, {"userName": "Amanda", "userReviewDate": "Nov 28, 2008", "userURL": "http://www.goodreads.com/user/show/645979-amanda", "userReview": "Soooo, it took me about 43 years to read this book. And upon thinking for a while and discissing it with Christina for a while I've come to the conclusion that my opinion is based on a two-fold rubric. (Can rubrics have folds?)Anyway...Point 1. Character Development. The character development in this book sucked balls. And not in the good way, either. Point 2. Plot.The plot was fuckin' awesome. Except for the fact that it didn't start until a third of the way into the book. But whatev. It's still a clever story filled with science! (I love science!!!)Let's discuss the above two points in more depth, shall we? As far as character development goes, I'm really disappointed. I mean, really. Amy is supposed to be some quirky gal whose personal slang consists of \"mook,\" \"jeepers,\" and other silly stuff. But she didn't develop that characteristic until we'd met her a half a dozen times. Another example, and I'll try to spare you details, occurrs @ the end of the book. There's a reunion. And it should be romantic and touching, but it's not. It's just quick and flat. Why even bother? Pissed me off. Alrighty, plot... Underwater city and additional theories of evolution--genius! Carbon based passenger vessels navigated neurogically--double genius! Loved it. Kick ass. Cool. And then they saved the world. No surprises there. That's all I have to say, really. The book was ok, not great. I'll probably read another Christopher Moore, but only because Christina (et al) really love him, so I figure it's worth giving him a second chance."}, {"userName": "Armand", "userReviewDate": "Feb 24, 2008", "userURL": "http://www.goodreads.com/user/show/188248-armand", "userReview": "People swear by this guy, in a devotional sort of way. I was excited to try one of his novels, and frankly, I’m usually a sucker for otherwise human stories with some elements of the unexplained (see Tom Robbins, “Magnolia”, or Lost). Moore’s “Fluke” started out as no exception. I was engaged by the characters, laughed out loud a few times, and was hooked into these mysterious events and the promise of something larger. The insertion of scientific fact (mostly marine biology and humpback whales) and mysterious Defense Department goings-on only increased my interest. That same blend of factoids/anecdotes into somewhat bizarre fiction has caused me to tear through a few Chuck Palahniuk novels, and that’s the sort of pace with which “Fluke” flies by. So, it can’t be all bad. The story just lost me when it started explaining too much. I think I like my mysteries unresolved, or at least not so neat. Not to geek out too much, but I had this same feeling during the second season of Lost. I felt disappointed when too much was attributed to some psychology experiment and everyone stopped being afraid of going in the jungle. Here, there’s a different explanation. And even though the second half of the book was entirely original, with its own absorbing twists and turns, it felt like a different book; like something I hadn't signed up for. All of the new developments started feeling less like originality and more like a cop out. The character development dropped off, replaced with fantasy/sci-fi explanations that I just didn’t care for. It’s still a funny, mostly engaging read, but I finished “Fluke” with that feeling that is never a sign of a book gone well: I didn’t want more. In fact, I wish there had been less."}, {"userName": "Omar", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/799996-omar", "userReview": "I love Christopher Moore.. this is my fifth book of his, but this one fell short for me. The story is of a scientist who studies whales and their songs. He has worked many many years in the field and when he sees the words \"BITE ME\" on the tail of one of his whales he is determined to find out how it is even possible. Things are further complicated when the town crazy informs him that the whale he saw called her and asked her to tell him to come visit the whale and bring a pastrami on rye sandwich. There are a few memorable characters such as the Jersey boy who claims he is Hawaiian and a Rastafarian or the assistant who is smoking hot, but slightly not human. In the end it was an interesting read, slightly humorous, but not one of my favorites."}, {"userName": "Yael", "userReviewDate": "Feb 08, 2009", "userURL": "http://www.goodreads.com/user/show/1714801-yael", "userReview": "So far, I haven't met a book by Christopher Moore that I've disliked. Or even merely had a lukewarm feeling for. Fluke is no exception. I mean, how can you not like a writer who produces such lines as \"A centipede the size of a Pontiac had once lived in the bottom-right corner of the trunk but had long since moved on once he realized that no one was ever going to bother him, so he could stand up on his hind hundred feet, hiss like a pissed cat, and deliver a deadly bite to a naked foot\"?Moore writes about things he cares about -- and there are hundreds of them, from people to whales to fruit bats to island paradises to conservation issues to the inevitable jerks who make life so interesting, and on and on and on. In Fluke he gives us whales and their lives, and those who study them. But rather than the predictably over-emotional, politically charged, and buzzword rhetoric that makes up 98% of Green hyperbola on the subject, Moore gives us real people studying real whales -- and the real catastrophes and downsides frequently accompanying such studies.Why do humpback whales sing? Marine biologist Nate Quinn and his crew poke, chart, record, and photograph huge, wet, marine mammals trying to find answers to that question. And then, one day, a whale lifts his tail into the air to display a cryptic message on his flukes: Bite me.The problem is that only Nate saw that message. He's beginning to wonder if Hawaii's hot sun has baked his brains a little too thoroughly. Neither his longtime partner, Clay Demodocus, nor their young research assistant, Amy, not even their other assistant, addlepated, pot-smoking, white-boy Rastafarian Kona (a.k.a. Preston Applebaum) saw it. But later, when a roll of film comes back from the film lab with the crucial frame missing, the one that shows those flukes and the message on them, and his research facility is trashed, Nate begins to think there's more to this than a mere hallucination.What can you say about this novel? Witty, irreverent, puzzling, fascinating, and surprising, Fluke is Moore at the top of his form -- and a great incentive to track down and read everything he's ever written."}, {"userName": "DJ Harris", "userReviewDate": "Mar 27, 2013", "userURL": "http://www.goodreads.com/user/show/18766325-dj-harris", "userReview": "Christopher Moore does it again! Fluke: Or, I Know Why the Winged Whale Sings by Christopher Moore is a very enjoyable read! I have enjoyed every Christopher Moore book that I've read. I HIGHLY RECOMMEND this book."}, {"userName": "Mikah", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/1857918-mikah", "userReview": "This is the first book I have read by Christopher Moore, and I was really surprised at how much I enjoyed it. It is about Nate Quinn, a biologist who is studying humpback whales trying to figure out the meaning of their song. Odd things start to happen, though, like finding a whale with ‘Bite Me’ painted on its tale and somebody breaking in and trashing his lab. While trying to figure out who would want to sabotage his research he starts to question how much anybody could even care about the work he has done for the last 25 years, and realizes that even if he finds the meaning in the song, nobody would ever believe him. Throw in a few near death experiences, a cast of the most eccentric and eclectic characters I’ve ever experienced, and Killer whales named Kevin, and you’ve got a spectacular book that was far more enjoyable that I had expected."}, {"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "Good book.Some laugh or loud moments.Not one of his best though."}, {"userName": "Steve", "userReviewDate": "Oct 30, 2007", "userURL": "http://www.goodreads.com/user/show/444802-steve", "userReview": "5 OoksDo you like mysteries?Do you like to laugh?Have you ever wondered why whales sing?Did you ever wish you lived in Hawaii?Did you ever wish you could see one of those white-boy poser Rastafarians get a bit of a stomping?...Hey now, don't be a hater...Moore evokes beach people and the islands in this fun and fast moving tale. It's filled with his usual wit and wacky, but lovable characters, and leavened with a bit of a message (but, not preachy).This is a book that will draw you in and leave you wanting more (no pun intended). Even though it's a mystery, it's just as good on the second reading."}, {"userName": "Kogiopsis", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/1462364-kogiopsis", "userReview": "[who turns out to be in her 60s, but… as a 20-something aspiring marine biologist, that doesn’t make the hundreds of pages of him ogling her butt any less creepy (hide spoiler)]"}, {"userName": "Preeti", "userReviewDate": "Mar 09, 2009", "userURL": "http://www.goodreads.com/user/show/2110092-preeti", "userReview": "Why do humpback whales sing?This is the basic theme behind the story contained in this book. I picked it up because whales are one of my favorite animals, and I have always loved listening to their singing. Also, I hadn't read a funny book in a while, and needed a break from the 'serious' stuff.I have to say it: It's a whale of a tale!The book starts out fairly normal, but then, takes a turn into the land of the zany. Really. You will have no idea what hit you. And that, truly, is the best part.It's a pretty fast-paced read, and the humor is great! I especially loved the subtle humor and the innuendo. Always fun. Author's Note (from the official site): What do most people know about whales beyond that fact that theyre big and wet? Not much, right? Well, having been a scuba diver for a long time, and lived next to the ocean for some twenty-five years, I thought, I really should learn more about these big wet things that keep swimming by. So I started learning about whales, and more important, the people whose business it is to learn about whales. Something happens when you spend any amount of time on the ocean with people who have a less than conservative view of how one should make his living: you begin to feel that adventure is its own reward. You begin to measure experience, rather than sustenance, as the goal; and you begin to get a feeling for those adventurers you left behind in your childhood: those salty rapscallions sprung from the imaginations of Jack London and Jules Verne and Robert Louis Stevenson -- even the twisted eccentrics of Joseph Conrad and the ancient undersea beings of H.P. Lovecraft. (And you begin, too, to wish youd brought along some Dramamine.) As a writer, you get it, the same way that you got it when you were a kid, and theres not much you can do but share the adventures. So I got it, and Im passing it on to you, that \"fear recalled in comfort\" that is called the adventure story. Have fun. Sincerely, Christopher MooreMy Note: Save the whales! Don't allow whaling!"}, {"userName": "Andrea Gatti", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/7188911-andrea-gatti", "userReview": "Avendo letto quasi tutti i suoi libri, di Christopher Moore ormai ho due scaffali distinti:Lo scaffale wow e lo scaffale poteva-essere-wow.Questo libro lo colloco nello scaffale...*rullo di tamburi*Wow!Un'idea balzana, come sempre, ma cotta a puntino.Non so perché, ma stavo lasciando questo libro per ultimo (penultimo, alla fine, mi manca ancora The Lust Lizard of Melancholy Cove), m'ispirava non troppissimo, e per giunta avevo visto per sbaglio la copertina della versione inglese, dove rappresentavano il giovane Kona pedalando in una specie di balena-risciò, dandomi l'idea che ci sarebbe stato un rasta malvagio che attacca la gente da dentro a una balena con scritto BITE ME sul sedere (vabbé, pinna, non sedere).Odio le copertine fuorvianti (e pare che anche Chris le odi, ma che gli editori l'abbiano sempre vinta).Leggendolo invece, mi sono dovuto ricredere, è uno dei suoi lavori più ispirati, tra quelli meno famosi e spesso considerati (almeno da me) minori.Non è ai livelli di Lamb e Dirty Job (che forse si meritano uno scaffale a parte), ma mi ha fatto morire dal ridere e ha dei personaggi davvero azzeccati. Anzi, pensandoci bene direi che tutti i personaggi sono ben riusciti e credibili.Il difetto che gli trovo, e che purtroppo riscontro in molti dei suoi libri, è che il finale quasi sempre non è all'altezza del libro. Non c'è mai una grande minaccia, né uno scontro, né niente di particolarmente avvincente, bensì una risoluzione piuttosto lineare degli eventi e un happy ending a effetto. Purtroppo in Fluke si nota in particolar modo, l'ultimo 10% del libro perde un po'. Ma almeno è solo un 10%, e tutto quanto lo precede è invece di ottima fattura.Peccato soprattutto perché me l'ero immaginato un bel finale coi fiocchi e infatti, mentre adocchiavo con timore la percentuale di completamento, pensavo: \"Ahi ahi ahi, mica c'è spazio per tutto quello che vorrei che accadesse\"."}, {"userName": "Jenniet Galvan", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/6676473-jenniet-galvan", "userReview": "I like reading books by Christopher Moore because they make me laugh out loud! And I like to laugh out loud. I also like them because they are generally pretty irreverent and I like irreverent. For a short time I thought I was going to be a scientist and majored in Biology so the whole science angle was appealing to me and who doesn't like whales? Not to mention I have an irrepressible fascination with anything to do with the sea, making this book an automatic winner unless I was just bored out of my mind. I didn't even mind that it didn't have vampires in it. Actually with all of the vampire literature out there it was nice to find something that was interesting that DIDN'T have to do with vampires. It was a nice mystery, science-fiction adventure for me. I got to go to Hawaii and hang out with some behavioral scientists, studying whales and then go to an underwater city filled with human-cetaceous mutants, not to mention the dictator with a messiah complex. It was a pretty nice little jaunt under the sea and I enjoyed it. What I didn't like was the continual use of \"I think something and then I say it\" such as \"Nate was suddenly cold, and when he opened eyes, he was pretty sure that his head was going to explode. 'I'm pretty sure my head is going to explode,' he said.\". Once was okay and cute, but over and over just got on my nerves. It's a good thing I like stories about whales, even if they are written to propagandize. The political message wasn't all that bad and I do think saving whales is a good thing, I just don't like to be preached at as I was in the author's notes. It's okay, I still like Moore and this was a pretty good book and it made me laugh."}, {"userName": "Heatherarleney", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/28253541-heatherarleney", "userReview": "The story starts with marine biologist Nate Quinn studying humpback whales when, all of a sudden, he sees one with \"Bite me\" written across its tail, which jump starts a whole series of increasingly odd events until things take a turn for the science fictional.It's this turn that seems to bother people in other reviews I've read, but I thought it was intriguing, and Moore deserves credit for describing these otherworldly elements as quickly and effectively as he does. Worldbuilding can easily weigh a novel down, especially when it begins over one hundred pages in. Instead I felt that, after wandering around giggling at itself for fifteen chapters, Fluke was finally going somewhere.However, the vast majority of the story goes by with little to no real conflict and, once the danger finally presents itself, it disappears shortly afterwards doing almost no damage whatsoever. It feels like something really cool could have happened here, but we wound up with an otherwise decent yarn truncated by a clunky, poorly-tied knot. Everything is fine. Everything always was, for the most part, fine.Full review here."}, {"userName": "Megan", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/19290908-megan", "userReview": "This is the second Christopher Moore book I've read, but it was certainly enough to get a handle on his typical plot line: Random guy gets involved in a strange situation he can't understand that relates to some type of odd deity, he falls for a very attractive girl who is involved in the weirdness, after very silly plot twists the couple find a way to \"ride off into the sunset\" together. While this type of explanation would usually put me off reading more of his books, his writing is done so well and the stories so inventive and hilarious that I can't help but enjoy them. This book is about hump back whale researchers living in Hawaii, and while I'm no marine biologist the facts all seemed very well researched. A group of researchers are involved in figuring out why the hump backs sing and what they may be saying to each other, which throws the head researcher into a crazy adventure he could never have imagined. The hot girl is a research student working with the team, but she turns out to be much more. The plot is just so ridiculous you can't help but feel entertained. If you're looking for something smart and funny, I would definitely recommend you give this a read."}, {"userName": "Daniela", "userReviewDate": "Nov 05, 2016", "userURL": "http://www.goodreads.com/user/show/33298582-daniela", "userReview": "Christopher Moore is brilliant. He is so smart, it's insane and this book is proof of that. The fact that he can take a well-researched topic and turn it into this bizarre and magical adventure is pretty amazing. Honestly, I picked up this book so as to \"get that one out of the way\" as the plot didn't really interest me. Boy, was I wrong. The story is super bizarre but it's highy enjoyable and the characters are really well-developed (which so far seems to be a constant with this author and possibly the reason I like him so much). There are a ton of really fun moments in this book, Moore never disappoints.It flops here and there and a few things don't make sense within the plot and that's why I'm not giving it five stars.Also, the Conservation section at the end of the book is fantastic and I was really glad I read that. It shows not only his talent at writing but also how smart he is and how aware he is of dangerous environmental practices and the relatively easy ways in which we can help change them. I respect this man a lot, but these few pages just put him on a whole other level."}, {"userName": "Libby", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/1803452-libby", "userReview": "\"Nate wouldn’t have been more surprised if he’d walked in on a team of squirrels building a toaster oven.\" - a quote worth repeating.I’m giving this one 5 stars because it was simply a delightful read from beginning to end. Christopher Moore tackles the scientific mystery of whale song in his own unique way. This book is wildly creative and funny while being surprisingly well researched. It appears that Mr. Moore spent a fair amount of time with biologists and whale researchers in Hawaii preparing to write this book. In Fluke Moore takes a serious topic and blends in just the right amount of absurdity. The story is intriguing and well-paced. I loved the characters, loved the whales, laughed aloud and just had a lot of fun with this book. I especially enjoy Moore's gift for simile and visual imagery.I’d recommend this to anyone who enjoys Douglas Adams, Terry Pratchett and/or Kurt Vonnegut – all masters of absurd humor and keen observers of humanity. Moore sits comfortably in their ranks and I’m glad someone suggested his books to me."}, {"userName": "David", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/39036515-david", "userReview": "I liked Lamb so much that I immediately purchased another Christopher Moore novel to start reading. I will admit that this one was quite a bit more bizarre, but I enjoyed it just as much. There was a lot of interesting facts about whales and biology thrown in so seamlessly that before you realized it, you had learned something. Furthermore, there were many parts of this story that were laugh-out-loud funny and, like Lamb, I found it hard to put it down once I started. I found Christopher Moore to be capable creating multidimensional characters that you can actually empathize with as the story progresses. I definitely recommend this book if you're a fan of Moore's other stories."}, {"userName": "Lorelei", "userReviewDate": "Sep 07, 2007", "userURL": "http://www.goodreads.com/user/show/358772-lorelei", "userReview": "Whale research gone weird. I have read or listened to this book so many times I can't count them, and I still find it an entertaining and delightful read. I honestly don't know why this book never palls as so many other favourites have over the years, maybe someone can come up with a good theory. In any event, I was having a bad patch and decided to go through it all the way and in order again, and it was another wonderful ride. I've no idea if anyone else would likes it as much as I do, but I would say it is worth a try."}, {"userName": "Eric", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/76688-eric", "userReview": "[The military had to be testing out some sort of mechanical whale submarines in the waters off Maui (hide spoiler)]"}, {"userName": "Audrey", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/1962180-audrey", "userReview": "A ROMP. A ridiculous wild scientifically plausible romp of a book that made me laugh so hard my partner came to check on me. Repeatedly.There's some suspension of disbelief necessary, but it's the good and fun kind. And while the pace takes a little nap between pages 200-300, it picks back up again in a heartfelt Carol-Channing-dressed-like-a-sea-lion kind of way. And could you turn your back on such a sight? No you could not."}, {"userName": "Chris", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "I'm not sure if I should give this book two or three stars. The characters were a little flat, the tone could get a little preachy, and I'm left thinking the book isn't quite as clever as the author thinks it is. I did finish it however, and I didn't want to stop reading it in the sense of a did not finish book. I also enjoyed the whole conversation about memes and genes. At the very least, the book has made me want to try another Moore book at some point."}, {"userName": "Antonio Spaghetti", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/42689681-antonio-spaghetti", "userReview": "Libro divertido y delirante. Buena opción para adentrarse en el mundo de Christopher Moore, supongo. Es el primero que leo de él, pero tengo ganas de leer más sus libros."}, {"userName": "Jamie Collins", "userReviewDate": "Oct 27, 2008", "userURL": "http://www.goodreads.com/user/show/321673-jamie-collins", "userReview": "This was a fun read. Wacky fiction isn't my usual thing, but I enjoyed Moore's sense of humor and his writing style, and I'll look for more of his books."}, {"userName": "Stephanie", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/5975841-stephanie", "userReview": "[with Amy professing her love for Nate, he accepting it and her choosing to spend as much time out of Gooville with him as possible per year, was only topped by her comment about how she wouldn’t always “look like this”. The negative implications about Amy aging and *gasp* maybe becoming less youthfully beautiful, oh no could Nate accept that?! -- that frustrated me, because it implies that even Amy thinks her looks are a very important factor in keeping Nate’s interest, which for all we’ve seen, may very well be a large contributing factor, instead of her knowledge and personality and character. It undersells her role as a strong female character that she would worry so pettily about Nate still caring for her even though she would age more normally. (hide spoiler)]"}, {"userName": "Melanie Page", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/1519649-melanie-page", "userReview": "This is my 4th Moore book -- I've read Lamb, Fool, and The Serpent of Venice -- so I'm used to the snarky humor and little quips that enters via the narrator. In Fluke, I especially like when the narrator tells us something doofy a characters is thinking, and then the character says it aloud. That tickled me every time; apparently it's a humor button somewhere in my brain that loves to be pushed.Right off the bat, there are a lot of characters, and it's not always clear who they are or what they do. There's Nathan Quinn, sometimes called \"Nate\" by the narrator, sometimes \"Quinn\" (please be consistent, Moore). There's Amy. Then we meet Cliff Hyland and Captain Tarwater. Add on Kona, Clay, and Clair, and stuff gets messy in my head. You can't have that many \"C\" names in the first chapter and expect me to keep them straight. At the end of the book I felt I could name several characters who were superfluous, which made the reading harder than necessary. People also seemed more sexually focused than I've known people in real life to be. I don't think we're all quite as humpy as Moore would let his characters lead us to believe. For instance, Clair, age 40, can make Clay, age 50, do whatever she wants by reminding him she has \"the booty.\" Well, yes, Clair, but at some point Clay is going to make autonomous decisions.The science in the book isn't too complicated to understand, and Moore admits in the end note (he always has one, to my knowledge) that while he talked to a lot of whale scientists, he ignored much of what they said and kept the stuff that would easily fit. The science that is in the book is light enough to be believable, but understandable, which is right where I like it (I'm right in the middle of The Martain, so I'm definitely thinking science and how much I can fit into my brain without getting lost).The plot gets undeniably wacky starting in Part 2 of 3 when Nate is swallowed by a whale and lives to tell the story for some highly imaginative reasons. It's been so long since I've read a book that actually world builds and creates using sheer imagination that I'm still reeling from what I read. Through it all, I could picture everything that Moore described, even if a lot of those descriptions compared things to \"butt holes\" (hey, I know what one is, so I can't deny picturing what Moore wants me to see). There seems to be a sort of \"why not?\" attitude in Moore's writing that could easily have tripped him up, but worked nonetheless.The conclusion wasn't what I thought it would be. Things happened more easily than the world building had suggested it could, but I also didn't want the book to go on further. Nate spent enough time in each setting long enough, and really, how do you logically wrap up such a book?Enjoyable, sassy, and stretches the imagination if you let it."}, {"userName": "Megan", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "Fluke: Or, I Know Why the Winged Wale Sings was pretty good. Eventually. Once I got into it. Christopher Moore is hard to review. He strikes me as more of a comedian than an author. As such, if he keeps me entertained and makes me laugh out loud, I consider his book to be a success. Fluke is a typical Christopher Moore story in that it involves a group of wacky people working together in a preposterous situation. The whale and conservation info presented here was cool. And chapter eighteen wins best chapter title ever award: Chapter Eighteen, Heinous Fuckery Most Foul! =) I’m glad I went with the audio version of this book. Narrator Bill Irwin did a great job with the different voices and accents and gave the characters a lot of life. (Which sounds totally lame, but Christopher Moore’s characters all tend to be sarcastic and kind of snarky people. He writes the sort of characters which I think work fantastically in the right movie, but can fall flat in print.) Christopher Moore fans will enjoy this one. While I don’t feel that it was as well written as Bloodsucking Fiends, You Suck or The Stupidest Angel: A Heartwarming Tale of Christmas Terror it made me laugh quite a bit. That’s gotta count for something =)"}, {"userName": "Dave Hinchliffe", "userReviewDate": "May 21, 2010", "userURL": "http://www.goodreads.com/user/show/3765261-dave-hinchliffe", "userReview": "Christopher Moore writes funny books. His recent titles have been likened to the novels of Terry Pratchett but perhaps better comparisons can be drawn with Carl Hiassen and Douglas Adams. His novels have dealt with demons, Jesus’ best pal, bloodsucking fiends, death and sequined love nuns amongst other improbable subject matter. Clearly this is an author in no danger of taking himself too seriously.Fluke is all about Whales, kind of. It is also about half-whale half-human beasts, strange undersea realms and, of course, Amelia Erhardt. The story begins when Nathan Quinn, a marine biologist, photographs the tail fin of a whale whilst on a routine research trip. Later whilst looking over his pictures he notices that the words \"BITE ME\" are spelled out in huge letters on the mammal's tail-fin. His ensuing investigations turn up one mystery after another as he is launched into a wild adventure. Moore’s great skill is to turn in a tightly plotted and humorous adventure yarn around this wild subject matter. He even manages to inject a strong ecological message as well. The book is set in Hawaii where Moore used to live and the author’s personal experience with marine biology ensures the accuracy of detail in this unique and entertaining read.(this review was first published at http://www.whitesandsthailand.com)"}], "description": "Just why do humpback whales sing? That's the question that has marine behavioral biologist Nate Quinn and his crew poking, charting, recording, and photographing very big, wet, gray marine mammals. Until the extraordinary day when a whale lifts its tail into the air to display a cryptic message spelled out in foot-high letters: Bite me.Trouble is, Nate's beginning to wonder if he hasn't spent just a little too much time in the sun. 'Cause no one else on his team saw a thing -- not his longtime partner, Clay Demodocus; not their saucy young research assistant; not even the spliff-puffing white-boy Rastaman Kona (né Preston Applebaum). But later, when a roll of film returns from the lab missing the crucial tail shot -- and his research facility is trashed -- Nate realizes something very fishy indeed is going on.By turns witty, irreverent, fascinating, puzzling, and surprising, Fluke is Christopher Moore at his outrageous best.", "title": "Fluke: Or, I Know Why the Winged Whale Sings", "url": "http://www.goodreads.com/book/show/33441.Fluke", "average": 3.74, "cover": "https://images.gr-assets.com/books/1168444068l/33441.jpg", "reviews": 2019, "authors": [{"url": "https://www.goodreads.com/author/show/16218.Christopher_Moore", "name": "Christopher Moore"}], "type": ["Fiction", "Humor", "Fantasy", "Humor", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/33441.Fluke", "http://www.goodreads.com/book/show/6565936-fluke", "http://www.goodreads.com/book/show/16130589-aleta", "http://www.goodreads.com/book/show/15826965-fluke", "http://www.goodreads.com/book/show/1325339.Fluke", "http://www.goodreads.com/book/show/594375.Fluke", "http://www.goodreads.com/book/show/28881.Lamb", "http://www.goodreads.com/book/show/33456.A_Dirty_Job", "http://www.goodreads.com/book/show/33454.Bloodsucking_Fiends", "http://www.goodreads.com/book/show/3684856-fool", "http://www.goodreads.com/book/show/33453.You_Suck", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}