{"ratings": 178, "userreviews": [{"userName": "Buck", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/1450485-buck", "userReview": "Karen Armstrong is a silly person who writes books about religion. She also appears to be a kindly soul, in a tea-and-crumpets sort of way, but she’s still, I repeat, a silly person. In a recent Salon interview, she bemoaned the atheistic impertinencies of Bill Maher and Sam Harris, comparing the two men to Nazis for their criticism of Islam. ‘It fills me with despair,’ she said. ‘This is the sort of talk that led to the concentration camps.’Now, you don’t have to be a fan of either Maher or Harris to see how insane that is. Never mind that a supposedly respectable writer has so airily breached Godwin’s Law. Never mind that both men in question—a Hollywood liberal and a neuroscientist—are Jewish. And never mind that, unlike real Nazis, they’re not inciting violence or threatening anyone. The question here is simple: are we allowed to mock and criticize religious dogma, or are we not? Are we allowed to say things like ‘Islam [or Wicca or Scientology] is the mother lode of bad ideas,’ or are we not? Armstrong’s answer is a curt no. And if you do, you’re obviously a Nazi.Armstrong’s potshot represents an inconsequential skirmish in the culture wars, but it shows how imperfectly the whole Enlightenment thing has been assimilated by certain minds. If even a writer as sweetly reasonable as Armstrong claims to be can say such things, it means we’ve still got a ways to go before we beat down the old infâme. It’s still out there, snarling and slavering and pulling at its chain. It’s enough to fill you with despair, or some less melodramatic emotion.But what the hell does any of this have to do with a book about 19th-century France? Quite a bit, actually. Many of our ideological squabbles today, like the one described above, are faint and distant echoes of a much nastier brawl that roiled French society from about 1870 onwards. Reading For the Soul of France, you see some familiar conflicts being rehearsed—left versus right, secularism versus religion and so on—but with way more drama, bomb-throwing and duels. Although the political groupings were shifting and complex, Frederick Brown maps out the frontline thus: on one side, you had liberals and socialists fighting for a democratic and above all secular republic; on the other side, you had a lot of reactionary assholes. (That’s a bit simplistic, obviously. To be more precise, the reactionary assholes included Catholics, royalists, and blood-and-soil nutjobs with a collective hard-on for Joan of Arc. Plus, of course, there were the inevitable drooling anti-Semites, but they didn’t make up a group so much as trail their slime over all the other ones – including those on the left.)Summarized in this way, the book sounds like a bedtime story for liberals, with a Whiggish moral about the ultimate triumph of progressive ideas. And in fact, the narrative ends with the exoneration of Dreyfus and the official separation of church and state, lending a certain credibility to this reading. But as we know, history’s not that tidy. The crazed nationalists and Jew-haters never went away; they bided their time, churned out their pamphlets, and gradually swelled the muddy little tributaries that fed fascism, finally getting their revenge in 1940. But that’s another story – and one that Brown himself has recently told in a sequel. And in case you’re feeling all Whiggish and bien pensant yourself, you should know that the French left also went completely insane for a few decades – but that’s another story too, and I can only hope Brown is busy working on it. The blood feud that is French political history cries out for a trilogy, at the very least."}, {"userName": "Jim", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "What surprised me about Frederick Brown's For the Soul of France was its relevance to the culture wars at the beginning of the 21st century in the United States. Both fin-de-siècle France and post-9/11 America shared a static view of their respective nations. In France's case, it was Judaism that was seen as the interloper, as symbolized in the Dreyfus affair. In the United States, large segments of the population look back to an Anglo-Saxon golden age in which Evangelical religion and conservative politics presumably held sway.Brown quotes one typical instance of Antisemitism:When in the spring of 1898, Joseph Valabrègue, a Provençal Jew tarred by the brush used against his brother-in-law Alfred Dreyfus, indignantly sent professions of patriotism to La Croix, the paper's official mouthpiece replied: \"I am French, the son of a Frenchman; I shall live and die as such. But you, you are a Jew, the son of a Jew and you will die a Jew.... You know full well that all through history -- from Judas, who sold his God, to Dreyfus, who sold France -- your race has bred so much treason, iniquity, and rapacity that you must at all costs hide your name, as the escaped convict hides his red bonnet.\" In this ontological court, rules of evidence did not apply. Charles Maurras praised Roman Catholicism as a \"temple of definitions\" offering people blessed asylum from that bane of human consciousness -- \"uncertainty.\"[Italics mine]One could imagine the same type of illogic being applied in political arguments at Tea Party gatherings. This is an excellent book about a period of European history that is largely unknown to most Americans. We may have heard of the Dreyfus affair, the Eiffel Tower, and the failed French attempt to build the Panama Canal; but we don't have a real grasp about the decades-long war between Catholicism and liberalism, symbolized by scientists and Jews. Today, as the French are facing a much more substantive invasion of Muslims from Algeria and other parts of North Africa, much of the conflicts of that period have become moot."}, {"userName": "MJ Huot", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/13055688-mj-huot", "userReview": "Summer 2015 Re-read: Just as good the second time around. Managed to pick up on small yet important details I hadn't noticed before. Was a quick and fun read that makes me even more eager to start university in the fall. Read this a while back for a history essay. Just picked up a paper-back copy. There are so many notes written in the margins of my old, hardcover copy that I can barely read it. This book was the catalyst for my obsession with the Dreyfus Affair. Rereading it because I can never get enough of French history."}, {"userName": "John David", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/4357283-john-david", "userReview": "If you thought that the Dreyfus Affair was the fons et origo of anti-Semitism in France, or that the Kulturkampf was just a phenomenon relegated to Bismarck’s imperial Germany, this book may just very well be the place to begin a solid education in late nineteenth-century French cultural history. Brown assumes a minimal knowledge of the politics of the time (First Empire, Second Republic, Third Empire, et cetera), but provides a useful chronology at the beginning of the book and adds just enough political background to keep the narrative both clear and engaging. The use of the words “culture war” in the subtitle is by no means a cynical ploy to attract readers, either. The words and the politics to which they give so theatrical a birth were just as relevant then as they ever have been.The tug-of-war between Catholicism and the allied forces of modernity, science, and secularism sandwiched between the times of Louis-Philippe and Napoleon III dominate the book. Any vignette to begin with would have admittedly been arbitrarily chosen, but Brown’s choice of the 1863 publication of Ernst Renan’s “La Vie de Jesus” (“The Life of Jesus”) serves as a terrific and illustrative point of departure for a book whose major themes include Renan’s strident anti-clericalism. Brown also includes a couple of stories that are unfortunately little-known in the United States, but that give hints of the growing violence and division that is to come. He tells of the Union Generale, an investment syndicate launched by aristocratic, pro-Catholic associates that went on to build railroads all over Europe. Due to rampant speculation and financial impropriety on the part of the man who ran the operation, it suffered a tremendous failure – also known as the Paris Bourse crash – in January, 1882. Perhaps not surprisingly considering the events to come, the first people to be blamed were the Jews. We get detailed chapters of the building of the Panama Canal and the 1897 fire at the Charity Bazaar as well, but the heart of the book is a 55-page long chapter on perhaps the one event – or rather a long, complex series of events – that is familiar to all Americans: the Dreyfus Affair. Woven together, these bits of history provide one of a few tapestries that really are essential for understanding the French history of this period. For someone unfamiliar with the major names and events, I recommend Robert Gildea’s “Children of the Revolution: The French, 1799-1914,” which provides much of the political background that Brown can’t cover in a brief 265 pages. Brown has a tremendous grasp of the source material. I highly recommend this to readers looking for a great bridge between popular and more formal academic history regarding this period. Reading this makes me want to pick up the Brown’s Flaubert biography that I have on my shelves – or anything else that I can find by him."}, {"userName": "Lauren Albert", "userReviewDate": "Apr 04, 2010", "userURL": "http://www.goodreads.com/user/show/2828794-lauren-albert", "userReview": "Anti-clericalism vs. clericalism? Separation of church and state? Monarchism or republicanism? Modernity or tradition? Anti-semitism or tolerant cosmopolitanism? These were the culture wars in the age of Dreyfus. While it was all fascinating to me, what I liked best were Brown's discussions of the controversies over the construction of the Eiffel Tower and the Dreyfus affair. I wasn't aware of the former and I was only superficially knowledgable about the latter. The fury and irrationality that was exposed during the Dreyfus Affair are frightening to read about."}, {"userName": "Kelly", "userReviewDate": "Feb 07, 2010", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "NY Times Book Review: http://www.nytimes.com/2010/02/07/boo..."}, {"userName": "Ron", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/5660459-ron", "userReview": "This book makes the two drastic points of view in France dramatic. The fanatics on the left & the crazies on the right are portrayed with deft touches. The Eiffel Tower,a structure celebrating the centennial of the revolution & Sacre-Coeur, symbolizing penance for the revolution & regrets for the defeat in 1870, are the landmarks behind the Frederick Brown's narrative.The book has much more."}, {"userName": "Jessie", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/617781-jessie", "userReview": "The writing is so good I forget it's non-fiction."}, {"userName": "Joseph Morris", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/14272731-joseph-morris", "userReview": "Sometimes it feels like it is hard to write engaging history books for any era that predates the 20th century. There is less cultural context for the modern reader: so much has changed that it makes it hard to imagine events, nevermind relate to them. Plus more details have been erased by the sands of time, so often the level of generality goes up. Brown does a good job getting around this. He uses a lot of newspapers and personal letters to give the reader primary sources to relate to: what people were actually writing and reading at the time. He often uses the universal expositions, which happened approximately every decade, to anchor things in time.Based on the presence of \"Dreyfus\" in the title, I was expecting this to be more directly about anti-Semitism. The primary theme of the book is Catholic-Royalist versus Republican-Enlightenment, and anti-semitism only appears to the extent it is part of that broader conflict. For the first two-third of the book I was like \"When does Dreyfus show up? When does Dreyfus show up?\" but it was all engrossing enough that I didn't mind too much. If I were the editor, I would have subtitled this something like \"Eiffel, Dreyfus, Boulangism, and the fin-de-siecle culture wars in France\" or something that indicates its broader scope. I think if my expectations were set properly at the start, I would have enjoyed the book even more.As someone raised Irish Catholic in the United States, I grew up hearing about the Catholic Church as the representative of the little guy, especially the poor. So it was a surprise for me to read here about how, in nineteenth century France, Catholicism was strongly aligned with the aristocracy, in particular that a \"natural order\" would have a king in charge, as opposed to the atheistic Republicans. The overthrow of the king in the Revolution was like a national sin that had to be expunged, probably though a strong leader who would end the Republic and restore \"natural\" hierarchy. This was a pervasive theme: conflicts between Catholic preachers and secular teachers; the place of militant national leaders like Georges Boulanger that had echoes of royalism.The Dreyfus affair, which I only vaguely had a sense of before, was pretty consistent with my understanding of anti-Semitism in Europe: the Jews were often financiers who worked in cooperation with the aristocracy on various large-scale projects (wars, railroads). If and when those projects failed, more often due to the incompetence of the aristocrats running them, the Jews were typically thrown under the bus to avoid a financial crisis and/or repayment. Paul Johnson's A History of the Jews is also a riveting read and goes into that dynamic in more detail. Brown's chapter on the Union Generale debacle shows this more directly than the one on Dreyfus; it sort of seems like the wave of anti-Jewish resentment starts at the aristocratic level with the Union Generale and radiates outward so that the Jews become an all-out scapegoat for France's own national failings, above all the devastating loss of Alsace 1871 after the Franco-German War.In 2017, this book was resonant in terms of describing a battle for enlightenment ideals. Twenty-first century America is of course quite different from nineteenth century France, but certainly the battle lines often look similar: national ethnic identity versus ideals of human equality. When I walk through my neighborhood now and see \"No matter where you are from, we're glad you're our neighbor\" signs, I now think of Emile Zola. Trump feels a little bit like Boulanger, albeit minus all the military panache. It feels relevant, if only to normalize or universalize what the United States is going through now.Final nitpick: Mr. Brown could dial it back a little with the twenty dollar words (\"“Do not be tempted by a twenty-dollar word when there is a ten-center handy, ready and able.” --Strunck and White). It's a humanities book, so you get some leeway; but I think I have a pretty advanced vocabulary and I was looking up a word almost every other page, many of which were archaic, and there were some oddball phrases that seemed maybe British. A reason to read Kindle, so you can look them up easily."}, {"userName": "Liam", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/4282067-liam", "userReview": "\"Although nativist gospel and a religion proclaiming its universality did not always occupy common ground, the politics of bereavement embraced by the Church and the reverence for ancestral Frenchness ... oriented believes of one kind and the other to the past. The past was, above all, a refuge from the dangerous mobility of people and things.\" (xxv)\"'My dear Sir, the heart of this garden, the center of al these monster rings, which made you feel as if you had got into Saturn, was a little money-changing office. I like this cynicism.'\" (quoting Punch of the 1867 exposition, 136)"}, {"userName": "Mary Ronan Drew", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/2986995-mary-ronan-drew", "userReview": "The Dreyfus Affair. I have always thought I knew what it was about. Someone was stealing secrets from the French military and handing them over to the Germans. A note incriminating its author was found in a wastebasket by a cleaning woman and the French military got busy finding someone to blame it on.Not finding the traitor. Finding a man who could be presented to the public as a traitor. Who better to fill that role in 1890s France than a Jew. And so, with no evidence against him the French military convinced a court martial of the guilt of Alfred Dreyfus with faked evidence, with phony handwriting testimony (the one person who said the writing on the note was not Drefus' was not allowed to testify), and a secret forged document that was not revealed to the defense until years later.What really convicted Dreyfus was public opinion on which the military relied heavily. I did not realize how electric the atmosphere was at the end of the 19th century in France. After the loss to the Germans in the Franco-Prussian War and the civil war that erupted popular opinion divided into the few who thought France's military was simply not as good as Germany's and the many who thought the loss was punishment from God for . . . I don't remember what. It doesn't matter.The Roman Catholic church was in decline and struggling to re-attach its wandering former members who had been exposed to Ernest Renan's Life of Jesus and the German scholars who had been writing for decades that Jesus did not exist, that the Bible had no claim to authenticity, that Darwin had proven the Christian religion was based on lies. Mixed in with these disturbing discussions was a virulent resurgence of anti-Semitism in France. I read somewhere recently that if one were asked in 1900 to predict which country would take anti-Semitism to the extreme in the next 50 years Germany would be no one's guess. It would be France that was seen heading for trouble.I always thought that a few French army officers were protecting the guilty man when they rigged the Drefus decision. It turns out the guilty man was rather well known: Walsin Esterhazy. He eventually confessed, though that seems not to have convinced the partisans on the right of his guilt. The French military was so deeply corrupt there were almost no honest officers to protest Dreyfus' railroading.One man, Georges Picquart - remember his name - was put in charge of intelligence and realized Dreyfus' innocence. He went through channels trying to convince the military and the government that Dreyfus deserved a new trial. Not only did those above him not act on his evidence, he was shipped to a particularly dangerous assignment in Tunis in hopes he would be killed and when that didn't happen, he too was put on trial on false charges with faked evidence.Dreyfus' brother and a handful of others who were sure of his innocence worked for years to bring the truth to light. Eventually, like the military, they realized this was going to have to be tried in the court of public opinion. Zola wrote his famous J'Accuse and was found guilty of libel in another corrupt court and fled to England. Slowly, and it must have been slow indeed for the innocent man on Devil's Island and his family waiting for justice, the weight of evidence became sufficient to convince many open-minded people of Dreyfus' innocence. But still nothing was done because the military and government were so corrupt and they had the weight of such intense anti-Semitism on their side that they were able to prevent the re-opening of the case.Finally, in July of 1898 Godefroy Caviagnac was made minister of war and he realized the depth of the deception and the innocence of Dreyfus. So when the government demanded he state that there was no question of the man's guilt he resigned. So did the man who was named to replace him. And the man who was named to replace him. And slowly justice made her way, a new trial that found Dreyfus guilty, again with forged evidence, was overturned and he was freed.Frederick Brown's book presents the issues that polarized the French public in the late 19th century - the fall of a Catholic bank, the abandonment of de Lesseps' Panama Canal, the social disruption of the Communards after the Franco-Prussian War. Even the building of the Eiffel Tower was highly contentious. Eiffel was routinely described as an outsider, as German Jew (he was third generation French and not a Jew.) Brown shows how the strong feelings, not to say hysteria, of a polarized society led to the tragedy of the Dreyfus Affair and the subsequent weakening of the French Army, leading eventually to the French Army's capitulation to Hitler and the Vichy government."}, {"userName": "Jeff", "userReviewDate": "Jul 26, 2014", "userURL": "http://www.goodreads.com/user/show/7099404-jeff", "userReview": "Every country has its internal clashes, and For the Soul of France by Frederick Brown illuminates the cultural divisions of the French Third Republic, 1870 - 1940. This erudite and fascinating work explores the internal struggles of Fin-de-Siecle France between the French military and Catholic Church on one side and Scientific community and Republican idealists on the other, culminating with the notorious Dreyfus affair. Religious and secular divisions, of course, are not unique to France, as western countries including the United States have been at swords-points between religious fervor and scientific rationalism. Yet, Brown hints--without directly stating--that this struggle may shed light on the brutal and genocidal anti-Semitism that typified the Nazi-sympathizing Vichy regime in German-Occupied France of the 1940's.The story opens with the Franco-Prussian War of 1870-71, which left parts of Paris in ruins and its population in starvation, and resulted in the explosive Commune, the short-lived revolutionary government controlled by working men, which deeply divided the working-class from those of clerical and aristocratic orders. With the Commune left in tatters and its members either shot or imprisoned, the stage is set for more fiery class and cultural divisions yet to come. The work also tells about such gargantuan figures as Gustave Eiffel, whose tower today is an undisputed icon of France--indeed its most recognizable monument--and the pains he endured to construct what was at the time the tallest manmade structure. However, according to Brown, French traditionalists largely rejected Eiffel's Tower as a metallic grotesquerie and a symbol of \"foreign\" intruders imposing cosmopolitan and secular values upon the Catholic country of Jeanne d'Arc, and that the edifice more befitted American sensibilities than Gallic ones. The author also delves into the scandal of the Panama canal; long before Teddy Roosevelt made it one of his signature achievements as President, the canal bridging the Atlantic with the Pacific was originally a French-financed project. But there is a reason why we know more about the Panama canal as a 20th century American enterprise than a 19th century French one, as Brown highlights the skeletons tumbling out of the closet in the French version of the canal project. But it is the Affair of Captain Dreyfus that reveals the depths of the fault-lines between religious and secular, and militaristic and scientific factions of French society. While not necessarily uncovering new developments of the ignominious \"affair\", Brown retells in exacting detail the astonishingly prejudicial efforts of pro-military and anti-Semitic elements to convict an officer of Jewish heritage on the slimmest proof of spying for Germany, on the grounds that Dreyfus, and his Jewish brethren, posed a genuine threat to French sovereignty and its Christian heritage. Those readers, particularly of the English speaking world, will most benefit from understanding the issues at stake in the Dreyfus debacle, leading to the famous newspaper opinion by Emile Zola called \"J'accuse.\" It is up to the reader to decide, after examining all the evidence brought to light in Brown's highly engaging and well-researched work, whether Zola's accusation was justified."}, {"userName": "Linda", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/4626387-linda", "userReview": "To me, the worst episode in French history is the Dreyfus Affair. Alfred Dreyfus, Jewish only by birth, Captain in the French Army, was accused of being a traitor and, after a court martial based entirely on false and fabricated \"evidence,\" was sentenced to 4 years on Devil's Island off the coast of French Guiana. Eventually, enough noise was made (and the real culprit discovered) that Dreyfus was given a second court martial. The verdict, in spite of the new evidence AND the uncovering of the true culprit, was the same. The French President was finally persuaded to pardon him. Dreyfus, amazingly, returned to duty and eventually retired from the military.During the 19th century France vacillated among being a republic, a monarchy or an empire. Eventually she came to an uneasy rest on republic. Of course, those who favored monarchy or empire were disappointed and united to become the \"anti-republicans.\" Who cares what side they were originally on? They were united in NOT wanting a republic. This group touted conspiracy theories, scandals, you name it, to try to discredit the government. And Germany had nothing over France (until the 20th century) in its anti-semitism. Virtually anything that didn't turn out the way the antirepublicans wanted it to was the result of a Jewish conspiracy. The Panama Canal scandal was caused by Jews. Eiffel's horrible tower paid for by a Jewish cabal. Jews were responsible for the career end of General Boulanger, who should have been President and would have moved France back to where it should be. Jews also set fire (or rather, had bribed the people) to the Charity Bazaar, killing many upper class citizens, particularly women. You couldn't turn around without running into some sort of Jewish devilment, according to the antirepublicans.It all seemed to culminate in the Dreyfus Affair. The Army was corrupt and had been for most of the century; the Church was mightily resisting its separation from the State; antirepublicans saw Jewish conspiracies everywhere.This is a wonderful book describing how the culture of France during the 19th century \"caused\" the Dreyfus Affair, the embarrassment of the Army (and its eventual restructuring) and the final separation of the Catholic Church from the government of France. The author gives the history little by little, working up through the century, introducing people and events I had no idea about and somehow stuns you when the Dreyfus Affair occurs even though you know it's coming.Anyone interested in Zola (who wrote a famous newspaper article J'accuse which finally rattled the lid off the Affair), Alfred Dreyfus, or 19th century French history will be sure to enjoy this one."}, {"userName": "Louise Leetch", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/2647549-louise-leetch", "userReview": "They say you should write about what you know and Frederick Brown certainly knows the French. The events he chronicles at the end of the 19th century lead us through the quest to discern what exactly constitutes the essence of France. Here is the saga of France’s sojourn from Monarchy to Republic. The French revolution may have begun in 1789 but it was fought well into the twentieth century. The author picks up the tale at the Franco Prussian War in 1870. He gives us the events that shaped France into the country we now see; but what a convoluted tortured trip it has been. It’s a miracle the Third Republic survived with attacks from left and right, economic disasters, and revolving door Premiers. As France struggled thru failed governments and the demi-gods who threatened, she constantly searched for a scapegoat. The Catholic Church and the Germans took their fair share of hits but the old standby, Jewry, bears the brunt of the attack. It’s astonishing to see the anti-Semitic (a term newly coined in this period) vitriol—worse still to see the popularity—of partisan newspapers such as La Libre Parole. There will always be those who refuse to give up the past, praying for the return of a monarch, an emperor, insisting on France for the French. Luckily there were also those who challenged the old ways and the old religion and fought for free, secular education. Thiers, Clemenceau & Zola fought to build the Republic. The conservatives and royalists reawakened the symbol of Joan of Arc. Eiffel’s tower sits in juxtaposition to Sacre Coeur. On one side the growth of technology and scientific thought. On the hill in Montmartre France’s penance for the sins heaped upon her by the church.Read this book because you’ll see the frightening similarities to the first ten years of the 21st century. There are all the lies, finger-pointing, invented evidence we’ve seen since 2000. There’s a lion’s share of yellow journalism. Fear is the weapon of choice. Sadly, it’s all accepted by those who were taught to think, but didn’t. While this is not a beach book--you’ll trip over fifty-dollar words--it’s certainly the quickest, most readable history I’ve see in years. Mr. Brown gives us all the puzzle pieces we need but he’s not giving anything away. Be prepared to think, to reason and come to your own determination because this book is not about the Soul of France, it’s merely setting you off on the search for it."}, {"userName": "Ruby Bibi", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/19230232-ruby-bibi", "userReview": "-Though confusing in the beginning because of the constant political gyrations that occurred in France in the second half of the 19th century, the explanations and the events that led up to a hatred of Jews is brought out. Anytime there is economic hardship, there is finger pointing as to the cause, and, invariably, the fingers are aimed at Jews.-As we read of the political sides where one wants the return of a monarchy and the other looks to the establishment of a republic; we also find that there was a schism caused by some who believed in the separation of Church and state (secularism) and the sanctity of the Church's influence. It seemed the country was on the verge of a civil war, and the only thing that calmed the atmosphere for a short while was a temporary truce brought on by the Paris World's Fair of 1889, where Gustave Eiffel presented his tower, but even that split the populace as some considered it an eyesore while others loved it's appearance.-The build up to the Dreyfus Affair was very enlightening. There was the collapse of the Union General, which was a fund specializing in Christian ventures and which rose quickly only to end in financial collapse. This was followed by the Panama Canal scandal, and focused on several Jews who helped to arrange for financing, but in doing so, came out with huge sums of money. After an inquiry, it was discovered that bribes were given out by them to get the financing done, and one, Dr. Herz, was discovered to be a con artist.-The Dreyfus Affair was a way to funnel the hatred of the people against the Jews. Evidence was forged, and perjury was done on a massive scale. Emile Zola, a famous writer who understood the injustice, put the full weight of his reputation to defend the Jews, and he himself was then put on trial and found guilty. The fighters for justice never gave up, despite the fact that even when the forgeries were discovered, many people in authority felt they were justified in order to put Dreyfus away.-Very interesting for the most part, but the writer, for my taste, could have done away with much of the beginning and the end, as I couldn't understand exactly what was happening in those sections. It's still, though, an important piece of history that the writer has uncovered and revealed to us in great detail."}, {"userName": "Kitty", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/427580-kitty", "userReview": "Human nature does not improve with this carefully documented look at \"culture wars in the age of Dreyfus\" , the subtitle of the book. Why are we so eager for a scapegoat -- an explanation of woes-- and when, ever, is only one force, one person, one instance the culprit? Brown traces the role of the Church, the separation from state, the rise of Napoleon and mythology of the glory of war, alongside the rise of scientific rationalism and positivism, the blame of the partisan press on Jews for the failure of the Panama Canal, and the crash of the Union Générale. The Dreyfus affair appears after the pillars of the beginning chapters outline the 1870 Franco-Prussian war, France's need to \"speechify\" and prove itself champion of \"liberty, the impresario of science and technology, the genial host clasping nations in a spirit of exuberant cosmopolitanism\". At odds with Universal expositions that supported this view, including critiques of the iconic Eiffel Tour, was the idea of a \"guarded, self-referential nation schooled in the imperative of war\" contained in Catholicism and nationalism. The penultimate chapter describing the catastrophe of the fire that burned the Charity Bazaar, reveals an increasing sense of the power of words to create and drive an agenda that has little to do with truth. Lively prose and copious notes and a few well-chosen illustrations support a complex history of 19th century France. The 60 pages about the Dreyfus affair include Zola's \"J'accuse\" give a thorough account of the unfairness of the anti-semitic set-up. The final chapter quotes Sainte-Beuve, as quoted by George Eliot in \"Impressions of Theophrastus Such\". \"Nothing collapse more quickly than civilization during crises like this one (1848); lost in three weeks is the accomplishment of centuries. Civilization, life itself, is something learned and invented. ... After several years of peace men forget it all too easily. They come to believe that culture is innate, that is is identical with nature But savagery is always lurking two steps away, and it regains a foothold as soon as one stumbles.\"How history repeats itself --"}, {"userName": "James", "userReviewDate": "Apr 14, 2010", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "This is a history of ideas and of culture in France between the end of the Franco-Prussian War in 1871 and the end of the nineteenth century. It encompasses events ranging from the influence of the Catholic church on politics to the building of the Eiffel Tower and the unsuccessful attempt of De Lesseps to build the Panama Canal. One theme is scandals and there is a Banking scandal that rivals any in history.There is a chronology provided that lists the principal figures and events from the Paris revolts of 1848 until the death of Dreyfus in 1908. The Paris Commune in the Spring of 1871 is discussed, but there was also the longer-range political threat to the Republic came from the right leading to the tragicomic tale of the populist hero “on horse,” Gen. Georges Boulanger, whose monarchist supporters urged him to lead a coup d’état. Instead, he fled to Belgium and in 1891 committed suicide at the tomb of his mistress.The events depicted also include the crash of the Union Generale and a chapter on the famous tower and its engineer, Gustave Eiffel. (Eiffel’s mother, he tells us, had to get him his first job, “seeing in the person of her son an inert object that wouldn’t move unless pushed.”) Brown makes clear just how high the political and cultural stakes were in the construction of this “ogre of modernity”; its architectural (and ideological) rival was the wedding-cake basilica rising on the other side of the Seine, the Sacré-Coeur. But the culmination of the book and the moment that defines France more than any other as it moves forward into the next century is the Dreyfus Affair. With a chapter devoted to each of the events chronicled Frederick Brown's cultural history of France in the second half of the nineteenth century is an excellent introduction to the forces that shaped France in this period. I highly recommend this book to anyone interested in French cultural history."}, {"userName": "Don", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/164842-don", "userReview": "The subtitle of the book is \"Culture Wars in the Age of Dreyfus\" and the book describes some of the virulent anti-semitism in France revealed by a couple of financial scandals and the Dreyfus affair. It also discusses anti-Republicanism and the attitude of the Catholic Church in the late 19th Century in France.What Brown does not do, however, is place any of this in a larger context. How prevalent was anti-semitism and anti-Republicanism? In the Dreyfus chapter, which is the centerpiece of the book, he initially creates the impression that anti-semitism was nearly universal in France. But then,the republican faction appears to prevail politically, leading to a new court martial for Dreyfus and an ultimate pardon. There is no discussion of any research regarding the extent of any of these trends. Moreover, other than anti-semitism, republicanism vs. anti-republicanism and religion vs. secularism, there is no discussion of \"culture\" in the sense of the arts, etc."}, {"userName": "John", "userReviewDate": "Aug 26, 2011", "userURL": "http://www.goodreads.com/user/show/958672-john", "userReview": "I'm tempted to rate this one 5 stars, but it wasn't quite amazing due to the many references to other history and culture of the time that I didn't get. Also, with long sections about uninteresting people (i.e. politicians) and the stupid things they did, it was a bit of a hard slog at times. In the end though, this book is exactly about the stupid things that people did, so it does a great job at explaining that. There are still parallels today as the culture wars continue in the US - progressive socialists vs conservative Christians. Sometimes it seems nothing has changed. In summary, this is a great history of the second half of the 19th century in France, and I look forward to finding out how it fits in with earlier and later periods."}, {"userName": "Kb", "userReviewDate": "Feb 24, 2010", "userURL": "http://www.goodreads.com/user/show/1273396-kb", "userReview": "Stylistically, Brown is no David McCullough, but for this history consumer, the density was but a speed bump in what was ultimately an enjoyable read. France often gets overlooked as a player in the geopolitics of the late 19th and early 20th centuries, which I now realize is because they couldn't get their house together in the wake of the Franco-Prussian war. This book chronicles the culture wars that followed that defeat, which was between the conservative, Catholic, royalist right and the progressive, secular, republican left. Brown focuses specifically on this time and this place, but today's reader can't help but draw parallels between the history at hand and current events."}, {"userName": "Sheli Ellsworth", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/15990262-sheli-ellsworth", "userReview": "The genius of Fredrick Brown’s For the Soul of France may be lost on the average reader. While the religious, political and social upheaval following the Franco-Prussian War of 1870-71 was turbulent, Brown’s account of it is reflected in his equally turbulent prose.\tWhether you applaud Brown’s account of the rise of secularism in Catholic France or deplore his literary formulation may depend on your experience with contemporary erudite composition. For some the emperor has no clothes—for others he is uniquely avant-garde."}, {"userName": "Gayle", "userReviewDate": "Jun 21, 2012", "userURL": "http://www.goodreads.com/user/show/10366123-gayle", "userReview": "Interesting and detailed account of the intellectual, religious, and social strife that tore about French society after the Franco-Prussian society. Particularly appalling to read is the extent and breadth of French anti-semitism. Organizations existed whose very names proudly included the term \"Anti-Semite\". After reading this account, one understands that the roots of the French inability to effectively deal with Hitler were deep-seated and had been forming over a period of 60 years."}, {"userName": "Elizabeth", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/3683489-elizabeth", "userReview": "Highly readable description of deliberate manipulation of public opinion to create and sustain ideological polarization and eliminate cultural images of liberal religiosity. Explains why the religious right in this country (USA) works so hard to discount other definitions of faith. Shows also how a Roman Catholic hierarchy in social decline works cynically to avail itself of bigotry in lieu of genuine conversion. Cannot be too highly recommended for today's middle-of-the-road and liberal religious."}, {"userName": "Robert", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/7754389-robert", "userReview": "Overall this describes the general trend towards secularism during the 3rd republic quite well. The differing philosophies during the start of the 3rd republic still have resonations in present-day France. One criticism is that the Dreyfus Affair should have been divided into 2 (or even 3) chapters. A summary/conclusion at the end would have been helpful as well. Was very much worth the time spent reading."}, {"userName": "Ed", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/2881115-ed", "userReview": "Brown is a good story teller and he relates a number of them in this book, including that of Dreyfus and Boulanger. His general theme seems to be that french reactionaries struggling with the advent of modernity found scapegoats in Jews. Unfortunately he gets so caught up in telling yarns that he doesn't argue very clearly for his point. This is good popular history, but its lack of rigor makes me appreciate some of the academic historians that i sometimes find tedious."}, {"userName": "Mshelton50", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/22120912-mshelton50", "userReview": "A superb book. Well-researched and written in a lively style, this is a \"must read\" for anyone interested in the history of modern France, particularly in the history of the Third Republic. Focused especially on the clash between Catholic, monarchist forces on the one hand, and secular, republican adherents on the other, Brown illustrates the \"culture wars\" of the period, over Sacre Coeur, the Eiffel Tower, the Dreyfus Case, and others. Thoroughly enjoyed reading this small volume."}, {"userName": "Rob MacCavett", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/7924958-rob-maccavett", "userReview": "Having worked for two French companies, I maintain a special curiosity about this country and its sophisticated yet aloof people. In this case, a cultural look at the late nineteenth century when decades of political turmoil and the defeat at the hands of Germany in 1870 get somehow balled-up in the infamous Dreyfus Affair. As Karl Marx once said, “There is much to be learned from the French.”"}, {"userName": "AskHistorians", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/46890061-askhistorians", "userReview": "How the Catholic Church and the Third Republic fought it out (surprisingly literally) in the decades after the Franco-Prussian War, culminating in the Dreyfus Affair. The Third Republic gov't tried to make the Catholic Church irrelevant. The Catholic Church said no. A standoff!"}, {"userName": "Yves Fey", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/5458770-yves-fey", "userReview": "Excellent, fascinating, and detailed account of the ongoing war between the Right and Left in turn-of-the-century France. The Dreyfus Affair is the centerpiece, but it is surrounded by other events. Rather scarily apt for today's political conflicts."}, {"userName": "Melanie Reed", "userReviewDate": "Jan 30, 2010", "userURL": "http://www.goodreads.com/user/show/2988845-melanie-reed", "userReview": "wonderful book! I have been wondering for years what is this 'Dreyfus Affair' that I see references to in lots of places - turns out to be rather a long story because undestanding it requires some understanding of what was happening in France for several decades previous."}], "description": "Frederick Brown, cultural historian, author of acclaimed biographies of Émile Zola (“Magnificent”—The New Yorker) and Flaubert (“Splendid . . . Intellectually nuanced, exquisitely written”—The New Republic) now gives us an ambitious, far-reaching book—a perfect joining of subject and writer: a portrait of fin-de-siècle France. He writes about the forces that led up to the twilight years of the nineteenth century when France, defeated by Prussia in the Franco-Prussian War of 1870–71, was forced to cede the border states of Alsace and Lorraine, and of the resulting civil war, waged without restraint, that toppled Napoléon III, crushed the Paris Commune, and provoked a dangerous nationalism that gripped the Republic. The author describes how postwar France, a nation splintered in the face of humiliation by the foreigner—Prussia—dissolved into two cultural factions: moderates, proponents of a secular state (“Clericalism, there is the enemy!”), and reactionaries, who saw their ideal nation—militant, Catholic, royalist—embodied by Joan of Arc, with their message, that France had suffered its defeat in 1871 for having betrayed its true faith. A bitter debate took hold of the heart and soul of the country, framed by the vision of “science” and “technological advancement” versus “supernatural intervention.” Brown shows us how Paris’s most iconic monuments that rose up during those years bear witness to the passionate decades-long quarrel. At one end of Paris was Gustave Eiffel’s tower, built in iron and more than a thousand feet tall, the beacon of a forward-looking nation; at Paris’ other end, at the highest point in the city, the basilica of the Sacré-Coeur, atonement for the country’s sins and moral laxity whose punishment was France’s defeat in the war . . . Brown makes clear that the Dreyfus Affair—the cannonade of the 1890s—can only be understood in light of these converging forces. “The Affair” shaped the character of public debate and informed private life. At stake was the fate of a Republic born during the Franco-Prussian War and reared against bitter opposition. The losses that abounded during this time—the financial loss suffered by thousands in the crash of the Union Génerale, a bank founded in 1875 to promote Catholic interests with Catholic capital outside the Rothschilds’ sphere of influence, along with the failure of the Panama Canal Company—spurred the partisan press, which blamed both disasters on Jewry.The author writes how the roiling conflicts that began thirty years before Dreyfus did not end with his exoneration in 1900. Instead they became the festering point that led to France’s surrender to Hitler’s armies in 1940, when the Third Republic fell and the Vichy government replaced it, with Marshal Pétain heralded as the latest incarnation of Joan of Arc, France’s savior . . .From the Hardcover edition.", "title": "For the Soul of France: Culture Wars in the Age of Dreyfus", "url": "https://www.goodreads.com/book/show/7058535-for-the-soul-of-france", "average": 3.88, "cover": "https://images.gr-assets.com/books/1320478589l/7058535.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/1459.Frederick_Brown", "name": "Frederick Brown"}], "type": ["History", "Cultural", "Nonfiction", "Politics", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/7058535-for-the-soul-of-france", "http://www.goodreads.com/book/show/18166873-the-embrace-of-unreason", "http://www.goodreads.com/book/show/2174.Flaubert", "http://www.goodreads.com/book/show/833235.Zola", "http://www.goodreads.com/book/show/4630341-an-impersonation-of-angels", "http://www.goodreads.com/book/show/15781416-an-anonymous-source"]}