{"ratings": 924, "userreviews": [{"userName": "Mary", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "Robb McDaniel was living the very definition of an idyllic life: the type of privileged and charmed existence of which so many were truly envious. He was an idealistic young teacher, full of vibrant hopes and dreams and determined to shape the young minds of the future in the best way possible. He was blissfully happy to be engaged to his high school sweetheart, and together, this charmed couple were planning for the future. Yes, Robb McDaniel was truly blessed and thankful for everything he had in life: until he wanted something more.Upon receiving a sudden windfall, money that is tragically earned, Robb is offered the chance to live a different sort of life. He is offered the opportunity of going to law school and of pursuing a brilliant career. Yet nothing in Robb McDaniel's life could possibly have prepared him for the price of a dream come true.A job with a prestigious law firm. Marriage to the boss' daughter. A wonderful family. A splendid home. In fact, Robb had everything that he could possibly want, and more besides. All the offers and prominence he just couldn't refuse. Truly, Robb McDaniel was living a life of great success, greater hunger, greatest shame...In her latest novel, best-selling author Belva Plain creates a riveting and compelling portrait of a man who had everything - and of the women who loved him. With a profound insight, she explores the power of temptation, betrayal, and greed - and the ultimately redeeming gift of love. This is a story of great complexity and heart-aching poignancy.I thoroughly enjoyed reading this book. In my opinion, Belva Plain was a terrific author, and she really did a tremendous job of capturing the various nuances and complexities of her characters' relationships and weaving them all into an emotional and intriguing story. I've always enjoyed reading books about families and their sometimes troubled and dysfunctional relationships. I would give this book a definite A+!"}, {"userName": "Arwen56", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/9615245-arwen56", "userReview": "Beh, il protagonista avrà anche avuto un colpo di fortuna, ma il problema è che, nel 2003, io ho invece avuto il colpo di sfiga di acquistare il romanzo. :-("}, {"userName": "Lynn", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/6652595-lynn", "userReview": "I haven't read Belva Plain for quite a while and was pleased to discover this book at the library. As I read I could easily see the problems the various characters were bringing upon themselves. \"Oh what tangled webs we weave....\" Money, greed, temptation and shame all play big parts in the lives of these people. I enjoyed the book & it was a fast read, even for me."}, {"userName": "Virginia Albanese", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/4336338-virginia-albanese", "userReview": "Wanted a mindless book to read while on vacation and this fit the bill. I must say her writing left me with NO sympathy for main character."}, {"userName": "Nancy", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/8368008-nancy", "userReview": "I thought this was an excellent book showing how greed can ruin a person. This was about a good man who lets money rule his love life and his home life. Sad but true about many people. Very believable characters and story line. Good and well written!!"}, {"userName": "Katy Henning", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/40484267-katy-henning", "userReview": "great start of the book then weak middle that lasted too long and the shortest ending ever... the ending felt awkward and rushed like the author was running out of time...."}, {"userName": "Kathleen", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/63784017-kathleen", "userReview": "Fortunes head was a wonderful book. Belva kept you there until the end. If you are just about done and think you have it all figured out you are in for the rude awakening!"}, {"userName": "Christine", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/8368356-christine", "userReview": "Again Belva Plain weaves a story, which I couldn't put down ."}, {"userName": "ChrisGA", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/9280036-chrisga", "userReview": "The book starts with the tender love story of dirt poor Robb and his loyal sweetheart Lily. They contentedly plan to live forever, together in their small town- he as a teacher and she as a librarian-until he receives an insurance settlement from his parents’ deaths. Suddenly, he is financially able to afford to pursue his dream of law school, and Lily, patiently waits for him. Though faithful to Lily, he meets and falls in love with Ellen. Soon he breaks Lily’s heart, stifles his guilt and marries Ellen. Life seemed charmed-great career, loving wife, precious daughter and then, icing on the cake, a son. Unfortunately, the son is developmentally impaired, and all their money and connections can’t fix him. Then Robb becomes more and more successful and moves further away from the idealistic young man Lily, and Ellen loved."}, {"userName": "elliereads", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/5016645-elliereads", "userReview": "I used to enjoy the family fluff of Plain's stories, and when I saw this at the library, I realized I had missed it back when I read her books with more frequency. Suffice it to say I found it boring and mired in details about one character's business dealings. The family dynamics were secondary to a faulty corruption filled plot. This is the second book I've read in as many days in which the main character commits suicide in effort to solve problems. It seems like an easy out for the writers."}, {"userName": "Ann", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/52925980-ann", "userReview": "Funny little book. Once the first twist occurred, I felt like I had to keep going. Although the story is set in the 1970s - 1990s, it somehow felt like it was happening a generation ago, the way the people spoke and acted. As a parent of a special needs kid myself, I enjoyed the inclusion of a 'special' child in the plot, and was heartened by how loving the family was towards the child in the face of scorn from both outsiders and other members of the family."}, {"userName": "Elizabeth", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/964233-elizabeth", "userReview": "ordered the book and the unabridged 10 cd set from the libraryheard the 6 hr tape editionFor now: a book about men's roles and status vs women's roles and status, class, the urban rural divide as it shows up in stigma, prejudice and class and disability. As these cultural factors are assimilated, the main characters' sex drives go accordingly up and down. Add in a little hubris and we have a morality tale hiding a vivid account of social criticism."}, {"userName": "Leslie", "userReviewDate": "Jul 21, 2010", "userURL": "http://www.goodreads.com/user/show/3932509-leslie", "userReview": "So far this book has kept my interest, though the main character needs to have more of a backbone and follow through with what he says he will do. It's a bit melodramatic in places. Not as good as previous books I have read by the author. Now that I'm done with the book I can't say I liked the main character much at all as he had so many flaws. The story was a bit predictable and didn't end happy ever after at all, but ended as I expected it would."}, {"userName": "Chris", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/3076276-chris", "userReview": "Belva Plain has a knack of pulling you in the then shock you repeatedly. In this particular book she brought back all of the emotions of Hunters diagnosis, life difficulties, and fears of how things will be for him. Makes you wonder where she pulls this knowledge from. Definately a must read in my opinion."}, {"userName": "Roberta", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/304453-roberta", "userReview": "I read this because I so loved \"Evergreen\" by the same author. This was not as good. It was an ok story of a man who loves one girl, leaves her and marries another, gets way in over his head with some financial problems, and commits suicide. His wife remarries, happily and his daughter has a brief, if contrived, encounter with his first love."}, {"userName": "Diane Wachter", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/52257921-diane-wachter", "userReview": "Audio Book, @ 1999, 3/00. While knitting Sarah's afghan. Rob, a school teacher, inherits some money enabling him to go to law school. Upon graduation, he spurns his long-time girl friend for the daughter of the senior partner in his new law firm. Successes and tracedies enter and change his family's lives forever. Good."}, {"userName": "Donna", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/1119451-donna", "userReview": "Fortune's Hand is a story of betrayal, temptation, greed and the power of love. Robb McDaniel comes into some money that allows him to go into law school. Leaving his hometown sweetheart who he plans to marry after law school, Robb is the top of his class. But, he falls for a woman he meets by chance. So many changes will happen for Robb.This book kept me intrigued to the very end."}, {"userName": "Nancy", "userReviewDate": "Sep 29, 2007", "userURL": "http://www.goodreads.com/user/show/192445-nancy", "userReview": "This was a pretty run of the mill book. No outstanding characters. No heart racing, ignore your family, forget to cook dinner, because you need to finish that great book thing. Just an average story. A way to pass some time until moving on to something else."}, {"userName": "B.j. Thompson", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/5038759-b-j-thompson", "userReview": "This book was a bit too slow paced for me. I found the description on Goodreads to be misleading. Robb MacDaniel's descent from an idealistic young man in love with a girl from his hometown to a greedy, corrupt man who marries another woman is actually kind of boring. Not a fantastic book."}, {"userName": "Billie Stringer", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/27905103-billie-stringer", "userReview": "Every one needs to read this book. They will j book to have a better understanding of people and disabilities of others. this will perhaps encourage one to thank the father above for each child God puts in their care no matter what ."}, {"userName": "Natacha", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/30042410-natacha", "userReview": "Belva Plain's books were on display this past winter at my local library. I vaguely remember reading Plain's book titled Blessings many years ago. Fortune's Hand was a good read and I look forward to reading more books by this author."}, {"userName": "Bonnie", "userReviewDate": "Apr 09, 2010", "userURL": "http://www.goodreads.com/user/show/3333287-bonnie", "userReview": "I read this before long ago. Some parts I remembered, others I had completely forgotten. I like her stories. The characters are so real and they are not \"happily ever after\" stories. They are more like real life."}, {"userName": "Ann", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/4044475-ann", "userReview": "Robb becomes a gifted lawyer with money he gets when his parents die. He breaks up with his high school sweetheart for a prominent woman. He loses everything when he begins to chase money and material things. Easy no brain read"}, {"userName": "Wendy Twigge", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/17775256-wendy-twigge", "userReview": "Loved it and hated it in parts...Found the ending rushed through...almost felt that there could have been a sequel to the book instead of trying to put so much in three chapters, but otherwise a good read....In fact could not put it down today until it was finished"}, {"userName": "Virginia Markhart", "userReviewDate": "Jan 10, 2010", "userURL": "http://www.goodreads.com/user/show/2797292-virginia-markhart", "userReview": "I have read several Belva Plain books. This was one of the better ones. I liked it that the main character was a man. He was not a nice man either. This was very good and I will look for more of her books at the library."}, {"userName": "Tomkeese", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/11573835-tomkeese", "userReview": "Interesting and engaging. Story is about a successful lawyer and the two women who loved him. It describes his successful career and his gradual decent into a a life of greed and corruption and the effect of this on his wife and family."}, {"userName": "Gerry", "userReviewDate": "Apr 29, 2016", "userURL": "http://www.goodreads.com/user/show/11108005-gerry", "userReview": "It was clear from the beginning that this wasn’t going to be a great book, but it actually went downhill as it neared the end. Too many coincidences, all the loose ends tied up so neatly, and everyone except Robb, the main character, living “happily ever after”. Pretty trite plot and characters."}, {"userName": "Susan", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/8274153-susan", "userReview": "I have just started this one last night.This book may or may not be for you. It has left me feeling blue. At first the story is good... But as you read it, you can fore see the mistakes these people are making. It's not what I would call a \" Feeel Good \" story."}, {"userName": "Penny", "userReviewDate": "Nov 22, 2012", "userURL": "http://www.goodreads.com/user/show/1627275-penny", "userReview": "Good quick read. A story that moves along well and keeps your interest."}, {"userName": "Suzanne", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/4109640-suzanne", "userReview": "Not as good as some of her other books."}], "description": "In this remarkable new novel, Belva Plain creates a brilliant portrayal of a man's descent from idealistic beginnings into a world of dishonesty and greed --- and of the two women who love him. Robb MacDaniel, a schoolteacher with noble intentions, comes into a little money, enabling him to go to law school. Upon graduation, he goes to work for a fine, honorable firm, and marries the daughter of the senior partner, leaving behind the hometown girl he had planned to wed. From then on his career brings enormous successes but then takes a shocking turn that changes his life, the life of his family, and reverberates into the next generation.", "title": "Fortune's Hand", "url": "https://www.goodreads.com/book/show/416889.Fortune_s_Hand", "average": 3.53, "cover": "https://images.gr-assets.com/books/1314447042l/416889.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/10209.Belva_Plain", "name": "Belva Plain"}], "type": ["Fiction", "Romance", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/416889.Fortune_s_Hand", "http://www.goodreads.com/book/show/880408.Fortune_s_Hand", "http://www.goodreads.com/book/show/15732865-un-colpo-di-fortuna", "http://www.goodreads.com/book/show/19382127-fortune-s-hand", "http://www.goodreads.com/book/show/182496.Evergreen", "http://www.goodreads.com/book/show/1179814.Homecoming", "http://www.goodreads.com/book/show/16739.Blessings", "http://www.goodreads.com/book/show/880388.Random_Winds", "http://www.goodreads.com/book/show/16738.Tapestry", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}