{"ratings": 217728, "userreviews": [{"userName": "Tom", "userReviewDate": "Jun 27, 2008", "userURL": "http://www.goodreads.com/user/show/1245181-tom", "userReview": "Ok, before I commit the sacrilege of dismissing this \"classic,\" permit me to establish my Hemingway bona fides: I have read and loved just about everything else he wrote, and have taught Sun Also Rises, Farewell to Arms, and many short stories, and had a blast doing it. I've read Carlos Baker's classic bio, and numerous critical articles on H. I've made the pilgrimage to Key West and taken pictures of his study and the hordes of 6-toed cats. I dig Papa, ok?But I can not stand this book! I should say up front that I've never been able to tolerate it long enough to finish it -- twice. First time was nearly 30 years ago, and as a fairly recently discharged Army troop,I took up this book with much anticipation and excitement. I couldn't get past about half way through. I found the prose so incredibly flat and dull as to be soporific (and, yes, I fully understand and appreciate H's famous \"Iceberg Principle\" of writing -- \"the thing left unsaid\" etc). The problem wasn't the \"thing left unsaid;\" the problem was too many things said, and in a very boring fashion. How could a book with such a dramatic plot be so dull, I wondered in shock? It's all in the language, or lack thereof. I have a theory that great short story writers often don't make great, or even good, novelists, because the voice and style that works so well in the shorter genre just doesn't translate to the longer one (John Cheever, case in point; IB Singer, to a lesser extent). Now, of course, H. did write great novels; this just isn't one of them. Take away the language in H's novels, and what are you left with -- borderline juvenile adventures and fantasies, or at best, semi-journalistic accounts.Compare the opening of Bells with the opening of Farewell to Arms: be honest and tell me if you hear even one faint echo of the magical rhythm of that famous opening in Bells -- anywhere, not just the beginning? And the dialogue, sweet jesus, joseph and mary, I've heard corporate phone recordings with more intonation and human warmth.A few months ago, our book club selected this novel. At first, I kept my opinions to myself and hoped I would have a different response reading this time. I readily acknowledge that my reading tastes have evolved -- matured, I hope -- significantly over the years, and maybe I just had a tin ear 30 years ago. Not the case. I couldn't even get beyond the first 6 pgs this time. That flat voice was duller than ever! \"Waterboarding would be more tolerable than reading 400+ pages of this stuff,\" I thought. I've choked down some mediocre books before for the sake of fulfilling my civic duty as a long-standing member of our book club, but I couldn't do it this time.This is not to suggest that the rest of you are wrong. I have a dear friend who's read more great literature than I can remember, and he loves this book, and expresses great shock when I tell him how much I hate it. But there it is."}, {"userName": "Barry Pierce", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "'Robert Jordan sits on the pine needle floor of the pine forest, the scent of pine drifting through the pine trees which surround him. Gazing through the pines he sees a mountain which reminds him of a breast. It is domed, like a breast, but without a nipple, unlike a breast. The breastness of the mountain is superb. If only it was covered in pine needles and pine trees and had the scent of pine wafting around it. Then Robert would truly be happy.'For Whom the Bell Tolls is allegedly a novel by Ernest Hemingway. Set during the Spanish Civil War, it is a story about an American dynamiter who is attempting to blow up a bridge in order to counteract Franco's forces. Our main character, Robert Jordan, who is essentially a bad haircut personified, might win the title of 'most boring protagonist to ever appear in print'. Robert spends most of his time sitting on the forest floor and thinking about breasts. Poor Robert, his life really stinks! When he isn't thinking about boobs, he goes off on fifty-page long flashbacks to his life before the war when he was a young American in Madrid, cornering young girls at house parties and telling them how Kid A is actually the connoisseurs' choice when it comes to Radiohead albums but he has a soft spot for Pablo Honey. What Robert needs is a feminine foil. A woman who can really stand-up to him and someone the reader can truly get behind. So Papa Hemingway shits out Maria, a woman so badly written that the only thing I can remember about her is that her nipples point upwards. Possibly the most lamentable aspect of Maria's character is the fact that she was raped by a group of fascists, a tragic backstory that Hemingway glosses over into order to talk about what a fantastic rack she has.Hemingway's prose has always been an easy target. I would never, ever stoop so low. In fact, I will say thank god for Hemingway's prose! If For Whom the Bell Tolls was actually written at a literacy level higher than that of a kindergartener then it would genuinely be unreadable. On top of that, Hemingway makes the frankly strange decision to self-censor all of the obscenities throughout the novel. 'What the fuck' becomes 'what the muck' and so on. Hilariously, he also often substitutes obscenities with the word 'obscenity'. So there are genuinely moments in this novel where characters say 'what the obscenity are you doing?' and 'go obscenity yourself'. My advice to all of you is to stay well away from this mess. There's nothing to see here folks. If you are interested in a book on the Spanish Civil War, read Orwell's Homage to Catalonia. If you want a good book about a bridge, and hey who doesn't, read Willa Cather's Alexander's Bridge. God, for whom the bell tolls? It tolls for me."}, {"userName": "stew", "userReviewDate": "Feb 12, 2008", "userURL": "http://www.goodreads.com/user/show/5000-stew", "userReview": "I obscenity your transmission. I obscenity in the milk of your ancestors. I, and always and forever I; wandering I, mucking I, obscene obscenity forever and always and milking and transmissing and mucking wandering amongst the forever and the always I; obscenity obscene, mucking milking milk ancestral forever and ever to have and to hold and to be and now and always and forever; this now, wandering now, transmissing now, mucking now, milking now, obscene obscenity now, ancestral now, forever to be and to hold and to have always."}, {"userName": "Jeffrey Keeten", "userReviewDate": "Aug 26, 2011", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”No man is an Iland, intire of it selfe; every man is a peece of the Continent, a part of the maine; if a Clod bee washed away by the Sea, Europe is the lesse, as well as if a Promontorie were, as well as if a Mannor of thy friends or of thine owne were; any mans death diminishes me, because I am involved in Mankinde; And therefore never send to know for whom the bell tolls; It tolls for thee.”----------John Donne\nRobert Capa’s iconic 1936 photo of a falling soldier.Between 1936-1939 a war happened in Spain. The world refers to it as the Spanish Civil War, but to the citizens of Spain it is called The Civil War. It was a war for control of the soul of a country. It was fought between the Republicans, who were democratically elected and the Nationalists, a Fascist group wanting to overthrow the government. Most people were not aware at the time, but really this Civil War was a precursor, a warming pan for World War Two. The Soviet Union and a coalition of other future allies who stayed behind the scenes provided help and advice for the Republicans. Germany and Italy provided support for the Nationalists. There were international brigades formed up of volunteers from all over the world who came to Spain to fight against fascism. They lost. Francisco Franco, leader of the Nationalists, was the dictator of Spain until his death in 1975. Ernest Hemingway went to Spain as a war correspondent for the North American Newspaper Alliance and was hoping to find some great material for a book. The dialogue is written in an archaic style implying that it is the most correct translation from the Spanish. The thees and thous are distracting and certainly added some ponderousness to a book that was set in the 1930s not the 1630s. \nHemingway in Spain.Robert Jordan is an American who has been trained to be a dynamiter. He joins a band of gypsy freedom fighters up in the hills of Sierra de Guadarrama with orders to blow a bridge that may or may not be important. The chances of survival are slender because they are too few and the timeline too tight. He meets Maria who has been saved by the band from the Fascists who had tortured and raped her. He falls head over heels in love. “I loved you when I saw you today and I loved you always though I have never seen you before.” It could be the added tension of facing certain death coupled with her very real vulnerability that made him protective and lustful for her. Their relationship quickly goes medieval with her begging him for ways to help him: shining his shoes, pouring him wine, mending his clothes, or fetching him something to eat. She is constantly insecure about her appearance because the Fascists had cut off her hair and she only had a stubble grown back. The relationship is built on the most shallow grounds. It is difficult to conceive that it would have survived a move back into a regular life. “But did thee feel the earth move?” I’m not sure if this is where the concept of sex being cosmic originated, but it certainly provided some eye rolling moments for this reader. Especially when the gypsy witch Pilar tells Maria that she will only feel the earth move three times in her lifetime. Why three times?It is not known, but Pilar is most certain it can only happen three times. \nThere is a 1943 movie starring Ingrid Bergman and Gary Cooper.Jordan’s relationship with the rest of the band is one of uncertainty and shifting alliances. He certainly is stepping on the toes of the original leader Pablo who used to be a man of great courage, but had lost his desire to want to kill or be killed. He is considered a coward or in my opinion maybe he’d just had his belly full of it. He commits an act of treason in an attempt to save the band, but decides in the final moment to come back and help. In some ways he is the most interesting character in the book. A man who is evolved past mindlessness and wants more reason for blowing a bridge or killing people than just to follow orders. The best scene in the book is the death of a band of guerrillas who are lead by El Sordo. They are trapped on a hill by the Nationalists and it is some of the most compelling writing in the book as the action shifts between Jordan’s band who want to help, but know it is suicide to help, and the band on the hill wondering if help will arrive. Courage is something Hemingway respects and cowardice is something he worries about. The potential of experiencing his own bout of cowardice or finding it in others is a theme of his life. Jordan’s father had committed suicide, an act of cowardice as far as Jordan was concerned. He is worried that he will be captured and would be forced to kill himself like his father. It puts into question his whole feelings about his father and the way he died. I found myself wincing as I was reading these passages seeing Hemingway’s own mind so glaringly revealed. Hemingway's father killed himself, as did his sister and brother. The curse continued into another generation with the suicide of his granddaughter Margaux. If Hemingway felt the way Jordan did (I believe he did.) I do wonder if he finally forgave his own father when he became the mechanism of his own death or did he maybe blame his father for cursing the family with suicidal thoughts?\nHemingway posing with his favorite shogun. Later he used it to end his life.I read this book as a teenager and was suitably impressed with Hemingway at the time. I’d read The Sun Also Rises and A Farewell to Arms and enjoyed them. I approached For Whom the Bell Tolls convinced I would love it as well. Rereading it now, at this point in my life was a struggle. The story is actually very simple, but this is a book that has fallen in a barrel of water and been bloated beyond recognition. Hemingway is famous for his concise sentences and for the precision of his plots, but in this novel he certainly moves away from both of those concepts. There is a wonderful short novel here hidden behind too much ink. The plot actually becomes tedious and repetitive. Words I thought I would never use to describe a Hemingway novel. I can’t begin to convey how disappointed I felt. It makes me fearful to read others of his books that I have such fine memories of reading. This book was very popular and was nominated for a Pulitzer Prize."}, {"userName": "Adrianne Mathiowetz", "userReviewDate": "Dec 21, 2007", "userURL": "http://www.goodreads.com/user/show/30900-adrianne-mathiowetz", "userReview": "At some point in high school, I decided that I hated Ernest Hemingway. Was it the short story we read in English class? Was it the furniture collection named after him at Gabbert's? Something made me decide that Hemingway was a prick, and after that I dismissed him entirely.This book was beautiful. I don't even like books about war. (Case in point: I scanned half of War and Peace. I think which half is obvious.) But this book took five hundred pages to blow up a single bridge. There were tanks to count, grenades to gather, diagrams to be drawn and generals to contact. Somehow all of this managed to be completely enthralling to a reader whose eyes would otherwise glaze over at the mere mention of battalions. I have to admit, a big part of my interest in it was likely due to the whole \"American escapes America to live in caves and drink absinthe with the gypsies\" thing. Who doesn't want to fantasize about that? And sleeping on pine needles, and falling in love with the gypsy girl! YES.But mostly: I love how Hemingway writes his dialogue as though it were being directly translated. I love the slow sense of living, the feeling of being in the open air, the way you enter his main character's head through his stream of conscious ramblings. And I love that Robert Jordan is referred to as Robert Jordan throughout the entire book -- the way you refer to famous people, historical figures, the names you must commit to memory."}, {"userName": "Lisa", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Not my favourite Hemingway, a little bit too slow. But the topic of the Spanish Civil War makes it a good read, and the John Donne poem that gave the novel its title should be yelled, shouted, sung, recited, hummed and whispered by heart over and over again, especially in these times of outlandishly islandish people destroying the world again:No man is an island entire of itself; every man is a piece of the continent, a part of the main; if a clod be washed away by the sea, Europe is the less, as well as if a promontory were, as well as any manner of thy friends or of thine own were; any man's death diminishes me, because I am involved in mankind. And therefore never send to know FOR WHOM THE BELL TOLLS; it tolls for thee. Thank you Hemingway for being involved in mankind!"}, {"userName": "Loretta", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/18967405-loretta", "userReview": "Suffice it to say, I am not a Hemingway fan."}, {"userName": "Madeline", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Just when I'd decided that Hemingway only ever wrote books about people getting drunk in cafes and thinking about how miserable they are, he surprises me and comes out with something like this. Naturally, the characters still get drunk and think about how miserable they are, but they do it while being guerrilla fighters in the Spanish Civil War, which makes it awesome. In The Things They Carried, Tim O'Brien writes that, \"If at the end of a war story you feel uplifted, or if you feel that some small bit of rectitude has been salvaged from the larger waste, then you have been made the victim of a very old and terrible lie.\" I kept coming back to that quote as I read this book, because it proves that Robbins was absolutely right. For Whom the Bell Tolls is not an uplifting story, and it's not moral. And when you're writing about a ragtag bunch of rebels fighting a fascist army, that's not easy to do. There are no good guys in this story, and no bad guys - not even the fascists. \"Good\" and \"Bad\" in this story isn't divided by such clear lines. Instead, the biggest enemy that the protagonist (I won't use the word \"hero\") Robert Jordan faces is within the rebel group itself - a lot of strong personalities are drawn together by this war, and throwing them all together and making them live in a cave maybe wasn't the best way to go about things. The result is a fascinating portrait of a small group of people under enormous pressure, all trying to do the right thing even as they question what the right thing really is. Even when you're fighting fascists, nothing is black and white. Another observation: having previously believed that Hemingway was incapable of writing compelling female characters, I am now forced to revise that opinion. There are only two women in this book, but they are both fully realized and compelling. Other reviewers found Maria one-dimensional, but I thought she was fascinating because of what was hinted at, but not revealed, about her. Her staggering understatement to describe her time as a prisoner of war - \"Things were done to me\" - is wonderful. She was tragic and sweet, and on a related note, Hemingway writes some surprisingly good sex scenes, so there's that. And Pilar. Holy crap. Probably one of the most well-done characters I've ever read, she's alternately the mother figure, the best friend, the confidante, and the villain. Pilar is my new spirit animal. A war story without heroes or villains, full of hollow victories and rage against the bureaucracy of war and what people under pressure can be forced to do, filled with some very good meditations on killing and war and love, and the importance of acting beyond personal gain. Well done, Mr. Hemingway. (I should also add that Campbell Scott, who read the audiobook, does a fantastic job - he makes the characters' voices different enough for you to tell them apart without difficulty, and his Robert Jordan voice is exactly how I imagine Hemingway sounded in real life. If you're considering reading this, I'd recommend tracking down the audio version)"}, {"userName": "Natalie Vellacott", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/34178791-natalie-vellacott", "userReview": "Oh dear, I fear this review will be lambasted and that people will note that this is the second time I have dismissed a \"classic\" this week. In my defence, I did enjoy Orwell's Animal Farm.I really wanted to like this and persevered to past the half way point. But when I got to the stage where I was dreading picking up the book as I was finding it so monotonous, I decided enough was enough--it was going back to the library from whence it came. The lengthy novel tells the story of Robert Jordan, a young American in the International Brigades attached to a republican guerrilla unit during the Spanish Civil War. As a dynamiter, he is assigned to blow up a bridge during an attack on the city of Segovia.By the half-way point, he still hadn't blown up the bridge but was instead engaging in seemingly never-ending debate about why it needed blowing up, how to do it, whether or not everyone in his group was in favour of the destruction .....the list could go on but I will spare you. I turned each page wondering if it would be the culmination of 250 pages of planning but sadly it was not to be. Or maybe that was a good thing because the soldiers guarding the bridge were spared for another day.Imagine writing down every single action you take in a typical day from morning until evening whether relevant and interesting or not. Then gather a group of people and ask them to do the same. Then merge the pages and you have this book.There is limited bad language although I found it amusing that for the stronger language they have simply inserted the word \"obscenity\" whether it made sense or not. There is some violence and some sexual content. The content wasn't offensive enough to put me off. I just thought this was extremely dull...I now await the barrage of comments bemoaning my ignorance and explaining why I should have been excited about this book.....please feel free."}, {"userName": "Garrett Burnett", "userReviewDate": "May 20, 2008", "userURL": "http://www.goodreads.com/user/show/968809-garrett-burnett", "userReview": "I have a hard time with Mr. Hemingway, I guess. For Whom the Bell Tolls didn't involve as much rampant drinking as many of his other books, but I blame that on the setting—a cave in the mountains where only a few gallons of wine were available (and a flask of absinthe, the flavor of which is described over the course of about thirty pages). However, his standard sexism toward the female characters still applied. Here are a few more things I didn't like about the book:*Did he really have to write \"rope-soled shoes\" every time he mentioned their footwear or even their feet?*The dialogue was the standard stiff Hemingway dialogue, but somehow it seemed even more wooden.*Every Spanish character goes by a first name or a nickname. Not Robert Jordan, the American. He is Robert Jordan (full name) at every mention.*Robert Jordan finds the love of his life in about 17 minutes. Leave it to the Papa to churn out a beautiful and realistic love story.*Every character is so up front with every emotion and the writing was so repetitive (here is my dramatic interpretation): He was frightened. \"I say these things because I am frightened,\" said the frightened man. or She felt herself falling in love with the Hemingway-like main character. \"I feel myself falling in love with you,\" she told him. \"Yes,\" he replied. \"You are falling in love with me.\"I liked a few things about this one: the power struggles, the descriptions of war strategies at various levels of command... Also, it must have been all right because it held my weak attention pretty well despite how slowly the story unfolded. Also, it ended well. Well, it ended, anyway."}, {"userName": "Chris", "userReviewDate": "Nov 25, 2008", "userURL": "http://www.goodreads.com/user/show/36341-chris", "userReview": "I can't understand how anyone would dislike this book. I loved \"The Windup Bird Chronicle,\" but I understand how one wouldn't enjoy it. \"For Whom the Bell Tolls,\" however, was one of those classics that was so perfect, so profoundly moving and yet just enjoyable to read, that I can't comprehend the negative review. Like \"Anna Karenina,\" \"Crime and Punishment,\" or \"Native Son,\" its one of those cornerstones of literature that utterly justified its spot in the cannon. The characters were perfectly wrought, and achingly human, with each life being so significant and yet miniscule in the face of war.It's true that Hemingway can't write a real woman to save his life (Pilar is fantastic, but really he writes her as a man), and Maria's adoration of Robert gets tiresome, but really that's the only false note in this entire epic. For everyone who complains about the stilted dialogue, the dialogue is one of the strokes of absolute genius. Yes, it sounds unnatural, but that's because Hemingway is perfectly capturing how people who don't speak the same native language communicate -- the dialogue is in actually in Spanish between the American Robert and the Spanish guerillas. It's brilliant."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 11, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "587.\tFor Whom The Bell Tolls, Ernest HemingwayFor Whom the Bell Tolls is a novel by Ernest Hemingway published in 1940. It tells the story of Robert Jordan, a young American in the International Brigades attached to a republican guerrilla unit during the Spanish Civil War. As a dynamiter, he is assigned to blow up a bridge during an attack on the city of Segovia. The novel is regarded as one of Hemingway's best works, along with The Sun Also Rises, The Old Man and the Sea, and A Farewell to Arms.تاریخ نخستین خوانش: ماه آگوست سال 1976 میلادیعوان: زنگها برای که به صدا درمی‌آیند؛ نویسنده: ارنست همینگوی (صفی علیشاه) ادبیاتاین رمان روایت داستان رابرت جوردن، سرباز آمریکایی ست که در میانهٔ جنگ‌های داخلی اسپانیا به بریگاد بین‌المللی پیوسته‌ است. وی به‌ عنوان متخصص مواد منفجره وظیفه دارد پلی را که بر سر راه دشمن قرار دارد منفجر کند. جفری مایر، نویسندهٔ زندگی‌نامهٔ همینگوی، اعتقاد دارد که این اثر یکی از بهترین آثار همینگوی در کنار پیرمرد و دریا، وداع با اسلحه و خورشید هم طلوع می‌کند است. سراینده ی صلح، او در جایی گفته: وقتی دیگران حرف میزنند، مردمان خوب گوش نمیکنند راستی زنگها برای که به صدا درمیآیند. ا. شربیانی"}, {"userName": "Fionnuala", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "Reviewed in May 2012The last Hemingway I read was A Moveable Feast and I enjoyed it a lot. It helped that I was staying in Paris when I read it so there was that extra special feeling we get when we walk the very streets an author describes in his stories. I think it suited Hemingway to write stories, and perhaps short novels - I also remember enjoying The Old Man and the Sea and images from that book stayed with me for years. In spite of those good experiences, I couldn't relate to this book. I had just finished reading Xavier Cercas' Soldiers of Salamis: A Novel when I picked up For Whom the Bell Tolls.Cercas' book is a mixture of fact and fiction revolving around events and personalities associated with the Spanish civil war so I figured it was a good idea to follow that reading with this book by Hemingway since it concerns some of the same events. Everything recounted by Cercas, even the fictional parts, have an aura of 'truth' about them. You just believe these events happened and that the characters reacted in the way described. Such a 'truth' is not easy task to convey, especially when the author is working with events which took place more then 60 years previously.Hemingway wrote his novel much closer to the time of the events described yet I couldn't manage to make that leap into believing in the fiction he was presenting. Most of the characters didn't seem credible to me. The main character, Robert Jordan, whom Hemingway continually refers to by his full name in an awkward way, is not so much a character as a monument to male ego tripping. He is big, he is blonde, he is strong, he is an expert in explosives, he is wise, he is always right and he gets the only girl in the place within minutes of meeting her. Another of the main characters, who is constantly referred to by Hemingway as 'the wife of Pablo' rather than Pablo's wife, is also a larger than life creation, bearing closer resemblance to some sybil of the ancient world than to a Spanish peasant woman of the 1930's. You admire her wisdom but you just can't believe she's real. Most of the characters speak a dialect of Spanish which H tries to render in English using lots of 'thees' and 'thous' and some convoluted constructions similar to 'the wife of Pablo' above. When this is done in dialogue, I can see the point of it as it reinforces the idea that this is all taking place in Spain, in Spanish. When the author also uses such constructions in narrative passages, it just becomes wearisome to read. The writing is stiff and awkward, as if written under some invisible constraint, and It lacks any kind of emotion. I am tempted to compare it to watching a man walking about in trousers which are too tight around the crotch, there is that kind of jerky limbs and stilted movement. Perhaps I would have had a different reaction to this book had I read it at an earlier point in my life. Perhaps then I would have ignored these idiosyncrasies and just concentrated on getting to the end to see how the story turned out. These days, I'm less interested in how the story turns out."}, {"userName": "Carlos", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/43073965-carlos", "userReview": "Lo bueno que me dejó este libro fue la curiosidad que me dio por leer más acerca de la guerra civil española. Por otro lado, Hemingway demuestra lo que sabe: escribir buenas novelas.Lo que me gusta, es que siendo sólo cinco días de guerra, logra hacer un libro completo, lleno de recuerdos e historias emocionantes. Me toca un poco el hecho de saber que podrían ser la últimas horas de mi vida, me pongo en ese lugar y como que reflexiono. Me da vueltas en la cabeza cómo sería ser experto en explosivos y volar un puente.¿Recomendado? Sí, los personajes son muy cercanos y \"vivos\", y de pasada, da a conocer un poco sobre la guerra civil española."}, {"userName": "Scott", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/36819318-scott", "userReview": "The writer was a bearded bulk of a man. His carousing had earned him a reputation. He drank hard and worked harder, penning stories filled with drinkers, bullfighters, soldiers and simple words.He sometimes wrote in short sentences. Sometimes quite short. Sometimes very. Sometimes. His style was distinctive. It was often parodied. Sometimes in book reviews.He shot elephants for sport. He murdered lions. He fished Marlins. He watched Andalusian bulls die slow deaths while Spaniards danced around them. This made him look strong and feel strong, a macho man in a world of the same. Posterity has not been kind to manliness of this sort.His book, however, has remained strong. For Whom The Bell Tolls’ binding has weathered many summers, the hot Spanish sun etching lines into its covers, but it still has much vigour. It is spry and tough and bristles with sharp sentences that flash in the afternoon light. The book still takes all challengers, holding court in its sun-baked piazza, its old haunches disguising a muscular story that is a match for any young pretender.This is a story of life and love and death. In the book a young American fights. He fights a vicious war with good people for a doomed cause in a beautiful country. He fights for a bright, true idea knowing that he will never see it realised, fighting all the harder in that knowledge.The young man meets a young woman, a fellow warrior. She is scarred by the war, her family left motionless at the foot of a pock-marked wall whose surface had been so shaped by fascist bullets. They find something together, peace in the midst of carnage, and both must confront what their duty will mean for their new love.Through it all vibrant, tortured, politically riven Spain looms in the background. A nation at a crossroads, a place so clearly dear to the writer’s heart.There is beauty here, in this novel. There are sentences so crisp and clear that you can see the trout sparkling in them as they head upstream. But it is a harsh beauty.For Whom The Bell Tolls, is one of the greatest novels of the twentieth century, but this no feel-good story. The writer saw Spain die, prostrate under the boot of fascism. He knew there were no happy endings there. It is a foolish reader who approaches this work expecting cheer in its final pages.Among the writer’s many strengths was bravery in his work. Hemingway never turned the wheel of his stories when a reef was sighted at journeys end. He clung to the helm while his grateful readers’ hearts were torn and broken on the rocks."}, {"userName": "Luís C.", "userReviewDate": "Aug 23, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "Ernest Hemingway, with the novel For Whom The Bell Tolls makes an argument in favor of freedom. He wrote the novel in 1939 and kept alive the memories of his experiences in the Spanish Civil War.The main character, and central point of the whole action, is an American volunteer named Robert Jordan. He's been entrusted to blow up a bridge to stop the advance of the national reinforcement troops against a republican attack.His guide, Anselmo, establishes the contact between him and a group of people of the guerrilla who live hidden in the mountains.He will live with them three days, while preparing his mission, and will get to know by himself the dreams and frustrations caused by the war.Characters as: Pablo, the chief of the \"maquis\", a disappointed and sceptical old man; Pilar, his wife, a brave and daring person; the Deaf and his group, fierce fighters for freedom.Along his stay he falls in love with María, a 19-years-old girl, victim of the fascist violence. Love comes in hard times and they start a romance that the personality of the main character and the circumstances will make something exceptional.Through internal monologues or flashbacks we get to know the personal story of all the characters, while Spain is reduced to ashes by the tragedy.The heroe knows that his mission isn't going to change things, but he believes in his ideals and fulfils his duty. During the blasting he gets his leg injured. He says a farewell to María and her partners, and dies when shooting against a sudden attack of the enemy.The last section of the novel is the main character lying with a machine gun, covering the retirement of the guerrilla men.This novel, first published in 1940, is the longest and most ambitious of the author, and is considered as a masterpiece.Its reading is essential to get to know Hemingway during the spanish conflict, the republic's fall was a hard blow for him.Robert Jordan is everything the writer would have liked to be, a man prepared to sacrifice his life for the cause in which he strongly believes."}, {"userName": "Andy", "userReviewDate": "Nov 19, 2007", "userURL": "http://www.goodreads.com/user/show/142629-andy", "userReview": "The Spanish Civil War is a very interesting historical event, but this story is full of bad dialogue, glorifies the brave American, and largely ignores the plight of the Spaniards themselves - not to mention that the love interest is as one-dimensional as a blowup sex doll, which is pretty much all that her character serves as in this book. I recommend Orwell's Homage to Catalonia if you want to know what the Spanish Civil War was like - unlike Hemingway who was just a reporter in Spain, Orwell was really a soldier. And unlike Hemingway, Orwell doesn't glorify the fighting but shows it as the horror that it actually was."}, {"userName": "Cynthia Peña", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/4111103-cynthia-pe-a", "userReview": "You know you’ve devoured a good book when after going over the last line you feel somewhat ethereal - an unworldly feeling of satisfaction. Well, that is what I felt with this book. This is my first of Hemingway and my second war novel (first was Vonnegut’s Slaughterhouse Five). When I picked it up from my book rack, I told myself “Hmmm.. Hemingway. This must be a difficult book”, but I was proven wrong. Hemingway’s stylistic choice of words, the density and intelligent distribution of his sentences, his judicious use of figures of speech made every part of the book graspable – the scenes, vivid… the sounds, almost audible.His use of simple Shakespearean language and Spanish profanity, I found really amusing. The former gave added classic tone to the book and the latter, a little jest. But what I really loved about this book was the genuine emotionalism it evoked. There were parts that made me laugh; parts that stirred anger and hate; parts that provoked compassion and fondness and profound pathos for each character that had my eyes pour out lacrimal fluid. There even were times when I had to pause flicking its pages, stare at some random things without even seeing them and smile because of how succinctly beautiful the words were written. I can give this book a multitude of 5 stars. And if you will ask me how much I love this book, I’ll say, “A bushel and a peck and some in a gourd” :)"}, {"userName": "Matt", "userReviewDate": "Nov 10, 2008", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "There's an old saying, ascribed to Dostoevsky (and a dozen other famous authors, I'm sure), that says there are only two types of stories: (1)a man goes on a journey; and (2) a stranger rides into town. It's a cute, pithy little saying, and broadly true, especially if you stretch your definition of \"journey.\" Of course, it misses the third great type of story: the loss of an Eden-like paradise, which is the basis of every romantic comedy in existence: boy meets girl, boy loses girl, boy gets girl back (and obviously, the \"boy\" and \"girl\" can be mixed and matched, and you can replace either \"boy\" or \"girl\" with \"yellow lab\" and get the same results). And then there is the man-on-a-mission story. A personal favorite of mine.It is a macho-version of the archtypal journey-story: it starts with a man, or more usually, a bunch of men (and maybe a woman, to spice things up), and they have a mission. Usually, that mission is to rescue someone (The Searchers, for instance), or to kill someone (The Day of the Jackal, The Five Fingers, The Eagle Has Landed), or to blow something up (The Bridge on the River Kwai, Black Cross). The allure of the man-on-a-mission genre is that it's paint-by-numbers storytelling. Act I: Introduce the team (a maximum of one personality trait per character, please). Act II: Mission (you can make up whatever you want, as long as the fate of the world rests upon it). Act III: Something should be saved, killed, or blown up. THE END. Now, wait for the royalties and McDonalds tie-in. Besides man-on-mission stories, I always like it when an esteemed artist decides to tackle a specific genre. There's nothing better than a talented individual breathing fresh life into old tropes. (I guess I sound like Goldilocks, but I like it when things aren't too old, and aren't too new, but are just right). It's no surprise, then, that I loved For Whom the Bell Tolls. This is a man-on-mission book. Forget what SparksNotes says. Forget its baggage as a \"classic.\" Reduced to its essence, For Whom the Bell Tolls is about a fella trying to blow up a bridge. And there ain't nothing simpler than a dude trying to impede his enemy's movement by disrupting a chasm-spanning structure with a little well-placed trinitrotoluene. And he even has time to fall in love. The man, in this case, is Robert Jordan, an American fighting against Franco in the Spanish Civil War. At the start of the novel, in true Hemingway style, he is lying on his stomach, listening to the wind in the pine trees, studying the Spanish countryside. Robert has been ordered to infiltrate enemy lines and - you guessed it - blow up a bridge. (I imagine blowing up a bridge must be among the more satisfying of life's endeavors). Robert joins a group of partisans, meeting three central characters: Pablo, Pilar, and Maria, the woman with whom he will fall in love. Pablo is the leader, but he is aging, selfish, and on the verge of betraying the Republic. Pilar is his woman, and she wears the pants in their relationship. It is up to her to bully Pablo into doing his job (in case you didn't realize this, her name is Pilar = pillar). Finally, there is Marie, a beautiful young girl who was raped by the fascists and had her hair shorn off. Marie isn't so much a character as a plot point, but this shouldn't come as a surprise because (a) this is a Hemingway novel, with its emphasis on masculinity and violence and (b) who cares? there's a freaking bridge to blow up!! This was my introduction to Hemingway. Before reading For Whom the Bell Tolls, I had a half-baked idea of what a Hemingway novel would be like. I expected it to be short, terse, manly, and cynical. I mean, Hemingway was famous for his war-haunted heart, his heroic alcohol consumption, his awesome beard, and his shotgun finale. How could his writing be anything but bleak? (Apropos to nothing, who's great idea was it to cast Chris O'Donnell as Ernest Hemingway in In Love and War? No offense to the blandly handsome Chris O'Donnell, but when I think of \"man,\" his perpetually-young visage, blank eyes, and school-boy grin certainly don't leap to mind). Imagine my surprise, then, that For Whom the Bell Tolls would be so unabashedly romantic. The young idealist on the doomed mission falling in love with the broken girl. It's the kind of angst that any self-respecting teenager could get behind, yet they still wave the banner of The Catcher in the Rye. (I would rather be on Robert Jordan's ill-fated bridge than associate with Holden Caulfield). Robert actually has a lot more in common with a melodramatic high-schooler than Lee Marvin from The Dirty Dozen. When he joins with the partisans, he starts to brood: Two days ago, I never knew that Pilar, Pablo nor the rest existed, he thought. There was no such thing as Maria in the world. It was certainly a much simpler world.Later, Robert, who realizes there might be more to life than temporarily denying Franco's troops passage across a gorge, thinks: And if there is no such thing as a long time, nor the rest of your lives, nor from now on, but there is only now, why then now is the thing to praise. There is none of the Hemingway fatalism, cynicism, and bitterness that pervades every page of A Farewell to Arms. Instead, you hear the voice of a young idealist. And that's the hardest character to write: a true believer. A confession: I first read this when I was an emotionally vulnerable, impressionable freshman in college. I was at the end of a vivid, tumultuous relationship with a girl coincidentally named Maria. As that was going south, in a tight corkscrew, I pictured myself as the doomed Robert Jordan. It was an oddly comforting thought. (If you paid attention to the past presidential campaign, Senator John McCain also noted that he identified with Robert Jordan. I think that worried me at the time; you want your president to be a lot of things, but a lovelorn sap with his hands on a detonator is not one of them). Since first finishing this novel many years ago, I've come back to it several times. I have always wondered if I missed something. Is For Whom the Bell Tolls a parody of idealism? Is its openness, full-heartedness, and heroism actually a critique of values that Hemingway found worthless? Is Hemingway's lack of cynicsm actually the greatest cynicism of all?I don't think so, but maybe that's the broken-hearted freshman in me. All I know is that when I read that love scene between Robert and Maria in the heather, the part of me that has hardened a bit over the years softens. I read the passage, nod, and say: \"Yeah, that's what it was like, the first time. That's what it's like to fall in love.\" Then there was the smell of the heather crushed and the roughness of the bent stalks under her head and the sun bright on her closed eyes and all his life he would remember the curve of her throat with her head pushed back into the heather roots and her lips that moved smally and by themselves and the fluttering of the lashes on eyes tight closed against the sun and against everything, and for her everything was red, orange, gold-red, from the sun on the closed eyes, and it all was that color, all of it, the filling, the possessing, the having, all of that color, all in a blindness of that color. For him it was a dark passage which led to nowhere, then to nowhere, then again to nowhere, once again to nowhere, always and forever to nowhere, heavy on the elbows in the earth to nowhere, hung on all time always to unknowing nowhere, this time and again for always to nowhere, now not to be borne once again always and to nowhere, now beyond all bearing up, up, up and into nowhere, suddenly, scaldingly, holdingly all nowhere gone and time absolutely still and they were both there, time having stopped and he felt the earth move out and away from under them.It's a passage so unlike the prototypical Ernest Hemingway. It's a passage that belongs to Robert Penn Warren, the endless sentences with the rhythmic word-repetitions. I like to imagine Hemingway banging this paragraph out on his typewriter, drinking Spanish rum and thinking about the love of his life, and all those feelings just poured out on the page. Beyond this interlude, though, is the bridge, the mission. Robert goes to the bridge, and the finale is gripping, white-knuckled, more typical of the Hemingway style: the battle is plainly told, almost like an after-action report, interspersed with Robert's active interior monologue: If we can win here, we can win everywhere...the world is a fine place and worth the fighting for, and I hate very much to leave it.So many of Hemingway's characters are men and women who bear life's scars: the war-shattered souls of The Sun Also Rises; Henry's tragic loss of Catherine in A Farewell to Arms; the old man's last mythic fight in The Old Man and the Sea. For Whom the Bell Tolls is different in that Robert has not had time to accumulate the scars of the typical Hemingway Man. Instead, he is young, faithful, driven, and in love. His scars would come in the future, if the future ever came.The result is a wildly emotional, wildly entertaining story about youth and Spain and sex and war and the precise application of explosives to a cantilevered span in the Spanish mountains."}, {"userName": "Mahdi Lotfi", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/52374183-mahdi-lotfi", "userReview": "این ناقوس مرگ کیست یا زنگ‌ها برای که به صدا در می‌آیند نام رمانی است از ارنست همینگوی که در سال ۱۹۴۰ منتشر شد. این رمان روایت داستان رابرت جوردن سرباز آمریکایی است که در میانه جنگ‌های داخلی اسپانیا به بریگاد بین‌المللی پیوسته‌است. وی به عنوان متخصص مواد منفجره وظیفه یافته‌است پلی را که بر سر راه دشمن قرار دارد منفجر کند."}, {"userName": "Thomas", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "A little better than Hemingway's other books, but that does not say much. For Whom the Bell Tolls has all the Hemingway staples: an obsession with war and violence, an over-idealization of romantic love, and lackluster writing. But he does improve in some areas from his past books. He includes Pilar, a complex and empowered woman whose strength sets her apart from Hemingway's more meek, modest female characters. Hemingway also makes Robert Jordan, our protagonist, a little more thoughtful, as he questions the ethics of killing people and whether the act should bring pleasure. He also tries to curtail his anger, thus deepening his relationship with masculinity in a much needed way in comparison to Hemingway's other stolid male characters.Overall, I would not recommend For Whom the Bell Tolls unless you like reading about people fighting each other and/or about insta-love. Hemingway shows his lack of versatility as a writer through his novels as they all revolve around the same themes. I wonder what he would have written about if he had been born in a different time."}, {"userName": "Geoff", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/126266-geoff", "userReview": "I won't deny my youthful bloody-lust to travel afar and get the girl and die in valor \"fighting the good fight\"- before those words were emptied by experience and observation-; and to read the messages-in-bottles (all polished sea-glass smooth by now) my teenage self is tossing into a flood tide from far, far away in some distant dimension (where he hardly resembles myself, and I am ashamed of him) this book is \"written-well\". I perfectly remember my parent's back porch and sun-struck green afternoons with this book cradled in my palms and the smell of cut grass and my American Lawn and Garden (I was fortunate enough to have both). These memories aren't invalid. (In my yard the barbs of bees did pierce the naked soles of my feet and the pain was fire-bright and vivid.) Then, dreams of a romantic death were romantic and that is a truth of the mind of a young male. But now I want to live a long time, cloistered from war; I don't care if I get the girl or the girl gets me but I certainly have nothing to prove; and I'd rather have a mysterious end apart from ideology and Other's freedoms. I wonder if anything was ever as grand and noble and terrible as it is when Hemingway puts it down. I doubt it, but then again I believe the legend of King Arthur literally happened, word for word. Hemingway wants people to believe this is life, but it's fiction and that's enough. This is a \"great book\"."}, {"userName": "Esra M.", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/23529472-esra-m", "userReview": "Arka fonda İspanya iç savaşı varken insan ruhunun derinliklerine doğru katmanlı bir yolculuğa çıktım bu kitapla. Okuma süreci ve sonrasında pek çok soruya yanıt aradım. Madem bir savaş kitabı oradan başlayalım. Aynı zamanda da spoiler vermeye başlıyorum. İnsanlar var, kendi canından vazgeçmişken başkasını öldürmeye hakkı olmadığını düşünen. Çatışmaya gitmeden önce birini öldürme ihtimalini düşünmek istemeyen –çünkü karşı taraftakiler de aynı kendileri gibi, sadece aldıkları emirler farklı- O zaman savaş gerçekte kimler arasında? Hemingway bu soruyu öyle bir şiddetle sorduruyor ki okuyucuya kolay kolay etkisinden çıkamıyorsunuz. Sonra geçiyoruz bireysel anlamda insana. Savaş var, dağın ortasındalar ama insan varsa duygu da var. Aşk yakalıyor kahramanımızı. Kitapta bana duyguyu geçiremeyen tek taraf burası. Aşka düşme şekli çok acele olsa da insanın aşkı uğruna nelerden vazgeçebileceği, neleri göze alacağını çok güzel işliyor. Ya insana dair diğer duygular. Kahramanlarımız üzerinden geçmişten bugüne taşınanlar ya da yetinilenler, korkular, boş inançlar, tanrıyla ilişki, sadakat duygusu didikleniyor. Her sorgulamada insan ister istemez geriye dönüp kendi içini eşeliyor. Bir de “şimdinin gücü” var. Son zamanlarda pek popüler olan bu cümleye Hemingway yıllar öncesinden göz kırpıyor. Şu anın kıymetini bilip dolu dolu yaşamak değil mi en önemli olan? Yarın ne olacağını hatta yarın olup olamayacağımızı bilmedikten sonra. Temas ettiği pek çok konu var kitabın. Pek çok sorusu var. Okuması kolay, etkisi uzun süren bu kitabın ıskalanmaması gerektiğini düşünüyorum."}, {"userName": "RandomAnthony", "userReviewDate": "Aug 01, 2009", "userURL": "http://www.goodreads.com/user/show/721021-randomanthony", "userReview": "Ok, so Ben Harrison inspired me to check out some Hemingway. I hadn’t ready any of Hemingway’s work in close to twenty years. I remember starting A Movable Feast in college, reading five pages, and wondering what they hell was wrong with the author. I couldn’t get past what I perceived as a wooden, hacked-off writing style. I felt kind of guilty, though, because I grew up a couple miles away from Oak Park, Illinois, which styles itself as an integral part of Hemingway’s youth, and some people I respected liked his work. Still, you know how it goes, twenty years can pass with other books besides Hemingway.After reading Ben’s comments I stopped at the local library and the only Hemingway title on the shelves was For Whom The Bell Tolls. The fates, I assume, were telling me to start with that book. So I did. And on page six I encountered this passage:“You could not always take it like that,” Golz said and shook his head. “But in this case, you may. It is my attack.”“I understand it,” Robert Jordan had said. “I do not say I like it very much.”“Neither do I like it very much. If you do not want to undertake it, say so now. If you think you cannot do it, say so now.”“I will do it,” Robert Jordan had said. “I will do it all right.”So…I’m wondering…where have I heard this style before? And then I remember…Come, Dick. Come and see.Come, come.Come and see.Come and see Spot.Look, Spot.Oh, look.Look and see.Oh, see.And I thought, holy hell, Hemingway writes like a Dick and Jane book! What the hell is Ben Harrison thinking?And then I kept reading, and you know, Ben Harrison was right. This is a great book, and once you get used to Hemingway’s style, he draws you in, and his groundbreaking, influential voice shines. You can read the summary of the book on your own so I’m going to skip that part. I want to focus instead on how Hemingway’s style merges perfectly with the sense of relentless fate and meditative reflection of what’s important against hopeless odds. Pilar’s description of the village on the day the fascists are expelled harrowed and haunted me. The tough, determined band of rebels and their sparse interaction mirrored the rough land on which they subsisted. And the relationship between Maria and Robert pulses as real and tragic. And as much as I mocked the early language I was enamored with passages like:At either of those places you felt that you were taking part in a crusade. That was the only word for it although it was a word that had been so worn and abused that it no longer gave its true meaning. You felt, in spite of all bureaucracy and inefficiency and party strife something that was like the feeling you expected to have and did not have when you made your first communion. It was a feeling of consecration to a duty toward all of the oppressed of the world which would be difficult and embarrassing to speak about as religious experience and yet it was as authentic as the feeling you had when you heard Bach, or stood in Chartres Cathedral or the Cathedral at Leon and saw the light coming through the great windows. Wow. And the thread between this book and Cormac McCarthy, one of my favorite authors, couldn’t be clearer. I’ve also heard people describe Hemingway’s books as over-masculine guy-lit. For Whom The Bells Tolls was not written exclusively for guys with Skoal rings and Nascar numbers on their trucks. The book is deep and challenging. I was happy to finish this book the same way I was happy to finish Paradise Lost. The experience was rewarding and exhausting. So, thanks, Ben. You were right. For Whom The Bell Tolls is excellent, and if all Hemingway’s work is of the same quality, he deserves a bright spot in the constellation of American literature. I’m a convert."}, {"userName": "☙ percy ❧", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/19742661-percy", "userReview": "i might attempt to pick this up again some day but at the moment it's marked as dnf. it was just so dull and lacklustre i couldn't make it past the first 100 pages"}, {"userName": "Sinem", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/7363477-sinem", "userReview": "sadece 4 günde olanları okuyarak iliklerime kadar savaşa battım. müthiş bir deneyim."}, {"userName": "Chris Messner", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/12388814-chris-messner", "userReview": "While I was traveling in Cuba and doing research for my book, one of the many places I visited was Hemingway's home. In Hemingway's home, where everything still sits as he left it, I learned of Hemingway's surprising influence upon Fidel Castro.In Hemingway's library, there was a framed 8\" x 10\" black and white picture of a man. At first, I had no idea who this person was. I later learned that this gentleman was Charles Sweeney, a close friend of Hemingway. Sweeney was a career military man and Hemingway's personal advisor on military issues such as in \"For Whom The Bell Tolls.\" Interestingly, Fidel Castro was said to have used Hemingway's novel as a reference on guerrilla warfare even though Castro had only met Hemingway but one time at a fishing tournament in Havana in 1960.Hemingway spent a relatively lengthy period of time at the Hotel Ambos Mundos in Havana. Room number 511 of the Hotel Ambos Mundos, the only room where Hemingway stayed, is said to be where Hemingway wrote some chapters of \"For Whom the Bell Tolls.\" Seeing the places in Cuba associated with Hemingway intrigued me more about this novel and made my reading of this book more enjoyable."}, {"userName": "Nikos Tsentemeidis", "userReviewDate": "Oct 02, 2014", "userURL": "http://www.goodreads.com/user/show/27325053-nikos-tsentemeidis", "userReview": "Πολύ δυνατό βιβλίο. Το θέμα άλλωστε, προδιαθέτει για κάτι τέτοιο. Ένας εμφύλιος πόλεμος. Ισπανία 1937.Δεν έχω διαβάσει ποτέ για τον ισπανικό εμφύλιο, που νομίζω παρουσιάζει ιδιαίτερο ενδιαφέρον. Ωστόσο η ιστορία που εκτυλίσσεται λέει πολλά, για την κατάσταση. Ένα βιβλίο με πολιτικές και κοινωνικές διαστάσεις. Εσωτερικοί μονόλογοι των ηρώων, την ώρα της μάχης ζωντανεύουν την ιστορία. Χαρακτηριστικός διάλογος δύο ηρώων στο ίδιο στρατόπεδο, που μου έμεινε:- Είσαι και συ κομμουνιστής;- Όχι. Αντιφασίστας.Δεν έχω πολλά να πω. Από τα καλύτερα που διάβασα φέτος."}, {"userName": "Saman Kashi", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/273273-saman-kashi", "userReview": "یک ترجمه‌ی بد از یک شاهکار ادبی. نمی‌دانم اولین بار چه کسی عنوان این کتاب را این‌قدر بی‌روح و سرد به \"زنگ‌ها برای که به صدا در می‌آیند\" برگرداند؟ عنوان زیباتر و رساتر این داستان را (این ناقوس عزای کیست) بیش‌تر می‌پسندم؛ چرا که داستان صرفاً روایت یک عملیات پارتیزانی محض نیست، بل‌که روایت یک رابطه‌ی انسانی و در مقابل آن چیزی به نام آرمان و هدف استباری، ترجمه‌ی بد این کتاب باعث شد تا از خواندن آن لذتی نبرم و فیلمی که از آن پیش‌تر دیده بودم برایم باقی بماند. باشد تا برگردان بهتری از این کتاب روانه بازار نشر شود"}, {"userName": "Jon(athan) Nakapalau", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "Two young lovers find each other in the midst of war - and fight an inner battle between duty and happiness. The bell tolls for us all at some point, but do we hear it in time to awake to an authentic life before it is silent?"}], "description": "Hemingway's classic novel of the Spanish Civil War. In 1937 Ernest Hemingway traveled to Spain to cover the civil war; three years later he completed the greatest novel to emerge from \"the good fight,\" For Whom the Bell Tolls. The story of Robert Jordan, a young American in the International Brigades, it tells of loyalty and courage, love and defeat, and the tragic death of an ideal. Surpassing his achievement in The Sun Also Rises and A Farewell to Arms, Hemingway creates a work at once rare and beautiful, strong and brutal, compassionate, moving and wise. \"If the function of a writer is to reveal reality,\" Maxwell Perkins wrote to Hemingway after reading the manuscript, \"no one ever so completely performed it.\" For Whom the Bell Tolls stands as one of the best war novels of all time.  Ernest Hemingway did more to change the style of English prose than any other writer in the twentieth century, and for his efforts he was awarded the Nobel Prize for literature in 1954. Hemingway wrote in short, declarative sentences and was known for his tough, terse prose. Publication of The Sun Also Rises and A Farewell to Arms immediately established Ernest Hemingway as one of the greatest literary lights of the twentieth century. As part of the expatriate community in 1920s Paris, the former journalist and World War I ambulance driver began a career that lead to international fame. Hemingway was an aficionado of bullfighting and big-game hunting, and his main protagonists were always men and women of courage and conviction, who suffered unseen scars, both physical and emotional. He covered the Spanish Civil War, portraying it in fiction in his brilliant novel For Whom the Bell Tolls, and he subsequently covered World War II. His classic novella The Old Man and the Sea won the Pulitzer Prize in 1953. He died in 1961.", "title": "For Whom the Bell Tolls", "url": "http://www.goodreads.com/book/show/138042.For_Whom_the_Bell_Tolls", "average": 3.96, "cover": "https://images.gr-assets.com/books/1310252400l/138042.jpg", "reviews": 5073, "authors": [{"url": "https://www.goodreads.com/author/show/1455.Ernest_Hemingway", "name": "Ernest Hemingway"}], "type": ["Classics", "Fiction", "Literature", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/138042.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/46170.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/840230.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/2350414.For_Whom_The_Bell_Tolls", "http://www.goodreads.com/book/show/3324389", "http://www.goodreads.com/book/show/13503162-por-qui-n-doblan-las-campanas", "http://www.goodreads.com/book/show/8275388-por-quem-os-sinos-dobram", "http://www.goodreads.com/book/show/1437914._", "http://www.goodreads.com/book/show/7783103-for-whom-the-bell-tolls", "http://www.goodreads.com/book/show/17306554-anlar-kimin-in-al-yor", "http://www.goodreads.com/book/show/17559093", "http://www.goodreads.com/book/show/6916971", "http://www.goodreads.com/book/show/840233.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/2165.The_Old_Man_and_the_Sea", "http://www.goodreads.com/book/show/3876.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/10799.A_Farewell_to_Arms", "http://www.goodreads.com/book/show/4631.A_Moveable_Feast", "http://www.goodreads.com/book/show/4625.The_Complete_Short_Stories", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}