{"ratings": 617, "userreviews": [{"userName": "Dale Harcombe", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "I read this a while back and had forgotten I hadn’t written the review. The story concerns the child Grace Serenity born to a pair of teenagers. Cheri gives birth to Grace Serenity but dies in a car crash soon after she flees the hospital. The chapters alternate between Jake, and Leila the childless Nigerian woman married to David, an English curate. Leila is not your average minister’s wife, if such a thing even exists. Jake is a 40 year old man afraid of commitment who has broken up with Anna and, being jobless, gets roped into going on the quest by Deborah’s husband Perry and other family members. It is a sad story of a child caught between two families. Matt, the young single father,his parents and sister, and the desperate childless couple, David and Leila, who want to adopt Grace.The book raises issues associated with interracial marriages, childlessness, adoption, parental rights and. It also presents a sad picture and comment on some family relationships.I found some of the characters like Perry and Deborah, selfish, manipulative and self obsessed in the extreme and wondered why Jake was so fascinated with them. Despite this I became involved in the story and it kept me reading to see what happened, even though I had an idea what that would be. I read it through in a day or so. It’s a good quick read but it still had plenty to think about. It made me angry at times and teary but that just shows I was involved with the story and the characters, even if I didn’t like all of them."}, {"userName": "Miz", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/6907245-miz", "userReview": "YAH A NEW ZEALAND WRITER.I'm a fan of Charity's easy contemporary fiction novels and this was no exception. Well written, good character development, and I was invested in the story enough that I wanted it to turn out one way. I'm not divulging how close to the actual storyline I 'guessed', but nevertheless if you're a fan of her other novels this will stand up to scrutiny."}, {"userName": "Book Bazaar", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/5875379-book-bazaar", "userReview": "London, 1990s. In a hospital ward, Cherie, 16, black, gives birth to Grace Serenity. Shortly afterwards she flees the hospital and dies in a car crash.David Edmunds, white, parish priest, and his black Nigerian wife, Leila, are finding that their childlessness causes more problems than their mixed marriage. Desperate to have a family, they undergo IVF without success. As the book opens, an adoption process is under way.Jake Kelly, 40-year-old New Zealander, can’t commit to his relationship with Anna, who wants a child before she gets too old. She decides to end their relationship and asks Jake to move out. On the same day, Jake quits his job as an investment banker. A colleague, Lucy, clever, attractive, invites him to her parents’ home in the country for the weekend. Lucy’s young half-brother, Matt, is into loud music and drugs.After the shocking opening, we become involved with two families – the Edmunds in their search for a child, and Lucy’s family, the Harrisons, who draw Jake into their convoluted life and the secrets they are hiding. Why has Lucy’s stepmother, Deborah, not returned from an assignment in Africa? Why is 16-year-old Matt so confused and desperate?Adoption is the theme of this book. The slightly clunky title, Freeing Grace, is explained late in the story during the adoption hearing that forms the climax.The main characters, with a strong supporting cast, are well drawn, credible and memorable. The story moves between the two families, following parallel paths, until finally they are brought together by baby Grace. The prose flows easily and we are always sure where we are and which thread we are following. Jake tells his story in the first person which further helps to keep the story on track.The plot is interesting, with many surprises. We go with Jake to Africa, briefly, in strong contrast to the cool, misty weather of the English countryside. The story is moving, funny and absorbing. It’s up to date and relevant with its themes of childlessness, mixed marriage, prejudice, adoption, teenage pregnancy, drugs, alcohol and mental illness.Thoroughly recommended as an engaging, entertaining read, with enough depth to make you care about the characters. This is Charity Norman’s first novel. I hope she writes more.Jo Rudd 28/5/2011"}, {"userName": "Jennifer", "userReviewDate": "Jul 01, 2011", "userURL": "http://www.goodreads.com/user/show/755892-jennifer", "userReview": "I'm a sucker for an adoption story, this much is true...but I did really enjoy this book. It is predictable in places, yes...but I thought it was a good story - with plenty of characters you either really loved or wanted to punch in the face.I'm grateful for the Easy Living review which is likely the only reason I would have ever come across this one.It did have me sniffling more than once on the Tube...I won't say if they were happy tears or sad tears, obviously...but regardless, it was emotional.Then again I can read or watch anything about adoption without crying...so I can't really be trusted, can I?"}, {"userName": "Victoria Scott", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/11758600-victoria-scott", "userReview": "This book was so full of emotion, I loved it. There was a pretty stressful moral dilemma in this; give the baby to the birth family that doesn't really want it, or to adoptive parents that do? Can you really just take a baby away from it's family? By swapping between the perspectives of both sides, you really get to fall in love with everyone, and that makes the decision so much harder. Sometimes, I felt no doubt in who I wanted to get this baby, then I'd swap a few chapters later. What I do wish is that there was a little bit more of those sad scenes; I didn't cry once, and I fully expected to. TBC"}, {"userName": "Caraline", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/8332383-caraline", "userReview": "I was lucky enough to win a copy of this book from the publisher Allen & Unwin in a Facebook competition.This is possibly one of my all time favourite books. I loved it.At first I was unsure how the initial characters would fit together, but it soon became obvious. The books I enjoy most make me want to BE the women (or parts of them), or be best friends with them, or be adopted by them, and they make me want to marry the men, or be adopted by them, or adopt them. You get the picture. I felt very close to all the characters.Even the characters who had such huge flaws were still likeable, perhaps because of their flaws?! I felt invested in each person, even Hilda, the hideous mother-in-law, and her awful spouse Christopher. I know Monica and Nicky, even though they are minor characters, but Charity Norman writes so well, even Dora in the shop was 'visible' to me!I am personally fortunate not to have been in Leila's position, to yearn for a child that I can never have. I didn't have a teenage pregnancy, nor did I marry a widower. I'm not a Kiwi bloke who can't settle down. But through this novel I felt a lot of the characters emotions. It has helped me see things with a wider world view.I usually root for someone in this kind of book. With Jodi Picoult novels, it's apparent whose side you are on, for example. But this book just made me want to read on, to find out what happened, to find out how it would happen. Of course, it was so good, I was also trying to ration it, because I knew I would be bereft when I had read it all, and I would have to say goodbye to them all!I cannot recommend this highly enough. I found Charity Norman by accident on Amazon and I read Second Chances (After the fall) which I loved. Next I read her latest novel The Secret Life of Luke Livingstone (also wonderful) and I have The Son-in-law waiting. I daren't read it because then I will have nothing left to anticipate. That is how good her books are. Read Freeing Grace today.Freeing Grace"}, {"userName": "Our Library Mornington", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/4700983-our-library-mornington", "userReview": "Freeing Grace is a great read from a new author which captured my attention from start to finish. A baby, Grace, is at the centre of the drama where two families are in a struggle around her adoption. I enjoyed following their plight as each chapter switched between the two parallel families. After years of waiting, the childless couple made up of David, a curate, and his wife, are desperate to adopt Grace. Yet the teenage father, Matt Harrison, is not ready to let her go. Jake, a family friend of the Harrisons, becomes unwittingly drawn into the dark family secrets.Freeing Grace is a tale of hope, sadness and joy as the issues of teenage parenthood, mixed race marriages, adoption and religion are pondered when the two families strive to do what is best for Grace. Fans of Monica McInerney and Joanna Trollope will enjoy this compelling novel. The author, Charity Norman, is a barrister who was born in Uganda, lived in the UK and now lives in New Zealand."}, {"userName": "Steph Hall", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/7922905-steph-hall", "userReview": "What a disappointment this book was, not in terms of story, which is usually the disappointment if a book isn't up to scratch, but in this case, it was in the writing which was of a very poor level. It was hard to \"bond\" with or believe the characters, and the general wordcraft and storytelling throughout was very basic, and frankly I'm surprised it was published in this form. Big shame as the actual story and the idea of the tussle between families wishing to keep Grace was a great idea - told by a master like Jodi Picoult for example, this book could have been a gripping bestseller from start to finish.Really not keen to bother with anything else from this author. Hopefully, she has improved her style and writing ability. I feel a bit like my teenager could have written this one!"}, {"userName": "Mandy", "userReviewDate": "May 30, 2014", "userURL": "http://www.goodreads.com/user/show/18318291-mandy", "userReview": "More like 3.5 stars. I did enjoy this, to an extent. I liked the characters of Leila and David a lot. I was rooting for them from the beginning. Matt, Perry and Deborah, and to a lesser extent, Lucy got on my nerves. I found them irritating beyond measure.I am glad that the story ended the way that I wanted it to, and I felt everything was wound up nicely, but in a believable way.I thought it a good read but not on a par with Jodi Picoult, as some have suggested."}, {"userName": "Heather", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/19391352-heather", "userReview": "I enjoyed the book, but only give it three stars as it lost its hold on me at around 50%. It took me a while to see where the book was going as it seemed to be travelling along two diverse story routes, however it all made sense. I did not really get the relationship between David and Deborah.... the only unbelievable bit to me."}, {"userName": "Emma Balkin", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/22799042-emma-balkin", "userReview": "This book did a good job of weaving together the lives of the characters. The outcomes were not as predictable as I expected. Interesting to read a novel by a New Zealander, but the novel is largely set in the UK. A book about mental health , a book you meant to read in 2017 but didn’t get to."}, {"userName": "Sandra Shannon", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/30954508-sandra-shannon", "userReview": "Really enjoyed this contemporary novel about families, mental illness, adoption, friendship. Second Charity Norman book I have read and enjoyed."}, {"userName": "Linley Crofskey", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/26074585-linley-crofskey", "userReview": "Lovely story of a newborn baby-who will get Grace-her birth family of the lovely couple who want to adopt her."}, {"userName": "Gay Harding", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/27816991-gay-harding", "userReview": "Easy to read. A bit predictable and a bit drawn out at times, a reasonable storyline but lacked depth. Her later novels are an improvement."}, {"userName": "Susan", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/6313653-susan", "userReview": "Warm, insightful and poignant, Freeing Grace tells the story of David, curate of an inner-city parish, and Leila, his Nigerian-born wife. Unable to have children of their own, they're desperate for a family. When they finally hear they've been approved to adopt a baby, Grace, they can scarcely believe their good fortune. There's just one problem for which David and Leila cannot plan; Grace's birth family - the enigmatic, charismatic Harrisons. Enlisting their friend, the feckless, charming New Zealander, Jake Kelly - who's half in love with all of them, one way or another - the Harrisons send him on a quest that will force a confrontation. Ultimately, each has a terrible decision to make. Everyone only wants what's best for Grace - but who can say exactly what that is?After having read two more recent Charity Norman books which I loved I was pleased to find this book which was her first novel. All I can say is that her writing has greatly improved! I didn't feel engaged by any of the characters, the story was good but it lacked depth. I found myself not really caring what happened to anybody in the book. A disappointment but at least it was her first book and not her most recent..."}, {"userName": "Steph", "userReviewDate": "Dec 14, 2014", "userURL": "http://www.goodreads.com/user/show/11109307-steph", "userReview": "This had all the hallmarks of a good story and the potential to be riveting but it sadly was let down in the overall telling of the story. The story of David and his wife who wanted to adopt baby Grace was well told tho I could never feel any warmth for them and never wanted them to get the baby. What totally baffled me was why was what should have been Matts story of trying to get his daughter back and all his family dramas not recounted by Matt himself or at least a family member...instead bring in some random man called Jake who used to work with his sister and let him tell the story. I get that Jake was obv trying to find himself and he in different ways helped the family members but it was as if their lives depended on this complete stranger and I was baffled by it to be honest.It was simply a story turned into a bizarre weird retelling by a complete nobody!"}, {"userName": "Kathy", "userReviewDate": "Sep 29, 2012", "userURL": "http://www.goodreads.com/user/show/7198747-kathy", "userReview": "After reading Second Chances by Charity Norman i very quickly bought Freeing Grace fully expecting this to be as outstanding as Second Chances. I was a little disappointed that is wasn't the five stars, but still it was a good read. I didn't feel i made a connection with the characters, but in saying that i was interested to see what happened to 'Grace' the baby abandoned at birth by the mother. It was heartbreaking to see the 17 year old father wanting to keep the baby himself, but also on the adoptive parents side, the anquish they went through trying to have a baby, then on the waiting list to adopt, then the battle to have 'Grace' also...i'm glad my career is not making the decision of which family is the best!"}, {"userName": "Marg", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/4729969-marg", "userReview": "I rather touching story though at time a little predictable. There are however several twists throughout and it is well written. Grace is the daughter of a young boy and his girlfriend who is suddenly killed soon after the birth. David's family decide to keep the baby but must show themselves as worthy to the authorities. A desperate, childless couple - a curate and his Nigerian born wife - will do almost anything to adopt the baby and must go through lots of ups and down along the way. A good read that brings tears to the eyes on more than one occasion throughout the story."}, {"userName": "Laraine", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/7445887-laraine", "userReview": "A strong 4 1/2 star read, another excellent and poignant read from Charity Norman. \"Freeing Grace\" tells the story of two families and the baby they both want desperately. Grace is a newborn when her teenage mother dies. Her father is also a teenager with issues and a dysfunctional family. Leila and David are a mixed race couple who desperately want a child and can't have one. They want to adopt Grace. All is well until Grace's runaway grandmother comes into the picture, wanting custody."}, {"userName": "Lorna", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/15896060-lorna", "userReview": "I loved this book. The story was around a new born whose unmarried mother has died. We then follow the story from the child's father and family and the prospective adopting parents points of view. There are many individual stories spun around them all beautifully told. The ending, which I won't reveal not to spoil your read, is particularly told in a sensitive way. I will probably read this book again and again."}, {"userName": "Joy", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/47143241-joy", "userReview": "My third book by this author, (although I now realise it was the first she wrote) and I've loved them all. Wish she would write some more! This one was a bit of a slow burner, but definitely worth persevering with - by the last third or so of the book I couldn't put it down. The ending was very satisfying. The style of book and issues face remind me a little of Jodi Picoult, but I can relate more fully with the writing of this author with her British/New Zealand background."}, {"userName": "Lynette", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/15121098-lynette", "userReview": "First novel by this author and I read it last! Have to say that I probably enjoyed her others more, but it was still a good read. At times I thought it was a bit average but definitely got better as it went along and by the end I was really enjoying it and very keen to see how the dilemma was going to be solved! Charity Norman is very good with her descriptions and I felt like I really knew and understood all the characters and could sympathise with them all."}, {"userName": "Glynis", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/4457316-glynis", "userReview": "I previously read a novel by this author and loved it hence my purchase of Freeing Grace. Unfortunately although quite enjoying this book it was nowhere near as good. It droned on and on, gathered pace at times and drew me in and then started wandering again. I didn't find the main character Jake to be very interesting although I was concerned at one time that he might actually be my son in law!"}, {"userName": "Kim", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/1698059-kim", "userReview": "Annoyingly I didn't write a review for this at the time, and as I read so much I don't tend to remember books in great detail, but this has stuck with me. A very moving story which genuinely left me feeling torn as to what the outcome for Grace should be. I was happy with the decision in the end though, and Jake really appealed to me as a character!"}, {"userName": "Ali", "userReviewDate": "Apr 07, 2016", "userURL": "http://www.goodreads.com/user/show/4891239-ali", "userReview": "I found myself engaged by Jake's narration despite finding the family he was describing less than sympathetic and often downright annoying. In contrast I really liked Leila and was cheering her as she fought her way through family in laws, social workers, beaucracy and the constraints of being a vicar's wife to achieve her dreams and desires."}, {"userName": "Rachel288", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/18686053-rachel288", "userReview": "Following reading 'After the Fall' by the same author I was really looking forward to 'Freeing Grace'. This read was slightly disappointing I felt there were too many characters to get to know, with After the Fall, felt I knew and liked all the characters and the way in which Charity portrayed them was fabulous, this book not so, although the basis of the story was a really good one."}, {"userName": "Sheila Pritchard", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/11852350-sheila-pritchard", "userReview": "Another very satisfying read! Norman is a very skilful writer. Complex relationships and believable characters.I wondered how she would bring this story together so that it was an outcome good for all concerned. But she deftly did it!"}, {"userName": "Sarah", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/7932728-sarah", "userReview": "Another great read from Charity Norman, one of my favourite authors. Not quite as wonderful as After The Fall but to be fair that's a pretty exceptional benchmark to be measured against. Well written, realistically flawed characters & an insight into the two sides of adoption."}, {"userName": "Joanne", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/4838846-joanne", "userReview": "I did enjoy this book. I thought it it explored many different themes as well as the main one of adoption. I liked Jake's character and the way that his story pulled all of the characters together. My main gripe - it was a tad too long."}, {"userName": "Maggie Kiely", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/27118553-maggie-kiely", "userReview": "I so loved this book and all its characters. It was easy to be interested in their lives and was sad when finished. I would highly recommend. I have read other novels by Charity Norman and while I thought 'After the Fall' was only worth 1 star, I really enjoyed The Son in Law also."}], "description": "This novel tells the story of David, curate of an inner-city parish, and Leila, his Nigerian-born wife. They're finally approved to adopt a baby, Grace, but there's one thing they can't plan for - the Harrisons, Grace's birth family. The family send the charming Jake Kelly on a quest that will force a confrontation.", "title": "Freeing Grace", "url": "https://www.goodreads.com/book/show/8605842-freeing-grace", "average": 3.85, "cover": "https://images.gr-assets.com/books/1307829413l/8605842.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/4126111.Charity_Norman", "name": "Charity Norman"}], "type": ["Contemporary", "Book Club"], "outlinks": ["http://www.goodreads.com/book/show/8605842-freeing-grace", "http://www.goodreads.com/book/show/34731609-freeing-grace", "http://www.goodreads.com/book/show/19008691-freeing-grace", "http://www.goodreads.com/book/show/14604631-freeing-grace", "http://www.goodreads.com/book/show/17125479-after-the-fall", "http://www.goodreads.com/book/show/17905351-the-son-in-law", "http://www.goodreads.com/book/show/34203697-see-you-in-september", "http://www.goodreads.com/book/show/23645667-the-secret-life-of-luke-livingstone", "http://www.goodreads.com/book/show/35064664-best-served-cold"]}