{"ratings": 487, "userreviews": [{"userName": "Kirsten ", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/833700-kirsten", "userReview": "A slow start. I didn't enjoy it nearly as much as Christmas in London, but the second half is a lot of fun, though the name-dropping of big fashion names did get on my nerves after a while. Still, I do really like this author. Her writing flows and she has fun characters."}, {"userName": "Stacey Lechner", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/3236869-stacey-lechner", "userReview": "Thanks to Net Galley and St. Martin's Griffin for an advanced copy of this book. Not one of my favorites. Way too much name dropping, mention of clothing labels and general superficiality. The main character, Serena wasn't well developed enough to make me care about her love life or family drama. All she seemed to care about was fashion and what she was wearing. The author makes reference to her intelligence, but that didn't come through at all.The book did deal with some serious issues about infidelity, but everything seemed to be glossed over and not really taken all that seriously. Excuses were made for everything in regards to all the stories of infidelity, but nothing rang true to me. It was more about keeping up appearances.Everything towards the end seemed rushed because so much time was spent describing who was wearing what. A few too many characters and most of them weren't fully developed. The book was a little too predictable and superficial for me to fully enjoy it."}, {"userName": "Ellen", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/7134495-ellen", "userReview": "I liked the story line, but there was too much talk of what designer clothes the main character was wearing. Yes, she worked at Vogue, but it took away from the story lines of love, romance, infidelity and forgiveness. Plus the ostentatious wealth was a bit much for my taste."}, {"userName": "Diana", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/5876816-diana", "userReview": "This book was ok. It was an easy beach, summer read but it wasn't real well written and the plot got a little ridiculous. First, there were waaaay too many basic descriptions. \"She wore this this this. Her hair had this color ribbon. She had blah blah blah shoes.\" Too many paragraphs began with a new description like that of what someone was wearing. The food was also overly described and not in a good way. Then there was the plot. It was ok but then it took a turn towards the end...there is actually a paragraph, all spoken by the same character, that included the words \"our father\" and \"will you marry me?\" Marrying your half-sister's half-brother who thought of your father as his father (and then was told he died). There was a lot of eye rolling from that point on. This would be a good easy beach read when you aren't able to concentrate well or something. But it was nowhere near great."}, {"userName": "Melissa", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/110328-melissa", "userReview": "http://www.chicklitcentral.com/2015/0...Also has a review for Truly, Madly, Greekly."}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "Serena is the daughter of a California senator and is quite accomplished in her own right. She is a features editor for Vogue magazine. Her life seems like rainbows and sunshine, especially when her boyfriend, Chase, asks her to marry him. And to top it off, things are going well for her at work. She has been offered the assignment of interviewing the former French Vogue editor, Yvette Renault, while she is staying in Cannes. Things start going downhill from there though. She arrives in Cannes at the posh hotel to find out her reservation is missing and there are no available rooms. Thankfully, she meets Zoe who lives in a fancy suite with rooms to spare. Zoe tells Serena to stay with her and in return, Zoe hopes that Serena will teach her to be chic and a thing or two about fashion. While starting her work in Cannes, Serena gets the news from her fiancé that her father's indiscretions are being covered in the newspapers back home. Obviously this sends Serena on a tailspin as many of her family's secrets are being uncovered publicly and to top it off, Chase isn't too happy with the latest revelation as it may hurt his aspiring political career. As Serena interviews Yvette about the ups and downs of her life, she can make connections to her own and undoubltly, Serena realizes that there are some changes she needs to make. French Coast by Anita Hughes is an indulgent summertime read and perfect for vacation. It's light, it's sexy, and fans of fashion will absolutely love all the descriptions of the fabulous clothes.Read my review here: http://www.confessionsofabookaddict.c..."}, {"userName": "Kimberly V", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/5637566-kimberly-v", "userReview": "With its glamorous setting and enticing storyline, I had high hopes for French Coast by Anita Hughes. I really wanted to like this book, but I was distracted by the constant name dropping of designer labels, hotel suites, and more. Characters constantly referenced the full names of hotels, suites, and streets in a very unnatural way. Instead of the characters just saying that they were going back to their hotels or suites, they consistently mentioned the entire formal names. I would expect this once or twice in the beginning of the novel, but unfortunately this is so often repeated that I was unable to concentrate on the story. Had this not been the case, I think I would have enjoyed this novel. It felt reminiscent to novels by Jackie Collins."}, {"userName": "Barbara White", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/8368378-barbara-white", "userReview": "This is the perfect beach bag novel--full of exotic locations, designer clothes, and gourmet food. I love Anita Hughes' novels because I know they will transport me away from real life. They are 100% guaranteed escapism and this one didn't disappoint. I devoured it in two days. Bring on the next one, Anita!"}, {"userName": "Catherine", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/49598486-catherine", "userReview": "Good book, but I was a little annoyed that she kept jumping from Serena to Yvette to Zoe. It was weird that Serena kept running into Nick, but they were made for each other. I'm so glad that she saw what Chase was really like, before they married. He turned out to be a real jerk! I couldn't believe he \"made love\" and then he broke up, with her! What nerve! I felt, the writer, Bertrand was rude and selfish; but I thought it was nice that he added Yvette's name to the book."}, {"userName": "Samantha March", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/4681357-samantha-march", "userReview": "I received a review copyOMG, my friends. I said it best on social media when I announced I was reading this book. I said “This book is making me want to pause life so I can just keep reading.” I mean...do I even need to say anything else? From the first page, and I’m not lying, from the first page I knew I was going to be totally hooked. Anita Hughes is one of my favorite writers, and her books have the complete ability to make me get lost in them. I love that this time I was taken to France, and wrapped up in not only a mystery in the present, but from the past. I loved the dueling time periods we get, from Serena but then also Yvette, as she takes us back in time along with her. There was a twist near the end that I’ll be honest – I didn’t see coming. When a book makes me gasp aloud and my eyes bug out, you know it’s a good one. I can’t say enough good things about not only French Coast but Anita Hughes, and this one is a must-read."}, {"userName": "Kate", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/17642-kate", "userReview": "This book is stupid. It is shallow. And I devoured it. I discovered French Coast on a list of books you should bring on your vacation and it has all the great things a beach book needs - romance, mystery, long passages about food, sex and clothes. At some point, though, I started to hate read this book. All of the male characters like their sex pretty much the same way. The main character goes on a writing assignment and not only brings 400 changes of clothes, she brings several changes of perfume as well. What? She makes a stupid decision about her future only to change her mind five minutes later. And although you can see the ending coming miles away, I was so annoyed by it. If you want something fluffy and stupid that is a fast read, this is for you."}, {"userName": "Lulu", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/16899585-lulu", "userReview": "Started off ok, just a breezy chick lit but fun setting (Cannes) and premise (Vogue editor sent to the south of France to interview the longterm editor of French Vogue) but it just continued to devolve into the amateurish mess of a story it is. Stuck with it but it's a train wreck of a novel."}, {"userName": "Cyndi", "userReviewDate": "Jun 11, 2015", "userURL": "http://www.goodreads.com/user/show/34635170-cyndi", "userReview": "Total waste of time, couldn't even finish it. How about more story and less designer name dropping.....I get the main character works in fashion, but it was complete overkill."}, {"userName": "Andrea", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/4089691-andrea", "userReview": "I enjoyed reading a light book about the south of France while its 4 degrees outside. I had two minor issues with this book:1) The author spends too much time describing their outfits. Every time a character changes clothes, the outfit is described in detail. I also didn’t know hair ribbons were making such a comeback.2) I counted 8 times that a character kisses another character “on the mouth.” I felt like this was so middle school. If a grown man is walking his fiancé to her car, its pretty normal for him to kiss her goodbye. I would assume he is not kidding her forehead or cheek."}, {"userName": "Tripfiction", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/24495694-tripfiction", "userReview": "Romance fiction set in Cannes, Cote d’Azur (“Nobody in Cannes worries about time”)Zac Posen – Manolos – Lilly Pulitzer – Courrèges – Lanvin – Betsey Johnson – Acqua di Parma – Dior – Oscar de la Renta Stuart Weitzman – Coach – Ferragamo – Yves St Laurent – Stella McCartney – Manolos – Pucci – Gucci – Bottega VenetaSerena is the features editor for Vogue in San Francisco and lives the cushioned lifestyle of the wealthy. Her Father is a retired Senator and she is dating Chase, who is also on the cusp of moving into politics. She is offered the chance to go to Cannes to interview Yvette Renault, the larger then life editor of French Vogue, who wants to, finally, tell her story and detail her affair with Bertrand Roland, the famous writer. This is a real coup for Serena and just before she jets off, Chase places a huge engagement ring on her finger. So far, so good!She arrives in the middle of the Cannes Film Festival and as soon as she sets foot on French soil, her world begins to be turned upside down. The first catastrophe is that the Carlton-InterContinental has no record of her room reservation. There isn’t a room to be had because of the Film Festival. But she soon finds herself pouring her heart out to Zoe, a young and slightly needy woman with a penchant for pistachios, who invites her to take the spare room in her Cary Grant Suite. Her luck is in, though it is soon to be splintered once again by revelations of a different kind. Parents need careful managing – for both Zoe and Serena – and Serena soon acquires a stalker (though a handsome one at that) in the form of Nick, who pops up at every turn.Life in Cannes and along the Cote d’Azur amongst the beau monde is a world away from everyday life. The Carlton-Intercontinental provides a regular buffet service for its guests in the suites atop the hotel, offering perhaps a vanilla, cinnamon or almond tea for a quick refresher. It is the lap of luxury, decked out in silk and satin, and the guests can take in the view of the glittering sea, the fishing boats and yachts from the balcony, a glass of quality wine (or a cucumber martini) in hand.The girls regularly update their wardrobe and there are any number of couture names to drool over, Lancôme lip gloss to apply, stylish hair creations to create and gold shoes to slide onto well manicured feet. Style is absolute.Stars promenade along the Boulevard de La Croisette, and for the reader, the gloss and glitz and blazing sun catching the ripples on the Mediterranean are palpable. This book is an immersion in the colour of Cannes, you almost feel as though you have been mingling with jetset, it is a book with sunhat and sunglasses written all over it (though the tan is extra). Explore Marché Forville, and pour over the baskets of raspberries, the racks of olive oil from Provence, and the salts from the Camargue; dine a Z Plage, pop over to Juan les Pins, Mougins, Antibes and Monte Carlo, and generally enjoy being a flâneuse with Serena and Zoe in the South of France, immerse yourself in a satisfying story of romance and glamour and sensory overload.This review first appeared on our blog: http://www.tripfiction.com/romance-fi..."}, {"userName": "Rachel Gilbey", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/5801320-rachel-gilbey", "userReview": "I won a copy of French Coast around a year ago, and in the past year there have been a few times when I was going to pick it up to start reading, but something stopped me. After reading my first Anita Hughes book earlier this year I was even more apprehensive about starting French Coast, purely as I wasn't really sure what to expect......what I discovered very early on was that I was enjoying French Coast a whole deal and really felt as though I was reading a story, or in fact multiple stories set around Cannes, on the French Riviera. Serena is a journalist and in her biggest job ever has to interview former French Vogue editor Yvette, in Cannes for a month, to help write her memoirs. The hotel has no record of Serena's reservation and she ends up sharing a suite with a kind young women called Zoe Pistachio. But just why is Zoe willing to share a suite with a stranger?I loved hearing Yvette reminisce about her love life to be precise, as well as Serena's time on the French Coast. Serena is having a mixed time of things, as she meets a new man who keep popping up, and both she and Zoe have a whole variety of family dramas to deal with. With a fabulous mix of glitz, glamour, sun and summer, this is a gorgeous summery beach read, especially if you are going on holiday to the south of France yourself. There are ups and downs and the book moves along at a reasonable pace, and its clear the author has been to the area, as I could just imagine myself in some of the locations. I enjoyed French Coast far more than I was anticipating, which just shows that even the books you can't recall why you bought and are languishing somewhere on a TBR list, are worth a try at some point."}, {"userName": "Jacqueline", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/10924883-jacqueline", "userReview": "They say never judge a book by it’s cover, but from the moment I saw the cover of this novel set in Cannes, I wanted to be that girl and I knew I had to read this book.Two young women, Serena and Zoe, find themselves in Cannes during the Film Festival for different reasons, but very soon their lives there become entwined. Serena has the perfect life, a handsome, successful fiancé and her dream job as editor at Vogue. Zoe is more secretive as to who she is and why she is in Cannes, but there is family history and mystery to be revealed for them both and as their stories unfurl we slowly begin to get to know them. A third woman, Yvette, whose private life is also a bit of a mystery, adds another side to the story and lots of elegance to the plot. As this book moves on there are many twists and I kept thinking I’d made a discovery only to watch it fade as the plot shifted in another direction.All of this drama is played out in the South of France with plenty of passion and lots of fashion, as to be expected for guests in a suite at the Carlton-Intercontinental Hotel. However, as I’m a village girl and not really a fashionista, I tired a little of the constant descriptions of which designer name was being worn by each character whenever they appeared, but I’m sure many would disagree with me, especially as the main characters work the fashion industry.This book has a great plot and will take you away from your day to day life and immerse you in Cannes and the high life many of us can only dream of. It is a perfect summer read, especially if you are lucky enough to be holidaying in the South of France."}, {"userName": "Mrs Mommy Booknerd http://mrsmommybooknerd.blogspot.com", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/4827402-mrs-mommy-booknerd-http-mrsmommybooknerd-blogspot-com", "userReview": "Set in an an amazing location with interesting characters, food, fashion and fun, FRENCH COAST is a great book to take a vacation inside of. You will be whisked away to the French Coast and will feel like you are there in person...seeing the sights, smelling the smell, living the life. This story is one that will grab the chick lit loving reader and not let them go. There is a little something for everyone and each reader will be craving a little bit more. 4 stars"}, {"userName": "Maureen Hetzel", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/13741318-maureen-hetzel", "userReview": "Not wonderful ...and annoying in the author's need to describe by designer each character's clothing and shoes for each appearance in the story. OK she is a Vogue editor but I guarantee all her potential readers are not Vogue fans. Tedious"}, {"userName": "Estelle", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/1154815-estelle", "userReview": "3.5 stars. Perfect read for a beach trip. Quick, fun, and addicting."}, {"userName": "Brooke Hayes", "userReviewDate": "Jun 26, 2016", "userURL": "http://www.goodreads.com/user/show/32290581-brooke-hayes", "userReview": "I have to stop picking up books that I think will be fun to read on vacation. Pointless pretentious nonsense."}, {"userName": "Linda Bewley", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/16709197-linda-bewley", "userReview": "I would give this book less than one star if that was possible. Don't waste your time."}, {"userName": "Diane", "userReviewDate": "Nov 17, 2015", "userURL": "http://www.goodreads.com/user/show/2598668-diane", "userReview": "More 2 star than 3, but I did finish it. Very shallow and often boring."}, {"userName": "Debbi", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/43306934-debbi", "userReview": "So poorly written. It's seems that all she did was cut and paste the entire book, and just change the color or label of the clothing."}, {"userName": "Amy", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "Got irritated pretty quickly. Too much description, and not of the interesting sort."}, {"userName": "Liz Fenton", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/2079101-liz-fenton", "userReview": "Devoured it in one day! A delightful fast-paced story with lots of twists and turns that kept me interested."}, {"userName": "Lisa", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/2974804-lisa", "userReview": "Don't bother reading. It had so much potential, set in beautiful Cannes. But the story, the characters, all of it is so vapid and derivative. Don't waste your time."}, {"userName": "Christine", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/9349367-christine", "userReview": "I only gave this book 2 stars. I've seen several reviews giving this book a low rating because there is too much focus on frivolity (clothes, food) and rich people problems. That is not my issue with the book at all. I've read a few other of Anita Hughes's books, and I quite enjoy the lavish settings and descriptions of beautiful clothes, sumptuous meals, etc. I view Hughes's books as similar to Elin Hilderbrand's - light reads I can enjoy on the beach or while on vacation. That's the genre.However, I just didn't think this book was as well-written. It was frustrating to me that many plot lines and some characters were left very undeveloped. At times, it seemed the secondary plot lines of both Yvette and Zoe overshadowed the main story of Serena. And even still, there were huge holes in Yvette's story, questions I wanted answered.I didn't care for the ending at all. Without giving anything away, it seemed way too coincidental to the point of really having to suspend disbelief. And it also ended abruptly, leaving the reader hanging about many aspects of Serena's key relationships (especially her relationship with her parents, moving forward). I actually think more insight into the parents characters, more of a backstory (maybe in the form of flashbacks, like yvette's) would have been helpful. I really could have done without the whole storyline of Zoe and her family. It was nothing more than a distraction for me. I think the author was trying to weave the main theme of the book (about marriage and fidelity) through various plots and characters, it just didn't come together for me.Finally, while I don't mind detailed descriptions of the characters' appearances, having Serena roll out of bed and \"tie her hair back with a ribbon\" that matches whatever sundress she \"threw on\" got a little tedious. This supposed paragon of style seemingly only wore ponytails or tied her hair back with ribbon. And how realistic is it to roll out of bed and look fabulous? Apparently, Serena can pull off never showering, washing her hair, applying makeup, etc.I generally enjoy Anita Hughes books, but this one falls short, despite the fabulous setting."}, {"userName": "Elizabeth", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/16351869-elizabeth", "userReview": "I won't provide a synopsis, as that has been done in other reviews. Suffice to say that this book has an interesting plot line (which is why I chose to read it) but the story was buried under utterly unnecessary name-dropping, label-dropping, and annoying, repetitive phrases (eg. \"she twirled her pony tail\"; she \"flashed\" on ... ) and repetitions (eg. the chapters with Yvette Renault invariably began with her greeting Serena, followed by a description of what she was wearing - usually with some designer name attached). To me, these tactics are a sign of lazy writing. I found myself becoming annoyed to the point of almost abandoning the book but I persevered to the end because, as I said, it did have a somewhat unique plot line and characters - and I was curious as to whether or not I was correct in my prediction of the ending. In short, \"French Coast\" had lots of potential, but fell far short: \"chick lit\" needn't be this shallow and lazy."}, {"userName": "Asheley", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/4691325-asheley", "userReview": "Serena has a great job at Vogue magazine and the assignment of a lifetime: she's been given the opportunity to travel to France to interview Yvette Renault, former editor of French Vogue Magazine. Serena will be staying at the exquisitely fashionable Carlton InterContintental Hotel in Cannes while meeting with Yvette while her new fiance remains at home in San Francisco, and they will be announcing their upcoming engagement soon. Serena's career is important to her, her fiance Chase is supportive, and Serena is looking forward to/counting on her mother helping her plan her wedding while she interviews Yvette, someone she greatly admires. Things are looking pretty great for Serena until strange details about Serena's family begin to pop up here and there, which makes life a little bit confusing for her. She soldiers on, though, and as she ponders over all of this new information, she begins to question much about her upbringing and also what she really wants for her future. ----I loved this book. I love Serena. I was looking for a fun escape and that's exactly what I got when I picked up French Coast by Anita Hughes. I was completely immersed into the world of high fashion, exquisite French cuisine, and life on the French Riviera. Since I have never visited this part of the world nor have I experienced the life of a magazine editor, I found my escape into Serena's shoes quite enjoyable. Serena is a fashion editor; fashion is what she loves. She is a highly fashionable character herself, paying particular attention to what she wears and also paying attention to the fashion tastes of other people she interacts with. I enjoyed the way great fashion houses and labels were mentioned as Serena's clothes and accessories were described, along with the outfits of other characters -- not only did it help me paint the pictures of the characters, I think it gave the book a little extra something in the way of fun and imagery. Also, attention is given to describing food in the story, and it is mouth-watering. All of the 'describing' in this story served to make it more lovely in my mind, like I was traveling there myself. It made me want to go there, actually. Like, pack a suitcase and hop a plane, get there now.I've mentioned that Serena was in Cannes for an exclusive interview, and the interview scenes are some of my favorite. It is in these scenes that we learn Yvette Renault's backstory, and she has had a fascinating life. I told you that I love Serena, but I adore Yvette because hello there, strong woman. Hers is a story-within-a-story because her memoir is being written. Yvette adds so much to this book - some of it I expected, and some was a surprise to me! Yvette's story is one of perseverance even through disappointment, and also resilience. And strength. And she was able to share these things with Serena. LOVED THIS. In the story synopsis, we learn that some crazy things happen to Serena while she interviews Yvette, over the course of her few weeks in Cannes: she meets interesting people that change her life, she finds out big family secrets, etc. These tidbits are revealed slowly over time, and I was excited to see how everything would eventually unfold. For a while, it seemed like things were getting a little crazy for Serena, like maybe the story was getting a little out of control, but everything worked out in the end. I'll admit that I was holding my breath for Serena. I knew how I wanted things to end, but I wasn't sure how it would actually come together until all was said and done. It was thrilling to be kept in such suspense toward the end, particularly since I wanted so much for the story's main character. I think I was so enamored by the setting and the characters to try to look ahead and anticipate the ending? I loved it that way, being caught up in the where and the who. As things unfolded and connections began to be made, my eyes may have gotten a little large at one point (aka side-eyes) and my mouth may have dropped open at how one or two things turned out. I love this about reading-to-escape. You guys, I grew to feel really strongly for Serena and I was rooting so hard for her after things her life had gotten a little messy. It would have been so easy for her to pack up and go home, to leave the interview and go back to the States and work though the junk taking place there. But NO, no she didn't, because it wasn't her junk to work out! I love Serena's resilience. I love the way she kept to what she was doing, she kept on task because that kept her centered and feeling alive while her world was going crazy, even as one little crappy thing turned into two little crappy things, etc. By the end of the book, things did wrap up a bit neatly, but I didn't mind at all. I'm not sure what this entire situation would look if it played out in real life, but this isn't real life, this is fiction, and doggone it, I liked it. Ultimately, I think French Coast by Anita Hughes is a book to grab for enjoyment and escape. Also, maybe if you have a little wanderlust, because it absolutely drops you off on the coast of France. The setting feels beautiful, the descriptions are vivid and lend to great imagery, and the story makes it easy to get lost for a few hours. Take this one to the pool or the beach, or just sit outside on the porch for a while. I recommend French Coast by Anita Hughes to readers that enjoy great settings, stories-within-stories, and stories about strong, resilient women."}], "description": "Serena has the job she's always dreamed of and Chase, the man her heart never dared to. As a new editor at Vogue, she bags the biggest interview of the year with Yvette Renault, the infamous former editor of French Vogue, in The Carlton-InterContinental Hotel during the Cannes Film Festival. She eagerly jets off to France while Chase stays home, working with her father, a former senator, on his upcoming mayoral campaign.Everything feels unbelievably perfect...until it doesn't. The hotel loses her reservation hours before her big interview. Serena fears that she'll have to go home without her story, but then she meets Zoe, a quirky young woman staying in the suite below Yvette's who invites Serena to stay with her. Serena is grateful for her mysterious roommate's generosity, but it seems that there's more to her story than meets the eye. To make matters worse, soon after arriving in Cannes, Serena learns a shocking secret about her parents' marriage, and it isn't long before she begins to question her own relationship.With her deadline looming and pressure mounting, Serena will have to use her investigative journalism skills, new friendships, and a little luck to get her life and love back on track. Fast paced and impeccably written, French Coast will draw readers in to the intoxicating world of the Côte d'Azur. Hughes' beautiful prose and sense imagery bring the food, fashion, and feel of the ocean to life in this audacious new novel.", "title": "French Coast", "url": "http://www.goodreads.com/book/show/22537671-french-coast", "average": 3.19, "cover": "https://images.gr-assets.com/books/1422904925l/22537671.jpg", "reviews": 108, "authors": [{"url": "https://www.goodreads.com/author/show/5316290.Anita_Hughes", "name": "Anita Hughes"}], "type": ["Fiction", "Womens Fiction", "Cultural", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/22537671-french-coast", "http://www.goodreads.com/book/show/28220860-christmas-in-paris", "http://www.goodreads.com/book/show/33574242-christmas-in-london", "http://www.goodreads.com/book/show/15793117-market-street", "http://www.goodreads.com/book/show/13015220-monarch-beach", "http://www.goodreads.com/book/show/16045069-lake-como"]}