{"ratings": 278, "userreviews": [{"userName": "Amy", "userReviewDate": "May 28, 2010", "userURL": "http://www.goodreads.com/user/show/2342686-amy", "userReview": "I appreciated many aspects of this book and the challenge Lisa gives in pursuing good, healthy, Godly relationships with other women. She gives real life personal examples of the ups and downs of friendships she has had...the good, the bad, and the ugly. I must say that I was completely surprised and at times uncomfortable with how candid she was in describing her feelings about her friendships. As she authentically shared, I imagined how some of my past friendships would have accepted her thoughts and behavior regarding friendships. I know certain women in my life would never tolerate such apparent neediness. In simpler words, I have had women walk away from friendships with me over a lot less than some of the attributes of neediness Lisa has described. I have encouraged other friends to read this book. I haven't said much to them about the book, in hopes of hearing from the hearts on what they got from it. I wonder if they might arrive at a similar conclusion."}, {"userName": "Sandra", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/3813521-sandra", "userReview": "I think that writing a book would be one of the hardest things to do. Not only would you have to be a good writer (which I am not) but you would also have to be willing to be transparent and make yourself vulnerable. After all, your book will in some way open up a part of your life, your thoughts and emotions. Then when your book is reviewed, you are putting yourself in a position of those qualities that you've shared being criticized.  In her book Friendships for Grown Ups, Lisa Whelchel does just that. She candidly discusses walls that she had built around herself for protection and the lack of ability to build friendships because of those walls. Lisa openly and honestly shares her deep, personal struggles and how God began to break down those walls in her life. She discusses how needy she felt and how she was finally able to begin building deep, lasting relationships. I did enjoy the book and at times could empathize with Lisa's struggles. I felt that the book offered some good tips,but I will say that at times I was grateful not to be a friend of Lisa's with her expectations and all the details of that relationship being shared so publicly!My first thought was that the book would be better if it were geared toward teens or young adults. Yet as I've read reviews for her book, I was amazed at how many adults shared how they too could relate with Lisa's experiences and insecurities. My only real problem with the book is when she shares about having a male \"sponsor\" that she called daily to talk about her problems. Lisa did end the relationship when she realized where it could lead, but perhaps she could be a bit clearer that a relationship of that type should never be started. This would be a good book to encourage women who struggle with developing friendships.I received this book from Thomas Nelson as a part of their blogger book review program. All opinions expressed are my own."}, {"userName": "Mandy J. Hoffman", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/1198438-mandy-j-hoffman", "userReview": "MY REVIEW:I have mixed emotion about this book.The book is about friendships, but the first half is more an auto-biography of Lisa's friendships. The last half of the book gives some meat to chew on as she writes about the difference between God's law and grace along with how to deal with conflict and and how to be real.I appreciate Lisa's honest and open sharing through out the book. It took courage on her behalf and for that I admire her. However, I felt overwhelmed by everything she shared in the first half of the book. While I agree with the overall principles that are spoken of, I don't agree with some of the psychology expressed within this book.Lisa does write an excellent explanation of God's grace and how it can change your life. And what she shares about dealing with conflict in chapter 11 is very helpful. There are some great resources in the multiple appendixes as well. There are some very encouraging parts in this book and some very heavy parts, too. Friendships for Grown-Ups is written for adult women and I would highly suggest that only adult women read it because of the emotional and deep content.* * * * *This review copy was provided courtesy of BookSneeze.com."}, {"userName": "Taffy", "userReviewDate": "May 12, 2010", "userURL": "http://www.goodreads.com/user/show/1145215-taffy", "userReview": "I received this book from Book Sneeze to review.Lisa Whelchel was sent to Hollywood when she was very young-by herself. Sometimes her mother or grandmother would stay with her a few days, but for most of her life, Lisa was alone and had learned to rely on herself. She closed her heart off so no one would get close enough to hurt her.This book is full of personal stories and advice. Lisa is also very religious and talks openly of her relationship with her Savior.There are three lessons on the flap:Lesson #1: It is Okay to be needy.Lesson #2: It is important to be needy with safe people.Lesson #3: It is helpful to know who the safe people are.At the end of the book, Lisa breaks each chapter down with ideas and questions to move her reader into safe and good friendships.I decided to try some of her advice to making and keeping friends. I set up a lunch date with two of my friends; texted my love to another and sent a message via Facebook to another. I hope this is only the beginning of me becoming a better friend as well.Rating: PGS: NoneV: NoneL: None"}, {"userName": "Daenel", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/1490198-daenel", "userReview": "Like many women my age, I grew up envying the relationships between Blair, Jo, Natalie and Tootie on The Facts of Life. I thought the relationships between the girls epitomized everything that a friendship between girls should be ~ loving, supportive and genuine. In my child’s mind, I didn’t realize that the friendships were fictional. Lisa Whelchel, who played Blair, writes: ”I think there is a certain irony in the fact that the television show I was on was all about female friendships, and yet in real life I had very little experience with close relationships.” This book is her exploration of what impeded her ability to develop close relationships and how she found healing and acceptance.Written in a casual tone, Friendship for Grown~Ups is part diary and part self~help book. Lisa asks challenging questions and provides thoughtful insight into a topic that can be overlooked in the day~to~day lives of “real” women: friendship. As busy moms, we know how important it is for our children to develop relationships with their peers but we often forget how important it is for us as adults too. Or, as in my case, we spend so much time focusing on our children that we forget how to develop/maintain friendships.I appreciated the honesty with which Lisa wrote the book. It had to have been difficult to be so vulnerable and expose past hurts. I believe that is one of the key points of Lisa’s book: It’s ok to be vulnerable. In order to develop and maintain friendships as adults, it involves a certain amount of vulnerability and trust. Like Lisa, I struggle with making and maintaining relationships because of a fear of rejection and thinking that I’m bothering people when I call (or text). Lisa offers a look at friendship from a Christian perspective and asserts that God allows us to be put into places of vulnerability to open our hearts not only to Him but to other women around us. Lisa encourages us to step out on faith and believe that God will place the right people in our lives at the right time.Disclosure: This is a Thomas Nelson Review. I received this book free through Booksneeze.com in exchange for a review. This did not influence my opinion of the book."}, {"userName": "Mediaman", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/12490048-mediaman", "userReview": "This mess of a book has a great concept--to help adults learn how to be better friends. But Lisa (who I happen to really like in her TV appearances) is a basket case in this book. She seems to think that none of the DOZENS of close friendships she talks about in this book are enough for her. She mentions friend after friend, always coming to the conclusion that she needs more. I'd say she has more friends and relationships than almost any person I've heard of. But she bursts into tears for no real reason and constantly is looking for one more person to dump her neediness on. All of this is written in an unorganized fashion with very few actual points made on how to develop adult friendships. She does allude to some things she has gone through but gives almost no details--she is so secretive that she withholds interesting information. Her first truly \"close\" female friend suddenly drops the friendship but we have no idea why. Her \"close\" male friend suddenly stops calling after she mentions that she thinks they are getting too close (though she never goes into detail)! Her second truly \"close\" female friend apparently told others some of Lisa's \"secrets.\" What are those secrets? We have no idea. Her third truly \"close\" female friend is an elderly spiritual leader who seems to do nothing but tell Lisa how great she is--so why is Lisa so insecure around the woman? There is so little substance here that after awhile you roll your eyes. Why write a book that supposedly tells about \"lessons learned along the way\" but you don't actually give enough details so we know how you learned them? What starts out as charming personality prose from a Hollywood star turns into a frustrating, repetitive trip to nowhere with someone who sounds incredibly insecure and resorts to spiritually glib phrases instead of truly opening up to her readers. Other than the idea that true friendships are typically formed out of hurt and humility, I ended up learning almost nothing about the book's subject. She's a sweetheart whose glow attracts people wherever she goes but seems to be truly unhappy with herself on the inside. And no amount of friends can change that."}, {"userName": "WifeMomKnitter", "userReviewDate": "Apr 07, 2010", "userURL": "http://www.goodreads.com/user/show/2383703-wifemomknitter", "userReview": "When this book was offered on BookSneeze and I read the synopsis, I knew I needed to read this book.From the Thomas Nelson Publishing website:\"Former Facts of Life star Lisa Whelchel shares her experiences of growing up without true friends and how she learned to find and develop them as an adult through God's grace.Not many people can say they lived their most crucial developmental years on the sound stage of a wildly popular TV show. But that's exactly what happened in Lisa Whelchel's life. As a child, she learned to guard her heart so tightly to avoid true hurt that she found herself unable to form lasting friendships as an adult.Friendship for Grown-Ups details her experiences of learning to come out of her shell, to trust, risk, and become vulnerable by God's grace and find meaningful friendships. Readers encounter her captivating story and refreshing perspective on life's most precious gift--and they find practical tips for their own friendships along the way.\"As someone who has never found friendship easy, I throughly enjoyed this book. I could relate to a lot of the struggles Lisa has gone through along the way.In the latter chapters of the book, tips are offered to make starting friendship, or continuing an old one, more comfortable. The best advice that I took away from reading this book is figuring out if the person you are friends with is \"safe\". \"Safe\" people as described in the book, in a nutshell, as those friends \"whom we can call and say 'This is how I'm really feeling, this is the way it really is, this is who I really am.' We want those friends who will accept us, just like that: all that we are, the good, the bad, the little bit of both.\" I think this has been my biggest problem all my life and what has made me, over time, hesitant to start new friendships. I now know the signs to look for and the things I need to improve upon in my own life to make myself a \"safe\" person for someone else."}, {"userName": "Lisa Kearns", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/17004615-lisa-kearns", "userReview": "I received this book free of charge from the Amazon Vine Program, in exchange for writing a review of it.I wasn't sure exactly what to expect from this book. I know Lisa Whelchel from her role in Facts of Life, and her Christian themed books on being a mother and a minister's wife. What I didn't expect was to read how lonely and insulated her life had been before she learned HOW to be a friend and to make friends. I can see how a celebrity would be surrounded by people who just want to brush up against fame, and how that would lead them to draw back and be distant.But I feel her struggles will resonate with many people in our fast paced world. People live in neighborhoods where they don't know their neighbors. Most women work outside the home, which leaves little time for socializing and building the deeper friendships our mothers and grandmothers did. And as in my case, many people move from town to town many times over their lifetime. This can have the effect of making people weary of starting over and reaching out to make new friends yet again. There have been times when I knew we would be moving again in a year, when I just didn't bother to put in the effort.I found Lisa's writing style honest and humble, and I liked the tips she shared and things she's learned as she matured and learned to trust. I especially identified with her struggle to ask for help and depend on people outside her family. It's hard for some people to understand that a friend feels more valuable and loved when she's able to come to your aid. Some of her anecdotes seemed rather personal, but they did add to the overall picture of a person who took many years to learn *how* to be a friend in more than a casual way.I plan to pass this book along to a friend of mine who just moved to a new city, and who is struggling to make new friends."}, {"userName": "Christina", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/174714-christina", "userReview": "This promised to be a great topic, but I didn't love this book. It felt unorganized and it is basically a lot of ramblings by Lisa about friendship with antidotes about things that have happened to her with other women. There is a lot of vulnerability and insecurity in her writing, but it didn't appeal to me because I just didn't identify with her neediness (some of her friends don't either). But for another person, this book might be a gold mine that helps them to break down some walls and open up with some friends. I thought the topics of \"grieving an interrupted friendship\" and \"how to identify a safe person\" were very helpful. There are great resources in the back which I wish had been interwoven into the book- discussion questions, practical suggestion, and other fun questions. The other books I've read by Lisa are all structured with questions and practical tips at the end of each chapter and this one is not- which is a very poor decision on the part of the editor and publisher since this is a \"help you make a change\" kind of book and some readers will not make it to the end to read these."}, {"userName": "Lana Jackson", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/7785185-lana-jackson", "userReview": "I read \"Friendship for Grownups\" after seeing it for sale on the website of Joyce Meyer Ministries. Lisa Whelchel is an actress, best known for her role as Blair, on \"Facts of Life\" TV series. Whelchel is married to a minister, a member of the Women of Faith team and author of several books in the Christian market.The book describes Lisa Whelchel's venture into developing deeper friendships. She invites the reader to accompany her on the journey and pick up any tips that might be helpful. There are several specific relationships described, some with good results and some with challenges. This is not a gossipy book, but one filled with Christian principles for loving and relating to people.It's an easy read, and Whelchel's conversational style is inviting and comfortable.Discussion questions in the back for each chapter make this a good book for private exploration, with a good friend or in a Women's Group setting."}, {"userName": "Paula", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5921082-paula", "userReview": "When I recently saw Lisa Whelchel at a Women of Faith conference, I was intrigued by her story about her struggle to cultivate healthy, adult friendships -I had never heard anyone who was so passionate about finding good friends! In this book, she expands upon that passion for good friends by taking the reader through her life experiences that shaped her view on friendships as a child up through to the present, \"Facts of Life\" and all. Lisa pours out her heart about her struggles and mistakes along the way, giving valuable insights that we all could apply and learn from. Though not as comprehensive on all the details that I would have loved her to expain, her account is nevertheless a refreshing look at developing lasting, positive friendships."}, {"userName": "Cary", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/19588540-cary", "userReview": "I loved this book! I'm not a self help reader at all, but for some reason this book grabbed me. I couldn't put it down but it might be because it spoke to me being I know what she went thru. This book is not meant to fix you but share her experiences. She walked it out, thru the pain, disappointments, fear. She didn't give up, all along the way, God was there and they had this friendship that was what helped her see the light at the end of the tunnel. This book was uplifting, full of meaning and real life. If like me you have these issues, it will make surface emotions you weren't aware of and it can be an uncomfortable read, but stick with it, it's worth it. I will read it again!"}, {"userName": "Kathy Eberly", "userReviewDate": "Jul 19, 2010", "userURL": "http://www.goodreads.com/user/show/3431820-kathy-eberly", "userReview": "Lisa Whelchel's latest book Friendship for Grown-Ups: What I Missed and Learned Along the Way is an honest journey of the relationships that Lisa has faced throughout her life as well as current ones. I enjoyed the scriptural references as well as the lessons that Lisa has learned during the course of her life in dealing with relationships. I believe that this is a must read for anyone who desires to make and keep friendships. It is a testament to the fact that God continues to nurture people and bring them to deep and lasting friendships in a day where relationships can often become temporary."}, {"userName": "Erin Martin", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/2874349-erin-martin", "userReview": "I'm not a self-help book fan at all but after hearing Lisa Whelchel speak at Women of Faith about women and friendship, I had to get this book. I learned the types of people I need to align myself with and those that I need to be leery of. She gave me permission to walk away from and forget those women in my life that are not the right friends for me. I learned the types of women I could confide in and those that need to remain \"surface level\" friends. Being friends with women is so hard but it's also incredibly important. A woman cannot be who she truly is without solid, Christian friendships. That was good to learn."}, {"userName": "Emily", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/50403035-emily", "userReview": "I wasn't sure what to think of the book written by \"Blair\" from facts of life. She was refreshingly real and made me feel better knowing that she has the same friend struggles as the rest of us. She is Christian and incorporates that alot into this book. So if you aren't ready to hear some Jesus, then don't read this book. I myself have an on again off again Jesus relationship and it was kinda nice to hear about friendships from that perspective. I liked this book more than I thought I would."}, {"userName": "Theresa", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/7525741-theresa", "userReview": "I wasn't in love with the first half of the book, it just wasn't meeting my need. But the last part of the book was extremely helpful with detailed info of how to identify safe friends who will reciprocate as well as how to try to be a better friend yourself. Some valuable info on recognizing if people indeed truly care, based on their actions etc. The very back of the book has a bulleted portion divided by chapters of practical things to grow good friendships. This was the best part of the book!"}, {"userName": "Annie", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/2277620-annie", "userReview": "This book was not what I expected, though I don't exactly know what that was. It was a written in a very folksy style which I found annoying and refreshing all at once. She relates her experiences back to Christianity and her faith, which was completely lost on me, which is not to say I didn't appreciate her point of view. It was thoughtfully written, but I would not recommend this to anyone who is not tolerant of Christian southern belles who cry a lot. Though I'm not sorry I read it, I probably won't read another by this author."}, {"userName": "Tasha enderby", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/2052897-tasha-enderby", "userReview": "I put this book on my to read list because it was recommended to me in the early fall by a speaker at our MOPS event. I thought it would have been much better then it was. I have no idea who Blair from the Facts of life was but this is more like her personal story and struggles. I did learn about the writer but again my desire for the book was to learn new and helpful was of deeping friendships and how to make them grow. My dear friend Karen bought me this book as a mentor gift and I will always cherish the book itself."}, {"userName": "Jodi", "userReviewDate": "Oct 11, 2010", "userURL": "http://www.goodreads.com/user/show/2822898-jodi", "userReview": "I think every female needs to read this book. It was extremly insightful and I found several failed friendships in there. I found that I try to be perfect and try to be everything to everyone to avoid any personal questions. I found that I want to hear friends hardships but avoid telling my own. Past experience made me fearful when past friends have shared secrets. It is very hard to find safe friends who know the real you."}, {"userName": "Alona Perlin", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/6842561-alona-perlin", "userReview": "This book was enjoyable. Lisa wrote and shared information in a way that made me want to be her friend. There is some information about how to build friendhips, but I would have liked more. She shares a lot on stories about her personal friendships, which I'm surprised that she is doing. The personal friendships are sometimes come off as a bit dysfunctional from both herself and the other party. However, she pulls it together at the end. It was a touching book."}, {"userName": "Shawna Ridgley", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/20862438-shawna-ridgley", "userReview": "The book was a brief look at Lisa's personal friendships over several years and the things she learned from her interactions with others. It also gave you a little look at her personal relationship with God and how He was/is tearing down walls in her heart to help her to trust others and to work on some personal issues she needed to address. I found it interesting and it really made me think about my own personal friendships and the way I interact with others."}, {"userName": "Stacy", "userReviewDate": "Feb 16, 2011", "userURL": "http://www.goodreads.com/user/show/180026-stacy", "userReview": "A good friend of mine let me borrow this book (after swearing on a stack of Bibles that I wouldn't bend a page or get it dirty or break the spine) and I believe God was working through her. Sometimes God just sends you the message that you need at the time that you need it. I won't write much more of a review because it is a personal book. Just know that I very much recommend it. If you are a girl who loves God and has friends."}, {"userName": "Mel", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/1064782-mel", "userReview": "The author's personal experience, or lack of experience, with close friendship. It was a feel good book about friendships, the hurt one experiences when we assume things or when a trusted friends burns us, and how to reconcile or when to cut the friendship forever. I liked the sweeping of the bricks topic; how to deal with something that could build a wall between friends and tear it down immediately and how to approach it delicately."}, {"userName": "Chalice", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/5583409-chalice", "userReview": "Very helpful and encouraging! Changed my life and my outlook as I have been searching for \"good friends\". There are some things that I have been doing wrong, and Lisa has a way of correcting without hurting your feelings. I feel like I can breathe again and know that I will eventually have good, close friends! :)"}, {"userName": "Rebecca", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/7504260-rebecca", "userReview": "I saw Lisa Whelchel speak at a Women of Faith event down in Denver and really liked what she had to say. A lot of this book really resonated with me. I think you grow as a person when you look at how your life experiences have shaped you into who you are today and what kind of friend you are as a result and use that knowledge to work through conflicts."}, {"userName": "Rayna", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/22550196-rayna", "userReview": "I loved this book because it helped me clarify and know how to deal with past and current hurts in the area of friendships. I do think if I wasn't in the midst of this situation, it wouldn't have affected me so much. I appreciated how I could identify with her feelings and it helped clarify my own."}, {"userName": "Dawne", "userReviewDate": "Mar 08, 2011", "userURL": "http://www.goodreads.com/user/show/3695863-dawne", "userReview": "This book spoke to me, I think, since I have so few friends. It broke the level of friendships down in a way that I am now better able to understand. This book isn't for everyone, especially since it is basing friendships in a more Christian way than some are comfortable with. For me, it was exactly what I needed."}, {"userName": "Kristin", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/307083-kristin", "userReview": "This book was TMI about Lisa Whelchel. The book had some good points but most of it was so uncomfortable to read. She is a very needy person and the things she would say and ask others were cringe worthy."}, {"userName": "Lynn", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/4312485-lynn", "userReview": "Sometimes it's nice to hear another womans perspective on the same challenges I have faced. Especially when she is also seeking Faith based answers and guidance along the journey. I enjoyed this book and find parallels to my own emotions, feelings, thoughts."}, {"userName": "Cristella Tolliver", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/5986414-cristella-tolliver", "userReview": "I have this book and it was great! she explains her life about friendships ! It helped me and I still go through it and read something to reference on ! you would not be disappointed by this book"}], "description": "Do you long for a true friend?Isn't that what we all want? To be seen, in all our glory, for better or worse, the good, the bad, and the ugly and still be embraced?If only such friendships were easy to find. And keep. For Lisa Whelchel and millions of others, friendship is a challenge. The vulnerability, trust, balance, grace, and time required to develop and maintain strong friendships do not come easily.Growing up as an actress in Hollywood, there were few people Lisa could trust, and even fewer to guide her. By the time she reached adulthood, she had learned to be self-sufficient. She was strong, she was “safe,” and she was lonely.One day, Lisa found that “the desire to experience connection was stronger than the desire to be safe.” She determined right then to finally understand friendship: how to create one, sustain it, and experience the sheer joy of having it. But it wasn’t easy.Since then, she has traveled the ups and downs of friendship, learning about herself, others, and the kinds of friendship God designed.A speaker, teacher, and compelling storyteller, Lisa writes from her heart and her head, sharing her story and helping women understand how to cope with the strengths and weaknesses of friendship, and basing all her advice on the foundation of our ultimate relationship with the Savior.", "title": "Friendship for Grownups", "url": "https://www.goodreads.com/book/show/7992644-friendship-for-grownups", "average": 3.62, "cover": "https://images.gr-assets.com/books/1400969077l/7992644.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/2579.Lisa_Whelchel", "name": "Lisa Whelchel"}], "type": ["Nonfiction", "Christian", "Self Help", "Christian", "Relationships"], "outlinks": ["http://www.goodreads.com/book/show/7992644-friendship-for-grownups", "http://www.goodreads.com/book/show/11492746-friendship-for-grown-ups", "http://www.goodreads.com/book/show/3806.Creative_Correction", "http://www.goodreads.com/book/show/714784.So_You_re_Thinking_About_Homeschooling", "http://www.goodreads.com/book/show/672220.The_Facts_of_Life", "http://www.goodreads.com/book/show/392296.Taking_Care_of_the_Me_in_Mommy", "http://www.goodreads.com/book/show/986149.The_Adventure_of_Christmas"]}