{"ratings": 7354, "userreviews": [{"userName": "Bettie☯", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Read by................ Terence HardimanTotal Runtime......... 5 Hours 28 MinsDescription: Margaret Parsons is dead. She appeared to lead a very dull life. She had been a \"good\" woman. Religious, old-fashioned, and respectable, her life had been as spotless and ordinary as her home, as unexciting and dependable as her marriage. However, it was not because of her life that Chief Inspector Wexford became involved, but her death. How is it possible that a woman who had led such a quiet, respectable, unspectacular life could have met such a death of passion and violence? To Wexford, it simply does not make sense, until he begins to slowly uncover the layers of Margaret Parsons' real life... Okay mystery, but the writing is wonderful. Looks like I will enjoy this series."}, {"userName": "Gary", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "This is the 1st book in the Inspector Wexford series by author Ruth Rendell. A good read that is written in an old fashioned style that introduces the main characters and sets up the series.In this opening mystery Inspector Wexford investigates the disappearance of Margaret Parsons, a housewife who goes missing and is later found dead in the nearby woods. Margaret Parsons appears to have no enemies and seems to live a quiet life with very little excitement. So the mystery is who has killed her and why? There is very little for Wexford to go on but for a discarded match and an inscription on some of Margaret's books signed 'Doon'. But who is 'Doon'.I am pretty sure there are better books to come in this series but this is a reasonable start."}, {"userName": "C.", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/10501026-c", "userReview": "It must have taken fifteen years to obtain the series volume I needed and get started. I want to enjoy a lauded authoress and have the jury out for Ruth Rendell / Barbara Vine. However, it is not the names that I grade. “From Doon With Death”, 1964, was dry. I hear her solo stories and other Reginald Wexford / Mike Burden cases are better; a good thing, because I own nearly them all, courtesy of bargain bins! Higher marks for higher enjoyment will mean something.I initially gave three stars, for an aspect I don't recall. Two stars make sense. Reginald was an asshole! That compounded with how much I hate things allegedly stated “quietly”! If you are annoyed by a colleague or subordinate, like the uniquely likeable Mike: a human being raises their voice somewhat, or at least expresses themselves emphatically. This “quiet” or “calm” idea is crap: as robotic as it is irritating! That presents no memorable personality and in this case, I was glad Reginald was not in the story until later; that Mike is an equal protagonist. Reginald was rude to Mike. He was very harsh, merely at Mike's posing of a question, or making a suggestion!The other downer is that no one else was likeable and a drabness pervaded. I surmise Ruth intentionally conveyed a depressed husband and household but that persisted too long, before the appearance of a clue brought any action at all. Finally, books belonging to that lady are inscribed with the titular name and we strive to suss out who that is. Tracking a lipstick tube was the only other clue picking-up a boring novel. The sole other interesting facet was how perplexing it was that this lady was killed. I will try Ruth's first solo novel next time."}, {"userName": "Nancy Oakes", "userReviewDate": "Feb 12, 2008", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "Update, May 6, 2015: I am undertaking a Ruth Rendell \"key\" works project -- the books The Guardian recently noted as such the day of Ruth Rendell's death. From Doon With Death is the first of these . I've just reread this novel again after six years, and while I wouldn't change my rating, I will say that it was definitely a pleasure to have taken it up again. This time through I've noticed much more than I did the first time -- back then I think I was looking much more for plot and storyline, where now I'm tending to focus more on people and what makes them do what they do. This book definitely meets my requirements. -- returning to original review now, but I still recommend this novel - it's much better the second time through. --There's a short section in the back of the edition of this book that I own which notes that Rendell did not follow along the Agatha Christie line and write mysteries based on characters of the upper class. Indeed, From Doon With Death, the first Wexford novel, focuses on the mystery of the death of a somewhat rather dowdy housewife who goes missing and then turns up dead. Margaret Parsons is the flip side of extraordinary; no enemies, lives in somewhat of a rut, and has no sordid qualities about her whatsoever. So why would anyone want this woman dead? Wexford has only a few clues: a spent match on the ground, and inscriptions in some of Margaret's books that are signed \"Doon.\" But there's no clue as to Doon's identity, so Wexford is baffled.For a series opener, it's a bit typical. What I mean is that having read other Inspector Wexford books, I know that the author takes time to more fully develop Wexford's character as the series progresses. Also, as a side note, don't forget that this book was written in 1964 and thus attitudes are a bit dated. Overall though, I love Ruth Rendell's work, and I'm very happy to have read this one.I'd recommend it to readers who enjoy a good British mystery with solid plotting."}, {"userName": "Susan Albert", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/967151-susan-albert", "userReview": "My reread of the first of the Wexford series was different than my first time through the book. Back then, in the early 1990s, I was a novice mystery writer eager to learn from a master. Now, I've written quite a few mysteries myself and I know what to look for. I read, now, for deeper glimpses into Rendell's craft, and I'm not disappointed. There's an art to writing a police procedural that is also a village mystery, and Rendell is the consummate artist. Her characters--even the good-guy cops--are conflicted, flawed, stubborn, and utterly human, and her genre fiction is the best of its kind. Absolutely."}, {"userName": "Azita Rassi", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/16744-azita-rassi", "userReview": "Predictable and charmless. This was my first Ruth Rendell and I started it with high expectations but was quite disappointed. The prose and epigraphs were good, which is why I’m giving this book a second star."}, {"userName": "Susan", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "First published in 1964, this is the first Chief Inspector Wexford mystery. For some reason I had never read the Wexford novels before and it is a good beginning to the series. The story begins when Inspector Mike Burdon is alerted by a neighbour that his wife is missing. Ronald Parsons almost prides himself on his dull and respectable life. He claims it is totally out of character for his wife, Margaret, to disappear without word. Burdon tends to agree and contacts the police station. When Margaret is found murdered, it is up to Wexford and Burdon to unravel Margaret's past and discover what led to the death of a quiet, suburban housewife.Although this book does feel a little dated, that adds to the charm. Although Ruth Rendell does use certain stereotypes, it is clear that she has laid down a great basis for further books - Wexford is plain talking, intelligent and not easily swayed by a pretty face; Burdon a great sidekick and the small town of Kingsmarkham well described. Unusually, Rendell does not make any of the characters particularly sympathetic and that adds to the reality of the crime and suspects. There is also a great twist and sharp plotting, which bodes well and makes me want to read on.The next book in the series is A New Lease Of Death: (A Wexford Case). However, I do agree strongly with other reviewers that this kindle book had a large number of typos, which is very disappointing. I am sure that a proof reader could have easily rectified the mistakes and, although I expect to see them in a self published book, it is unacceptable to find so many in a traditionally published ebook. However, the story itself was good and I am looking forward to reading more."}, {"userName": "Chaitra", "userReviewDate": "Jun 17, 2015", "userURL": "http://www.goodreads.com/user/show/9086236-chaitra", "userReview": "I've seen other reviews that say From Doon With Death is the least of Ruth Rendell's books. That's the good thing, because it's an unfair book. It hides information from the reader, and this information is vital to the solution of the case. It is not a case of intuition, it is the answer to the mystery in so many words, in a conversation between the detective and another party, to which the reader is not privy to. And yet, it is fairly easy to guess who the murderer is (although, it probably wasn't the case when it was first published). To be fair, it has a few things going for it. There is the open-minded attitude Inspector Wexford has towards people who are different from the majority. It is not a picture perfect little town, but is grimy and seedy. The people are not at all charming, and are often more than a little annoying. Also, there is no Hastings or Watson to romanticize the proceedings, and given how much I hate both characters, I'm adding a star just for that. However, it is clearly a first book. I know nothing much about Inspector Wexford or Mike Burden (who actually does decent work and doesn't go around contradicting or second-guessing his boss), just that they are the law. But the worst for me was the concealment of information, I don't like that at all. I will obviously read the rest of the series, but the start was a disappointment."}, {"userName": "Nancy", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/108416-nancy", "userReview": "I am a fan of classis murder mysteries yet was not familiar with Ruth Rendell's writing (nor have I seen Inspector Wexford on television). It seemed like it was time to get acquainted.Since this was the initial novel featuring Inspector Wexford, I suspect that as her series expanded, her detective grew more interesting to readers. I generally feel that when I've read three or more books featuring one character I enjoy each successive book a little bit more. That is an unnecessarily complicated way of saying that I'll try a couple more books by Rendell to see if they become \"must reads.\"Wexford brings a somewhat cold, calm, matter-of-factness to the investigation and that prohibited me from bonding with his character in any way. He was thorough and persistent but didn't seem very imaginative or particularly interesting. BUT, what was interesting, was the psychology of Rendells' characters; it sets the book apart from just being a routine who dun it."}, {"userName": "Linda", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/1740304-linda", "userReview": "[Mostly because of the time when it was published. Though having read a lot of Patricia Highsmith, it shouldn't have surprised me that much. (hide spoiler)]"}, {"userName": "Laura", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "From IMBd:Margaret Parsons, a fairly ordinary housewife who, with her water board official husband Ron, has recently moved to Kingsmarkham, is found murdered in a field. Mrs. Parsons led an extremely uneventful life, being a lay preacher, but Inspector Wexford is intrigued when he is looking through her belongings and fine a number of expensive antique books all inscribed 'From Doon to Minna'.Who is Doon?4* Going Wrong4* The Keys to the Street3* The Fever Tree and Other Stories4* A Judgement in Stone3* Fall of the Coin4* People Don't Do Such Things3* The Girl Next Door2* To Fear a Painted Devil3* Dark Corners3* Live Flesh4* The St. Zita SocietyInspector Wexford series:3* From Doon With Death (Inspector Wexford, #1) 3* Some Lie and Some Die (Inspector Wexford, #8)3* Shake Hands Forever (Inspector Wexford, #9)3* A Sleeping Life (Inspector Wexford, #10) 3* The Veiled One (Inspector Wexford, #14) 4* Kissing the Gunner's Daughter (Inspector Wexford, #15) 3* Harm Done (Inspector Wexford, #18)3* The Babes in the Wood (Inspector Wexford, #19)3* End in Tears (Inspector Wexford, #20) TR A New Lease of Death (Inspector Wexford, #2) TR Wolf to the Slaughter (Inspector Wexford, #3) TR The Best Man to Die (Inspector Wexford, #4) TR A Guilty Thing Surprised (Inspector Wexford, #5) TR No More Dying Then (Inspector Wexford, #6) TR Murder Being Once Done (Inspector Wexford, #7) TR Death Notes (Inspector Wexford, #11) TR Speaker of Mandarin (Inspector Wexford, #12) TR An Unkindness of Ravens (Inspector Wexford, #13) TR Simisola (Inspector Wexford, #16) TR Road Rage (Inspector Wexford, #17) TR Not in the Flesh (Inspector Wexford, #21) TR The Monster in the Box (Inspector Wexford, #22) TR The Vault (Inspector Wexford, #23) TR No Man's Nightingale (Inspector Wexford #24)"}, {"userName": "Scott K", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/3235620-scott-k", "userReview": "I wished I could say I like it but truth is it was a boring read. Being one who always gives everything more then one try, I imagine I'll read another of Rendell's books but will not be in a hurry to do so.I could never really get into any of the characters especially Inspector Wexford. The ending was good but all the events leading to it never reached a level of suspense where it was hard to put down. In fact it was quite easy to put down and almost became a chore to finish. A short book of only 191 pages took me twice as long to read a 300+ page book.Oh well not every book can be must read and 'From Doon With Death' certainly fell short of 'must read' stature"}, {"userName": "Lewis Weinstein", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "This is the first book by Ruth Rendell I've read (I know, shame on me). I was about 2/3 through, thinking it was well written, interesting, but not yet sensing it was truly special. My feeling, however, was that I should wait to see how she resolved it before reaching a conclusion. WOW! I have become a fan."}, {"userName": "Amy", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/5684259-amy", "userReview": "I will definitely read more of the series. This one wasn't marvelous but I could see a lot of potential for her to develop the inspector into a great character."}, {"userName": "Lisa", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/17591646-lisa", "userReview": "A very enjoyable cosy mystery - the first in the Inspector Wexford series"}, {"userName": "Bandit", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "I dislike detective series, I find it to be lazy writing more often than not and generally stay away from them. However, no one would accuse a career as prolific as Rendell's as lazy and there is something very appealing about her work. I think this book was a terrific example of it. Seemingly a classic British murder mystery, much like Christie, whom Rendell apparently disliked and strived to get away from comparisons to, and yet in retrospect very different. Rendell's England is less than quaint (despite the amounts of tea put away), her world is distinctly darker and its denizens are distinctly more immoral. There is a strong sociological commentary throughout, in this book in particular as far as class differences and sexual politics go and author's attitude is stunningly, notably progressive for the time. Wexford doesn't really make a strong impression as a leading character (in fact quite a good amount of the investigating falls to his partner, the aptly named Inspector Burden), but he shows much potential, intellectual and emotional astuteness and solid detecting skills. And so, for a non quaint, psychological mystery that relies on neither sex nor violence, this is a very good read. Recommended."}, {"userName": "Kristen", "userReviewDate": "Mar 29, 2014", "userURL": "http://www.goodreads.com/user/show/1071692-kristen", "userReview": "If you love classic and timeless British mysteries, you'll love the first one in the Wexford series by Ruth Rendell. In From Doon With Death, it's up to Inspector Wexford and Detective Burden to discover who killed Margaret Parsons. They dissected and examined every piece of her life that went back to her childhood. The closer they get to the truth, the more puzzling it appears to them on who's lying and who's telling the truth. It all stemmed from that ancient book collection and the inscription. In this fast-paced British mystery, there's lots of twists and turns with a shocking conclusion in the end."}, {"userName": "Gabi Coatsworth", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/5890137-gabi-coatsworth", "userReview": "Dated, but fascinating This book was published in 1964, and is well worth reading for those who like crime fiction, and for people interested in seeing how social mores and attitudes have changed since then. Characters are stereotyped very often, housewives must all be polishing their front doorsteps on their knees, the police force is all male, Inspector Wexford walks to work. It's a different world, but the novelist's eye isn't judgmental. Not a great novel, but a very promising debut in its time."}, {"userName": "Jonayla", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/57073911-jonayla", "userReview": "Me ha gustado. Entretenido y rápido de leer. Una cosa que me ha gustado es que el inspector, que es quien lleva el caso, no lo lleva él solito, como ocurre en la mayoría de novelas de detectives, sino que cuenta con un equipo que hace algo productivo. En ese sentido, me parece que le añade una nota de realismo. También me gusta el final, da un giro interesante, inesperado prácticamente hasta ese momento. Libro recomendable, creo que en algún momento leeré más de esta serie."}, {"userName": "Agosto2010", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/5050618-agosto2010", "userReview": "Ruth Rendall, Con la morte nel cuore, giallo classico. Primo giallo con protagonista l'Ispettore Wexford.Giallista poco conosciuta in Italia, ma dello stesso calibro della Christie; ambiente provincia inglese.Se non amate i gialli splatter questo è per voi"}, {"userName": "Shom Biswas", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/6651626-shom-biswas", "userReview": "Ruth Rendell is the high-priestess of the country police procedural, and one of the most important names in detective fiction. Her Inspector Wexford is an important mention in the canon of detective fiction. Perhaps what is the most impressive about Ruth Rendell is her exemplary consistency. She has written volumes and volumes of mysteries, but rarely has her standards fallen — one can pick up an Inspector Wexford novel, and be fairly certain of a jolly good ride. And she was not repetitive either — she wrote under the pseudonym Barbara Vine for psychological crime novels, a marked difference from the Inspector Wexford whodunits, and those are rather good too.Since our recommendation From ‘Doon With Death’ is the first in the series, it would be remiss not to give an introduction to Inspector Wexford. Chief Inspector Reginald Wexford is a middle-aged country policeman. He has a temper, and is not a man to suffer fools lightly. He is a large, ungainly man; grumpy and somewhat curmudgeonly. Just an ordinary policeman, with a stay-at-home wife and two daughters. An ordinary man, doing a job. The standardfare bumbling country policeman? Not quite. Wexford in extremely well-read, he has got a rapier-sharp intellect, is meticulous in his attention to detail, and most importantly, is remarkably persistent.From ‘Doon With Death’ starts with the murder of Margaret Parsons, a somewhat frumpy, timid woman from Kingsmarkham. She was the epitome of nondescript: conventional, religious, homely and pretty much devoted to her husband, her garden and her church. Her life was an open book, and truth to be said, not a particularly interesting one. The first question the reader will have to deal with is — Who would ever want to murder her? But murdered she is: strangled to death, her body abandoned.As the Inspector investigates the case further, a secret from Margaret Parson’s past life tumbles to life. There’s a stash of books in her library, all of which have passionate notes of love inscribed in them by a former lover, only identified as Doon. Who is Doon? The resolution to the crime hinges on that question, and Inspector Wexford goes about to get to the end of it.From ‘Doon With Death’ might not be as startling for today’s reader as it might have been for ones who read it in 1964, the year the novel was released, but it is still a mighty fine yarn. It’s a very satisfying detective novel, standalone, and a fine start to an important detective series.First published at The New Indian Express."}, {"userName": "Alexander Inglis", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/4150876-alexander-inglis", "userReview": "This year Chief Inspector Reg Wexford celebrated his 23rd novel (The Vault), if one may put it that way for a fictional character; and he was \"born\" in Ruth Rendell's 1964 published From Doon With Death. It was also, more remarkably, Rendell's first novel which emerged full shaped, well plotted, with believable (and memorable) characters.Margaret Parsons is the rather non-descript wife of a rather non-descript employee of a small English town hardware store who is barely able to make ends meet. But when she doesn't come home one afternoon, her husband asked Mike Burden, a neighbour, for help: Burden is Chief Inspector Reg Wexford's right-hand man. It's not long before fear turns to grief as Margaret's body turns up in a nearby wood, quite dead. As the investigation progresses, the facts of her final hours are peeled back, onion skin like, and as other local residents come within the orbit of the investigation, new clues emerge pointing to teenage love affairs re-ignited. Particularly mysterious, is Doon who authoured several frankly amorous inscriptions in the flyleaves of Margaret's packed away books of poetry. Now Doon appears to have re-entered her life ... with love to be rekindled or vengeance?Although police procedurals are commonplace today, this early outing snaps along at a goodly pace, without unnecessarily forensic details or gore to bog down the storyline. I admit I had a pretty strong clue who the killer might be by about the book's mid-point, it in no way interfered with the pleasure of the working out and final revelations. This is a first rate crime fiction tale that sets one up, mouth watering, for the next in the series."}, {"userName": "Tony", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "FROM DOON WITH DEATH. (1964). Ruth Rendell. ****.\tThis is a must read book – if only because it was the first Chief Inspector Wexford novel written by Ms. Rendell. It is a little weak in plot, and, typical of first novels, full of too many characters, but the underlying talent of the author is apparent. It addresses a principal social concern in addition to telling a complex story of murder and passion. Rendell’s books – at least those involving Inspector Wexford – always manage to revolve around some social issue. I can’t say what this one is without giving away the ending of the novel, but it will come as a partial surprise when you reach it. We soon learn that Wexford was born full-blown from the author’s mind. When we first meet him, Rendell lets us know that he is fifty-two years old. He is also teamed up with Inspector Burden, his faithful ally in subsequent novels, and he works out of the central station in the small town of Kingsmarkham, a town that, for its size, seems to spawn most every kind of murder and mayhem that you might expect from a London. If you are at all a Wexford fan, this book is key to learning who he is early on in his career. Recommended."}, {"userName": "Bam", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "When I learned that Ruth Rendell had passed away recently, I was reminded that I have been wanting to give her mysteries a try for some time and immediately requested this book, the first featuring Inspector Wexford, and her first stand-alone mystery, To Fear a Painted Devil, from the library. Both were first published in the 60s and seem a bit dated, especially the moral issue at the heart of this story, which probably seemed terribly shocking in 1964 but not so much fifty years later. This was a rather slow-paced police procedural, in which Wexford and his sidekick, Burden, investigate the murder of a young married woman who was found strangled in the local woods after being reported missing by her distraught husband. Was she meeting a lover? Perhaps someone from her past? A clue pointing that way is found in a trunk in the attic--several books with loving inscriptions from someone named 'Doon' dated years earlier. 2.5 stars rounded up. I admit to being a bit underwhelmed by this first installment in the series. The characters didn't intrigue me and her attempt at a plot twist fell flat since I'd already guessed the who and why. But Rendell's Wexford series has a great reputation so I'll probably try a few more before deciding to give up on the series."}, {"userName": "Cathy", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/7566073-cathy", "userReview": "I had never read Ruth Rendell and had only vaguely heard of her when Scott Throw, in an interview, said she was the one mystery writer he always read. I love British mysteries, they're so civilized. Rarely are people shot, they are usually killed quite discreetly, the detectives go around asking polite questions over tea, nothing blows up and at the end they sit down and explain it all clearly in case you dozed through an important clue. This is Rendell's first mystery, written in the '60s, and her critics don't consider it her best (her inspector sits down and explains it all in the last chapter), but she has been called the World's greatest living crime writer. She's certainly up there. Her characters are great and apparently in her newer stories she takes on lots of social change issues. Kate Atkinson is still my favorite mystery writer but Rendell is a very close second."}, {"userName": "Mike Gabor", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/6647268-mike-gabor", "userReview": "Margaret Parsons is a quiet young English housewife. She is found strangled to death in the woods one day and Inspector Wexford is looking into the case. Margaret and her husband lived a very quiet life and really had no friends to speak of. There aren't many clues until Wexford discovers some books in the attic of the Parson's home that are inscriped to Margaret by someone named Doon. Wexford then starts investigating Margaret's past hoping it will lead tom her killer.This is the first Inspector Wexford novel published in 1964. It's a pretty well straight forward police procedural but you can see the unique style of Rendell's writing starting to come thru. The ending was also a bit of a surprise considering the time in which the book was written. There's also a very insightful afterwards written by Daniel Mallory."}, {"userName": "Bill", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/4380068-bill", "userReview": "I have read one other Inspector Wexford mystery but this is the first in the series. I enjoyed the style and the characters; Wexford can be a grumpy, frustrated inspector at times, but also sympathetic as the case needs. The story isn't a cozy mystery, but also not graphically violent. Basically it involves a missing wife and the later discovery of her body and the follow-on investigation. But the story is crafted very well and a enjoyable to read, flowing nicely from situation to situation. I will say I had the general suspect and rationale figured out but it was nice to have it explained more succinctly and clearly. Enjoyable first book and I do look forward to getting to know Wexford and his team better."}, {"userName": "Bevan Lewis", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/18338419-bevan-lewis", "userReview": "Ruth Rendell's first Wexford novel bursts on the scene fully formed. The language is beautiful, and the form of the police procedural (an archetypical example of the Morse/Barnaby generation) fully realised from the beginning. The debt to Christie is clear - the setting of the village with it's archetypical 'types' and class divisions. What I really savoured was the eye for detail and simply beautiful language. The performance on Audible by Terrace Hardiman is superb."}, {"userName": "Mary Manuel", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/15653471-mary-manuel", "userReview": "I love the books I have read under her other pen name Barbara Vine, but I have read all of her Inspector Wexford books because I enjoy his character and wisdom and following his interesting family life. This was just the beginning of a delightful series, I just began the most recent one and 24th Wexford, \"No Man's a Nightengale\" I would recommend this series to anyone who is looking for a great British mystery."}, {"userName": "Annie", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/16568983-annie", "userReview": "My first inspector Wexford, and what a marvel!The intrigue is perfect, the suspense dense and the options so numerous it was nearly impossible to get a clue till the very last pages!Now, I want to read all the series!"}], "description": "Dazzling psychological suspense. Razor-sharp dialogue. Plots that catch and hold like a noose. These are the hallmarks of crime legend Ruth Rendell, “the best mystery writer in the English-speaking world” (Time magazine). From Doon with Death, now in a striking new paperback edition, is her classic debut novel -- and the book that introduced one of the most popular sleuths of the twentieth century.There is nothing extraordinary about Margaret Parsons, a timid housewife in the quiet town of Kingsmarkham, a woman devoted to her garden, her kitchen, her husband. Except that Margaret Parsons is dead, brutally strangled, her body abandoned in the nearby woods. Who would kill someone with nothing to hide? Inspector Wexford, the formidable chief of police, feels baffled -- until he discovers Margaret's dark secret: a trove of rare books, each volume breathlessly inscribed by a passionate lover identified only as Doon. As Wexford delves deeper into both Mrs. Parsons’ past and the wary community circling round her memory like wolves, the case builds with relentless momentum to a surprise finale as clever as it is blindsiding. In From Doon with Death, Ruth Rendell instantly mastered the form that would become synonymous with her name. Chilling, richly characterized, and ingeniously constructed, this is psychological suspense at its very finest.“One of the most remarkable novelists of her generation.” —People“She has transcended her genre by her remarkable imaginative power to explore and illuminate the dark corners of the human psyche.” —P.D. James", "title": "From Doon With Death\n      \n          (Inspector Wexford #1)", "url": "http://www.goodreads.com/book/show/748989.From_Doon_With_Death", "average": 3.67, "cover": "https://images.gr-assets.com/books/1178000150l/748989.jpg", "reviews": 511, "authors": [{"url": "https://www.goodreads.com/author/show/10890.Ruth_Rendell", "name": "Ruth Rendell"}], "type": ["Mystery", "Mystery", "Fiction", "European Literature", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/748989.From_Doon_With_Death", "http://www.goodreads.com/book/show/1821522.From_Doon_with_Death", "http://www.goodreads.com/book/show/18964357-from-doon-with-death", "http://www.goodreads.com/book/show/11341010-from-doon-with-death", "http://www.goodreads.com/book/show/6632888-dedicatoria-mortal", "http://www.goodreads.com/book/show/20553211-con-la-morte-nel-cuore", "http://www.goodreads.com/book/show/7314642-from-doon-with-death", "http://www.goodreads.com/book/show/31335006-from-doon-with-death-a-chief-inspector-wexford-mystery", "http://www.goodreads.com/book/show/4469592-un-amour-importun", "http://www.goodreads.com/book/show/83412.A_Judgement_in_Stone", "http://www.goodreads.com/book/show/83409.The_Babes_in_the_Wood", "http://www.goodreads.com/book/show/83407.Kissing_the_Gunner_s_Daughter", "http://www.goodreads.com/book/show/83410.A_Sight_for_Sore_Eyes", "http://www.goodreads.com/book/show/918924.The_Water_s_Lovely", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}