{"ratings": 995, "userreviews": [{"userName": "S.M.", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/2638326-s-m", "userReview": "Loved that Breena is becoming ever more confident with her role as the Summer Queen. The addition of new creatures into the Fey War \"to End All Wars\" (mermaids, minotaurs) is very interesting and holds my attention for the new installment in the Fall. The end of the book reminded me of the final battle scene of the Lord of the Rings trilogy. I wondered if Gandolf was going to ride over the hills to charge into the chaos. Wish we could have had a bit more of the turmoil from each character in the battle, but I guess we will see more of the war in Midnight Frost. On a negative note: I hurt for Logan and hope Ms. Gow will provide him some relief in the future. Reading about his anguish is heartbreaking for me. I so enjoyed reading the novella, The Wolf Fey, which provided some background story that was addressed in Frost Kisses. I wish Breena had known all of who Logan was and is prior to coming to Feyland. Can't help but wonder if this could have changed circumstances ....Overall, an entertaining fast read."}, {"userName": "Hope York", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/4832135-hope-york", "userReview": "I don't know how much more drama I can read before I lose interest. I was ready for this book to be over not because I was excited to see what happened, but because I got bored reading it. She loves Kian without a doubt.... I think. Then Logan comes around and she loves him too....I think... Enough with the triangle I'm over it. The war of the seasons? Uhm no. I'm not even sure what they're fighting about anymore. Ready for the series to be over. Usually the books get better but not in this case."}, {"userName": "Catherine", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/1296761-catherine", "userReview": "This series just keeps getting better and better. I still don't see how Breena can make the choice between Kian and Logan, I love them both so much & both are so right for her. There has to be a way in the upcoming book (or books) for Logan's prophecy to come true. He so deserves some happiness! I loved this book and can't wait to see what happens next. :)"}, {"userName": "Christie", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/4255853-christie", "userReview": "4 books in a week is all i have to say. it would have been 4 books in 3 days but working full time and being on a softball team isnt easy. this book was delicious! i didnt want to finish it so soon being that the next book doesnt come out for another few months but i couldnt take it, it had me totally engulfed. so many things happen in this book, i just cant see how the next one would fail."}, {"userName": "Jessica", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/4290273-jessica", "userReview": "Yes I really like this book but MY GOD I am getting so sick of this Crazy love triangle one minute she will be Kian is the love of my life and then the next but how can I deny Logan then she'll say it has always be Kian I have dreamed of him all my life but I grew up with Logan we almost kissed before I met Kian. If she is having this much trouble obviously she doesn't know what love really is and she is not only hurting herself but she is REALLY hurting the guys and one is going to be seriously heart broken he'll never want to see her again. At least if I was getting played like this and really loved a person and they didn't chose me in the end I sure as hell would be pissed. But other then this issue which isn't really major just bugs me I'm loving the series, in this book it is about Breena coming back to life (thanks to Kian which we find out more in the end) and finding out that the pixes have taken over then summer court. So Breena along with Logan and Kian they find a way to take back the kingdom and an all out war breaks out between Winter and Summer only Winter has allied themselves up with the Pixes and Dark Hordes so it is not looking to good for Summer. Can't wait to find out what happens in the next book!"}, {"userName": "Kate (VerbVixen)", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/3748370-kate-verbvixen", "userReview": "Gow, an indie author, weaves an interesting and intricate tale of a paranormal world where Fae, Pixies and Werewolves abound. I devoured the first four books in the Bitter Frost series in a single night. Bitter Frost, Forever Frost, Silver Frost and Frost Kisses were that good. I felt compelled to know what happened next and entrenched myself in the story of Breena, Kian and Logan. My real disappointment however is that each book feels like a abbreviated read. The four books could have been combined into two without cutting any narrative. Additionally, I have to wait for the next book! I hate waiting, especially when I read all 4 others in so short a span of time."}, {"userName": "Jessica (BookRockGoddess) Bolton", "userReviewDate": "Feb 13, 2011", "userURL": "http://www.goodreads.com/user/show/2503163-jessica-bookrockgoddess-bolton", "userReview": "I love Kailin Gows books and Frost Kisses is no exception. She is an amazing author who can weave her magic so throughly that you feel as if you are there. I find my self so immersed within her books, that when it is over I feel a little lost and sad that I will not be able to reenter until the next book in the series. That is how much her books pull you in. I can not say enough good things about her so if you have not read her books you are truely missing out on an amazing experience."}, {"userName": "Kathryn", "userReviewDate": "Dec 01, 2010", "userURL": "http://www.goodreads.com/user/show/2748124-kathryn", "userReview": "OK...just like every book with this series, I could not put it down. It just keeps getting better and better. I am ready for the next one with the cliffhanger at the end, plus I love the choice that Breena made!!"}, {"userName": "Stacey", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/4646347-stacey", "userReview": "Brenna is becoming a stronger woman in this book, still had all the drama of the politics in Feyland and the dangers. Was a very easy and entertaining read!"}, {"userName": "Suzanne", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "Loved it! My favorite of the Frost series so far! Can’t wait for Midnight Frost!"}, {"userName": "Emma (BelleBooks)", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/4783841-emma-bellebooks", "userReview": "This is the fourth book in the Frost series, I am so glad to be finally catching up with it as well!This time around we see Breena finally discover the truth about who is really behind the war in Feyland between the winter and summer courts. Breena, Kian and Logan put their differences aside and work together to bring down the pixies and put a stop to the war.SQUUUUUUUUUEEEEEEEEEEEEEEEEEEEEEEE!It's all I can really, I love love loved this book! Just when I feel as if I actually know the characters and all the goings on in Feyland, Kailin Gow turns things topsy turvy with Frost Kisses!After coming back from the dead, literally. Breena is more sure of herself, her magic and is a much stronger person. I love strong female leads in YA, so Breena being even more confident in herself and her magic was a big plus in my books! We also get to see more of the Wolf Fey and Logan, who is really starting to grow on me after reading this book . I was always team Kian from the start, but now I'm not so sure. Logan has a lot of qualities that Kian doesn't, and vice versa. Oh it's just such a confusing love triangle!I love all the romantic drama though, to me that only adds more excitement to the plot.We also get to see a bit more of the evil pixies in this book. Yes I can read, I know what they have been planning. But at the same time I feel bad for them, I really hope they Fairys and Pixies can come to some kind of agreement by the end of this series.Maybe I'm just in too nice of a mood today, but I want Feyland to be filled with happiness and no more wars.Overall I really enjoyed this book and am super excited to get my hands on the next book in the series!"}, {"userName": "Cristy", "userReviewDate": "Apr 05, 2011", "userURL": "http://www.goodreads.com/user/show/3779025-cristy", "userReview": "FROST KISSES was a step back for me. Although I’m an avid reader of the YA genre, I struggled with the high drama of this younger series through the first two books, then was surprised and encouraged by how much I enjoyed the 3rd book, now unfortunately FROST KISSES was yet another challenge to complete to the end. With the stronger storyline and gripping cliffhanger at the end of the last book SILVER FROST, I had high hopes for the series to really take off… sadly that was not the case. There is a lot of what feels like repeat plots going on. Kidnapping by Pixies and others?... check! Wounded on the brink of death, then healed?... check! Breena’s undying love for Kian?... no I mean Logan?... check!... et cetera, et cetera. Can anyone say déjà vu? At this point I’m undecided whether to continue on in this series or not. If the next book MIDNIGHT FROST will conclude the story, I’ll probably pick it up to see how it all ends, but if there are still many books to come I might have to say my goodbyes to the Frost series here and now."}, {"userName": "Meghan", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/9287838-meghan", "userReview": "I think I'm out. I invested the $ for 1st 4 books, but I don't think I can handle anymore angsty teen love drama. I mean its cute and stuff, but I feel like this is a ping pong game. Bad guy, good guy, war, peace, war, peace. No one ever really dies, tons of second chances, I'll sacrifice myself for love, no, I'll sacrifice myself for love, oh what have we done? I can't go on without you- blah blah blah. Hey I know, let's let the bad guys live again and again so they can cause trouble again and again. No! If u had chopped flynn, Delano, balthazar and wort's heads off when you had the chance (and u did have the chance at least once with each of them)none of this would be happening."}, {"userName": "Beth", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/2225893-beth", "userReview": "There were a lot of things happening to Breena in \"Frost Kisses\"; but at the same time we get a sense of who (or should I say what) is truly behind the war in Feyland. Very dark and sinister things happen in this book; but also there was plenty of love, light, and \"magic\" moments. Without revealing too much, let's just say that surprising events occur- some happy, some enlightening, and some very sad. Ultimately, we learn that \"LOVE\" is not the enemy in Feyland, but the driving force behind truly saving it. The question is, can Breena do it? We are left wondering as \"things\" take flight at the very end."}, {"userName": "Kelly", "userReviewDate": "Oct 17, 2011", "userURL": "http://www.goodreads.com/user/show/6369412-kelly", "userReview": "I keep hoping this Frost series will get better... and I just keep getting underwhelmed. I love so many parts of this world- the characters, the backstories, the courts. But none of it ever comes together and that just kills me. The way Gow writes Breena.... she is the most simple-minded girl ever. I mean, come on! And the flip-flopping between the guy is getting stupid already. Ugh... That said, I will continue on in the series, I don't even know why... I guess I'm just a sucker for a hot faerie guy with a sword...."}, {"userName": "Roberta Gellelhoo.com", "userReviewDate": "Sep 30, 2013", "userURL": "http://www.goodreads.com/user/show/14993384-roberta-gellelhoo-com", "userReview": "The story started good with the first book but it seems to be dragging on always the same problems like going around and around. There are some eleven books in this series but I'm going to stop here cannot be bothered to find out what happens. The English is badly written as well I would expect to read better English then this seeing as the series is for young adults. I usually love books on fairies but this could have been written much much better...."}, {"userName": "Angie", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/4964628-angie", "userReview": "Well, I tried and tried to finish this book but I just couldn't get through it. I think this is the first time I have ever completely given up on a book! I got a little excited at the end of the last book in the series when the MC was stabbed, but low and behold she didn't die. Its really the same old plot, same old whiny teenage fairy queen. Logan was the only one who was the slightest bit interesting."}, {"userName": "Alyssa Hull", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/23001190-alyssa-hull", "userReview": "I just finished the series and though satisfied with the ending, am wishing for more. The book had many emotions and was exciting all the way through. I highly recommend reading this book if you enjoy fantasy and romance. Especially fairy stories. Definitely put this as one of my favourite book series."}, {"userName": "Misty", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/3462016-misty", "userReview": "another instant success by kailin gow!!! I have loved her other books and this one kept me on the edge of my seat just like her other books.we learn more about the characters in this book and of course the love triangle gets more and more pronounced.I cannot wait to finish this astonishing and amazing series of books."}, {"userName": "Pamela Talley", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/28341803-pamela-talley", "userReview": "Just when I thought I knew...Kailin Gow has created a wonderful world of fairies, pixie and werewolves. Great twists and turns to keep you guessing. So glad I have the next book."}, {"userName": "Aeron Trahaearn", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/36193674-aeron-trahaearn", "userReview": "okaaaaaaaaaay...even though during half of the book i feel like maybe i dont wanna read the next book in the series cuz there's to much drama i cant stick to my resolution cuz at the end of each book is a magnificent cliff hanger that makes it impossible to leave the story alone..."}, {"userName": "Heather", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/6923469-heather", "userReview": "I love the story Kalin has written with Bree and Kian. Hoever, this book leaves you hanging could have been attached the previous three. These are quick reads and more like a long Novella. Good thing I am reading these after their release date."}, {"userName": "Celeste", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/4097117-celeste", "userReview": "This 4th book was even better than the last! The characters have much more depth at this point, but I would still have loved to go in a little deeper with all the relationships-these books are fairly short."}, {"userName": "Cecilia", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/5197332-cecilia", "userReview": "i absolutely love this book."}, {"userName": "Jessie. D", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/5144928-jessie-d", "userReview": "The front cover off this book llooks really good ihope the story is good as well :)"}, {"userName": "Amanda", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/19368779-amanda", "userReview": "also a great book... im falling more and more in loce with this series... a love triangle, a devastating war... brilliant"}, {"userName": "Joanna", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/2356205-joanna", "userReview": "Looking forward to book 5!"}, {"userName": "Lyndsey", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/4474867-lyndsey", "userReview": ""}, {"userName": "Sharee", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/14599380-sharee", "userReview": "I really wanted to like this series.. but the same things keep happening over and over. And it's just not worth the money to buy the 11 books in the series to find out what actually happens."}, {"userName": "Niyati", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/5442043-niyati", "userReview": "awesome series.............waitin for midnight frost........"}], "description": "Feyland is thrown into turmoil once again as the Summer Queen Breena s fate leaves the land of strong, beautiful, and dangerous fairies in chaos. An emerging danger has arisen deep in Feyland, and all must take sides. Sacrifices will be made, and not everyone will survive. How far would you go for love? Also included in Frost Kisses is the first chapters of DESIRE, a new Dystopian Series from Kailin Gow.", "title": "Frost Kisses\n      \n          (Frost #4)", "url": "https://www.goodreads.com/book/show/9704165.Frost_Kisses__Frost__4_", "average": 3.99, "cover": "https://images.gr-assets.com/books/1327889546l/9704165.jpg", "reviews": 32, "authors": [{"url": "https://www.goodreads.com/author/show/78111.Kailin_Gow", "name": "Kailin Gow"}], "type": ["Young Adult", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/9704165-frost-kisses", "http://www.goodreads.com/book/show/10796252-frost-kisses", "http://www.goodreads.com/book/show/8069816-bitter-frost", "http://www.goodreads.com/book/show/13425784-loving-summer", "http://www.goodreads.com/book/show/8627927-forever-frost", "http://www.goodreads.com/book/show/8592303-pulse", "http://www.goodreads.com/book/show/15716628-never-say-never"]}