{"ratings": 77, "userreviews": [{"userName": "Pamela", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Although Noah's Ark is a key topic repeated throughout, Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond, it is a secular, travel-adventure-memoir regaling the author's experience climbing Mt. Ararat - which was oddly, anticlimactic - and Antonson's journeys exploring Kurdish, Turkish, and Armenia histories/societies throughout the region, inquiring about differing flood stories and geographical conflicts, and experiencing their lifestyles, while as a guest in various hotels and homes. Antonson eventually ventures into Iraq. Quite recklessly, I might add, in terms of planning and border crossing nativity. There's a fine line between fearlessness and recklessness; foolhardy smugness being the divider. His time spent with the family in Erbil, however, was endearing. One of the high points in the book. Cultures and language need not be the same, or even remotely similar, to unite in the common ground of respect, grace, and friendship. Arriving back in Turkey safe and sound, after a bit of jocular hither and yon adventure, the author then forays into London to view the \"Flood Tablet.\" Another anticlimactic moment, as he doesn't express much emotion or expound on the significance of it to him personally. Then again, maybe he's not an emotionally expressive individual. Overall, the book is well written, intelligently expressed and conversationally accessible. Many photographs and maps are included. It was an interesting book. Not exactly what I was looking for in terms of content or tone, but basically enjoyable. THREE *** Journalistic Styled, Travel-Adventure-Memoir *** STARS"}, {"userName": "Todd Stockslager", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/43477226-todd-stockslager", "userReview": "Review title: Head east on the Silk Road, hang a leftJust to the north of the fabled Silk Road that linked Europe, Africa, and Asia in trade, religion, culture, language, and war, stands Ararat, a range of mountains that carry their own weight of history. It is here that the Bible and other ancient sources say that the world was repopulated after God swept the world clean. It is here that the evil of genocide burst forth in its 20th century form as the newly empowered country of Turkey systematically murdered and displaced over a million Armenians from disputed territory in the wake of the first World War. And it is here the modern national borders of Iraq, Iran, Turkey, and Armenia today meet across ethnic and religious boundaries thousands of years old. Ethnic Kurds, of all religions and spread across all these nations, hope for their own national home some day. Armenians, confined to a small landlocked country today, hope for expanded borders including the return of the Mount Ararat holy site and access to the Black Sea. And Christians and others who believe in the historicity of the ancient flood accounts, hope to find physical, geological, or archeological evidence on that mountain to back their faith. For all these reasons, professional traveler Rick Antonson fulfilled a childhood ambition by visiting this foreboding and volatile region in 2013 and \"summitting\" Mount Ararat. While his book is partly an adventure story about the climb to the 16,000-plus summit, that event is complete just halfway through the book, with plenty of history,, culture, and further travel adventures to come. Crossing into and out of northern Iraq proved to be both a rewarding and harrowing experience, and makes for page-turning reading. Like the authors of the decade or so earlier journey In the Footsteps of Marco Polo that I recently read, Antonson found the people and cultures in this melting pot both complex but also open and friendly. This is a common thread in travel accounts to \"non Western\" locations and perhaps reflects a puncturing of an unconscious expectation of cultural superiority. Perhaps our homogenized, franchised, brand-name existence has actually placed us below other cultures, to which in comparison ours seems simple, closed, and unfriendly. Early in the book, I found Antonson's writing voice kind of grating and arrogant, but as the book goes along either some of those edges were knocked off during his adventures, or I just came to like him more as I knew him better. While initially skeptical of the historical veracity of the flood accounts, his research, travels and encounters with believers for several different reasons opened his mind to consider various theories and potential sites for that famous landing. While he never saw \"Noah's Ark\", and most likely no one ever will, his writing about it is a good summary of the current state of geological, archeological, and historical research. The book is well illustrated, although the black and white photos are often small and dark; a separate section of color photography on higher quality glossy paper would have been nice. The maps are useful, but scattered throughout with no table of maps to find them and refer back to them later (keep a second bookmark for that). And the time line of key historical events in the back is useful. This was a fun and thought provoking journey to a part of the world I will probably never see first hand. So Antonson will be my worthy eyes and feet there as I think about and watch that region from a distance."}, {"userName": "Catherine", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/35407950-catherine", "userReview": "Throughout reading this book I kept thinking of a quote from Miss Congeniality, \"A brief shinning moment and then that mouth!\" I received a free copy in this in exchange for a review. In the giveaway it was promoted as a memoir/ travel log/ history story and it definitely is a mishmash with Mount Ararat as a background. The actual climb barely covers anything in the book and is so sparse in detail it was almost like, why bother? Most of the book is about Antonson's travels and the people he meets before and after the climb. Some of it was quite interesting as he learns about the different cultures from this ancient land but then... Hence the above quote. The author is his own worst enemy. I'll just leave it at, bless your heart. The description I had for the giveaway was different from the description with the book posting. In some ways, I felt a bit misled. This isn't really a book about mountain climbing; you will not learn the geography, flora or fauna of Ararat; and if you take Noah's Ark seriously, this is not a viable reference. There are photos (something I was personally looking forward to) but thy are black & white, and grainy. If you want to learn a bit about the different people of the middle east or about how hard it is to travel there, enjoy the book."}, {"userName": "Marion", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/16030-marion", "userReview": "This was an interesting read. Personally, I was less interested in the story/research about the Ark and more interested in the author’s experience climbing Mt. Ararat and his experience in the region. I was impressed by how (seemingly) easily he was welcomed into the homes of strangers and treated as a special guest - says a lot about the hospitality of the people! I’m not sure I got a very strong sense of Antonson or his qualities, though it’s obvious that he’s a curious, interested world traveler, and people must like him in order to open their doors to him!"}, {"userName": "Julian Walker", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/25150243-julian-walker", "userReview": "An immediately engaging, thought-provoking journey that is part travel, part spiritual and part historical. The author immerses himself in an alien culture and vividly recreates the marvels of nature and the colourful characters with whom he interacts to weave a lyrical tale which is hugely enjoyable and very readable.A very satisfying read."}, {"userName": "teresa", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/38303406-teresa", "userReview": "BeautifulTake journey to the middle east. Always wanted to and now feel like I have. The mystical story of Noah's ark will be around forever. Maybe this will help you confirm what you think you know."}, {"userName": "Chynadolly", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/34648070-chynadolly", "userReview": "Interesting book -- or maybe I should say \"books\" as the first half and the second half are almost like two different stories. Nevertheless, I enjoyed both."}, {"userName": "Rose", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/4734633-rose", "userReview": "Another excellent vacation read. Would highly recommend."}, {"userName": "Judith", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/8493145-judith", "userReview": "I enjoyed this. Well written and engaging, it is sensitive to cultural differences and cultural beauty without preaching about them. The research about the different flood theories and the history of ark 'discoveries' as well as the importance of the ark story and mount Ararat to different cultures and religions is well presented and a very interesting complement to the narrative of Antonson's travel experiences."}, {"userName": "Fiona", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/6084788-fiona", "userReview": "I wanted to read this book because I lived in Turkey in the early 80's. I remember hearing that Mt Ararat was in eastern Turkey but, if the Turkish government approved, only men were allowed to climb it. No women allowed. Now I understand. It's not just a trek or hike, but involves mountaineering.As a child the author had read about an explorer climbing Mt Ararat looking for Noah's Ark. Years later when cleaning his attic, he came across the book again and decided it was something he wanted to do as well. After a lot of research and reading, he traveled to Turkey and climbed to the summit of Mt Ararat. He then crossed into Erbil, Iraq for a couple of days and then crossed the border to Tehran, Iran. A couple years later he traveled to Armenia. I loved reading about his travels. Often, it's not the destination that \"makes\" a trip but the journey and the friends you make along the way. This was the case for the author. Ferry is late. Taxi cabs drop him off at the wrong location. Border guards not knowing where Canada is (the home of the author). Learning traditional Iranian dances on the Tehran bound train. Spending time with the mountain guides family in the middle of nowhere. These were all parts of his trip.I found interesting the history, geography, politics, and legends of Noah's Ark. Did he see Noah's Ark? No, but he did discussed several theories where the boat could have landed/crashed. He compares stories from the Torah with the Bible and the Quran and even the Cyrus Cylinder which predates the religious stories. It was quite interesting.Now I want to go exploring."}, {"userName": "Shannon", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/11804319-shannon", "userReview": "Great read filled with adventure, stories, historical facts, maps and more. Enjoy the journey to Mount Ararat and beyond through the eyes, and experiences of this world traveler. You will learn, laugh, and want to keep reading this well written, detailed journey. Pick up this delightful book and see if you don't agree.I won this book on Goodreads and am happy to write a very positive review of this wonderful book."}, {"userName": "Jrobertus", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/196037-jrobertus", "userReview": "A Canadian journalist/adventurer is captivated the the exotic nature of Anatolia and the flood myth. He climbs Ararat and travels among Kurds, Turks, and Armenians and goes to Iraq and Iran. Overall it is pretty interesting but has more of his personal experience and less history than I generally like. At least he demolishes the ark myths in a gentle Canadian way."}, {"userName": "Lorraine", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/52246703-lorraine", "userReview": "Full Moon Over Noah's Ark was an excellent read. I won this book in a Goodreads giveaway. I have never read a travel book cover to cover before and this one caught me on page one. Rick Antonson has written an amazing account of his travels in the Middle East. I learned a lot and now have a new appreciation for this part of our world. Thank you."}, {"userName": "Kevin", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/52929643-kevin", "userReview": "Knowing the author made this read a little more connected.Rick writes a great story and infuses not only historic data and perspective but also brings the human side (social habits and style) into the story, taking me back to my first European back packing trip at 20 yrs old, meeting new people and cultures."}, {"userName": "Deb Stransky", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/28923411-deb-stransky", "userReview": "Excellent book!! Very well written. Antonson's adventure is gripping and extremely interesting. No religion mention other than what each of the three main one's think Noah's ark is located."}], "description": "Acclaimed travel writer Rick Antonson sets his adventurous compass on Mount Ararat, exploring the region’s long history, religious mysteries, and complex politics.Mount Ararat is the most fabled mountain in the world. For millennia this massif in eastern Turkey has been rumored as the resting place of Noah’s Ark following the Great Flood. But it also plays a significant role in the longstanding conflict between Turkey and Armenia.Author Rick Antonson joined a five-member expedition to the mountain’s nearly 17,000-foot summit, trekking alongside a contingent of Armenians, for whom Mount Ararat is the stolen symbol of their country. Antonson weaves vivid historical anecdote with unexpected travel vignettes, whether tracing earlier mountaineering attempts on the peak, recounting the genocide of Armenians and its unresolved debate, or depicting the Kurds’ ambitions for their own nation’s borders, which some say should include Mount Ararat.What unfolds in Full Moon Over Noah’s Ark is one man’s odyssey, a tale told through many stories. Starting with the flooding of the Black Sea in 5600 BCE, through to the Epic of Gilgamesh and the contrasting narratives of the Great Flood known to followers of the Judaic, Christian and Islamic religions, Full Moon Over Noah’s Ark takes readers along with Antonson through the shadows and broad landscapes of Turkey, Iraq, Iran and Armenia, shedding light on a troubled but fascinating area of the world.", "title": "Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond", "url": "http://www.goodreads.com/book/show/25898808-full-moon-over-noah-s-ark", "average": 3.81, "cover": "https://images.gr-assets.com/books/1444694298l/25898808.jpg", "reviews": 15, "authors": [{"url": "https://www.goodreads.com/author/show/977490.Rick_Antonson", "name": "Rick Antonson"}], "type": ["Travel", "Adventure", "Nonfiction", "History"], "outlinks": ["http://www.goodreads.com/book/show/25898808-full-moon-over-noah-s-ark", "http://www.goodreads.com/book/show/30044222-full-moon-over-noah-s-ark", "http://www.goodreads.com/book/show/14603207-route-66-still-kicks", "http://www.goodreads.com/book/show/16277444-to-timbuktu-for-a-haircut", "http://www.goodreads.com/book/show/2151070.Slumach_s_Gold", "http://www.goodreads.com/book/show/31184391-full-moon-over-noah-s-ark", "http://www.goodreads.com/book/show/174513.The_Fraser_Valley"]}