{"ratings": 245, "userreviews": [{"userName": "James", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/735052-james", "userReview": "I’ve been a fan of Ken Davis for a while. I don’t mean I have really followed his career or anything, but years ago I picked up a cassette tape (remember those?) of a message he gave off the bargain rack at my local Christian bookstore. The message was called Super Sheep and despite not having heard it in years I remember the things Ken said, his depth and his humor. Okay, so I got one of those minds that actually remembers sermons (I’m a freak of nature) but you can ask my wife, she’s heard the tape and she remembers it too and she doesn’t have one of those minds. Later I found I video of his called A Wimpy Prophet, A Butane Bush and No Exuses on VHS (remember those?) which was also really funny and inspiring.So when the opportunity to review this book came up I jumped at the chance and had them send me a print copy (remember those?) My previous experience with Ken Davis was with him as a speaker and he was dynamic with impeccable comedic timing. I wanted to see what kind of author he was and found this book inspiring. However I read the book way too fast so his comedic timing was all off. Well not totally, but this book seems to be a different animal than my previous exposure to Davis.The book begins with the tale of a camping trip with his wife and grandchildren where his granddaughter Jaydn gets lost in the wilderness. Davis panics and the hunt for Jaydn begins. When a couple of hikers find Jaydn, her words to them is “My grandpa is lost.” This becomes a metaphor for Davis of the ways he’s let his life drift off purpose. When he sees a picture of himself at 240+ lbs with his granddaughter at the beach, he exclaims, “Nooooo! Walking Manatee!!!” and begins the process of taking hold of his life and really living.This is a book about not wasting your life by walking around like you are half dead. Davis encourages his readers to lose weight, get in shape, take risks, make deep friendships and care for your family and attend to spiritual health and our relationship with Jesus. What I liked about this book is Davis’s vulnerability with his own struggles through depression, struggle and self-doubt. He opens up about the struggles he has had to accept himself, but also shares the ’stakes in the ground’ in his life which have revealed to him all that he was meant to be.I am a several years younger than Davis but I have had my own “Noooo! Manatee!” moment. When I graduated with my M.Div from Regent College it was the biggest academic and personal achievement of my adult life. I was proud of myself for finishing, but when I saw pictures of myself kneeling to receive my graduate hood, I saw that I weighed more than I ever have. And I felt terrible. I was slow, sluggish and had no energy. Within six months of that picture I had lost 50 lbs by running, swimming and watching my food intake. I have since gained some of that weight back (but no where near all), but some lifestyle changes I made were permanent and I have felt better for it.Still, some of Davis’s exhortation to take risks and live life to the fullest speak to me. I have, as of yet, to find a ministry position (what I went to school for, and the calling and deep passion of my life). I am currently working at a hardware/animal supply store to pay the bills and provide for my family, but I am still feeling like my life is stuck and I am not doing what I was put on the earth to do. As I read Davis’s book I am encouraged and hunger for more out of life, and more of what God has for me.I would describe this book as inspirational self-help. If you are in need of a gentle (but firm) swift kick in the rear, this might be a good book for you. If you feel like you are living life to the fullest, you might want to pass this by. When I mentioned Fully Alive’s contents to my wife she said, “I think we are already pretty much fully alive.” This is not a book for her. But if you look in the mirror and feel like you look dead and . . .well, manatee-ish, this may be the book for you. Or if you feel like you can’t do anything of value anymore because you are too old, Davis has lots to say to the old folks. Thank you to Thomas Nelson for providing me with a copy of this book via Booksneeze in exchange for this fair and exceptional review."}, {"userName": "Cheryl", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/5741286-cheryl", "userReview": "This book gave me mixed emotions in more than one way.Overall, Fully Alive made me both cry and laugh out loud. I appreciate both reactions and felt especially pleased when I reminded myself that, laughter truly is good medicine.Another reason I had mixed emotions was because for quite a while as I read through this book I thought I had been tricked or deceived into what it was all about—what the topic or category of book this was. All the summaries that I had read from the publisher about this book said nothing about weight loss or fitness. It isn’t the topic that got me upset. I love that topic, being a weight loss coach! It was that it was so unexpected, kind of stuck in there in the middle, and several chapters of it.After I got over the shock of this unexpected topic inclusion I realized that this book was at least partly beneficial for fitness motivation. That is a wonderful thing if that is what you need. And now, dear readers, you don’t need to be unexpectedly surprised by this topic inclusion. In fact, if you are in need of fitness motivation this is a very worthwhile book!TO READ THE *REST* OF MY REVIEW PLEAS VISIT:http://www.cherylcope.com/book-review..."}, {"userName": "Pilar", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/1212827-pilar", "userReview": "I admit, I didn't know who Ken Davis was before reading Fully Alive. So, it was especially sweet getting to know him by reading his story. Ken Davis shares his struggles and triumphs in his life's journey. He doesn't hide anything. He is candid and open in relaying details of his life.Have you felt depressed or unmotivated lately? Have you been thinking about getting back in shape, but think it's impossible? Do you feel old and listless? Are you just going through the motions in life? Have you thought, is this all there is?If you answered 'yes' to any of the above questions, I strongly urge you to get this book. Fully Alive will challenge, convict, inspire and invigorate you to make positive changes your life.To read the rest of this review, please visit http://www.ordinaryservant.com/?p=785"}, {"userName": "Gea", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/3776838-gea", "userReview": "Davis, Ken, “Fully Alive: a Journey that will Change Your Life”. Thomas Nelson, 2012.Exciting book of a life fully transformed both physically and spiritually. Full of humorous anecdotes which makes it a fast read and a joyful delight. Ken shares his journey from the “NOOOOO manatee” photo to a svelte 65 yr old man who shed over 80 lbs as well as found his spiritual life re-energized as well. It is a fast read and the laughter you erupt with as you read is truly a prescriptive medicine from which all will benefit. I loved every page! Two take aways from this book are two quips he uses: “Most Christians have moss growing on their butts” and “The spirit of fear is in-fear-ior to the Spirit of Christ who lives in us”. I doubt I will ever forget those which are tucked in with his experiences as he shares his journals and thoughts as he moved from depression to expression!"}, {"userName": "Joseph Young", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/62568288-joseph-young", "userReview": "The first few chapters were excellent! Very inspiring! After that it kind of slowed down to a crawl and dragged along, eventually becoming a discourse into why its important to take care of your body and dieting. The information was all good and fine, but the later part of the book really seemed to lose its gusto. Overall worth the read, but unless you're overweight you can probably skip the last half of the book altogether."}, {"userName": "Kimberly", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/3777996-kimberly", "userReview": "Good, challenging, and timely!"}, {"userName": "Dana Rongione", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/6291998-dana-rongione", "userReview": "A man lies in a bed in the ICU of the local hospital. Tubes and wires protrude from his feeble body and wind their way to massive machines on either side of the bed. The lights on the machine and the bouncing bubble that displays the heartbeat give evidence to the fact that this man is indeed alive. But is he living?A Christian trudges through life doing what must be done to get by. Upon examining his actions, one of two conclusions can be reached: (1) He has arrived at where he wants to be in life and has grown comfortable in that state; (2) He has despaired at ever arriving at where he wants to be in life and has grown comfortable with his uncomfortableness. Either way, his life consists of getting through another day. There's no doubt this man is alive. But is he living?In his newest book, Fully Alive, Christian author and speaker, Ken Davis explains how to tell the difference between being alive and truly living fully alive. Davis delves into his personal experiences and illustrates for us the milestones God placed in his life to take him from a state of being alive to a state of fully living. Through his thorough explanations and intriguing questions, he enables the reader to evaluate his/her own life and state of living. And even though Ken Davis is most well-known for his Christian comedy, this book will make you cry. In fact, it provides a message that will have you laughing and wiping tears from your eyes at the same time. But I assure you, it is a message you will want to hear!This book has changed my life. I firmly believe God has used Fully Alive, in conjunction with some other teachings, to pull me out of a rut. I was like the Christian in scenario #2, despairing of ever reaching my life's goals and dreams. I had grown comfortable with my disappointment and discouragement, and in doing so, I had given up on life. I was going through the motions day in and day out, but there was no life in me. I had no joy. I found no delight in the things I was doing, even the things I was doing for the Lord. I was enduring life, but I wasn't enjoying it. Life was happening to me, but I wasn't living.When I read the description of this book, I knew it was something I wanted to read. Besides, it was written by Ken Davis, so I knew it couldn't be bad. I had no idea how much it would impact my life. From the first page, I found myself nodding my head and saying, \"Yes, I know what you mean. You've just described my life.\" And while most pages spoke comfort to my weary soul, I must admit some points stomped quite firmly on my toes. However, after I soothed my wounded pride and studied out the things that had offended me, I realized that Davis was absolutely right. God used his words to open my eyes to things I had been blinded to for some time.I have every intention of going back through this book again. It is so full of good information that it simple cannot be processed by reading through it once. Nevertheless, I have already begun to implement some of the principles I learned through this great work. I'm tired of just being alive. I'm ready to live! And thanks to Davis' willingness to open up his heart and share his personal struggles, I now have an action plan. I finally see the light. . . and it's not the one at the end of the tunnel.Disclosure of Material Connection: I received this book free from the publisher through the BookSneeze®.com  book review bloggers program. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Virginia Garrett", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/7919784-virginia-garrett", "userReview": "“Ohhhh. Your friend here is only mostly dead. There’s a big difference between mostly dead and all dead…Mostly dead is slightly alive. With all dead there is usually only one thing you can do. Go through his clothes and look for loose change.” ~Miracle Max“Bible belt folks think living is a sin, so they are started dying from the day their born-again.” ~Steve Taylor.“I have come that you might have life and have it to the full!” ~Jesus Christ.The book by comedian Ken Davis, Fully Alive, A Journey that will change Your life, is the perfect book to read in mid-December as one year is closing in and a new one is on the horizon. This time of year always brings about a time of reflection, at least for me. A reflection on how I lived in the previous 12 months and how I hope to live in the coming 12 months. I think on what I need to change in order live better.Ken Davis had a “NOOOOOOOOOOOOOOOOOOOOOO” photo that changed his life. He was obese, depressed and knew if anything happened to one of his grandchildren he would be completely unable to help. He calls it his “nooooooooooo” picture, he says he looked like a walking Manatee, he was afraid to lie on the beach. He thought the environmentalist would mistake him for a beached whale and roll him back to the water.Fully Alive is his journey to a place of healing, health and restoration. He shares how he got physically fit, emotionally, mentally and spiritually fit. And it all involves risk.I like to think of myself as a healthy person. I’m in my mid-40s and I exercise at least twice a week. I was shooting for 3 times but life happens.Hah! No more. I wasn’t challenging myself. I just read a book written by a man who is 65 years old and he exercises for ONE HOUR 6 days a week. I thought I was doing good with 90 minutes of exercise a week. (Please know, I KNOW 90 minutes a week is not bad.) I am an active person throughout the week but I could be better.I am now on a mission to be FULLY ALIVE in all aspects of my life. And I’m starting NOW! I do not want to be a person who died at 25 and wasn’t buried until I’m 75. I want to live, fully alive, fully engaged in all that God has for me. I want to be willing to risk. I want to challenge myself. I want to deepen my love and my relationship with the God who created the universe. I want to deepen existing friendships. I want to gain new ones. I want to make sure I have at least 6 friends, close enough to carry my casket when I slide into death, completely used up. Okay to understand that, you’ll have to read the book.Who is with me? Who wants to quit being the living dead and start living life to the full?If you’re looking for another weight loss and diet book with a magic wand to make you instantly a healthier, trimmer you, don’t read this book. If you’re sick of books promising amazing results with little or no effort on your part, if you’re willing to work, and work hard, this is the book for you!Here’s to living fully alive in 2013! But because I am not a procrastinator, I’m not putting this off for two weeks. I’m starting today.Just let me grab my tennies…I’ve got a hour to run!I received a free copy of this book from the publisher for the purpose of review."}, {"userName": "Loraine Alcorn", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/3696460-loraine-alcorn", "userReview": "I was able to read Fully Alive by Ken Davis through book sneeze. I thought this book to be a high value Christ centered motivational book . This book takes you through all the many reasons why Ken Davis felt improvements were needed in his life so that he could live Fully Alive. I thought the book really great for motivating anyone who is unsatisfied with the're lives they way they are going and it shows us step by step how to regain what we lost.Each chapter is great and you will learn a new strategy with every page. I think that this book would make for an awesome gift for Christians and non Christian's alike because it does not come off as preachy and is strong on motivation and will not read like a church sermon.Fully Alive by Ken Davis is very Christ centered and its got so much helpful advice on how to get going and reclaim your life so you can feel fully alive. There is motivation for just about everything from loosing weigh , getting older, loss of spirit and depression and a whole lot more. I recommend this book to anyone suffering in a rut or the blahs ,its filled with humor and will lift your spirits just buy reading it.Recently I started thinking along the same lines and Ken and implemented my own changes toward health and joy I am more centered in my walk with Christ and had I read this book than my journey would have been easier. If you are looking to make changes in your life for what ever reason I think this would be a great book for you to read or even give as a gift to a loved one who could use the encouragement. I love the way its written for everyone but with a solid foundation of faith and belief that in Christ all thing are possible."}, {"userName": "Cindy Navarro", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/4037928-cindy-navarro", "userReview": "This book came along just when I needed it. It is filled with encouraging stories, practical ideas, and humor. Throughout the book, Ken tells the reader that there is so much more to life than just existing until death. Age, poor health, obesity, depression, retirement: whether you are facing all, some, or even a different set of obstacles, there is hope to LIVE as long as you breathe. Actually, Ken encourages you to breathe hard as you give all you have in life. When circumstances are crushing your spirit, shove back. This is a book that will inspire you to find the passion you once had to enjoy every moment instead of shuffling slowly with your head bowed in defeat. It may be a step-by-step or moment-by-moment progress...but make the effort to move!! Fear can either paralyze you or it can get your heart pumping and your legs moving. This is definitely a book for anyone who wants to live life to the fullest. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Disclosure of Material Connection: I received this book free from the publisher through the BookSneeze®.com  book review bloggers program."}, {"userName": "Brent Soderstrum", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/1356105-brent-soderstrum", "userReview": "My men's Bible study group just got done reading this book. We also had the DVD series that went along with it. Davis uses comedy to bring out the theme of the book which is we shouldn't just shut down our life as we get older. We need to live \"fully alive\" physically, mentally and spiritually. The group was split on this one. About half really enjoyed it. I was in the other half that thought it was just ok. I did enjoy some of his stories from his life. Losing his granddaughter in the woods, releasing he had grown obese, and his friend dealing with the loss of a son in an auto accident and using what he went through to comfort others who are going through tough times making sure they know God is going through it with them."}, {"userName": "Janna", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/8244930-janna", "userReview": "I first heard of Ken Davis at a Speaker's Conference and was delighted to find my favorite story of his, \"Law of the Pendulum,\" included in this inspirational book.Davis tells of a \"life awakening\" - body, mind, and spirit - in the golden years of life after other things like a thriving speaking career and private plane have left him empty.I appreciated the health chapters but most enjoyed the grace references (life in Christ) and agree with Davis that a total awakening is the only one that truly changes life.Davis is a master storyteller that draws me in and delights me as the truth dawns!"}, {"userName": "Paul Armstrong", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/24043957-paul-armstrong", "userReview": "Helpful and mostly Inspiring. I listened to this as an audiobook which is narrated by the author. This is doubly useful as the author is also an accomplished speaker and given the subject and desire to inspire it gives it authenticity. Authenticity is still a wee challenge as the delivery is \"American\" (An odd adjative to Americans I accept, but to non Americans, like me, I am sure it translates). But I got over myself here and listened to Ken's messages. And they are good. As a confirmed atheist messages around God were again challenging for me. But if you accept that they are authentic and you understand the underlying message they are still good, IMO."}, {"userName": "Rick Drury", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/16372908-rick-drury", "userReview": "My wife brought this book home fron a Women of Faith Conference in Minniapolis. Within 15 minutes of starting the book I told her I was not going to finish it. The story of his grand daughter broke my heart and I didn't want to see how it ended. Having heard the story she encouraged me to read on. Throughout the book I laughed and I cried. This was a big step in me getting back on track spititually, emotionally and physically. Having told her bits and pieces, now my wife wants to read it. Highly recommend this book to almost anyone."}, {"userName": "Kaylee", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/39081837-kaylee", "userReview": "Great read for any adult! I picked up this book not reading anything about it, only due to familiarity with Ken Davis. So the content was a bit of a surprise but it was a good surprise. His writing is as easy to read and understand as his speaking. Truth mixed with comical and sometimes dramatic stories creates a pleasant to read but challenging book. Even if you are in the best of shape, I would recommend reading from start to finish because it's definitely a complete package."}, {"userName": "Jo", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/2722600-jo", "userReview": "I loved this book... It was read by the author - and it is based on several books that I've read and enjoyed... It's the authors version of how to live fully engaged... Which I'm a huge believer in this concept... He talks of the physical, the social, and the spiritual aspects of our journey... It was a great book to listen to as I commuted during the Holiday season!"}, {"userName": "Carol Dittoe", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/13546161-carol-dittoe", "userReview": "No one can read this book and not be changed. Ken Davis has the perfect mix of humor, seriousness, and religion to make every reader stop and evaluate his or her live. Are we living fully alive? Read this book and you you have no choice but to live \"Fully Alive!\" Thanks Ken for a masterpiece!"}, {"userName": "Myrna Parks", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/13230551-myrna-parks", "userReview": "I ordered this book from the author's page and I love it! I consider this a marker (or stake) in my spiritual journey. It is just what I need to spur me to press on during these painful trials, called life. From one perfectionist to another--thank you, Ken!"}, {"userName": "Terry", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/1299547-terry", "userReview": "Ken Davis is inspirational, funny and insightful in this book. His Christian perspective is refreshing. This is his story about recovering life from the temptation to drift. He has a real knack at whipsawing your emotions while inspiring you.It is an easy read and definitely recommended."}, {"userName": "BJ Mcmillen", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/12948652-bj-mcmillen", "userReview": "So far I am enjoying this book. I almost put it down because I thought it was focusing to much on the healthy lifestyle (exercise) in the first half. But I am really enjoying the direction of taking chances and living Fully Alive."}, {"userName": "Charles Wood", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/4878845-charles-wood", "userReview": "This is an excellent book about living live to the fullest. It helped me put several things into perspective around what is important to me and helped me recognize that the short term tradeoffs I make have long term consequences."}, {"userName": "Dustin", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/6315483-dustin", "userReview": "I enjoyed Ken's humor and the stories he tells to reinforce his perspective on living fully alive. This book wasn't short of entertaining too. I actually laughed out loud while listening to the audiobook!"}, {"userName": "Marcus Lynn", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/5923005-marcus-lynn", "userReview": "Davis is one of the funniest Christian speakers I've heard. There's still humor in this book but it doesn't translate as well as it does live and his topic is a little more serious. If you're looking to make some changes to your physical and spiritual life, then pick this one up."}, {"userName": "Michael Tarpinian", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/23630869-michael-tarpinian", "userReview": "Interesting book. Equal parts fitness, motivation, inspiration, and Christian lifestyle tips, I found it engrossing. Ken Davis' style and humor same through with his reading. That they left in his hesitations and quirks made it even more naturalistic and engaging."}, {"userName": "Jeffry", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/10832583-jeffry", "userReview": "A lot to consider. While simply written - with nice anecdotes - it challenges you to explore own decisions. Really drives home the idea that all of our decisions have consequences - so chose wisely."}, {"userName": "Ellien", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/11418082-ellien", "userReview": "I opened this book to the chapter on building relationships, then eagerly read the whole book in two nights. Funny, inspirational, and poignant! A must read, even IF you think you are \"fully alive\"."}, {"userName": "Kris Sellers", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/41337449-kris-sellers", "userReview": "Great and inspiring book by a very funny man! Very motivating and unselfishly shares many personal moments."}, {"userName": "Amy", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/2193230-amy", "userReview": "It was okay. I've heard Ken speak in the past, and he was hilarious. Honestly, I was expecting more out of this book, I'm a little disappointed."}, {"userName": "Deena Shoemaker", "userReviewDate": "Dec 07, 2012", "userURL": "http://www.goodreads.com/user/show/5430724-deena-shoemaker", "userReview": "Ken Davis is a funny guy. His book made me laugh, it made me cry, but it offered me nothing I hadn't heard before outside of his own personal stories."}, {"userName": "Josh Ryder", "userReviewDate": "Oct 29, 2012", "userURL": "http://www.goodreads.com/user/show/3370782-josh-ryder", "userReview": "Great, easy read for life inspiration."}], "description": "Food labels, advertisements, politicians, self-help books—they all promise the same thing: a better life . . . or, as Jesus might put it, life to the fullest. For millions, this pursuit of happiness has captivated, ensnared, and, most disappointingly, it has alluded. Which begs the question, what is the missing link? Fully Alive explores the idea that God is glorified when man is “fully and eternally alive,” illustrated by best-selling author and motivational speaker Ken Davis’s most honest and intimate stories. Ken invites us to walk with him on a journey, along a road of heartache and adventure, to a place he calls “the land of the living,” and discover what may be missing in our lives. A poignant and entertaining storyteller, Davis points out the practical steps necessary to live this way—everything from lightening up to taking a quality of life assessment, to overcoming trials—while also revealing the power of Christ’s resurrection available for each of us. Get a taste of the beautiful urgency of today and begin moving toward a change in your life that draws from the joy and power that can be found only in Christ.", "title": "Fully Alive (Library Edition): Lighten Up and Live - A Journey that Will Change Your Life", "url": "http://www.goodreads.com/book/show/15807413-fully-alive-library-edition", "average": 4.2, "cover": "https://images.gr-assets.com/books/1344745846l/15807413.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/17210458.Ken_Davis", "name": "Ken    Davis"}], "type": ["Christian", "Christian", "Religion", "Nonfiction", "Self Help"], "outlinks": ["http://www.goodreads.com/book/show/15807413-fully-alive-library-edition", "http://www.goodreads.com/book/show/13555425-fully-alive", "http://www.goodreads.com/book/show/17574987-secrets-of-dynamic-communications", "http://www.goodreads.com/book/show/1071940.How_to_Speak_to_Youth_and_Keep_Them_Awake_at_the_Same_Time", "http://www.goodreads.com/book/show/2149526.Sheep_Tales", "http://www.goodreads.com/book/show/697543.How_to_Live_with_Your_Parents_Without_Losing_Your_Mind", "http://www.goodreads.com/book/show/1304965.Lighten_Up_"]}