{"ratings": 1561, "userreviews": [{"userName": "Claudia", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/45870338-claudia", "userReview": "Aus Volker Weidermannns Biographie:Max Frisch trifft sich noch einmal mit Ingeborg Bachmann im Cafe, doch es gibt keine Verständigung mehr. Als sie das Manuskript des 'Gantenbein\" liest, wird aus früherer Liebe Hass. Ein Mann hat eine Erfahrung gemacht, und die Geschichten, die er dazu suchte, sie waren ihr zu nah am Leben, an ihrem Leben.\" / Rezi folgt."}, {"userName": "Nihidea", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/13922802-nihidea", "userReview": "Okay, now that I have finished the book for the second time, I feel up to writing a review about it. Now I feel I have halfway captured what is even going on. Or not going on. Because, let’s face it, 95% of what is happening in this book is not even happening. Okay?Wait, first things first. This book is amazing. I shit you not. It fascinated me every time over when I opened it withing a few sentences I was just baffled. Frisch’s writing style is incredible, and he manages to convey so many emotions, so deep and unimaginable feelings in such an everyday language. None of the words he uses is overly sophisticated, but together they form an exquisite example of highly poetic literature. I can not stress enough how good this book is.And that is even though virtually nothing happens.It’s an amazing tale of fantasy and escapism, of searching for identity, of exploring life in only your mind, of sonder. Oh, so much sonder.There are so many layers. Honestly guys. Forget all about Inception. There is a fuckload of layers in this book and you might need a few times, just as I needed a few times and will probably need a few more to really grasp this book in its entirety, but guys, it’s SO worth it.I can not thank my Literature teacher from high school enough for recommending this to me. She, too, was as completely captivated by this book as I am now, and with this enthusiasm she got me to read it although I didn’t like Max Frisch. It completely changed my mind.This is a book that will occasionally make you laugh, occasionally bring you to the verge of tears, quite a few times present you with emotions you can relate to so much that it hurts, and always, always will it suck you completely into its world of absurdity, or confusion, of fantasy."}, {"userName": "Armin Hennig", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/8212255-armin-hennig", "userReview": "Missratener Abschluss einer TrilogieDer abschließende Teil einer Trilogie über Identität und Fiktion sollte wohl so etwas wie ein Schelmenroman werden, dergleichen kann sich eine Person des öffentlichen Lebens, die permanent das eigene Umfeld in der eigenen literarischen Produktion verwurstet, nicht wirklich leisten.Zu allem Überfluss hatte Max Frisch mit Andorra auch noch die letzte Patrone aus seinem Magazin alias Tagebuch 1946-49 verschossen. Da die nächstliegende Inspiration, insbesondere die Beziehung zu Ingeborg Bachmann nicht ungefiltert verarbeitet werden kann, verliert sich der Autor in erzähltechnischen Spielereien und lässt die Leser zunächst darüber im Dunkeln, wer jetzt z.B. gerade nackt im Morgengrauen durch Zürich rennt oder mit dem Porsche des besten Freundes auf dem Glatteis einen Dreher vollführt. Der als dritte Instanz aufgeführte Swoboda, dessen Frau mit Enderlin eine Affäre hat, kommt zwar schon früh als namenloser Hahnrei vor, aber erst so spät als Mann ins Blickfeld, das man ihn praktisch schon abgeschrieben hat. Das erste Drittel gelingt so weit ganz gut als Rätstelspiel mit einer satirischen Ebene über die Wahrnehmung des Blinden, der nur eine Rolle spielt, durch die Gesellschaft. Das sich einfinden in die Rolle mit sämtlichen nicht bemerkten Pannen hat einen gewissen Charme, auch die Begegnung mit der Zürcher Nitribitt Camilla, die im letzten Viertel umgebracht wird, als sie sich Gs Verschwiegenheit vor dem Wechsel ins bürgerliche Leben mit dem Verweis sichern will, dass sie um sein Geheimnis weiß.G sieht sich jedenfalls als Mörder, der dem Angeklagten sogar für die Tatzeit ein Alibi geben könnte, würde das die eigene Rolle als Blinder nicht gefährden. Später lässt der Erzähler ein Geständnis Gs an der Realität zerschellen, gewissermaßen ein kleiner Nachhhall zu Stiller und dessen fiktionaler Identität als Jack White.Dass Frisch im weiteren Verlauf des Romans immer wieder gerade geschilderte Vorgänge ausstreicht, am markantesten mit Gs Geständnis gegenüber Lila, dass er gar nicht Blind sei, das 50 Seiten wieder zurück genommen wird, um in einer anderen Konstellation gegen Ende zu einem anderen Ergebnis zu führen, ist nicht das Problem. Wirklich nervig ist das ständige Rumdaddeln mit der von Ingeborg Bachmann inspirierten Lila, die im Verlauf des Romans von allen drei Erzähler-alter-Egos gevögelt wird und ihre angetrauten Männer (G,S) konstant mit Enderlin betrügt, gleichbedeutend mit der Gelegenheit das Paket mit dem fleischfarbenen Stoff (Eifersuchtsmetapher in Stiller) noch mal bis zum Erbrechen auszupacken. In dieser Phase ist vom anfänglichen Schwung nichts mehr übrig.Der Umstand, dass Lila (so erscheint ihre Hautfarbe durch die Blindenbrille), permanent als Schein-Existenz decouvriert werden muss, deren schmuddelige bis eklige Schattenseiten geradezu zwanghaft ins rechte Licht gerückt werden, während sich der Blinde als perfektes Hausmännchen aufspielt, geht mir auch bei jeder Lektüre je länger, desto mehr auf den Wecker.Der kaum noch erträgliche Gipfel dieser Situationen ist jene Szene, in der die vergessliche Schauspielerin die Wohnung überflutet hat, weil sie nicht daran gedacht hat, das Wasser im Bad nach einer Dusche abzudrehen. Nachdem G in stundenlanger Arbeit die Wohnung trocken gelegt hat, setzt er sie zuletzt wieder unter Wasser, da Lila die Wasserflecken auf dem Parkett als Vorwurf empfinden könnte und bekommt von ihr statt dessen einen Rüffel für seine Vergesslichkeit.Das Rücksichtsthema gegenüber den Schwächen der Frauen im Haushalt wird Max Frisch noch bis ins Tagebuch 1966-71 (Der Goldschmied von Locarno, Häuslichkeit im Tessin mit Marianne) begleiten und erst in Montauk eine vollkommen überraschende Auflösung bekommen. Fazit: Deutsch(sprachig)e Literatur Anfang der Sechziger ist für mich eine eher ungeliebte Periode, da etliche Autoren, denen nichts neues einfiel, meinten, sie müssten nur an der Form was ändern, dann wären sie schon wieder an der Spitze der Entwicklung und könnte dabei auch noch subtil Gesellschaftskritik üben. Martin Walsers Einhorn ist sicherlich noch eine üblere Bauchlandung als Gantenbein, aber viel mehr als ein gelegentliches Ätschibätschi, es war gar nicht so oder demonstratives Durchprobieren von Settings hat Max Frisch auf stilistischer Ebene im Gantenbein nicht drauf. Da der Autor keine überzeugenden Erzählkonstruktion mit formalen Finessen liefern kann, übersättigt er seine Leser mit Eifersucht bis zum Abwinken und einer demonstrativen Szene aus der Gattung Männer sind einfühlsamer und verstehen mehr vom Haushalt als die Frauen nach der anderen. In Verbindung mit dem faulen Lila-Zauber eine schwer erträgliche Mischung. Einzelne Lieblingsstellen (Der Mann, der von seinem Tod in der Zeitung erfuhr und nach dem Besuch seiner Beerdigung spurlos verschwand) werde ich mir sicher mal wieder reinziehen, für das ganze Buch reichen mir drei komplette Durchgänge für dieses Leben. Ingeborg Bachmann reagierte angeblich mit Malina auf ihre literarische Verarbeitung als Lila, vielleicht sollte ich mir ihre Antwort noch schnell antun, ehe ich die nervigen Seiten von Gantenbein wieder vergessen habe."}, {"userName": "Bine", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/11027889-bine", "userReview": "Mein erster Max Frisch.Vielleicht nicht der ideale Einstieg, aber dennoch wahnsinnig interessant und beeindruckend!Ich habe schon so einige Romane gelesen, die auf den ersten, und wahrscheinlich auch auf den zweiten und dritten, keine konsistente Handlung aufweisen, aber Max Frisch hat es als erster Autor geschafft, dass ich trotzdem die \"Geschichte\" gerne weiterverfolgen wollte. Trotz der ständigen Illusionsdurchbrechung hat mich das ganze nicht losgelassen und ich war auf den Ausgang gespannt.Zwar besteht der Roman aus vielen, wenig zusammenhängenden Geschichten (die sich teilweise sogar widersprechen) , dennoch sucht man als Leser ständig danach, diese zu verknüpfen, ist also stets gefordert und in der Geschichte gefangen.Die metaphorische Aufladung der Geschichten ist ebenfalls nicht zu verachten. Auch hier konnte man immer wieder spannende Zusammenhänge aufdecken, wenn etwa Gantenbein durch seine Blindenbrille die Welt in lila sieht und der Erzähler daraufhin seine Frau Lila nennt.Ich muss sagen, ich hatte wirklich viel Freude mit dem Buch. Es ist vielleicht nichts für den Leser, der cheesy unterhalten werden will (obwohl die Sprache auch einen tollen Fluss hatte), da man wirklich mitdenken muss, wenn man den Reiz des Romans wahrnehmen will, aber der Lesespaß war für mich trotzdem gegeben. Ein erzählerisch super intelligent umgesetztes Buch, das den Leser in einem Netz von Fiktionen gefangen hält und bis zum Schluss nicht loslässt. Jetzt will ich übrigens Homo Faber noch viel dringender lesen :D"}, {"userName": "Inga", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/4336119-inga", "userReview": "Habe ich dieses Buch verstanden? Ich weiß es nicht.Habe ich dieses Buch gern gelesen? Ich glaube nicht.Bin ich froh dieses Buch gelesen zu haben? Nun ja, ein Roman mehr von einem der großen Nachkriegsautoren, ein Aspekt mehr zu Frisch nach Biedermann, Homo Faber und den Andorranern. Am Ende denkt sich der Protagonist wieder mal auf ein Schiff, lechzt einer viel zu jungen Frau hinterher, die Lila heißt und irgendwie erfunden oder auch nicht ist und am Ende Pingpong spielt wie die Tochter des Homo Faber.Ich glaube, ich habe doch gern auch eine verlässliche Handlung in einem Roman. Sie darf gern auch langsam voranschreiten und vielleicht auch lächerlich sein, aber diese quasi erfundenen und immer wieder revidierten und neu zusammengesetzten, geträumten Handlungen eines wie auch immer zu benennenden Protagonisten. Man kann noch nicht mal sagen, wer das aller erzählt! Man wird selbst leicht schizophren beim Lesen, möchte man sagen, stimmt natürlich auch nicht, aber man könnte sich vorstellen, dass es so sei. Oder auch nicht. Mein Name sei Lila. Oder auch nicht. Oder?Max Frisch „Mein Name sei Gantenbein“. Süddeutsche Zeitung Bibliothek 2004, Band 32."}, {"userName": "notgettingenough ", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/2658311-notgettingenough", "userReview": "I want to trust my judgement and that's putting me between a rock and a hard place.The rock is my respect for Frisch: if he wrote it, I'm going to read it.The hard place is my 'arrggghhhhhhhhhhhhhh, it's an experimental novel. Even worse, it's an anti-novel. Stop it, stop reading it right now.'I bought two books this morning I'd really like to start on...but first I'm going to pick this up again for the first time in a week.I'm up to page - ? Does it matter in a book like this? Page somewhere."}, {"userName": "Stephan Frank", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/3568327-stephan-frank", "userReview": "Schon klar, ausserordentlich gut komponiert. Und ganze Passagen koennten locker als Lehrmaterial par excellence in einemKurs zur Analyse der Sprachgewandheit Frischs Einzug halten.Allerdings musste ich feststellen, dass ich nach laengeren Leseabschnitten doch rechtermuedet war -- offenbar hat mich die Thematik dann doch nicht ganz so gefesselt."}, {"userName": "J.M. Hushour", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/17463213-j-m-hushour", "userReview": "Frisch is one of those authors that you always run and try to convince people to read, but who is infuriatingly difficult to define. Thus, ultimately you fail to convince because you don't have a convenient pigeonhole to shove him into. That is part of his charm. Forgotten or at the least overlooked to a criminal degree, his musings on identity and the fictional layerings that are part and parcel, and almost obligatory, as part of being human in a world of ever-shifting parameters and definition as to what they exactly mean, is more relevant than ever. Frisch himself described this book as: \"The story isn't told as if a person could be identified by his factual behavior; let him betray himself in his fictions.\"\"Gantenbein\" is a refreshing kind of narrative monster, where characters are subject to abrupt starts and stops, the narrative changed and veered, and the characters put through the existential wringer by the author who, by dint of being the author, gets a free pass to act sadistically on his characters."}, {"userName": "hcelvis", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/5056724-hcelvis", "userReview": "Was soll man dazu sagen? Max Frisch schreibt besonders, bedacht, kunstvoll, schöne Sätze, manchmal, oft aber auch abgehackt, für sich schön, stimmungsvoll, man kann Gedankengängen folgen, manchmal auch nicht, aber selbst dann ist es meist insofern nachvollziehbar, dass die Gedanken eines Menschen springen können. Gantenbein ist literarische Kunst, auf jeden Fall.Leider aber fehlt mir der rote Faden, 300 solche Seiten sind nicht nur anstrengend, sondern auch mehr und mehr langweilig. Tatsächlich passierte es mir häufig, dass meine Gedanken abschweiften und nicht mehr dem gelesenen folgten. Dann und wann kommt dann wieder ein zusammenhängender Teil, der auch etwas wie Spannung aufbaut, aber die hält eben nur ein paar Seiten lang an.Es gibt viel Wahrheit in \"Mein Name sei Gantenbein\", über Liebe, über den Umgang der Menschen miteinander, man findet schöne, ja tolle Formulierungen, nur leider irgendwie alles aneinandergereiht, willkürlich. Und so wurde der Gantenbein für mich zum Kampf, dann und wann mit einem kleinen Erfolgsgefühl, dass es sich doch lohnt, durchzuhalten, oft aber auch mühevolles Durchbeissen."}, {"userName": "Patrick", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/646953-patrick", "userReview": "I was enjoying this for about the first 200 pages, but then got pretty bogged down and eventually stopped caring what happened to these characters. I like Frisch, but this one is just too damned long. I still gave it 3 cuz there's plenty of his gems on human nature."}, {"userName": "Sini", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/8382231-sini", "userReview": "Max Frisch was een grootheid, die volgens veel mensen de Nobelprijs had moeten krijgen, en in 2013 las ik met veel plezier zijn prachtboeken \"Stiller\", \"Homo Faber\" en \"Dagboek 1946-1949\" (zie recensies). Nu heb ik dan \"Gantenbein\" gelezen, ook met veel plezier, ondanks de wat houterige vertaling. Wat een heerlijk sprankelende en tegendraadse schrijver was die Frisch toch! En hoe origineel en stimulerend! In het prachtige \"Stiller\" roept de hoofdpersoon ons toe \"Ik ben Stiller niet\", en schotelt ons vervolgens een zooi meeslepende grillige verzinsels naar het hoofd die ons op prachtige wijze duidelijk maken dat het personage Stiller aan elk label ontsnapt door zijn veelvormigheid en ongrijpbaarheid. In \"Gantenbein\" gaat Frisch nog wat verder: daarin trakteert een naamloze verteller, soms vanuit ik- perspectief en soms vanuit hij- perspectief, ons op nog grilliger verzinsels dan in \"Stiller\", waarin hij soms de rol speelt van ene Gantenbein (of van iemand anders die zegt \"noem mij maar Gantenbein\"), soms van ene Elderlin, en soms ook van ene Svoboda die zijn (al dan niet verzonnen) geliefde kwijt is geraakt aan Elderlin of misschien toch aan Gantenbein. Maar soms neemt die verteller dan weer de positie in van iemand die kijkt naar een personage dat misschien Gantebein heet, of dat wellicht Elderlin is. De ene keer denk je daardoor dat de ik-figuur en Gantenbein dezelfde persoon zijn, en dat Elderlin nog weer iemand anders is, terwijl je in andere passages denkt dat het om drie verschillende personages gaat, terwijl je in nog andere personages denkt dat \"Gantenbein\" draait om een enkel naamloos personage dat zichzelf fragmenteert in meerdere personages, die elk op zich alleen maar uit gefragmenteerde verzinsels bestaan. Wat nog verder wordt opgevoerd in passages waarin de verhalen van en over Gantenbein, Elderlin en Svoboda worden versmolten met eigentijdse versies van de oude verhalen over Philemon en Baucis. En dan lijken de verschillende personages soms ook nog eens verzinsels van elkaar: bijvoorbeeld omdat Svoboda en en zijn geliefde Lila verzinsels lijken van Gantenbein, terwijl Gantenbein weer een verzinsel lijkt van \"iemand\" (wie!?) die zich in nevelen hult. In \"Stiller\" hadden we te maken met een personage dat zichzelf veelvormig, gefragmenteerd en ongrijpbaar maakt door een veelheid van verhalen en verzinsels; in \"Gantenbein\" is die fragmentatie en ongrijpbaarheid echter nog verder doorgedreven. Temeer omdat veel van de gefragmenteerde verhalen bol staan van maskerade en spel. Bijvoorbeeld in het verhaal waarin iemand, die zegt \"noem mij maar Gantenbein\", ons vertelt dat hij speelt dat hij blind is: een rol waarmee hij veel mensen op het verkeerde been zet en die hem op een heel andere wijze naar de wereld laat kijken, al was het maar door de nieuwe kleuren die zijn blindenbril oplevert. Een rol ook die hem een nieuwe identiteit geeft. Totaal verzonnen weliswaar, maar zulke verhalen zijn volgens de verteller als kleren die men kan aantrekken of uittrekken, en onze identiteit is volgens die verteller niks meer dan de optelsom van die totaal verschillende en steeds wisselende kleren. Je kunt hier volgens mij een postmodernistisch statement in herkennen: wij brave burgermannen denken allemaal dat onze identiteit definieerbaar en uit een stuk is, maar postmodernisten roepen steeds dat ons ik niets meer is dan een bonte optelling van ongegronde verzinsels. Zo ook Frisch, volgens mij. In sommige passages wordt dit zo te zien ook betreurd: het besef dat alles fictief is leidt dan tot (wellicht deels geveinsd?) verlangen naar echt gevoel, zelfs naar echte pijn of smart, die weliswaar pijnlijk zou zijn maar ook werkelijk en authentiek. In sommige verhalen lijkt de verteller gebukt te gaan onder het gevoel dat hij niks meer is dan de veranderlijke rol die hij op dat moment speelt. Tegelijk echter is dat laatste ook heel bevrijdend, en juist dat bevrijdende staat naar mijn gevoel sterk voorop in \"Gantenbein\". Geen enkel levensverhaal in dit boek heeft immers de sleetsheid van het normale afgeronde levensverhaal met kop, staart en middenstuk. Geen enkel personage zit vast aan een enkel verleden dat nooit meer verandert. Een bekende grap als \"mijn vrouw is een mooi boek, maar ik heb het al uit\" gaat in \"Gantenbein\" niet op, want geen enkel personage in \"Gantenbein\" is een uit te lezen boek. Integendeel, elk personage is een doorlopende stroom van nieuwe verhalen. Niemand zit vast aan een enkele rol. Ieder leven bestaat op DIT moment uit DIT verhaal, en even later uit een ander verhaal dat heel anders kan zijn. Het bestaan is pluriform, veranderlijk, voortdurend in wording: niet te knechten in een homogene geschiedenis. En precies DIE pluriformiteit laat Frisch ons in \"Gantenbein\" op sprankelende en inspirerende wijze zien. Heerlijk, dat gevoel van vrijheid dat \"Gantenbein\" uitademt. Geweldig hoe verhalen daarin als kleren worden gepast en afgewisseld. Prachtig hoe elk verhaal daarbij de kracht heeft van een puur nu-moment dat niet is gedetermineerd door de grijze conventies en de doodsheid van een vast liggend verleden. Goede schrijver, die Frisch. Blij dat ik nu ook \"Gantenbein\" van hem heb gelezen."}, {"userName": "Pratum", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/27101070-pratum", "userReview": "\"Tinklainė apsaugo nuo nuojautos, kurią mumyse sukelia beveik kiekvienas garsas, ir nuo laiko; matosi, ką dabar rodo laikrodis ana ten Sankt Peteryje, o laikrodžiai visada rodo dabartį.\"\"Gantenbainui palengvėja kaskart pagalvojus, kad iš tikrųjų jis ne aklas; pypkės skonis būtų kitoks, jei nematytum dūmų, kartus, slopinantis kaip tabletė ar injekcija, bet nelinksmas.\"\"Moterys niekada iki galo nepatiki jo aklumu, kas joms raištis, moterys jaučia pakaušiu, kai į jas žiūrima.\"\"Kiekvienas žmogus anksčiau ar vėliau susikuria istoriją, kurią laiko savo gyvenimu,- sakau,- arba net daugybę istorijų,- sakau, bet esu jau per daug girtas, kad galėčiau sekti savo paties minčių eigą, ir todėl taip supykstu, kad nutylu. Kažko laukiu.\"\"aš nebeprisimenu, kaip jis atrodė, mano vyras ant Kešo, galbūt todėl negaliu jo atsikratyti, rūkau, galvoju apie jį, tyliu, rūkau.\"\"Per daug išgėriau... Dama, uri tuo metu įėjo į kavinę ieškančiu žvilgsniu man primena, kad pusantros valandos aš kažko laukiau, ir yra, suvokiau, žmona to kažko, kuriam, deja, teko išvykti, ir ji atėjo už jį atsiprašyti, tad aš nuslystu nuo savo aukštos taburetės nuvilkti jai šlapio palto. Iš mandagumo. Parodyti, kad atleidžiu. Savaime suprantama. Iš tikrųjų tai aš turėčiau atsiprašyti,- aš visai užmiršau laukti.\"\"Ji rūko kiek skubėdama, kai kalba apie savo vyrą. Jos juodi plaukai blizga, šlapi nuo lietaus. Aš pasiryžtu jos neįsimylėti.\"\"Turiu sau kai ką pripažinti, o būtent: retai sutinku moterį, su kuria man būtų įdomu kalbėtis, jei ji bent kiek nedomina manęs kaip moteris. Todėl žiūriu į jos burną.\"\"Jos veidą verta pamatyti iš šono, jos ranka ne svetima, net jos plaukai, ši įstabiausia medžiaga ant žmogaus kūno, ne svetimi.\"\"Trečia valanda po pietų yra baisus metas, negyvas metas, lėkštas ir beviltiškas, prisimenu tolimą vaikystę, kai gulėdavau sirgdamas, ir būdavo trečia valanda popiet, knygos su paveiksliukais, obuolių tyrė, amžinybė...\"\"Bet kuriuo atveju, taipogi imdama savo taurę, ji kiek per giliai įkvepia, lyg kas būtų nutikę, nusibraukia nuo kaktos plaukus, pažvelgia į mane - mane! - savo didelėmis žydromis akimis nematydama, kad aš norėčiau būti vienas.\"\"Retkarčiais, lyg dūmų verčiama, ji primerkia akis, šitaip prisimerkia glamonėjamos moterys, ir būtų tiesiog natūralu, jei nepažįstamas ponas, ar juokais, ar su nebyliu šuns žvilgsniu, dar kartą paliestų jos petį, ranką, gulinčią ranką su cigarete prie peleninės, kitą jos petį, kaklą. Jis to nepadaro. Jei neprižiūrėčiau, gal jis ir pabandytų - nevalingai...\"\"Nebežinau, ar tai buvau aš, ar nepažįstamas ponas, kuris dabar - ji taip jausmingai pažvelgė - ranka jai perbraukė kaktą, juokais, taip sakant, savavališkai, neabejotinai pašaipiai, kad švelniai pabrėžtų tokį likimo įnorį; šiaip ar taip, tai įvyko. Pagaliau sustojo taksi, ir mūsų atsisveikinimas gatvėje po lietum buvo greitas ir formalus.\"\"Ta aplinkybė, kad jis nevilkėjo palto, jam buvo nemaloni; atrodė, lyg jis būtų užėjęs tik minutėlei. Jis kalbėjo stovėdamas, kalbėjo daug, bet beveik nuobodžiaudamas, laikydamas rankas kelnių kišenėse; jis bijojo savo rankų, kurios jo neklausė. Bijojo pauzių. Jau trečią kartą jie pažvelgė vienas į kitą, vyras ir moteris, be žodžių, net be šypsenos. Be sumišimo. Tuo tarpu jis vis dėlto atsisėdo, bet taip, kad tarp jų būtų stalas, ir atrodė, tarsi jie bijotų bet kokio veiksmo, kuris išoriškai galėtų kažką pakeisti, pavyzdžiui, bijojo įjungti patefoną. Jie sėdėjo ir rūkė. Jis kalbėjo apie kates, pats nežinodamas kodėl.\"\"Ji vis dar stovėjo su paltu, kai visi drabužiai, sunaikinti bučinių, jau seniai buvo juokingi, melas iš kailio ir vilnos, ir šilko, kurį ne taip lengva nusimesti, bet to melo reikalauja aistros padorumas.\"\"Ji tai sakė, o jis nurenginėjo ją tvirtais judesiais, rodančiais jo nusimanymą apie moteriškus apatinius, ir visgi be jos pašaipios pagalbos nebūtų pavykę, ir blaiviai vienišas jau numanė, kad viskas bus taip, kaip visada. Jis buvo blaivas, taip, bet be ironijos, blaivas ir nebylus.\"\"Ne naktis, ne jos kūnas naktį, bet dabartis šioje salėje su stoglangiais jam atrodė kaip sapnas, balandžių burkavimas kaip tolimas prisiminimas; tik jos mažo kūno nebuvimas buvo realus, buvo dabartis, kai jis stovėjo sukryžiavęs ant krūtinės rankas ir girdėjo iš toli miestą kaip bangomūšą, duslią, monotonišką, banguojančią žaliomis bangomis.\"\"Naktį, nors beveik nemiegojo, jie ničnieko vienas kitam nepasakė, nenorėdami per žodžius ir vardus įsileisti pasaulio; jie netylėjo, o ne, bet šnibždėjosi, lyg egzistuotų tik jie, jokių \"prieš tai\", jokių \"po to\", nė vienut vienutėlio vardo, tik jie, bevardžiai.\"\"Tik žmogui, kuris nesutaria su pasauliu, reikia tvarkos, kad nepražūtų; Lila sutaria su pasauliu.\"\"Katalikas turi išpažintį, kad atsikratytų atsiminimų,- šaunus išradimas; jis atsiklaupia ir sulaužo savo tylėjimą neišsiduodamas žmonėms, o paskui atsikelia ir vėl imasi savo vaidmens tarp žmonių, išlaisvintas nuo pragaištingo troškimo būti jų atpažintas.\"\"Kodėl taip nutinka? Jūs gulit ant nugaros ir rūkot, ir pasakojat vienas kitam apie savo praeitį, vien tam, kad pasaulis, kuris nieko apie jus nenutuokia, nesužinotų apie tai daugiau, negu jūs patys.\"\"Pamažu man nusibosta šitas žaidimas, kurį jau žinau: veikti ar neveikti, abiem atvejais, žinau, tai bus tik dalis mano gyvenimo, o kitą dalį turiu įsivaizduoti; veikimą ir neveikimą galima sukeisti; kartais aš veikiu tik todėl, kad neveikimas, taip pat įmanomas, nepakeis to, kad laikas bėga, kad aš senstu...\"\"Tai butas ar namas, įrengtas taip ar anaip, tikriausiai moderniai-antikvariškai su tradicine japoniška lempa, šiaip ar taip, yra bendra vonia, kasdieninis vaizdas su skirtingais priežiūros reikmenimis dviems kūnams - moteriškam ir vyriškam.Kartais jūs imat ilgėtis. Nė vienas iš jūsų neturit artimo žmogaus, ne, net prisiminimuose, netgi viltyse. Ar galima būti labiau susirišus, nei jūs? Negalima.\"\"Taigi vėl, kaip kadaise, praleidžiate begalinę dieną vilkėdami chalatus ir klausydamiesi plokštelių. O paskui abipusis smalsumas vėl pamažu išnyksta, be žodžių ir beveik be ženklų, tik pasislepia už dienos rūpesčių.\"\"Belieka prisirišimas, tylus, gilus ir beveik nepažeidžiamas prisirišimas. Argi jis nieko nereiškia? Jūs beveik viską patyrėte, išskyrus pabaigą, jums ne naujiena, kad vienas iš jūsų pabėga į naktį, kad pykstatės, kad nieko nepadeda, jei tylite dvi dienas, jūs - pora, visada laisva, bet pora.\"\"Nebus nieko beprotiškesnio nei jūsų meilė anuomet, geriausiu atveju tokia pati. Ar ji buvo beprotiška? Apie tai jūs nekalbat, švelniai saugodami dabartį.\"\"Ten galėtų būti kitas vyras, kita moteris, jūs tai žinot ir žvelgiat vienas į kitą, stengdamiesi įgyti kilnumo per beprasmę ironiją.\"\"Tik jis vienintelis ir suteikia tą laukinį kažko kito, saldaus, karšto jausmą, tą begalinį jausmą, bent jau išvirkštinę jo pusę.\"\"užtenka mielo balso telefono ragelyje, ir jūs sugrįžtat atgal, kad prisipažintumėt arba ne, ir vėl gyvenate kasdienybėje, kuri ir yra tikrovė, su pižama ir dantų šepetėliu putotoje burnoje, vienas priešais kitą, su muziejiniu nuogumu vonioje, nuogumu, kuris nejaudina, ir kalbatės vonios kambaryje apie svečius, kurie ką tik išėjo, ir apie jus jungiantį dvasinį pasaulį.\"\"Jus vėl įtraukė santuoka, ir jūs pasibučiuojate, lyg dėtumėt tašką. Jūs ilgitės: ne vienas kito, nes jūs abu juk čia, jūs ilgitės išėjimo už vienas kito ribų, bet kartu.\"\"Jums nereikia virvinių kopėčių, kad galėtumėt pasibučiuoti, nereikia slėptuvės, ir nėra jokios lakštingalos ar vyturio, kuris ragintų bėgti, joks persekiojimas jūsų nesuartina, joks draudimas, jokia baimė, kad jūsų nuodėminga meilė bus atskleista. Jūs įteisinti. Kas jums trikdo: tik jūsų kūnai. Dabar jūs dar surūkote po cigaretę, kalbatės, skaitote laikraštį lovoje.\"\"Dabar užgesinate cigaretę. Praeitis jau nebe paslaptis, dabartis nyki, nes ji vis labiau dėvisi diena po dienos, o ateitis yra senėjimas....\"\"Man visgi įdomu:kas manęs laukia oro uoste.Žiūriu:jei ji juodais plaukais ir drėgnomis pilkomis akimis, didelėmis akimis ir putliomis lūpomis, bet tokiomis, kad jos niekad neuždengia priekinių dantų, ir turi mažytį apgamą už kairės ausies, tuomet aš esu tas kitas, kuris tąkart neišskrido.\"\"Visą laiką tematau jos akis, ji kaip vaikas, kartą paklausiu jos, apie ką galvoja, jos akys pažvelgia į mane, ir aš jau žinau, kad ji ne vaikas.\"\"Ir jo mintys tik apie jų įsčias, jų įsčiose: jie galvoja ne apie tas, kurias pažįsta, bet apie visas, kurių neturėjo; įsčios, burnos ir jo liežuvis jų burnose.\"\"Artuma ar toluma, viskas vis viena, jo lova, ciferblatas, tarškantys skrysčiai: daiktai, kurie pergyvens Enderliną.\"\"Mano buvimas čia kaip faktas: aš ne kur nors kitur.\"\"Nenoriu pasakyti, kad jie persekioja mane mano mintyse,- tai aš juos persekioju, man smalsu, kaip jie elgtųsi vienoje ar kitoje situacijoje, ir nesu tikras, kaip jie tikrovėje elgiasi. Jų tikrasis elgesys veikiausiai nuviltų, bet tai niekis; jiems lieka mano lūkesčių erdvė.\"\"Jos tylėjimas higieniškesnis.\"\"Tik meilė liūdi taip giliai sielos viduje.\"\"Ji sveika, net stipri, bet smulki, tad malonu švelniai dėl jos baimintis.\"\"vyšnios ir cigaretė, kaip jau čia ir kalbėti?\"\"Ką Svoboda mato:Gatvės, juodos, pilkos, baltos, geltonos, karštas asfaltas arba betonas, asfaltas miraže, prožiniai, posūkiai, kuriais jau važiuotą nesuskaičiuojamą daugybę kartų, pakelės stulpai, žymintys nuotolį, šešėliuotos alėjos, asilų traukiami vežimai, dervos statinės, priemiesčiai, laivai uoste, žmonės, raudona šviesaforų šviesa, skurdas, geležinkelių pylimai, krovininis traukinys su jūra tarp ratų, pajūris su posūkiais dešinėn ir posūkiais kairėn, dešinėn ir toliau, antras bėgis, trečias bėgis, antras bėgis, autobusai užpakalyje, dulkės nuo sunkvežimių užpakalyje, geležinkelio pervažos, jūra, kaktusai, jūra, prožirniai, jūra, tiltai, vienas po kito kaimai, miesteliai, aikštės su paminklais, prieblandoje klajojančios ugnelės, medžiai žibintų šviesoje, pakelės akmenys žibintų šviesoje, staiga baltas jaučių kinkinys, meldai žibintų šviesoje, jūra kaip tamsa neįžvelgiama, užpakalinės šviesos, avių bandos tarsi žalių akių knibždėlynas žibintų šviesoje, rankos ant vairo, asfaltas mėnulio šviesoje, mėnulis virš jūros, pakelės akmenys žibintų šviesoje, gatvė, rankos ant vairo, gatvė ir t.t.Ko Svoboda nemato:.... jos veido.\"\"pasaulis susitapatina su partneriu, o ne su manimi, meilė mane tik suvienijo su mano pamišimu.\"\"Ponas, kurį kartais matydavau, kadaise asmenybė, išsilavinęs vyras, tai dar nereiškia, kad jis negalėtų taip pasielgti; pažįstu pavydą, kurio neįveiks joks išsilavinimas. Priešingai, išsilavinimas pavydą tik kaupia, kol šis tampa visai primityvus.\"\"Vienintelis tikras dalykas, kurį žinau apie Lilą: tokios jos, kokią įsivaizduoju, nėra; galbūt, kada nors ir aš matysiu Lilą iš šono...\"\"Nuobodulys žvelgiant į jūrą, džiaugsmingas nuobodulys: nebūti mirusiam ir neprivalėti gyventi...\"\"Jos veidą, kurį ji paslepia po cigarečių dūmų šydu, matau veidrodyje. Gražus. Ji tai žino ir dedasi neišvaizdžia.\"\"Meilės verta moteris.\"\"Ji žvali, atrodo, lengva kaip žuvėdra.\"\"Priešpaskutinis vakaras:Jie šoka, dama, kuri galėtų būti Lila, ir jaunasis inžinierius. Jos veidas virš jo peties - veidas, kurį bergždžiai bandau aprašyti: pakanka jai nuleisti vokus, nukreipti žvilgsnį į tolį ar į ką nors artimą, ranka nubraukti plaukus už ausies - profilis, ir paskui vėl jos juokas - iš priekio, pasisukimas, šviesos pasikeitimas; perėjimas nuo juoko į tylėjimą, pakanka surauktos kaktos, kad visi epitetai, kuriuos surinkau, paprastai atšoktų nuo jos veido...\"\"Perskaičiau iki galo savo knygą, daugiau visiškai nieko neveikiau per šias ilgas trumpas dienas.\"\"O juk jis tikrai neturėjo revolverio; jis tik darė tokį įspūdį; jis atėjo ne jos nušauti, bet vesti.\"\"Aš aklas. Prisimenu tai ne visada, bet kartais. Paskui vėl svarstau, kad gal istorijos, kurias galiu įsivaizduoti, visgi yra mano gyvenimas. Netikiu. Negaliu tikėti, kad tai, ką matau, ir yra gyvenimas.\"Naratorius kaip konstruktas; nuotolis nuo subjektų nuolat keičiamas, pereinama iš stambaus plano į bendrą arba vidutinį ir atvirkščiai. Pirmyn atgal."}, {"userName": "Juliane", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/1072178-juliane", "userReview": "I have to admit, that this one is definitely my favourite book by Max Frisch. Gantenbein continues to explore the uneasy fascination with problems of personal identity, a topic which you can find in all of Max Frisch's novels. The narrative architecture of Gantenbein is manifestly chaotic. But that doesn't matter. The narrative perspective shifts periodically between the unnamed third person to any one of three named first person narrators, sometimes within a single sentence. I loved most the role of Gantenbein, who is opting for a existance in simulated (or fake) blindness to better watch his fellow passengers. Gantenbein believes, that also his fellow passengers are playing a special role and that they try to mislead him. Gantenbein is playing his part so well, that everyone is buying his story, but he has to be careful, always having his role in mind. Until the day, where he is getting out of his role...Max Frisch's role playing is both misleading and fatal to love because it renders impossible the necessary adjustments and compromises involved in a constantly evolving relationship. Absolutely recommended!"}, {"userName": "Anthony Pollmann", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/26271258-anthony-pollmann", "userReview": "Dies war höchstwahrscheinlich eines der undurchschaubarsten Romane (wenn man es etwa so nennen darf; einige kommen ja mit \"Anti-Roman\" und sonst noch was) das ich gelesen habe. Nur etwa 280 Seiten lang und doch nie leicht zu lesen, immer musste ich mich mental vorbereiten bis ich wieder zu ihm greifen konnte, ist er trotz all diesem ein grossartiger Roman; auch wenn ich wahrscheinlich nur 30% verstanden habe. Frischs Beschreibungen des Alltags, des Alterns, der Liebe, der Langeweile des modernen Menschen, seine in Geschichten konstruierten Metaphern und Gleichnisse, all dies mit einer kurzbündigen Sprache die einen immer wieder fesselt und verführt. Ich bin mir sicher das ich dieses Buch noch zig-Mal lesen muss (und werde), und das bei jeder Lektüre sich mir ein neuer Aspekt eröffnen wird der mir zuvor verschlossen geblieben war. Ich kann zu diesem Zeitpunkt nur diesen Kommentar Marcel Reich-Ranickis empfehlen der mich diesem Buch entschieden näher gebracht hat.my link text"}, {"userName": "Manuela", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/6785717-manuela", "userReview": "I think that feelings wise, anyone could find himself in some of the situations in this book. I liked how insightful and close to reality the depictions of human relationships were. 400 pages of analyzing situations, appearances, reactions, angles, perspectives of the actors involved, tiny changes of choices that might affect entire future stories - it made me wonder: what is actually real in what we perceive? Are we always making up stories?I cannot rate this book. I can't say I liked it. It did open a space for revelation. Heavy content, boring at times, heartbreaking at times.Update: I re-read it. Amazing book."}, {"userName": "Donald", "userReviewDate": "Jan 14, 2008", "userURL": "http://www.goodreads.com/user/show/778070-donald", "userReview": "Ah shit! The spine broke when someone walked into me on the subway the other day... now the brittle pulp pages are peeling off when I turn them... if anyone out there has a copy of Gantenbein (very hard to find a decent used copy of this and it is out of print as far as I know) and or Montauk as well, to trade or sell please drop me a note."}, {"userName": "Mailin", "userReviewDate": "Nov 26, 2009", "userURL": "http://www.goodreads.com/user/show/2957822-mailin", "userReview": "gutes buch, aber keine einfache lektüre! Wer Frisch mag, dem gefällt auch dieses Buch! Ich persönlich bevorzuge aber Homo Faber und Andorra. \"Mein Name sei Gantenbein\" ermöglicht es dem/der LeserIn den Mensch einmal \"anders\" kennenzulernen, ich könnte jedoch unmittelbar nach dem Lesen den Inhalt nicht wiedergeben."}, {"userName": "Evgeniy Lapin", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/36078671-evgeniy-lapin", "userReview": "Отличнейшая ядерная смесь Борхеса, Ремарка и Набокова.Дерзкая попытка ниспровержения тезиса о том, что история не терпит сослагательного наклонения.Плюс лютое количество хорошо прописанной ванили на страницу текста."}, {"userName": "Dragos Jurca", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/6061913-dragos-jurca", "userReview": "Complicated, not really catchy; however an interesting book."}, {"userName": "Adriana", "userReviewDate": "Sep 30, 2013", "userURL": "http://www.goodreads.com/user/show/19175593-adriana", "userReview": "Absolut aiuritor!"}, {"userName": "Kakha", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/44127135-kakha", "userReview": "This is a magnificent work. It is not written spontaneously, it is not created by writing free improvisation of fantasies, as it may seem at first glance. No, I think that every word in it is verified by author, like the perfect point of a sword. And every those word hits the target, it just hits. This is an excellent book, it's a classic of the 20th century."}, {"userName": "Maurizio Manco", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/71961244-maurizio-manco", "userReview": "\"Un uomo ha avuto una esperienza, ora cerca la storia che le si attaglia – non si può vivere con una esperienza, che rimanga senza storia, così pare, e certe volte m'immagino, che un altro possieda proprio la storia che s'attaglia alla mia esperienza...\" (p. 11)\"Io mi provo addosso le storie come abiti.\" (p. 21)\"Ogni uomo si inventa prima o poi una storia, che ritiene la sua vita.\" (p. 46)"}, {"userName": "Larissa Waibel", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/68360541-larissa-waibel", "userReview": "\"Jedermann erfindet sich früher oder später eine Geschichte, die er für sein Leben hält.\""}, {"userName": "Irakli", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/59150885-irakli", "userReview": "ვიქნები თუნდაც მიძარუ და ვიტყვი, რომ ვერ ვხედავ ვერაფერს განსაკუთრებულს ამ რომანში. კარგი იყო"}, {"userName": "Svetlana", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/61500408-svetlana", "userReview": "О да! Это было действительно нечто. И главное в тему, как никогда!"}, {"userName": "Roberta", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/31204432-roberta", "userReview": "3.5/5"}, {"userName": "Rosava Doshchyk", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/30932961-rosava-doshchyk", "userReview": "Ви коли-небудь уявляли собі інший розвиток подій, інші можливості, інше життя? \"А що, якби я (не)зробив те? А що, якби я познайомився з тим-то?\" Зазвичай такі питання пригнічують, виривають з реальності, видаються намарними, проте саме їх і ставить собі головний герой роману \"Нехай мене звуть Ґантенбайн\". Він уявляє собі інші реальності, де він зовсім інша людина, де його друзі й кохана теж стають іншими, де трапляються інші події, де зустрічаються нові постаті... У тих, інших, реальностях він може вдати сліпого й одружитися з гарненькою актрисою Лілею, з якою у них може скластися щасливе або ж зовсім нещасливе життя. Він може закохатися у дружину ділового партнера й після проведеної з нею ночі постаратися її забути або ж лишитися поряд. Він може стати цим самим зрадженим чоловіком, а вона — тією самою Лілею. З іншого боку, він може бути звичайним талановитим чоловіком, якого запрошують викладати до Гарвард або ж отримати вирок про невиліковну хворобу. Можливостей безліч, та де ж знаходиться справжня реальність?Чесно кажучи, роман Макса Фріша важко читати, але все ж надзвичайно цікаво. Хто ж оповідач насправді: сліпий Ґантенбайн чи Ендерлін? Чи хтось зовсім інший? Де закінчується його вигадка і починається реальність? Автор майстерно уриває кожний можливий варіант подій, щоб потім оповісти новий.Заплутана проза без головної думки? Аж ніяк. Бо людина вільна стати будь-ким. Не існує жодних перешкод для вчинків, треба лише вигадати собі нове життя, адже\"Людське життя відбувається або зникає в окремому Я, більше ніде\"."}, {"userName": "Lily", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/8001952-lily", "userReview": "\"С какой это стати незнакомый господин, который наводил на меня еще большую скуку, чем на нее, потому что я слышу его речи не в первый раз, неожиданно говорит об обаянии мужчин-гомосексуалистов, я не знаю\".Макс ФришВ залу заходит человек, которого ты хоть и не знаешь в лицо, а только по имени - ты сразу узнаешь. Разумное узнавание, ни в коем случае не интуитивное, но контекстуальное - встреча двух единственных ищущих пар глаз. Узнавание с порога, взаимное и настолько внезапное, что ты непроизвольно привстаешь, хоть уверенности и нет, хоть вы еще ничего не выяснили. Тот другой мужчина (ты тоже сегодня мужчина), кажется еще более уверенным, чем ты, еще более спонтанным. Он уверен, что ты - это ты. Полы его черного плаща развиваются, придают его спонтанности лощеной деловитости. Но ты всегда был букетом сомнений и недоразумений, и ты уже встал и обошел столик навстречу к нему, ты уже жмешь его руку, blitzkrig, из-за кулис тебя видно в пол оборота. И ты произносишь свою первую реплику - его имя с вопросительной интонацией.Он оставит за собой неизгладимое впечатление. Когда он уйдет, ты попытаешься прийти в себя, осознать себя, первым делом ты вспомнишь, что женат, и что твой брак бездетный. Какое отношение это имеет к делу, и в чем, собственно, дело. Ты расстегиваешь верхнюю пуговицу на своей рубашке, тебе душно, тебе хочется поскорее расплатиться с официантом."}, {"userName": "Artem Huletski", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/10492464-artem-huletski", "userReview": "Вы захотели притвориться слепым. Как-никак, это даёт преимущества. Помимо социальных, к вам чаще прислушиваются, нет необходимости оценивать окружающих. Это даёт перевес в любой беседе, вам доверяют - вот что важно. Вы можете стать советником. Или жениться на актрисе. Или... Вы открываете передовицу, сидя в самолёте. В трёх местах в чёрной рамочке ваше имя, несчастный случай. Слухи нисколько не преувеличены. Газета вчерашняя, вы ещё успеваете на свои похороны. Время тянется меедлеенно. Вы прилетаете и убеждаетесь: всё правильно. (Сколько дорог теперь открыто перед вами!)Или...Вы всю жизнь ищете человека, которого случайно встретили на одной из швейцарских гор. Он, несомненно, был фашистом и шпионом. Он хотел присоединить к рейху вашу страну. Как просто было разделаться с ним тогда!..Фриш прав: несостоявшееся событие всегда притягательней. Мы проживаем в мыслях каждую возможность. \"Eсть острая забава в том, чтобы, оглядываясь на прошлое, спрашивать себя, - что было бы если бы..., заменять одну случайность другой, наблюдать, как из какой-нибудь серой минуты жизни, прошедшей незаметно и бесплодно, вырастает дивное розовое событие, которое в свое время так и не вылупилось, не просияло\". (В. Набоков)- Вы рассказываете сплошные вымыслы.- Я переживаю сплошные вымыслы."}, {"userName": "Bogdan", "userReviewDate": "Dec 09, 2008", "userURL": "http://www.goodreads.com/user/show/1679953-bogdan", "userReview": "I previously heard of Max Frisch mainly as a play writer but now I now he is also a good novelist.He is starting this novel by trying different stories. Then at some point he is focusing on two stories: the one of a man that is pretending to be blind and another one that has just received and invitation to Harvard. The second one is called Enderlin, but the first one does not seem to have a name. After he is telling the introduction of his story he says \"Let my name be Gantenbein\". I like this literrary game and I hope to develope more.I have finished reading this book and I am not so much impressed about it. I somehow expected the initial game to develop into a real plot. Instead of this the author is balancing between characters and stories and is never really sure about what he wants to write in this book. I am somewhat disapointed about this.As a final remark it seems to be the kind of book that may be written by persons that have personality disorder. I might be wrong.My copy of this book is in romanian."}], "description": "A stranger walks out of a bar and is later found dead at the wheel of his car. The narrator creates the story of this man -- or, rather, two stories, based on the two personae that he has imagined. One of these is named Enderlin; the other, Gantenbein.Originally published as A Wilderness of Mirrors.", "title": "Gantenbein", "url": "https://www.goodreads.com/book/show/74183.Gantenbein", "average": 4.04, "cover": "https://images.gr-assets.com/books/1348105893l/74183.jpg", "reviews": 52, "authors": [{"url": "https://www.goodreads.com/author/show/6530.Max_Frisch", "name": "Max Frisch"}], "type": ["Fiction", "European Literature", "Classics", "Novels", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/74183.Gantenbein", "http://www.goodreads.com/book/show/582732.Mein_Name_sei_Gantenbein", "http://www.goodreads.com/book/show/15840737-mein-name-sei-gantenbein", "http://www.goodreads.com/book/show/582734.Mein_Name_sei_Gantenbein", "http://www.goodreads.com/book/show/1987766.Mein_Name_sei_Gantenbein", "http://www.goodreads.com/book/show/16050183-gantenbein", "http://www.goodreads.com/book/show/13005753-numele-meu-fie-gantenbein", "http://www.goodreads.com/book/show/32052984", "http://www.goodreads.com/book/show/32063441-il-mio-nome-sia-gantenbein", "http://www.goodreads.com/book/show/15776193-mein-name-sei-gantenbein", "http://www.goodreads.com/book/show/10009.Homo_Faber", "http://www.goodreads.com/book/show/965956.Andorra", "http://www.goodreads.com/book/show/1132279.Biedermann_und_die_Brandstifter", "http://www.goodreads.com/book/show/265102.I_m_Not_Stiller", "http://www.goodreads.com/book/show/1491384.Montauk", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}