{"ratings": 1495641, "userreviews": [{"userName": "Juushika", "userReviewDate": "Mar 26, 2008", "userURL": "http://www.goodreads.com/user/show/616321-juushika", "userReview": "Memoirs of a Geisha is an American novel, and as such the attempt at West does East, especially on the complex and delicate subject of the geisha, is compelling, interesting, but also heavy-handed and ultimately ineffective (even more so in the case of the film). It is a wonderful introduction to geisha, Japanese culture, and the East for the uninitiated Western reader, and I can see why the book is popular, but I found it disappointing. For the reader already familiar with the culture, western influences are all too clear and the book comes off as a bit clunky and imperfect. I also had some problems with the general perception of the characters by readers versus the way the characters were actually portrayed in the book--Memoirs is far from the good-willed fairy tale that people assume it is. By all means, read it, but leave it open for critique and remember that a more authentic representation of eastern culture, especially in the details, will come from the east itself.A lot of my critique stems from the fact that this movie has attained such wide-spread fame and been made into a movie, to be sure. I feel like it is being perpetuated as something it is not. Even the introduction to the book (a faux translator's note) perpetuates the myth that Memoirs is an accurate, beautiful, in-depth reflection of the life of a geisha, when in truth it is no more that historical fiction and is written by an outsider. Golden has done his research and is well-educated on his subjects, and I have no problem with people reading from, taking interest in, and even learning from this book; I do, however, think it is important that readers don't conflate the American novel with Japanese reality. They aren't the same thing, no matter how much research Golden did, and if we take the book as an accurate representation we're actually underestimating and undervaluing geisha, Japan, and Japanese culture.Because Golden attempts to write from within the geisha culture, as a Japanese woman, he must do more than report the \"facts\" of that life--he must also pretend to be a part of it. Pretend he does, acting out a role as if he has studied inflection, script, and motivation. He certainly knows what makes writing \"Japanese\" but his attempt to mimic it is not entirely successful. The emphasis on elements, the independent sentences, the visual details are too prevalent and too obvious, as if Golden is trying to call our attention to them and thus to the Japanese style of the text. He does manage to draw attention, but to me, at least, what I came away with was the sense that Golden was an American trying really hard to sound Japanese--that is, the effect betrayed the attempt and the obvious attempt ruined the sincerity of the novel, for me. I felt like I was being smacked over the head with beauty! wood! water! kimono! haiku! and I felt insulted and disappointed.The problems that I saw in the text were certainly secondary to the purpose of the text: to entertain, to introduce Western readers to Japanese culture, and to sell books (and eventually a film). They may not be obvious to all readers and they aren't so sever that the book isn't worth reading. I just think readers need to keep in mind that what Golden writes is fiction. Historical fiction, yes, but still fiction, therefore we should look for a true representation of Japanese culture within Japanese culture itself and take Memoirs with a grain of salt.I also had problems with the rushed end of the book, the belief that Sayuri is a honest, good, modest, generous person when she really acts for herself and at harm to others throughout much of the book, the perpetuation of Hatsumomo as unjustified and cruel when she has all the reason in the world, and in general the public belief that Memoirs is some sort of fairy tale when in fact it is heavy-handed, biased, and takes a biased or unrelatistic view toward situations, characters, and love. However, all of those complains are secondary, in my view, to the major complain above, and should be come obvious to the reader.Memoirs goes quickly, is compelling, and makes a good read, and I don't want to sound too unreasonably harsh on it. However, I believe the book has a lot of faults that aren't widely acknowledged and I think we as readers need to keep them in mind. This is an imperfect Western book, and while it may be a fun or good book it is not Japanese, authentic, or entirely well done."}, {"userName": "Liz Lynch", "userReviewDate": "Sep 09, 2007", "userURL": "http://www.goodreads.com/user/show/301997-liz-lynch", "userReview": "Like eating fancy dessert at a gourmet restaurant, Memoirs of a Geisha is beautiful, melts lightly off the tongue and will be forgotten shortly after it's done. The language is strikingly lovely, and Golden paints a remarkable picture of a time and place. If you're looking to learn something deep about the psychology of Japanese culture, or meet nuanced characters, then I'd steer you elsewhere. The story only skims the top of the more complicated aspects of a Japan in decline, focusing mostly on a genteel lifestyle that probably seems more appealing from the outside. There's a way in which the book, written by a man and a westerner, is slightly fetishistic, but less so than you might imagine.Another reader suggested that perhaps the superficiality of the story is intentional, and that the book, in a way, resembles a geisha. Beautiful and eager to please, yet too distant to really learn much from and ultimately little more than a beautiful, well-crafted object to be appreciated. If that's the case, Arthur Golden is remarkably clever, and I applaud him. If it's not the case, the book remains very pretty and an easy read."}, {"userName": "Sophia.", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/6520961-sophia", "userReview": "[ sleeping with The Minister so she doesn't have to undergo Nabu-whathisname as a danna (hide spoiler)]"}, {"userName": "Jeffrey Keeten", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”Whatever our struggles and triumphs, however we may suffer them, all too soon they bleed into a wash, just like watery ink on paper. “\nGeisha Mineko Iwasaki basis for Chiyo/Sayori.Chiyo, with her sister Satsu, and her mother and father live in a shack by the sea on the coast of Japan. The shack leans, and has to be propped up to keep from total collapse. Her mother is sick and on the verge of death. Her father is a fisherman, uneducated, and generally befuddled by anything that doesn’t have to do with his fishing nets. When a businessman from the village comes to them with an offer to take their girls to the city it doesn’t take much to convince the father that nearly any opportunity is better than staying there in the tilted shack by the sea. He was wrong. Or was he? Without a crystal ball or access to a series of timelines showing the variations created by changing key decisions at critical junctures how can we know? Satsu, who is fifteen, is promptly placed with a brothel. Not exactly what her father had in mind. I’m sure he was told she would be trained for “domestic service”. Chiyo, who is nine, is deemed young enough to be trained to be a geisha. She is a lovely child with startling rare gray/blue eyes. \nThose Blue Eyes are what set her apart.The Mother of her geisha house is equally startling in appearance. ”Instead of being white and clear, the whites of her eyes had a hideous yellow cast, and made me think at once of a toilet into which someone had just urinated. They were rimmed with the raw lip of her lids, in which a cloudy moisture was pooled, and all around them the skin was sagging.”Obvious a bit of a failing liver issue going on here, but wait she is really much more mugly. ”I drew my eyes downward as far as her mouth, which still hung open. The colors of her face were all mixed up: the rims of her eyelids were red like meat, and her gums and tongue were gray. And to make things more horrible, each of her lower teeth seemed to be anchored in a little pool of blood at the gums.” Okay so Chiyo lets out a gasp. She starts out her new life in trouble. It doesn’t end there. She is quickly considered a threat to the lovely and vindictive Hatsumomo who is the only fully trained geisha working for the house. Chiyo is accused of stealing (not true). She is accused of ruining an expensive kimono with ink (true but under duress). She is caught trying to escape ( she broke her arm in the process so try and give the kid a break). Well, all of this ends up costing her two years working as a housemaid when she could have been training as a geisha. She receives an unexpected benefactress, a mortal enemy of Hatsumomo named Mameha decides to take Chiyo under her wing and insure that she has another opportunity to become a geisha. Chiyo, tired of scrubbing floors and being the do-this and do-that girl of the household realizes her best chance at some form of freedom is to elevate herself. \nThe Movie based on this book was released in 2005 and directed by Rob Marshall.At age 15 her virginity or mizuage is put up for auction. It is hard not to think of this as a barbaric custom, but for a geisha, if a bidding war erupts, she can earn enough money to pay off all the debts that have accumulated for her training. Chiyo, now called Sayuri, is fortunate to have two prominent men wanting to harvest her flower. The winner is Dr. Crab who paid a record amount for the privilege.”Of course his name wasn’t really Dr. Crab, but if you’d seen him I’m sure the same name would have occurred to you, because he had his shoulders hunched up and his elbows sticking out so much, he couldn’t have done a better imitation of a crab if he’d made a study of it. He even led with one shoulder when he walked, just like a crab moving along sideways.”Not the vision that any girl would have for her first time, but ultimately it is a business transaction that frees Sayori from the bonds of debt. After the deed is done, the eel spit in the cave, Dr. Crab brought out a kit filled with bottles that would have made Dexter jealous. Each bottle has a blood sample, soaked in a cotton ball or a piece of towel of every geisha he has ever treated including the blood from his couplings for their virginity. He cuts a piece of blood soaked towel that was under Sayori and added it to the bottle with her name. Ewwehhh! with a head snapping *shiver*.The cultural obsession, every country seems to have one, with female virginity is simply pathological. Girls can’t help, but be fearful of the process. Not strapped to a table by a serial killer type fear, but still there has to be that underlying hum as the man prepares to enter her. I wonder if men, especially those who avidly pursue the deflowering of maidens, are getting off on that fear? I’ve made myself feel a little queasy now. Sayori is on her way to a successful career. She is in love with a man called The Chairman and wishes that he will become her danna, a patron, who can afford to keep a geisha as a mistress. There are people in the way, keeping them from being together, and so even though there were many geishas who wished for her level of success she still couldn’t help feeling sad. ”And then I became aware of all the magnificent silk wrapped about my body, and had the feeling I might drown in beauty. At that moment, beauty itself struck me as a kind of painful melancholy. “It was fascinating watching this young girl grow up in such a controlling environment; and yet, a system that can also be very deadly. One misstep, one bit of scandal, and many geishas found themselves ostracized by the community. They could very easily find themselves in a brothel. During WW2 the geisha community was disbanded, and the girls had to find work elsewhere. Sayori was fortunate. Despite all the hardships I know she was enduring, Arthur Golden chose not to dwell on them in great detail. I was surprised by this because authors usually want and need to press home those poignant moments, so that when the character emerges from the depths of despair the reader can have a heady emotional response to triumph over tragedy. I really did feel like I was sitting down for tea with Sayori, many years later, and she, as a way of entertaining me, was telling me her life story. Golden interviewed a retired geisha by the name of Mineko Iwasaki who later sued him for using too much of her life story to produce this book. She even had light brown eyes not as striking as Sayori's blue/gray eyes, but certainly light enough to be unusual. I wonder if Iwasaki was still the perfect geisha, keeping her story uplifting, and glossing over the aspects that could make her company uncomfortable. \nMineko IwasakiThe book is listed in the 1,001 Books You Must Read Before You Die. It was also made into a film, which I’ve been avoiding, knowing that I wanted to read the book first. I notice some reviewers take issue with Sayori. They feel she did not assert herself, and take control of her life. She does in the end, but she is patient, and waits for a moment when she can predict the outcome. I feel that she did what she needed to do to survive. Most of the time she enjoyed being a geisha. It takes a long time to learn not only the ways to entertain, but also all the rigid traditions that must be understood to be a successful geisha. As she gets older, and can clearly define the pitfalls of her actions, we see her manipulating the system in her favor. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"userName": "T.J.", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/1160349-t-j", "userReview": "Damn if you aren't one of the most problematic things I've ever read, Memoirs of a Geisha.Like much of non-Asian America, I was swept up in the delight of reading this book in 2000. I was fifteen and precocious, and the narrative was arresting. I couldn't put the book down. I wrote this in 2000:\"Golden has hit pay dirt with this masterpiece. An insightful, curious, and caring look into the mysterious world of geisha, Arthur Golden peels away the ignorance and labeling that westerners have covered the secretive Japanese profession. Although it sinks at times into a near melodramatic prose, the book's protagonist is interesting, insightful, and enjoyable. Her witty anecdotes and thoughtful mannerisms in speaking make Memoirs of a Geisha a delightful and unstoppable read.\"Then I got older, went to college and graduate school, and developed a critical, thinking eye.And I'm mad at myself.insightful? Really? God, I was naive. This novel, while entertaining is so problematic I rarely have time to descend into my criticism. It continues the Orientalism that Edward Said loathed so very much; rather than \"skillfully entering\" the world of a Japanese woman, it apes her identity, and ultimately deprives her of a voice, creating a sort of Orientalist imagination for us to enjoy without ever really seeing her. The book is still engaging as a narrative, but the sappy ending, the frankly sexist portrayals at some points, and Sayuri's outright inability to identify outside of her Chairman is rather frightening. It serves to objectify fetishism at its worst. Yet I can only give you three stars, because I'm still partly under your spell, Golden. Damn."}, {"userName": "Argona", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/349639-argona", "userReview": "I became fascinated with Japanese culture when I was a teenage girl and since then I have read many Japanese-related books and articles and have watched many movies and animes that depict parts of Japanese culture but the fact remains that I am not Japanese, I have never been to Japan and I am a foreigner, captivated by this exotic and very different culture.As a foreigner, I see many beautiful and unique aspects to Japanese culture but I also know about certain painful historical facts such as treatment of women in certain eras of Japan. My point is, I don’t want to discuss accuracy of this book regarding Geisha life. I am not Japanese and I am not a historian and therefore, I am not qualified to judge. So I keep my opinion and impression Geisha to myself.It appears that this story is based on the life of a certain geisha, but the author clearly states that both the story and characters are fictional and I am going to stick with that.I admit that I was disappointed when I realized that this turned out to be fiction, only and only because I had been told otherwise by author himself while reading the preface. I mean, what’s with the contradiction? I couldn’t understand the pretense. Why pretend this is a real story when it’s a beautiful fiction? What’s wrong with fiction? I admit, as I reached the end of the book, I came to realize why the author tried to portray this story as a real life story when writing the introduction but I will write about that later.I liked the writing style. Some people may find it pretentious but I understood that this is an attempt to write as close as possible to Japanese style of writing and story-telling and to seem poetic. The writing also helped me to see the world through Chiyo’s eyes and better understand her mind. I should mention that Chiyo and Sayuri are the same person.Some people may say, parts of the story drag on and on and yet nothing important happens. I quickly get bored but I couldn’t put this book down once I had started reading and I had already seen the movie years ago. This is not a perfect book but it is an amazing one. Little Chiyo simply captivated me with her story.I wanted her to survive, to fight and to find happiness. There isn’t a single character in this story that I actually hate. They are all different human-beings with flaws of their own that struggle to survive and get by their hard lives. Some choose to do so by crushing others and some choose to do so by fighting their way through and lending a helping hand when they can.I might have had a few explosions regarding treatment of women and the way chiyo’s mind operates if I didn’t know Japanese culture at the time of this story well enough. I have Japanese friends, so I know what I am talking about it.Chiyo is quite young when she falls in love with a man much older than her, too young in my opinion to fall in love but I understood her feelings. The moment she meets the love of her life, Chairman, is a turning point in her story and happens to be my most favorite part.Yes, she focuses her entire life on reaching this man. As a woman, I would have liked her to have bigger goals and dreams of her own and for example, seek freedom or independence but when I think about her situation, her education and upbringing, I get her.Chiyo is a slave, being trained for the sole purpose of pleasuring men. Men that mean nothing to her and are like alien beings. Up to this point, not a single person has shown her any kindness without ill intentions and when she is about to lose her faith in humanity, a man appears out of nowhere and shows her true kindness. Finally, a man means something to her. One of these men that she is supposed to serve has a face and value to her. I am not surprised she made it her life-purpose to reach him. I would have liked her to interact more with him during the course of the story but it wasn’t really necessary. Chairman was the man SHE wanted and SHE desired for herself. Considering her life, that was a big goal. And I didn’t really need to know more about Chairman. He was the symbol of true kindness. Her dedication to reach him was moving and touched me very deeply.As I said before, during parts of this story, nothing important really happens, but I was eager to learn more about Geisha life. The author is obviously well-informed and has done his research. The story was interesting enough. All characters seemed real and relatable. I even liked Hatsumomo! And even though I wanted Chiyo to reach the love of her life and therefore happiness more than anything, I liked Nobu a lot too. He was a great man but it’s not like we can change our emotions or how we feel about different people and their behaviors whenever we want to. I could feel Sayuri’s misery and fear as she had to make decisions that would ultimately hurt people dear to her, from Pumpkin to Nobu. Sayuri is simply human. She too acts selfish and neglects her friends. I don’t blame her but I wish she had acted differently at certain times, at least regarding poor Pumpkin.I also clearly felt the touch of war and the darkness that spreads over hearts and souls at such a time. The fear, pain and misery as everything changes and there is no longer any certainty to the future.I was touched by the relationship between Chairman and Nobu, even though it was only behind the scene and between the lines. Once you think about it, it was a very deep and touching bond. Although poor Sayuri had to suffer because of this very bond, I understood why Chairman had to act the way he did.The only part of the book that made me laugh and shake my head at the author, the AMERICAN author, was the part regarding American soldiers throwing candy at children. It was mentioned abruptly and I found it very funny. Two nuclear bombs and this is what Sayuri comments about. Yes, I am sure American soldiers weren’t as scary as they were supposed to be but they were still invaders. It takes time for certain wounds to heal. It’s not about American soldiers. It’s about war, invasion and loss!At the end, this is not a fairy-tale. I am a fan of fairy tales and I firmly believe in happy endings. Ironic, since in real life, I am very realistic and even cynical. But when I open a book, I want happy endings. Somewhere along the way, I had started to dream of a fairy-tale style happy ending for little Chiyo and reading the last pages of the book left me a little sad. That’s why as I mentioned above, it was after finishing the book that I understood why the author has tried to sell this story as a real one. All throughout the book, the story tries to remain realistic(Which is why sometimes nothing really happens) and it's important to remember this, when reading the bittersweet ending, Otherwise, the ending might feel a little unsatisfactory and even rushed. But the truth is, the bittersweet ending was still a happy ending, just a realistic one. Still, I wasn’t 100% happy with it. I agree that the author could have done better just by adding 50 pages or so.In conclusion, this is the beautiful story of a little innocent girl as she fights her way through life and hardships in an unfair society and struggles to reach her loved one and have a reason to simply wake up every day and live. This is not a fairy tale but it does contain certain elements of those tales therefore this book is not for everyone, but I really enjoyed it and find it very memorable and special."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "93.\tMemoirs of A Geisha, Arthur GoldenMemoirs of a Geisha is a historical novel by American author Arthur Golden, published in 1997. The novel, told in first person perspective, tells the story of a fictional geisha working in Kyoto, Japan, before and after World War II.خاطرات یک گیشا - آرتور گلدن (سخن) ادبیات؛ تاریخ نخستین خوانش: در ماه مارس سال 2003 میلادیعنوان: خاطرات یک گیشا؛ نوشته: آرتور گلدن؛ مترجم: مریم بیات؛ تهران، سخن، 1380، در 640 ص؛ شابک: 9646961703؛ موضوع: داستان - ژاپن - تاریخ - قرن 20 منمیدانم یادم نمانده کدامیک از سالهای بگذشته بود، که برای نخستین بار یک پی.دی.اف از همین کتاب با ترجمه ی بانو: مریم بیات برایم رسید، برنامه ای نوشتم تا متن پی.دی.اف را به فارسی آفیس نسخه 2003 برگردانم، بسیار سخت گذشت، بارها و بارها برنامه را مجبور شدم هوشمندتر کنم، تا این که کتاب را پس از تلاش زیاد در 174733 کلمه و در 409 صفحه ی 31 سطری، و هر سطر میانگین 22 واژه، و هر واژه میانگین بیش از 4 حرف، برای خویش آراستم، البته باز هم مجبور شدم بیشتر صفحات را ویراستاری کنمنمونه متن: یادداشت آرتور گلدن: چهارده ساله بودم، که در غروبی در بهار سال 1936 میلادی، پدرم مرا به تماشای یک برنامه رقص، در کیوتو برد. از آن برنامه تنها دو چیز را به یاد دارم. نخست این که من و پدرم تنها تماشاچی غربی در میان تماشاگران بودیم، فقط دو سه هفته بود که از کشورمان هلند به آنجا سفر کرده بودیم، بنابراین هنوز نتوانسته بودم خود را با انزوای فرهنگی تطبیق دهم، و تاثیر آن بر من هنوز فوق العاده زیاد بود. دوم اینکه خوشحال بودم، که پس از ماهها فراگیری زبان ژاپنی، آنهم به صورت فشرده، میتوانستم از حرفهایی که میشنیدم، جسته گریخته چیزی سر دربیاورم. از زنهای جوان ژاپنی که روی صحنه میرقصیدند، به جز اشکالی مبهم از کیمونوهای الوان درخشانی که بر تن داشتند، چیزی به یاد ندارم. مسلم است که به هیچ راه به ذهنم هم خطور نمیکرد که در زمان و مکانی بسیار دور، یعنی تقریباً پنجاه سال بعد، و در مکانی به دوری نیویورک، یکی از همان زنان، نزدیکترین دوستم خواهد شد، و خاطرات استثنایی اش را برایم تقریر خواهد کرددر جایگاه یک تاریخ نگار، همیشه خاطرات را به چشم منبعی از مواد نگاه میکنم. خاطرات، سوابقی را فراهم میآورد، که بیشتر به دنیای خاطره نویس مربوط است تا خود او. خاطرات با بیوگرافی فرق دارد، چون در بیوگرافی خاطره نویس نمیتواند جنبه هایی را ببیند، که برای بیوگرافی نویس امری عادی و منطقی استاتوبیوگرافی، البته اگر واقعاً چنین چیزی وجود داشته باشد، به این میماند، که از خرگوش بخواهیم برایمان بگوید: وقتی توی علفزار بالا و پایین میپرد، به چه شکل درمیآید؟ از کجا بداند؟ از طرفی، اگر بخواهیم چیزی در مورد علفزار بدانیم، هیچ کس بهتر از او نمیتواند برای ما آن را توصیف کند، مگر آنکه در نظرمان باشد که در جستجوی چیزهایی هستیم، که خرگوش، قادر به مشاهده ی آنها نیست ....؛ ا. شربیانی"}, {"userName": "Elyse", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I read this a long time ago ---(a favorite) --- Its amazing a 'male' wrote this book. (sure 'felt' like a female speaking)."}, {"userName": "Fabian", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Well, I finally got around to this one. And I think I understand its fan base and subsequent literary worth; it was the \"Gone Girl\" of the 90's. This time, the fairy tale (with \"Girl\" it seems as if we're more comfortable with the cautionary tale in the 10's) has a Cinderella and many suitors after her. It is absolutely immersive... a page turner that has as many colors as a used-up coloring book. I see the geisha in that light: like La Marilyn, the geisha are symbol of tragedy and misplaced youth and beauty.The plot is orchestrated in that well-intentioned Great Novel tradition. A Great Expectations-meets-Great Gatsby novelty item that's as pure as winter's snow, that shimmers & attracts the senses like a ruby from some volcano deep in the Pacific. Metaphors and similes are very effectively used here, & their dual purpose is clear: it tells the life story in a very non-nebulous manner, in clear, concise, not-to-be-misconstrued mode; and the words seem authentic enough to evoke an actual geisha-- it is her telling you her memoirs, sitting there with you, drinking tea.Also, Hastumomo, in the role of ugly stepsister, is an adversary from hell. Grrrreat character! Too bad she leaves the narrative at too-crucial a juncture (the anticlimax meaning, then, the immediate displacement of anything that did not fit into the societal standards from the board... Lame!). She is a worthy nemesis to our heroine--as voracious for fresh meat as a Great White. The feud between them two is the centerpiece of this Fanny Hill-like tale, this enormously feminist (?) text. For in Gion, Japan, the geisha are treated like a lot of women have been, like objects, pawns, or even disembodied ideas."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "I read this book back when it first came out. I never wrote a review of it because when I first joined GR I didn't really know what it was all about. It took a bit before it sunk in for me.Now GR members get spammed at times. The newest form of spam is review bumping. I didn't even know that existed because..well I'm a slow learner. I kept noticing the same person's reviews on my thread. Several times a day. All day. For weeks. Someone finally pointed out to me that they are bumping their reviews. Then I saw several status updates from people posting about how it was driving them bonkers. Now my friend Kat decided to take a stand..she made a awesome little badge to show we are all fabulous..not just the top reviewers, and my friend Kelly has a great idea..we are gonna spread some love. Everyone on GR is Goodreads Fabulous.Here's my friend Argona's review for this book. Her's is much better than anything I could have written..Go show her some love.Argona..you are Goodreads Famous baby!"}, {"userName": "Henry Avila", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "In a small Japanese fishing village of Yoroido, on the coast of the Sea of Japan, a child Chiyo Sakamoto, 9, lives with an ancient father, dying mother, and older sister Satsu, in a dilapidated home, leaning over a cliff, the year 1929, things are tough and will get harder, as the Great Depression is about to commence...the impoverished family needs help and the two sisters are sold. Pretty Chiyo, with beautiful eyes, to become a geisha after a long apprenticeship and the unlucky, plain Satsu, an abused prostitute....In a house that never becomes a home, in the former royal capital of Kyoto, in the section called Gion, where most geisha live, and the tea houses to entertain rich men, there, the scared girl is under the complete control of three money- hungry women, who show no pity, Granny, (she has coins in her heart) the matriarch, and her two adopted daughters, Mother, the real boss, and Auntie, they love nicknames, both are as unfeeling as Granny. The only genuine geisha in residence, is stunning Hatsumomo, as beautiful as she is detestable, and takes an odd, instant hatred to the little girl and torments her nonstop. One day while doing an errand, the child starts crying in the streets, her miserable life has no joy, a man known as the chairman , the owner of an important electronics business, stops and comforts Chiyo, leaving her, his monogrammed handkerchief, it will be the most prized possession, the girl has, at last, someone cares... she falls in love, and this will remain forever. After an aborted escape try with her sister, she falls from the roof of a neighbor's house, injuring herself, things become even more dismal, Chiyo is demoted to a lowly maid in the house, no more school to learn her profession, to the elation of cruel Hatsumomo. Still life is cloudy, and is never foreseen, even the fortune -tellers, the geisha go to, often, can't predict accurately... the most successful , glamorous, admired geisha in Kyoto , Mameha, becomes her \"Big Sister\", a mentor that can help any woman rise to the top, how strange. Her name is changed later to \"Sayuri\", she returns to school, becomes a fine dancer and does a solo, at the annual celebrations in the local theater, her poster is painted by a famous alcoholic artist in town, the career prospers, but the chairman, that Sayuri constantly meets in the tea house parties, ( where the men get drunk on Sake, listen to stories told, watch the singing, the dancing, and music played by the geisha) is rather distant, and doesn't recognize the grown- up woman ... Gruff Nobu, scarred and disabled, in a war, the chairman's best friend, and second -in -command , at the electronics firm, likes Chiyo/Sayuri , he, her love, can never interfere, too much respect for his colleague, and they are so close, it is a sad, hopeless situation for Chiyo/ Sayuri ... The years roll by, and war is on the horizon, change is coming, it always is...the now renowned geisha, awaits...The most famous, popular, geisha, Mineko Iwasaki, now retired, ( one of the characters is based on her, in the novel) greatly helped Mr. Arthur Golden , in research, revealing to him, in confidence, the secrets of the mysterious life of these women , for the first time, much to her later regret..."}, {"userName": "Ana ", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "I can finally cross Memoirs of a Geisha off my list. I had my doubts about this book, but I'm happy to say I was wrong."}, {"userName": "Khadidja", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/21493936-khadidja", "userReview": "Very interesting,entertaining, and quick to read! Chiyo/Sayuri and her sister Satsu were sold into slavery at the age of 9 by their father, Sayuri tells of her traumatic arrival at the Nitta okiya (a geisha house), where she endures harsh treatment from everyone, In spite of the problems she had to face, Sayuri became the beautiful geisha accomplished in the art of entertaining men.“He was like a song I'd heard once in fragments but had been singing in my mind ever since.”“Can't you see? Every step I have taken, since I was that child on the bridge, has been to bring myself closer to you.”"}, {"userName": "Michi", "userReviewDate": "Jun 11, 2007", "userURL": "http://www.goodreads.com/user/show/126538-michi", "userReview": "Very entertaining, but kind of made me gag. Everything was written in this faux-asian \"My heart ached like cherry blossom petals floating on the river...\" bullshit."}, {"userName": "Megan B.", "userReviewDate": "Feb 13, 2008", "userURL": "http://www.goodreads.com/user/show/629570-megan-b", "userReview": "The world of Geisha is a secret and forbidden world. The shell is beautiful and seems to be a life of luxury, but the core is pure suffering. Geisha do not love, they do not choose their fate, and their life is owned by the men they entertain. They are not meant to feel. The very word geisha means moving art. That’s all they’re meant to be. Not humans but paintings. Like a sculpture, beautiful but cold as the stone their made of. Memoirs of a Geisha is a book that is based on a true story and let’s us catch a glimpse\tof the world where the women paint their faces and don’t deserve to love.Based in the 1920’s in Kyoto, Japan a young girl named Chiyo lives with her sister Satsu, in a poor town called Yoriodo along with her sick mother and elderly father. Her father sells Chiyo and her sister to Mr. Tanaka to be taken to an office where they decide that Chiyo will become Geisha for her good looks and blue eyes but Satsu will be taken to a prostitution house in the pleasure district. Chiyo is taken to the Nitta okiya (Geisha House) to become a Maiko (apprentice geisha). She breaks her leg from trying to run away and her training is stopped. Chiyo is then told that both of her parents have died. She meets the Chairmen of Iwamura Electric Company and falls in love with him. She dedicates her life for him to become her danna (not a husband but similar, the danna gives geisha kimono, and money to afford an apartment. Danna are usually wealthy men). Hatsumomo is the lead Geisha in the Okiya and is jealous of Chiyo’s good looks and the attention she gets. Thus, she treats Chiyo like the dirt she walks on. The only person in the okiya kind to Chiyo is Pumpkin, an aspiring geisha the same age as Chiyo. Her dream is to be adopted by oka-san (owner of the okiya) and be the lead geisha of the okiya. Mameha, a renowned geisha, comes to the okiya to offer to be Chiyo’s onee-san (older sister). She teaches Chiyo all of the secrets to becoming a great geiko or geisha. She is no longer known as Chiyo but, Sayuri. Sayuri meets Mameha’s danna, the Baron. He takes an unusual interest in Sayuri, and when she goes to the cherry blossom festival held at his estate he brings her into his quarters. He presents to her, a beautiful kimono. He offers to give the kimono to her if she merely would take hers off. Sayuri panics and the Baron starts removing her obi. He did not violate her, just merely looked at her. Rumors spread that Sayuri is now a worthless Meiko (Meiko must be virgins for their mizuage; their first sexual experience which is sold to the highest bidder). With her debut not far away Sayuri has to mend all wounds with the patrons who heard the rumors that Hatsumomo spread. The bidding begins and Dr. Crab, one of Sayuri’s patrons, wins her mizuage. Sayuri then becomes a geisha, and unexpectedly is adopted by oka-san and is the head of the okiya. Pumpkin is extremely upset for that was her dream. Sayuri is given yet another name, Nitta Sayuri (taking the name of the okiya is a custom in the geisha world). She then obtains a danna, a general in the army whom she doesn’t really like. War is declared on Japan. Sayuri’s danna leaves to fight in the war and is killed. Nobu, a patron and good friend, takes Sayuri into hiding in northern Japan. She lives there for years working at a dye factory owned by Nobu’s friend. Nobu comes for her and offers to become her danna. Sayuri, still in love with the Chairman, doesn’t know what to say. Nobu says that before she answers Sayuri and Pumpkin need to entertain a party with an American general to try and make peace. She accepts and tries to look like the geisha she was years before. Nobu clearly doesn’t like the General so Sayuri uses the general to make Nobu hate her. Sayuri tells Pumpkin to bring Nobu to the warehouse later at night. Sayuri brings the General with her and starts to be intimate with him. The door opens and instead of bringing Nobu as Sayuri asked, Pumpkin brought the Chairmen! The Chairmen sees and walks away. Sayuri runs to Pumpkin and asks why she would bring the Chairmen. Pumpkin says that Sayuri stole the one thing that she wanted, to be adopted by oka-san. She took what Sayuri wanted as vengeance. Sayuri is depressed. She almost certainly lost the one she loved. She gets invited to a small get together and is surprised to find that the only person in the tea house is the Chairmen. He begins by saying that Nobu was supposed to come but heard about what happened and now is livid at her. He continues that he was the one who told Nobu because he understood Sayuri’s intentions. He says that Pumpkin explained and begins to kiss Sayuri. He confesses his love to her and offers to become her danna.A danna is not a husband. Danna’s are usually married and have a geisha as a mistress. No matter how much she would like to marry the Chairmen she can’t. Sayuri moves to America because of a feud with who would inherit the Iwamura Electric Company, the Chairmen’s son-in-law married to the daughter he had with his wife or a rumored son with his mistress, Sayuri. She moves to New York and the Chairmen visits regularly.The book ends with Sayuri saying that the day Mr. Tanaka took her away was the worst and best day of her life. She says, “As a young girl I believed my life would never have been a struggle if Mr. Tanaka hadn’t torn me away from my (house Yoriodo). But now I know that our world is no more permanent than a wave rising on the ocean. Whatever our struggles and triumphs, however we may suffer them, all too soon they bleed into a wash, just like watery ink on paper.”I would highly recommend reading this book. It’s a window into a different world and makes you admire but pity the geisha. ‘Memoirs of a Geisha’ is an empowering novel that every person should read to appreciate what they have."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 29, 2008", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "A Cinderella romance that unexpectedly swept me away! Memoirs of a Geisha is a very picturesque and dramatic tale of a young village girl taken from her family and raised in Kyoto as a geisha. Usually I don't go in for romance. Don't get me wrong, I love love. But I prefer my love stories to be true. There is something immensely powerful about real love. As far as I've been able to discover, much of this story is based on the actual events of the life of former geisha Mineko Iwasaki. Why do I think so? She sued Golden for defamation of character. Apparently he included details she'd told him during their interviews that were not meant for print. Well, that's good enough for me!I was dazzled by the details and enchanted by the well-paced plot. It's not for everyone, but if you liked the movie version you shouldn't be disappointed by the book, being that the two are identical in most ways. Around the time I read Memoirs... I got the chance to visit Kyoto and made a point, as many tourists do, of seeking out the Gion District. The preservation of the area makes it worth the effort and cost of traveling in Japan. Almost medieval in its narrowness, the main historical road is a delight to behold, with its architecture and decor stuck in time as it is and the occasional geisha shuffling to and from buildings. I highly encourage a visit. Go when the cherry blossoms are in bloom. Go see a tea ceremony. Just go. You'll be glad you did."}, {"userName": "Khalid", "userReviewDate": "Apr 15, 2007", "userURL": "http://www.goodreads.com/user/show/60270-khalid", "userReview": "Memoirs of a Geisha is an amazing novel that discusses the life of a Geisha, a Japanese artist-entertainer. Both its very exotic setting, with its extremely different value system, and its fascinating plot, which grabs your interest early on and keeps you waiting for more all along, contribute to making this novel a special book worthy of reading.The best quality in this novel, in my opinion, is the way the narrator (Chiyo), tells the story. Her reflections concerning much of the events in the novel are very similar to those of the reader. At least I felt I could connect with her, and approved of – even if I didn't always agree with – many of her actions. The pain she suffered is well-depicted in the novel, we almost start to feel that pain with her; we often share the same surprises with her about the different things a geisha should or should not do, and even share the pleasures of success regardless of the fact that most of us despise the geisha way of life.A slave, sold by your own family, and trained for the sole purpose of pleasuring men, whether you like it or not. Imagine living such a life; I know I cannot. Yet, at some point, you are happy that Chiyo succeeded in becoming a geisha. If that's an indication of anything, it's the skills of the author.They say a geisha is no prostitute; well, that may be true, but as the story truly shows, the main revenue for a geisha is through sex, at least when she is a successful one. To me, sex for money, no matter how much you sugar coat it, is still some form of prostitution.I don't like what she did with Nobu, but I understand her perspective. Our emotions are not necessarily affected by how other people treat us, but by how we feel about their behavior. The chairman in my opinion was much more the Chiyo type than Nobu is, and her dedication to reach him amazes me, though not the methods she used to achieve it after her desperation. The destruction of Hatsumomo was, in my opinion, the brightest point in the story. I feel that the story, and the geisha life, has changed forever after the Second World War, so Chiyo, or any other geisha at the time for that matter, could not have been more successful after the war, nor could the story be more fun.Yet, another bright point was the encounter with the Chairman. Since Pumpkin caused the Chairman to run into Chiyo and the Minister, I knew the Chairman and Chiyo are going to have a future together. In fact, when Iwamura Electric called for Chiyo to the Ichiriki Teahouse, I guessed – correctly – that Nobu won't be there, but the Chairman.The most disappointing thing in this novel, in my opinion, is the way the author talked about the US. If the novel had talked about any other place than his country, this might have been tolerable, but when an American author, writing a novel that takes place in Japan for the most part, makes the main character fall in love with the US, and talks about it like a country much better than Japan, there is something wrong. Unless, and I hope this is the case, he did this mainly because the actual geisha upon which he based his novel had described this to him. Then I might accept it."}, {"userName": "Arah-Lynda", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "A beautiful, poingnant story that is so incredibly, lyrically captivating you are seduced from the very first word. An absolute work of art, each page overflows with beautiful, sensual, evocative images. Such is the skill and authority of Golden's writing, I feel as though I have spent hours, being entertained by the most gifted of all Geisha. Utterly Satisfying. I want to read it again for the very first time!"}, {"userName": "Katie", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/1229614-katie", "userReview": "I've read this book 3 times now and each time I pick it up, I forget how much I disliked reading it the last time. On the surface, the book presents an interesting subject. The life of a geisha is fascinating, especially to a westerner who has little knowledge of Japanese culture. Golden does do a fine job describing the day to day rituals, life and culture of a Kyoto geisha in the 1930's. However, once you get past the exotic subject matter, the plot proves itself to be particularly trite and inane. The Chairman comforts Sayrui when she is very young and distressed; she then falls in love with him after this brief encounter and spends the next 20 years or so of her life attempting to find some way to be with him. Her devotion remains strong, despite the fact that the Chairman never shows any inclination that he cares for her at all or that he even realizes that the talented geisha Sayuri is the little girl that he once gave his handkerchief to. She is an intelligent and resourceful woman, yet she can see no other way to be happy in her life than to be the object of the Chairman's affection. Golden ties up the novel with a neat little bow. After Sayuri has betrayed Nobu - a man who has for years proven that he will respect and care for her - the Chairman confesses that he has always loved Sayuri and that he is the reason why Mameha decided to become Sayuri's older sister. He becomes Sayuri's danna and convinces her to give up the life of a geisha, isolating Sayuri from the only life and people she has ever known. The whole story feels implausible.While Golden attempts to write in a very flowery and elegant style, it comes across as forced and clunky and is ultimately distracting from the story."}, {"userName": "Mariah", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/22371819-mariah", "userReview": "I read this book for the Goodreads' book club Diversity in All Forms! If you would like to join the discussion here is the link: https://www.goodreads.com/topic/show/...This is a realistic-fiction story about geishas in Japan. The book is based off of a lot of research the author did and what their lives were like. The book was very good and detailed their everyday experiences. Geisha's whole purpose was to be trained to beguile the most powerful men. Their whole life as a geisha is to be surrounded by men."}, {"userName": "Saffron", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/16349243-saffron", "userReview": "Jesus! This is one long-a$$ book. It took me two weeks to finish but I did it. And in the end, it made me cry. Now I am sad that its over. I wish this book was never-ending on paper as much as this is everlasting in my mind. Perfect. Sad. Beautiful. A great love story."}, {"userName": "Jillian", "userReviewDate": "Jun 19, 2008", "userURL": "http://www.goodreads.com/user/show/771958-jillian", "userReview": "The book in itself presents an interesting story, and makes for an entertaining read, but what bothers me about this book is that the vast majority of Western readers interpret it as a historically accurate memoir, when in fact it was written by an American author for an American audience, and therefore has achieved its success through appealing to and reinforcing the stereotypes about Japanese culture in America. Another reviewer on this website writes, \"It is a wonderful introduction to... Japanese culture,\" illustrating how many Western readers (including countless personal friends) interpret the lifestyle and culture depicted in Memoirs of a Geisha as absolute historical fact.In the tradition of Ruth Benedict's The Chrysanthemum and the Sword, Golden presents Japan and Japanese culture as \"exotic\" and \"strange,\" reinforcing the major theses of the Nihonjinron (which literally means \"theories about the Japanese\") genre..When looking at ever-popular images of a lone, white man in a crowded Tokyo street, many Westerners see the surrounding Japanese as identical to one another, and inherently different from that white man and his native culture, a belief that Golden's novel only serves to perpetuate. What disappoints me the most is that Golden holds a degree in Japanese History, and still the inaccuracies and stereotypes that he was raised with win out over historical fact in his writing. In conclusion, Golden presents an interesting story in Memoirs of a Geisha that should only be read if the reader is prepared to believe none of it.Additional readings: Yellow by Frank H. Wu, Orientalism by Edward W. Said"}, {"userName": "Zara Aimaq", "userReviewDate": "Apr 02, 2007", "userURL": "http://www.goodreads.com/user/show/46973-zara-aimaq", "userReview": "I first read this book in high school, and although I remember liking it, I don't think I was paying very much attention because I seriously thought the book was just about a bunch of Japanese hookers. But I reread it a few weeks ago, and I loved the story. Memoirs is about the life of this peasanth girl, Sayuri, in pre and post-WW2 Japan who is sold into life as an apprentive Geisha, and then ultimately, an actual Geisha. The novel is full of these really great, vivid details of a variety of characters: gorgeous but evil rivals, the heinous older ladies who run the Geisha houses and practically enslave these girls, and the Geishas' patrons. Readers discover the world of the Geisha through the eyes of Sayuri, as she struggles to find her place in this society and at the same time, follow her heart(very cliche, I know, but I don't want to give away the story!). So the Geisha are women in Japan who are trained in the arts - playing music, dancing, acting, performing tea ceremonies, etc. They make their living entertaining wealthy Japanese men (business men, doctors, political figures), usually in large groups, in tea houses. In pretty rare cases, some of the most popular Geisha undergo a binding ceremony where the geisha is hooked up for life with a Dannah- a very wealthy man who supports her and takes care of her, in exchange for intimacy with her. There are some pretty disgusting scenarios in the book where they just come off like highly-paid prostitutes, but for the most part, the girls in the book are very colorful, strong-willed, and interesting. It's just a very fascinating look into old Japanese culture."}, {"userName": "Ahmad Mustafa", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/16528684-ahmad-mustafa", "userReview": "4.5 stars This novel is very rich and full of diverse characters and shows a big deal of the classic Japanese tradition.-Every character represents an aspect and an attitude of humans-Although it is lengthy but I don't find it boring,the length of the book helped in building up the anticipation for the end,thus more satisfaction.-some people find it insulting to women,well it is a novel not the author's belief.-I kinda liked Hatsumomo and felt bad for her end,she was the salt of the book.-the age of the characters along the novel is a little peculiar,and the age difference between Sauyri and the chairman is huge if left to the readers calculations.-The writing style of the author is nice,and it seems to be affected by the meticulosity of the Japanese.I wish i have read it before watching the movie,which i will watch again after finishing it."}, {"userName": "Chloe", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/23867844-chloe", "userReview": "Absolutely  stunning  and flawless. Promoted to one of my all-time favorite books.I've no clue how the author wrote this, being that he is not a geisha, not Japanese, not a woman, not from the World War II era, etc., etc.... but it is absolutely incredible."}, {"userName": "Richard Derus", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "The Book Report: The politics of the okiya, or geisha house, closely examined through the rise of Chiyo, an unpromising girl sold into slavery by her peasant family, to become Sayuri, a sought-after and renowned geisha in pre-WWII Kyoto.Chiyo's arrival in the okiya is inauspicious, and her introduction into the horrible world of all-female hatreds and politics comes at a heavy price. She attempts to run away back to the family that sold her into slavery in the first place, which shows that kids don't think in logical patterns; fortunately, she falls off the roof and breaks her arm. Her friendship with a fellow slave, Pumpkin, thus begins, and with it the events that will lead her into rivalry with Hatsumomo, the okiya's lead geisha, and ultimately into her new identity as Sayuri, a full-fledged geisha.Golden treats us to the full world of geisha, including its roots as slavery and its unpalatable customs, such as misuage, the ritualized and monetized deflowering of barely pubescent girls as a preparatory step to their ascent into geishahood.Sayuri lives through the tribulations of having only a minimal say in the men she must serve as companion, as hetaira, as whore; she falls in love with one man, whom she cannot, for good reasons, pursue a relationship with; and she uses her wits, her wiles, and her body to survive and thrive during the national trauma of WWII and its aftermath. By the end of the story, Sayuri is a free woman, possessed of a life many many women across the world would envy, and telling us the remarkable and astonishing story of a slave girl's rise to wealth and position.My Review: Quite a lovely book to read, and really very nicely made. Well, except for that whole missing bit that we like to call “World War Two.” The author spends what, five pages maybe, on the *entire*second*world*war. One whole star off for that, so we're down to four.Then there's the whole issue of sourcing. Golden interviewed an actual reitred geisha and used her life as a basis for his novel. Nothing untoward there, is there? Well, apparently so...the lady was acknowledged in the book and she was subject to death threats and other reprisals. She sued Golden and the publishers, claiming breach of contract, and got an out-of-court settlement. Then she went on to publish her memoirs! After getting the settlement for having her privacy broached! Oh gross. Greed is a turn-off for me, and so, despite the fact that Golden didn't do jack poop wrong, half a star off. Three and a half, for those counting along.But the last half star vanished more recently than I read the book (back in 1999). It went away because Arthur Golden's source, Mineko Iwasaki, painted in her memoir a very very different picture of her life and that of a modern geisha than Golden did. Different enough that I felt the novel, representing itself as an accurate portrayal of a geisha's life, was flying false colors. It's fiction, so changing stuff up is normal and acceptable, but the background of the book is what made it interesting, the world of the okiya and its rituals and its rhythms were the *point* of my reading the book...and the source herself, in a polite Japanese way, said “pfui” to it.And now we're at three stars. All of them, at this point, are for Arthur Golden's pretty, pretty sentences."}, {"userName": "Candace", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/1640163-candace", "userReview": "Chiyo and her sister, Satsu, live in the fishing village of Yoroido, on coastal Japan. Her father gives them to Mr. Tanaka Ichiro. He sells Satsu into a brothel and Chiyo into a geisha house. Satsu escapes but nine year old Chiyo does not. Because Chiyo tried to run away with her sister, she is demoted to a maid for two years.Life in the okiya (geisha house) is difficult. Hatsumomo, a geisha who lives in the okiya, is cruel and manipulative. She lies and twist events around so that Chiyo gets in trouble. Luckily for Chiyo, Mameha, another geisha, takes an interest in Chiyo. She becomes Chiyo's older sister. Soon Chiyo's training as a geisha begins and her name will change to Sayuri.I found this novel intriguing and captivating. I stopped the description so as to not spoil the book for future readers. Chiyo/Sayuri's journey keeps the reader turning the pages to discover what happens next. I will tell you the ending is perfect for this story. Very satisfying. I am renting the movie next. Can't wait to compare it to the book. I recommend this novel to those interested in the life of a geisha. The story reads like an autobiography. It's hard to keep in mind that it's fiction. Happy reading!"}, {"userName": "Hannah", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/6940509-hannah", "userReview": "[Sayuri and the Chairman to be together forever, as the cliche goes (even though I never got of the ridiculous age difference. Creeps me out a little) (hide spoiler)]"}, {"userName": "Ashley", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/5222160-ashley", "userReview": "[My heart was also absolutely broken for Nobu. I felt that he did truly love Sayuri, and while she shouldn't have been with him if she didn't truly love him in return, I was simply saddened at the cruelty of life for him. He seemed to be a good man with good intentions. He deserved to be loved by someone with the same depth he was capable of loving. (hide spoiler)]"}, {"userName": "Maiquel Costa", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/48747877-maiquel-costa", "userReview": "Incluso 4.5. Ha sido una maravilla seguir el camino de la protagonista desde niña y conocer el mundo velado de las geishas (o al menos tan tergiversado en occidente), y tantos términos, usos y palabras desconocidas para mí. Mundo todo él que me ha resultado muy interesante; libro didáctico y de lectura entretenida. Letras con vida. Para mi su protagonista es un ser que siente, padece (y mucho) y respira. Así como todos los personajes que deambulan en la novela. Y sin querer desvelar nada, el final es lo que menos me ha convencido. Pero nada grave, simplemente un gusto personal."}], "description": "À neuf ans, dans le Japon d'avant la Seconde Guerre mondiale, Sayuri est vendue par son père, un modeste pêcheur, à une maison de plaisir de Kyoto. Dotée d'extraordinaires yeux bleus, la petite fille comprend vite qu'il faut mettre à profit la chance qui est la sienne. Elle se plie avec docilité à l'initiation difficile qui fera d'elle une vraie geisha. Art de la toilette et de la coiffure, rituel du thé, science du chant, de la danse et de l'amour : Sayuri va peu à peu se hisser au rang des geishas les plus convoitées de la ville. Les riches, les puissants se disputeront ses faveurs. Elle triomphera des pièges que lui tend la haine d'une rivale. Elle rencontrera finalement l'amour...Écrit sous la forme de mémoires, ce récit a la véracité d'un exceptionnel document et le souffle d'un grand roman. Il nous entraîne au cœur d'un univers exotique où se mêlent érotisme et perversité, cruauté et raffinement, séduction et mystère.", "title": "Geisha", "url": "http://www.goodreads.com/book/show/1566371.Geisha", "average": 4.09, "cover": "https://images.gr-assets.com/books/1355920859l/1566371.jpg", "reviews": 26642, "authors": [{"url": "https://www.goodreads.com/author/show/614.Arthur_Golden", "name": "Arthur Golden"}, {"url": "https://www.goodreads.com/author/show/342335.Annie_Hamel", "name": "Annie Hamel"}], "type": ["Fiction", "Historical", "Romance", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/1566371.Geisha", "http://www.goodreads.com/book/show/929.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/930.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/523928.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/374147.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/7617961", "http://www.goodreads.com/book/show/5496383-memoirs-of-a-geisha", "http://www.goodreads.com/book/show/191224.Memorias_de_una_geisha", "http://www.goodreads.com/book/show/98654.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/932.Memoirs_of_a_Geisha", "http://www.goodreads.com/book/show/413815.Increase_Your_Score_in_3_Minutes_a_Day", "http://www.goodreads.com/book/show/7920676-memoirs-of-a-geisha", "http://www.goodreads.com/book/show/5979323-oriental-collection", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}