{"ratings": 7913, "userreviews": [{"userName": "Kate (GirlReading)", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/29599654-kate-girlreading", "userReview": "This book holds such a special place in my heart. It's the book that made me realise that reading can be a truly emotional, all encompassing experience. Despite this being my three millionth reread, it was the first time I've reread it since I was about 11 and it was such a fun experience. It's heart/pounding, page-turning, brilliantly gripping and I 100% understand why I devoured it at ten years old. I definitely found some problems with it that I unsurprisingly hadn't spotted ten years ago but there's nothing in me that could give this anything less than 5/5 stars. I owe it too much and adore it too much."}, {"userName": "Natalie", "userReviewDate": "Oct 20, 2012", "userURL": "http://www.goodreads.com/user/show/13802010-natalie", "userReview": "My first review on goodreads and I'm using it rant on this book.I had really high expectations of it due to the other reviews on this site, but it seriously disappointed me. It was a short book I admit so didn't have a lot of time to really draw me in but, being one of those girls who will normally love everything, I was surprised when I reached the end of the book and still disliked it.The plot is one of those that probably looks good as a synposis but didn't really work. I found it way too fast-paced; I'm all for fast moving action scenes but we had pretty much no introduction to her life or anything before we were thrown into her realising that she may have been kidnapped. Everything just happened a bit too quickly and, to be honest, it was a little predictable.The characters were either not very likeable or realistic. Lauren was whiny and selfish but somehow still strong enough to manage to run away in a foreign country... right... and Jam's character was just unrealistic. The only character I really liked was Lauren's sister, Madison, as she was the only character the author seemed to like aswell.The writing just didn't click with me. Like many other I-want-to-be-an-author-when-I-grow-up little girls I had written many rubbish stories in the past and parts of this one just reminded me of my own failed attempts. It wasn't sophisticated, it was unrealistic, and kind of amateur.There are loads of people who love this book so I think I'm in the minority with my dislike of it, but I would not recommend it. The first half was too quick, undeveloped and not believable, and the second half was just depressing and made me dislike the main character."}, {"userName": "Aly (Fantasy4eva)", "userReviewDate": "Aug 18, 2009", "userURL": "http://www.goodreads.com/user/show/1491042-aly-fantasy4eva", "userReview": "This is one of those books that's a quick - straightforward read. I would be lying if I said it got boring becuase it didn't. It was a quick read with a decent plot, but I have to say that it was pretty predictable. Didn't wow me I suppose; didn't do anything for me actually. More of a book I'd recommend you pick up from the Library."}, {"userName": "Tanie L.", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/13314507-tanie-l", "userReview": "Before I begin, I'm going to put out a disclaimer that this is one of the first book reviews I've actually put thought into, alright, so I will sound possibly childish, overdramatic and maybe a little intolerant at times. Bear with me.Or not.I picked this book up from my school library. Overlooking the cover that looked like it was trying way too hard to look like a proper thriller book, I thought the synopsis and the blurb was pretty good. Plus, it'd won an award, right, awards don't lie.I tried to suspend my disbelief. I really did. But a few internet searches was all it took to convince Lauren that she was kidnapped? Way too unbelievable. I really don't see how information is so readily available that Lauren could be so easily convinced.The characters were totally unreal. Lauren is selfish, she whines a lot, and the general idea I get from her is \"I have a lot of problems. Nobody understands me.\" And when people call her out on being selfish and self-obsessed/centered, her reactions are basically \"No, you don't understand. I'm not being selfish, how dare you accuse me of being selfish. I just have a lot of problems.\" And somehow these \"problems\" absolve her of all guilt. I mean, I understand that maybe the author wanted her character to be imperfect. That's fine. I can empathise with a character that does selfish things occasionally. But finding multiple and repeated excuses for that? No. Just no.Jam, as well. He's good-looking, fine, we all want our male characters to be good-looking. But he reminds me strongly of Ken from the Barbie Dream House series. His role in the story is to basically run around, doing whatever Lauren wants him to do. On two occasions when he gets angry at Lauren (you go, boy! stand up for yourself and reject her ridiculous demands! note i said demands and not requests or needs.) he comes back within, what, ten minutes, apologising and acting like nothing ever happened! I mean, come on, would you really run away from your family at a friend's whim? Think it through, make some logical decisions for goodness's sake! Also, the part that really enraged me - the mentality of \"we're fourteen years old but we can run away and we'll survive. It's okay. I will protect you and we can make each other's lives beautiful and happy. With money that we stole, never mind the fact that we've repeatedly stolen money from people who care about us and run away from them with no thought to the consequences whatever.\" This guy just romanticizes everything my parents taught me about not doing. (i am fourteen too. i can think like they can.)Speaking of logical decisions - Glane. He is what I like to term an \"all-knowing but infuriatingly enigmatic guy\". He is placed there simply to1. give Jam and Lauren a place to stay when they run off (i mean, come on, a cabin in the middle of nowhere, how convenient is that? just when sonia's trying to leave them to die, too, can't have one person freezing to death maybe? just saying - when i get mad, i enjoy killing characters.)2. offer Lauren advice when she's feeling angry at her biological parents (this is how little i care. i've forgotten their names already) but remain mysterious about what she should do. it's great that he calls her out on being selfish, but again, the response is \"You don't understand me. Nobody understands my problems.\"Coming to this point, I will circle back to Lauren and rant a bit more. Or a lot.Lauren is \n\nridiculously ungrateful and insensitive.\n\n Obviously that is my childish and angry side showing.Why? Even after all she's been through (yes, i'll give her that, it is quite a dilemma) she can still worry about the things stuffed into the boots Glane lent her being made of rabbit skin. Is that a very big problem at the moment, I ask you. After having found her biological parents and going to live with them, she harbours lots of unnecessary anger. She swings back and forth from \"I hate my foster parents and my biological parents were right\" to \"I hate my biological parents and my foster parents were right\" to \"I hate everyone except Jam\". I understand it's a normal thought process for teenagers but you are giving teenagers around the world a horrible name!I'm going to be lenient here - I liked the plot line. It's not a bad plot line. However, the way it played out was way too fast and impulsive, the characters were horrible, cliche, and excused from every single mistake they made, knowingly or not.Like I mentioned, I'm fourteen too. I write as well. But when I actually step back and look at the author's writing - she writes like she's twelve, for goodness's sake. Have you seen those kids who write vampire and werewolf \"soul mate\" stories on Wattpad? That's what I'm strongly reminded of.I admit, I still wanted to know the ending and that's why I made it as far as I did, despite yelling at the pages in frustration at the way the plot progressed. My friend had to physically wrench the book away from me and dump it in the library because I was disturbing her study time.To conclude: this story had a lot of potential to expand. But it would take ridiculously long to improve. Therefore I can only say I wasted days of my life trying to understand the story Miss McKenzie was trying to tell."}, {"userName": "KKat", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/30486410-kkat", "userReview": "An manchen Stellen war die Geschichte ein bisschen übertrieben... aber sonst ließ sie sich flott lesen. Ich glaube das Buch ist auch eher für ein jüngeres Publikum gedacht ;-)"}, {"userName": "Christine Charliers", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/33273799-christine-charliers", "userReview": "Echt van genoten :)."}, {"userName": "Serendipity Reviews", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/1886570-serendipity-reviews", "userReview": "I was completely absorbed in this book from the first chapter. Sophie McKenzie hits you right in the face with every chapter ending, leaving you quickly scrabbling through the pages to find out what would happen next. Each chapter is quite short and sharp and you find yourself holding your breath in between turning to the next one.Lauren is a very strong character. As soon as she discovers that her adoption may have been a illegal, she becomes determined to find out the truth. Most people would probably have collapsed with shock, but Lauren isn't a character to mess with and she takes in on the chin and devises a plan. She is fully aware that she is probably heading straight into a dangerous situation but she carries on regardless, like bungee jumping without a safety net!During the search for her real parents, Lauren exists within her imaginary world. She has an idealistic view of how events will turn out when she finally discovers her real parents and role plays the situation continuously in her head. However, life never really turns out the way we imagine and she finds herself living in a rather tense situation. It is interesting to read how Lauren suddenly realises that she has completely changed her own destiny by pursuing her real parents and she sets off a chain reaction that can never be reversed. Here is one of my favourite parts of the book, where Lauren realises that life will not be as imagined it would be.'I sank down on the bed. Shelby was right. Annie didn't want me. She wanted the daughter she'd lost. She wanted eleven years of meals and cuddles and plasters on knees.But she didn't want me.Here, Now. As I was.And I didn't want her - I wanted the mother I had remembered. The woman I had dreamed. 'Instant realisation that reality didn't measure up to her imaginary views on the situation. Lauren found it very difficult to fit into the new family environment and struggled to see how it affected everybody else in the family. She couldn't understand how painful it had been for Annie, all she could see was that she was losing her adoptive family whom she had grown up with. A very painful read. When you read about children returning to their real parents, you feel joyous for them and never consider how they all have to learn to live together again. It must often feel like letting a stranger back into your life. Lauren found her new life very difficult, but by the end of the book she makes the right decision as she begins to realise exactly how Annie felt about her abduction when Madison was in danger. On the whole, this was a brilliant story and very well thought out. I found it fascinating to read how the mind blocks out traumatic situations from the past and was intrigued by Lauren's memory being slowly triggered. The characters were extremely well written and shined throughout the book. The pain that all the characters suffered almost dripped off the page. Jam was just a gorgeous character and his loyalty and love for Lauren was amazing. The story flows so easily and can be read in one sitting, as each chapter keeps you hooked. I just can't believe that I haven't ever read a book by Sophie McKenzie before and I will certainly be reading more."}, {"userName": "Carrie Stewart", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/5586567-carrie-stewart", "userReview": "I know this is a children's book, and therefore not for me, but I thought the writing was incredibly weak. Things happen so easily - an Internet search leads Lauren to believe she was actually kidnapped, a search done mostly because her adoptive parents bug her - and then she's off to America, ditching her mother at the airport to go to another State. I couldn't really suspend my disbelief.Also, Lauren is dreadful. She's selfish and ungrateful and I refuse to accept that it's just because she's a teenager, that's unfair to a lot of kids. She's just not a very nice person, so it's hard to care about what happens to her. She has no thought or awareness of those around her and their feelings at all. For a similar premise but, if memory serves, a better read, I recommend Caroline B Cooney's The Face on the Milk Carton books. Far more rewarding."}, {"userName": "VickyLye", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/59850839-vickylye", "userReview": "I liked this book as it was very interesting and gripped you in to keep reading."}, {"userName": "Evelyn Romp", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/12681341-evelyn-romp", "userReview": "heerlijk veel vaart, opvallend goed uitgedacht. ik vond Lauren wel echt een muts."}, {"userName": "Kim Woolfson", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/71056455-kim-woolfson", "userReview": "I thought that the book had a really fascinating storyline. I especially loved the relationship between Lauren and Madison. Even though it was good there were still some negatives. I felt as if it was really rushed throughout the book. Maybe if the author hadn't packed it so full there would have been a lot more chilling time. I also didn't feel like the author went into too much depth.I will continue the series and see how it goes."}, {"userName": "Brodie", "userReviewDate": "Dec 09, 2011", "userURL": "http://www.goodreads.com/user/show/2748076-brodie", "userReview": "Who Am I? It's a loaded question that most of us have had to ask ourselves at some point and usually struggle with an answer. But it's a question that runs much deeper for Lauren Matthews, who was adopted when she was 3 years old. She has no idea that a simple piece of homework will impact her for the rest of her life. Tired of never getting an answer from her parents about her biological family, she searches online and comes across a Missing Persons website.... where she finds a little girl who who disappeared 11 years ago. Exactly when she was adopted. A girl who frighteningly sounds like Lauren.When she runs away with her best friend Jam in tow, the pair soon realise how messy and suspicious the situation is. Could the parents she's loved and fought with her entire life really be responsible for kidnapping her? The deeper they digs, the more dangerous things become because not everyone wants the past to be uncovered. And some will go to scary lengths to keep it buried.Lauren does lack some foresight or logic. She doesn't give thought to the long-term consequences her actions will have on others. But given her age, I could excuse her often rash behaviour. There's a mission, an end goal, and she wants to reach it. She just doesn't consider what might happen after she reaches it. She's forced to face a lot of ugly truths in life. Secrets are unearthed along the way, danger is rampant and the pains of the past are finally confronted. But will anyone find a happy ending afterward?Sophie really dug deep and explored the ramifications this had on everyone. Both the legal and the emotional. On Lauren, on her adoptive family, on Jam and especially on her biological family. I think it's fair to say that her real mother, Anne, has been the most affected by this. She left her baby girl alone for mere minutes, but that's all it takes. And for any mother to lose her child, it leaves a deep, aching wound on their soul. Those years of not knowing - is she alive or dead? No sign or whisper. Just a neverending period of waiting, waiting, waiting for some clue that may never come. It's a yearning, a sadness, that's infected the whole family.There is a sweet, budding romance that develops between Lauren and Jam, who've been best friends since forever. It was cute to read and added that extra touch to the compelling mystery. While at times there is a certain amount of predictability and disbelieving moments given their age, Girl Missing makes for a fast-paced read with writing that's easy to fall into, but hard to pull out of. It's that kind if novel that proves nothing in life is clean-cut. If you dig deep enough you'll find that every situation, every action, is layered with desperation, hope, love, greed or power. This is a novel of one girls quest to find herself, but learns the answer to that question is never easy."}, {"userName": "Niyati", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/59894533-niyati", "userReview": "When I picked up 'Girl, Missing' I wasn’t that excited about it but I very quickly came to realize that I definitely should have been very excited about this book! From the first few pages I was totally intrigued by what had happened and what was going to happen. Both the past and future was so unknown, I loved it. Everything happened so fast I didn't even have a second in which to stop and let what had happened sink in let a lone stop to do anything else, I couldn't put the book down! Lovely quick read definitely a 5/5!"}, {"userName": "Jordan", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/23117517-jordan", "userReview": "It was an AMAZING book! I couldn't put the book down"}, {"userName": "Lainy", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/3642368-lainy", "userReview": "Time taken to read - 1 day Pages - 301Publisher - Simon & SchusterBlurb from GoodreadsLauren has always known she was adopted but when a little research turns up the possibility that she was snatched from an American family as a baby, suddenly Lauren's life seems like a sham. How can she find her biological parents? And are her adoptive parents really responsible for kidnapping her? She manages to wangle a trip across the Atlantic where she runs away to try and find the truth. But the circumstances of her disappearance are murky and Lauren's kidnappers are still at large and willing to do anything to keep her silent...My ReviewLauren is our main character, a teenager going through the whole attitude and trying to find herself thing, add to that she knows she is adopted and needs more information. Her adopted parents aren't very forthcoming with information so Lauren decides to do some digging and sets off on an adventure to uncover the truth of her birth mother. With limited information, a name and the adoption agency, Lauren sneaks off with only her friend Jam. Soon the pair are digging into things some people would left buried coming into grave danger and shaking up many lives.This book is aimed at young adult and whilst I have read and enjoyed these types of books before I felt this one probably would be received better by a younger audience. The main character is very unlikable, even with the teen attitude she is a bit of a selfish horror although I think this is to ring true with modern day teenagers. She is focused on her goal and hell mind anyone who gets in the way. The book has some drama, bad guys, good guys, family dynamics, relationships and a look at the impact adoption can have on those affected. The chapters are relatively short which I do enjoy, especially with work you don't always get a good run at a book but with short chapters you can dip in and out. There was quite a bit I found you needed to suspend reality to swallow some of the actions and scenes played out. Otherwise quite an engaging wee read, this was my first time reading this author, I would certainly read her again, 3/5 for me this time."}, {"userName": "Jodie", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/4144538-jodie", "userReview": "www.booksforcompany.comWhen I picked up 'Girl, Missing' I wasn’t that excited about it but I very quickly came to realise that I definitely should have been very excited about this book! From the first few pages I was totally intrigued by what had happened and what was going to happen. Both the past and future was so unknown, I loved it. Everything happened so fast I didn't even have a second in which to stop and let what had happened sink in let a lone stop to do anything else, I couldn't put the book down!Lauren is a character who I straight away warmed to and although she sometimes frustrated me with poor and rushed decisions I can see why mistakes were made as she was under a lot of pressure and in a very difficult situation. I liked how Sophie made it clear that Lauren knew that she had made mistakes, it made everything feel more real.I really enjoyed how Sophie presented all the characters and that Lauren’s feeling towards each of the characters around her were clear throughout the book but not in a way where you couldn't still make up your own mind about them. I always find it really important that you can make up your own mind about the characters you are getting to know in the book. I think this book definitely has a great mix of an engrossing story line, great characters and also written in a great way which leads to me becoming totally gripped` to the point where I had to force myself to actually put the book down, the pages just flew by! I couldn’t believe it when I kept realising how far through the book I was but also how much had happened.The twists throughout this book were what kept me totally gripped, in the end I was totally expecting more twists and I was never disappointed. What I loved even more was how with the twists which I could sort of see coming there was another twist with that one, everything was so unpredictable. I LOVED IT!Over all Girl,Missing is an addictive read which you will become totally absorbed in very quickly. Everything is very fasted paced and it's impossible to become bored while reading this!"}, {"userName": "Lois", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/10952686-lois", "userReview": "I propose you should read \"girl missing\" by Sophie McKenzie, because it is worth reading. I say this because I think it is a good book. It only took me a day to read because I couldn't put the book down-it was too interesting and I didnt want to leave where I was.In \"girl missing\", there are many emotional parts, but also there are some funny points.The book is about a teenage girl called Lauren (also known as Martha),trying to find out about her past. Thoughb this may sound simple,it has a vast amount of disaters in it. She has a best friend called Jam (also known as James) who helps her through every moment of this. This book is aimed at teenagers or maybe a little bit older, because Lauren was 14. This may cause tears to peoples eyes, but believe me you'll want to read more and more and more. This book is one of the most amazing, perfessional, emotional books I've ever read, and it links to reality. Would you ever travel half way around the world without telling your parents to find out who your real family is, even if theres only a slight chance that they'd be there? Lauren went through loads of trouble trying to reach the truth, so it is highly horrible near the end when she realises shes found out the truth, and she doesnt know what to do next. Even if you only read the blurb to this lifetelling story, you'd simply become addicted to it, just like I did. It won the 2007 Bolton Children's Book Award, the 2008 Manchester Book Award and the 2007 Red House Children's Book Award for Older Readers,as well as being longlisted for the Carnegie Medal.It was also one of the books picked for the Richard & Judy Children's Book Club."}, {"userName": "Zoe", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/5032240-zoe", "userReview": "Wow. Just simply....wow! Girl, Missing is probably one of my favourite reads ever! I could read it again and again and it would still be No. 1. Well done Sophie, you should be proud. It is a proper page-turner which will capture readers old and new.This novel is about Lauren, an adopted girl who feels lost and unloved. She is determined to find out the truth about her, but does the truth lead to danger?One day Lauren finds a missing childrens website and is bored. She types her name into the search box and a girl named Martha Lauren Purditt pops up off the screen. She begins to wonder after traces of evidence...is this her?Straight away McKenzie gets your attention. The opening line reads 'Who am I?', and it is impossible not to read on. During the book you are never bored. Something happens in every chapter that leaves you hanging. Everthing was just brilliant about this story; the charcters, storyline...everything! My only complaint is that the cover is not very appealing. I can't tell you too much without spoiling the story, so you might as well read it!I recommend this for everyone about 11 and above. Even though the story is seen through the eyes of a girl, this novel is definitely worth reading for both genders. My favourite charcter was Jam. He stuck by Lauren, even when she was being slightly selfish at times. I particuarly loved the romance, it was perfect.I am definitely interested in more of Sophie's books, especially the sequel to this coming out soon! Sister, Missing will be published in the autumn and I have pre-ordered it. I LOVED this book - read it now!!"}, {"userName": "Stephanie (Stepping out of the Page)", "userReviewDate": "Oct 15, 2010", "userURL": "http://www.goodreads.com/user/show/2485722-stephanie-stepping-out-of-the-page", "userReview": "The premise of this book was very good indeed. The plot had some interesting twist and turns but the thing that somewhat spoiled this book for me was the fact that it was just too far-fetched, with the boat section bordering on ridiculous. If I was younger, I may have enjoyed this book more but it was still quite a page turner with it's fast pace and interesting storyline. I didn't get bored reading this. The plot was good and I liked most of the characters, but I do feel that the book couldve been developed more in a more realistic manner."}, {"userName": "Poppy fairy ", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "Girl Missing paperback is the 10th anniversary edition including exclusive content. I loved this story about Lauren who finds out that she adopted and discovers that she had been snatched from her real family as a baby. Lauren and her friend take a journey from London to the USA to trace her real parents. This story is a quite tearful at times. Sophie McKenzie got the idea for this story by surfing on the net and came across a missing children's website. I have read Trust in Me by Sophie McKenzie that I also recommend."}, {"userName": "Chelsey", "userReviewDate": "Feb 13, 2011", "userURL": "http://www.goodreads.com/user/show/4974950-chelsey", "userReview": "When people ask me what is your favourite book this novel always seems to pop up in my mind. A thrilling tale that teenagers will love and once you've started you cannot put it down. I read this book in two days and even resorted to reading it in class as i was so fixated with the story and the characters included in the book. I would highly reccomened this book."}, {"userName": "Veronica", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/18522390-veronica", "userReview": "I CAN'T EXPLAIN how much I love this trilogy! They're action packed and the story begins as soon as you open the book. I will admit that I read it a while ago so can't remember a lot but I enjoyed the trilogy thoroughly!! Definitely read."}, {"userName": "Rosianna", "userReviewDate": "Jan 05, 2008", "userURL": "http://www.goodreads.com/user/show/731288-rosianna", "userReview": "Appalling. Enough said."}, {"userName": "Anna", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/34323453-anna", "userReview": "It is one of my favourite books so far!! So sad at parts and so happy! Highly Reccomend to anyone!!!:)"}, {"userName": "Dagmar", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/38109673-dagmar", "userReview": "4.5 starsOnvoorspelbaar en super spannend!"}, {"userName": "Emily Ross", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/55823446-emily-ross", "userReview": "I loved this book as a child, but rereading it as an adult kinda makes it lose its shine. The entire book is based on happenstance and guesswork (being that Lauren clicks on a random google search weblink and then her friend does an age progression of a stolen child that looks like her. Plus, the idea that there are only three girls with Lauren in their name that were kidnapped in 1995 worldwide is absolutely ludicrous) and luck. There is an incredible amount of luck.That being said, I still really like it. I love how it actually shows that there isn’t always that perfect bond from the moment that a child is reunited with a family (Dead to You also does this remarkably well) and I thought that the two families were characterised well, especially for how short the novel was. It would have been nice to see more of Shelby and the relationship between her and Lauren, but this was only book 1."}, {"userName": "Nikki", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/46429556-nikki", "userReview": "I enjoyed the mystery/ thriller elements of this book but it wasn’t quite what I wanted it to be. The villains were a little two dimensional, and the main character Lauren isn’t terribly likeable. I do sympathise with her situation and her drive though - I think her age is also a problem, she was just a bit young for the situation. However, I do think it’s a good quick mystery and some of the side characters (especially Madison! 💙) were very enjoyable."}, {"userName": "15GuptaM", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/68658746-15guptam", "userReview": "I loved this book and it is definitely going to be a firm favourite for a while. I thought it was quite predictable but there were so many twists that I couldn't predict and was very clever albeit a bit unrealistic."}, {"userName": "15watkinsc", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/68574448-15watkinsc", "userReview": "This was a really good book which I really enjoyed reading. I thought that the plot of the book was very interesting and I really liked how Lauren kept on discovering how more about her past life that was really unexpected. I also loved the ending, as the boat was sinking I didnt know what they were going to do and I loved how Jam had been on the boat the whole time and saved Lauren and Madi. I did think the ending was a bit rushed and it could have gone into more detail but it was still really good. I would definately recommend this book."}, {"userName": "15deradourh", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/68655135-15deradourh", "userReview": "It was good but the start was really boring, but the end was really good."}], "description": "Lauren has always known she was adopted but when a little research turns up the possibility that she was snatched from an American family as a baby, suddenly Lauren's life seems like a sham. How can she find her biological parents? And are her adoptive parents really responsible for kidnapping her?", "title": "Girl, Missing\n      \n          (Girl, Missing #1)", "url": "http://www.goodreads.com/book/show/2149385.Girl_Missing", "average": 3.97, "cover": "https://images.gr-assets.com/books/1348668280l/2149385.jpg", "reviews": 513, "authors": [{"url": "https://www.goodreads.com/author/show/976887.Sophie_McKenzie", "name": "Sophie McKenzie"}], "type": ["Young Adult", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/2149385.Girl_Missing", "http://www.goodreads.com/book/show/16153034-lauren-vermisst", "http://www.goodreads.com/book/show/25552936-vermist", "http://www.goodreads.com/book/show/12449220-girl-missing", "http://www.goodreads.com/book/show/31948686-girl-missing", "http://www.goodreads.com/book/show/2149388.Blood_Ties", "http://www.goodreads.com/book/show/16045220-close-my-eyes", "http://www.goodreads.com/book/show/10396147-sister-missing", "http://www.goodreads.com/book/show/6562560-the-set-up", "http://www.goodreads.com/book/show/8602864-blood-ransom"]}