{"ratings": 28963, "userreviews": [{"userName": "Ron", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "For those who may not know, Jeff Shaara is the son of Michael Shaara who wrote The Killer Angels. Without that great book, there would be no Gods and Generals, or the many other books Jeff has written since this first one. Let me first talk about The Killer Angels. Winner of the Pulitzer Prize in 1975, it did not receive the public recognition it deserved until after Michael Shaara’s death at age 50. That’s sad to me, because it is such a good book. The recognition finally came when the movie Gettysburg, based on the book, was released in 1993. Shaara didn’t get to realize this, but his son did. I had just assumed it was Jeff’s idea to continue his dad’s work, creating the two books that would sandwich his dad’s novel. In actuality the idea for those two books came from the publishers. Jeff had never even attempted writing. This would be his first book. Well, I think writing is in the family genes. I have read that he doesn’t quite write with the prose that his dad did. It’s been too long since reading The Killer Angels for me to judge. I just know that the story he created here in Gods and Generals is very good. Gods and Generals is a “personalized historical novel”. Like The Killer Angels, it is a character driven story, wholly based on the detailed facts of our country’s Civil War. What’s so good about these books is the getting to know the soldiers. Each man struggled with fear, and hoped for the life on the other side of this war, knowing this certain day of battle may be their last. If you’ve ever watched Ken Burns’ The Civil War documentary, then you’ll know what I’m saying. It’s like seeing men and women from the past. Chamberlain was a school teacher who volunteered for war because believed in his country. Hancock was a brave leader hampered by the generals above his status. Jackson was a brilliant strategist, and devout Christian with a soft heart that I didn’t know about. Lee never wanted the war, did not believe in slavery, but like each man brought to war he would defend the state he called home.So, I didn’t love it like I did The Killer Angels, but I liked it very much. I liked going back to this pivotal period of time and our country’s fate. All wars suck. This war was so devastating to so many. It can’t be forgotten."}, {"userName": "Nadia Awadi", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/35852954-nadia-awadi", "userReview": "I'm going to quote the words of Jason Mraz and say:\n\" I won't give up on us God knows I'm tough enough We've got a lot to learn God knows we're worth it.\"Well it turns out I'm not tough enough and this book wasn't worth it. Oh, and I'm totally giving up on us. Rating: \n2.75 stars\nThis book is the story of 4 generals (or maybe more. I seriously don't know) and what they went through during the Civil war.Seems exciting enough. The problem is I don't read historical fiction but this book was so cheap: I just couldn't help myself.This book was like a map and I'm horrible with directions. Also, I'm not American so I didn't know half of the places the author was talking about. Why 2.75 stars?The good:*The writing was pretty great.*I liked some of the characters and understood their decisions regarding which side they supported: North or South.*The character's stories, background and difference in faith was enjoyable to read about.The bad:*Description, description and did I mention the description?*I liked the characters but I didn't LIKE the characters.*War startegies and politics. So hard to understand.*Slow P..A...C....EIf you like politics and historical fiction, you will really like this book.Maybe when I'm wiser and older, I will finish reading it and like it.Probably not: about being wiser and finishing the book"}, {"userName": "Lauren", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/2326376-lauren", "userReview": "I love how Jeff Shaara writes. It takes some getting used to, yes, but once you get used to it...Brilliant! Outstanding!!!!!! I especially love how he focuses on the army, barely touches the political side of the war-and when the political side is touched, it's mostly negative.I'd never thought to deeply about the Civil war until this school year. Now, with this book coming to top off my school year, I must say history is a whole lot more complicated then I thought.The story begins in 1858 (57??? not sure which) with some background information on the men the story focused on: Robert E. Lee, Winfeild Scott Hancock, Thomas J. \"Stonewall\" Jackson, and Joshua Lauwrence Chamberlain. These four men and their experiences in the Civil War form the main story. I knew most of the battle's outcomes due to reading \"Stonewall Jackson: a portrait of a soldier,\" right before reading \"Gods and Generals.\" But all the same, the masterful way Shaara wove the story...It was amazing. Actually, though, the thing that fascinated me the most was the Generals of the North. A parade of men going through. President Lincoln really didn't have much luck at all choosing a commander. I lost track of how many generals had been in command and had to look it up. I think by the Battle of Chancellorsville, there'd been at least 4 different commanders. I wish highschools would teach history like this. Most of my friends hate social studies, but I ADORE history. Read this book! One of the most wonderful books on the main Civil War battles I've read in a long time."}, {"userName": "Christine", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/1473665-christine", "userReview": "This book could be considered the prequel to THE KILLER ANGELS (reviewed separately), written by Mr. Shaara’s father. This book takes a unique perspective leading up to the Civil War, introducing us to the notable historical figures in that confrontation. Mr. Shaara shares with the reader, through excellent characterization and dialogue why the Civil war was so important to these men. The author manages to bring to life the years leading up to the Civil War. Seemingly historically accurate, this book answered many of my questions about why this battle even happened. Obviously, the dialogue and innermost thoughts expressed by the “characters” in this book are speculation but the book did serve it’s purpose for me. It did answer any questions in my mind in a colorful, non-textbook way.Although, as mentioned, I generally shy away from “war” books, I do enjoy historical fiction and in my opinion, this was historical fiction at its best."}, {"userName": "Mom", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/7813734-mom", "userReview": "I really don't know what happened with Jeff Shaara from this book to his second attempt, The Last Full Measure, but I enjoyed this book more. There is still the rambling on, and the writing still has the same irritating problems, but not to the same extent as Measure. I still enjoy the historic events told in a comprehensible way; it fulfills my need to understand the order in which things happened. I must say, I could not read two pages where he goes on about the death of General Jackson, it is just too heart-wrenching. Even though I knew it was coming, I still was not able to read it. All in all, a much better read than his second novel."}, {"userName": "Gaga", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/48007885-gaga", "userReview": "I like historical fiction and picked up this book for that reason. However, it seems less like fiction and more like military history. This book seemed to me to be endless descriptions of what every general on both sides was doing during the Civil War--and not the whole Civil War, but just until 1863. This is the first book by either of the Shaaras that I have read, and I won't read another. Obviously, I didn't know what I was getting into because I know he is very well regarded by many people."}, {"userName": "Michal", "userReviewDate": "Dec 03, 2007", "userURL": "http://www.goodreads.com/user/show/657780-michal", "userReview": "When my history professor gave me a list of books to choose from to read for his Civil War class, I chose this one on impulse. I came into the novel with very little knowledge about the events recorded in the book, but Jeff Sharra brought it to life for me. All too often, the Southern soldiers are depicted as uneducated brutes who hated slaves. While I'm sure that was true of some, Sharra portrays the Southern Generals as fighting for their homeland, for their families, and as unwilling to turn their weapons against their own homes. Reading this book, regardless of the cause that the politicians chose on either side, I can easily believe that I myself would have made the same decisions as the Southern men did when they were deciding where their loyalties belonged. The men from the North were influenced by the same factors: they were defending the homes they loved. It was a war that ensnared good, thinking men, men who would never have caused the war themselves, to fight in some of the worst massacres in history. It was a little different for me to read a book that was solely focused on the male side of the story (I'm a girl). I rather enjoyed the change of pace, and found much to admire in the thought processes of both the Generals and the author. He helped me experience the fervor, the bravery, the immense frustration, and the overwhelming honor of the men of the Civil War."}, {"userName": "Cam", "userReviewDate": "Oct 08, 2009", "userURL": "http://www.goodreads.com/user/show/816720-cam", "userReview": "I have read some really great books in the past year or two(Memoirs of a Geisha, The Kite Runner, Seabiscuit)- and this book definitely joins the list. It was so well written and interesting. It's about the civil war- it's quite thick and I thought it might be boring, but it was a page turner. I felt so connected to all of the characters, and I found myself really conflicted on whether I wanted the Union or the confederates to win the war- the book presented the generals as real people, so it did a good job of looking at both sides of the story. I like how it depicted the South and went past the issues of Slavery, and into the issues of men wanting to protect their homelands and families- and how hard it was for them to fight against other generals they knew and loved. My only complaint? It ended at the battle of Gettysburg, so now I need to find the next book! I guess this was a prequel to a book that his father wrote called, \"Killer Angels.\" So, that's the next book on my wish list! One other small complaint, sometimes it was easy for me to mix the characters up and forget who was on the confederate side and who was fighting for the union- so I had to refresh my memory a few times (I don't know my history as well as I should!)"}, {"userName": "Matthew Hodge", "userReviewDate": "Apr 06, 2014", "userURL": "http://www.goodreads.com/user/show/13404196-matthew-hodge", "userReview": "The first in the epic father/son Civil War trilogy (the next one is The Killer Angels by Jeff's father Michael Shaara, followed by Jeff's sequel The Last Full Measure). This was Jeff's first book, and it must have been intimidating writing a prequel to his father's book, which had won the Pulitzer prize and been made into the astonishingly good film, Gettysburg.But Jeff rose to the challenge admirably and delivered a book similar in tone to his father's and carefully maintaining the air of tragedy that his father achieved in The Killer Angels. For those who are new, Gods and Generals starts at the beginning of the American Civil War and follows four of the major commanders through the first three years of the war. What makes this trilogy so unique is its even-handedness to both sides of the battle, which makes the war itself something tragic. Highly recommended series.This was made into a film of the same name, which deviated quite differently from the book. If they'd stuck to the book, it would have been an amazing film, instead it became a fascinating but flawed look at the American Civil War. Read the book instead."}, {"userName": "Mark", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/3239399-mark", "userReview": "There is very little I can say about this book that hasn't already been said. It seems a rather polarizing read with people either really liking it or really hating it. Unfortunately for me I fall into the latter category.The book is just ok...considering the subject matter at hand it should have been great. By confining himself to copying his father's style, the book never flows, drama never builds, characters are never rounded out.Switching from one character's point of view to anothers can be a great way of building suspense and developing a story (see GRRM's mastery of this craft), here though, the switching of perspective (which is probably the best way to tell this story) just doesn't work.I now find myself at a crossroads...The Killer Angels (by Michael) is at home on the shelf and will surely be read, but what of the last in the series (again by Jeff)..."}, {"userName": "Pat Camalliere", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/41861330-pat-camalliere", "userReview": "Read this for the third time, as my book club selection. I still enjoyed it immensely and cried again when Stonewall Jackson died. I like how the Civil War is portrayed through the eyes of four commanders, two from the north and two from the south. Reading critically now as a published writer, it’s not without its faults. Point of view issues abound, some parts slow down for pages, the battle scenes are hard to follow, some of what is portrayed as fact appears contrived and overly emotional. There is also a decided sympathetic slant toward the south, and I would have preferred less bias and more accuracy. And yet, all in all, it works and deserves the attention of any reader of Civil War history. A 5 star pick for me!"}, {"userName": "Rob", "userReviewDate": "Apr 11, 2007", "userURL": "http://www.goodreads.com/user/show/50825-rob", "userReview": "The author's father was named Michael Shaara and wrote \"The Killer Angels\" which was a Pulitzer Prize winning novel that was made into the movie \"Gettysburg\". The son, Jeff Shaara, copied his father's unique writing style but did not do it justice. Admittedly, \"The Killer Angels\" is a historical fiction novel that covers 3 days while the son had to cover several years of the Civil War. This was not easy for that writing style. Still the book is an acceptable prequal to the \"Killer Angels\" if you enjoyed the characters and I have purchased but not yet read his sequal to \"Killer Angels\" and his novels on the Mexican-American War and the Revolutionary War."}, {"userName": "Alejandro", "userReviewDate": "May 18, 2009", "userURL": "http://www.goodreads.com/user/show/2329243-alejandro", "userReview": "Jeff Shaara simply could not pull off what his father accomplished. I'm sure Mr. Shaara is a smart historian of sorts, but as a writer it just doesn't give the proper payload. Perhaps he simply tried to cram too much in the lead-up to the Battle at Gettysburg, unlike his father who concentrated all of his attention and efforts on just those three historic days? Either way, the writing is simply annoying (too many \"...\"s throughout), and the only thing interesting is the sprinkling of Jeff Shaara's father's lines within the \"Gods and Generals\". Apart from that, just stick to what's good - \"The Killer Angels\"."}, {"userName": "Tom", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/4735226-tom", "userReview": "Corny dialogue, very stilted. This book and the series of three novels about the Civil War was highly recommended, so I was very disappointed.I couldn't even finish it. I remembered why I really dislike so many historical novels--they try too hard and sound like a low budget movie."}, {"userName": "Dylan Snell", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/46818411-dylan-snell", "userReview": "Personal Response:I enjoyed reading  Gods and Generals  by Jeff Shaara. I enjoyed reading this book because each chapter was told from a different point of view on the same event that took place. I also enjoyed reading this book because it was about the American Civil War, which I enjoy learning about. There was a movie made based on the book, and now I want to see the movie. The book does get long and boring in the beginning and middle sections, but when the major battles begin, the book gets very interesting.Plot Summary:The plot of the book starts before the Civil War begins. All of the characters are not very happy doing their jobs either in the Army or teaching. When the war begins, they join either the North or the South. Some friendships are strained because of the war, and some friendships begin. The characters are mostly high ranking in either the Confederate Army or the Federal Army. They end up fighting major battles like First and Second Manassas, Antietam, Fredericksburg, and finally Chancellorsville. It is at Chancellorsville were General Thomas Jackson is accidentally shot by one of his own men. He later dies, creating a void in the Confederate Army. At the end of the book, Robert E. Lee decides to invade the North as a last effort to turn the tide of the war.Characterization:The main characters are Robert E. Lee, Winfield Scott Hancock, Thomas Jackson, and Joshua Chamberlain. Lee is the commander of the Confederate Army, and is not very political. Hancock is a Brigadier General for the Federal Army. Jackson is a Brigadier General for the Confederate Army. He is killed by a Confederate soldier by accident at the Battle of Chancellorsville. Chamberlain has no military experience, but is given the rank of Colonel in the 20th Maine Infantry regiment when it is formed. Setting:This book takes place in late 1850’s to the end of the Battle of Chancellorsville in 1863. This is important because the Civil War was happening at the time. The location is mostly around Virginia.Recommendation:I would recommend this book to both males and females in high school or older. Those who enjoy history or the Civil War would like this book. The text can be very complex at times, so middle school students would most likely get confused when reading this book. I rated this a four out of five stars."}, {"userName": "Mary Soon Lee", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/6731291-mary-soon-lee", "userReview": "Jeff Shaara is the son of Michael Shaara, who wrote the superb book \"The Killer Angels\" about the Battle of Gettysburg. \"Gods and Generals\" is a prequel to that book, covering the lead-up to the Civil War, plus the first two years of the war. The book adopts the same approach as \"The Killer Angels,\" recounting events from the perspective of several key figures, in this case primarily Lee, Hancock, Jackson, and Chamberlain.I found this a very good book, albeit grim reading. It is eloquent, engrossing, and moving. Since I know less about the Civil War than I would like, it had the added bonus of being educational. Nonetheless, I didn't think it quite the equal of \"The Killer Angels.\" (But that is a high bar.)I note that I remain conflicted about Robert E. Lee, who, here as elsewhere, appears a sympathetic figure. And yet he commanded the Confederate forces, choosing the wrong side in a war that, for me, clearly had a right side and a wrong side."}, {"userName": "Ashley", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/720463-ashley", "userReview": "I enjoyed this book but you really have to have a mind that can visualize the military strategy they speak of to fully grasp what is happening. The maps the author provides definitely help."}, {"userName": "Rob", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/9123904-rob", "userReview": "Jeff Shaara has a gift. Following in his father’s footsteps (“The Killer Angels,” Michael Shaara’s 1975 Pulitzer Prize for Fiction), “Gods and Generals” is the prequel to the Battle of Gettysburg, following Lee, Jackson, Hancock and Chamberlain in their early years, before Lincoln’s election and the succession of the states. It makes today’s political turmoil look like kid’s stuff. It’s a robust portrait of the early years of the war, interconnecting the paths that brought these men together at the crossroads of history. If you’re a Shaara fan, you read this one a long time ago."}, {"userName": "Riley Feldmann", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/29303025-riley-feldmann", "userReview": "For a conflict that irrevocably changed the fate of the United States as we know it today, the Civil War is often stuck in the back of society's mind outside of an abnormally tall hat and some sort of \"Proclamation\". That's a bit of hyperbole, of course, but too often the Civil War can come off like any other piece of history if not approached correctly: it seems old, dry, lifeless, and devoid of personality.It is that bankruptcy in treatment that makes Jeff Shaara's Gods and Generals such a pleasure to read. Mr. Shaara takes the familiar names well known (Stonewall, Robert E. Lee, the infamous McClellan) and imbues in them a living, breathing, emotional cast of characters to help guide readers along with the lead-up to, the beginning of, and the opening phases of the Civil War. Sure, it is a piece of fiction, but Shaara's take on these giants of military history seems so believable the minute you are introduced to the main actors.\nThe Good\nThe narration style can be summed up initially with one word: uncomfortable. It is n nontraditional way to guide a reader along an epic nearly 500 pages in length, and admittedly it takes getting used to in the opening chapters. Once you find your sea legs, however, Shaara's prose feels damn near perfect. With time, it falls to the background after grabbing your attention initially, and you'll find yourself noticing the occasional moment when he deviates from his style. What was the point there? Was that a critical moment? Am I missing some foreshadowing?As already stated, you're going to meet up with four head figures (two Union, two Confederate) who keep the story moving. Their rationales in fighting for their causes are as varied as their personalities are, yet it is exactly this variation that keeps things fresh when battle scenes break down into rapid confusion as armies clash. Sure, you may not feel like you're right there in the trench alongside Stonewall Jackson, but every decision he makes seamlessly fits with what we come to expect and know about the man who struck fear into the hearts of Northerners.A final point of positive note has to be the willingness to recreate the story of the first months of the Civil War up to Gettysburg piece-by-piece. The historicity is limited in scope for obvious reasons to the four men at the heart of the story, but Shaara gives us enough nods and updates about the expanding conflict as a bell-weather as timelines shift continuously.\nThe Bad\nIn his quest to give us a personal insight into what these men at the forefront of the conflict were thinking, Shaara is unafraid to drown the reader under a pile of exposition for exposition's sake. Sure, it helps provide us with another detailed angle on the thought processes driving action, but this over-saturation of detail is probably the main culprit behind the ~500 page size of the book.Finally, having a bit of knowledge and background to the movements and tactics of the armies both North and South of the time is not necessarily crucial, but is widely helpful to keep yourself centered on events. The focus on the book is on the armies around the Potomac, but the wider issue at stake can get lost within the in-between if you don't have an intermediate starting knowledge of the Civil War.Those two small complaints behind, I cannot recommend this book enough. I had heard fantastic words about the series, and I viewed it as my opportunity to get back into the Civil War without dragging myself through another 1,000+ page epic about the campaigns on the Rappahannock. If you have a bit of free-time set aside, a willingness to adopt an unorthodox writing style, and want to become the closest of confidants with the men pulling the levers guiding the most crucial conflict in American history, then I will be pointing you to Gods and Generals"}, {"userName": "Benjamin Thomas", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/4209082-benjamin-thomas", "userReview": "I’ve read quite a few Jeff Shaara novels but never his first one. Most readers will know that Jeff’s father Michael Shaara wrote the Pulitzer Prize winning The Killer Angels (a book among my all-time top 10 – all genres). Upon Michaels’ death, Jeff took up the mantle and began his writing career by offering this “prequel” to that famous novel.“Gods and Generals” tells the story of the first years of the American Civil War through the points of view of four key individuals: Robert E. Lee, Thomas “Stonewall” Jackson, Joshua Chamberlain, and Winfield Scott Hancock. Notably, three of these men would have prominent roles in The Killer Angels, the story of the 3-day battle of Gettysburg.This novel begins a few months prior to the beginning of hostilities and does an admirable job of getting into the heads of these four men, especially bringing to the forefront their thoughts on how they felt about what was surely coming. Both Jeff and Michael Shaara are masters at bringing the larger spectacle of war down to the horrors of actual warfare at the individual level, whether for the guy in the trenches or the general in charge of it all. The novel concentrates on the central stage of the Civil War during the first couple of years, that part of Virginia where these four men fought and it covers the period of time all the way through Fredericksburg and Chancellorsville, setting us up for the events at Gettysburg.Having loved Jeff Shaara’s work many times before, I was a little worried that his first effort would be “trying too hard” to be another Killer Angels. But after completing my reading of the novel, I must say I found no evidence of a rookie author. This is a great work and fully stands on its own. Other reviewers tend to poo-poo the novel to some degree because it “ain’t as good as his daddy’s book” but I enjoyed both immensely. I am so glad that Jeff Shaara’s considerable talents have continued with the addition of a third book taking place after “The Killer Angels”, The Last Full Measure. But I am even more pleased that he has continued writing historical fiction novels about lesser known theaters of the Civil War, (and other American wars) many of which I have read, bringing their unique history alive."}, {"userName": "Laura", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/875677-laura", "userReview": "I love American History, but I had a really hard time getting into this book. Sometimes I really enjoy switching point of view between different characters, but I struggled with it in this book. Every time I began to feel connected to one of the characters, I would have to readjust when the story was yanked away to a different location.I think epic stories covering great distance and a long time period are difficult to write. I felt that this book was accurate in its character portrayals, but it didn't flow well at all. Perhaps if I was better versed in Civil War History, it would have felt more engaging.This is the story of 4 different key players in the civil war. General Hancock (North), Colonel Chamberlain (North), Robert E. Lee (South) and Thomas (Stonewall) Jackson (South). We see the events leading up to the civil war, and then the first portion of the civil war up to the battle of Chancellorville and the turning of the tide from the South to the North.I think a guy who loves strategy and military battles would enjoy this book more than I did. I had to skim through many of the battles. All the detail, which is so important to some, just bogged me down. I wanted STORY, not army positions.My favorite character was General Lee, with Jackson a close second. It made me feel strange to be rooting for the north, and yet feel the greatest desire for the South to have success. It was also odd to hear how everyone in the book felt such animosity towards Lincoln. Did anybody like him at all while he was alive?What impressed me most while reading this story was the difference in Leadership between the North and the South. Robert E. Lee was an educated gentleman; if he had accepted the offer of General for the North, the Confederacy would never have stood a chance. It was lack of leadership that prevented the North's success for so long. You really see the stark difference between the Rebels who loved and trusted their leaders, and the Federal armies who distrusted and disliked many of theirs. I'm still glad I had the opportunity to read this book. It's good to be reminded of the tragedy and horror of war, and the heartbreaks and devastation that result from it. Only by knowing our past can we prevent its being repeated in the future.Someday I'll read the companion volume, \"The Killer Angels\" all about Gettysburg.Now that I've read this book, I feel like going on a history binge. I want to see the movies based on Shaara's books. Yay for netflix!"}, {"userName": "Blain Dillard", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/6037200-blain-dillard", "userReview": "I read Gods and Generals mainly because it was the prequel for the book I really wanted to read (eventually) : Killer Angels. G&G was a good read, though I sometimes got lost in the extended battle scene details. I did thoroughly enjoy the character building done for the generals, especially Lee, Jackson, Stuart, Hancock, and Chamberlain. I always learn a lot when I read historical fiction. And this was no different. I never realized how poorly executed the Civil War was at times, and how politics played into battle decisions, even in the 1860's. Failing to capitalize on advantages time and again, both sides (but especially the North) missed opportunities which would have ended the war sooner had leadership been more decisive. G&G starts before the Harper's Ferry raid, and brings each to-be general from their current place of service (some from the West) to the point where they became the leaders we would later learn about as legends. The way platoons of soldiers gradually split as members took sides was interesting. I never realized that Lee was offered command of the Union forces by Lincoln before things got started. Battles at Manassas and Fredericksburg are brilliantly portrayed, followed by Chancellorsville, where Stonewall Jackson was later injured by friendly fire (by the NC 18th division, thank you), and subsequently died. The dismal conditions of soldiers are covered somewhat, but probably could have been given more attention. But I guess this is about generals. Communication between divisions, brigades, and HQ was done via horse and messenger, not phone or radio. It's hard to fathom. The strategies of defending Richmond versus taking the battle to the north in order to influence public support for the war are explored some. My favorite characters and why: the quirkiness of Jackson and Stuart, the boldness and wisdom of Lee, the aggressiveness of Jackson and Hancock, the principles of Chamberlain. Spoiler alerts not needed... This is all well known history, isn't it?"}, {"userName": "Pegg", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/4486713-pegg", "userReview": "Wow. This one rivals his father's book, \"The Killer Angels\". If you like Civil War history at all, if you enjoy historical fiction at all, if you just like a good book... read this one!The story centers around four main characters; Robert E. Lee, Stonewall Jackson, Joshua Lawrence Chamberlain, and Winfield Hancock. I've read several biographies of Robert E. Lee and Stonewall Jackson and I believe Jeff Shaara did a fantastic job of capturing the personalities of these men. While fiction (because we don't know their exact conversations and emotions during these times), this book presents the reader with a very credible look into the experiences leading up to the Battle of Gettysburg. The places, the timelines, the people, are all real history.\"Gods and Generals\" starts before the Civil War and explores the reasons why individuals chose one side or the other to support. The pain of those decisions, the uncertainty, the repercussions are all well presented. Old friendships broken apart, families separated, local allegiances tested and tried, all good grist for the story and all the more heartbreaking because it was true.It's easy to read this book and get sucked into the characters to the point of forgetting that these were real people, faced with real situations that we cannot honestly imagine in this day and age. I will read this book again, and read the other novels in order to complete the series. I read them out of order the first time but still enjoyed each one."}, {"userName": "Timothy Riley", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/4996855-timothy-riley", "userReview": "This was a fairly lame book. I think it didn't require much more than Junior year of college level research. It was not very riveting. Without looking into it, I believe the author is pretty much a confederate apologist. He idolizes men like Lee, Jackson and Longstreet. His descriptions of them are glowing; they are the heroes while the union generals are buffoons and the union fighting men victims of inept leadership-that last part is fairly accurate. I know that a story like this should not take a political stance but it is difficult not to with such a polarizing chain of events. Lee is portrayed as burdened by his decision to join the southern cause because of how much he believes in the federal US government and system, yet doesn't seem to hesitate much in killing thousands of his countrymen. He popularizes the idea that the slave masters-of which group he is included-\"took care\" of their slaves like fathers to petulant, directionless sons. He fought to retain slavery in the south and his slaves in particular. If he was so good and righteous like this book demands us believe, then he wouldn't have lost the war and the God that he refers to throughout his \"scenes\" wouldn't have abandoned him and his cause. This book perpetuates civil war mythology."}, {"userName": "Stephen", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/4070225-stephen", "userReview": "I love Civil War stories, but thought this one was just stupid. Yes, this is a novel, but it's written with all the dryness of a paper towel and there was no humor or humanity. The people in the book are ostensibly real and are presented as such. And yes, we do know what they're thinking more than you would if this were a non-fiction book. However, the text is dry and the stories are boring. I wanted to like this book, but after just having finished the North & South trilogy, this dry tale of about 3 years of the war was just boring. It read like a non-fiction account.However - if you want a dry account of the years leading up to Gettysburg, with perspectives from 4 generals and not much civilian life, then this could be a good book. I do not plan to read any of the other Shaara novels about the Civil War, since I believe these are probably all written in this same style."}, {"userName": "Dave", "userReviewDate": "Oct 12, 2008", "userURL": "http://www.goodreads.com/user/show/1607644-dave", "userReview": "The book barely rates an \"ok\" which is better than movie of the same name. The surprise of this is that this book was borne out of Jeff's attempt to write a screenplay sequel for the movie Gettysburg that was created from his father's original book. Jeff attempts to mimic his dad's style in a book that involves 3+ years instead of 3+ days. For this reason alone it doesn't work. The gaps in the narrative can best be described as \"Swiss Cheese\". The pre-war chapters of Hancock and \"Lo\" Armistead are the best and the book go downhill from there. The movie totally rejected this early storyline which is one of the reasons this bad book barely edges it out. What is truly scary is that publishers are still giving Jeff too much money for his limited writing skills so I suppose we can expect more."}, {"userName": "Lynn Green", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/2413017-lynn-green", "userReview": "Jeff Shaara uses the formula used so successfully in Killer Angels, an historical novel about the Civil War battle of Gettysburg, in Gods and Generals which covers the battles of Antietam, Fredericksburg, and Chancellorsville. Each chapter focuses on one of the major figures in these conflicts including Lee, Jackson, Winfield Scott Hancock, Joshua Lawrence Chamberlain, and others. I appreciated Shaara's in-depth research which matches that of his father's book. The characters are complex and nuanced. The reading never bogs down. The descriptions and actions are as good as any created by Gore Vidal and Stephen Crane on the same topics. One more thing. The book is better than the movie."}, {"userName": "Chloé", "userReviewDate": "Mar 29, 2009", "userURL": "http://www.goodreads.com/user/show/2171356-chlo", "userReview": "Like The Killer Angels, this book is very good at revealing the personal struggles and thoughts of some leading figures in the Civil War. It's engaging, informative, and a must read for anyone with an interest with history. However, I much preferred his father's book, The Killer Angels. Perhaps a comparison is a bit unfair due to the timespan, but this type of book seemed to work better with three days instead of three years. And I liked Michael Shaara's style a bit better, though they are similar. Overall, though, this book is certainly worth reading and it does a good job capturing the human elements of the struggle, as well as explaining crucial events at the beginning of the war."}, {"userName": "Brittany", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/5236368-brittany", "userReview": "Interesting approach to historical writing, and a new view of the Civil War for me. Normally, I think about the Civil War in terms of politics, Lincoln, slavery, Confederates, Yankees, etc. This was the first time I even had a chance to consider tactics and war effort, because American history in the public school system simply doesn't teach it that way. I don't think I particularly enjoyed it, but I did open my history thinking box to possibilities and modern comparisons I wouldn't have otherwise aligned with the Civil War and there's an extra half-star in my rating for some trivia facts I acquired. The end was beautifully chilling, and I don't often like the way this genre wraps it up."}, {"userName": "Denise Starry", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/27856398-denise-starry", "userReview": "This is not my usual era for Historical Fiction, but nonetheless, I am glad I read this book. I spent much of the time reading being angry at the ignorance and arrogance of men who \"earned\" their appointments because of wealth or connections. The foolish decisions made by these men who had no business being in command cost hundreds of thousands of young lives. I know this is a work of fiction, but based on current events and culture, I believe that these erroneous appointments most likely did happen and that weak men's egos did indeed cost lives. This type of thing is still happening today."}], "description": "In a prequel of sorts to his father Michael Shaara's 1974 epic novel The Killer Angels, Jeff Shaara explores the lives of Generals Lee, Hancock, Jackson and Chamberlain as the pivotal Battle of Gettysburg approaches. Shaara captures the disillusionment of both Lee and Hancock early in their careers, Lee's conflict with loyalty, Jackson's overwhelming Christian ethic and Chamberlain's total lack of experience, while illustrating how each compensated for shortcomings and failures when put to the test. The perspectives of the four men, particularly concerning the battles at Fredericksburg and Chancellorsville, make vivid the realities of war.", "title": "Gods and Generals\n      \n          (The Civil War Trilogy #1)", "url": "http://www.goodreads.com/book/show/29925.Gods_and_Generals", "average": 4.06, "cover": "https://images.gr-assets.com/books/1330062676l/29925.jpg", "reviews": 651, "authors": [{"url": "https://www.goodreads.com/author/show/14655.Jeff_Shaara", "name": "Jeff Shaara"}], "type": ["Historical", "Fiction", "Military History", "War", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/29925.Gods_and_Generals", "http://www.goodreads.com/book/show/615831.Gods_and_Generals", "http://www.goodreads.com/book/show/449355.Gods_and_Generals", "http://www.goodreads.com/book/show/1188373.Gods_and_Generals", "http://www.goodreads.com/book/show/29923.The_Last_Full_Measure", "http://www.goodreads.com/book/show/36446571-rise-to-rebellion", "http://www.goodreads.com/book/show/29917.The_Rising_Tide", "http://www.goodreads.com/book/show/785003.The_Glorious_Cause", "http://www.goodreads.com/book/show/2047408.The_Steel_Wave", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}