{"ratings": 35931, "userreviews": [{"userName": "Miriam Smith", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/35740838-miriam-smith", "userReview": "When I first started reading \"Gone for Good\" by my favourite author Harlan Coben I had to put it down as I just couldn't get into it, however having picked it up again a few days later I fully realised that it was ME and in NO WAY the book! My word! This addictive book was one helluva thriller, pace perfect it pulls you in and just doesn't let you go - I didn't want it to end and wished there had been more! There was layer upon layer of plot lines, fantastic breakneck speed twists and turns and an phenomenal ending that after having had you so tense had me emotionally wrecked! I SO loved the main characters Will Klein and 'Squares' - I could see my favourite characters Win and Myron in them which made me so happy! Even a visit from Hester Crimstein - brilliant! And as for 'Ghost' - I don't think a baddie has had me so creeped out since Hannibal Lecter! I wish I could give this more than 5 stars - Harlan just keeps on coming with fantastic books and plot lines - I don't know where he gets them from - but wow! this is definitely one of my favourite by Harlan (and I think I say that every time haha!). I highly recommend this book, if you've never read anything by Harlan before I urge you to start now you won't be disappointed - you'll be hooked and with so many books to read by him you'll have plenty to keep you reading! A HUGE 5 stars!!!!!!"}, {"userName": "Mandy", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "HOLY FREAKIN MOLY! This book was beyond superb. I can't even find the words for it. Phenomenal! Coben holds your interest from the first to the last word. Every chapter revealed another layer that was peeled, revealing some startling discovery. Absolutely one of my favorite novels by Coben. He is by far, the best author around. Highly recommend this novel!!! Get it and read it! NOW!!!!!!! (You won't regret it)"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "GONE FOR GOOD has so many surprising twists and turns to make it another most enjoyable read by HARLAN COBEN which gets a 4.5 star rating from me!I really like this authors writing style and his dialogue is terrific throughout this novel. Most of the chapters were nice and short with most having some type of revelation to keep you interested and wanting to keep turning those pages. The plot was filled with lots of twists at a surprising speed that kept me totally engaged in what I was reading. I found that it was so entertaining and fast-paced that I didn't even want to guess the outcome even though I can now see that we were given a few clues. I thought that I was given enough information on each character that it was easy to follow along with them and the storyline. Will Klein was my favourite character as I felt for him and was rooting for him. HARLAN COBEN actually made me feel that Will was talking directly to me, the reader!This book was chosen to read by me solely on who the author was. Cover, title and synopsis did not come into play on this read.To wrap it up it was an entertaining, enjoyable, quick and easy, fast-paced, and interesting mystery with a very satisfying ending. Would recommend!!http://www.twogirlslostinacouleereadi..."}, {"userName": "D. Pow", "userReviewDate": "Jun 06, 2009", "userURL": "http://www.goodreads.com/user/show/2182799-d-pow", "userReview": "Yes, I did it again. I am addicted. It's like crack. or the crack of an ass. I can feel the damage being done to my brain as I read page after implausible page and I wince at phrase after ham-handed phrase but still I keep going. As McDonalds is to one's arteries so is Coben to ones brain. What is the cranial equivalent of an oxygen tank and an electric wheel chair, and a long day spent drooling through the aisles at Wal-mart? That is what Coben is, what he does to me. God, I hate him. God, I hate myself."}, {"userName": "P ", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "\"Three days before her death, my mother told me these weren't her last words, but they were pretty close that my brother was still alive.\"\nGone for Good is not so differrent from Tell No One. I was astounded how these books started off the same with the main character making an assumption that the death person is still alive. While Tell No One packs with action and gutwrenching scenes, Gone for Good is full of drama and heartbreaking stories. I enjoyed Gone for Good since the first few chapters, but after various characters come out of nowhere, I got the feeling that this book was hard to concentrate about who each one is or who takes a part in the crime. Can't deny that Coben is a smart writer, he hid the evidences in the evidences, and the twists were likewise profound and cruel that made me frown so many times.\nThe Ghost stood. \"I didn't come back for revenge or even justice,\"\nWill Klein is my favorite character, it was fun to hear what he knows. His thought is not messy, and his sympathy for other people gives this book a family vibe at the same time. Ken Klein is also an interesting one, even he doesn't take many parts in this book, it still intrigued me when Will thinks of his brother and wholeheartedly hope that he's still alive.\nBut why 3 stars ?\nAs I said, this book is very much alike Tell No One but lacks of action scenes. Although that's not the problem for me, the problem is the characters are too much and they made me confused. Some characters just pop up and disappear, I am so curious that it would be better if Coben limited his characters as few as possible. And the ending was just so-so, not mind-blowing like Tell No One.By the way, it's a great read for me. I have many of his books on my shelves right now.https://goo.gl/XyvWNf"}, {"userName": "Margitte", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "FROM THE BLURBAs a boy, Will Klein had a hero: his older brother, Ken. Then, on a warm suburban night in the Kleins’ affluent New Jersey neighborhood, a young woman—a girl Will had once loved—was found brutally murdered in her family’s basement. The prime suspect: Ken Klein. With the evidence against him overwhelming, Ken simply vanished. And when his shattered family never heard from Ken again, they were sure he was gone for good.Now eleven years have passed. Will has found proof that Ken is alive. And this is just the first in a series of stunning revelations as Will is forced to confront startling truths about his brother—and himself. As a violent mystery unwinds around him, Will knows that he must press his search all the way to the end. Because the most powerful surprises are yet to come.As the author says,  ...the thing about clichés is that they're dead on. I can so live with that. Some of them made good sense in this book.I loveeeeeeed this murder mystery, suspense thriller. Messing around with the sleuthing readers, the author knew where to pull the punches to get us disorientated and lost on the wrong tracks of facts. Surprise after surprise! Oh myyyyyy, it was brilliant.Trivial things delighted me, such as the normalcy of their lives. They engaged in ordinary things, eating salads, cheese omelettes, home or french fries, and enjoy venti iced lattés or frappuccinos. It was necessary to escape the stark reality of murder, betrayal, revenge and destroyed lives. Ken Klein had been the fiery tennis player, John Asselta the psycho wrestler, McGuane the wow-'em charmer and student council president. Three friends, natives and products from the Livingston suburb, New Jersey. Popular, intelligent, ambitious. Whatever could go wrong in these three friends' lives, when the well-watered lawns, split-level constructed homes, Little Leagues, soccer moms, piano lessons, Four Squares courts, and parent-teacher conferences, acted as some sort of wolfsbane to supposedly ward of evil?Evil was suppose to manifest in jails, where a melting pot of people were captured: a potpourri of inhumanity that inhabits this mini-United Nations. Ten different languages could be heard at the same time. There were shades of skin color that could inspire the people at Crayola. There were baseball caps and turbans and toupees and even a fez. Into this Crayola of colorful cultures, characters such as Yogi Squares the Yoga guru could be found. And Sheila, Nora, Katy, Wanda, Agents Fisher and Joey Pistillo. A place like Covenant house could exist where young teenagers were safely rescued from the streets.All of them had their stories to tell. A twist of fate brought them all together in the hunt for truth and reconciliation. Some lost. Some won. Nobody walked away unscathed. \n\"The ugliest of truths, in the end, was still better than the prettiest of lies.\"\nA fantastic read! It was as much an emotional fairground parade as it was a Bruce Springsteen concert of mayhem and revolt. Even the reader got caught up in the fast moving rhythms of a mesmerized trance. The suspense was that good. The ending amazing."}, {"userName": "সালমান হক", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/24175715", "userReview": "ঘোল খেয়েছেন কখনো? যদি না খেয়ে থাকেন, তাহলে এই বইটা পড়তে পারেন। পয়সা উশুল হবে বলে দিচ্ছি। লেখক একের পর এক নক আউট পাঞ্চ দিতে থাকবেন আর মাথা ঘোরাতে থাকবে।  থৃলার জনরায় বর্তমান সময়ের সবচেয়ে সেরা লেখকদের একজন হারলান কোবেন। বইয়ের প্রথম শব্দটা থেকে একদম শেষ শব্দটা পর্যন্ত মনোযোগ ধরে রাখতে বাধ্য করবে। লেয়ারের পর লেয়ার আর টুইস্ট এর কথা নাহয় বাদই দিলাম। সেই সাথে আছে দুর্দান্ত ক্যারেক্টার বিল্ডিং।  এই বইয়ের নায়কের নাম উইল। এগার বছর আগে তার সাবেক প্রেমিকা খুন হয়ে যায় নিজের বাসার বেজমেন্টে। আর সন্দেহভাজন আসামী করা হয় উইলের ভাই কেইনকে। উধাও হয়ে যায় কেইন। সবাই ধরে নেয় সেও মৃত। কিন্তু প্রকৃত সত্যটা রয়ে যায় অমীমাংসিত। এগার বছর পর উইলের মা মৃত্যু শয্যায় বলে যান যে বেচে আছে কেইন। আর এরপরেই ঘটতে থাকে একের পর এক ঘটনা। জড়িয়ে পরে উইল। এরপর থেকেই। উত্তেজনার শুরু। উত্তরের খোজে একদম আকড়ে ধরেছিলাম বইটা(মানে ঐ কিন্ডল আর কি)।।  যে কোন ঘাগু পাঠককে ঘোল খাওয়াতে সক্ষম এই বইটা। একটানা পড়ে যেতে বাধ্য। ফেভারিট লিস্টে ঢুকে গেল। :)"}, {"userName": "Phrynne", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "A fun read. A bit naive in places when it came to motivation for some of the gruesome killings and especially for the Ghost's part in the whole thing. That was very weak. There was a nice twist at the end, in fact there were several nice twists at the end and the book finished on a high. I had no real attachment to any of the characters except maybe a little for Squares. Too many of the characters were not who or what they were supposed to be which made it difficult to really know them. So basically an entertaining and fairly quick read without much to remember it by."}, {"userName": "Vivian", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/3947172-vivian", "userReview": "Salacious suspense. This reads like a tawdry daytime soap opera, but with a higher body count.So, this happened. It wasn't bad, but the new character every chapter and ever-increasing slide into moral turpitude in this Disturbia Hell came across heavy-handed and spectacle driven. There was a decoupage mentality to the reveal of the storyline by pasting on a new \"shocking\" aka wildly stereotypical development. Subtle it is not. There were some great underlying themes like face value, redemption, and sacrifice, but they got lost under the excess of plot and characters. The only thing which sat there sedately was the setting which is only funny because I have family and friends scattered all over New Jersey so Fair Lawn--yep, Livingston-yep. Where's Livingston? Near Nutley. Where's Nutley? Near Livingston. And that everyone's inside everyone else's back pocket is an excellent reason why I would rather rip out toenails than move back East, again.If you're looking for a popcorn thriller suspense, then you could do far worse than this."}, {"userName": "Sam", "userReviewDate": "Feb 04, 2008", "userURL": "http://www.goodreads.com/user/show/626425-sam", "userReview": "Coben is the King of the Plot Twist. Gone for Good is first of Harlan Coben's many novels that I have read and this one drew me is so much that I read it all in one day. Each chapter ends with a cliff hanger and that makes you want to keep reading. He also does a fantastic job of character development. If you enjoy a good mystery that will keep up on the edge and always guessing...I suggest Gone For Good."}, {"userName": "Patrice Hoffman", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/5405898-patrice-hoffman", "userReview": "WOW! That's the first thing I said to my self after finishing this book. Twist after Twist after Twist. Really a good book."}, {"userName": "Freda Malone", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/6938113-freda-malone", "userReview": "My first favorite read of 2016! Holy cow, I had hunches, I solved some clues, I even thought out the chain of events. NEVER in a million years would I have seen the ending coming. Brilliant, clever, and an emphatically cunning crime mystery!!! Bravo Harlan Coben!! A must-read for my fellow readers. I couldn't put the book down it was so white-knuckle gripping!"}, {"userName": "Aaron", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/323130-aaron", "userReview": "This was my first experience with Harlan Coben and I don't think I'm clamoring to read another. I didn't hate this. It was good enough entertainment for a couple of days. But I can't recommend it.Characters are one-dimensional. But they almost have to be. Revealing too much of each character wouldn't allow Harlan Coben to change what all the characters are and what they stand for and what they'r emotivated by in the last twenty pages. Seriously, this was one of those novels where a new revelation happens every two pages for the entire span of the last forty pages. No, I'm not a good guy. I'm the bad guy! So am I! So is she! I was just joshing. I'm a good guy! I've been hiding my motivation all along so that I can pull this gun out and shoot the real bad guy! With that said, Coben's plot has a break-neck pace. I appreciated that. It made the whole affair finish up that much faster."}, {"userName": "Greg Bascom", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/9612959-greg-bascom", "userReview": "GONE FOR GOOD is a fast paced thriller with at least 60 plot twists, turns or startling revelations (I catalogued them.) Typical of the genre, it is plot rather than character driven. Even the best characters are a bit shallow, and you will have to accept some improbable ones. Dialogue is written well. Otherwise, the writing is simple - if you got through third grade you won't need a dictionary - although after some stretches of short choppy sentences and dangling phrases you might wish for something more mature. There is unnecessary violence and implausibility both of character and event. Again, that seems typical of the genre.The story is fast paced not just because the author uses cliff hanging chapter endings and plot twists. He dribbles out information. First there is a limousine, then a man in the back seat, then a man sitting next to him, then a driver, then the relationship suggesting they are hoods, and then finally they are. You have to turn pages to get this. Another technique is to insert a short chapter of a seemingly unrelated event, an incomplete scene, and leave it to be developed later, maybe much later. Also, Coben will interleave chapters with two or more related plot elements as he develops the story.This is a four star read in the thriller genre - put \"thriller genre\" in bold italics and underline it. The reviewers who did not like this novel, in general, dislike violent thrillers without well developed characters. A few who do read thrillers found the plot too much like Coben's first thriller, TELL NO ONE. I agree with that.TELL NO ONE opened with a juxtaposition of love and tragedy that was well done and grabbed me in the gut, as it did many other reviewers. As I read GONE FOR GOOD, I wanted to feel the relationship between Will and Sheila, but it wasn't there. That disappointed. For me, the ending in TELL NO ONE was, to be diplomatic, moronic. As I read the startling ending of GONE FOR GOOD, it seemed too far over the top, but when I got to the one page epilogue, my stomach settled and I smiled"}, {"userName": "Patrick", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/4683881-patrick", "userReview": "The absolute best H.C. novel to date and that's saying something. The plots, subplots, sub-sub plots are endless and will probably keep you guessing. However, I did figure this one out early on haha, then changed my mind a bit later, and then after a while decided on a different direction, and finally found myself out in left-field out of smokes with an empty beer can. What can I say? A very clever story with so many subtle twists and turns, gut wrenching and spine tingling one moment and somber and heartfelt the next. I kinda felt sorry for our protagonist Will (by the way, why are the good guys always named Will?), but he showed he had the testicular fortitude to challenge the evil powers that be which at the time seemed virtually impossible. Moving on back to another protagonist and good guy named Will, this time Will Trent #1 'Triptych' for a second time."}, {"userName": "Angie", "userReviewDate": "Sep 08, 2007", "userURL": "http://www.goodreads.com/user/show/308988-angie", "userReview": "I just finished this book and I feel like I've gone on a hell of a roller coaster ride without even leaving home. WOW! This book was absolutely incredible! Every time I thought I had it figured out, Coben came up with another twist to make me question my theories or spin them into nothing but complete chaos. The man is absolutely genius when it comes to thinking up plot twists and turns to keeping the reader second-guessing. If you like a book that will keep you guessing all the way to the very last page, then run - don't walk - to your nearest library or book store and get your hands on this book! If you want something a little more sedate and bland, then you may wish to just leave this book alone because once you start reading, you won't be able to stop -- just like when you strap in to a real roller coaster ride."}, {"userName": "Xana", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/5314072-xana", "userReview": "Justas seriam as 3,5*.Harlan Coben é, normalmente uma leitura segura. Uma trama bem pensada, com voltas e reviravoltas, que resulta num policial levezinho que me mantem sempre interessada.Gostei bastante deste, adorei as personagens, desde o Will, ao John Asselta.O final acabou por ser uma surpresa.. aconselho esta leitura"}, {"userName": "CrabbyPatty", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/38069174-crabbypatty", "userReview": "Tell No One was my first Harlan Coben novel and IMHO it was an amazing tale. Coben is clearly a gifted writer, with a good sense of what it takes to grab your interest and hook you, and then keep you going until the last page .... and then some. However, having started with Tell No One, Gone for Good seemed like a reformulation. Hero is a grieving man whose beloved family member is dead ..... or are they? Check. Psychotic killer using grossly innovative ways to kill? Check. Gung-ho law enforcement types convinced the hero knows more? Check. Fascinating no nonsense side-kick? Check. Toss in a few improbable coincidences and there you go. I would give \"Gone for Good\" three-and-a-half stars because it WAS a really good read, but the plot seemed a bit too similar, and I wish the main characters (in each book) had been a bit-more fleshed out and developed. Of course, your results may vary ......."}, {"userName": "Angie", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/1494253-angie", "userReview": "Another great thrill ride by Harlan Coben. Just when you think you know what is going on, another twist turns you all around! Read this one as soon as you get your hands on it, and you won't regret it:)(Just a note that there are some brutal & graphic violent scenes so sensitive readers might want to beware)"}, {"userName": "Vanessa Tekać", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/39847646-vanessa-teka", "userReview": "Roman koji vas drzi u neizvjesnosti do samog kraja i razbije sva moguca predvidjanja o zavrsetku. Napeti triler koji ce oduseviti i najzahtjevnije citace. Iskrena preporuka! :)"}, {"userName": "David", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/18614687-david", "userReview": "My first Harlan Coben book and will definitely not be my last.I just love the way Harlan Coben writes. I think most authors struggle to pull of writing in the second person but you feel like Harlan's having a conversation with you - the Reader - as you read this book.It's a story with many twists and turns and jut remember that nothing is ever as it seems.Our protagonist has struggled to clear his brother's name for most of his life. His brother has been framed as the killer of a girl he used to love. The police force think his brother's guilty. The local community thinks his brother is guilty. The deceased's family think his brother is guilty. Even his parents harbour doubts about his brother's innocence. Still, Will believes his brother - Kevin Klein - is innocent. His brother goes on the run and for many years, it'd appear his gone for good and never to come back.Will's mother whispers something on her deathbed that sets his world upside down and opens a can of worms.I liked how Harlan made Will Klein so vulnerable. You feel for him and wish him all the best. You wish him well but it seems his best intentions only hurt those around him and lead him to dead ends. Will discovers himself in the end and the truth sets him free.A worthy addition to your library."}, {"userName": "David", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5547564-david", "userReview": "Coben takes a good plot and suspense, but taints it with cardboard characters and too much suspension of belief. The humorous first person which I normally love seems to only work part of the time. Will, the protagonist seems to have only two traits: irrationally angry and hopelessly naive (you know, when another character is trying to explain a formulaic plot twist that you as the reader saw through five minutes earlier, but he just can't wrap his head around it.) The only interesting character is one of the antagonists, the Ghost, and even he is dulled down by the end. With the plot and pacing, I might have rated this one higher if I hadn't recently read so many superior books lately, including thrillers. This is your literary equivalent of a Lifetime Movie Network original."}, {"userName": "Best Crime Books & More", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10323950-best-crime-books-more", "userReview": "I have read one of Harlan Coben's stand alone novels, albeit some time ago, and am slowly working my way through his back catalogue. In this book we meet Will Klein and I found that it didn't take long for me to like him. What also became apparent pretty quickly was that Will Klein is an ordinary bloke. He isn't somebody who can ruthlessly take down bad guys and he isn't a brooding lead character that has an issue with authority. In other words, a welcome change from the ordinary leading male cop type character!The story itself is quite interesting and before long you realise that the disappearance of Will's girlfriend is far from ordinary. There is also the added plot thread that includes the disappearance of Wills brother who is trhe main suspect in the murder of Julie Miller 11 years prior.One of the things that really struck me with the Myron Bolitar series of books was the great characters, this book was no different. Will Klein's friend Squares is a brilliant added character and I found that I would have like to have actually seen more of him in the book. Even with that as a negative this book was still an absolutely brilliant read.Towards the end I found myself reading even quicker and I must say that the last few chapters had many twists and surprises in store which I absolutely loved. All in all it was another winner from Harlan Coben."}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "There were so many reversals in this complicated plot, I ended up just feeling numb instead of thrilled. Coben does well to get you invested with the hero, Will, an ordinary, good hearted guy who works in a youth shelter and lives with someone he loves. The shadow over him and his family is the disappearance of his brother Ken nearly a decade before in connection with the murder of Will's ex-girlfriend. Suddenly his current girlfriend splits and violent friends of his brother and the police come to brutally press him in their search for Ken. As Will pursues the mystery, he implausibly overcomes many dangerous situations and each truth he grasps tends to be dashed with successive twists, leaving me feel a bit manipulated. Yet Coben's knack with characters that aren't simply evil incarnate is impessive enough to make me want to give him another try."}, {"userName": "Christine", "userReviewDate": "Jul 24, 2010", "userURL": "http://www.goodreads.com/user/show/3090460-christine", "userReview": "Yet another loved-one-presumed-dead-but-look-may-still-be-alive-and-in-hiding story from Harlan Coben. I'm about 25% through, and may ditch it. It's just not grabbing me. Also not buying into the constant over-the-top emo from the main character. Could be I'm over Harlan Coben's writing style and plotlines, since neither one ever changes. Same story, different book.UPDATE: I'm out. Made it halfway through, but it just wasn't worth reading any further."}, {"userName": "Maria Espadinha", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "A Peça de CozinhaRecordo-me de ter lido algures (salvo erro numa resenha da Teresa), uma referencia a este livro, classificando-o como uma excelente peça de cozinhaOu teria sido só \"boa\"? Esperem...Acho que foi \"requintada\"... Ou \"ótima\"... Acho que foi \"ótima\"!Bom...já não sei!... Fosse o que fosse tratava-se dum merecido elogio Quanto a mim:Nada a acrescentarÉ um thriller para ler e saborear...Até rimou! ;)"}, {"userName": "Liv ", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/1650769-liv", "userReview": "This was my first Coben book...can't say I'm reaching for another one. This started out okay, and even the ending was different, but meh. Kind of flat."}, {"userName": "Ana Jupek", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/55423656-ana-jupek", "userReview": "if goodreads would have that half star possible this would be 3.5 ... Fast read with quite a few twists that this author often delivers."}, {"userName": "Love Fool", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/29084789-love-fool", "userReview": "As a boy, Will Klein had a hero: his older brother, Ken. Then, on a warm suburban night in the Kleins' affluent New Jersey neighborhood, a young woman -- a girl Will had once loved -- was found brutally murdered in her family's basement. The prime suspect: Ken Klein. With the evidence against him overwhelming, Ken simply vanished. And when his shattered family never heard from Ken again, they were sure he was gone for good. Now eleven years have passed. Will has found proof that Ken is alive. And this is just the first in a series of stunning revelations as Will is forced to confront startling truths about his brother, and even himself. As a violent mystery unwinds around him, Will knows he must press his search all the way to the end. Because the most powerful surprises are yet to come. I don't know what else I can say about Harlan Coben or his books but I clearly love him and recommend everyone to read this book as well as his others."}, {"userName": "Corey", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/12949855-corey", "userReview": "Another great edge of your seat mystery/thriller by a phenomenal writer! One thing I notice about Harlan Coben is that normally his books have multiple plots that there's a point where you get so suckered into tone plot that sometimes you forget there's more than one. Just when you think you've got it all figured out, there's a big twist that you never see coming. This is another book I think I'm going to put up as one of Harlan Coben's best books, I just couldn't put it down, it was another one that kept me up way past my bedtime.Anyone looking for a good mystery with twists and turns, this book is for you!"}], "description": "As a boy, Will Klein had a hero: his older brother, Ken. Then, on a warm suburban night in the Kleins' affluent New Jersey neighborhood, a young woman -- a girl Will had once loved -- was found brutally murdered in her family's basement. The prime suspect: Ken Klein. With the evidence against him overwhelming, Ken simply vanished. And when his shattered family never heard from Ken again, they were sure he was gone for good. Now eleven years have passed. Will has found proof that Ken is alive. And this is just the first in a series of stunning revelations as Will is forced to confront startling truths about his brother, and even himself. As a violent mystery unwinds around him, Will knows he must press his search all the way to the end. Because the most powerful surprises are yet to come.", "title": "Gone for Good", "url": "http://www.goodreads.com/book/show/43930.Gone_for_Good", "average": 4.1, "cover": "https://images.gr-assets.com/books/1388200178l/43930.jpg", "reviews": 1894, "authors": [{"url": "https://www.goodreads.com/author/show/24689.Harlan_Coben", "name": "Harlan Coben"}], "type": ["Mystery", "Thriller", "Fiction", "Suspense", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/43930.Gone_for_Good", "http://www.goodreads.com/book/show/2884928-gone-for-good", "http://www.goodreads.com/book/show/1086869.Gone_for_Good", "http://www.goodreads.com/book/show/7136564-gone-for-good", "http://www.goodreads.com/book/show/2265260.Desaparecido_Para_Sempre", "http://www.goodreads.com/book/show/33310145-nestao-zauvek", "http://www.goodreads.com/book/show/43933.Tell_No_One", "http://www.goodreads.com/book/show/43931.The_Woods", "http://www.goodreads.com/book/show/26109394-fool-me-once", "http://www.goodreads.com/book/show/15811568-six-years", "http://www.goodreads.com/book/show/6681454-caught", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}