{"ratings": 11289, "userreviews": [{"userName": "Emily May", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "\"Vegetable jokes,\" he says. \"It's all I'm good for anymore.\"\"What do you mean?\" I say.He points to the couple. \"Isn't it romaine-tic?\"\nI realise I’m in the minority, but I just didn’t find this book funny. I always feel that humour is one of the most subjective aspects of a book, and the style here didn't work for me at all. It wasn't my only issue with Goodbye, Vitamin, but it was probably the biggest one. Maybe my disconnect with the humour led into all the other problems I had. It's a book about thirty-year-old Ruth and how she deals with a break-up and her father's Alzheimers diagnosis over the course of one year. It's a quick read, rolling in at just over 200 pages, but it is messy, often disconnected and very, very random. I really struggled to connect with the narrator or her family, and this made it difficult to get through, despite the length.It's written in what seems, at first glance, like diary entries, but the narrative jumps all over the place and lacked any kind of cohesion. One minute, Ruth is dealing with her father's erratic mood swings; the next minute, she is with her best friend; and, quickly after, we have jumped back to an anecdote from her childhood. Goodbye, Vitamin reads like a random stream of comedy sketches, lacking any kind of focus or direction. We get random trivia in the middle of chapters about everything from whales to California trees to what contains aluminium to:\n\"The word testify,\" you said, \"comes from testicles. Men used to swear by their balls.\"\nAnd I think this kind of tidbit is supposed to be funny. But it's not my particular brand of humour. It's like when the characters go horse-riding and the horse craps. Ha. Hilarious. Sorry, but bathroom jokes are not my thing.We also receive random observations on life, the universe and everything, which is something I usually like, but it seemed so out of place in this story. I can't stop thinking (and typing) the word \"random\", which I feel sums up a lot of this book. Lots of disconnected ideas, jokes and fun facts that never came together into a story I could love. I also grew tired of the snippets from Ruth's childhood where her dad recorded the exact cutesy things she said as a kid. I love books that can successfully take a serious issue - like Alzheimer's - and wrap it up in humour so that it doesn't become an emotionally-manipulative sob story but, for me, this wasn’t one of them. Eleanor Oliphant is Completely Fine is a great book I read recently that is sadness wrapped up in hilarity, and that worked much better for me.Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Larry H", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'm between 3.5 and 4 stars, so I'll round up. It's ironic how a book told so simply could pack so much beauty and emotion into its words, but Rachel Khong's \nGoodbye, Vitamin\n did just that. This is a somewhat quirky, slightly odd book that I found quite moving—in fact, I had to do the \"no, I'm not crying, I'm just rubbing my eyes\" thing more than a few times on my plane ride this morning.Ruth is 30 years old. Her engagement has ended and she feels untethered to the life she has known, so she comes home to visit her parents for the holidays. She has avoided her family for a while after hearing stories of her father's drinking and his infidelities, so she is unprepared to find her father, a former college professor, in the throes of dementia, while her mother is trying to care for her father, but in an oddly detached way. Ruth agrees to quit her job and move home for a year to help out, although she probably is in equal need of help, albeit a different kind.\"What imperfect carriers of love we are, and what imperfect givers. That the reasons we can care for one another can have nothing to do with the person cared for. That it has only to do with who we were around that person—what we felt about that person.\"What follows are reflections on a difficult year for her family and herself, told as diary entries of a sort. She reconnects with old friends, gets involved in a scheme to try and help her father's self-worth, tries to understand why her relationship ended (and wonders if she really cares), and attempts to figure out her parents' relationship with each other. At the same time she takes tentative steps toward her own future.There are moments of humor, poignancy, frustration, and beautiful emotion in this book. At the same time, Ruth is one of those characters you wish would say the things she really wants to say, but she's so used to taking such a passive role in her own life. (She left college weeks before graduating because her then-boyfriend wanted to move away.)I really enjoyed this book, and despite the fact that the story is told in small snippets of events from each day, I didn't get the feeling I was missing anything from the story. It did feel a little disjointed at times—although there was an over-arching narrative, the story jumped quickly from day to day, so it didn't flow quite as neatly as it could have.Khong's storytelling, however, is utterly exquisite. While her style is rather spare, much like Weike Wang in \nChemistry\n (see my review), she can wring humor and emotion from the simplest sentences. I can't wait to see what she writes next, because her talent really is dazzling.For those who have dealt with a loved one or friend suffering from dementia, this may be a difficult read. But Khong took what could have been a maudlin subject and added other dimensions, so it's the story of a family's journey through difficult and good times, instead of simply the story of a man growing increasingly ill. That's the mark of true talent.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Amalia Gavea", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "\"It doesn't matter who remembers what, I guess, so long as somebody remembers something.\"\n\"Goodbye, Vitamin\" came highly recommended by many people whose opinion I trust and I had high hopes. I expected to enjoy it- if such a verb can be used in this context - but I didn't expect to love it so much. It was a novel that moved me deeply and made me lose my stop in the Tube on my way back from work. And this happens extremely rarely, so you understand how much it influenced me.Ruth returns home to help her mother as her has been diagnosed with Alzheimer. He used to be an esteemed and beloved professor, but now? He's not even allowed to set foot in the campus, a rule imposed by a vindictive former colleague. So, the situation at home is very demanding. In addition, Ruth's private life has its own difficulties. Her career has stalled and her relationship has fallen apart as a result of her fiancé's infidelity.Ruth has an awful load on her shoulders and her minor and major daily trials are described in a contemporary, humorous language that is balanced and immediate, managing to communicate so many things almost without saying anything. Khong uses the diary technique to have Ruth narrate her story. At the same time, we are shown Howard's \"letters\" to his young daughter that are touching, sweet and a beautiful mirror to the wonderful interactions between a parent and a child. There is little dialogue and many poetic, almost dreamy, passages about Ruth's life before and after this eventful year. Her thoughts and confessions, her effort to reminisce about the past in order to understand the present is our vehicle to the story, but I didn't find this alienating. On the contrary, entering her mind made me understand and appreciate Ruth and her surroundings even better.This girl is a delightful character. I loved her and connected with her from the start. She is a tricky one, though. She is brave and resourceful and refuses to give up, but she has many moments of weakness and sometimes, she is too severe with herself. At the hands of a less capable writer, Ruth would have become unlikable, drowned in puddles of melodramatic self -pity. However, Khong knows her Art and, in my opinion, she succeeded in creating a highly memorable heroine that is real, approachable and very interesting. Khong manages to compose fully-developed characters within a limited number of pages. I felt that there was an aura of mystery surrounding Howard, as a father and a husband, as a professor. Linus and Theo were very sympathetic, as well. I can't say the same for Ruth's mother, but she had her reasons.This book is like a beautiful breeze. Khong chose to deal with a very difficult subject as Alzheimer is one of the central issues that are addressed in our society. Judging from myself and from discussions with young and elderly people, this disease constitutes one of our major fears. How would it feel if our parents weren't able to recognize us? How would it be if we were unable to recognize our children? It is too frightening....Books such as this one provide a more optimistic perspective and Khong uses humour mixed with sadness to create a bittersweet novel that never becomes disrespectful or light. It's the kind of book that should be read in order to be felt and one more bright example to the endless list of Contemporary Fiction diamonds.My reviews can also be found on https://theopinionatedreaderblog.word..."}, {"userName": "Cheri", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "4.5 Stars rounded upThere are moments of beauty, moments of laughter, many moments of sadness faced with the knowledge of what is to come, and recognition of what is now the past. When Ruth comes home to help take care of her father who is in the early stages of Alzheimer’s, it is partly an escape from the mess her own life has become, and a return to the comfort of home. A bittersweet return to her childhood home.”What imperfect carriers of love we are, and what imperfect givers.”We age together, our parents and ourselves; the process is so gradual that we rarely think about this. We realize, of course, that we are growing older, we may marry, or have children to remind us how quickly the days pass, but we don’t see our parents the same way. We look at old pictures of them and may vaguely recall that they used to look that way, but we don’t really see that. We see them as we’ve always seen them. Our caretakers. The people who raised us, and when the tables are turned, it’s a hard thing to recognize in someone you’ve known your whole life. That Christmas, her father had given her a small, worn, red notebook, a notebook he’s kept notes in since she was very young. ”He showed me a page from this notebook: Today you asked me where metal comes from. You asked me what flavor are germs. You were distressed because your pair of gloves had gone missing. When I asked you for a description, you said: they are sort of shaped like my hands.”These moments, these excerpts from this notebook are scattered throughout ”Goodbye, Vitamin” but there is much that sweetens the bitter truth of her father being robbed of his memories at the same time as she realizes how closely their memories are intertwined. She reads everything she can on Alzheimer’s, what foods to eat and not to eat, what testing is being done on the subject, and in doing so she learns that scientists are now embedding false memories in mice. ”Why don’t they figure out how to keep mice from forgetting things? We don’t need more memories. It’s hard enough trying to get a handle on the ones we’ve got.”. The notes her father wrote are ones that will pull at your heartstrings, remind you, perhaps of your parents, or how you view the little things your own children say and do, or did, or maybe memories of stories you heard your parents tell you about yourself… lovely memories, cherished ones. This is a deliciously sweet story, with hints of sadness within, but it is never overwhelming, a reflection on love conquering even those moments of sadness and reminding us of how sweet memories can be. Recommended.Pub Date: 11 Jul 2017Many thanks for the ARC provided by Henry Holt & Co."}, {"userName": "Adam Dalva", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/3263980-adam-dalva", "userReview": "Wow, what a wonderful, touching, FUNNY novel, one of my favorites of the year. The structure is very clever - it's a rare novel of reverse accumulation. Ruth has gone home to take care of her father, who has Alzheimer's, and as his memory-loss accelerates, certain plots that would have been used for melodrama by a lesser writer (an affair; a slapstick sequence of classes) fade out because her dad has simply forgotten them. The writing is clever too, with an interesting, tender pivot between caretaker and caretakee appearing about two-thirds of the way through, in the form of simple sentences that try to record a rapidly changing person as they were on a specific day.The word \"quirky\" is bandied about so often about mostly horrid books that it has been ruined, so I'll say instead that I deeply appreciated how weird GOODBYE, VITAMIN is. It thrums with unusual facts and lots of food descriptions, and has a great roster of unusual characters, all of whom (even a deliverer of endives!) are used at least twice. Though the novel is very short, it forms an interesting cosmos. Ruth is a fantastic lead, capable of mistakes, self-doubting, passive except when she isn't, and just a bit frustrating, as she should be. The love interest (I won't spoil it) is someone we root for as well, as is the mother.I found myself tearing up a bit at the end of this. I lost my grandmother, who I loved very much, to Alzheimer's this year, and I'd delayed reading GOODBYE, VITAMIN because I was worried it would be too painful. It is a confounding, impossible, exhausting illness to struggle with, and the last thing I thought I needed was more time with it. But the depiction of Ruth's father restored some happy memories of my grandmother's wonderful - yes, I'll say it - quirks that persisted throughout her struggle. The night I finished this book, I had a wonderful dream about my grandmother. And for that, I owe Khong a debt of gratitude."}, {"userName": "Debbie", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "Goodbye, Vitamin. Goodbye! I yell louder and wave more frantically, in case it isn’t clear: Goodbye! No, I won’t see you later. Go find another reader, one who will appreciate you! Yep, I had to head to the shed and drag out the old Complaint Board. It’s been collecting cobwebs, which is a good thing because it means that recently I’ve been reading a lot of books I love. I’m in the minority here. Most people liked this book about a daughter, Ruth, returning home to care for her demented dad. It is well-written and pretty innocuous. The book just didn’t work for me. Both the voice and the content bugged me—no, “bugged” is too mild a word. The book grated on my nerves. When that happens, there is little hope of a love affair.(If you loved the book, skip this review because it will probably annoy you.)Complaint BoardI say toe-may-doe, you say toe-maud-o. When you come right down to it, it’s mostly a matter of style. Some people tuned right in to this book. They liked the writing style, which I found self-conscious and too precious. I just didn’t like the way the story was told.Nope, we would never be friends. I felt zero connection with the narrator. I mean zilch. I think it’s because she didn’t talk about her feelings much, if at all. Nor was there any introspection. Kids say the damnedest things! . . . . But so? Yes, I’m being anti-Hallmarky here. Throughout the book, there are journal entries from Ruth’s dad, documenting all the adorable things Ruth said as a kid. Ah, yes, isn’t that clever and cute. But it adds nothing to the story. Okay, so I remember writing down all the cute things my kids said, and it’s a kick to reread them. However, I will not just stick them randomly into a novel. I don’t want to hear weird, random facts in the middle of a story. It’s like the author went to a book called “Weird, Random Facts,” grabbed a bunch, and plopped them into the story here and there. What? If the author had thrown the facts into a non-fiction essay, that would have been fine, but I didn’t appreciate them here. They seemed unrelated and out of place, and they detracted from the story. Giving the author the benefit of the doubt, perhaps she wanted to juxtapose some facts against the sad reality—like maybe it was a way that Ruth coped with the sadness of her dad’s condition—but I just wasn't feeling it. Nope, don’t want to hear descriptions of dreams, either. It doesn’t happen often, but it still annoyed me.And nope, I also don’t want to hear interesting but unrelated observations on life. I know I’m being picky, and those who love this book no doubt appreciated these life observations, but I couldn’t get over thinking that they sounded like little thoughts the writer had written down throughout her life, a normal and noble activity that writers indulge in. Again, I thought the author plopped them, like the kid cutenesses and the random facts, into this story randomly. (This is just what I thought. I can’t help that I thought this—so trolls, please don’t attack me.) Hold your horses! (While I take a car ride in my pajamas.) Okay, these two things (horsebacking riding, and later, a car ride in PJs) are not related in any way but both really drove me nuts. Super super minor, and neither activity hardly took up any space—but they go on my Complaint Board anyway.Okay, horses first. Ruth and her buds arranged for her dad to teach a fake college course, because he no longer was allowed to teach a real class. This was very sweet. (Seriously, I did think it was sweet.) Someone got the bright idea to hold one of the classes on horseback because the subject of that particular class was the Pony Express. In the very next paragraph, there goes dad and the crew riding horses. Wait a minute. Come on, how many people do you know who have instant access to a bunch of horses? And if they did have access, there should have been at least one or two transitional paragraphs to get them to the horses—if they happen to live anywhere near a horseback riding facility in the first place. I don’t know about you, but there’s not one in my ‘burb that I know of. And I don’t know one adult (who isn’t totally into horses) who ever just goes horseback riding, all la-dee-da. Here’s how it goes:“But wouldn’t it be educational to have class on horseback? we suggest to Dad. He agrees happily.\"Very next sentence:\"On horseback, Dad attempts to shout educational details about the Pony Express.”And as an aside, because I just can’t resist complaining about the whole horse scene, here is part of the next paragraph: “Some shit falls out of its butt and we avoid it.”Relevance? Was this really an image we needed? And surely this added nothing to the story—we don’t need to know about a horse pooping, sorry. I’m assuming the writer is trying to be funny. I just wasn’t laughing. Bathroom jokes aren’t my favorite thing anyway.To make matters even more unbelievable, they happen to run into the unsympathetic department chairman, who also happens to be horseback riding at the very same place on the very same day at the very same time. Ludicrous ludicrous ludicrous. (I know I have to stop talking about horses, especially since the big beasts only took up a couple of pages. And how can I be critical of the writer adding random facts when I digress and can’t shut up?)Okay, onto the pajamas, which are a pretty anti-climactic follow-up to the horse manure. I don’t have a lot to say about the pajamas, just that there was a logistical problem. Ruth’s friend Bonnie was in her pajamas. The next paragraph starts with “She got in the car and I drove.” They travel all over the place. Maybe it’s common for people to go on trips in their pajamas? So yes, I could be getting a little too nit-picky here. It just seemed like she should have had Bonnie go in and change into clothes first—the editor in me would have been a lot happier.(In a book I loved, The Storied Life of A.J. Fikry, there was a guy who ran around town in PJs. That scene made my Complaint Board, too. So see, I’m not just picking on this book. Or maybe I just have a problem with people running around outside in their pajamas. Very possible.)As I said, this book seemed to resonate with most people. And I will say that I was totally seduced by the first sentence:“Tonight a man found Dad’s pants in a tree that was lit with still-hanging Christmas lights.\"Unfortunately, the seduction ended there. For me this book was a hard vitamin to swallow.Thanks to NetGalley for the advance copy."}, {"userName": "Carol", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "3.5 Stars.. \"Just the year is all it will be.\"GOODBYE, VITAMIN is a light read about a heavy subject matter......Alzheimer's.It is about a husband/father with declining \"lapses in memory....a forgotten betrayal....a special love for daughter Ruth....and the various ways family members keep him eating, involved, happy and active....some are so very touching.It is about....and a bit heavy.... on daughter Ruth's personal life, her past and most recent relationship...the breakup... and her reconnection with an old girlfriend.You'll also find here quite a few healthy eating tips and fun bits of trivia, BUT...honestly, what I wanted and expected was more time with dad in the storyline....like the memories with mom....like the childhood conversations with Ruth from the little red notebook....they were wonderful, but ended all too soon.Very decent fictional debut; but (for me) the story lost focus with too much time spent away from dad. Perhaps that was the point....to show that caregivers have lives too....I'm not sure.Many thanks to NetGalley and Henry Holt & Company for the ARC in exchange for an honest review."}, {"userName": "Julie", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Goodbye, Vitamin by Rachel Khong is a 2017 Henry Holt publication. Poignant and bittersweetI wasn’t sure if I had the emotional wherewithal right now to read a novel that most assuredly would lean toward the depressing side. But, on occasion, I simply can't resist a publishing push and with less than two hundred pages I figured I could handle whatever emotional punches were thrown my way. Once I started reading the book, however, I found the tone to be lighter than I had anticipated, and soon found myself wrapped up in Ruth’s year long journey- Ruth’s mother invited her to move back home after her father begins exhibiting signs of dementia. Having just broken up with her fiancé, feeling at loose ends, Ruth accepts the invitation and moves back home for a year. Ruth’s narration is often flighty, meandering, disjointed, and disorganized, as she works through her personal heartbreak, her mother’s disappointments, and of course her father’s battle to keep his mind sharp and stay active as long as possible. While Ruth is really hurting, she is also determined, treading into uncharted territory, discovering her parents weren’t perfect, but learning to see them in a new, more mature light, as she must now be the adult in the home. She reconnects with old friends, her brother, Linus, and comes to realize despite his foibles, she is the light of her father’s life, the apple of his eye. \"Sharing things is how things get started, and not sharing things is how they end.”The discovery of her father’s diary which detailed conversations he had with Ruth when she was a child, was charming, often hilarious and sweet, but also a little sad. These entries were my favorite part this book and I loved the way Ruth borrowed from this idea, which showed how life really does seem to come full circle. “I like also that having a terrible day pretty much guarantees that the next day will be much, much better.”Life and family are messy, but through all the turmoil, mistakes, and heartbreak, I think Ruth discovered a way to give back to her father some of what he gave to her, and in the process, managed to find the beginnings of her own inner peace. Ultimately, despite the quirky writing style, or maybe because of it, I ended up enjoying this book far more than I would have thought.While this may have been a short, quick read, it was a touching story, overall, and I’m glad I decided to give it a chance. 4 stars"}, {"userName": "Jill Croce-McGill", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/9119740-jill-croce-mcgill", "userReview": "Goodbye, Vitamin by Rachel Khong is a touching gem of a novel about family, friendship, and Alzheimer’s disease with an added touch of laughter, sadness, and love. Ruth Young's life is falling apart, her fiancé just left her for another woman, and her career is going absolutely nowhere. Heartbroken and lost in life, Ruth decides to return home and spend Christmas with her parents. Once home, Ruth's mother begs her to stay for one year to help out with her father who has Alzheimer's, despite her father's insistence that he is absolutely fine. As her father's memory deteriorates Ruth and her mother search for added health benefits - jellyfish recipes and supplements, vitamins, and cruciferous vegetables, all of which her father dislikes. Ruth is determined to read everything she can on Alzheimer's, including all the testing that is being done by scientists to this day.Goodbye, Vitamin is told in a compelling diary form that chronicles the course of a year. Ruth's story is raw, intimate, funny, and tells a story about love, patience, and forgiveness. It's hard to believe that this is Rachel Khong's debut fictional novel. She hit it out of the park with her brilliant storytelling in this heartfelt and entertaining novel.*I want to thank NetGalley and Henry Holt & Company for the ARC of this book in exchange for an honest review."}, {"userName": "Liz", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "I’m dealing with two aging parents, one of whom has some memory issues. So, this book interested me. Ruth is much younger than me, just 30. Her father is young enough to still be working when Alzheimer’s rears its ugly head. Her fiancé has just left her and she’s feeling rudderless, so she quits her job and moves home to help her mother take care of him. Her younger brother offers no help. This is billed as a comedy. But at the beginning, it seemed more hopeless than comedic. It made me feel sad and depressed. There are touches of sweetness, and as the book went on, I found flashes of humor. It’s a weird writing style. Little scenes make up a chapter. It’s more a journal or a love letter to her father. Little bits of insight scattered throughout the pages. There are things Khong gets exactly right. The anger of a spouse about her husband’s past affair, an affair he’s long ago forgotten. Or this quote “You mentioned that there were some things on your mind, but lately you were having trouble getting to them - accessing them. You had the feeling that all the thoughts were in a box covered with tape, and the trouble was there was too much tape and you didn’t have the proper tools to access them - no scissors and no knife - and it was a lot of trouble- every day it was new trouble- trying to find the end of the tape.” I will admit to liking the book more once I got into it and stopped expecting humor. It’s a bittersweet book, poignant really."}, {"userName": "Vanessa", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/25545124-vanessa", "userReview": "Ruth returns home after being absent for some time to help deal with her father's declining health due to having Alzheimer's. I enjoyed how this book was told in a fresh humorous way, she gently touches on the everyday sad reality of losing someone you love to this cruel illness and steered away from what could have been a sad, depressing story, the only criticism is that the book lacked a little focus, it felt somewhat disjointed and random it didn't flow for me enough to feel coherent as a whole. There were some small snippets here and there that I felt were brilliant little life observations and some fun fact trivia that's thrown in that added to the fun, but most of the situations didn't feel overly believable so my connection to the characters especially the father who I should have felt more emotion towards were left wanting, the story was over before I could fully commit to it."}, {"userName": "Karen", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "After a breakup with her fiancé, whom she quit college, to follow him to California, Ruth returns to her hometown to help her mom care for her dad who has Alzheimer's. This is an introspective time for her, and also a humorous yet heartbreaking time as she cares for him and deals with her own issues. I really liked the journal entries that her father kept about her through her growing up years which he shares with her throughout the book.Thank you to Henry Holt and Company Publishing and Netgalley for the opportunity to read the ARC!"}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I'd seen mixed reviews of this one so I held off on it for a while. But I knew it was a quick read so I finally picked it up. I personally loved the sparse contents, a journal with brief entries of a sort, chronological over the course of a year. Ruth, the novel's narrator, returns to her parents' home to help with her father, who has Alzheimer's. Her own relationship has failed and she quits her job to return home, after several consecutive years (or at least holidays) away, so she hasn't seen the deterioration as it happened.The word that came to mind as I sipped a holiday coffee is \"bittersweet.\" The nostalgia and memories are difficult because of the present reality, but the new experiences and transposed realities also have a level of enhanced importance to them, now that the impermanence of life has been acknowledged.\n\"What imperfect carriers of love we are, and what imperfect givers. That the reasons we can care for one another can have nothing to do with the person cared for. That it has only to do with who we were around that person - what we felt about that person.\"\nThere are tiny pieces of the novel that are pieces of journals of her father, observations he made about her when she was a child and would say something accidentally clever or funny. The novel shifts to include more of these from her perspective about her father, and more and more to the present moment without the history. This may seem confusing or small but I think anyone who has been even a partial companion to a parent dealing with a permanent or terminal illness will recognize this type of world. It becomes so small, so fast, and unless you focus on these tiny moments of observation and amusement, all it is is the disease and the loss. So for me, this book is not the least bit shallow, but the natural companion to a very hard time.I also just loved the tiny asides and comments... it reminded me of the tone of a lot of my emails, actually. Maybe I just found myself a lot in this book.\"Lately my thing is inventing new yoga poses. The Onion is one. You make yourself very round, then peel yourself, limb by limb.\"\"Tonight I try my hand at dessert: baked Alaska, because of course. It's so epic! How can you bake Alaska? How can you not?\"\"He tells me about his day. How he was, when I called, leaving a bad stand-up show and feeling outrage. How, earlier today, he returned bad avocados to the grocery store, and got a refund, and felt triumphant.\"\"There are depressed-looking sea snails, sucking algae slowly. It occurs to me that they might be taking their time, enjoying the algae. Maybe they aren't depressed after all. Maybe it's the opposite, and the one who's depressed is me.\""}, {"userName": "Eve", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "\"What imperfect carriers of love we are, and what imperfect givers. That the reasons we can care for one another can have nothing to do with the person cared for. That it has only to do with who we were around that person—what we felt about that person.\"Although this be a slim little book, it is chock full of feeling. Familial love. Romantic love. Selfish love. Imperfect love. This book chronicles a year in Ruth's life when she abandons her independent life away from home, to help her mother care for her father, who has recently been diagnosed with Alzheimer's disease. Ruth gradually finds herself taking her father's place as cataloguer of precious family memories. Full of so much wit and dark humor, it's hard not to love the Youngs, imperfections and all."}, {"userName": "Marchpane", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/6677659-marchpane", "userReview": "This book struck all the right notes for me: sweet without being saccharine, funny but not trying too hard, characters that are charmingly offbeat without being capital Q \"Quirky\". There's a sort of wispy melancholy that never becomes too maudlin. Particularly lovely are the little observances that the dad makes about his little girl in his journal: Today, when I told you to behave, you roared angrily: I'M BEING HAVE.Today I had to stop by the post office, and you looked around and said, aghast, \"This is errands?\"Today you were so readily impressed by me.There are many of these throughout the book, which are later mirrored by the adult daughter's similar observations about her elderly father.Entirely real and relatable, my only criticism is that the latter part of the book felt too rushed. I can see the stylistic choice behind it (the pace picks up as dad's mental state deteriorates) but it felt a little underdeveloped as a result. That's a minor quibble though, as this really was a charming read."}, {"userName": "JanB ", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/260116-janb", "userReview": "4.5 starsWhat a sweet, sad, yet funny book. Told in journal entry format, the novel follows one year in the life of Ruth, who, reeling from a break-up, goes home to help her mother take care of her father who is suffering from Alzheimer’s. She has avoided her family for years, as her father was a drinker and cheated on her mom. Throughout the novel are snippets of journal entries of her father’s from when Ruth was a child. The wonder of the world through a child’s eyes is seen, as many of the entries are the cute, funny, and endearing things children say. The love her father has for her shines through. It helps Ruth, and the reader, see her dad with new eyes. The themes of family, love, forgiveness, friendship, and of course, memory, are explored.Most of Ruth's journal entries are small snippets of her day, in conversational narrative. A fun aspect of the novel is how Ruth researches AD and attempts to slow down the progression of her father’s Alzheimer’s through vitamins, oddball recipes (jellyfish), and superfoods. Food plays an important role in the novel.The comic relief is what keeps this novel from being maudlin. Ruth’s wry observations and her imperfect family can be quite funny. The truths the book contains are never heavy-handed or manipulative. I love it when an author trusts the reader to “get it”. A couple of favorite quotes:“what imperfect carriers of love we are, and what imperfect givers.”“…all of a sudden it didn’t matter what you remembered or didn’t, and the remembering - it occurred to me – was irrelevant. All that mattered was that the day was nice – was what it was.”I really liked Ruth’s voice and when I turned the last page, I wasn’t ready to say good-bye. A fantastic debut! **thanks to Netgalley and Henry Holt & Company for providing me with a copy of the book in exchange for an honest review."}, {"userName": "Maxwell", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "This is a sweet story that reminded me of the film \"Other People.\" It somehow straddles being light and quick with such a heavy subject matter: Alzheimer's. Hard to call it a summer poolside read because it is a bit sad, but I can imagine taking this one on a vacation if you're in the mood for something to get lost in or dip in and out of, but still finish in a timely manner."}, {"userName": "Jessica", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/188447-jessica", "userReview": "I loved this book. I want to curl up with Rachel Khong's writing and take a nap with it. It's so lovely and thoughtful and comforting."}, {"userName": "Barry Pierce", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "I picked up \nGoodbye, Vitamin\n because I had read a review which called it a 'comic novel about Alzheimer's'. I am very much of the belief that anything can be made funny, even Alzheimer's, so this novel sounded right up my alley. I quickly discovered however that this isn't a comic novel about Alzheimer's, it's a comic novel featuring Alzheimer's. But this didn't put me off, Rachel Khong's hilarious worldview kept me going throughout this short novel.The plot revolves around Ruth, a woman who has reached her mid-life crisis at age thirty, who decides to pause her life for one year to act as carer for her father who has Alzeimher's. The novel takes the form of her day-by-day diary. The weakest aspect of this novel is by far the plot. The novel trundles along with a story that is somewhat unbelievable and, whilst the character list is relatively economic, there are no standout stars of this novel. However, what I do applaud this novel for is its random observations. Sometimes Khong will just stop the whole plot to talk about the most incidental of facts or she will point something out about a character and nearly every time this happens you can be guaranteed to chuckle or at least think 'huh that was actually a really clever joke'. Khong's comedy is the saving grace of this novel, it would be a total disaster without it. I really genuinely enjoyed how she sees things and how subtle she makes her jokes, there is no fanfare or warning, she would just drop a hilarious aside into the middle of a paragraph about the horrors of late-stage Alzheimer's. She is a master of comic relief. And the novel is the better for it."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "**3.5, rounded up**Thank you to Goodreads First Reads program for this book, which I won as a giveaway and might not have read otherwise (and thanks, Cheri, for the recommendation of this book that hits shelves on July 11).I will be honest: I don’t know how to feel about this novel. Prior to picking up this book, I had just finished reading a heavily literary, epic novel that was almost 600 pages, and perhaps the contrast felt a bit like culture shock. This book is only 194 pages (and I think you could shave off another 50 due to the journal-entry formatting and short, short paragraphs). And while this novel, about a young woman’s return home to spend time with her father who has Alzheimer’s, is physically small and quite sparse on words, it does pack an emotional punch. It does so, however, amid a great deal of humor. (Hence my own confused state of mind). Alzheimer’s. Sad. Hilarious, seemingly unrelated observation. Funny.  Repeat.I have to think that the author, Rachel Khong, possesses this dry sense of humor, as well – and, as a result, I think it would be a blast to hang out with her. I truly did laugh aloud too many times to count (often worried I’d wake my sleeping husband). So there is a bit of magic in this author’s ability to tell a deeply affecting story with interspersed humor. And perhaps that IS the point: that to deal with painful situations, humans do what they can to cope—often resorting to humor to make sense of the senseless. Ruth has her own life issues to deal with, and to cope, her outlook on the world is infused with bits of humor.But then…This book also is painfully close to home. My father was recently diagnosed with vascular dementia, and I am planning a trip home to be with him – not altogether different than Ruth’s trek home – as the mental decline is happening rapidly (to be honest, he’s been fighting this for more than a decade). I naturally feel dread and overwhelming sadness, coupled with the sense of this trip having some kind of ‘finality’ to it. So it is no surprise that one night, after reading VITAMIN at bedtime, I awoke in the middle of the night feeling sheer panic, the reality setting in that Ruth’s life and her experiences are soon to be mine. The inevitability of the situation really sunk in.But let me emphasize that the writing is not sensational and overly dramatic. It is sparse and doesn’t dwell. And it provides a certain amount of levity with abundant humorous events. My reaction is simply to my situation. And, in the end, I’m glad to have read this book. You can easily read it in a single sitting – possibly even in a few hours. It is engaging, with its easy-to-read, stream-of-consciousness observations, and the beauty, again, is in the author’s ability to get the reader to feel, using so few words. It’s unlike anything I’ve read before. I do recommend it."}, {"userName": "Mandy", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "Witty, comical, downright hilarious at times... once I started this I was so afraid that reading about Alzheimer’s would trigger sad memories from when my grandma had it but this story was funny. Ruth goes to live with her parents after a breakup from her fiancé just when her dad is at the beginning stages of memory loss. Through most of the story it’s her dad giving her snippets of memories he had of her as a girl and at the same time Ruth is making her own memories with her dad before the disease consumes him. Fast read and enjoyable. Would recommend!"}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "via my blog https://bookstalkerblog.wordpress.comWhat imperfect carriers of love we are, and what imperfect givers.” When Ruth comes home to help care for her father, afflicted with Alzheimer’s a beautiful family story unfolds. By no means are they are perfect family, but my heart capsized when reading the notes her father wrote about her questioning mind when she was a child.“You scraped seeds off of bagels and planted them in the flower bed out front. I didn’t have the heart to tell you that there’s no such thing as a bagel tree. Today I thought: I’m nuts- I’m just nuts- about you.” I was nuts about her, such a curious, spirited little girl! All children should know such love and attention. Ruth has always adored her father, but she has been blind to his failings in ways her brother and mother haven’t. For them, the later years weren’t full of a happy husband and father. Maybe her memories are distorted by her enduring adoration of her dad. There has been drinking and cruelties she escaped, and in coming home, with her father’s memories slipping, in his confused state she realizes he wasn’t the most loyal husband nor sober father.College students rally together to make sure he is able to feel important again, teaching is vital to his happiness- and this is one of the sweetest fictions an author has conjured. The novel manages to expose the rawness of family love. It’s a slow understanding that is revealed about Ruth’s mother and father’s complicated marriage as she spends time with him and his slipping memories. Who is the young woman that seems more intimate than she should when in his presence? Why is her mother so angry and yet, she cares for him so tenderly that she expels anything that risks his health. Not that her father much appreciates his wife’s nurturing. She wants to understand why her brother Theo is so mad at their father, but maybe she needs to face her own shame in not coming home sooner.It’s a hard novel to review for me because it’s not a flashy story. Nothing big happens but it is something enormous isn’t it? The betrayal of one’s own mind slowly leaving you, what is more horrible? Unlike many fictional stories, with this one- there are ups and downs. It’s a decline but a slow one, and often that is how illness has it’s grasp on a family- particularly with Alzheimer’s disease. Memories can be mean and bite, but they can be beautiful and moving. There is not one perfect character, but that’s what makes it honest. Something about this family tugged at my heart, and I fell for them. I was fattened up by a father’s love for his little girl, and the bittersweet pain of seeing your parents as human beings rather than gods. Lovely. Add this title to your summer list.Publication Date: July 11, 2017Henry Holt & Company"}, {"userName": "Book of the Month", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/46126209-book-of-the-month", "userReview": "You Are What You EatBy Judge Isaac FitzgeraldI’ve always been a fan of a certain kind of summer read—the book you take to the beach, expecting only fun and laughter, when it blindsides you with emotion and devastating insights until you’re both laughing and crying, tears and sand on your cheeks combining into an abrasive paste that would feel painful if you weren’t completely immersed in an incredible book. (Just me?) The kind of book that matches lightness with a certain level of darkness, feeling all the more true and alive because it contains everything alongside everything else, the way our lives do.This summer, that book is Goodbye, Vitamin, the debut novel from former Lucky Peach editor Rachel Khong. Told in diary format, the novel follows a young woman named Ruth, whose life is in somewhat of a shambles after a broken engagement. She moves back home to help her mother care for her father, a history professor who has just been diagnosed with Alzheimer’s.Heavy stuff—and Goodbye, Vitamin never shies away from it. But I also want to talk about how this book is a pure and utter delight to read. Ruth is a narrator you’d follow anywhere, her perspective hilarious, playful, and keenly observant. Though she’s often perplexed and unsure of what to do, she’s also always trying to make the best of things. One of the ways in which she tries to help is through food, as she cooks for her tired family and continually tries to entice her father to eat. (As to be expected from Khong, her writing about food is always fascinating, startling, and delectable, and is one of the many great joys of Goodbye, Vitamin.)Along with Ruth, every one of the characters feels alive. Her mother, her father, her brother, her friends, her father’s former grad students—they are wonderful, strange, and infuriating (sometimes all at once) in the way of people you love or could love. And that’s how Goodbye, Vitamin gets you: As it dazzles and delights, as it compels you to fall in love with the people within its pages, it too shows you what is impossibly hard about love, about life. The book explores questions like: What do we owe each other? How do we forgive people when they change, especially when we haven’t fully forgiven them for who they were before? How are we supposed to let go at the same time we’re desperately trying to hold on to what we can?Full of food, family, friendship, and love, Goodbye, Vitamin contains everything a reader might need to make them happy, while also showing how these things can be taken away, whether by accident or time. It is heartbreaking. It is a joy. Which means, of course, Goodbye, Vitamin is a perfect summer book.Read more at https://www.bookofthemonth.com/goodby..."}, {"userName": "Rebecca Foster", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "Reeling from a broken engagement, Ruth Young returns to her childhood home in California for a year to help look after her father, who has Alzheimer’s. She tries feeding Howard every half-cracked dementia health cure (cruciferous vegetables are a biggie) and, with his teaching assistant, Theo, maintains the illusion that her father is still fit to teach by gathering graduate students for a non-credit History of California class that meets in empty classrooms and occasionally off-campus – wherever they can be away from the watchful eye of Dean Levin. As these strategies fail and Howard’s behavior becomes ever more erratic, Ruth realizes the best thing she can do is be a recorder of daily memories, just as Howard was for her when she was a little girl: “Here I am, in lieu of you, collecting the moments” – “Today you…” This is a delightfully quirky little book, in the same vein as Lisa Owens’ Not Working and Elizabeth McKenzie’s The Portable Veblen. I marked a bunch of funny metaphors:This morning’s [hangover] is a rodent: pesky but manageable.It was grotesque, the way I kept trying to save that relationship. Like trying to tuck an elephant into pants.The moon, tonight, looks like a cut zucchini coin.But you may well read this with a lump in your throat, too. From one Christmas to the next, we see how much changes for this one family; it’s a reminder that even though the good times are still worth celebrating, they’re gone before you know it."}, {"userName": "David Yoon", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/4934590-david-yoon", "userReview": "30 year old Ruth finds herself sitting alone in her new apartment. She was supposed to be sharing the place with her fiance Joel - who, on the day of the move, announced he wouldn’t be joining her and instead would be staying at their old place with his new girlfriend. Soon after she is home for the holidays where she learns that her father has been having lapses. He’s in the early stages of Alzheimer’s and has already lost his position at the college teaching history. Ruth is asked to stay for a year to help out. Her younger brother has decided to stay away, having still not forgiven their father for his infidelity and alcoholism when he was younger. Sounds like a ton of fun. But Rachel Khong works with a light touch.Ruth records her year at home in diary format. Her accounts are bookended with the notes her own father left for her in an old notebook. She reads about her youthful queries about where metal comes from and what flavor are germs. It’s a year in the life. There’s no real beginning or end, no tidy resolution. It barely hints at the inevitable struggle that will grow in the following years and already has the gauzy feel of nostalgia. It’s a book about memory and the things we hold on to. I suspect it would be frustrating for a reader hoping for a closer look at Alzheimers, a climactic confrontation of past betrayals, a sobbing acceptance of a love lost. A swelling of the orchestra and an emotional close-up. None of that is here. Ruth instead records the quirky everyday things that often stick out. Her father holding his regime of vitamins in one hand, shaking them like dice. I like that. Wry and melancholic but still as familiar as your mom’s cooking and just as beautifully done."}, {"userName": "Mercedes", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/5124500-mercedes", "userReview": "3.5 stars"}, {"userName": "Cindy Burnett", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "Goodbye, Vitamin tells a heartbreaking story of the impact of Alzheimer’s on both the individual afflicted and those who love that individual. Khong accurately depicts the effects of Alzheimer’s on the brain and how scary those effects are to everyone involved. She also includes some interesting information on how the disease was named which I enjoyed learning.I think my anticipation of how good this book would be may have ended up coloring how I felt about it in the end. From the first time I read about Goodbye, Vitamin I was dying to read it. When I finally got a copy and sat down to read it, I think the book could not meet my high expectations, and several of my recent reads made Goodbye, Vitamin not quite as appealing as it might have been otherwise. I am only including these thoughts because I might have liked the book better in other circumstances.A recent trend in literature seems to be a scattered, random method of telling a story. Goodbye, Vitamin is written this way as well as Chemistry by Weike Wang. I felt Wang managed this method better, and as a result, I enjoyed that story a bit better. I found Goodbye, Vitamin to be a bit hard to follow and was not always sure what point she was trying to make, but overall I was glad that I read it.Thanks to LibraryThing and Henry Holt and Company for the chance to read this ARC in exchange for my honest review."}, {"userName": "Kathleen", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/56509454-kathleen", "userReview": "I received an advance copy of this novel from the publisher via NetGalley, in exchange for an honest review. The honest truth is, I was not ready to read this. I was drawn to the story of a woman whose father is in early stages of Alzheimer's due to a similar personal situation. I read this less than three weeks after losing my father to a neurological condition that made him unable to speak and eventually progressed into dementia. I mention this because I expect that there's a link between my recent experience & raw emotion, and my somewhat negative reaction toward the novel. I considered not writing a review at all, but decided it may be helpful to someone. There may be others in a situation similar to mine, so instead will just say, please take this review for what it's worth. I'm sure many people are drawn to books about parents with Alzheimer's and dementia because we hope to draw something out of it to help us understand our own struggle watching our loved ones' slowly slip away. For me, this was somewhat difficult to get through. Ruth, the main character, agrees to quit her job and move in with her parents so that she can be her father's catetaker while her mother is working. It's written in an epistolary style, like journal entries, as we understand what is happening in her life over the course of a year. I think the coldness of that style made it hard for me to get into. I was also distracted by the practical improbability of how this 30 year old woman was able to drop everything and become a full time caregiver for her father. I will forever wish I could have done that for my father but where does the money come from? In reality, this is a very emotionally and financially draining disease and dramatically, the story works well, but practically it was hard to put myself in this character's place, after the path I have already walked."}, {"userName": "Julie Ehlers", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "Unfortunately I have to check the \"nope\" column for this one. I just wasn't feeling the love so many Goodreaders seem to have for Goodbye, Vitamin. For starters, I wasn't a fan of the \"this happened, and then this happened, and then this happened\" writing style. I also had a strong feeling that the author had saved up every oddball thought she and her BFFs had had for the past five or six years and spent it all on her first novel—the quirkiness just felt extremely forced and some of the metaphors were eye-rollingly absurd. I know some readers have attributed the less-than-stellar writing to this allegedly being the main character's journal, but I'm not seeing any evidence that this is actually the case. Sure, the sections are labeled with the day of the year (until they aren't), but I think it was just a halfhearted attempt to impose a structure on a book that has no real structure to speak of—it's like a bunch of parts that have been laid out on a blanket, and no attempt has been made to fit them all together.My grandmother had Alzheimer's disease; she died six years ago this week. However, she lived halfway across the country in a nursing facility, so I wasn't there for the day-to-day of her illness. I can understand why those who have been there would find this book moving, and I would never want to take that away from anyone. But for me there just wasn't much else to Goodbye, Vitamin."}, {"userName": "Brenda Ayala", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/9873129-brenda-ayala", "userReview": "I think I read this wrong.I get what the author was doing, but it didn't hold the same significance for me. It's implied that our narrator is writing a journal, but since it is so all over the place and unorganized I couldn't help but think that it seemed like a cop out for the author to have no plot while writing.Plus I liked Ruth way more as a child than as an adult. I didn't find her (or her family) funny and the delivery left a lot to be desired. Since everyone else is giving this like 4.5 stars then I will just say that I probably read it wrong and nobody should listen to me."}], "description": "Goodbye, Vitamin is the wry, beautifully observed story of a woman at a crossroads, as Ruth and her friends attempt to shore up her father's career; she and her mother obsess over the ambiguous health benefits - in the absence of a cure - of dried jellyfish supplements and vitamin pills; and they all try to forge a new relationship with the brilliant, childlike, irascible man her father has become.", "title": "Goodbye, Vitamin", "url": "http://www.goodreads.com/book/show/27746288-goodbye-vitamin?from_choice=true", "average": 3.72, "cover": "https://images.gr-assets.com/books/1509043032l/27746288.jpg", "reviews": 1757, "authors": [{"url": "https://www.goodreads.com/author/show/14650756.Rachel_Khong", "name": "Rachel Khong"}], "type": ["Fiction", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27746288-goodbye-vitamin", "http://www.goodreads.com/book/show/35126418-goodbye-vitamin", "http://www.goodreads.com/book/show/31848273-goodbye-vitamin", "http://www.goodreads.com/book/show/33670452-goodbye-vitamin", "http://www.goodreads.com/book/show/35378228-goodbye-vitamin", "http://www.goodreads.com/book/show/39282528-my-dear-you", "http://www.goodreads.com/book/show/30984631-all-about-eggs", "http://www.goodreads.com/book/show/37971700-cabbage"]}