{"ratings": 38, "userreviews": [{"userName": "Taryn Spearey", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/43487135-taryn-spearey", "userReview": "This a good and fast paced read. Rachel Yoder is always having some kind of trouble, from listening to other's conversation to getting off track when it comes to her chores.i don't have too much to say, other than this would have been better to read when i was little."}, {"userName": "Laurie Carlson", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/4898049-laurie-carlson", "userReview": "Rachel Yoder Growing Up by Wanda E BrunstetterWanda E. Brunstetter wrote a series of eight books about a little Amish girl named Rachel Yoder. This book is the second set of the four last books in her series about Rachel Yoder, which are four books combined into one. The four volumes in this book are “A Happy Heart”, “Just Plain Foolishness”, “Jumping to Conclusions”, and “Growing Up”. These books are about a little Amish girl named Rachel Yoder, who is 8 years old, and has a birthday in these books where she turns 9. She experiences all kinds of things she calls ‘trouble, trouble, trouble follows me everywhere.’ What is really happening is what happens to all little girls, Amish or not. She is growing up and is going through the trials and errors of growing up and learning what is and is not right to do. She does not understand this and keeps saying ‘trouble, trouble, trouble follows me everywhere.’ It is not trouble she is getting into, but common everyday things that little girls learn from while growing up. Sometimes she has to be punished for what she does, but that happens to all children as they learn about what is right from wrong.In the first book, Rachel Yoder has to face the possibility of needing to wear glasses and the thought of wearing glasses does not sound like fun to her. In the second book, Rachel Yoder feels very jealous of her newborn little baby sister, Hannah, because she is born on her birthday. She thinks everyone has forgotten her birthday because they are all paying so much attention to her new little baby sister, and have not done anything for her birthday. In the third book, Rachel Yoder eavesdrops and overhears people talking about things and thinks she knows what they are saying. She does things differently than what she normally would do because of what she thought she heard them saying, and she also repeats some of the things she thinks she has heard other people say. She ends up getting it all wrong and has to face the trouble she gets into. In “Growing Up”, Rachel goes through a stage of absent mindedness and ends up doing all sorts of silly things. She does end up realizing this and starts to do things differently, and her family starts to see she is acting and is more grown up.All little girls and boys who read this book will be able to relate to Rachel Yoder’s problems as she grows up and faces what she calls ‘trouble, trouble, trouble follows me everywhere’. They may feel the very same way.These books are the first introduction to children about the Amish way of life. What the children who read these books will learn is that there really is NO difference between what they learn and what Amish children learn at the same ages.These books will fascinate little girls and boys as they read these books and learn the differences between what it is like to live as an Amish child and their own lives. They will see how Rachel Yoder lives a differently, on a farm, wearing different clothes and attending school differently than the way they do.I received this book from Barbour Publishing, through NetGalley, in exchange for writing a review on the book.Laurie Carlsonwww.lauriehere.blogspot.com"}, {"userName": "NaDell", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/1973732-nadell", "userReview": "I haven't read the very last in the series yet (waiting for my turn at the library), but this is a good series for a young girl to read."}, {"userName": "Rhonda", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/4118407-rhonda", "userReview": "A wonderful read aloud for my daughter and I. She wishes there were more Rachel books yet to read."}], "description": "Join Rachel Yoder on a series of adventures with this story collection written by bestselling author of Amish fiction Wanda E. Brunstetter. Four stories under one cover will provide you with unlimited entertainment and laughs along the way as you accompany Rachel to the eye doctor's (with a belly full of butterflies), visit Hershey Park (and experience a breathtaking ride), and even fall into a chilly fishing pond (oops!).", "title": "Growing Up in Lancaster County\n      \n          (Rachel Yoder — Always Trouble Somewhere #5-8)", "url": "http://www.goodreads.com/book/show/9450057-growing-up-in-lancaster-county", "average": 4.42, "cover": "https://images.gr-assets.com/books/1328734925l/9450057.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/79251.Wanda_E_Brunstetter", "name": "Wanda E. Brunstetter"}], "type": ["Amish", "Christian Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/9450057-growing-up-in-lancaster-county", "http://www.goodreads.com/book/show/136963.The_Bishop_s_Daughter", "http://www.goodreads.com/book/show/136967.The_Storekeeper_s_Daughter", "http://www.goodreads.com/book/show/5055957-a-cousin-s-promise", "http://www.goodreads.com/book/show/181416.The_Quilter_s_Daughter", "http://www.goodreads.com/book/show/495300.A_Sister_s_Secret"]}