{"ratings": 1516, "userreviews": [{"userName": " Stacy ", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/29711766-stacy", "userReview": "I wish I could've written a review of this when it was fresh on my mind. It was a fantastic dystopian read and I wish I could remember all of the details.The story starts out with a female warrior (Kit) fighting and eventually killing her best friend in the ring. Picture a Roman Colosseum with Gladiators, but in the future type setting. The warriors all wore collars around their necks to \"regulate\" their emotions. Right before killing her best friend, Kits collar is broken and she experiences a rush of strange emotions. She goes on to hide this fact from everyone around her and things get incredibly crazy. Not to mention, while all of this is happening our characters are living in the midst of an insanely psychotic and corrupt government. BTW, I love reading about insane governments, it's kind of \"my thing\".\n\"Just know, Kit. After seventeen years, I'm finally awake. And I'm going to find a way to wake you up, too.\"\nAfter the Kit losing her collar (halo) fiasco, she escapes the city and makes a run for it. Outside the city, she meets Ryka. Things get even more interesting after she follows him back to meet a large isolated community of people living in the woods.Halo really impressed me, and it was exactly the type of dystopia I was looking for. It was exciting, mysterious and had a great cast of characters. I definitely want to read more of this series."}, {"userName": "Tee loves Kyle Jacobson", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/2566871-tee-loves-kyle-jacobson", "userReview": "First I have to say that Frankie Rose is an incredible writer. Lord knows when I am reading anything from her I close my world off and it is just me and the reading and nothing else. In Raksha I could not put it down. Lord I was hooked right from page one and kept reading. I have a new book boyfriend Ryka, blond and totally swoon worthy!Can you imagine living in a world where you don't feel anything.Life just passes you by and do what your told and never ever question anything. Well welcome to Kit's life. She fights and she heals and she fights and she heals that is her reality but soon her reality is about to change and when it does things get complicated and feelings are felt that are not supposed to be felt and the reality of a new life and a new love is scary to Kit. She is nameless with her knives her training knowledge and her halo. Then her best friend is killed and Kit's world changes.With all these things going on for Kit what happens next is the scariest for her. She has never felt anything but suddenly she feels something for Ryka. She just wants to be left alone but Ryka refuses to leave her alone. He wants to protect her and she wants nothing to do with him. Soon Ryka gets under Kit's skin and she realizes that everything she is and everything she knows is not what it seems and Ryka well maybe she can feel for him.What will Kit decide? What will Ryka do? Will he stay by her side or leave her?"}, {"userName": "Ren", "userReviewDate": "Mar 14, 2013", "userURL": "http://www.goodreads.com/user/show/7279998-ren", "userReview": "WOAH GUYS!!!! This book had me doing my happy dance. I literally thought my heart stopped. This was one of those books that will have you on the edge of your seat, desperately trying to hold on...white knuckles and all. Have you even watched a really suspenseful movie and you have to stop breathing for fear of what's to come? Yeah, that was me the entire time! I almost felt that if I let my breath out, something bad was going to happen. I'm surprised I still have nail beds at this point. Frankie's writing seems to get even more phenomenal after ever book that she writes. I love her Hope series but I fell hard for this one. Fans of dystopian novels will love this ride! Be warned, there is a fair amount of violence in Raksha and the author does not hold back when it comes to gore. I love gore! I say \"the more, the better.\" It had just the right amount of angst when it came to the romance department. I feel like you can't go big with romance in these types of books simply for the fact that people are killing each other. Kinda sucks the romance out of you. I can't help but love these characters. I don't want to spoil anything but I mourn the loss of Cai. Even in death I frickin love him and I'm a little sad I didn't get to know him more. I almost wish that Frankie will write a short story on him but that's a conversation left between us. Kit and Ryka.... I just love them both to pieces. I just think it's so fucked up for her to leave one messed up society to one that's equally terrible. I loved the ending of the story and it left me curious for what is to come in the series. I really hope you will all take a chance and read this book."}, {"userName": "CasPerfitz~SLiTsReaD", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/9406114-casperfitz-slitsread", "userReview": "[Here is just one of the many scenes that I like : My face breaks the surface of the water and I drag in a frantic gasp of air that makes both my head and my lungs explode. Fear pulses through me for a second when I open my eyes and it’s still dark. I’m neck deep in water. We’re in the tunnel?“It’s okay, it’s okay,” Ryka says. “I’m right here. I’ve got you.” With his arm locked around my ribcage, pressing me to him, he really does have a firm grip on me. “We’re halfway, okay? Just take a breath. Get some air into your lungs.”I can’t, though. It feels like I’m trapped in a vice and my chest can’t expand. “Take…take me back―” I splutter.“It’s okay, just relax. I have you. I’m not letting you go.”“No.” I shake my head. “I can’t. Just take me back. We’ll find another way around.”“We don’t have time, Kit. Please, just calm down.”I start struggling against him, gripped by sheer animal instincts, and his hold tightens. “Kit! Don’t make me knock you out. Just trust me!”My arms and legs go still. It takes everything I have but I force my body to relax. “I do trust you. I just―I can’t breathe.”I feel his lips against my forehead and even though I can’t see him, the contact steels my nerves.“This will be over in less than a minute,” he says quietly. “We’ve got to go back under so we can get out. Are you ready?”The current pulling at my legs feels impossibly strong, but I nod. “Okay. Okay, I can do it.”“Good girl.”  (hide spoiler)]"}, {"userName": "Autumn", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/3315226-autumn", "userReview": "I was basically promised by the universe that I would love this book.. Congrats universe you were right AGAIN! Raksha started off pretty emotionally intense.. I dont know if im the only one but if someone told me I had to fight to the death against my best friend, Halo or not id probably mess my pants..Yet Kit does it and he sacrifices himself to free her from her Halo and life as an emotional robot.. At first she doesnt understand the incredible gift Cai gave to her but with help from his sister she begins to understand.. She tries to hide her malfunctioning halo but eventually runs away and nearly dies in the process.. But she is saved by a handsome young man who takes of her despite her resistance.. Though its not all smooth sailing I would say theres some HUGE bumps in the road for those two.. But their chemistry is undeniable.. And you cant help but root for them..This book was back to back action just as things are starting to settle theres something else causing your pulse to rise and your bad habit of biting your nails into overdrive.. I devoured this book in what would total 6 hours in a perfect world where my kids were independent.. Everytime I tried to put the book down.. It was like I was drawn to pick it up again.. and so I did.. Perhaps because Ive added Ryka to my list of book boyfriends idk.. I suppose anything is possible.. But I really did enjoy Kit.. She was sooo strong.. even in her most vulnerable moments.. This story was amazing and I could honestly say I would and could see this book brought to life on the big screen.. Oohh even as a television series.. I would actually watch tv! And thats huge I basically dislike tv unless is the mentalist but I digress.. I may have fallen in love with Frankie Roses writing and wonderful story telling.. I cant wait to read more about these two.."}, {"userName": "Jordan", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/141917-jordan", "userReview": "I have had the good fortune to read an advance copy of this amazing distopian novel and can't wait for others to read it. Rose writes in tight, electric prose that never gets in the way of her story. The powerful character of Kit is both cut off from her humanity, but more deeply human than most. Rose reveals an assured hand as a storyteller as Kit makes a hero(ine)'s journey that will be as beloved as the Hunger Games. Don't miss this one!"}, {"userName": "Ashley", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/9871824-ashley", "userReview": "this book was pretty much amazing! I loved it. There was never a dull moment, and once I was actually able to sit down and read it, I couldnt put it down! Im SO FREAKING GLAD THAT I STUMBLED UPON THIS, and I'm really excited to get into the sequel and see what happens to Kit and my newest book boyfriend, Ryka. I HEART THEM SO MUCH!"}, {"userName": "Teigan", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/18664746-teigan", "userReview": "I'm not a fan of dystopian books, but Halo was a pleasant surprise.From the very first page, story pulled me in with its grim introduction and begins at a very pivotal, heart-wrenching moment. The world, or the Sanctuary, is a very lonely, very detached place -- most inhabitants wear a Halo around their neck, a unique device that suppresses the experience of emotion in its wearer, even eliminating pain altogether. Falin Kitsch is a renowned fighter having never lost a match against her opponents. After all, losing equated to death by the victor's hands. But in a turn of events, the next match she'll face will be against her long-time training partner and somewhat \"friend\" since childhood. It's win or die. As the story plays out, Kit unintentionally escapes from her Halo and struggles to adjust to the onslaught of strange feelings that are out of her control. The book is her journey from being a leashed fighter with no understanding of emotion to a girl that discovers a world of colour -- anger, pain, compassion, jealousy, sadness, love, regret -- beyond her comprehension.If it sounds slightly cliche, it's because it is, and that's why the dystopian genre doesn't appeal very much to me -- every dystopian book must adhere to two distinct features, where it takes on oppression as a fundamental theme, and portrays society as the primary antagonist working against the interests of the people. With these two key requirements, there is little room left for originality. How many non-mainstream dystopian plotlines have emerged in the last couple of years? Yeah, I can't think of any either. Although one could argue that it takes an extraordinary author to conjure up a fresh idea...?I did like this book, hence the four star rating. It was written nicely and speckled with carefully inserted, poignant scenes that I loved for making me feel so much and hated for making feel that way. Oh, the irony. There were also some very sweet moments where Kit experienced something for the first time, and it was so wholesome watching her process her emotions. One problem, however, is that even after reading the whole book, I'm not entirely sure of the stories context -- why does the Sanctuary require the use of Halos, or even regular matches between Falin? The two aspects are especially central to the story but justification, the whys eluded me. Kit was a kick-ass, self-sufficient character who could annilihilate Freetown's most elite combatants. Which is why I wanted more action in the book and to watch her slay her enemies down the way I knew she could. Unfortunately, Halo is, more than anything, a story of self-discovery rather than an action story. It's not a bad thing, I just would have enjoyed it more the other way.And Caius... I wanted more of him. I can't help but feel that he would have been a powerful addition to the book. If only there had been a little more focus on his parts.I came into the book unknowing of what I should expect, seeing as my recent track record of books hasn't been the best. I'm glad that I liked it, that it didn't disappoint me and that it had me fixated on the story despite being a dystopian novel."}, {"userName": "Fab Fun & Tantalizing Reads", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/16876836-fab-fun-tantalizing-reads", "userReview": "This book was wayyyy out of my comfort zone. Dystopia novels is something I try to avoid like the plague. To this date I have only read a handful, and those were part of Bookshelf Bingo last year sometime, but this book...wow. It may not have been what I thought I wanted, but boy-oh-boy it was what I needed to re-ignite my passion for reading. I.could.not.put.it.down.\nFrom the first page I was interested, invested, engrossed. Stuck like glue to my kindle, to the world Rose created and to the highs and lows that is Kit, Ryka, Freetown, the Sanctuary, Olivia, Jack & Cai & ALL THAT ACTION. There was always something important happening or about to happen. So much ass kicking!I'll start with the world building. Now, I'm not a huge fan 'wordy' or so much description that makes my eyes glaze over in my reading but I completely and totally was a slave to each and every word all the way through. There was no skipping! After reading this I have worked out I seem to favor 'fluffy', 'easy' reads without even realising. It's so easy to get caught up that I forget about my love for UF and novels with more action involving weapons than action in the bedroom. I'm thrilled to have found that passion again in this book.The characters, learning and living with emotion for the very first time, the fighting, and the whole world Rose transported us too...there's just so much to mention without glazing over your eyes. To me, this book was the total package. I cried WAY MORE than a few tears. I giggled at Kit (ALL THE TIME! - the rationale about the fires, the dresses/bells & so many other Kit moments made me laugh SO loud!) and my boy Ryka too. Right throughout the book my heart was pounding through my chest. I thought it may just pop out near the end. I need more. Like ASAP. Yesterday even. I have so many questions, and that was before the darn epilogue! I can't wait to be reunited with everyone I came to care for. I was laughing or crying and right now I feel like doing both because I wah-wah-want more...Kit was so refreshing. She wasn't all snarky and 'Rose Hathaway', my most favorite female hero, but she had other qualities that endeared her to me just as much. I never thought I would say I enjoyed a less snarky protagonist. LOVE HER! Ryka was just...*swooooooon*. His protective, caring and stubborn nature was fun, but not more so than his sweeter side. That boy has got both swagger & sweet tucked into those boots. Pop over to see their bios on Rose's blog!It was awesome reading such a fabulously great novel from a fellow Australian, Bravo Ms Rose. Seriously an amazing read that I will be recommending to everyone. I thoroughly enjoyed it (even with the CREEPY Priestesses & a crazy ass twist I didn't see coming)!\nDelirium cross Hunger Games cross Divergent ♥Here's some of my favorite passages:\nFear has to be the most unpleasant feeling I've ever experienced. It leaves me frantic and filled with self-pity, and I end up getting angry all over again at how pathetic I'm being.~ \"Radicals?\" Ryka narrows his eyes at me. \"Thats what you call us?\"\"Uh-huh.\"\"Well that's ironic.\"\"Why do you say that?\"\"Because you're the radical ones. Your government thinks you can't be trusted, can't be civilised enough to handle your own emotions, so they collared the whole population like dogs. Turned you all into walking zombies.\"~Four bells for four hours work. I have no idea what the value of a bronze bell is but I'm hoping it's a lot. Cleaning vegetables is really not fun.~\"Well, we're friends. In that weird way where you're eternally mad at me, and I'm eternally imagining what you look like naked.\"~\"I'm begging you not to choose this. Choose something else. Choose the possibility that there could be something else worth feeling all the bad stuff for. Choose me.\"~\"Faith is a fragile thing. More often than not, it gets broken and worn away by life. It requires us to be willing to fight for a belief, to choose to believe it...\"LOVE-LOVE-FREAKING-LOVED THIS BOOK. THERE IS NOT ENOUGH STARS IN THE GALAXY TO TELL YOU HOW MUCH I ADORED EVERY WORD ON EVERY PAGE AND EVERY SECOND I SPENT IN THIS WORLD \nThis review was also posted at http://fabfunandtantalizingreads.com"}, {"userName": "Ali ", "userReviewDate": "Mar 07, 2013", "userURL": "http://www.goodreads.com/user/show/5847230-ali", "userReview": "Originally posted at GingerRead\nImagine a world were your entire life is spent with a collar around your neck, injecting you with small amounts of drugs every time you feel emotions of any kind. Keeping you in a constant state of comfortably numb, keeping you in a constant state of comfortably controlled. You have no name, you have a family that only cares about what you can do for them, your life is spent fighting for your life, literally. Can you imagine it? Well, no probably not and that's fine. You don't have to because Frankie Rose has done it for you in her amazing new novel, Raksha.Raksha starts off with Falin Kitsch about to take on her most important fight yet. She will be pitted against her life long training partner, her best friend - if those exist in a world without feelings - and one of them will not be leaving the arena alive. At the eight percent mark on my Kindle, I had to pause. Set my Kindle down. Take some calming, healing deep breaths and remind myself that this is just a book and I can survive it. The first knife fight scene in a book about knife fighting and I was already an emotional mess. What did that say for how my emotions were going to handle the rest of the book? \"You move like flowing water when you fight. It's breathtaking, really. You're so powerful. Graceful. I have to struggle not to touch you. All I want to do is reach out and run my hand through your hair. That's weird, right? Sorry...\" he says, grinning. \"But then you usually kick me in the face and, well...it's hard to feel romantic towards someone kicking you in the face.\"The fight has left our heroine with a broken halo (collar) and she is feeling everything. Guilt, pain, sorrow, loss, scared and an overwhelming desire to escape Sanctuary. This is where the story takes on a new feel. Raksha has elements of The Hunger Games, Under the Never Sky and maybe even a little Divergent and Delirium. But at the same time is nothing like any of those stories. Kit, the name she's decided on now that she is no longer controlled by a cruel government, escapes into the outside world. It is in the forest, as she's running for her life that she meets Ryka. FYI, all you ladies who love a good book boyfriend, Ryka is a great pick!\nRyka takes Kit to Freetown, a town where girls don't carry knives and fight for their lives. A town with some deep seeded, somewhat archaic religious beliefs and nearly barbaric rituals. Kit doesn't fit in but has no where else to go and finds she is quickly becoming attached to Ryka and his family and these new feelings she is having may be enough to risk her life to stay with them. To learn what it means to love and be loved. \"You'll spend all day every day imagining ways to make them smile. Imagining what their lips feel like on yours. Imagining ways to make them agree to fall as stupidly and painfully in love with you as you have with them.\"As she always does, Rose delivers some really wonderful characters. Some you love, some you adore and want to pinch their cheeks for being so cute, some you will admire for their absolute bravery and strength, some you will hate. One in particular, for me. I won't spoil anything but by the end of Raksha I was ready to throttle this 'someone'. On the other hand there were others that I just want to wrap up in blankets so I could cuddle and coo at them and tell them everything is going to be fine. Even if it's not. Because it may not. This world is rough, harsh and I see an epic battle coming and I have a sinking feeling that there are going to be some people in harms way that I don't want to be there. I am all too excited to see where this series is going. Filled with amazing fight scenes, beautiful characters, snide humor and honeyed moments...Raksha was an absolutely entertaining read."}, {"userName": "Online Eccentric Librarian", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/15784017-online-eccentric-librarian", "userReview": "More reviews (and no fluff) on the blog http://surrealtalvi.wordpress.com/\nHalo is a YA dystopian that features the usual cliches: unique snowflake teen female protagonist, rigidly ordered dystopian society, wilds outside the walled safe civilization city, and romantic but rough love interest once outside. To be honest, it felt very much like I was reading Into the Still Blue once again - so many similarities in the world building and characters. But the inconsistencies kept this from being an engaging read and plants it firmly at 2.5 stars, rounded up to 3.In a society ordered very similar to ancient Rome, a walled post apocalyptic city has divided its society into several castes. To ensure an orderly society, all the lower castes wear a collar, called a Halo, that continually injects doses of toxins/drugs to nullify heightened emotions. Kit is of the lower caste despite having an aristocratic father. She has trained most of her life to fight to the death in the monthly arena games - and she does it very well. But when she is forced to fight her mentor and greatest friend, she finds herself freed of the collar's dampening influence and she leaves the city. Outside, she is saved/befriended by Ryka, a fighter on the outside who also battles in arenas. Together, they will challenge both their societies and the leaders who have manipulated the people into the deadly games.Halo might have received a higher rating from me had it not been so inconsistent and conflicting on its characters, story and even message. Characters contradicted themselves often and never seemed to offer up any reasoning for their actions. E.g., why does a girl with little knowledge of emotions end up being so sarcastic, verbally abusive, and lovestruck after only a day of losing the collar's effects? Why is there no period of sensory overload as she begins to learn how to deal with not being drugged? Why does the male lead swear up and down to never abandon her and then get upset at her and leave her for several days knowing that she's in great danger? Why does another character get upset when she dumps a boy to join a religion - and then she freaks out about him abandoning her to be with another girl the same day?World building was also problematic for me. Why do the outsiders decide to attack the city over its barbaric waste of human lives in the arena - when they also have arena death matches forced on their denizens? And yes, why would they risk their fragile stability and existence to go help someone else anyway? More lives would die trying than saved and for what?On the plus side, I was glad to see that the society to which Kit escaped had its own problems. But at the same time, I kind of feel like there are so many mixed messages about both societies. Violence is a main part of the story (though there is very little actual real violence and killing - there was more in the Hunger games) and the blood sports only play a small part of the book. But the level of violence is the same outside so that isn't the message. Nor is it about humanity and human emotions - the families inside seemed to be just as happy as those outside, unless you were one of the slaves. Nor is it about freedom/slavery - the outsiders are bound just as tightly to their customs and religion as the people inside are to the caste system and technology holding it in place.While Halo is by no means a terrible book, and I certainly feel readers will enjoy a female who can take care of herself and doesn't need to be saved in a fight. But it didn't bring much of anything new to the genre (especially not with a repeat of roman-inspired gladiator games (Hunger Games, anyone?)). I feel some serious character depth and world building would be needed by the second or third books to elevate this about the dystopian violent glut of YA novels currently available.Received as an ARC from the publisher."}, {"userName": "Helen", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/33424987-helen", "userReview": "The story had a lot of potential and I liked the original concept but the novel was dragged down by the very one-dimensional characters and predictable love story. The dialogue was some of the most awkward I have ever read and very cliche, especially between the two romantic interests, who, I hasten to add, had zero chemistry. I would have preferred it if the heroine hadn't been immediately flung into the arms of the nearest guy and the whole plot with her discovering herself and her emotions would've worked a lot better that way. The story becomes increasing unoriginal and predictable as the novel wears on HOWEVER (credit where credit's due) there is a good plot twist at the end. Still not good enough to make it a decent book, but close."}, {"userName": "Jamie Turner-norton", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/11848839-jamie-turner-norton", "userReview": "So it took me a couple pages to get into this book, but once I did I couldn’t put it down. I don’t know how I would react having no emotions and then all of a sudden getting them.. I loved Ryka. And lets just say I can’t wait for the next book. I don’t want to give away too much so all I’m going to say is y’all need to get this book when its released on April 30th, 2013!!"}, {"userName": "Zoe", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/34473587-zoe", "userReview": "This book started out slow but quickly picked up"}, {"userName": "Paula", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/11622887-paula", "userReview": "4.5 stars! Really great book that I got for FREE on Amazon. One-clicked book 2!!"}, {"userName": "Nicole", "userReviewDate": "Jul 26, 2013", "userURL": "http://www.goodreads.com/user/show/8287787-nicole", "userReview": "I was actually on Amazon looking to buy Angel of Mercy when the \"recommended book\" stream thingy ambushed me. I saw Raksha, and I was like, who the hell is Frankie Rose?Now, I'm like:Raksha could be the next Legend, Enclave or Divergent. The next YA dystopian novel to sweep Hunger Games off the map.The world as we know it is long gone. Forgotten. We are introduced to two new words which sit by side but couldn’t be further apart. One where the government thinks its citizens “can’t be trusted, can’t be civilised enough to handle [their] own emotions, so they collar[ed] the population like dogs” and one where people wear their freedom and feelings on the outside, like clothes. But both harbour a frightening similarity: a Colosseum, a Pit, where people are chosen to fight and kill each other. One for money and entertainment. One to appease the Gods. It is in these worlds that we meet 2 characters who took my breath away. A trained warrior who despite being 16 years old, is feeling things, feeling EVERYTHING for the very first time. And a boy who hates everything she represents, everything she came from and may just go back to. And who loves her.The book was told solely from Kit’s, the Colosseum fighter and all-round snarky badass’, point of view. And I LOVED her. She has just escaped the Sanctuary, and her Halo (collar) is off. Feelings are rushing in, and not the good kind. She has just killed her best friend and found out, after she killed him, he was love in with her and died to set her free. Into the wilderness she goes, almost dying at least twice and there she runs into Ryka.Ryka was hostile, prickly, offensive and hot. Kit hated him from the start, and just watching him win her trust and affection was so much fun to watch. The bickering, the fighting, the insult-hurling and emotional blackmail was scarily enjoyable.There was an element of the creepy in this too, namely the Priestesses. They remind me a bit of those red-caped things (people) in The Village, that M. Night. Shyamalan movie? And the writing. Rose has a style of storytelling that steals your attention and doesn’t let go. She doesn’t believe in telling her readers everything. She prefers to let us figure it out for ourselves. She likes to keep us on the edge of seats, wondering who can be trusted and who can’t. Who will leave and who will die. And she tells it to us straight. Like I said, she’s badass. The next book promises war. And unlike how I felt about Insurgent, the sequel to Divergent, I feel like Frankie Rose is going to deliver. Blood and pain, death and surprises but also hope, love and the promise of freedom. I for one cannot wait to see where she takes this!"}, {"userName": "Kendall {Book Crazy}", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/11385469-kendall-book-crazy", "userReview": "As soon as I heard about a Blog Tour for this book I signed up! I have to admit though that when I first started reading this book I didn't think that I was going to enjoy it! Reading the first two chapters I found it a bit confusing but after that I couldn't put it down! There was a bit where I just clicked with the book and I could understand what was going on! I fell in love with this book and the world that is created in it! The author does an amazing job explaining everything that's happening and making you feel like you are actually in the world she creates! I thoroughly enjoyed it! People are going to fall in love with the world that the author creates in this book as it is definitely makes the book stand out and I can guarantee that you haven't read anything like it before! As I said the plot was a little confusing to start off with but as soon as I got into this book I was addicted! I couldn't get through it fast enough! The plot was very complex and I had to read it all to make sure that I understood it and also to make sure that I didn't miss anything important as there was so much going on! The plot was very unique which is probably why I had a hard time understanding it at the beginning but once I did it felt like I was actually in the book! The characters were also amazing! Kit was the main character and Raksha is told from her point of view! I loved Kit! I loved that she kicked ass and she was very different to a lot of other female characters in books that I have read! She also didn't let anyone tell her what to do and she stuck to her guns! I connected with Kit instantly and at several scenes my heart broke for her! Ryka was the love interest of Kit and I loved him as well! I loved how determined he was to protect Kit and his sister! I also loved his relationship development with Kit as well! He was also hot and definitely one of my favourite characters! I have to say that I would have loved to have read some of Raksha from his point of view! The other characters in Raksha were just as amazing as Kit and Ryka! They all played major parts in this book and they were all written amazingly! I have just found out that this book is part of a series! I am seriously looking forward to another book with Kit and Ryka in it as Raksha was the beginning of a fantastic series which I thoroughly enjoyed! The cover also suits the book perfectly! It is exactly how I pictured Kit looking like throughout the book! You also notice things on it which make so much more sense to you after you have read the book! Big thank you to Frankie for an ARC of Raksha and to Amber and Mel for having me on the Blog Tour!"}, {"userName": "Stephanie", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/7225524-stephanie", "userReview": "I was gifted this book from the author in exchange for an honest review. Now the first thing I am going to say is you need to go out and get this book and then read it immediately, and yes as I am sure you can tell I LOVED this book and I have to say if you get it and don't like it that is not my fault you are just crazy :), now for my reasons why I enjoyed this book so much. I am a huge sucker for a Colosseum battle or in some cases in this story a pit fight, I love the gladiator type stories, I don't know what it is and I can't explain it I just do and this book did not disappoint me in this. The author wrote a fantastic battle scene every time, I could see the action in my mind perfectly like being transported to the front row of the fight. The Halo that the citizens of the sanctuary wear was so interesting to me, that people would willingly allow this and just march through life without feeling was something I have not read before and I loved watching Kit realize a world with emotions and learn how to control them. It made me think about how maybe we take them for granted and I really enjoyed the underlying message it left behind for me that own emotions and thoughts of individuality are important in our every day life. It also gave a different take on the fights for the people who wore Halos and those that did not and the reasons why they took part in them. Each character in the story were fantastic even the evil ones had their place helping the story form. Kit and Ryka make my top ten couple for sure maybe even top five. Two fighters brought together in a strange situation and they find more in each other than they thought possible, I loved watching them teach each other and grow. It was neat to see the world threw Kit's eyes as she learned to hide and handle emotions she did not like that a lot of times were brought on by Ryka. I thought Ryka was a great leading man strong and protective, doing the best he can for his family, mostly the lovely Olivia his younger sister I was attached to her right away and as an older sibling I felt his struggle to do the best he could for her. The ending was the best and worst part so much action heartbreak and many other emotions which was great but now I have so many more questions I did not want this book to end the last page left me reeling and I wanted so much more. so as you can tell I thought this book was fan-freaking-tastic a perfect blend of action, adventure, heartbreak, love and control of the masses, if you like any of these things READ THIS BOOK!!!!!!!!"}, {"userName": "Deborah", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/24383684-deborah", "userReview": "Interesting concept 4.5 stars.I downloaded this book primarily because it was free, I read the blurb and was intrigued but a couple of things held me back firstly, it was a series and I'm already locked in to so many that I'm reluctant to start another, so I decided before reading that the bar was set very high on this one and I would only continue if it was in fact really good. The second thing that held me back and this I know is going to sound stupid but here goes....the good reviews, I noticed originally that none of them said Amazon verified purchase, this in itself doesn't mean anything I know I'm working my way through loads of iTunes vouchers so I often get books from there but I've been caught out a lot recently by fake reviews so it did make me stop and wonder, this is not the case here I will add.Anyway I started reading and was hooked, it's not dissimilar to a The Hunger Games in a lot of ways, that's not to say it's a copy or ripoff because it's not, this is very much it's own book. The female lead is a sixteen year old girl with no name she, like many others wears a collar or Halo around her neck to control emotions, she's trained to fight, it's all she's ever known and yes she fights to the death and feels nothing while doing it.This book is about this girl who becomes known as Kit and what happens when after feeling nothing for sixteen years she's suddenly bombarded by emotions and feelings, she's no idea what they are and how to cope with them, on top of this she finds herself in a new place where everything is different, or so it seems, it may actually have more similarities than she originally thought. There are times when Kit makes silly decisions and acts immature but it's easy to forget that's she's only sixteen and has spent sixteen years feeling nothing, as a reader I had to remind myself of this several times and ultimately only once did she make a promise and find herself in the debt of someone she really doesn't want to be in this position with and I'm really hoping, fingers crossed that the author doesn't use this 'yes' for what I think she will.So now it looks like I've added another series to my increasingly long list."}, {"userName": "Ryan Snyder", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/4730743-ryan-snyder", "userReview": "Book- Marks The SpotI have been dying to read this book for a while now. This book....... I just....... can't. This book......  There are not many scenes from books that are so emotional to me that I have to put the book down and not pick it up for a while. But when Asha..... I just. I didn't realize that I had gotten so attached to his character in such a short amount of time. Even so, I had to stop reading and mourn him for a bit. I was morning right alongside Kit throughout the book. The feels, people. The feels. moving on from that depressing, but TOTALLY necessary event. Falin Kitsch Kit was a genuine character and I have not met her equal in terms or characters. She is quite unique and I love her for it. The book starts out fast paced and adopts a steady pace throughout but is interesting from cover to cover (okay, I read an eBook.. so there were technically no covers.. but you get the point!) The world the author set up was cruel and I found myself angry throughout for what they do to the Falin. No, really, there was genuine anger involved. I. Love. The. Characters. Like I said before, I grew attached to Asha in the first few pages. And Ryka..... ooh, some of the things he said and did....As for Kit... you know I love me some bad-ass heroines. They are the BEST.Getting back to the whole cruel Government. This book is definitely not for the squeamish. It is for readers who can handle some heartache and some gore. There were some pretty harsh elements in the book, so no cookie cutter love story for the adoring fan-girls This shit was hardcore. I mean, my emotions were everywhere, but you know what? I freaking loved it. And I cannot wait for the next book. There is so much left that needs to be explained! O: I do not have all the answers! D:(also, bonus points for sarcastic humor, epic fights, and endearing characters <3)"}, {"userName": "Ashley Finnegan", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/13869318-ashley-finnegan", "userReview": "This book gets a solid 3.5 stars from me and would have been even higher had the ending just not completely baffled me. Ms.Rose throws a very interesting curve ball right at the end and then just leaves us hanging. I have so many unanswered questions now. Common sense would tell me that with an ending such as this the author has to be creating a second book but is she? I haven't seen anything about a second book and there was no mention of one at the end of this one. I have to know. I want to know the story behind Ryka's mother, why did she make the choices she did? What is going to happen to Freetown now that war has been declared and what will happen with Kit's brother? I found that I really like Kit, she is kick-ass! I even started to like Ryka although his hard-ass attitude was somewhat annoying. Ms.Rose does a fantastic job making you fall in love with the characters and really makes you empathize with them and of course she also does a great job portraying the 'vilians', making you love to hate them! Throughout I most definitely wanted to see justice prevail. This book would have gotten a higher rating from me if it hadn't been for the fact that a few times I felt that it could be a bit long winded when it did not have to be and then most importantly the fact that I feel completely cheated with that ending. I must find out if there is a second installment and get my hands on it.. like.. NOW!"}, {"userName": "Rebecca Lawton", "userReviewDate": "Mar 14, 2013", "userURL": "http://www.goodreads.com/user/show/7697510-rebecca-lawton", "userReview": "There's no turning away from a good fight in fiction and film: the thrill of the coliseum in Gladiator, the clash of north and south in Cold Mountain, the clash of class in Atonement, the battle of wills in The Great Gatsby. Even when we think we know who's going to win the day, a well-staged battle will pull us to the edge of our seats, fingers crossed that the outcome isn't too painful to watch or accept.Frankie Rose writes fight scenes in her fiction that bring us in so close we feel we're holding the weapons ourselves, and looking into our opponent's eyes. We're whirling with the protagonist, grasping for just the right blade at our hip, judging whether to strike or to show mercy. Whew.In Raksha, Frankie gives us a heroine who is not afraid to wield a dagger, strap on a belt of knives, wear hide and feather garb in which she can best kick the tar out of the enemy. There's a full review and excerpt at http://beccalawton.wordpress.com/. Check it out!"}, {"userName": "Clara", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/38342478-clara", "userReview": "I loved that even though the book was filled with action, she was still trying to learn how to be human."}, {"userName": "Tamara", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/26074719-tamara", "userReview": "Could have been better."}, {"userName": "Allana Kephart", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/7912572-allana-kephart", "userReview": "THIS deserves a .gif review. Must find the perfect ones."}, {"userName": "Laura", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/9481759-laura", "userReview": "It was hard to rate this book because I loved it at the start and hated it by the end. Kit lives in a compound-like city known as the Sanctuary. It's a pretty crappy place in which there exists extreme inequality between the various classes of people. Kit belongs to a group of individuals whose sole purpose is to fight in a series of death matches for no other purpose than to serve as entertainment and gambling fodder for the holier than thou upper classes. The fighters all wear a metal collar type contraption around their necks referred to as a halo. The halo injects the wearer with an emotion blocking chemical making it possible to kill without remorse. This is the gist of Kit's life until inevitably she is pitted against her training partner, Cai. Unbeknownst to Kit, Cai's halo malfunctioned months ago and he loves her. Cai's dream was for both of them to escape the Sanctuary and have a real life of freedom. I enjoyed the world building within the Sanctuary. I thought the unfairness and ugliness was a great way to set up a way of life that needed to be revolted against. I was looking forward to watching it unfold. Unfortunately for me, my enjoyment began to wane as soon as Kit reached Freetown. I found Freetown irritating, mostly in regard to the women. They don't wear pants, they aren't allowed to fight or to carry weapons, only the men have that right. What if they were in a situation where they had to defend themselves? Even more ridiculous was their version of money was in the form of little bells attached to their clothes. So really any creep could just lie in wait until he heard one of them approaching.There was fighting in Freetown as well, although unlike the Sanctuary there really wasn't any reason given for the fighting except some vague connection to their religion. The people of Freetown or I should say the men there didn't really have a choice about it either. At least in the Sanctuary there was a reason given. It was a disgusting bloody practice no doubt about it but they did it for greed and profit and sport. I thought Freetown in itself was kind of a pointless place and while I think the Sanctuary could certainly use a good ass-kicking i wasn't really all that excited to experience Freetown being the one to hand it to them. I couldn't root for such a backward place, and therefore I'm not all that excited to read the next book and probably won't.I didn't really feel any intense chemistry between Kit and Ryka so that bit was disappointing to me since so much emphasis was placed on the love they had for each other. With Cai on the other hand it felt so real despite the fact that he only had a few scenes at the start of the book. However it was the priestesses of Freetown that I hated the most and probably the biggest reason that I don't want to continue. I just don't want to read their story and I don't care what they want with Kit. I felt like their presence took an ok story and just dragged it way way down into something I couldn't completely enjoy."}, {"userName": "Abbie", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/10194401-abbie", "userReview": "Actual rating - 3.5"}, {"userName": "Raven Reviewer", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/17163237-raven-reviewer", "userReview": "Falin Kitsch has been raised to be a fighter and fights in the Colosseum nearly every first Saturday of the month. Since she turned 13 every one of those matches has been a fight to the death and because she’s still alive, she’s one of the select few who is undefeated. Being collared like all fighters, she’s completely void of emotion. Then one fateful day, it all changes.Hunger Games and Gladiator fans, get ready. You are in for quite a ride. Reading this book is like a raging river. At first, everything is churning and moving fast. Once you get into it, it’s shocking. The pace is the same but it feels like it’s moving slower. Then, you’re tossed over a waterfall and everything is roaring and turning again. All you can do is hold your breath and hold on. The Theron system reminded me of the Indian caste system. It is something born into and therefore, widely accepted. Yet, here, everyone is emotionally controlled. Whoa. Now, that’s a concept! This dystopian society is quite startling at first. To kill without remorse or pain is to kill without humanity. And it is one thing to fight to the death when indoctrinated with the absence of feelings of any kind, but then to fight with emotions and feel a kill is a whole different animal altogether. I can’t help but think there has to be an underlying parallel here with reality television and people killing other people for sport in this book. The kills are widely publicized and large events in this society. If you are worried, gladiator-type games are not something to be revered here and are appropriately portrayed. Murder is still murder. Whether in the arena or otherwise. There is no glorification of evil here. It is necessarily violent at times yet you don’t feel sick to your stomach the way it easily could be. The way all of it is portrayed is…well, simply amazing.I loved the idea that Kit has met her match. I pictured Ryka as a young Wesley from the Princess Bride. Though, Ryka has brown eyes. I am not sure if the similarity was intended or not. I thoroughly enjoyed their fighting.I need to mention the cover. After reading the book, I am left to wonder who is on the cover. You would assume she’s the main character Kit. Yet, Kit is described as a curly blonde with blue eyes, isn’t she? The rest of it is her though. Still, the cover to this book is one of the better, most relevant covers I have seen in a long time. I am not one to particularly care about book covers but I absolutely loved this one. I almost don’t care it’s not Kit.What is most interesting here is the religious overtone. In the absence of emotions, logic rules. There is no organized religion in the Sanctuary but in Freetown, there is. There is a conversation where religion is discussed between characters. Is religion as illogical as emotions? Can a religion exist or survive in an environment void of feelings? Or is it that it flourishes because it is tied to emotions? Agnosticism is present and positively portrayed, making me wonder about the message here. Certainly, many readers “cover their bases”, religiously speaking, as some of these characters do. These philosophical aspects are something to chew on, definitely. I do like books which make you think. This is one that does that.What’s the ending like? Abrupt and largely unsatisfying. Going back to my river analogy above, I think I am still in the river, simply caught hanging over a log when I would really like to be lying on my back on the riverbank panting up at the sky. For sure, I am still watching the river flow by. In the end, I am just a tangled mess. There are answers but there’s also so much left un-done. It screams sequel and yet, I don’t know if there will be a sequel. That’s why I say the end was unsatisfying. This is one story that I would love to see continue in another book as well as on the big screen. Yes, I would love to see this made into a movie. After reading this book, I would gladly read anything written by this author.If you liked the Hunger Games and are a fan of love stories, this book is for you. Not gonna lie here. It is violent. Die Hard is waaay more violent than this book but there is a decapitation scene. Then, there are the moral and religious aspects of the society to consider. So, I am going to recommend this to mature audiences. Available from 30 April.For more reviews such as this, please visit http://ravenreviewer.tumblr.comUPDATE: Since posting this review, I have spoken with the author. There is a part where the main character is said to one day look like her mother. Her birth mother is dark haired. Miranda has the blond curls and blue eyes. I got those two mixed up apparently! Also, she informed me that she is working on the sequel! Can't wait for that! Squeee!!"}, {"userName": "S. Policar", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/17209621-s-policar", "userReview": "First things first.. This book is amazing. It puts me in mind of the movie Gladiator, except our hero is a female instead of a male. The way the people live reminds me of a cross between the districts from the Hunger Games and the Soul Society from the anime Bleach. The fact I can see either in my head is a testiment to this author's writing ability.The only problem I found was that I not bothered to read the blurb for the book, it would have been two chapters before it was made known that our main character is a girl and not a boy. This story was well thought out and and written beautifully.Ryka is the type of person you can't help but want to beat the crap out in the beginning. Again this author's style is oso fluid you can feel the ire bubbling just below Kit's surface as he delibrately taunts her.This book will keep your heart pounding and keep you up well past bedtime. I found it impossible to put down and I eagerly await the release of Radicals.I give this book 5 of 5 paws\n\n\n\nReviewed by S.Cu'Anam PolicarFreaky Fiction Writing AuthorFae Books Tour HostGirls <3 Books Tours HostAround the Universe Book Tours HostLadyAmber's Book Tours HostI Am A Reader Not A Writer Blog Tours HostB3 Book Tours HostMerged review:First things first.. This book is amazing. It puts me in mind of the movie Gladiator, except our hero is a female instead of a male. The way the where the people live reminds me of a cross between the districts from the Hunger Games and the Soul Society from the anime Bleach. The fact I can see either in my head is a testament to this author's writing ability.The only problem I found was that had I not bothered to read the blurb for the book, it would have been two chapters before it was made known that our main character is a girl and not a boy. This story was well thought out and and written beautifully.Ryka is the type of person you can't help but want to beat the crap out in the beginning. Again this author's style is so fluid you can feel the ire bubbling just below Kit's surface as he deliberately taunts her.This book will keep your heart pounding and keep you up well past bedtime. I found it impossible to put down and I eagerly await the next installment.I give this book 5 of 5 paws"}, {"userName": "Yvonne (The Shadow Realm)", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/3936955-yvonne-the-shadow-realm", "userReview": "Blog Tour Post: The Shadow RealmFrankie Rose truly has a way with words. This was an utterly brilliant and captivating read.Raksha is the story of a girls fight to gain control over her life. To choose how she lives and what she feels. To not feel like a collard animal. I loved the world we are introduced to in this book. Even though it does have similarities to The Hunger Games and is reminiscent of so many dystopian books it still stands out in its own way. Many people have described it as Hunger Games meets Gladiator and that is exactly how I would describe it. Fighters are pitted against one another in a fight to the death in a Colosseum. People watch on cheering for blood. This is not a book for those with a weak stomach. There is no shortage of blood and gore and the way the author so thoroughly writes it will definitely leave you with a sick feeling to your stomach. The characters I think is what makes this story. Especially Kit. She has made my list of favourite heroines. She is one bad-ass chick. A force to be reckoned with. She is not one to takes things lying down and will fight till the very end. I loved being with her as she tried to come to grips with all these new emotions assaulting her system. She deals with them in such a realistic way. After being a hollow shell your entire life you aren't going to be able to handle this new life all that calmly. She reacts the way I expected someone in her position to react. And I especially loved the way she acts with Ryka. Ahh Ryka *happy sigh* He gave me warm fuzzies :) I loved loved loved the romance in this. There was no insta-love to be found. Yay! Thank you Rose! The relationship between Kit and Ryka progressed at a nice pace, they way you would expect it to. They start of weary of one another, not quite trusting each other. But that slowly grows into friendship and then something more. It was perfect. And please please please! Don't let there be a love triangle in the sequel. Pretty please? Don't ruin it.The story was quite exciting. You didn't know what was gonna happen next. The one thing I really liked were the fight scenes. The author really knows how to write a great fight scene. You could easily picture it in your mind as if a movie scene was playing out before you. The story isn't all about blood and violence though. It really makes you think and gives you pause. The difference in ideology between The Sanctuary(where Kit is from) and Freetown (where Ryka is from) was quite fascinating. It made you wonder who really was worse?I'm not gonna go into anymore so I will just leave it there and tell you to read this book! If you loved Hunger Games, Divergent, and Under the Never Sky, then you will love this. A must read!"}], "description": "Alternative cover and new title for asin B00CKBJR2EShe has no name.She has her knives. Her training. Her halo.The first and second give her the ability to defeat the opponents she is pitted against each month. The third frees her from pain and fear. From any kind of emotion at all. Everything is as it should be. Everything is as it should be, until…Fear… Pain… Anger… Happiness… Desire… Guilt…Love.When a newly named Kit escapes the Sanctuary after killing her best friend, the last thing she needs is another knife in her hand. Or Ryka, the damaged, beautiful blond boy, whom she refuses to let save her. The sights and sounds of Freetown are new, yet one thing is familiar: the matches. The only difference? Where the blood in the Sanctuary landed only on the Colosseum floor, Kit will quickly learn that a river of red runs through Freetown’s very streets.Without her halo, the inhabitants of Kit’s new home consider her saved, but is that really the case? The reality of her old life is paralyzing. Would she be better off free of the guilt associated with all the blood on her hands, or is the love of one boy worth living through all the pain?Raksha is the call of the dead. It is the rumbling chant for fresh blood from the other side, the demand for sacrifice. The Colosseum is behind Kit. The fighting pits await.", "title": "Halo\n      \n          (Blood and Fire #1)", "url": "http://www.goodreads.com/book/show/22023638-halo", "average": 4.21, "cover": "https://images.gr-assets.com/books/1400684639l/22023638.jpg", "reviews": 200, "authors": [{"url": "https://www.goodreads.com/author/show/5834274.Frankie_Rose", "name": "Frankie Rose"}], "type": ["Young Adult", "Science Fiction", "Romance", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/22023638-halo", "http://www.goodreads.com/book/show/17915241-raksha", "http://www.goodreads.com/book/show/17157400-raksha", "http://www.goodreads.com/book/show/18895491-halo", "http://www.goodreads.com/book/show/13645671-sovereign-hope", "http://www.goodreads.com/book/show/21800559-radicals", "http://www.goodreads.com/book/show/15741338-eternal-hope", "http://www.goodreads.com/book/show/22733189-summer", "http://www.goodreads.com/book/show/37838299-black-moon-rising", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}