{"ratings": 49594, "userreviews": [{"userName": "Mohammed Arabey", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "One of My Harry Potter Treasure Books*********************************It's an elegant, wonderful, crazy arranged movie book.First of all it got \"Page by Page\" The Movies and how it done, The Actors , Their coming of age ... How they made the amazing magical stuff that the movie is filled with it whether clearly viable or even insignificantly but related to the world of the movie and the full picture.And for me as a Harry Potter big fan , and a collector ,My biggest surprise was the AMAZING gifts from the movie, specially My Hogwarts acceptance Letter and The Marauders Map.So YES I've got my Hogwarts Letter, unfortunately not by owls :(Mohammed Arabeyfrom Sep 2011to .. Always"}, {"userName": "Kai", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "Growing up in the world of Harry Potter meant my upbringing was a little unconventional and hard work at times, but I wouldn't change any of it for a second. I will always be proud to have been part of these film and I want to thank everyone - all the directors, all the crew, and all my co-stars - for teaching me so much and for giving me so many memories to treasure. And of course, thank you to Jo Rowling for giving me this opportunity in the first place.-Emma WatsonA must have for die-hard potterheads. So much insider information and additional little anecdotes make my heart overflow with happiness.Find more of my books on Instagram"}, {"userName": "Parka", "userReviewDate": "Dec 24, 2010", "userURL": "http://www.goodreads.com/user/show/2113262-parka", "userReview": "(More pictures at parkablogs.com)There still isn't any Harry Potter art books, but this movie companion is probably the best thing any fan could wish for.Harry Potter Wizardry is 160-page hardcover and designed like a scrapbook with little goodies — booklets, stickers, maps, even Harry's letter of acceptance to Hogwarts, etc - attached to the pages. The cover is also nicely embossed. It's printed by publisher Collins Design.The book covers all the seven films, including a sneak at at Deathly Hallows Part 2. It's packed with all sorts of interesting things from the Harry Potter movies. There are chapters on characters, the schools, mythical creatures, strange locations and stories about the wizardry world. You can read about all the teachers Harry had, the different villains from each movies, Ministry of Magic or all the strange inventions created by Ron's twin brothers.There are plenty of photos shot behind the scenes showing the sets, the miniatures and models, actors and there are even some pieces of artwork and sketches.The commentary provided includes interviews with the actors and staff. They talk about everything from creating sets like the Hogwarts castle to how they film the movie with computer graphics elements. I'm impressed with how much content is included.This is the book Harry Potter fans have been waiting for. Grab it."}, {"userName": "María", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/45842887-mar-a", "userReview": "Este libro es una auténtica maravilla para los potterheads.Me ha encantado conocer algunos detalles y datos curiosos sobre las películas y los actores (aunque había leído la gran mayoría en twitter). Se centran mucho en describir cómo han construido los decorados o hasta el más mínimo objeto y he sido consciente de la cantidad de tiempo que le han dedicado hasta al más mínimo detalle.Dentro del libro viene el mapa del merodeador, la carta de Hogwarts, un mini catálogo de la tienda de Fred y George, etc y es lo que más me ha gustado del libro.Creo que ha sido la mejor compra de mi vida, ya que aparte de conocer cosas nuevas sobre las pelis, incluye merchandising maravilloso.Le voy a poner 5 estrellas porque me ha gustado mucho y se lo recomiendo a todos los potterheads ya que estoy completamente segura de que les encantaría."}, {"userName": "Joost", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/15538471-joost", "userReview": "Het boek over de films! Lees hier mijn recensie (met foto's van de inhoud) hier:http://nerdygeekyfanboy.com/recensie/..."}, {"userName": "Rose Heartfilia", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/8290245-rose-heartfilia", "userReview": "Not very much new information but it's very interesting and always nice to reread and refresh the mind about the Harry Potter movies. Besides I love the extras such as the letter, the Quidditch flyer, the Yule Ball invitation and so on."}, {"userName": "Kathryn", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/446464-kathryn", "userReview": "Just splendid! Thank you so much, Annie, for the great gift :-)Highly recommended to fans of the HP series. You will find so many amazing behind-the-scenes stories and interesting tidbits; I love the blend of insights about/from the actors, as well as the directors, screenwriters, set designers, props, costumes, etc. It's just fantastic! So much more detailed (and fun!) than I could have imagined."}, {"userName": "Susi", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/30642780-susi", "userReview": "4,5.Visuaalisesti erittäin kaunis kirja. Maistui toisellakin lukukerralla yhtä hyvälle, ja kaikki extrasälä (kuten kelmien kartta) saa hihkumaan edelleen innosta."}, {"userName": "Aparajitabasu", "userReviewDate": "Apr 13, 2011", "userURL": "http://www.goodreads.com/user/show/4790652-aparajitabasu", "userReview": "Normally I don’t elaborate on products or production based book, but this one is good enough to do just that.With the end of the Harry Potter film franchise nearing, it seemed the right time to go back and savour the highlights of the ten-year long series. Harry Potter: Film Wizardry does just that: a scrapbook that encompassed the decade-long saga, where everyone from the producers, directors, and production designer explain in details how they conceptualised some of the plot points and settings; and the actors, including the three stars, Daniel Radcliffe, Rupert Grint, and Emma Watson, hit memory lane to disclose some of the best, funniest, and sometimes most uncomfortable times they had playing Harry, Ron, and Hermione in the films. The book begins with a foreward from Dan, Rupert, and Emma, who gush about how much of an impact the series made in their lives. Dan remarked on the journey both he and Harry endured in the ten years; Rupert took pride in playing brave Ron Weasley, the \"ultimate ginger,\" in his words; and Emma voiced her respect for her young, annoying, brainy Muggle-born fictional counterpart she thought she had nothing in common with early in the series, but who she embraced with all her heart by the end. It then lead into the first of many producer's notes scattered throughout the book, where David Heyman, the man who read the first Harry Potter book, fell in love, and immediately insisted on making the films, explained how he began to piece the movies together well over ten years ago. Author Brian Sibley compiled the scrapbook with a combination of production notes, countless cast and crew interviews, set visits, knowledge of the book and film series, and production photos and movie stills to make the quintessential anthology of the Harry Potter film series. The book itself ended with a sneak preview of Harry Potter and the Deathly Hallows: Part II, with nothing more than image captions under a dozen or so small photos from Gringotts and Hogwarts. Just enough of a teaser to make the reader wish there were a few more pages at the end, chronicling the end of the saga. One of best features of the book, however, was that it focuses on so many of the minor details fans could never have been expected to notice, and the production teams that worked endlessly to make them. Here you have clear shots of Daily Prophetarticles and issues, rooms filled with creatures like Buckbeak and thestrals, various angles of the Room of Requirement both from Order of the Phoenix and Deathly Hallows: Part II, Privet Drive and Diagon Alley, and countless rooms, corridors, and facets from Hogwarts School of Witchcraft and Wizardry. (I definitely wished there were more photos than only the sneak-peek of Gringotts). \"Everybody involved in these eight films knows that we have been part of something very special, and that there will never be another experience like this one,\" proclaims producer David Heyman in the introduction. He's right, of course, and while the people who made the movies were there for births, marriages, divorces and even deaths, fans have been along for the ride, hoping for a chance to sit in the front seat. This is finally it!From tidbits like how Helena Bonham Carter perforated Matthew Lewis's eardrum with her magic wand in Order of the Phoenix, to grand designs like how the filmmakers created an entire Hogsmeade miniature village with intricately detailed micro-window displays the size of a £1 note, the book simply doesn't disappoint. It's the perfect mix of fact and -- as McGonagall would say -- \"well-mannered frivolity.\"On top of all that publisher Harper-Collins inserted over half a dozen prop replicas, like your very own sealed invitation to attend Hogwarts (addressed to Mr H Potter, The Cupboard under the Stairs, naturally), a Quidditch World Cup programme, and even a \"real\" Maurader's Map. There are also several fold-out pages, one of which contains the Black Family Tree Tapestry.I highly recommend 'Harry Potter Film Wizardry' for any passionate Harry Potter fan, from one proud owner of this marvelous book to you all."}, {"userName": "Reading Teen", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/3329955-reading-teen", "userReview": "This was one of my Christmas gifts, and I spent most of Christmas day reading this book. ﻿It is full of many cool things. There are little envolopes that have a bunch of stuff from the movies. Harry's acceptance letter toHogwarts, the Maurader's Map, Dolores Umbridge's educational decrees. You can't understand my delight as I turned each page to find... stuff. Really cool stuff.﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿ All of the main characters have their own page, giving you information about the actor who plays them, how that actor was chosen for the role and, in cases such as Alastor Moody and Lord Voldemort, how they were transformed into their character. To some people, I can see how this might sound a little boring. It isn't. This book, this awesome book is highly recommended to anybody who is even slightly interested in Harry Potter. Even if you still think that it's boring, get for the things that come with it. Ever wanted to read the Marauder's Map? Here's your chance. And it also has snapshots from Harry Potter and the Deathly Hallows part 2. These pictures show The Room of Requirement before and after Fiendfyre is set to it and The Room of Requirment in it's Dumbledore's Army hideout form. It also has many concept art drawings of pretty much everything. Pretty much every page has concept art drawings of characters, creatures, and structures.Seriously, any fan of Harry Potter would be practically drooling over this book if they had any sense at all. It is highly enjoyable and it points out small details that are in the movies that you never noticed before. It is a seriously awesome book.Austinhttp://www.readingteen.net/2010/12/bo..."}, {"userName": "Radwa", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/5591839-radwa", "userReview": "كتاب رائع لأى شخص معجب بهارى بوتر ,,هناك وراء الكواليس لكل الآفلام , صور رائعة و معلومات كثيرة جدا لم تعرفوها عن الافلام"}, {"userName": "Kelly", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/47269270-kelly", "userReview": "So much fun!"}, {"userName": "Eline", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/4331729-eline", "userReview": "Lovely book with a lot of behind the scenes info and titbits sprinkled throughout. It's almost as interesting as visiting the HP Studios, although the part about the last film was very short."}, {"userName": "Amy Finnegan", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/414076-amy-finnegan", "userReview": "What is it that’s so fascinating about this book, which looks at first glance to be little more than a gimmicky souvenir book?I’ll start with the forward, quoting from series producer, David Heyman. He says, “It all began one winter morning in 1997. My assistant Nisha came into my office to recommend an unpublished manuscript by a first-time novelist that she had enjoyed. “What is it called?” I asked. “Harry Potter and the Philosopher’s Stone,” she replied. “Mmmm,” I mumbled skeptically . . . . That evening, I decided to read a few pages before going to sleep. I read and I read and I read, and by the time I lay the book down and looked at my watch, it was 4:00 a.m. Jo Rowling’s writing was so vivid, her imagination so rich . . . I knew immediately that I wanted to make it into a film . . . ”Now, keep in mind that Heyman went after the film rights before the first book was even published, and the publisher itself (Bloomsbury in London), by no means predicted the book to be a bestseller! Rowling’s advance was (wait for it) only 2,500 British pounds – roughly $5000. Yup. The first printing was only 500 copies! Double yup.In HARRY POTTER FILM WIZARDRY, David Heyman explains what happened to a handful of these first edition copies: he sent them to his lucky top tier screenwriters to see if anyone was interested in penning the script. First round . . . not a single one of them wanted to write the script (Idiots! And they even got to keep their 1st editions!) But in a later round, the wonderful Steve Kloves, who has written all but one of the scripts, signed on.Another story that Heyman tells early in the book is about casting Daniel Radcliffe as Harry Potter. I’d heard the legend, but wasn’t sure how accurate it was. Turns out, it’s entirely true: they had been auditioning young boys to play Harry for nine long months, and with just three months before filming was scheduled to begin, they had yet to find their main character! But lo and behold, Heyman happened to be at a play one night, and sitting one row in back of him was 10-yr-old Daniel Radcliffe, every bit the boy-wizard they’d been looking for. Fortunately, Daniel also happened to be an actor, and funny enough, his parents had already been approached by the film’s director, Chris Columbus, about Daniel auditioning because Columbus had seen him in the BBC adaptation of David Copperfield. But (you may not believe this part), Daniel’s parents hadn’t wanted him to audition, and turned down the offer. But once Heyman suggested it too, the Radcliffes finally agreed, and the rest is cinematic history.Daniel was taking a bath when he learned that he’d won the role :)These are just a few of the cool behind-the-scenes stories that are told in this highly entertaining book.Then there is all the mock memorabilia! I’ve seen books like this before, but nothing that even comes close to how cleverly it’s done here. Harry’s acceptance letter to Hogwarts, a four-page fold out with a map of Diagon Alley (along with a creepy Borgin and Burkes catalog), an Advanced Potion Making text book with adhesive labels for your own home-brewed potions, a Quidditch World Cup Programme, an invitation to the Yule Ball, and among many other such treasures, your very own Marauder’s Map! Oh, yes, my friends, it can all be yours!But wait, there’s more!I would have bought this book for the concept art alone. Or to be more precise, for this particular sketch of Hogwarts and its surrounding grounds, penned in a matter of minutes by J.K. Rowling herself, for the production designer. In a nutshell, HARRY POTTER FILM WIZARDRY is 160 pages of pure awesomeness!!"}, {"userName": "Lisa Vegan", "userReviewDate": "Nov 17, 2010", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "This is a beautifully made, informative, and fun movie companion book! Well, maybe this is nothing more than a glorified movie magazine in book form, but it gave me plenty of entertainment value. I adore the Harry Potter books and I really like the movies, and this is a fun book for fans of the movies. The book covers all 8 movies, so I got to see a (very) few scenes from Harry Potter and the Deathly Hallows Part 2 before the movie comes out. The graphic artists who designed the films and their contents also designed this book, and they did a fabulous job, with both endeavors. There is much attention to detail, even including the printed on name plate at the beginning of the book.The book chronologically covers the 8 movies, with many other movie related things scattered throughout the book. It’s very well structured, without being overly organized. The book is stuffed with plenty of photos, and there is a lot of behind the scenes information about how they did special effects, made various things and outfits, copies of many call sheets, storyboard sketches, etc. etc. etc. There are many mini interviews with cast members, directors, and others involved in the making of the films, and most of them had very interesting things to say. It’s amazing all the people, skills, materials, schedules, etc. needed to make these films. I was even more impressed when I realized the attention they paid to detail, and that makes sense given the high quality of the films. Short synopses of the movies are given, along with a bit about how and why there were deviations from the books. I got a much better look at so many of the props than I did while watching the actual movies.Readers will see how J.K. Rowling was directly involved with some aspects of the filmmaking. For instance, she wanted Alan Rickman to play Snape, and when he said he couldn’t play him if he didn’t know the character, Rowling told him something about Snape that until that point she’d told nobody else.Families with children interested in this book should buy one copy to keep pristine and at least one copy with which to play. There are all sorts of tear out and removable items: Harry’s invitation to Hogwarts, programs, product catalogue, tickets, cards, the marauder’s map, etc. props from the actual movies, some of them in sticker form, I think; I didn’t tear out anything. There are also several pages that fold out. Because of all these loose parts and some pages easy to tear/ruin, I very much doubt that this book will be available for borrowing at very many, if any, libraries. Because of all these props, this book can serve as a toy too, one that will enhance imaginative “Harry Potter” play. I bought one copy that I am keeping intact and I’m likely to share it with others only when the book is in my presence too."}, {"userName": "PurplyCookie", "userReviewDate": "Oct 03, 2010", "userURL": "http://www.goodreads.com/user/show/2214498-purplycookie", "userReview": "If you are a Harry Potter fanatic this is a must-have addition to your library. It covers the Harry Potter world in a virtual 3-D approach. The book is full of surprises and beautiful artwork. Mere words cannot convey the enjoyment the reader will receive from this book.This beautiful book offers a way to hold the wizarding world of Harry Potter in your hands. And as an extra special bonus there are sections about the final two films, including a preview of my favorite new discovery: Fleur's double phoenix wedding dress. Also, learn why Yule Ball ice sculptures never melt, where Galleons, Sickles, and Knuts are really \"minted,\" how to get a Hippogriff to work with actors, the inspiration behind Hogwarts castle, and why Dementors move the way they do.The level of detail in the book is amazing. For example, the Quidditch program contains an advertisement for Pumpkin Juice. You might want to order two copies: one to keep pristine; and other to take out all the special art from its protective sleeves to decorate your room or office. I would love to pretend to do Christmas shopping out of the Weasley's Wizard Wheezes catalogue! I now have a new appreciation for the talent and vision of the filmmakers whose work is highlighted here. The text explains how movie magic was accomplished, down to the special salt that stands in for snow in the models, which has diamond shaped crystals and even crunches like the real thing.The pictures, layout, and hidden goodies made the book worth the steep price. Not only is the book interesting, but it shows a lot of the objects and concepts included in the movies that you may have missed. It brings the world of Harry Potter to life as you turn each page. The artwork, footnotes, call sheets, snapshots, memories of the cast, crew and production teams all come together in a way that takes the reader into how the movies were made and feel a part of what must have been a truly remarkable experience for all involved.It's the perfect gift for any long-time (or new) Potter fan—I got it for myself as a Christmas gift. You get to see, close up, so many of the magical things that were created to fill Harry's world. I know it's a cliché, but the book is almost magical. All of the special touches make it feel like you have a true treasure pulled right out of the Gringott's bank vault.More of Purplycookie’s Reviews @:  http://www.goodreads.com/purplycookie Book Details: Title Harry Potter Film WizardryAuthor Brian SibleyReviewed By Purplycookie"}, {"userName": "Hannah", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "A totally entertaining book for fans of the HP movie franchise. Filled with insider tid-bits and behind-the scenes factoids from all 7 of the movies. Members from the cast and crew contribute to the sometimes funny, sometimes informative and always fascinating phenom that are the Harry Potter movies. Attention to creative and artistic detail is evident throughout the book. It's easy to get lost in just looking at all the tiny, (almost unseen), but beautifully rendered artistic elements throughtout the book. BRAVO to the creative directors responsible.As a bonus feature (of which I was deprived because this was a library book and some CRETIN stole them all from this copy), this book also contains interactive pullouts like a mauraders map, tickets to the Yule Ball, etc. - of which I am sure are every bit as cool as the rest of the book, but I cannot positively rate (because some CRETIN stole them all from my library copy).One small quibble: I do hope the publishers will re-print a revised edition of this to include information from Part II of The Deathly Hallows. Unfortunately, this edition only covered The Sorcerers Stone through Part I of The Deathly Hallows. It would be wonderful to have more information on the finale and beyond.A perfect book to spend a few hours on a lazy afternoon visiting with. Perhaps during the holiday season - as I did."}, {"userName": "Mackenzie", "userReviewDate": "Oct 30, 2010", "userURL": "http://www.goodreads.com/user/show/3258910-mackenzie", "userReview": "An absolute must-have for all Potter fans, this Brian Sibley book is all about the magic of Harry Potter films. Think of it as a Harry Potter making-of extras in all of the HP movie DVDs, except they are in words (instead of in moving pictures) and more in-depth than anything I've ever seen in the DVD extras. I can't comment on it chapter by chapter; there are simply too many goodness inside this book. But suffice to say the book will appeal to those fans who are looking for collectible items AND fans who want to learn more about filmmaking, Harry Potter style.The author of this book, Brian Sibley, is the same one who made the Lord of The Rings movie companion books. Sibley is no stranger to compiling materials from movies to create a profound source of information on these epic movie series. You can bet on Sibley's thoroughness in collecting the materials. But the biggest kudos go to the publishers (and Warner Bros., I suppose), for the exclusive package this book comes in - it is hard cover, filled with 'interactive' pop-ups (Yule Ball invitations, Borgin & Burke leaflet, etc.), and an elegant Potter-esque design. Definitely worth the money you pay for it."}, {"userName": "Becky", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/13825230-becky", "userReview": "This is easily one of my favorite Potter based books. It's wonderful to get a glimpse behind the actual making of the movies; and it's brilliant how much is actually shared - including replicas of popular props used in the movies. That's an amazing feature of the book. I like how the layout of the book actually is. Essentially, it's a scrapbook of everything that the movies have featured over the decade. It's a wonderful thing; and it's one of those books that will live on and we will look back at. It's an absolutely amazing book, and completely worth the purchase.It is completely and utterly magical. That's the easiest way to sum it up. If you haven't checked this out already; do so!"}, {"userName": "Valery Tikappa", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/44179599-valery-tikappa", "userReview": "Ho adorato questo libro.Oltre a contenere un sacco di gadget della saga, come la mappa del malandrino, l'invito al ballo del ceppo, la carta d'identità del ministero, è colmo di curiosità ed episodi divertenti riguardo la realizzazione dei film di HP e dei ricordi che gli attori custodiscono.Mi sono divertita tantissimo a leggerlo, non mi sono mai annoiata, lo stile con cui è scritto è super scorrevole e non ci sono molti termini tecnici. Risulta tutto molto comprensibile ed interessante!Davvero un piccolo tesoro per gli appassionati."}, {"userName": "Beth", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/6291989-beth", "userReview": "It's every potterhead's dream to find something as cool as this, yes it may be expensive but I don't at all regret my decision of buying this. There are pretty little things stuck inside and very interesting facts to learn about the films/books there's a Hogwarts acceptance letter in there, a Yule ball invitation, and the Marauders map! I'm such a nerd so it's great for me to have little Harry Potter things that rarely anyone else has :3"}, {"userName": "Hande", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/47889151-hande", "userReview": "4,5 tähteä. Mielenkiintoinen ja kattava teos, jonka avulla pääsee kurkistamaan Harry Potter-elokuvien kulissien taakse. Rakastan mukana olevaa oheismateriaalia, kuten Kelmien karttaa! Harmittaa, että viimeistä osaa ei vielä tässä kirjassa käsitellä (ilmeisesti rahankuvat silmillä on toimittu näin, sillä teoksesta on tullut uudempi, laajempi painos). Mutta on tämä viihdyttävää luettavaa yhtä kaikki!"}, {"userName": "Hanne", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/34460902-hanne", "userReview": "It was an amazing read, it gives you a breif roundup of how everything was done. You see pictures how the actors grow up on every movie.The productions crew, some of them have taken something from the movies, and reteinde it. Cool."}, {"userName": "Tiastika Mauliza", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/32263270-tiastika-mauliza", "userReview": "I bought this book about a month ago and it's so stunning i could cry. The removable props are basically what harry potter fans need. It's worth the price, im so in love."}, {"userName": "Helena Højgaard Andersen", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/63141104-helena-h-jgaard-andersen", "userReview": "Så lækkert et design, og dejligt med bagomviden af filmene! Den var bare en god en 😍"}, {"userName": "Jonna Peltokangas", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/69505806-jonna-peltokangas", "userReview": "a more compromised version of Harry Potter Page to Screen but with some new information. the book being designed my MinaLima and the extra paper props like the marauders map and the yule ball program included made it a simply delightful read!"}, {"userName": "Christine Spoors", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/39719286-christine-spoors", "userReview": "This book gives such a wonderful insight into how the Harry Potter films were made. It was great to read comments from the producers, directors and actors about their experiences filming the series. It really made me appreciate how much work went into the films, especially with props and the sets. All of the concept art we get to see in the book is absolutely gorgeous, if it was available to buy I definitely would! The best thing about this book is all the the removable props you get, I am so happy to have my own Marauder's Map!!"}, {"userName": "OwlBeReading", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/32931646-owlbereading", "userReview": "I kind of glossed over this one and mainly looked at the pictures because I already know all of the information. This was just a way for me to ease out of the Potter universe. Overall the formatting is great, writing spectacular, and incredibly informative. I'm going to use this as a model for my yearbook spreads! Anyway happy reading."}, {"userName": "Julia", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/54526900-julia", "userReview": "This book was pretty cool, with all the details to the building of the sets and the characters. Also I enjoyed the notes from the producers and actors in it. It is a really great book with a lot of information in it, I recommend it to every Harry Potter fan."}, {"userName": "Pankti Porecha", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/61135108-pankti-porecha", "userReview": "Absolutely amazing book. Really shows how they creative team behind the movies made the transition from books to screen seem so realistic and magical."}], "description": "Harry Potter: Film Wizardry gives readers a front row seat to the magical journey that brought J.K. Rowling's wizarding world to the big screen. Step off Platform Nine and Three Quarters and into the hidden world behind the scenes of the Harry Potter film series. Brian Sibley is the author of other bestselling behind-the-screen books, like The Lord of the Rings: The Making of the Movie Trilogy and The Land of Narnia. The book includes Producer's Diaries from the Harry Potter films' executive producer David Heyman.", "title": "Harry Potter: Film Wizardry", "url": "http://www.goodreads.com/book/show/7952502-harry-potter", "average": 4.49, "cover": "https://images.gr-assets.com/books/1464452934l/7952502.jpg", "reviews": 542, "authors": [{"url": "https://www.goodreads.com/author/show/4941.Brian_Sibley", "name": "Brian Sibley"}], "type": ["Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/7952502-harry-potter", "http://www.goodreads.com/book/show/9687450-harry-potter-film-wizardry", "http://www.goodreads.com/book/show/16700368-harry-potter-film-wizardry", "http://www.goodreads.com/book/show/13504757-harry-potter", "http://www.goodreads.com/book/show/20518344-harry-potter", "http://www.goodreads.com/book/show/15818862-harry-potter-film-wizardry", "http://www.goodreads.com/book/show/7351.The_Lord_of_the_Rings", "http://www.goodreads.com/book/show/7340.The_Maps_of_Tolkien_s_Middle_earth", "http://www.goodreads.com/book/show/15239.The_Lord_of_the_Rings", "http://www.goodreads.com/book/show/13730598-the-hobbit", "http://www.goodreads.com/book/show/79977.Through_the_Shadowlands"]}