{"ratings": 3762, "userreviews": [{"userName": "Kara", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/7102344-kara", "userReview": "You know a book will be pretty good when the first sentence is: \"Whistling a tune from Fiddler on the Roof, I used my tweezers to work a piece of Gloria Cunningham's skull out of the sky blue wall.\" Gabby is hilarious! She has an insatiable curiosity for mysteries and finding out what really happened. She's never afraid to venture into scary territory in order to find her answers either. And let me tell you, she ventures all kinds of places and meets all kinds of people. When the building she's cleaning is set on fire right after she finds some evidence the police missed and she barely makes it out in time, she's sure that something is amiss. Of course the police don't want to listen to someone who 'fancies herself Nancy Drew', so Gabby begins investigating on her own (always telling the police what she finds out of course...well, sometimes). From her only employee getting arrested to a pipe bomb left at her front door, Gabby has a lot on her plate in just a few days time. And certainly the crime scene cleaning must go on, a girls gotta eat, right? With a cast of characters for neighbors, such as Sierra the vegan animal rights' activist, Mrs. Morgan the mystery writer who hardly ever leaves her apartment, Bill newly divorced and mad at women when he's drunk, and new guy Riley who says he's between jobs, Gabby also has plenty of mystery and mayhem at home also. One thing that helps make crime and being accused of it easier, is having good friends around who will believe in you no matter what.I don't normally read mysteries, but this one caught my eye and I decided to try it. Gabby is so likeable and so funny that it made the tension of the mystery easier to bear. And it never ceased to amuse me that Gabby kept finding pieces of evidence that the police somehow overlooked. No wonder they were frustrated with her, she made me them look bad! A good mystery, great characters, and a bad-guys-lose ending, with just a smidgen of unanswered questions to make you want to read the next book. Because yes, this is a trilogy. But no huge cliff-hangers! So yay for that. :) Read it!"}, {"userName": "Jennifer", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/7265136-jennifer", "userReview": "This was a free book from Amazon... It was a hard mystery to read for a couple of reasons, the main character, Gabby, was really hard to like. She thought she knew \"who did it\" from the very beginning and wouldn't let anyone convince her otherwise. Her comments and thoughts were cheesy and annoying. Another reason I didn't like it was because it was a Christian mystery where beliefs in God were mentioned through out. I dislike reading things that seem to push beliefs upon you. I doubt I will read anymore in this series... maybe if I'm desperate, but I have A LOT of books on my 'to-read' list. :-)"}, {"userName": "Cathy Daniel", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/7218096-cathy-daniel", "userReview": "I loved this book!! Unexpectedly funny!! I thought based on Gabby's profession it would be gruesome and I'm sensitive to blood but it wasn't bad at all. The only thing that kind if got on my nerves was how quickly and stubbornly certain characters would either leap to conclusions or disregard an obvious thing. I'm talking main characters. And Gabby is oh so dense in love lol. But likable characters (Sierra grew on me finally a little) and I can't wait for book 2!"}, {"userName": "Tito", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/21907583-tito", "userReview": "[ we all know that Riley (who is just the best character ever) is who she wants and belongs with. Why add the unnecessary angst? Ugh  (hide spoiler)]"}, {"userName": "Jacob", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/901342-jacob", "userReview": "This is one of those books, like The Art Forger, where I might not normally be interested in the situation, but the back text was so good at describing the setup it drew me in. Memo to those who are writing flirty, sassy, romancy novels: don't dish about the love interest, or obsess about the love triangle, or ask questions about How Will The Protagonist Ever Be Able To Resolve Her Problem And Work Things Out With The Love Interest? Serious eyeroll.Maybe the back text is better because this isn't a romance novel. There's enough romance to satisfy someone who likes that kind of thing, and to make the main character believable, but not so much that it makes her ridiculous. And I have a soft spot for when things don't work out with the love interest the way you think they might.The central mystery is pretty solid, the twists and reveal make sense (not too slow or sparing, and the twists arise naturally from the setup and characters), and it was as fun to read as I hoped when I got it :) What more could you ask for?"}, {"userName": "Kim", "userReviewDate": "Dec 03, 2013", "userURL": "http://www.goodreads.com/user/show/6305718-kim", "userReview": "Another freebie with my trial Amazon Prime membership. 2.5 stars overall. The idea is fascinating, a crime scene cleaner, the person who comes after CSI, who is a CSI-wannabe, solves crimes. The plot was decent, I honestly couldn't figure out who the murderer was until the final clue, but the ending was pretty formulaic and the reason for the murder was pretty lame. The love triangle was a bit strained, and I just couldn't believe a Christian man would be in a 4 year relationship with a model-like woman in LA without marrying her, and then be interested in a complete anti-Christian woman. Anyway, not the best I've read, but certainly not the worst. I enjoyed the character's background and her honest resistance to Christianity. Overall it was a bit of Kinsey Millhone mixed with Stephanie Plum, in a CSI setting."}, {"userName": "Kalena", "userReviewDate": "Sep 26, 2013", "userURL": "http://www.goodreads.com/user/show/12840458-kalena", "userReview": "Christian fiction/mystery. My 1st time reading Christy Barritt and I was not disappointed. Her characters are likable and quirky. I found the details about Gabby's work as a crime scene cleaner interesting although there were a number of times you are shaking your head at her decisions. The ending was not a surprise but resolved in a satisfactory way. Recommend to those who enjoy a light read and don't mind a little gore. I will definitely continue the series, but I am not rushing out to grab it right this second."}, {"userName": "Mikayla", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/14064833-mikayla", "userReview": "This was SO awesome!! I'm a sucker for spy/mystery's, so seeing a Christian mystery was a chance to good to pass up. I wasn't sure what to think of Gabby right at first. I mean, she has a rather morbid job of cleaning up crime scenes. But I was quickly swept up in Gabby's amazing humor. This book made me laugh out loud several times, which rarely happens. Though Gabby is not a Christian, this book really is incredibly clean. There was only one slightly crude joke in the book, and it was not bad at all. I think the author handled Gabby's not being a Christian very well. She made it believable. The author made the characters so vivid you feel like you would know them if you ran into them on the street.I look forward to the future books, and to see what happens between the characters."}, {"userName": "Igodgirl13", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/71790396-igodgirl13", "userReview": "A book I needed to read-YOU SHALL NOT BE ABLE TO PUT IT DOWN! You shall be hooked in the first paragraph, I kid you not!"}, {"userName": "Dawn Michelle", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/316327-dawn-michelle", "userReview": "3 1/2 Stars"}, {"userName": "Pep", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/40451356-pep", "userReview": "Nope. mom may like it but it was not for me."}, {"userName": "Meg", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/7102068-meg", "userReview": "The first installment of the Squeaky Clean Series, Hazardous Duty, definitely makes a splash - in blood. Christy Barritt introduces us to Gabby St. Claire, a college drop-out (with one semester to go in forensics, mind you) who cleans up crime scenes to support herself and her alcoholic father. Even though her circumstances don't sound all that rosy, Gabby is a vibrant character who you can't help but fall in love with and cheer for. Somehow, Gabby and her friends find themselves in the middle of a murder investigation into the death of the wife of a man with ambition for the top seat of government, someday. Gabby can't help but get involved with the investigation after her assistant is charged with a related crime, she knows he must of been set up! With help from her neighbors, Gabby uncovers clue after clue that the police missed -- giving her little faith in Detective Parker, a man who also is an object of flirtation. But, there's another man in Gabby's life... her new neighbor, Riley... an extremely caring man with some sort of past that he isn't very forthcoming with. Hazardous Duty is a fun and gripping cozy mystery, one that got me hooked on the series!"}, {"userName": "Kris", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/4645267-kris", "userReview": "If I had known this was going to be a book where Faith in God was going to suddenly be a Thing, I wouldn't have even bothered. Everyone has the right to his/her own beliefs, but I didn't appreciate having those beliefs shoved at me from out of (seemingly) nowhere. Aside from Gabby's having been sent from God in the eyes of her employee and his wife, faith really had no reason to be involved in this story. Aside from that, I didn't like Gabby. She was pretty annoying, really. She jumped to conclusions based on whatever fit what she wanted to believe (until the end when suddenly she knew who had really \"done it\"). How she had two men so interested in her I did not understand. She seemed to drive them both nuts (and not in a good way). The two men didn't seem all that great themselves. ....ok so I didn't really like any of the characters apparently. Maybe Bill, the drunk neighbor; he seemed funny.The only way I got through this was by skimming from about 27% until the end and only because I wanted to know if I was right as to who the \"bad guy\" was. That took entirely too long. (And I *was* right.)"}, {"userName": "Cheryl Goldyn", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/14197125-cheryl-goldyn", "userReview": "A page-turner with likable characters. Fans of Janet Evonovich will love this author. Labeled a Christian mystery, it does not push the issue, but shows that it is humanity's free will that creates life's hurdles, not God. Gabby is a woman who knows hardship and disappointment. Most recently forfeiting a life as a forensic scientist to clean up crime scenes. Like Evonovich's character, she's smarter than some professionals, but continuously stumbles into trouble. Likewise, without turning on the charm, Gabby has the interest of two men -- both she irritates; both ready to rescue her.All said and done, it is Gabby who solves the murder of the wife of a political candidate as well as a second political murder later on and clears the innocent. It is Gabby who is shot at, kidnapped, and nearly blown up. In charge her two rescuers right after she captures the \"bad guy\". I suspect she had some help, at the darkest moment, from the power of prayer and perhaps a little bargaining with God."}, {"userName": "Linda", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/1790184-linda", "userReview": "Thanks for introducing me to this Squeaky Clean Mystery series, Dina. I loved this first book!Gabby St. Clair had to drop out of college on her way to a forensic's degree because of family and money problems. To stay as close to her chosen vocation as possible, she opened her own business- that of crime scene cleaner. I loved Gabby's character: smart and a bit sassy while not pretentious. So as she is cleaning blood and bones off a wall where a prominent senator's wide was murdered, she starts to wonder what happened. She finds a hidden gun in the senator's home just as it goes up in smoke- arson- and she nearly dies. Soon Gabby is a target for murder. There is just enough romantic tension between Gabby and the doubting detective examining the case, and between Gabby and Riley, her beautiful new next-door neighbor who seems so laid back. But looks are deceiving. I will definitely be reading more of this series!"}, {"userName": "John", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/7216521-john", "userReview": "[Gabby's obsessive fixation on Cunningham as the murderer. It turns out she was wrong, but really the evidence she had wasn't nearly as strong as she acted like it was. (hide spoiler)]"}, {"userName": "MJ", "userReviewDate": "Jul 08, 2009", "userURL": "http://www.goodreads.com/user/show/782069-mj", "userReview": "Buying a gun to kill your wife: $3,000Hiring Trauma Care to clean afterward: $1,500Having the same cleaner uncover evidence that frames you: pricelessGabby St.Claire runs her own crime scene cleaning business. One day while cleaning up a murder scene she uncovers the missing murder weapon, which proves the guy in jail did not kill the victim. With the help of her cute new neighbor Riley and suspicious Police Detective Parker, will Gabby be able to uncover the truth before she is the next victim?This was a nice little cozy mystery and with the exception of the increasing body count there is nothing that is offensive in this book. In fact I would recommend this book to my mom and grandma."}, {"userName": "Maša", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/7792186-ma-a", "userReview": "The plot was weak: the focus jumped all over the place and it even forced the main character, who is supposedly smart (khm), to behave like an intoxicated moth. *bzzzzzz* The dialogue felt forced and didn't offer anything of importance to the overall story. The characters are mere caricatures without even a semblance of charm. The main character, for instance, LOVESLOVES SCIENCE. We don't see it, though. At times, I wondered if author even knew what the term \"science\" conveys. Also, the feelings that the author kept on telling us were THERE and STRONG... just didn't come through. There is one upside, though - it's only 200 pages long. Hurray! And, oh... stay away."}, {"userName": "Allison Kohn", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/21184249-allison-kohn", "userReview": "This is the first in the series and is as exciting and funny - maybe more so - than the others. It is different from other Christian cosy mysteries in that Gabby is not a Christian and she is actually qualified to investigate crime. She has the education without the job. She owns her own business - she is a crime scene cleaner. I recommend this book to anyone who enjoys a good mystery with a little romance and humor thrown in for good measure."}, {"userName": "Charity", "userReviewDate": "Nov 08, 2010", "userURL": "http://www.goodreads.com/user/show/2824691-charity", "userReview": "This book is a very humorous mystery. Christy does a good job in writing and keeping the reader interested in the story. I figured out about half way through who the bad guy was but I still wanted to read through to the end. Partly because I wanted to see where her love life went. Needless to say, gotta read the next book:) Nice novel though for someone wanting a nice cozy mystery."}, {"userName": "Mary", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/5877185-mary", "userReview": "Gabby St. Clair not able to finish her college education to become a forensic examiner, starts her own busines being a crime scene cleaner. The book is a page turner, but I have a problem with her removing evidence from the crime scene that the police missed. She was not working with the police in an official capacity, so legally, I wonder if that is correct."}, {"userName": "Beth Sears", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/39968109-beth-sears", "userReview": "Fast and fun mystery This was such a fun and quick mystery. It's easy to grow to love Gabby and try to figure out how she will manage to get out of, or help solve, her troubling issue."}, {"userName": "Vannetta Chapman", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/3927146-vannetta-chapman", "userReview": "My first Christy Barritt book did not disappoint. A fun who-done-it."}, {"userName": "Bonnie Moore", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/36238396-bonnie-moore", "userReview": "Crime Started reading and didn't stop till I had read the whole book. I loved the characters handling forward to book two"}, {"userName": "Michelle", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/6757815-michelle", "userReview": "Wonderful characters, intriguing mystery, and lots of laughs - what a great afternoon read. I can't wait to read the rest of the books in the series. The characters are so adorable and unique."}, {"userName": "Teresa Rollen", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/21158469-teresa-rollen", "userReview": "Loved this book. Will definitely be reading more by this author."}, {"userName": "Rebecca McNutt", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Hazardous Duty is a totally different crime novel from any other that I've read, mostly because of the science element introduced. Really great book and definitely worth reading. :)"}, {"userName": "Wendy Hughes", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/30187676-wendy-hughes", "userReview": "Loved it just what I needed to get away....."}, {"userName": "Star Shining Forever ", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/17209879-star-shining-forever", "userReview": "The mystery premise itself were ok. Gabby is a college dropout who now cleans crime scenes for a living. This is mostly an excuse for her to get near crimes and try to solve them. Which is what she attempts here. A prominent senator's wife has been murdered and investigation uncovers that the suspects, witnesses, and acquaintances alike have secrets. Gabby has been a self-professed armchair detective for so long (seriously, she gets her ideas from \"Murder, She Wrote\"), that when she finds some evidence the police missed, she's convinced she knows \"who dunnit\" and proceeds to be a nosy, stubborn, irritation to the lead detective. Oh, and also fall for him, as well as for her new neighbor who happens to be a Christian. That's the other irritating part of this book, the so called \"Christian\" guy. Who has a blonde, glitzy rich-and-famous-boss's-daughter girlfriend for 4 years (FOUR years!!!), then decides she's too high-maintenance, moves to a new town where he carries on all mysterious-like, meets Gabby and immediately starts spending almost every spare moment with her, repeatedly gets emotionally as well as physically close to her, then immediately goes right back to his previous girlfriend when she arrives and leaves town with her. Leaving Gabby the girlfriend of the narcissistic detective. He follows his eyes to his original gf and his heart to Gabby (lol). Add to that, neither of these girls are Christians and he's considered marrying both. WHAT EVEN. Newsflash: that's NOT how a Christian behaves. The only good part was the thought sprinkled throughout that people who are mad at God because of this messed-up world shouldn't be, because they're projecting their view of the bad things in this world onto God. He's not responsible for that, He didn't cause it. Humans and our bad choices did. But God is always there for us, a rescuer and comforter in the bad situations. However, this nugget was not nearly enough to redeem the book from its obnoxious heroine, ridiculous religious hero, and dumb love triangle."}], "description": "Gabby St. Claire dropped out of school on her way to completing a degree in forensic science. Instead, she did the next best thing: she started her own crime scene cleaning business. When a routine cleaning job uncovers a murder weapon the police overlooked, she realizes that the wrong person is in jail. But the owner of the weapon is willing to do anything to keep Gabby quiet. With the help of her neighbor, Riley Thomas, Gabby plays detective. But can Riley help her before another murder occurs?", "title": "Hazardous Duty\n      \n          (Squeaky Clean Mysteries #1)", "url": "http://www.goodreads.com/book/show/11337741-hazardous-duty", "average": 3.95, "cover": "https://images.gr-assets.com/books/1420794338l/11337741.jpg", "reviews": 478, "authors": [{"url": "https://www.goodreads.com/author/show/770315.Christy_Barritt", "name": "Christy Barritt"}], "type": ["Mystery", "Christian Fiction", "Christian", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/11337741-hazardous-duty", "http://www.goodreads.com/book/show/1668779.Hazardous_Duty", "http://www.goodreads.com/book/show/18270253-hazardous-duty", "http://www.goodreads.com/book/show/15761785-hazardous-duty", "http://www.goodreads.com/book/show/17856528-home-before-dark", "http://www.goodreads.com/book/show/22699759-random-acts-of-murder", "http://www.goodreads.com/book/show/37943214-hidden-currents", "http://www.goodreads.com/book/show/3030218-suspicious-minds", "http://www.goodreads.com/book/show/22817419-dubiosity"]}