{"ratings": 1750, "userreviews": [{"userName": "Kellyn Roth", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/52072956-kellyn-roth", "userReview": "Originally posted on Reveries ReviewsTitle: HeiressAuthor: Susan May WarrenSeries: Daughters of Fortune, #1Genre: Historical Romance with Christian themesEra: 1890s through 1918 (Gilded Age/Edwardian/WW1)Setting: New York, MontanaPublisher: Summerside PressSource: bought myself a copyTime Taken to Read: about two daysOverall Rating: 3.5/5 stars (at least a star removed for content)The Heiress by Susan May WarrenI … have absolutely no clue what to think about this book. At all. I’m hopelessly unsure what to say in this review. For this reason, I’m leaving behind my usual format. Here goes.Now, I’ll admit it right out: I’m a sucker for drama. All the grief and turmoil makes me happy. *rubs hands together evilly* At times, it may have been a little over the top. You know those books where everything goes perfectly for the characters? Well, this was the exact opposite of those.This book was all over the place. It was confusing. It was crazy! But at the same time … there was something special and unique about it. It was well-written, the emotions felt authentic, and I was thunderstruck throughout much of it. The characters were well-developed even if they weren’t necessarily likable.Jinx was terribly flawed and sad and just … miserable. I felt so terrible for her, but at the same time I wanted to shake her until her eyeballs rolled out.And … I didn’t like Esme at all. She was just waaaay too naïve and idealistic for my taste. I like all-knowing characters. ;) Seriously, though, I just didn’t like her. Nor do I respect her goals. *blinks* Leave riches behind??? *eyes widen at the very thought* *is mercenary*I didn’t much care for any of the males in this book – except Esme’s husband. He was pretty sweet. And Teddy Roosevelt made a cameo (!!!), so that was awesome.Bennett … ugh. I’m sorry. He may have all the noble intentions he wants, but he did the wrong thing and then continued to pursue doing the wrong thing, and I won’t forgive him.The plot was good throughout most of the book, but several times it made huge skips forward (from three to fifteen years!), and it was a bit confusing. However, I soon caught on in spite of that. (I obviously didn’t enjoy the parts concerning Esme as much as the parts concerning Jinx. They seemed distant and cut off from the rest of the story, the theme, etc.)So … what am I saying? Well, this: I enjoyed this book greatly, but there were many problems with it. I couldn’t lower the rating past 3.5 because I enjoyed it that much, but it still wasn’t a great book, and probably not one I’d recommend. Call it a guilty pleasure read.CONTENT: 4/5Language: n/aViolence: a man is abusive of his wife (emotionally and physically). (Actually, several men are abusive of their wives.) Mine accidents, some of which were caused by other mine owners. People are killed or badly injured/mangled in these accidents.Sexual: an adulterous affair that results in a child. (Actually, like three of those and multiple others that don’t result in children/it’s never confirmed if it did result in children.) (I’m seeing a pattern here.)Mentions of people enjoying/not enjoying marital relations. Lots of talk about adultery, etc. The biggest thing that was described in detail was kissing and then the before-and-after of sex, but it was still too much for me, personally. Also, all these characters are just plain immoral. Ugh.Other: some details about pregnancy, very minimal. Talk about miscarriages, etc. The slummy conditions of the lower-class parts of town are described, and it’s disturbing.(I may have forgotten something … it’s been a while.)This was honestly my biggest problem with the story. There was a lot of content, as you can see. I’m tempted to say 18+, but perhaps 15 or 16+ for discerning readers or with parental guidance.The biggest problem was Jinx’s adulterous affair. At first, I was conflicted – “Okay, so, she was tricked into it …?” – but I soon realized that it was as much her fault as that of the man she cheated with.At the same time, I couldn’t help but get swept away with these characters. And I know, that’s a form of emotional manipulation, but … it wasn’t that I felt they should sin. The author never treated sins as right.I just felt bad for all the people in this story who, though not justified for their behavior, were influenced by an upbringing that may seem peachy perfect from the outside – but truly led to their downfall.And … through that, there was a sort of moral lesson. It’s kind of a cautionary tale – don’t be the Gilded Age because even though it’s shiny, it sucks, even for rich people who you think have it easy.~Kellyn Roth, Reveries Reviews"}, {"userName": "Margaret Chind", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "Susie was one of the first authors that I discovered back when I stumbled across Liz Curtis Higgs and began my all-consuming love of Christian Historical Fiction. It was her Heirs of Anton series. So now that I find she is writing another new series set in the \"opulent world of the Gilded Age\" I could help but be intrigued! This era seems to be a poplar one as I've also gotten my hands on one from Nancy Moser and before that Siri Mitchell. I could not wait to see Susie's take on it!At about 183 pages of this 380 page novel I can already say I feel like I've already read two full novels in this short page length with the sisters two stories. Both of romance and tragedy. I'm waiting for Oliver to walk up and say, oh it was a mistake and for Bennett to look out over the sea and return. Alas.At just over halfway through I felt like I'm in another novel, this time a western. This is awesome. You get a gilded age adventure and a prairie romance too! As the character comes up, I am remembering all my history bullet points on Teddy Roosevelt phrases and I think Susie is hitting them all. In finishing another segment I promise these could be individual novels. Changing characters and following along in history it is as if the Heirs of Anton series were one long book instead of four shorter ones.I did not expect a thing. Honestly I haven't finished reading any of the Golden Era novels except Cara Lynn James first one as it came across. After finishing this one I'm desperate for more. I want to go back to the Moser and Mitchell books and get more of the time and the era. I want to find the rest of James series and drink it all in. I cannot wait for more Daughters of Fortune. I cannot even imagine what comes next. Every twist and turn took me by surprise and I was rereading sections because I was just sure that I misunderstood. Not after everything, could that happen! - I kept saying to myself. But it did. Every thing that happened made things lead to the next. It reminds me of endings that I imagined for tragic movies that did not end as I wished in their romance.This was and is awesome.*Thanks to Litfuse Publicity for providing a copy for review.*Originally posted: http://creativemadnessmama.com/blog/2..."}, {"userName": "Melissa", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/2182454-melissa", "userReview": "I had a very difficult time deciding how to rate this book. I read it practically within one sitting and was desperate to know how it ended. But in reality, that desperation stemmed from just wanting to get it over with and be able to move on. I liked the story--sort of--but good lord, if not for the scattered references to God and the Bible, you almost wouldn't know Heiress is considered Christian fiction--it reads just like a soap opera and is filled with scandal!Seriously, I was worn out by the time I finished this book. While certainly captivating, it was rather draining to read and the desire to finish it wasn't due to pure, unadulterated enjoyment on my part. Oh, there were aspects I liked and I did enjoy Esme's character... but I simply needed the drama to be over and really, I wasn't feeling terribly inspired by the end of it, like I do with most Christian/Inspirational Fiction. The fact that Warren had me hooked from the first page of the book is the only reason I feel I can rate this fairly at 3 stars. Certainly, her writing is good, as is her storytelling, but (at least, for me) that just couldn't make up for the way the story actually made me feel by the end of it... a little horrified, exhausted, and even rather down.I expect that most readers who enjoy Christian fiction that is edgier and not so preachy will probably like this series, but I'm don't think I'm even going to be able to bring myself to read the second book, which I already happen to have because it was a great deal on Amazon for the Kindle. I hate to pass up reading a book I've bought -- it feels a bit like throwing away food that someone else could eat -- but at least I didn't spend a lot on it!"}, {"userName": "Renae Sattazahn", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/12458497-renae-sattazahn", "userReview": "\"Heiress\" is Book 1 in the \"Daughters of Fortune\" series by Susan May Warren. This was my first experience reading a novel by Susan May Warren, and I am definitely hooked for life. Clearly, this author is not only talented but an experienced writer as well. The plot was detailed, moved quickly, and the characters were well-written. The historical information was accurate and researched thoroughly. I felt completely transported to the pre-war Gilded Age of New York society.It's difficult to summarize the story, because there is so much to it. Esme, the older sister, fights her birthright, while, Jinx, the younger sister is eager to embrace their family's way of life. These leads to failed relationships and tragedies. The author managed to work in scandal, sabotage, deception, jealousy, arson, adultery, and even an element of organized crime. I have seen several Susan May Warren books available in previous years, but the title and cover of this particular novel really grabbed my attention. In the future, every time I see her name I'll snatch it up. This lengthy novel was read in two days flat. I was dismayed when I read another review claiming that this did not have a strong enough Christian message. That is absolutely untrue. Most women read Christian fiction for enjoyment that is also positive and edifying. It is not designed to replace quiet time. I found the novel very encouraging, and felt that it laid out the path to salvation in a clear cut manner while remaining non-offensive. My opinion is that the novel very much held a Christian slant, and as such was realistic regarding common temptations of people everywhere. \"Baroness\" is Book 2 in the \"Daughters of Fortune\" series, and I can't wait to dig in. Susan May Warren, let's do it!"}, {"userName": "Casey", "userReviewDate": "Jul 08, 2011", "userURL": "http://www.goodreads.com/user/show/3194216-casey", "userReview": "What a story! I think I went through the ringer of emotions with this book and there were more twists than a curvy road – surprises I never saw coming. Warren writes a story that makes me feel as if I have stepped into a movie screen. Only better. I can smell, hear, taste, see what is happening to the characters and their emotions become my emotions. I felt the rage of indignation, the sweet power of love and the passion of the era bottled in each of the characters. Jinx and Esme especially. I was emotionally exhausted (in a good way!) when I closed the novel.Though set in the Gilded Age, the story wasn’t confined to New York or London, but expanded to the western plains and beyond. What breadth “Heiress” involved within its plots! Jinx and Esme’s stories are gripping each in their own right, but once come together become “don’t-bother-me-I’m-reading” plot. What a tangled web we weave when first we practice to deceive. Those words aren’t uttered in the book, but I felt them. A lesson in the human condition and God’s everlasting grace, I didn’t want to put this book down. It’s a great historical, a gripping novel and a cast of characters with more than their share of problems, but I can’t wait to see them again in book 2.This review is my honest opinion. Thanks to the publishers through Litfuse for my copy to review."}, {"userName": "Jocelyn Green", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/6887032-jocelyn-green", "userReview": "Heiress is one of the best books I've ever read in terms of skillful storytelling, character development, and rich historical detail. As a novelist, this was worth the read if only for me to see and take notes on how good fiction if written! I know some people have found it a little on the dark side. One of the two main characters follows her own choices and ends up in a web of deceit and adultery—of course sins we would never condone—but Susan does it to show us what life can be when we are not surrendered to Christ. (If you read the Author's Note in the back of the book first, it will better frame the story so you know what the author is up to.) This was not a warm-fuzzy tale, but a sobering epic that will keep you turning the pages as you see the character's life choices unfold into a fascinating wreck--and what she decides to do about it in the end.~Jocelyn Green, author of Wedded to War"}, {"userName": "Laurie Carlson", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/4898049-laurie-carlson", "userReview": "“Heiress, Daughters of Fortune” series, Book 1 of 3, by Susan May WarrenSusan May Warren has done it again! Her writing is one of the best! She has written this epic novel that is so engaging I felt as if I was right there in 1896 with the August Price family. I felt like I was in Esme’s dressing room, getting ready for the ball, at the ball with her, and more. I could relate to Esme much more than I could to Jinx, her sister. Susan May Warren has such a gift with her characters that she pulls the reader right into whatever story she writes about. She can write about anything and it’ as if you are right there! It makes the book go by so fast, that is the only downside. I’m ready now for Book 2 in this 3 book series! This book is an epic saga taking place during the Gilded Age, which starts on 5th Avenue in New York City, in 1895. It is about a prestigious family, the newspaper magnate, August Price.His oldest daughter, Esme, is the first Debutante of the two sisters, whose name is Esme. She is the main character in this book, along with her younger sister, Jinx. Esme is the oldest daughter, and the first to make her debut as a Debutante. It is desired by her family to marry first, and her mother already knows who she wants her to marry. Foster Worth. Esme is not so sure she wants to marry Foster Worth. As we read this captivating story, Esme has very high hopes and aspirations for her life of becoming a Journalist and traveling the world. She is bored of just ‘being’ where she lives and sees herself traveling the world as the Journalist she so desperately wants to become. She does not want to marry, even though she must so her younger sister can. If she does not marry, her younger sister cannot. Esme and Jinx, both, wish they were born the other way around especially since that way she would not feel so much pressure to have to marry. Esme finds the events the other prestigious families’ in this area host as being tiresome and boring. Esme has much bigger and better things planned to do with her life rather than playing this dress up game night after tiring night, wearing tight corsets in which she can barely breathe, wearing the heavy ornate ball gowns, having her mother check her dance card continuously, and never stop talking about whom she should and should not marry. Esme wants much more out of life than what is at her feet at this moment. She is already sneaking articles into her own father’s newspaper without his knowing it, under a pen name. After Esme proclaims she will marry Foster Worth, an old friend comes along and professes his love for Esme, going back to childhood. She considers this and decides she loves him as well. She goes after him. She ends up finding him in the tenements, of which do not smell good, the people are less than desired, as well as the rooms inside. This is where he lives? Regardless, she still loves him. She ends up disappearing.Esme’s sister, Jinx, is especially happy to be able to get to go in to her father’s office at home and break the news to him that Esme is missing. Thus starts the epic tale of these two sisters. Each going separate ways, and much later in life, coming back together again, after many trials and tribulations the two of them have endured.This is a “can’t miss” book, and one of my favorites of 2011!. This book is a page turner. You want to know what happens next. I found this book very difficult to put down. When I did put it down, it was all I could think about. As I said above, Susan May Warren did it again! She can take ‘any’ story and give it her magic touch, and ‘poof’! There you are feeling like you are ‘in’ the story! I can’t WAIT until Book 2!5 out of 5 from me!A HUGE Thank You to LitFuse for allowing me the PURE ENJOYMENT of reading this book! THANK YOU!LaurieI received this book for “FREE” from LitFuse Publicity and the Publisher, Summerside, through their Book Reviewer’s Program in exchange to read and write a review about this book. It is NOT required for my review I write to be either positive or negative, but, “of my own opinion.” I was NOT provided with “ANY” monies to accept this book, “NOR” to read it, NOR were “ANY” monies given to me to write the review for this book. All that was ‘expected’ of me was to enjoy the pure pleasure of reading it. Again, the opinions expressed for and about this book are ‘of my own opinion’. I am disclosing this information in accordance with the Federal Trade Commission’s 16 CFR, Part 255, http://www.access.gpo.gov/nara/cfr/wa... Guides Concerning the Use of Endorsements and Testimonials in Advertising."}, {"userName": "Sonia Meeter", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/9292176-sonia-meeter", "userReview": "I loved this book! Great research and suspense! It was very hard to put down and difficult to tolerate interruptions while reading too! Thanks for another great book Susan May Warren!"}, {"userName": "Margaret (Margot)", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/12842923-margaret-margot", "userReview": "So once again, not reading the details and descriptions of a book found me pages deep in a Christian historical fiction. I soldiered on because I didn't feel like it was overpoweringly Christian. As a matter of fact, the religious portions of the novel were inserted almost as revelations, or closure for the 4 (?) specific sections of the book, so you could almost scan through and not miss anything except the Christian parts. And to be honest, the Christian parts were really about being a good person and not letting poor choices rule who you are or what you deserve. Being grateful for what you have because the love of God is more precious - I mean that isn't so bad is it?What I liked was a well told, well written, historical novel. The time period was a new one for me in historical fiction, and I really enjoyed it. I loved the transformation that happens in this novel from the formal ways of the late 19th century to the post WWI years, with a pretty impressive societal shift that I haven't seen done. The development and pace of the story were good. I enjoyed seeing the characters realize the repercussions of their actions and learn to be better people. That was a prevalent theme in this book. It was believable, with a good pace, no excessive inner monologues, and had a good plot(s).**Spoilers start here, sorry I couldn't fully express myself without doing this.** I liked the story, but there were some frustrating factors that I couldn't ignore. 1. There is no explanation whatsoever for Fosters behavior change towards Jinx until well into their story. I really felt like that was a gaping hole. He was openly flirting with Jinx before the wedding and then a cold hearted bastard. It made me so mad too because I had already typed him as a Colin Firth in my mind and then he turns out to be this horrible man. I get it, cold hearted bastards don't happen over night, but that needed more attention to justify the transformation. (I had to completely transform his image before I finished the book into some globular thing that somewhat resembled Darcy) 2. I really felt like the author delivered too much pain to these characters. I guess this goes back to needing to have the Christian message to address, but it was infuriating. I was into the story for the first sisters wedding, then the author broke my heart. I was into the story with Oliver, then the author broke my heart. I was into Bennett, and the author broke my heart. I was into Daughtry (hell I could have even been into Able) and the author broke my heart - this one was especially painful. And then come to the ending when all of the story lines come back together and there is more? Seriously? These women went through so much: dysfunctional family, forced marriages, abuse, repression - ugh, it was an emotional roller coaster, and not all of the bad things needed to happen to get the message across. While I really did like the book, I hesitate to consider reading the next in the series because I'm not sure I want to put myself through that again. I know, not very Christian, right?"}, {"userName": "Crystal", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/19553672-crystal", "userReview": "To parents: This book is not for children or young readers. I gave this book 2.5 stars because it really does suck you in and you really do feel the pain and the emotions of each character. Also Susan Warren can really craft a scene. I felt like I was transported in time and watching this story as it unfolded. Things I loved1) The sisters relationship with each other2) The dramatic character development Jinx goes through3) The running social commentary on the times4) The rich, vivid descriptions5) The pro women's rights angles6) The way the book makes you feel and think ever after you put it down7) The moral that our decisions have lasting consequences and that we cannot build our happiness on someone else's pain.8) It makes you want to know what going to happen next. Spoilers***My issues with the book:1) Plot holes. The Oliver arc is a major major plot hole. It's down right ridiculous. I think the author could have written it to be more believable. It would have been so much more real if it hadn't taken 20 years for Esme to learn he was still alive. And if he loved her why didn't he go after her? Try to find her? He cabled her so he knew her whereabouts all along, but did nothing to reach out to her. Another plot hole: Fosters transformation from charming flirt, to cold-hearted bastard is never explained. 2) I didn't think the book should have spanned 20 long, painful years. The women are in their forties before they get any reprieve from suffering.3) It was much too painful in some spots. Some of it dripped with an empty hopeless pain that one does not wish to find in a so called 'inspirational' novel. 4) This book is NOT Christian. It is a nice novel with a few moral lesson shoved in. You can literally skip over the \"Christian parts\" and not miss anything because the the Christianity is tacked on instead of woven seamlessly into the plot. 5) The ending was a hot mess. The Lewis angle was unbelievable and ruined the book for me. I mean you read through all that pain and devastation, abuse, and yearning, and you just want a tidy resolution not more heavy-handed drama. Hasn't the writer heard of happy for now endings. It makes no sense that a minor character that we only hear about in name suddenly rises to significance at the very end of the novel. I think this book disappointed me because it had epic amounts of potential. It could have been hope-filled, inspiring, and romantic, instead the author skewers the audience with lust, lies, deceptions, rape, abuse, loneliness, scandal, abandonment, violence, bereavement etc etc and does not reward us with enough believable positivity to compensate for the emotional turmoil she rains on us. Dunno if I have the emotional fortitude to read Baroness. Like what you read? Visit me at my blog"}, {"userName": "Paula Vince", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/10911644-paula-vince", "userReview": "Esme and Jinx are the daughters of a wealthy newspaper publisher and this story covers the time span between the late 1890s and WW1. Esme simply wants to use her gift for writing to make people aware of the plight of the destitute. She's not interested in the role high society is trying to foist on her. However, her younger sister embraces the glitz and glamour of the world she's brought up in, so much that she's prepared to take matters into her own hands and make a drastic move.My favourite is part 2, which focused on Jinx and the fascinating romantic predicament she got herself into. I really felt her emotions. Because of her immature machinations going horribly wrong, it seems the rest of her life is doomed for misery. It's obvious that what would really have suited her is right in front of her, but it seems too late. Her character development, from the shallow, calculating girl in part 1 to the pensive and wise heroine she becomes is excellent, as is the case of mistaken identity at the crux of her dilemma.When the story shifted to Esme in Part 3, I was still too full of Jinx's story to want to get stuck straight into it. Then when I did, I found the character and background of Daughtry Hoyt had a rushed-over feel to it. He seemed a bit like a plot machination to ensure that Esme had a baby, but he was too nice a plot machination for what happened to him. If the novella-sized Parts 2 and 3 could have been extended into full length novels in their own right, I might have been even happier with this interesting read. Part 4 was the same dizzy rush of drama, skipping a lot of time. I don't feel I got enough of the next generation of characters, Jack, Rosie and Lily, to care much for them. Not necessarily enough to read the next book.The quotes from D.L.Moody, who was a contemporary evangelist of their time, made a good theme. He said that when we're full of self and our own plans, there's no room for God to move. This is exactly what is borne out in the novel. The time period was perfect, showing the corruption in what is so often looked back on as an idyllic, romantic era. It was satisfying to see both sisters end up with men they truly loved, although at different points of the story they both decided they couldn't cope with social and economic repercussions if they did.The author mentioned that her story was loosely based on Jacob and Esau, and although I could see similarities when she mentioned it, it wasn't forced enough to be in our faces. Altogether, a good read although I would have preferred it to have been longer in parts and not so compressed in the second half. But because I liked the two sisters and their perfect matches, I might just read the sequel anyway."}, {"userName": "Courtney", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/4881034-courtney", "userReview": "Why haven't I ever read anything by Susan May Warren? I absolutely loved this book and I feel like I've missed out on really getting to know a great author! I can't wait to read more by Susan!!Heiress is about August Prices' daughters and how they wanted different things in life and how things turned out for them with the decisions they made along the way. Esme was beautiful and graceful, but she was also a Heiress which meant she was meant to be married off to the highest bidder. Esme had no interest in the rules of high society and she was adamant that she would marry for love along and she would become an amazing female journalist! Jinx was Esme's younger sister and wanted more than anything to be the Heiress and marry a wealthy man and become the center in high society. Jinx wanted everything Esme didn't, if only they could switch who was born first!!Author Susan May Warren completely astounded me with this new series titled the Daughters of Fortune!! Right from the beginning I was completely invested in the passionate love stories of Esme and her sister Jinx!Heiress is a unique story that deals with tough issues like adultery, betrayal and passion along with rebellious and strong heroines! There were so many twists and turns and unexpected events that unfolded throughout the story I felt I couldn't read it fast enough! The story starts off with the 2 sisters together and then splits off into each of their own personal lives and then it comes together again when the sisters are reunited after years of separation. This is a story of opposites; one sister chooses wealth and status, the other chooses love and poverty. This is a Christian fiction but I was impressed that it was not overly preachy. It gets a little annoying to read perfect characters leading perfect lives. However Susan weaves a subtle message about following God's path for your life and the consequences of following our sinful desires! I will be adding this book to one of my favorite Christian fiction books ever read list and will anxiously awaiting book 2 in the Daughters of Fortune Series!!I highly recommend Heiress to any fan of the Gilded Ages, Christian historical fiction, Edgy Christian fiction and romance readers!! Content: Some minor things to mention: this book is about marriages and like I mentioned before there is adultery and some violence. I would recommend this book for mature audience only. A Big Thank You to Litfuse for providing a review copy of the book. I was not obligated to provide a positive review."}, {"userName": "Sarah McC", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/11793277-sarah-mcc", "userReview": "The fact that this book was absolutely dreadful came as quite a surprise to me, as I have actually read other books by Warren before and found them to be decent suspense novels. I was excited when I discovered that she had written a new trio of books, set in t he early 1900′s, following three generations of women. Since I’ve been reading my way through twentieth-century history over the last two years, I thought to myself–Perfect! But, tragically, this book was just full of unnecessary angst and stupidity.The story focuses on two sisters, daughters of an important and rich newspaper baron in New York City. The oldest daughter yearns to be a writer like her father, while the younger daughter wishes to be the belle of New York society. I won’t bore you with the details, but basically every time you thought something good was going to happen, it ended in tragedy. Everyone lied to everyone else, then felt bad about it. Everyone ended up with unhappy romantic entanglements. And there was no real story to hold things together.It was impossible to like anyone, mainly because Warren killed off characters right and left (mostly nice ones… the bad ones seemed to linger like a bad taste in your mouth), or nice characters turned out to be jerks. The sisters were both irritating, poor decision-makers, and self-destructive.And, worst of all–while other books of Warren’s that I have read have done a good job introducing and working through Christian themes, this book handled it terribly. God was just sort of tossed out as a band-aid for random problems. There was no real engagement or relationship with Him. The characters’ faith just sort of came and went. The so-called ‘Christian’ message was just randomly-inserted preaching that had no real connection to or impact on the story. It was the sort of Christian fiction that makes my skin crawl, to think that non-Christians read that and think that that’s what we believe… ugh.So, in summary–impersonal characters, terrible story-telling, not a happy moment in the entire book, flat and platitude-filled religion–all combined to make this book a complete waste of my time."}, {"userName": "Lydia (Overweight Bookshelf)", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/4230224-lydia-overweight-bookshelf", "userReview": "First reviewed here: http://overweight-bookshelf.blogspot....Money can't buy you happiness, but this book can guarantee you a few hours of it. This book was positively decadent-complex depth with a sweet aftertaste. The breadth and scope of Susie's talent never ceases to amaze me. She has crafted an impeccable plot wrought with betrayal, passion, adventure, and heart-stopping conflict. The characters are intriguingly complex; one sister is a product of her environment and the other rebels against the gilded cage of luxury and pretense. Their actions, thoughts and desires draw them on to a path of brokenness and redemption that will resonate in your heart. Clear your schedules, make yourself a warm cup of something, and prepare to be indefinitely attached to your seat so you can give this book so much deserved attention. Rating: 9/10**review copy provided by Litfuse PR**"}, {"userName": "Rebecca Mena", "userReviewDate": "Feb 20, 2013", "userURL": "http://www.goodreads.com/user/show/17167663-rebecca-mena", "userReview": "This was an amazing book. I rode the emotions of Esme and Jinx, I felt their trials and tribulations, I fell in love when they did. My heart broke when theirs broke. This story held me on the edge of my seat. I could not help but read it in 2 days time, I got hooked in. The drama and scandal at every turn had me holding my breath to the very end. If you are looking for an in depth novel that takes you on a wild ride with two headstrong, beautiful and bad ass women, then this is the book you are looking for!"}, {"userName": "Cecilia", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/2183201-cecilia", "userReview": "Ever since Gossip Girl came to life on television, I have been hooked on all things New York and its ritzy upper-crust families. Glamour, scandals, glitter and gold – when I heard Susan May Warren was tackling this world with a historical twist, call me hopelessly hooked but I was more than ready to jump into this adventure.THE GOOD BITS{The difference of chasing dreams versus living them.} Heiress takes place in a world where women did not have a lot of options – their main objective is to secure the right sort of marriage. Some women live for this, but others dream bigger for independence and perhaps a career. Esme dreams to be a journalist instead of marrying the man that her parents picked out, but is she prepared to leave the glittery world behind and get her hands dirty in the real world? That is the real trial by fire, and Susan May Warren allows this character to both fail and succeed.{Jinx’s knotty romance.} Granted I wouldn’t wish anyone to go through what Jinx went through in the romance department, but it was so deliciously twisted that I flew through the pages to find out how it would all unravel. A heartbreaking nightmare of a love triangle, but when things were good, they were happy-good. The beauty of this particular storyline is how tragic and real it felt – how many women have been trapped like Jinx? How many had to let go of an impossible love to survive? It was riveting. It was raw. It was real – and I ate up every word of it!THE BAD BITS{Combination of 2 storylines.} It works for certain books. I don’t think it was a major issue for Heiress, but when I got invested in one sister, I wanted to see her story through to the very end without any interruptions from the other sister. Susan May Warren gives us nice chunks of time with each sister, but I wished the story did not have to alternate – and perhaps each sister would get their own individual book.{Just a smidge of Christian fiction?} I expected a more obvious Christian message somewhere within these pages, but I could not put a finger to it for the life of me. Granted, a good way to describe Heiress is a more wholesome Gossip Girl. Scandal and unfaithful husbands are still running around, but how does a Christian woman survive in such a society? Can she hold onto her faith when society kicks her to the curb? The problem that I have is that I did not really see Esme or Jinx struggling with their faith as much as the simple fact that life is unfair to women.THE OVERALLI think Susan May Warren is onto something with this latest series, and I admit some curiosity as to how the sisters will fare in the future after the ending. Heiress is quite enjoyable – not too historical, not too scandalous – just the right amount of both. More of a quiet and thoughtful piece on the trials for women living on the cusp of independence."}, {"userName": "Sara", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/2474721-sara", "userReview": "“Oh what a tangled web we weave, When first we practice to deceive.” That quote kept resonating through my mind as I read this book. In Heiress, Susan May Warren transports the reader into the Gilded Age and a plot that is full of emotion – betrayal, anger, guilt, heartache and redemption. I wasn’t sure what to expect from this book, but it immediately grasped my attention and didn’t let go until the very end.The story of Jinx and Esme is a complex tale that dragged my emotions from chapter to chapter. This book was hard to put at times, but at a certain point, I’d hit an emotional wall and would be forced to stop reading because I couldn’t handle anymore drama. The heartache that these characters endure and overcome is what makes this book so great! Also, I was also fascinated by the time period of this book and the angle that Susan approached it from. Many historical fictions books in this era focus on the “clean/safe” side of the period – the debutantes, the extravagant balls, the beautiful gowns, or the courting of a young lady; while Susan looks at the “gritty/dirty” topics – the corruption, the deceit, and the hurt. Though I did enjoy this book, I was a bit surprised that the faith element really didn’t come into play until the last 1/4 of the book. It isn’t until the final section of the book, when we see the characters reunite with one another and finally understand their blessings, and that they are loved by God. Susan May Warren is one of those authors that I would read ANY book from! She’s incredibly talented and always entertaining from her whimsical and comical stories, to her suspenseful one and now to her dramatic books. I’m anxious to see what the next book in this series, Baroness, will be like."}, {"userName": "Anne", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/5252799-anne", "userReview": "I confess. I love book covers. This one is stunning! I've read many of Susan's books but until I read Heiress I had no idea she could take me in two different directions so skillfully. Most times, when reading a book, you get one heroine in one locale, but in Heiress you get two heroines in two locales, and it is NEVER confusing!Esme & Jinx are quite the sisters. Fiercely independent, Esme wishes to marry for love. Traditional to the core, Jinx wishes to marry for socially acceptable reasons thinking she will be loved. These poor girls. I felt so sorry for them. At times, the pressure to be the perfect daughter seemed so overwhelming, and it certainly shaped how they felt towards one another and others. Obviously, the times were different and daughters had tremendous obligations to their families to marry well, often times \"saving\" the family from ruin. But I must say, with as many books as I've read set from the Regency to Gilded Era, this one makes me glad I wasn't living in those times. Nope. No thank you.Susan is a master at portraying the opulence and grandeur. I could see the gorgeous ball gowns, sparkling dog collars ( on women, not dogs ;)), and those handsome men in their fancy waistcoats. She's also a master at portraying the deceit, jealousy, and manipulation that took place behind closed doors. Whew! I'll stick to reading books.Not a spoiler but if you’re squeamish about infidelity and abuse, I wouldn’t recommend this one. It’s not graphic but the subjects are covered. Thank you to the publisher and Litfuse for my review copy. This is my honest opinion."}, {"userName": "Faye", "userReviewDate": "Oct 14, 2011", "userURL": "http://www.goodreads.com/user/show/6215055-faye", "userReview": "Oh the Drama!Esme and Jinx are two debutantes born into privilege and wealth, expected to marry well and build their family's good name. But in a world of glamour and glitz, things are not always what they appear...I fell in love with this book, and its portrayal of the Gilded Age and how truly treacherous it could be, and how few are who they appear to be. The descriptions were lush, and I got a good feel for the various class differences represented. I loved how Ms. Warren brought out the tension and conflict in the characters, couldn't put the book down for long because I couldn't wait to find out what would happen next. This book has everything you could ask for in a good drama, tortured characters, forbidden love affairs, regret, mystery, heartbreak, and second chances. I would definitely recommend this book to fans of The Forsyte Saga and Downton Abbey, because in my opinion it is better than both of them, this book completely blew me away!My favorite characters were probably Esme and Daughtry, because they were both so well written and more compelling to me personally. Daughtry, was a fantastic hero who had a string faith and was willing to risk his life without hesitation if it would save others. Overall, I highly recommend this book, I don't want to tell you too much about the story, but to be honest you wouldn't believe me if I told what happened anyway, you'll just have to read it yourself!I actually wasn't required to write a review for this book I just wanted to!"}, {"userName": "Ashley Nelson", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/2263645-ashley-nelson", "userReview": "I picked up this book on a whim, mainly because it was free, I liked the cover, and I needed something to read for a \"judge a book by its cover\" challenge for my bookclub. After reading the summary blurb and looking at the cover, my impressions mainly focused on those pearls. To me, they represented her wealth, a life of wealth and privilege, but also that that same wealth was choking her, restricting her life. Turns out I wasn't too far off. Also, I thought this was a historical romance, but later discovered it is actually categorized in Christian fiction. Funny how there is NO hint of that slant in the book summary on amazon.I finished this one, but I probably would not read any more by this author. Mainly because 85% of this story is a total downer. Every character makes poor decisions that tear apart lives and lead to their suffering. Repeatedly. There was maybe a brief happiness for a page or two, then doom! And suffering! Ugh. Was the point supposed to be that these girls cared more about family and wealth and not enough about God? They weren't humble enought, so they were punished over and over? I don't know. The God stuff was few and far between; it felt jammed in as an afterthought and didn't mesh or flow with the story. Really wouldn't have made much difference if it was there or not, so I wonder what was the point. I did not care for the extreme time jump about 2/3 in. The quality of the writing was good, I just did not like the storyline of continued suffering. But excellent cover for sure!"}, {"userName": "Brianna", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/8301286-brianna", "userReview": "Heiress was definitely a fun read. It had a very nice mix of both Christian undertones and historical fiction, and it was extremely interesting reading through the lives of both Esme and Jinx, the two daughters of a newspaper editor who are looking to make good society marriages and help further their families up the social ladder. Both daughters are unhappy with their lot in life - Esme wants to avoid a society marriage and instead work as a journalist for her father's paper, while Jinx wants to be able to enter society and marry well, something she cannot do until Esme is married. After one fateful night, both daughters get what they want - Esme runs away to be on her own and write, while Jinx marries Esme's fiancé. However, both daughters go through rough patches and end up feeling alone, either emotionally or physically abandoned by the man they love (though it's not always intentional). It's not until the end that both girls end up with the person they dreamed of, and by that time the book has spanned about 20 or so years.There are some Christian undertones in this book, but I do think that anyone who enjoys reading about this period in history (America's Gilded Age) will enjoy the book, even with those undertones. Unlike some Christian authors, Warren does a very good job of making her point subtly and letting the readers enjoy the journey that the sisters take to understanding the message of the book - that in trying to make our own fate in life and love, sometimes we miss the greater picture that God has intended for us."}, {"userName": "Christy", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/4585364-christy", "userReview": "I could go in so many directions with this review to tell you all about the characters, the plot, the setting, the clothes (oh...the clothes), but Heiress is one of those novels that is an experience--in jealousy, in opulence, in tragedy, in love. It's one that, if you know nothing but the back cover blurb, then you are in for the surprise of your life.I knew that Susan was a great writer, even after reading my first book by her earlier this year, but Heiress has catapulted her to favorite author status in no time flat. Just when I thought I was going to hit a lull in this story, she snapped my mind back to attention with one twist after another. Now, I know that some authors usually like to have one surprise lurking somewhere in their stories, but to have them coming one right after the other (and all of them believable, no less) showed that Susan's got some masterful writing chops.Without a doubt, Heiress has to be the edgiest Christian fiction book of the year. It should also come with a warning label--\"Don't start unless you plan to stay up past your bedtime.\"Go. Get. It. Now. I dare you. ;o)"}, {"userName": "April", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/3154123-april", "userReview": "HEIRESS: DAUGHTERS OF FORTUNE by Susan May Warren is an exciting historical romance set during the Gilded Age of 1896 New York City to the untamed frontier.This is book #1 in the \"Daughters of Fortune\" series. It is the story of two daughters of newspaper magnate August Price,their wealth,power,and their deep longings of the heart.One daughter, longs for a desirable marriage, as nd the duties of privelege or does she?The other daughter wants independence,and desires to build a life in the untamed frontier or does she? For sisters,Jinx and Esme,who was raised with the life of wealth,and privelege,they find a life of searching for love, betrayal,adultery,murde for,embezzlement and unrest. \"Heiress\" patterened after the biblical characters of Jacob and Esau. This is the story of a thirst more out of life and searching for love. A great read for any who enjoy inspirational historical fiction,the Gilded Age of America,the wealthy,fame,power,beauty and loyalty.Received for review from the publisher. Details can be found at Summerside Press,and My Book Addiction Reviews."}, {"userName": "Andi", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/45801-andi", "userReview": "I was drawn into this book from page one and didn't stop until I finished the book. I read an interview that Susan gave about this book in Family Fiction that the story was loosely based on Jacob and Esau in the Bible, knowing that drew me in even more. Jinx is \"cut\" out to be an heiress from the tip of her head to the bottom of her toes. She enjoys all of the parties and such, Esme does not. She wants to write and work for her father, but can't get him to notice her. The twists and turns in this book will keep you up until late in the night. The guilded age has never been so fun, and full of intrigue. I highly recommend this book!"}, {"userName": "Charlene Amsden", "userReviewDate": "Oct 06, 2011", "userURL": "http://www.goodreads.com/user/show/5063701-charlene-amsden", "userReview": "If you were an heiress, what would you want your inheritance to be? Esme and Jinx are sisters whose futures have been mapped out for them by their father and society in general. As they both search for love, Jinx embraces the expectations heaped upon her, while Esme rejects them and creates her own future. Their lives unfold in ways neither woman would ever have imagined.Susan May Warren recreates the Gilded Era in rich, dramatic detail and populates it with characters so real you want to take them aside for heart-to-heart chats. This is book one in the Daughters of Fortune series. Stay tuned for book two, if Susan runs true to form it will be even better yet."}, {"userName": "Jeannette Garcia", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/3397303-jeannette-garcia", "userReview": "Drama. Drama. Drama. This is probably the best word that describes this book. There is so much that happens behind the closed doors of the elite. It all makes me wonder how the wealthy have the ability and strength to maintain high social status under pressure. Boy, am I ever thankful we don't really have to worry about all that now. Like many readers, I also was not expecting this kind of story. I was completely thrown for a loop and at some points, I couldn't even handle the story... like killing off certain characters. I'm still not entirely over the death of a certain character. This was a gripping story full of family drama. I'm anticipating what happens next in Baroness."}, {"userName": "Denise", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/5374057-denise", "userReview": "I was so excited for this book by one of my most favorite authoresses. However....a good portion of the beginning of this book had me want to give up on it. The characters seemed so shallow and the story plot I had figured out long before anything happened. I read it out love for the writer. However, toward the end, the story had enough of a twist in it that I'll be sure to be reading the next book in the series. I probably would have anyhow, but at least the ending has me wondering where the story will go next."}, {"userName": "Natasha", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/6805313-natasha", "userReview": "The story of each sister's journey was like a soap opera, the emotions were very exaggerated and sprinkled with quotes from sermons and bible versus. The sisters were interesting characters, but not very likable, well Jinx was not very likable. Moreover, the book was riddled with grammatical and spelling errors seriously taking away from the flow of the story. If you want an easy, fast, cheesy read riddled with romance and biblical references than this is the book for you. However, if you are looking for substance and inspiration please overlook this book."}, {"userName": "Kirk", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/11126901-kirk", "userReview": "This book started off with a very interesting story with many twists and turns and unexpected plots. However, I only was able to read half until I put it down. At chapters 4 & 5 the preaching and pontificating started, and I think this should have labeled a \"Christian novel\". At the half way point the story literally splits into two separate books so to speak, and that's where the author lost me. Disjointed stories fail to keep me interested. Pity tho, as the plot was a very interesting one."}, {"userName": "Freda Mans-Labianca", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/2967441-freda-mans-labianca", "userReview": "Fantastic story!I really enjoyed both sisters, and though I felt sorry for Esme, I really connected with Jinx. I found her to be a very well-rounded character and a strong female lead.I loved the mystery that was in the mix too. The ending wasn't the outcome I expected and for that I am glad. I found myself extremely happy with how it came together. I love a good scandal!Can't wait to read the sequel, Baroness.4.5/5"}], "description": "Book One in the Daughters of Fortune seriesThe beautiful heiress daughters of newspaper magnate August Price have been given everything their hearts desire. But what if they want only to be loved--without an enormous price tag attached? When one daughter pursues a desirable marriage, she secures for herself a comfortable and glamorous life. But among the duties of privilege, will she also find the happily-ever-after she seeks? Her sister rejects the trappings of wealth, choosing instead to build a new life on the still-untamed frontier. Will she find happiness in independence or discover that she's left her heart behind in New York's glittering society? Set in the opulent world of the Gilded Age, each woman discovers that being an heiress just might cost her everything--including the chance for true love.", "title": "Heiress\n      \n          (Daughters of Fortune #1)", "url": "http://www.goodreads.com/book/show/10395554-heiress", "average": 3.74, "cover": "https://images.gr-assets.com/books/1347687415l/10395554.jpg", "reviews": 223, "authors": [{"url": "https://www.goodreads.com/author/show/54106.Susan_May_Warren", "name": "Susan May Warren"}], "type": ["Christian Fiction", "Historical", "Romance", "Historical", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/10395554-heiress", "http://www.goodreads.com/book/show/13216963-heiress", "http://www.goodreads.com/book/show/656048.Happily_Ever_After", "http://www.goodreads.com/book/show/17253180-take-a-chance-on-me", "http://www.goodreads.com/book/show/18232501-it-had-to-be-you", "http://www.goodreads.com/book/show/672779.Flee_the_Night", "http://www.goodreads.com/book/show/19320758-when-i-fall-in-love", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}