{"ratings": 2179, "userreviews": [{"userName": "Anne", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "[In reality in was more like...Sam: The fuck haven't you read any Hellboy?Me: I don't know. I think I may have read some? Where would you suggest I start?Sam: Hellboy, Vol. 1: Seed of Destruction & Hellboy, Vol. 2: Wake the DevilMe: ThanksSam: *grunts*But my version sounds so much cooler! (hide spoiler)]"}, {"userName": "Stephen", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "What the Hellboy happened here!!…It is with deep welling sadness, my fellow comic votaries, that I’m forced to report that this one was a cold miss. And I BLAME this man:\nMr. Guillermo del Toro, if that is his real name, usurped and roont this first volume of the Hellboy series by callously, and with malice aforethought, creating a singularly superior film adaptation of the franchise. With unabashed genius, the man designed brilliant plot changes and installed creative additions that far surpassed the narrative of the source material. In short, gents and gentlewomen, this chap stole the book’s thunder and made it his pig-squealing bitch. I’m going to assume that people reading this have either seen the movie, read the series or been drinking enough that they won’t remember anything I say here both so spoilers will be flying like crap in a monkey house. First, a quick back story/plot synopsis: 1944…WWII…Nazi cultists…goth-dressed…perform spell…open gateway…allied soldiers discover Hellboy…grows big and nasty…now hunts paranasties for covert X-file group…flash forward…Rasputin (yes, that one)…looks mean…says stuff…has evil Kermit the Frog pet…tries to start monsterpocalypse…Hellboy not like…Hellboy smash...The end. Now let’s compare the two versions...MOVIE YEA…COMIC NEA:1. I’m a visual animal. From a purely aesthetic level, I thought the movie was gorgeous. It made me smile. I much preferred the SFXcellent version of Hellboy:\nto the lazy, lackluster, “this would look better if I was on mushrooms” version:\nNow, I have seen some of Mignolia’s art from later in the series and I think it looks pretty terrific. Thus it seems like the later Mignolia offerings may stroke my happy with its greater emphasis on detail and scale. Thus, I remain optimistic with regard to the future story arcs. 2. Sammael in the movie…sensational. All mythological and deified with a sweet Mesopotamian back story and a “you suck at killing me” regeneration and multiplication power going on. He was like a cross between Cerberus, Hydra and a nightmare. A big, fat YEA. Other the other hand, the comic book version of the evil frog monster…lame. No cool back story, no cool rescue from inside a room sized statue, no underwater egg wars. Nothing. A weak ass NEA. 3. Hey Mignolia...where's my sweet, saucy Lovecraftian tie-in:\nWhere are my REAL elder gods like entities. The movie did them perfectly. It had me hoping for a more in depth treatment of the same mythology in the graphic novel. Alas…not to be. Instead we get a silly wannabe group of seven snakes in coffins with a huge helping of pap and hokum. It was heart-breaking. This part really killed me and probably cemented my two star rating. Now, I will give the book one prop in this regard. The quick flash to the aliens monitoring the coffins was a nice touch. It was a complete shock to the flow of the narrative, but it was still pretty cool. 4. The players in the movie were hands down superior to their comic counterparts. Most notably, Karl Ruprecht Kroenen. \nIn the movie, his desiccated zombieness with ninja skills was a major draw in the film. He was like a nasty nazi version of the gimp from Pulp Fiction and he got some major screen time. In the book, he’s an also ran. He does nothing. Plus, Selma Blair brought real fire flair to the role of Liz Sherman and del Toro made her a real boon for the story. In the book, she’s just background noise. In sum, all of these things led to me having an inferior time reading this first volume of Hellboy. I had already seen it done better. FINAL THOUGHTS AND GRIPES:Now, I know it sounds like I hated this book and I don’t want to leave you with that impression. It was just a huge disappointment from what I had expected. Hellboy is a legendary series and one of the most popular non DC of Marvel characters ever created. I wanted to love it. Plus, I sprung for the beautiful (and pricey) Deluxe, over-sized, slip-cased Library Edition of this so I really, really, really was hoping to have a good time with it. I didn’t. It was a failure. By the way, there’s a second story-line in this collection (“Wake the Devil”) that includes some aspects of the movie but basically revolves around castles, crypts and a Vlad Tepes type trying to muscle in on the Earth. It was okay…not great…but okay.Overall, a teary-eyed 2.0 stars."}, {"userName": "Nicolo Yu", "userReviewDate": "Jul 12, 2009", "userURL": "http://www.goodreads.com/user/show/533046-nicolo-yu", "userReview": "Now that Mignola's early Hellboy work is collected in on large format hardcover, I couldn't resist the temptation to add this nice loking tome to my shelf. Opening it to read it, I was impressed still. The large format worked to its advantage. The page size, larger than the standard comic page the material was first printed on, brought the gorgeous detailed work Mignola to life."}, {"userName": "Pinkerton", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/64701643-pinkerton", "userReview": "English (but not so good) / ItalianoLet’s start here, with the nazi project Ragna Rok lead by Rasputin (nemesis of our hero) and his rather bizarre aides. Weirds as Hellboy, his coming and his companions, or as the Cavendish Hall paranormal activities. A bleakly memorable place and important in the best comics mystery series ever.But that’s not all, what kind of horror tales will be without a vampire? Then here Vladimir Giurescu, charismatic character in an awesome story (where there’s even some romance to increase drama) and the presence of others Mignolaverse “excellent villains” seal the masterpiece.ItalianoCominciamo qui, col progetto nazista Ragna Rok condotto da Rasputin (nemesi del nostro eroe) e i suoi alquanto bizzarri aiutanti. Strani quanto Hellboy, la sua venuta e i suoi compagni, o come le attività paranormali di Villa Cavendish. Un luogo tetramente memorabile ed importante nella miglior serie mystery a fumetti di sempre.Ma non è tutto, che racconti dell’orrore sarebbero senza vampiro? Quindi ecco Vladimir Giurescu, personaggio carismatico in una storia eccezionale (dove c’è pure del romanticismo ad enfatizzare il dramma) e la presenza di altri “cattivi eccellenti” del Mignolaverso sugellano il capolavoro."}, {"userName": "Matthew", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/33283648-matthew", "userReview": "Perfection in my opinion. Enough said. 5 out of 5 stars."}, {"userName": "Relstuart", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/2119128-relstuart", "userReview": "It is interesting that some folks have commented that the Hellboy movie was actually better than the same story we get in this book. There is probably some truth to some of those comments. But, the movie writers had the fortune of looking at a much bigger story than that collected in this book. Mignola was still figuring out who Hellboy is and what to do with him when the material in this book was created."}, {"userName": "Fugo Feedback", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/3373829-fugo-feedback", "userReview": "Al fin me leo las primeras sagas de Hellboy en este tomote que recopila las dos segundas. El resultado, relavitamente lo que me esperaba: Buenas historias y buenos dibujos que presagian aun mejores historias con mejores dibujos. \"Despierta al demonio\" me gustó más que \"Semilla de destrucción\" tanto por que cierra más y ata los cabos sueltos que deja la primera parte como por las mejoras estéticas, \"dialoguísticas\" y el tratamiento de los personajes. Villanos principales y amenazas también aportan. Quizás estas historias no me parecieron las maravillas deslumbrantes que anuncia Moore en su introducción, pero sí lo suficientemente buenas como para querer seguir con la historia del Pibe Infierno."}, {"userName": "Robert Risher", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/3485835-robert-risher", "userReview": "I've missed you, Hellboy. Once upon a time, I had them all. I read them all. I lived them in one way or another. I had to pass on my copies to someone else, but here they are again, years later. They snuck up on me like a monster in the dark, or a legacy even darker, and it's about time. It's funny when you can find common ground with a demon...with the Beast of the Apocalypse no less, but it's true. It's all in there. Hellboy has more crap than most to face down, but he does it with a smartaleck quip and a punch to the bad guy's face, or whatever it takes, and he receives plenty of his own lumps on the way. It's more than fighting monsters too. There's plenty of that, of course, but there's plenty of life too. The real kind that we all face. Hellboy's story, over all, is really about how you can't necessarily control where you come from, but you can damn sure decided what to do with it all once you're here. Hellboy's tale from start to finish is one of the best things I've ever read, and I'm glad we're getting reacquainted. It's full of strange places, and dark places, and more weirdness than you can shake a stick at...but its full of satisfaction and inspiration and a sense that everything is gonna be ok, too. I can't wait to finish all over again and see what I've missed."}, {"userName": "Louis", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/19535439-louis", "userReview": "Seed of Destruction and Wake the Devil do a great job of being standalone graphic novels to introduce Hellboy and his realm and to lay the foundation for an epic tale. Story is solid. Characters are great. And best of all: Hellboy isn't invincible (despite always pulling through). Highly recommend if you enjoy some action/occult tales."}, {"userName": "Victoria Hawco", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/64650865-victoria-hawco", "userReview": "Amazing art and a super cool cocktail of mythology. Love Hellboy the Big Red Demon."}, {"userName": "Arlomisty", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/3921533-arlomisty", "userReview": "Another great Mike Mignola story! Have to say he is one of my favorite pulp/ comic / horror writers out there! Once I can afford it I will be buying volume II...."}, {"userName": "Brenton", "userReviewDate": "Jan 07, 2008", "userURL": "http://www.goodreads.com/user/show/177581-brenton", "userReview": "It seems that everyone is jumping on the deluxe collection bandwagon in the comics world these past few years. There has been an abundance of slipcased or hardbacked, oversized reprints loaded with recolored pages, commentaries and extras which have left bibliophile nerds like me salivating, although sometimes it turns out we've been taken for a ride (the \"absolute\" edition of Alan Moore's LXG: Black Dossier comes to mind). Outside the Marvel and DC realms, I can't think of any comic series more deserving of a hardcover, \"deluxe\" treatment than Mike Mignola's Hellboy.The artwork of Mignola is more than enough justification for this deluxe packaging; Mignola's instantly recognizable form, described by Alan Moore as \"German expressionism meets Jack Kirby\", is heavy on contrast and iconism. Characters and settings are highly stylized and colored with simple, bold palates, and are often offset with an abundance of pitch black shadow, and these richly inked pages give Mignola's drawings the most blood-like reds, deepest purples, and blackest blacks, while the oversizing also gives unprecedented access to his precise and unique detail. Something I love about Mignola's style is that he often uses panels, or even full pages of panels, of statuary, foliage and other scenery to set the mood and place the action within a larger setting - it feels like an art film to me, and this deluxe printing beautifully facilitates the effect.Each Library Edition of Hellboy contains two of the standard trade paperbacks, so we have here the two earliest full length Hellboy stories that saw print - Seed of Destruction and Wake the Devil. Added in this volume are two early teaser strips and other early promotional art and a sketchbook section. In Seed of Destruction's four chapters, we see the \"birth\" of Hellboy as World War II wanes, and then the modern adult Hellboy and his family of sorts, the Bureau of Paranormal Research and Defense; we see the rebirth of a twisted mystic who seeks control over Hellboy and claims to have brought him to this earth, and we get a glimpse of the greater mythology that Mignola put together for the series with a healthy nod to H. P. Lovecraft. Mignola was yet unsure of his ability to fully write and draw when he did Seed (having previously only been an artist for various Marvel and DC titles), so fellow comics author John Byrne did the scripting. In retrospect, it shows - once Mike took full reign, he quickly developed a strong voice of his own, a voice which only weakly comes through the more traditional noirish first person narration given to Hellboy by Byrne. In other words, it's not a perfect start, but there's more than enough here to know that the Hellboy saga will be one fascinating and thrilling ride.Wake the Devil spends five chapters dealing with old WWII threats re-awoken by the concluding events of Seed of Destruction, and introduces more elements of the greater Hellboy mythology (also giving us an idea of just how great Mignola's scope is - it's easy to see that, much like Alan Moore uses the world's history of fantastical fiction in his League of Extraordinary Gentleman or Neil Gaiman uses so much of the world's religious mythology in his Sandman series, Mignola intends to incorprate as much world-wide legend and folklore into one cohesive saga as he comfortably can). Wake the Devil is a clear step above and beyond Seed in terms of action, setting, and plot elements, broadening our view of both the full Hellboy universe and the varied forces at work for and against Hellboy within that universe. Sharp readers may want to note that, in terms of original order of publication, there were a handful of shorter stories that Mignola completed between Seed and Wake, and certain events from those shorter stories are alluded to here.Seed and Wake form the basic building blocks of the Hellboy mythology and together with The Conqueror Worm storyline and various interspersed short stories (collected in the second and third Library Editions) make up the backbone of what I see as the first major Hellboy arch-story, in which he is \"birthed\" during the second World War and is later sought by the forces that birthed him (and others that simply want to control him); it is an arch-story concerned with the last vestiges of the Third Reich, with Hellboy's upbringing and interaction with human society (or, his growth into the cynical, wise-cracking worlds-most-famous paranormal investigator), and with the revelation of his demonic pedigree and his very nature, ultimately pitting the concept of destiny against that of free will. The stories can not possibly fail to entertain; Mignola combines Lovecraftian Elder God-like creatures of evil, Indiana Jones-style globe trotting and adventuring, Nazis, the occult, and European folklore and myth to create an extremely rich and entertaining backdrop for Hellboy and his not-always eager search for the truth about his own nature."}, {"userName": "Robert", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/30145663-robert", "userReview": "I like the concept, I love the characters and the world Mike Mignola has created. I had to get used to the art in this comic, but it grew on me because it fits the story very well. At times it was difficult for me to read through the information on every character (because there were a lot of them), but overall it was a nice read."}, {"userName": "Maxwell", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/7651906-maxwell", "userReview": "I have wanted to look at some Lovecraftian stories outside of literature. So, inspired by recommendations and cursory internet research, I tracked down two comics, Fall of Cthulhu Omnibus (which everyone said was terrible, and was even worse) and Hellboy, which everyone said was brilliant and was...pretty good. Anyway, I’m saving Alan Moore’s Providence #1 for a rainy day. The first ‘Library Edition’ collects two complete story arcs, Seeds of Destruction and Wake the Devil. It is one of the better iterations of Nu-Pulp in the comics medium, which embrace high concept coolness, weaving spectacle from referential chimeras (Evil Nazi occultist Rasputin) for chaotic theater less dour and portentous than the garden variety adventure story. This subgenre can be an annoying, smirking farce but Hellboy pulls it off by taking a more adroit interest in its references, actually bothering to detail the folklore and history which give flesh to its rambunctious yarn. I was pleasantly surprised by the Hellboy character, having known him from the Guillermo Del Toro films where he is grumpy and simple with exaggerated macho quirks. Mike Mignola’s Hellboy is quiet, polite and intelligent, more apropos of the Philip Marlowe archetype than contemporary grotesque caricatures of noir masculinity which try to accelerate the traditionally mellow detective character with action movie testosterone, almost always unsuccessfully. Instead, Hellboy is sensitive and clever, if prone to distracting us by polluting every panel with garrulous narration boxes, a ubiquitous stylistic contrivance which has plagued literally every comic book since Frank Miller and Alan Moore engineered its quasi-noir exposition technique in the 80s. Which leads me to my biggest issue with the series, the ceremonial info-dump on every page. Each sequence also includes tedious monologuing which explains the sequence to you, making it difficult to follow the exceptional art in real time, as we drag our heels through the blotted mud passing for description, which is usually superfluous--you can understand a panel just as well (if not better) by looking carefully at Mignola’s drawings, rather than having Hellboy explain to you precisely what is happening as it happens before you. And if Hellboy isn’t perfunctorily narrating the self evident, some faceless BPRD agent will be introducing fifteen new characters by literally handing you a glossary, explaining in an arid dossier the personality and history of the entire rogues gallery. Aside from the clunky narration/exposition, there is much to recommend Hellboy. The art is superb and the ideas are fun and interesting. I don’t know if I’ll bother to get the remaining volumes, though. The series is very long, with spinoffs that proliferate like an epidemic. But I may return to this some day."}, {"userName": "Kate", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/2378632-kate", "userReview": "I've never had the pleasure of reading Hellboy before now and I deeply regret that. I've seen the movies and was pretty okay with them for the most part but they have nothing on the source material. Fantastic art, Lovecraftian paranormal awesomeness, with a whole bunch of sass. I can see why H.B. has the reputation he does in the comic book world and I'm excited for the upcoming ride!"}, {"userName": "Derek", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/61173809-derek", "userReview": "Long time getting into this series and universe, but it was worth it. Now I have so much to catch up and it's all so wonderfully collected. This series is exactly what I've been looking for in the comic medium. Best way I can describe this series in x-files/Indiana Jones/HP Lovecraft horror. Love it!!!"}, {"userName": "Jamil", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/75853-jamil", "userReview": "Oversized edition is pretty nice. Sewn binding so it won't fall apart like the trades (two of which are collected in each hardcover \"Library Edition\" it seems). Interesting to see on the reread how different early Hellboy (scripted by John Bryne) is from the Hellboy we've all grown to know & love. I like how Seed of Destruction is dedicated to both Jack Kirby & H.P. Lovecraft - Mignola wearing his influences nakedly."}, {"userName": "Ryan Milbrath", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/6002907-ryan-milbrath", "userReview": "I can not say enough good things about the artwork and colors in this particular comic book collection. The drab colors, black and white contrast, and six panel layout really enforce the dark, noir, \"lovecraftian\" theme of the graphic novel. Although, personally, I prefer stories that do not focus on traditional gothic themes, I did enjoy this particular piece of wrok from Mignola."}, {"userName": "Randy Lander", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/173561-randy-lander", "userReview": "The early Hellboy stuff, done in huge oversized format to match the Art of Hellboy books. It's a gorgeous book with amazing production value, and Mignola's story and art is terrific. I'm hoping for a BPRD series featuring Guy Davis, although not expecting that'll actually happen."}, {"userName": "Dustin Boggs", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/54450891-dustin-boggs", "userReview": "I did not enjoy it as much as I think but I probably need it again to fully appreciate."}, {"userName": "Stephanie Jobe", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/7984922-stephanie-jobe", "userReview": "So I picked up these books on Halloween last year…I bought the entire library edition set. I think that is a good way of testifying that you know you will love something. It also makes them a little overwhelming in your to be read pile. I finally quit procrastinating. It was everything I’d hoped for and more.I’ve always loved Mignola’s art. I find it funny that he is described as an artist’s artist because I definitely am not an artist but have always found it irresistible. I can’t even tell you what it is. I do think at least part of it would be that he does not fear darkness. I’ll try to break it down by the contained books a little bit…Seed of Destruction: Weird reason to love Hellboy: He thinks about damage to the architecture in a fight. Quip isn’t the right word but his dialogue both internal and external just struck me as wonderfully distinct.As someone who has been aware but not educated I kept wondering what the heck was up with all the frogs, well now I’m starting to get it. There are some things that clicked but more that just made me die of curiosity. The other things, not the seven, that are shown in the other dimension.Seriously, even the black and gray pages stop me in my tracks. (Side note: I’m also realizing that reading these is probably going to make my tattoo desires even worse.) Maybe at some point I’ll figure out the woman and the ape in the little circles at the beginning of each Chapter.Wake the Devil: Weird things that Hellboy makes me ask: What does Romanian food taste like? I think moments like that are what make Hellboy already feel more like a person than a great number of human characters that are out there. It’s interesting reading this as someone who has seen the movies and already met some of these people, to see what is different and what is the same. Though I feel like pretty quickly even into the first story I threw it all out the window.As they struggle with their tech (and yes it took a moment for me to make the connection for those who know the world) I had to remind myself. It’s the 1990’s. I was approximately 4 when Mignola drew that first version of Hellboy.There is a reason that in my mind Hellboy has existed forever and it was hard to imagine diving into. Also they have jet packs! Kinda…I love vampires so I think it was easy for me to get invested in this story. Also the building of a supernatural arsenal has always fascinated me. I feel like I’m getting to see the trials and errors of the Nazi attempts but in reverse. I know this is just the tip of the iceberg, but not just because of the other books sitting on my shelf, because there are little tidbits in here that make me think “tell me more.”Confession: I was actually recommended to start in Volume 2 with the more short stories. I didn’t listen. I can see why it was recommended that way because this starts out heavy. You don’t get a lot of time to invest. I definitely enjoyed it fine, but I can see the logic.The two promotional stories are kind of interesting as a toe dip into the universe, but I found the rest of the back matter actually more interesting. Mignola captioning his sketches so many years later is so relateable to me. When I go back and look at my writing I feel like I would sound about like that…Original Review on my Website (with pictures!)"}, {"userName": "Justin", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "As a long time fan of Mike Mignola's Hellboy series (as in, back to Hellboy's initial appearance in John Byrne's Next Men), I've been waiting for a collection that did justice to Mignola's incredible artwork. As soon as I set my eyes on the Hellboy Library Edition, I knew my wait was over.Similar to the Sin City Library collections, the Hellboy Library Edition is a larger than normal hardcover size. Think of the DC Absolute hardcover series; this book is just slightly smaller than that format. As if the extra large presentation weren't enough, the page stock has been significantly upgraded. The pages are thicker than most cover stock, and they have a glossy finish that perfectly showcases Mignola's unique (and gorgeous) artwork. Each page truly becomes fine art. The pages are also very resistant to fingerprints, which is especially important given the amount of black Mignola tends to use. I can see some collectors having a problem with the cloth-like cover of this volume, but I think it suits the book quite well.In this hefty first volume you get the complete Seed of Destruction and Wake the Devil stories plus a nice helping of bonus material, including promotional artwork, shorts, and sketchbook artwork. Seed of Destruction is, of course, the Hellboy origin story and the basis of the 2004 Hellboy film. Wake the Devil is the sequel story, and served as the inspiration for the animated Hellboy feature Blood and Iron.With its high price tag, the Hellboy Library Edition collections are not for everyone. They are however, a must-have for serious Hellboy collectors. Once you see the quality of the book, you won't think twice about replacing your Hellboy paperback collections."}, {"userName": "Jonathan", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/61779837-jonathan", "userReview": "The entire Hellboy universe starts here! With gorgeous art, a story that is a mix between the adventures of Indiana Jones, and pulp horror and the incredible large format of the Library edition make this volume a must buy for graphic novel fans. Readers familiar with the first Hellboy movie will find some common elements with the two stories contained in this collection however Mignola's art creates a strong connection between the graphic novel format and the story itself. Acting as both an origin story and the building blocks for the Hellboy universe this volume succeeds on both fronts. Mignola only hits the tip of the iceberg here as characters and the larger universe are developed. This does not take away from the core story of Hellboy battling against evil forces seeking to destroy the world. A fantastic start to a compelling character and universe. 5 stars."}, {"userName": "Robert Timmons", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/61482980-robert-timmons", "userReview": "Hellboy was summoned to earth during World War II as part of a dark Nazi experiment. But he's not a villain, he was adopted by a man who would go on to lead the BPRD (Bureau for Paranormal Research) where Hellboy is a detective. This leads to Hellboy investigating various Paranotmal crimes and to have encounters with Lovecraftian monsters. This volume sees Hellboy chase Rasputin who I assume will be an ongoing character in the series. I really enjoyed this Library edition which collects the first two trade paperbacks. The art is amazing, with a distinct dark and gothic feel feel. The facial features are not incredibly detailed at times but the use of black background and shadows is amazing in every panel. I did not need the book to be this large, it's pretty difficult to read when the book is too big to fit on my bookshelf! Anyway, five stars from me ⭐️ ⭐️ ⭐️ ⭐️ ⭐️"}, {"userName": "Rolando Marono", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/65310071-rolando-marono", "userReview": "The good:-Mignola posesses an amazing quantity of super natural culture and myths knowledge.-The neo-noir narration is very good with the setting and the tone of the story.-Hellboy design.-Mignola art is incredible.-The plots are interesting.-Mignola chose to start telling his story in the middle, Hellboy already being Hellboy for 40 years, so there are a lot of mysteries to unravel. He teases them very well.The bad:-Sometimes, the super natural things were so unbeleivable that I didn't understand what was happening and why was happening, then I get used to the fact that ancient gods, mythical witches, old demons and other creatures can emerge at any moment.-Too little facts about Hellboy in this volume. I expect that his personality and backstory got more fleshed out in the next stories."}, {"userName": "Megan", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/4743132-megan", "userReview": "Hellboy Vol 1 collects the first two arcs of the Hellboy comics (except for short stories collected in Vol 2), and for those of you just starting out on Hellboy, I think Hellboy and the BPRD: 1952 might be a better introduction. Hellboy is one of those series that has generally gotten a lot better as time went on and Mignola improved his craft, and John's Byrne script in Seeds of Destruction was cringe inducing at times. That said, Seeds of Destruction and Wake the Devil aren't bad, and it's fun for a relatively new Hellboy fan to take a look back and see what it was like in the beginning. The Library edition of course contains a lot of fun bonus material, and is just a gorgeous piece of art in its own right."}, {"userName": "David", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/35626800-david", "userReview": "An excellent start to the Hellboy comic universe. Mike Mignola does a great job setting up the broader narrative while introducing us to Hellboy, his BPRD colleagues and an assortment of Nazi enemies. The mystery of who Hellboy is and his place in the universe is slowly revealed and I look forward learning more in future volumes. The Library Edition format really makes the art pop although the unique style takes a little getting used to. It's rewarding to know that there are so many subsequent volumes available. With so many current comics failing to develop long term story lines, I'm looking forward to immersing myself in this world."}, {"userName": "Josh Angel", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/16771171-josh-angel", "userReview": "A great beginning to a great series. These early stories are a little “rough” but even the seemingly minor stories are important to the overall mythology, and will be called back to in future volumes. Steeped deeply in World War II events, Hellboy to me is more “creepy” than scary. Mike Mignola’s art here does not play to his strengths, which while very pretty and stylized, is better suited IMHO to covers and character design rather than interiors. Future volumes are better, as characterization improves."}, {"userName": "K De", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/6173321-k-de", "userReview": "A beginning to the life of Hellboy as witnessed by the creator Mike Mignola. See and appreciate the distinctive artwork and writing by Mr. Mignola. The Hellboy universe is still going strong and still as creative as the first issues that were written by Mignola. I certainly enjoy the Lovecraftian influence on the universe he has developed as well as the distinct Jack Kirby styled artwork. Check it out!"}, {"userName": "Andy Dixon", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/56916670-andy-dixon", "userReview": "This is a great collection of Hellboy material. The binding and size are PHENOMENAL. The only issue I have with this Library Edition series is that some of the stories are out of order, but at least they are still in the collection."}], "description": "Book by Mignola, Mike, Byrne, John", "title": "Hellboy Library Edition, Volume 1: Seed of Destruction and Wake the Devil\n      \n          (Hellboy #1-2)", "url": "https://www.goodreads.com/book/show/2338283.Hellboy_Library_Edition_Volume_1", "average": 4.46, "cover": "https://images.gr-assets.com/books/1403200131l/2338283.jpg", "reviews": 125, "authors": [{"url": "https://www.goodreads.com/author/show/10182.Mike_Mignola", "name": "Mike Mignola"}, {"url": "https://www.goodreads.com/author/show/15083.John_Byrne", "name": "John Byrne"}], "type": ["Sequential Art", "Sequential Art", "Horror", "Graphic Novels Comics", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/2338283.Hellboy_Library_Edition_Volume_1", "http://www.goodreads.com/book/show/15768859-biblioteca-di-hellboy-n-1", "http://www.goodreads.com/book/show/11156311-hellboy", "http://www.goodreads.com/book/show/102458.Hellboy_Vol_1", "http://www.goodreads.com/book/show/102461.Hellboy_Vol_3", "http://www.goodreads.com/book/show/102459.Hellboy_Vol_2", "http://www.goodreads.com/book/show/102460.Hellboy_Vol_4", "http://www.goodreads.com/book/show/102462.Hellboy_Vol_5"]}