{"ratings": 142, "userreviews": [{"userName": "Rudolf Waldner", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/11369062-rudolf-waldner", "userReview": "This book was terrific! Even though I'd been to Key West before and seen many of the Hemingway haunts, this book took me back and shared new insights. I enjoyed the back stories about the author and his crew. I enjoyed the suggested walking tour. In short, because of the perspective presented in the book by Mr. McIver, I'll be returning to Key West sooner than later, even though I've been there more than a few times before.Rudolf J WaldnerThe Corporate Jungle: Animal Personalities Colliding with Job TitlesMarketing from the Trenches: Your Guide to Retail Success"}, {"userName": "Michael", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/17436756-michael", "userReview": "I like reading about Hemingway more than I like reading Hemingway. And the more I read about him, the less I like him as a person. He was a bully, a womanizer, a poor sport. But he could write,and he wrote in Key West. And I really like Key West. My wife and I honeymooned there.Reading this book was fun because I got to revisit old stomping grounds.I would recommend this book to anyone who wants a thumb-nail sketch of Papa in Key West. And it gives a decent walking tour of the city. Whether you like Hemingway or not, the truth is thatPapa could live without Key West, but Key West could not live without Papa. His spirit permeates the island."}, {"userName": "E.C. Frey", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/10171201-e-c-frey", "userReview": "An entertaining and engaging read. Hemingway's words are legendary as is his reputation, but this book offers a glimpse into what made the man tick. His suicide is often attributed to his bouts of depression and his \"writerly\" life. Knowing what we know now about head trauma, his numerous and severe concussions are highlighted in this book and showed me another side to the story."}, {"userName": "Patty Gilson l", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/10811532-patty-gilson-l", "userReview": "If you enjoy Hemingway and his connection to Key West, you will enjoy this book."}, {"userName": "Mike Prochot", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/4813812-mike-prochot", "userReview": "Assorted facts, fables and yarns about E. Hemingway in Key West. Worth a read if you are new to Key West and slept during literature class and are wondering what all the hubbub is about the guy with the beard.Nothing new here, but the walking tour suggested is kind of fun to check out."}, {"userName": "Andy Kristensen", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/7326554-andy-kristensen", "userReview": "Great introduction to Hemingway's time in Key West. The chapters are a little scattered and lots of major information is repeated throughout various chapters, but the information provided is both very interesting and informative."}, {"userName": "Anne  (Booklady) Molinarolo", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/3615945-anne-booklady-molinarolo", "userReview": "2.5 Stars, Not what I ExpectedReferred by author and friend John Dos Passos as just the place for \"ole Hem...to dry out his bones\" after spending another brutally cold, wet winter in Paris's Left Bank, Ernest Hemingway and pregnant second wife Pauline landed in Key West in the spring of 1928. It was just supposed to be vacation stop before traveling to north to Pauline's ancestral home in Arkansas to give birth to their first child. But a delay in the arrival of the yellow Model A Ford roadster (a wedding gift from Pauline's wealthy uncle Gus) gave the author the time to fall in love with the small town that he dubbed the \"St. Tropez of the Poor.\" For the next decade Ernest Hemingway would write, fish, drink, and end his second marriage in this island town. And Key West would remain his most productive work environment on American soil. Among the palm fronds, bougainvillea, hibiscus, oleander and other tropical foliage outside his studio on the second floor carriage house Hemingway completed such works as A Farewell To Arms, Death in The Afternoon, Winner Take Nothing, The Snows of Kilimanjaro, The Short Life of Francis Macomber, and his Key West novel To Have And Have Not.Florida historian and author Stuart McIver title promises the reader an adventure, but delivers a hodge-podge non cohesive book about Hemingway or of Key West during the time the great author lived there. Why was this decade Ernest Hemingway's most productive? What was the \"it\" Key West possessed that Ernest found his words flowing at around a 7 pencil day rate? Why Papa got on well and kept his Key West friends (the Mob) as life-long friends but lost many of the \"out of town talent\" mob members? How his marriage and later his divorce to Pauline changed the townspeople from supporting him to support Pauline, thusly diminishing slightly some important lifelong relationships to his \"Key West Mob\"? McIver fails to answer these questions adequately or he fails to answer these questions and repeats facts and events from other chapters. Also McIver glosses over two cataclysmic events that had profane effects on the great author: the Great Labor Day Hurricane of 1935 and the meeting and subsequent affair with Martha Gellhorn whom eventually became Ernest's third wife.I found the chapters on Hemingway's beloved boat Pilar (named for the daughter he desperately wanted but could never have) and his deep sea fishing very enlightening as well as the Walking tour of Papa's Key West, but the chapters on Cuba and the Key West of today didn't really enhance or fulfill the promise the author gives the reader: full answers as to why Hemingway loved Key West and was the most productive in that island city and his relationships he developed there. As a Florida resident many of anecdotal stories told in this short volume are widely known and probably to the Hemingway aficionado."}, {"userName": "Anilou", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/27180332-anilou", "userReview": "Papa's DigsOf all the books I could have chosen to shed light on one of the greatest American novelists, this was everything I hoped it would be. I'm deep into a collection of Hemingway's short stories, and this book shed light on its complicated author, his genius and insanity, his courage, his many loves, and his way of tackling life head on. Hemingway was hard living and a heavy drinker and shed one wife only to remarry in short order. On my list of vacation destinations, his Key West home is at the top. This book will surely enhance my experience. I look forward to meeting the latest generation of his six-toed cats as well. I am so happy to have read this beautifully written story, told without judgment but with a good deal of admiration for his contributions to the world of writing."}, {"userName": "Brian Findley", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/14417973-brian-findley", "userReview": "I received this book as a gift because of my interest in both Hemingway and Key West. It reads more as a series of short, poorly-written pamphlets that are redundant and thrown together. Sure, there were one or two things I picked up that I didn’t know before, but there are much better books on both subjects available. I would only recommend this to someone who had no knowledge of the subjects, needed a quick read and didn’t care about the quality of the writing."}, {"userName": "Shaunaly ~  (A Book Away From An Episode Of Hoarders)", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/4685485-shaunaly-a-book-away-from-an-episode-of-hoarders", "userReview": "Not what I expected. Most everything noted in the book was your typical description of Hemingway, if you're a Hemingway fan that is. There was no depth to it and many aspects of his life were repetitive throughout the book which was the only thing in it that actually raised my eyebrow. Boring? Yes. But if you're unfamiliar with Hemingway and are inquisitive to learn of his life's journey and his ties to Key West, than you'd probably enjoy this very quick read."}, {"userName": "Pam", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/4209094-pam", "userReview": "Bought his when visiting Key West and it was probably not the best choice. It was supposed to be factual and what was in it was interesting but there wasn't anywhere near the amount of information I thought there would be and it was written very badly with many repetitions (possibly to make it look like there was more to the book than there was)."}, {"userName": "Baglady", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/21498274-baglady", "userReview": "not a travelogue, not a biography, not really much of anything. Many redundant entries under different chapters, as if each was originally meant to stand alone and no one read the book after it was put together."}, {"userName": "Chris", "userReviewDate": "Feb 03, 2008", "userURL": "http://www.goodreads.com/user/show/184648-chris", "userReview": "This may be the worst book I've completely read. It lacks quality content. There's no cohesiveness; the author repeats himself over and over. How it made it to print is beyond me. Proves that any can write a book."}, {"userName": "Steve", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/7175460-steve", "userReview": "A good reference. Yes, it backtracks and some information is repeated. True, the chronology is not correct and sometimes dates and wives seem out of place. Pull from this instead an essence of the man, not the minute imperfections of the written account."}, {"userName": "Carol", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/7214494-carol", "userReview": "Learned a few things about Hemingway and Key West, but this book seems to be short stories pulled together."}, {"userName": "Alphawoman", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/7398189-alphawoman", "userReview": "This book read like an assortment of essays regarding Hem's years in key west. very repetitive."}, {"userName": "Molly", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/6563159-molly", "userReview": "I enjoyed the flashback to old Key West. It was a bit repetitive with some of the facts but it was sometimes helpful in lining up separate stories."}, {"userName": "Becky", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/1642101-becky", "userReview": "I received this book as a gift before my trip to Key West. It details Ernest Hemingway's time in Key West, The Bahamas, and Cuba. It's informative if not lyrical."}, {"userName": "Ron", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/7028840-ron", "userReview": "Covers the topic rather well for a guide-book, but does get a bit repetitious at times."}, {"userName": "Patricia Baker", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/11220424-patricia-baker", "userReview": "short book about assorted facts regarding Hemingway and Key West. living here now and appreciate the street references. also the chronological events listed in back of the book"}, {"userName": "Michele Cacano", "userReviewDate": "Jul 11, 2014", "userURL": "http://www.goodreads.com/user/show/5911722-michele-cacano", "userReview": "Useful and informative. Taking a trip to Key West soon and this was just what I was looking for."}], "description": "This vivid portrait reveals both Hemingway, the writer, and Hemingway, the hard-drinking, woman-chasing fighter and sportsman of legend. Hemingway's decade in Key West during the 1930s was his most productive. His only book set in the U.S., To Have and Have Not, takes place there. Meet his circle of friends (known as \"the Mob\"), his second wife, Pauline, and their two children. Hear from Hemingway contemporaries and scholars about the man and the town that he made famous. This edition includes a record of the author's exploits in Bimini and Cuba. Accompany Hemingway on fishing expeditions in the Gulf Stream and to Cuba and Bimini aboard his custom-built boat, Pilar. Learn of his doomed love affairs, his patriotic activities during World War II, and his writing experiences in an old farmhouse in Cuba.Filled with photos (some of which were not available in the first edition), this book also includes a two-hour walking tour of Key West and a tour of Hemingway's favorite Cuban haunts. A treat for Hemingway fans!", "title": "Hemingway's Key West", "url": "http://www.goodreads.com/book/show/104236.Hemingway_s_Key_West", "average": 3.33, "cover": "https://images.gr-assets.com/books/1328753083l/104236.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/60257.Stuart_B_McIver", "name": "Stuart B. McIver"}], "type": ["Nonfiction", "Biography", "History", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/104236.Hemingway_s_Key_West", "http://www.goodreads.com/book/show/18963121-hemingway-s-key-west", "http://www.goodreads.com/book/show/971745.Death_in_the_Everglades", "http://www.goodreads.com/book/show/6436662-murder-in-the-tropics", "http://www.goodreads.com/book/show/2741616-dreamers-schemers-and-scalawags", "http://www.goodreads.com/book/show/15837093-glimpses-of-south-florida-history", "http://www.goodreads.com/book/show/2741620-coral-springs"]}