{"ratings": 118, "userreviews": [{"userName": "Beth Barany", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/4470008-beth-barany", "userReview": "I absolutely loved this book! I wrote it! The sequel is on its way! [UPDATE] The sequel was published in 2014 and now the third and final book in the series is out now!"}, {"userName": "Jessica", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/3345952-jessica", "userReview": "I need to start this review by saying that I absolutely adore Henrietta's character! Thank you to Beth Barany for writing such a spitfire and strong female character. Henrietta isn't the type to back down from a fight, but she also won't go looking for them either. She's strong enough to know who she is. On top of that, despite her renown as a dragon slayer, Henrietta can't stomach the thought of another kill. All she wants is peace and quiet. That is, until she is swept off on another epic adventure! Henrietta was a breath of fresh air in a sea of whiny female characters. I'm smitten with her.Along with Henrietta, we meet her motley crew of adventurers. From a knight with an acidic attitude, to a court jester who just wants to tag along for the stories to tell, they are an amazing group of people. I enjoyed that Barany allowed them to each be so different. The interactions between them are fun to read, and they each bring a little bit of their expertise in various areas to the story. Best of all, each character is explained enough to feel as though you know them, without being overly done. Perfection.There were only a few things that kept this book from being on my list of absolute favorites. The first being that there wasn't very much dragon slaying action. From the title, I assumed (which you should never do I know) that there would be epic battles in this story. In fact, most of the battling of dragons is done in the stories that are told about Henrietta's past. I kind of understood why this was. Henrietta wasn't eager to dive into the battle at the beginning of the story, and so it does make sense that she wouldn't want to get into any trouble if she could avoid it later on.The other thing I really missed was world building. Although this doesn't really take away from the overall story, which is fantastic, there wasn't very much said about where Henrietta's story was actually taking place. References are made to forests, plains, etc., but you never know much more than that. As a lover of fantasy I'm a stickler for good world building. I'm hoping that since this is the first in the series I'll get to know a bit more about Henrietta's world later on!Honestly, Henrietta the Dragon Slayer is an excellent read! As I said it is the first in a series, so there will be more of stoic Henrietta and her adventures. I cannot wait! I look forward to seeing where the story takes her, and applaud Beth Barany for writing such a strong character."}, {"userName": "Brittany", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/4940552-brittany", "userReview": "The book is a beautiful story about friendship, a heroine, and a quest to kill a dragon. Who wouldn't be excited? The entire concept sounded interesting and I was not at all disappointed. The character of Henrietta was quite different from all other characters I have read about. She was very tough and stubborn. Rarely, if ever, did she show her soft side. I found myself actually liking her a lot. She was a very strong leader and hero. Usually, the main character in books I read is weak and kind of whiny. Henrietta on the other hand, was a nice change.As for the plot, it was good but I felt as if it were lacking a bit. I was really hoping to see at least some fragments of a love story, but unfortunately there were none. Only towards the end of the book could I start to see some love emotions developing. There also wasn't a whole lot about dragon slaying or dragon slayers. Thankfully, it didn't take away from the story. The ending was perfect and wrapped up the story nicely!Beth's writing style was extraordinary! I really felt as if I were following Henrietta and her crew on their journey, due to the detail that Beth captured. I hope to read more of her books in the future!Overall, this book was great and I highly suggest it to those who like adventure and fantasy. It is hard to capture the book in this review, so I recommend you reading it yourself when the Kindle Edition comes out on February 28th!"}, {"userName": "Lunamoth", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/3050875-lunamoth", "userReview": "Henrietta the dragon slayer is a charming book set in a fantasy world. Henrietta has slayed many dragons in her short life and has resigned not to take any more jobs, but when a pushy knight named Franc implores her to follow him to his lands and slay Mimoto the dragon she hesitates, until she learns her mentor, Master Chen is sick and only the Dragonitas from Mimoto can save him does she embark on her quest. The cast of Henrietta, The dragon slayer consists of Henrietta, the firey warrior woman with a sharp tongue and stubborn attitude. The stoic and harsh knight Framc, Jaxter the jester and a witch-girl Paulette. Unlikely traveling companions, they mesh well and no personalities comflict with anothers. Each person has a distinct personality and I found myself really likeing them all. As far as writing goes, Henrietta The Dragon Slayer is fluid, easy to read and reads well. There is no swearing and no sexual content, there is a little action but no bloodfests. Though it says 'dragon slayer' in the title, you wont see Henrietta fighting any, we hear of her exploits in Jaxters tales only. The world in which they reside is not explained in great detail but I did not mind this so much, Barany did not hamper the writing with telling about every single rock and tree the companions come across. As far as young adult fantasies go, Henrietta, The Dragon Slayer is a good read that I think any age, teen to adult, would enjoy. I only hope a sequel is in the works!"}, {"userName": "Lindsay", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/4337141-lindsay", "userReview": "This book was fun. No doubt about it. And I can definitely get behind a strong female lead, which Henrietta is. I'm just not sure if I like her much. Actually, none of the characters were overly likeable. They did begin to grow on me, but it took a long time to get there.The book, to me, felt like it was half formed. Don't get me wrong, it's a wonderful vision. It just needed to go a little further. For example, I wanted to know more about why Henrietta was no longer slaying dragons. How did she get to this point?? Some terrible thing is hinted at a few times, but never developed. I WANT TO KNOW!I may be nit picking a little, but Henrietta's stomach bothered me. She was constantly having indigestion, to the point that I wondered if someone was poisoning her. Was this an abandoned plot point or just a limited way of saying that she had anxiety issues?On a plus side, I often have a hard time reading indie books when the copy editing has been skipped. I am pleased to announce that the typos in the book probably numbered less than 20. No, I wasn't counting, but it made for a much smoother flow to the book.Overall, I would recommend this book. It should have been longer, to allow the characters the time they needed to develop, and the plot the time it needed to fill out. But in the end, it was a good teen read, and I can imagine many a young girl wishing they were Henrietta, the Dragon Slayer."}, {"userName": "April", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/3154123-april", "userReview": "HENRIETTA, THE DRAGON SLAYER by Beth Barany is a YA paranormal/fantasy.The first in the \"Five Kingdoms\" series.It is written with depth and details. The characters are interesting,compelling and will capture your heart. Henrietta is a young,fiery,female dragon slayer,who we never see slay a dragon,only hear of her exploits through others,but she does not want to slay dragons any longer.Franc,a knight who is very pushy,is sent by the king of Plumaria to enlist Henrietta's help to slay the dragon,Mimoto.When Henrietta,is approached for the task she first refuses until she learns that her mentor,Master Chen,is sick and dying and only one of the Dragonitas from Mimoto can save him,she then agrees.Henrietta,the dragon slayer,Franc,the knight,Jaxter,the jester,and Paulette, the apprentice witch set out on an adventure that includes hardships,friendship,and slaying a dragon along their way to Plumaria.This is a good,fun read for young adults and older adults also who enjoy magic, fantasy, mysticism, dragons,and little to no violence. This is a fun summer read.This book was received for the purpose of review from the author and details can be found at Firewolf Books and My Book Addiction and More."}, {"userName": "Graeme Ing", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/7591695-graeme-ing", "userReview": "This is a fun book with all the essential elements of a YA quest adventure. We have the feisty heroine on a mission to save her mentor, a trainee witch, a noble knight and a food-obsessed bard/jester. Henrietta's mission gets more complicated as it goes along, and it is paced well. There are some good sword battles, a dragon, magic, a sea journey... all good stuff.The characters are well described and play well off each other, and not always in a good way, which brings a constant sense of drama to the quest journey. The author brings the world to life with exciting details, wonderful names for people and places, and snippets of song and legend. I felt invested in the world, but thankfully the author didn't overdo the description, and avoided the trap of verbose backstory and an account of every town and river. Good job.What stopped it getting 5 stars, for me, was the author's habit of revealing a little too much, whereas I felt the reader, even the YA reader, should have the satisfaction of piecing together some of the plot details stated in the narrative. That, and the ending felt a little haphazard, especially concerning the magic.It didn't ruin the ending though, and there's a satisfying major twist. A fun read."}, {"userName": "Anastasia Pergakis", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/3774160-anastasia-pergakis", "userReview": "I’ll be completely honest and say I was a bit leary about it at first, as I’m not a fan of books about slaying dragons! I love dragons too much. BUT, never fear, no dragons were harmed in the making of this book! I have to say I really enjoyed reading this story. Henrietta is exactly the type of heroine I love to read about. She can handle her self in a fight but that doesn’t mean she necessarily goes looking for trouble either.Henrietta is a girl that can’t stand the thought of killing one more dragon – or anything for that matter. She simply wants to live her life. But, when her mentor falls ill she is forced into a quest to get a healing stone to save him. But that requires one more kill. Can she do it!? Well, you’ll have to read the story to find out!It was a great read – I read it in one sitting. The dialogue and really the whole tone of the book made for excitment from the first line. Beth Barany did a fabulous job grabbing me right from the beginning with this story. I highly recommend this story to anyone who is a fan of fantasy and kick-butt heroines. It’s really a great book to have in your collection."}, {"userName": "Tami Winbush", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/931676-tami-winbush", "userReview": "Reading about Henrietta and her three unusual companions gave me pause for laugh and contemplation. Their bond went from unsure to friend so seamlessly I nearly missed it. I truly enjoyed Henrietta learning who she was and how that fit into how people saw her now. Franc became the hard headed male you love to love and you don't even know why. Paulette truly scared me for a while. I didn’t know what to think of her and her fire-talent and rage.Jaxter, always the glue that held the group together, was a joy to learn and get to know.Beth Barany has made a world where unlikely friendships rule and being a friend means more than you can know."}, {"userName": "Tahlia Newland", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/4130800-tahlia-newland", "userReview": "This is a great book and a wonderful addition to the ya fantasy market. Henrietta is a tough cookie and a delightful character, but what is really great about this book is the way she develops as a person through the story. A nice cast of supporting characters too, all growing as the story progresses. The interactions between them are very well done. Definitely one to read if you like this genre. The story is refreshingly different to a lot of others around too."}, {"userName": "Shabnam", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/54494941-shabnam", "userReview": "Synopsis :Henrietta, the legendary Dragon Slayer of the Kingdom of Bleuve, can't stomach the thought of one more kill. Yet, in order to save her dying mentor, she must go on one last quest. But will the quest for the healing stone be derailed by misfit companions, seasickness, and an egomaniacal king? And will she be able to cut past her conscience and kill the dragon?Rating : 4/5Review : When we come across story books based on bravery, it is always a gallant, invincible, handsome man who is the leading character and the representative of strength and bravery. To come across ass kicking dragon slayer is very rare that also a woman! The story begins with Henrietta, the legendary Dragon Slayer being almost forced by Sir Franc, knight to the Royal and Mighty King Singfan de Plumare de'Oro, the First, to come out of her life of retirement into dragon slaying once again. She gets mocked by him, is accused of false storytelling yet doesn't agree to accompany him. However, she is that very night informed of her master's illness. The solution leading to the same tasked the knight wishes her to assign to. She takes a little witch, Paulette along with her, whom she is supposed to drop to her own village on the way,  and starts for the journey but is joined unwilling to her choice by the knight, Franc and the jester (an old friend of Franc and admirer of Henrietta), Jexter; all towards the way hunt for Dracontias - Franc's has demanded for it and Henrietta is in need of it to save her dying mentor.As they travel far and across lands, they face danger, betrayal, killing and misery. But the new found bond between the four is unbreakable. The betrayal makes Henrietta doubts King Singfan's aims in getting hold of the Dracontias yet she does not back up. She hears the Guardians of the Dracontias to recognise herself, to save all. Though she enters the palace and confirms the deal with the King she senses immense danger and before killing the Dragon she backs off. What happens next is not my tale to tell but the reader's curiosity to discover. This book kept me glued till the end and keep my heart beating fast. I totally am in love with the pairing of Franc and Henrietta cause why should I? It's so exciting! Thanks to the author for introducing me to such a luscious, exciting, adventurous read. Can't wait to dig into​ the next book.For those who love kick ass female lead characters with great adventure and fights as also some romance to brighten up the mood, I totally recommend it."}, {"userName": "Bonnie Keck", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/59802997-bonnie-keck", "userReview": "Not kindle unlimited, read the prequel {listed at bottom of all this} and then found had the #1 book, which didn't like as well as the prequel but then again those are made to be short and if you realize it is prequel obviously there is only so much going in to it, but a lot considering but liked this.She's a legend at 17, but only Henrietta knows the price she paid for her fame ... and it was much too high. Henrietta, the legendary Dragon Slayer of Bleuve, can't face the thought of another kill. She's lost family, friends and home on her rocky road to fame. But when the young warrior is summoned by a King to retrieve the Dragon Stone from the last dragon in existence, she can't refuse--her mentor lies dying, and the healing stone is all that can save him. This quest will be her most harrowing of all, for it means facing mysterious assassins, the dreaded choppy sea, and all with a misfit band--a young witch, a jester and a surly knight. And at journey's end, someone must die ... the dragon, or Henrietta.{Also has Henrietta the Dragon Slayer: A very short PREQUEL}Updated edition! Henrietta Dragon Slayer seriesHenrietta The Dragon Slayer, Book 1Henrietta and the Dragon Stone, Book 2Henrietta and the Battle of the Horse Mesa, Book 3"}, {"userName": "Gladys", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/60886838-gladys", "userReview": "Henrietta the Dragon Slayer by Beth Barany is book #1 in The Five Kingdoms series. This was a very good book. I really loved that it had a strong female hero. Henrietta is only 17 and legend. The road she has traveled been far from easy and it has cost her too much. She is tired and wishes to be left in peace but when the King calls you must answer. This is an engaging book that is full of adventure, humor and emotions. I enjoyed this book and eagerly look forward to the next book in the series. I voluntarily reviewed an ARC copy of this book."}, {"userName": "Kelly Peterson", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/36190171-kelly-peterson", "userReview": "I received and e-copy of this book from the author which in no way influences my opinions expressed below.This review was originally posted on Live, Love, Read.https://livelovereadya.wordpress.com/...As a whole, Henrietta The Dragon Slayer was a wonderful book. I loved Henrietta as a character and I truly enjoyed getting to know the side characters as well. Following them on their journey to conclude Henrietta’s quest brought this feeling of fulfillment and happiness to me as a reader, which I thoroughly enjoyed.What I Loved:1. Henrietta…She was such a wonderful character and reminded me a lot of what I hope my future main character is like. Her character development was beautiful as you saw her slowly let go of her stubborn attitude and let her closed off walls crumble a little bit. Reading as she interacted with everyone around her and learning more about her personality truly made her come alive as not just a character on a page, but a person who has been hurt before and isn’t sure she is willing to let that happen again. Henrietta was a beautiful character and a true to life representation of many people I know, especially in a world like today where most aren’t too forgiving.2. The storyline…I really enjoyed reading this book because of the story line. It’s a plot that I have yet to see in any books I have read and I honestly loved following it. It was less about actually slaying a dragon and more about the characters truly finding themselves and finding their “home”, so to speak. Keep this in mind when you read it! Don’t go into this book thinking that there is just going to be blood and guts everywhere from a dragon slayer doing her job. This book has a lot more depth than that!3. The secondary characters…Meeting the secondary characters in this book was a nice breath of fresh air. They brought elements (haha, pun intended) to the story that really helped to round out Henrietta’s stubborn and sometimes irritable nature. It was nice to read about secondary characters who could handle that type of personality with ease and restraint and allow Henrietta to open up on her own time. 4. There was no romantic attraction…This was GREAT! I really wanted to read a book where the heroine was more focused on the task at hand, on finding herself and solving her problems, BEFORE she got into a romantic relationship. This is EXACTLY what I needed and I’m so thankful that Beth wrote her novel this way. Henrietta solved her problems before you even started to see some kind of romance well up in her heart. Even then, it was only hinted enough to make you want more and to find out what happens! She made herself happy before she let herself fall in love, and I can’t even say fall in love because she really isn’t in love yet… she’s just living her life the way she has always wanted to. Thank you, thank you, THANK YOU Beth Barany for loving Henrietta so much that you made her fall in love the way she’s supposed to; with trust, friendship, and a solid idea of who she is.What I Wanted More Of:1. Description, description, description…I saw this a lot while there were long sequences of dialogue happening. During the dialogue, I would find my mind stopping mid sentence and trying to picture what the main characters are doing. I felt like the book needed a bit more description so that my mind could not just follow along with their conversation but truly picture what it was they were doing while talking. This description is what helps people to get lost in books and I feel like if there was a little bit more of it in the actual dialogue scenes, my mind would be able to follow along a little bit easier. I kept getting caught up as I was able to picture everything with perfect clarity while the characters weren’t talking, and then the picture would disappear as I read long dialogues.2. Answers…I’m assuming many of the unanswered questions will be addressed in the sequel, which I’m very excited to read, by the way!!! The only questions I honestly wished was addressed was towards the end when Henrietta was exhausted. It was hinted that she may be under a spell, but within a few scenes, she was back to being fine with no actual answer as to what happened to her to make her so tired. Even if it is answered in the sequel, alluding to the correct answer in a way that made the reader sure she was under a spell would put my mind a little more at ease. Even if I didn’t find out who put her under that spell until the sequel, I’d be able to read on knowing that I still had to figure out who it was that did that to her and why?! Overall, I honestly loved reading about Henrietta the Dragon Slayer and I can’t wait to read the sequel! I’m giving this book four stars!<3 Kelly"}, {"userName": "SARIT", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/9297936-sarit", "userReview": "The full review is on - http://sarityahalomi.blogspot.com/201... Even though the action is slow to build, the story will quickly suck you in. The plot in short: Henrietta has slayed many dragons in her short life and has resigned not to take any more jobs. But then a pushy knight named Franc implores her to follow him to his Islands of del Oro in purpose of slaing Mimoto the Emerald Dragon. She sick from killing she refuse to come, until she learns her mentor, Master Chen is sick. Only the Dragonitas from Mimoto can save his life.  The team (Each person has a distinct personality and I found myself really liking them all) in this quest consists of . :  Henrietta, premier Scout of Rafania, Sergeant de Bleuve, known as Henrietta de Rafania - She's a smart, strong, independent young woman. And she can also hold her own in a fight and a fiery warrior woman with a sharp tongue and stubborn attitude. Henrietta is also, a very private, solitary person.  Henrietta is a fascinating character - At 17, she's served in the army, gained renown as a dragon slayer, and walked away from it all. Now, she's made a habit of isolating herself, and while she's an excellent warrior, she balks at killing. She acquired a group of companions she would much rather do without in time. But till the end she will learn to love them all, in her own way.  There's plenty of tension--Henrietta is one big ball of tension--and as the story progresses, you begin to understand her more and more. Henrietta is old before her time - she's tired, she's alone, and she's lost her purpose, drifting by from town to town and singing her own adventures to earn her keep. She is also afraid of sailing, which is a problem as the dragon live on an island.  Sir Franc de Plumare de’Oro - is an arrogant foreign knight who demands from Henrietta to accompany him back to his king, who has need of her dragon-slaying services and he isn't taking no for an answer. Jaxter Renaldo the bard /the jester - who wants to go an adventure with the hero whose songs he sings. Surprisingly, discovered as a very good cook. Very likeable character and he who keeps the group together. Witch-girl in training Paulette- Dreamy, quiet and mischievous. A girl who needs to be escorted home in return for the witch's favor. Henrietta helps Paulette become more mature and causes her to think before she acts a little bit more. Paulette shows Henrietta that it's okay to care for people and to let them in. Henrietta The Dragon Slayer is fluid, easy to read and reads well. There is no swearing and no sexual content, there is a little action but no blood fests.  Overall this is a fun book with all the essential elements of a YA quest adventure. Though it says 'dragon slayer' in the title, you wont see Henrietta fighting , we only hear of her exploits in Jaxters tales.  In the base of the story - The quest and the journey are symbols for how a person , must face his own dragons. Also, the writer put strong emphasis on friendship and trust and team working."}, {"userName": "Intisar Khanani", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/7924822-intisar-khanani", "userReview": "Henrietta is a fascinating character. At 17, she's served in the army, gained renown as a dragon slayer, and walked away from it all. Now, she's made a habit of isolating herself, and while she's an excellent warrior, she balks at killing. Which makes things difficult when set upon in an ambush. The story opens as Henrietta is accosted twice in succession: once by an arrogant foreign knight who demands she accompany him back to his king, who has need of her dragon-slaying services, and immediately after, by a witch who informs her that her old master whom she has been long estranged from is dying. To heal him, she needs the special healing stone one can only win by slaying a dragon. On this last quest she does not want, Henrietta ends up with a tagalong group of companions she would much rather do without: a girl who needs to be escorted home in return for the witch's favor, a jester who wants to go an adventure with the hero whose songs he sings (poor Henrietta!), and that unshakeable, obnoxious knight who wants to make sure she slays her dragon.This story will quickly suck you in, even though the action is slow to build. There's plenty of tension--Henrietta is one big ball of tension--and as the story progresses, you begin to understand her more and more. Here's a girl-hero who has been a hero and wants no more of it; she's tired, she's alone, and she's lost her purpose, drifting from town to town and singing her own adventures to earn her keep. And she doesn't want any of it back--but this time she doesn't have a choice, not if she wants to be able to live with herself. The writing is strong, though the proofreading could have been a little stronger. I did catch a handful or two of typos--not enough to detract from the story, but enough to be noticeable. While there are only a few points of serious action prior to the major climax, the book moves along well, and what isn't sword fighting and sorcery is very strong character development. I did think that we heard about Henrietta's stomach a bit too much, which was more an issue of being made a little too aware of how much she continued to stress and worry over her options and choices. And I thought Henrietta was also a little too slow to grasp what she needed to do in the lead-up to the climax of the book. But, there are plenty of characters who just don't want to see what's before them, so I can understand that. Overall, this was a well-paced and enjoyable read, with strong character development and a varied cast. Recommended for fans of epic fantasy, sword and sorcery, fire witches, obnoxious knights, and lost kings."}, {"userName": "Melissa T", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/3803789-melissa-t", "userReview": "This review was originally posted on Melissa's Midnight MusingsHenrietta is a very private, solitary person. So she isn't too happy when she has to go on a quest to save her dying mentor and suddenly she has this very unique group of people tagging along. She thinks they'll just get in her way. And, some of the time, they do. But over time, she learns to love them all, in her own way. She opens up bit by bit and lets them in to her heart.Henrietta is a very snarky, sarcastic character, which I enjoyed. She reminds me of the way that I wish I could be, if I weren't worried about what other people would think of me. She says what she thinks and doesn't spare feelings. Sometimes this really isn't appropriate, like the time she thinks that Paulette should snap out of it after losing her family. But a lot of the time Henrietta's manner is direct and to the point. I think this is what keeps the story moving along nicely. Henrietta is all about action and moving along, so this story rarely drags, if at all.The magical touches are also really well done in the book. They're subtle and not overly flashy. It's just the right balance to keep you interested but not too much as to make you want to cringe. Since I'm really partial to characters who are witches, I would really like to see a spin off book with more of Paulette's story. Paulette, as a character does really well to bring out Henrietta's softer, more nurturing side. Plus Paulette has a bit of fire to her, literally and figuratively, so her character holds up really well on its' own.It's nice to watch the growth of character on both Henrietta and Paulette's parts. Henrietta helps Paulette become more mature and causes her to think before she acts a little bit more. Paulette shows Henrietta that it's okay to care for people and to let them in.There's also a tiny bit of a romance in the book between Henrietta and Franc. Definitely not insta-love which I appreciate. Their relationship really doesn't develop romantically until toward the end of the book so you're left wondering what will happen to them.This is a standalone book but I think that it could work as a series as well. I'd recommend this book to anyone who likes adventures with a strong female character and magic.*The author provided a free copy of this book in exchange for an honest review*"}, {"userName": "Ericka Greer", "userReviewDate": "Nov 20, 2013", "userURL": "http://www.goodreads.com/user/show/5886015-ericka-greer", "userReview": "Although I am not a big fantasy fan I did enjoy reading this book. I loved that Barany wrote Henrietta as a strong, independent, and no taking crap from anybody type of person. Anytime I read reviews or synopsis of a strong lead heroine it automatically has won me over. This story is about adventure and friendship. Henrietta is on a quest to save her mentor that has fallen ill. Even though she never thought that she would go back she felt compelled to go and save him. Although she prefers to travel alone she has three other companions that are with her. There is Framc the Knight. He is one of the first characters that is introduced at the beginning of the book. He was sent to get Henrietta for his king's wishes and he isn't taking no for an answer. At first I didn't like this character because he was very sarcastic and talked a lot of smack to Henrietta about \"women can't do what men can do\" kind of things. As the story went on I did enjoy reading about him.Jaxter the jester is probably my favorite character since we got introduced to him. I think if he were real we would be best friends.I know there would never be a boring moment! He keeps the group together. Basically he is the glue for them. He has a gift of story telling and he loves food! I love a guy that can cook :) And finally we have Paulette who is a witch in training. She kind of reminded me of the person that you would want to be around if you were having a bad day. It just cools you down This was a good and quick read.I read it in one sitting! Although I did feel that it was slow especially at the beginning while they were on their adventure. There were times it was getting boring but I have a rule that once I start a book I finish it so I kept on reading and I'm glad that I did.  Rating 3.5 starsWould I recommend it? Yes"}, {"userName": "Heather", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/1360283-heather", "userReview": "Henrietta the Dragon Slayer by Beth Barany is a fun, engaging YA fantasy tale. There were a few times I found myself really getting into the story and unwilling to put the book down. Henrietta’s quest is mysterious and compelling. Even Henrietta finds it mysterious. And her companions – unusual, to say the least. Talk about a rag-tag band of travelers.Henrietta is an interesting, and quite strong, female lead. Hopefully teen girls will find her an empowering figure. I, personally, was kind of annoyed by her at points, especially earlier in the novel. She seemed to have a huge chip on her shoulder and one nasty attitude. But, I don’t doubt that she had her reasons. There is enough told about her past to compel the reader to cut her some slack. However, I don’t think enough is shared about her past. There is mention about a couple of things in a few places, but we never get a full account for what exactly transpired. I believe Beth Barany is working on a sequel, so hopefully we’ll find out more about Henrietta’s past in that book.Paulette is interesting, to say the least. And I’m not sure how I feel about her possible pairing with Jaxter. Speaking of Jaxter, his role toward the end of the book was zero surprise to me. I caught on to that very early on in the book, thanks to the short quotes at the beginnings of the chapters. I don’t think, however, that it’s super obvious. There are small hints here and there, and I think they’re pretty easy for a practiced reader – or one who’s just absorbing everything – to pick up. Someone who isn’t as attentive (maybe reading too fast to get to the end?) might miss the hints.Finally, Franc. He grew on me. A lot. By the end of the book, he’s one of my favorites. And I would LOVE to see him and Henrietta paired up."}, {"userName": "Snellopy", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/20965933-snellopy", "userReview": "I read this book straight after reading the Very Short Prequel because the sample chapter from this book in it was fantastic. Beth Barany does an excellent job of balancing keeping us in the dark about how her world works and spoon-feeding us chunks of exposition. Her system for doing the latter is seamless: a party of travellers from different realms that includes a jester, and tales being told to alleviate boredom or explain things for characters that are equally in the dark. Party interaction is handled very well in the book with tensions and minor alliances shifting over time as justified by the events taking place. They do a lot of travelling, but it’s not the boring kind where you’re painfully informed about each time they break for camp, or every turn in the trail. There were plenty of setbacks, difficulties and conflict - both internal (for Henrietta I mean), within the party, and external forces that kept the story moving along.The ending seemed a touch sudden. I feel that the king should have been fleshed out a bit more, but that could just be because the other characters were lavished with plenty of characterisation and so he seemed starved by comparison. Henrietta is a great main character to follow... she fluctuates between (over?)confidence in her own abilities and crippling doubt. She admits to herself that she’s making a mistake and yet keeps on the same track. This fallibility makes her easy for readers to identify with and is a welcome change from a bulletproof protagonist who always knows what they are doing. I like the way her story arc progressed, and look forward to more journeys with her in the other books in the Five Kingdoms series."}, {"userName": "Justine", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/4818199-justine", "userReview": "This book is about a 17yr old ex-military and ex- dragon slaying girl, who once again finds herself on a quest which should end in a dead dragon. Along the way Henrietta picks up a few tag-alongs, Franc, a knight sent to return her to his King, Jaxter, and bard folli for another tale to tell and Paulette, a young witch sent along to be safely returned to her hometown. During their adventure, the group meets some evils, gain power and mature. The reason for their quest in the first place is that Henrietta hears that her old mentor had fallen ill and the only way to save him is defeat the Dragon, Mimoto and take its Dracontias, a stone with healing properties and give it to Master Chen. Through the course of her experience, Henrietta ends up making friends, returning a lost king and freeing a nation from a terrible spell.I enjoyed this book because firstly, there was a kick- ass herione. Secondly, the story is fast- paced and action- packed. And thirdly, it's an overall great read for people of any age. I grew fond of the characters. I liked how they didn't like each other at the beginning of the novel but then slowly their relationships bloomed into friendships and even a possibly love. I felt that I learned quite a bit about each character and their backgrounds which helped put the way that they acted sometimes into perspective. I also loved watching them grow and mature.My only complaint is I want to know what happens with Master Chen. Otherwise this was an awesome find and a great read. Hopefully there will be more stories of the gang."}, {"userName": "Rebecca Graf", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/1027658-rebecca-graf", "userReview": "PictureFantasy books are not always my thing, but Beth Barany could change my mind with Henrietta The Dragon Slayer. I found myself....Let's into the review first.Henrietta is....a dragon slayer. She is a dragon slayer with issues. When called to a quest that could save the man who taught her so much, she realizes she has to face the fears and let everyone around her see them. That 'everyone' includes the strangest mixture of traveling companions.This story has a very steady pace that keeps you wanting to read while not being too fast where you can't put the book down to eat dinner. It is also not too slow where you can put it down and never care if you pick it up again.The storyline you might argue has been done before. In a way it has. A person is called to a quest, has to face their own fears, and has a mixture of companions to go with them. Like that, yes, it is a familiar story, the characters are what make it so different.These characters are what make the story in my opinion. They are very engaging, very real, and very unique. I'd tell you more but that might ruin what you read. I don't want that.Beth Barany takes a story that Tokein and others have used and given it new life and a much lighter world. Though heavy in its own right, it is much easier to read than the epics.I highly recommend giving this book a chance. I enjoyed and want more.Note: This book was provided as part of a book tour through www.mistressesofpassion.com with no expectation of a positive review."}, {"userName": "Tash McAdam", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/30019967-tash-mcadam", "userReview": "This is a 3.5 star that could have been 4 with more rigorous developmental edits. The story in here is one I enjoyed, it was well written and engaging. However, there were a lot of repeated actions (her stomach especially annoyed me) and the characters weren't fully realised early enough in the book. I never considered putting it down though, as I genuinely wanted to know what was going to unfold and to see the story to its conclusion. I liked the characters, but apart from Henrietta it took about half of the book before I felt I knew anything about them. However, I did -want- to know more, which is obviously a good sign. I did consistently feel that more description would have been welcomed. Henrietta's backstory was neatly unfolded through the story itself, with no unnecessary exposition. The plot was clear and the mission of the characters easy to understand and get engaged with. My emotional connection to the characters was good by the time we hit the finale, and I would read more about them in the future. I just wish that I had more to connect to earlier in the book. The plot reminded me a little of Tamora Pierce's books, which is not a reference I use lightly, and I genuinely believe that Barany has a lot of strong points as a writer which were undermined by the lack of development. Thankfully, the story was strong enough to overcome this somewhat, and I will be reading the sequels!"}, {"userName": "Anteria Reid", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/28325951-anteria-reid", "userReview": "I was intrigued when I read the book description, and I was not disappointed. (No spoilers)We are introduced to Henrietta, the main character from page one. By the end of the third chapter we are introduced to the main group of characters, the problem, and have enough questions to keep me reading. The pacing was just right, and matched each scene to a T. The fight scenes adrenalized me and the riding horseback was calming. Through twist and turns, my questions were answered and more were posed. What Barany did in this book that is unique, is she made the character's own conscious the villain. Henrietta plays with a lot of back and forth on what she should do, what she can do, how others perceive her, and the struggles she experiences being a female dragon slayer. This world is definitely run by men, and Henrietta gives a good kick to the male-dominated world. The question of \"What is the right way?\" is in many of her thoughts and actions, as well as presented by the other characters.The characters were all well developed, each one with their own personality. Jaxter was perhaps my favorite character, as his background was mostly hidden even though he was the most open. There was humor and sorrow, anger, and annoyances (Franc!) and I felt connected with each one.The book definitely ended on a good note, what book doesn't? And I am salivating for the next one."}, {"userName": "Stephanie Preston", "userReviewDate": "Jun 24, 2016", "userURL": "http://www.goodreads.com/user/show/52866573-stephanie-preston", "userReview": "Well I have just finished reading the first in a series of books, this one being called \"HENRIETTA,THE DRAGON SLAYER\" written by BY BETH BARANY. I have to say as I started reading I got drawn into this magical world. The characters come alive in your mind. This was a very interesting and good book, it kept my interest through all the pages til the very end.To give you a little detail about the book to start you have Henrietta a tough butt kicking kind of women who is tough on the outside, but a little softer on the inside. Tired of fighting and wanting more she ends up diving back in to save her mentor. The other characters are a knight which the king has sent to go on a quest who is very demanding, there is a jester who loves to hear of Henrietta's stories and a young witch in training. Henrietta is on a mission, but first she has to make sure the young witch gets home safely and the others end up following. To find out more be sure and pick you up a copy of this book and join the Dragon Slayer. I have to say I really enjoyed reading this book. The book was well written and a lot of thought went into it. I did receive this book free for my honest review which I have given and believe me when I say this is a great read for pre teens to adult."}, {"userName": "KittyKat", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/20808859-kittykat", "userReview": "*This book was received via Netgalley in exchange for an honest review*This book was AMAZING!!!!! In the blurb it is compared to Robin McKinley's The Hero and the Crown (which is a must read for fantasy lovers) and this is rightly so. Henrietta was a realistic character who faced many issues of morality throughout her quest. I really liked the character of Jaxter and liked the fact that he too seemed real; most of the time he was bubbly and happy but this was not always so. Commonly characters don't reflect real people or seem unrealistic but in this book it was not the case. I also loved the setting, the details about the journey were great and all the characters developed over the course of the plot. It is hard to put into words exactly WHY this book was so great, but it just had a lot of good elements such as a journey, a strong female character who is flawed, action, sword fighting and dragons. All this coupled with the pleasing writing style made for a great book. Overall this was an engaging and worthwhile read. I can't wait to read the next installment in Henrietta's journey."}, {"userName": "LeighAnn", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/12080464-leighann", "userReview": "Henrietta thought she was done killing and doesn't want to kill again whether it's human or dragon. She finds out that her mentor, Master Chen, is dying and she goes on one last quest to save him. She must get a healing stone from a dragon which means she must kill. But can she do it? A knight, witch, and a jester accompany the dragon slayer on her dangerous quest to save her mentor. I really liked Henrietta. She's a smart, strong, independent young woman. And she can also hold her own in a fight. Just the type of woman I like to read about. The other main characters were a lot of fun too. They made the book more interesting and humorous. They were all different and had their own personalities which was great! There's nothing I dislike more than when you the only way you can tell the characters apart is when the author adds \"so-in-so said.\" I like when they have their own distinct voice and they did in this book. I wasn't sure what I would think of this book because I'm not a HUGE \"fantasy\" fan but I really enjoyed this one and I'm going to be waiting for the next book in the series. I HAVE to find out what happens to Master Chen!"}, {"userName": "Lost Girls", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/40216206-lost-girls", "userReview": "Henrietta has done much in her short 17 years. She has been in the army and earned her reputation as a dragon slayer. Now she is done with the killing and just wants to live a quiet life on her own. That is, until fate steps in and sends Henrietta on a quest. She learns that her old mentor, Master Chen, is dying and the only way to save him is to kill the dragon, Mimoto, and retrieve the Dracontias, a magical stone with the power to heal him. Henrietta is the kind of badass heroine I love to read about. She's stubborn, irritable, and sarcastic but deep down she has a good heart. Despite her complaints, she gains a few travelling companions along the way. Jaxter the Jester was the comic relief. I think other than Henrietta he is my favorite. She is also joined by a witch in training, Paulette and Franc the Knight. For me, these characters made the story!This was such an engaging and fantastic read! The whole story was so well paced and full of action and twists. There wasn't a single dull moment. Can't wait to get started on the next book, Henrietta and The Dragon Stone. Consider me a new fan of Beth Barany!"}, {"userName": "A Book Vacation", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/3558850-a-book-vacation", "userReview": "3.5 starsThis is a really cute coming-of-age novel. Barany has created a wonderful cast of characters, including Henrietta, the haughty, kick-butt heroine, Franc, the heroic, chauvinistic knight, Jaxster, the storytelling jester, and Paulette, the quiet, mischievous witch. Through fate, these four characters are cast together on a quest to save Henrietta’s mentor by bringing back the healing stone after killing a dragon. Perhaps my favorite portion of this novel, on the whole, is Barany’s portrayal of Henrietta. While confused and running from her own personal dragons (no pun intended), Henrietta is a tough female lead, standing up for what she believes in and, behind her hard exterior, possess a caring heart. She is unlike any other heroine I’ve read about, and watching her work out her own issues, while dealing with choices of right and wrong, was extremely enjoyable...To read my full review (8/17):http://bookvacations.wordpress.com/20..."}, {"userName": "Merissa (Archaeolibrarian)", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/10258612-merissa-archaeolibrarian", "userReview": "I received this book as a gift in exchange for a fair and honest review.This book continues exactly where Henrietta the Dragon Slayer 0.5 left off. This book is full of information but it doesn't all come at once. So it seemed a bit slow to begin with but trust me, stick with it and before long you won't be able to put it down. The plot line is brilliantly written and the characters all have depth - they may not all be likeable but they have depth!Henrietta is a strong woman although she has only got 17 years to her name. Still, in that time she has certainly made a name for herself but is now facing burnout. Jaxter is a jester who loves to cook (and is adorable!), Paulette is a fluffy airhead who has an affinity for herbs and fire. And then there's Franco - stuffy and rigid in his views but boy when he starts to thaw out, he's brilliant.There is a mystery to solve, an adventure to have and the possibility of a romance to wonder about. All in all, an excellent Fantasy book that I have loved reading and will definitely be reading again."}], "description": "**Grand Prize Winner of the 2012 California Book Fiction ChallengeHenrietta, the legendary Dragon Slayer of the Kingdom of Bleuve, can't stomach the thought of one more kill. Yet, in order to save her dying mentor, she must go on one last quest. But will misfit companions, seasickness, and an ego maniacal king derail the quest for the healing stone? And will she be able to cut past her conscience and kill the dragon?", "title": "Henrietta the Dragon Slayer\n      \n          (Henrietta The Dragon Slayer #1)", "url": "http://www.goodreads.com/book/show/11713438-henrietta-the-dragon-slayer", "average": 3.97, "cover": "https://images.gr-assets.com/books/1350442077l/11713438.jpg", "reviews": 56, "authors": [{"url": "https://www.goodreads.com/author/show/4169630.Beth_Barany", "name": "Beth Barany"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/11713438-henrietta-the-dragon-slayer", "http://www.goodreads.com/book/show/10592705-henrietta-the-dragon-slayer", "http://www.goodreads.com/book/show/6980170-the-writer-s-adventure-guide", "http://www.goodreads.com/book/show/20450081-henrietta-and-the-dragon-stone", "http://www.goodreads.com/book/show/19546426-henrietta-the-dragon-slayer", "http://www.goodreads.com/book/show/19379381-a-christmas-fling", "http://www.goodreads.com/book/show/28451283-a-cupcake-christmas"]}