{"ratings": 469, "userreviews": [{"userName": "Sally Ewan", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/1900005-sally-ewan", "userReview": "The title is a hint that the plot is loosely based on the story of Hannah, Samuel's mother, in the Bible. Her husband Elkanah had another wife who was unkind to Hannah because she couldn't have a child. The parallels are stretched in this story about a woman whose husband leaves her and their son for another woman, marrying the woman and having a child with her. I didn't connect with any of the characters in this story, and the section where the protagonist is crying out to God in prayer about a situation involving her son, when another character accuses her of being drunk (another connection with the Biblical narrative), was very forced. The 'faith' of this character was not very believable. She would toss out some prayers periodically, but seemed to have little true intimacy with God. Give me a Jamie Langston Turner novel any day!"}, {"userName": "Michele", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/906446-michele", "userReview": "This book started out really good.. Then, it got boring!!!"}, {"userName": "Carrie Schuman", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/5658938-carrie-schuman", "userReview": "Ugh...Christian Fiction is so not for me!"}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Dec 07, 2010", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "We have to talk...four words that as a rule aren't going to have an outcome of something one wants to hear. That was the case for Hilary and Eric....he didn't love her anymore and was filing for a divorce. What about Seth? Our son doesn't deserve this. But, the divorce went through, Eric married Pam, and Hilary and Seth successfully made it through the year his dad left when he was eight to his high school graduation. Everything was working out for Seth...he was a football player, he was popular, and he had a full college scholarship. Then on graduation night, disaster struck, and his life became shattered again just like when he was eight, but only worse. Seth was unapproachable both physically and emotionally, and the only thing Hilary could do was to pray for Seth's handling of the current crisis. After all, they had the best attorney in the city, and most importantly she had God on her side.The book was a good depiction of family life after a divorce and also a reminder of how things can change in an instant and transform the entire scope of any situation. The book had a religious theme based on the story of Hannah from the Bible, but it wasn't too evident or obvious. The focus was on the Wynn family and how each member dealt with the tragedies their family was enduring as well as the tenderness between a mother and her child. I enjoyed the book. The author did a wonderful job of depicting emotions in tense situations and allowing the reader to truly experience those emotions along with the characters. Have some tissues ready for the ending. I originally was going to give it a 4/5 until the last few pages and then I bumped it up to a 5/5. The ending was very heartwarming."}, {"userName": "Lydia (Overweight Bookshelf)", "userReviewDate": "Jul 17, 2011", "userURL": "http://www.goodreads.com/user/show/4230224-lydia-overweight-bookshelf", "userReview": "First reviewed here: http://overweight-bookshelf.blogspot....This poignantly and beautifully penned story examines the reality of life after divorce and demonstrates how the journey of healing and forgiveness is an ongoing process. Hilary's story is one that many women can relate to and become emotionally invested in. This is not only a story about divorce and \"the other woman\"; it is a story about discovering your personal worth in the eyes of God instead of in the eyes of the world. Hilary compares her worth as a wife and mother to Pam's apparent success, and I think this is something that all women are guilty of. We always think that someone has it more together or is doing something better than we are and determine our value through these kinds of detrimental comparisons. The character development in this story happened by layers, with new discoveries and developments at the turn of each page. Deborah Bedford does not take the easy root to a happily ever after; instead she writes about life in all of its complexity-the highs, the lows, and twists and turns, and the path yet traveled. I have already passed this book on to two other women and they couldn't stop raving. I highly recommend this book for book clubs or just as a conversation starter amongst girlfriends. Rating: 9/10**Review copy graciously provided by the author**"}, {"userName": "Grace", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/2395921-grace", "userReview": "Christian book series book. Started good, but then got a little too sugary  Since her divorce from Eric, Hilary has done everything she can to control life for herself and her son. Beneath a calm surface, she is terrified of failing Seth. She's worked hard to raise him on her own, and she's succeeded—he's now set to graduate from high school and enroll at the University of Illinois with a full scholarship.But Hilary's worst fears are realized when there is a rock-climbing accident at a post-graduation campout. A young girl is hurt, and Seth is arrested. Pamela, Eric's new wife and Seth's stepmother, blames Hilary for letting Scott go to the campout in the first place. With Seth's college scholarship now just a distant memory and his entire future at stake, the two women must come together for Seth's sake.."}, {"userName": "Misteeyed", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/6529173-misteeyed", "userReview": "Skip this read."}, {"userName": "Sarah Buchanan", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/3855130-sarah-buchanan", "userReview": "(Spoilers here. I can't remember what is spoilers and what is not because I read this so long ago, but be warned.)I desperately wanted to like this book. The title was intriguing, the premise sounded really interesting, and as I began to read it, I thought it would be a good read.Unfortunately, this was before the main character ruined it for me.OK, I get it. Her husband cheated on her and left her for another woman. OK, that sucks. A lot. But when she's still whining about it six years later (or five years later. The timeframe changes), I wanted to slap her and shake some sense into her.She whines about how she resents the child produced by the marriage of her ex and his current wife and she whines about how the wife is going to have another baby.She refers to her ex's wife as his \"new wife\" (even though they've been married for 5 or 6 years) and as her \"husband's wife.\"She ignores any good advice given by the current wife just because she can.She treats her son like he's the one that's supposed to be taking care of her, and then tries to control the information he gets when his classmate dies by. . .throwing his cell phone into a lake.This woman is so needy and woe-is-me, it's really hard to feel even the least bit sorry for her.The books is labeled as Christian fiction, but the only religion you can find in it is her muttered prayers when she needs something, or when she finds herself in a hospital church during a particularly difficult moment. She judges her ex's wife for calling herself a Christian after committing adultery, but she's really no better, and it's an obvious instance of the pot calling the kettle black. There are more Christian overtones in the last fifth of the book, but if it's Christian fiction you're looking for, this is too little, too late.The protagonist also just looks for ways to be hateful to her ex's wife, and then when she reacts as anyone would react to someone being hateful, she takes the haughty, self-indulgent route. Oh no. This woman could NEVER be WRONG about anything, could she?Yes. Yes she can. She's so wrapped up in her own little world that she doesn't allow anyone else's thoughts or feelings to penetrate her bubble. She's just that self-centered.What I will give this book is that it didn't go the route I expected it to with the accident. The girl dies, and is not saved at the last minute by some miracle of God. I appreciated the realness in that.Overall, though, I wanted to take the protagonist behind a shed and slap her across the face, and that ruined what could have been a great book."}, {"userName": "Cafelilybookreviews", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/3643293-cafelilybookreviews", "userReview": "I first discovered Deborah Bedford when I came across A Morning Like This. As soon as I saw her newest title His Other Wife I was excited to read it, having enjoyed her other book so much. Deborah has a wonderful gift of being able to take complex real-life situations that most readers can relate to and put them into riveting novels.Deborah wrote this story loosely based on the biblical story of Hannah. In this novel, Hilary Wynn is the contemporary version of Hannah who experiences tragedy, loss and yearning in her personal life. Hilary is a smart, energetic woman who little by little feels the life sucked out of her through various hardships. Her world comes crashing down and she has to find the resolve to keep on living one day at a time. Hilary endures the ultimate betrayal by her husband and ends up divorced. Just when she thinks she has life under control, she then faces another devastating heartbreak when her 18-year-old son Seth is caught up in a horrific accident on graduation night and arrested.My heart ached for Hilary all the way through this book as she grieved first her marriage and then her son’s mistakes. On top of everything else going on in her life Hilary has to come face to face with her ex-husband’s new wife, who seems to enjoy flaunting her position of “his other wife” in Hilary’s face. For the sake of her son Seth, Hilary grits her teeth and attempts to be civil towards Pam, whose presence is a constant reminder of her marriage to Eric that failed. As they all attempt to get along under one roof for the weekend of Seth’s graduation, Hilary is pushed to the brink many times as she compares herself to Pam and second-guesses her decisions. Pam seems to be able to give Eric everything Hilary wasn’t able to, including another child. Pam also seems to be competing for Seth’s attention and Hilary feels threatened that her relationship with her son may be overshadowed by Pam’s affections and ability to give him more material things. When tragedy strikes and Seth is arrested, Hilary and Eric have to find a way to set their differences aside and unite as parents. Seth faces a murky future and the possibility of prison time. This story is a perfect example of the challenges that many blended families face, and how it takes time to heal and move past heartaches and offenses. If you haven’t had the chance to read Deborah’s books, I highly suggest starting with this one!"}, {"userName": "Mary Gramlich", "userReviewDate": "Feb 14, 2011", "userURL": "http://www.goodreads.com/user/show/4213407-mary-gramlich", "userReview": "HIS OTHER WIFE written by Deborah Bedford02/11 – FaithWords - Paperback, 320 pagesNever give up or give away your own true selfHilary is a survivor and a fighter who knows the ups and downs life can throw at you and how to come back from the brink of disaster. She thought she had a good marriage only to find out that her husband wanted a great marriage to another woman. She believed her 18 year-old son was mature enough to make an adult decision but learned that while she had raised him to have a head on his shoulders at times he didn’t want all that bearing down directly on him. When Hillary’s husband moved out of their house and left a void as to who should be the man she asked her young son to take on that role. She depended on him and at times relied on him to help her fill the voids she had in her life without her husband. All that pressure on her son was too much and Seth was a tornado of emotion. It all comes to a head one night when a quick decision and poor judgment has him deciding to take a dare and not look back. Seth wanted to be a kid like everyone else and enjoy life without the burden he bore as the son of divorced mother but no one is listening to him when he talks.Hilary’s life is changed again and never to be returned to the way it was but this time if she and her son get out of this mess she has decided to move her life in another direction, one she is not clear on but one she will be guided to walk down. Hillary knows it is a life where she may be on her own but not alone.But even when Hilary is faced with disaster, crisis and her ex-husband’s new wife and family she still knows that there is a power so much stronger that will guide her through the sadness and crisis. Hilary tries to move past the hurt of what her ex-husband had done and draw him and his new family into her heart and let them help her son heal from his mistake but can she, is she stronger enough to let go of the hurt and see past problems to let them work together to find a resolution. That which does not kill us makes us stronger but at times we all question whether God is paying attention or has forgotten to help us with the cross we bear. But when you stop to hear the whisper in your ear that says you are strong enough and you can get past this if you just don’t dictate what you need but appreciate what you have."}, {"userName": "Carly", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/2390389-carly", "userReview": "I have not had the pleasure of reading a book by Deborah Bedford before, but to say that reading His Other Wife is a pleasure would be a huge understatement. This book was absolutely fantastic on so many different levels. The first thing that struck me about this book was simply the writing. Sometimes it takes me a little time to get used to an author’s writing style, but not this time. I instantly responded to Deborah’s writing and welcomed the experience of a story that sounded like it could have been heavy and a little tough to take.Naturally, with writing as flawless as this, the story captured my attention right from the start and not one moment passed through the entire book where I felt bored or where I felt the story was too heavy. There was a lot of drama and a lot of painful history in this story, but Deborah skillfully avoided having “too much” at any one time. The reader learns about each character and his or her issues slowly as the story unfolds just as we would naturally learn about someone we would meet in real life. Watching Pam and Hilary both come to terms with the situation they find themselves in and watching God take hold of Hilary’s heart was very inspiring.Some folks may find that the story wrapped up too neatly, and I must admit that I briefly felt that way. But, after reflecting on it for a few minutes I think that was done intentionally by the author to show the reader that once we surrender to God, things have a way of falling into place. For good or for bad, God takes care of us if we let Him. That is the message Deborah was conveying throughout this story and she did it beautifully.His Other Wife is one of those books that I didn’t just read. I savored it. I had certain expectations and each of them were either met or exceeded. This book is going on my all-time favorites shelf and I will certainly be reading more from Deborah. If you are looking for a story with a powerful message that will inspire you and leave you feeling uplifted, I highly recommend His Other Wife."}, {"userName": "Sarah", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/5880981-sarah", "userReview": "Well- the book was pretty good- except i had a real problem with the ending- it was to \"perfect\"- a real woman who was divirced because her husband had an affair would not act as kindly to the whore- oops \"new wife\"- as she did. It's like they all kissed and made up and became a big happy family. Yeah right. I also felt no sympathy for Pam- the whore- because well- she's a homewrecker- i don't give a crap if she was abused by her 1st husband and had a crappy childhood. It is NO EXCUSE for her sleeping with, getting pregnant by- and stealing another woman's husband- all deliberately. She took advantage of a hard time in the relationship- when his WIFE found out she couldn't have anymore kids- and purposely got pregnant in order to steal another woman's husband. then she has the balls to come into Hillary's house- critique her parenting- and Hillary herself. even going so far as to tell Hillary that she got pregnant and that is why Eric left her. i wanted to hit her.Eric- what positive thing can you say about a man who cheats on his wife for at least a year- purposely dating another woman to get over the loss of not being able to have more kids with his wife. I know they say \"it just happened\"- but yeah right. He's an ass. Then to top it all off- he moves across the country from his SON- so he can make a family with this other woman- then tries to critique Hillary's parenting- when he didn't even care about the son he did have- just about his whore he got knocked up and their new kid. I would never have let him back into my house.Hillary- she did the best she could- she was the total victim in this whole situation. And Seth was just being a kid- one who made a huge mistake- drinking- and it had terrible consequences. I am glad that nothing terrible happened to Seth- he didn't deserve it- he didn't do anything to Laura- she was the one that was too drunk to make rational decisions. He was only trying to make her not drink and drive w/ his GF in the car."}, {"userName": "Mary", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "Ever since her divorce from her husband Eric, Hilary Myers has done everything within her power to control life for herself and her son, Seth. Beneath a calm facade, she is terrified of in some way failing Seth. She has struggled hard to raise him on her own, and she has succeeded - Seth is now set to graduate from high school and enroll at the University of Illinois with a full scholarship.But Hilary's worst fears are realized when there is a rock-climbing accident at a post-graduation campout. A young girl is hurt, and Seth is arrested. Pamela, Eric's new wife and Seth's stepmother, blames Hilary for allowing Seth to go on the campout in the first place. With Seth's college scholarship now just a distant memory and his entire future at stake, the women must come together for Seth's sake.Will Hilary's love for her son be strong enough for her to put aside her anger and bitterness against Pamela and ultimately entrust Seth to her ex-husband's other wife? I really do enjoy books dealing with family dynamics, especially families in crisis. This is contemporary fiction with a somewhat Christian theme - not overbearingly so, in my opinion - but still strongly evident to me. I give this book an A+! and will certainly be searching for more books by this author to read in the future."}, {"userName": "Maureen Timerman", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "As the title suggests there has been a divorce. Hillary has put her whole life into raising Seth, and he knows it. Seth is just graduating from High School, and has his whole life ahead of him. Seth makes a decision and Hillary agrees, only it is a very bad decision that is life changing.Her ex husband and his new wife and family are in town to share in the joy of the graduation....then the tragedy happens. Will the two families be able to come together in order to focus on what is important? I don't know if I could be a generous as Hillary...she opened her home to Eric and his family. I know it is a celebration, but letting the other woman in her home? This story is a great is a great lesson of letting go and letting God be in control. It will make you angry, sad, and joyful! The story itself is loosely based on Hannah of the Bible.Disclosure of Material Connection: I received this book free from Hatchett Book Group. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising."}, {"userName": "Ishanie", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/313611-ishanie", "userReview": "Thanks goodreads for this great win! As soon as I get it and read it, I'll update my review! ***UPDATE***After reading the summary on the back of this book, as a reminder of what it was about, I was very skeptical. The book is in the Christian fiction genre and something I wouldn't ordinarily read. However, I started reading it and could barely put it down. The story is a modern day version of Hannah which is a biblical story. It wasn't until nearly the end of the novel, that the book was in any way religious because it never pushed anything on the reader. I wanted to put that out there so some of you won't knock it immediately because of its genre.With all of that said, I found myself drawn in from the beginning. I really felt a connection with the main character and her struggles as a wife, a mother and a woman. Her love for her son, makes the reader feel love for him as well as love for her. Very well written and I would be glad to read another one of this author's books! Thanks again goodreads!!!"}, {"userName": "Monkeyface", "userReviewDate": "Nov 21, 2012", "userURL": "http://www.goodreads.com/user/show/5879657-monkeyface", "userReview": "Listened to His Other Wifeby Deborah Bedford. Since her divorce from Eric, Hilary has done everything she can to control life for herself and her son, Seth. Beneath a calm surface, she is terrified of failing Seth. Shes worked hard to raise him on her own, and shes succeededhes now set to graduate from high school and enroll at the University of Illinois with a full scholarship. But Hilarys worst fears are realized when there is a rock-climbing accident at a postgraduation campout. A young girl is hurt, and Seth is arrested. Pamela, Erics new wife and Seths stepmother, blames Hilary for letting Seth go to the campout in the first place. With Seths college scholarship now just a distant memory and his entire future at stake, the two women must come together for Seths sake. Is Hilarys love strong enough to save her son and release him to Pamela? I expected this book to be about the awful divorce and it turns out it was about a lot more. I did enjoy the way she asked God to help her through some bad time. I give this book 4 stars and a 7."}, {"userName": "Nizzy", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/5670695-nizzy", "userReview": "Overall, it was a nice story. The reader did a good job of keeping me interested because I think if I decided to read this book myself I would have been a little bored. The title was a little misleading in that it really wasn’t much about the other wife, but more about the accident that takes place. It only hits the surface of Hillary’s healing after the divorce, coming to terms with her faith, and acceptance of her ex-husband’s new wife. There were a few times that I felt for Hillary and just wanted her to lose it and go off on Pam (the other wife), but Hillary stayed sensible and sweet. Almost too sweet. She always kept her cool and all the tribulations or hardships she and her family faced worked out just perfectly. Too perfectly. The ending was just too neat. Given this is Christian fiction, I’ve found that it wasn’t too thick with Christian references or bible passages, but there were times where I felt that the faith was worked into the story as a late addition."}, {"userName": "LadyS  ", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/10099522-ladys", "userReview": "Pros: imagine a God-fearing woman who's husband suddenly decides to leave her to start a family with someone else. I like how the author demonstrates through the character how her treatment of \"the other woman\" should be in the midst of so much pain. That situation could never be easy. For the emotional portrayal i give this book 2 stars.Cons: The book had different points of views from characters that i felt distracted the purpose of the story in ref to the title. More odious was the authors implication that going on the \"path towards remarrying\" (after a divorce) is ok. This is the main tomfoolery of the story. nope, Christians cannot accept this. If unfortunate circumstances happen leading up to a divorce from one spouse, adultery is marrying another. Where does it stop? when you find the right one and it finally works for you? confusion and tomfoolery. I detest this \"trendy\" erroneous doctrine justifying remarrying after a divorce (for a Christian)"}, {"userName": "Regina Spiker", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/4274600-regina-spiker", "userReview": "Left alone to raise her son Seth, Hilary is still trying to terms with sharing him with her ex-husband Eric, his new wife, Pam and their children. Even though Hilary has raised a very mature young man, she has leaned on him heavily through the years, maybe too much. Now at Seth's graduation, the \"new family\" all want to appear and share in the fun. When tragedy occurs at a senior party, both families have to learn to work together to help Seth and themselves.I really enjoyed Bedford's writing style - inspirational, but not too heavy and preachy. Her characters struggle with their faith in God when bad things happen and easily blame each other for the mistakes that have happened, although in the end they realize what they need is to help each other. A very real-life story of today and the world we live in."}, {"userName": "Laura", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/3000045-laura", "userReview": "Meh, it was pretty good, but kinda okay. I know that the title isn't necessarily chosen by the author, but it really didn't have much to do with \"His Other Wife\" -- she was definitely had more of a minor role than I had imagined. This book also very much reminded me of Kristin Hannah's \"Night Road.\"I liked the tone of the narration and the pace kept things rolling along, but the internal dialogue was a bit jarring. I wasn't aware this book had a religious bent until I was listening to the audiobook, and it was just distracting. Not because it was religious, it just seemed to be inserted in spots that were \"off.\" Author Lynn Austin will sometimes have inner dialogue like that in her books, but it's usually more cohesive."}, {"userName": "Rhonda", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/232229-rhonda", "userReview": "Hilary's husband leaves her for another woman, and leaves her to raise their son, Seth on her own. Faced with the fear of him leaving home for college after graduation, she struggles with the feelings of letting him go, living alone, feeling she failed her son, etc. Seth's father, Eric, and his wife of 10 years now, comes back to town for the graduation...Hilary can't believe Eric is bringing Pam and the little kids with him for her to deal with.....On Graduation night, the graduates celebrate by camping overnight illegally in a state park...a tragic accident happens which changes Seth's life forever, and Hilary must face the challenge of 'letting go' of her harsh feelings toward Pam and concentrating on helping Seth through this difficult time in his life...."}, {"userName": "Amy", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/2342686-amy", "userReview": "Flat. Predictable. Dry. Forgettable. HOWEVER, I wanted to make sure I finished it, just in case something unexpected happened in the end. It really didn't. I hate to give the book such harsh words of review, but it just wasn't THAT good. I couldn't connect with the characters and they seemed somewhat 2-dimensional. I did appreciate the heartfelt words of the author at the end of the book explaining the Biblical connections she had hoped to achieve in writing the book. If only she could have lent that kind of depth and feeling to the characters of the book as well."}, {"userName": "Joi", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/17791798-joi", "userReview": "I really enjoyed this book. I didn't think that I would, because it's not my typical sort of book. But I was proven wrong immensely. I don't really know why I am giving it four instead of five stars, but I believe it is because the situations just seemed too convenient and nobody talked about the main problem until the end of the book. I think this was done in order to prove how much the main character had grown since the beginning of the book, but for some reason it didn't sit well with me. Other than that, I really enjoyed this book."}, {"userName": "Megann Zeigler", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/21323437-megann-zeigler", "userReview": "Wow what a wonderful book. Deborah shows us how parents should behave when they split up but she also shows us the reality of how many of us do behave. It takes a tragedy to cause this family to come together and find their way to being a blended family. Hurts are still there but they are put into perspective. It is a fiction work but could be a non-fiction as many people will understand the feelings that the characters share."}, {"userName": "Michelle Welch", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/24871769-michelle-welch", "userReview": "There are way too many divorces today and this book delves into the intricate details that are involved between the mother and the step mother. Hilary has always been either Eric's wife or Seth's mother. Now, when a seemingly insurmountable crisis arises, will she be able to set aside her anger at the other wife to work together to help her son? I loved this book. I read it straight through and paid dearly for that the next day."}, {"userName": "April Adamson", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/27644505-april-adamson", "userReview": "This book was surprisingly better than the reviews I read about it. Being a child of divorce and a divorced mom as well I can completely relate to the main character Hilary and her dislike of her ex's new wife. Some of the situations in are familiar and frustrating especially the tension between Hilary and her exs new wife. I'm glad it turned out in the end and this book was a pleasant surprise."}, {"userName": "Sabrina", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/1973520-sabrina", "userReview": "I had reservations about this book when I looked at the title. I thought perhaps it was going to be about infidelity or something of that nature. However, when I started reading I was pleasantly surprised. This is a book about the struggle of a mother who must let go of her son. I recommend this to anyone going through a separation."}, {"userName": "mom2wah", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/1457644-mom2wah", "userReview": "I just love Deborah Bedofrs's book. They have a religious edge to them and great lessons. I this bok a man leaves his first wofe for his pregnant mistress. How do these families blend and how does there son endure not only the divorce but lifes challenges. One of which almost lands him in jail. Easy read."}, {"userName": "Laura", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/1370269-laura", "userReview": "Hilary is devastated when her husband leaves her for another woman. Then she must try to form a positive relationship with this woman who becomes her son's stepmother. My favorite part of this book is the way Hilary prays frequently throughout the book. It definitely has a Christian angle in the story!"}, {"userName": "Lisa", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/2320744-lisa", "userReview": "I didn't realize until I got home that this was a \"Christian fiction\" book, which made me wary. However, my fears were not realized -- the author has the main character pray and ask questions of God periodically, but she is a very likable -- one might even say Christian, in the true sense of the word -- woman, not a Bible-thumping judgey type. The story was okay, and the writing was polished."}], "description": "Since her divorce from Eric, Hilary has done everything she can to control life for herself and her son, Seth. Beneath a calm surface, she is terrified of failing Seth. Shes worked hard to raise him on her own, and shes succeededhes now set to graduate from high school and enroll at the University of Illinois with a full scholarship.", "title": "His Other Wife", "url": "http://www.goodreads.com/book/show/12233052-his-other-wife", "average": 3.38, "cover": "https://images.gr-assets.com/books/1348581334l/12233052.jpg", "reviews": 75, "authors": [{"url": "https://www.goodreads.com/author/show/426586.Deborah_Bedford", "name": "Deborah Bedford"}], "type": ["Fiction", "Audiobook", "Christian Fiction", "Adult Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/12233052-his-other-wife", "http://www.goodreads.com/book/show/8757812-his-other-wife", "http://www.goodreads.com/book/show/9913289-his-other-wife", "http://www.goodreads.com/book/show/17905284-his-other-wife", "http://www.goodreads.com/book/show/10608701-his-other-wife", "http://www.goodreads.com/book/show/1831643.Remember_Me", "http://www.goodreads.com/book/show/1647331.A_Morning_Like_This", "http://www.goodreads.com/book/show/1507406.A_Rose_by_the_Door", "http://www.goodreads.com/book/show/1647329.When_You_Believe", "http://www.goodreads.com/book/show/1647332.Blessing"]}