{"ratings": 29402, "userreviews": [{"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "Roarke...Eve...Roarke and Eve...Le sigh."}, {"userName": "Mo", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "Another fabulous read. I love Eve and Roarke. Eventhough they are not really together much in the books -she is off solving murders and such. But the times they spend together are so sweet and so special. Sigh. BeautifulEve is my type of girl. Happy to potter around in jeans and boots and t-shirts. Hates wearing dresses and having to socialize! LOL. Not into make-up. Well, I am into make-up. At my age, I need it.This is set in the future. I should be running a mile but I am not. \nAt times like this when she was alone, when her spirits were low, she wondered how they had ever come together - the straight-arrow cop who believed unwaveringly in the lines of the law, and the slick Irishman who'd tangled with and over those lines all of his life.\n\n\"Bloody hell, I love you.\"\nYeah, I think Hugh is my Roarke.\n\"There's a memory for the box - and a tradition. Merry Christmas\"\nI think I still have about 754 books to read in this series. LOL. Maybe not that many, but a lot."}, {"userName": "Jilly", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "It's Christmas in July for this girl! And, this book is celebrating it with a serial killer who decorates his victims with the Twelve Days of Christmas theme. It makes my holiday rituals seem a little boring. The only thing dying during our holiday gatherings is the idea that seeing those long-lost family members again is a good idea. I mean, really, we don't see them all year for a reason...I'm still pissed off at them over that one. I do NOT have a chocolate problem! We get along just fine.And, what else does the Christmas Spirit bring to people? That's right, simmering rage and violent eruptions of emotional pain. Eve gets really into the Christmas spirit in this book. She is in a mood so bitchy that even those homeless guys who scream at cars on the street are telling her to calm down a notch. She is absolutely horrible to everyone. But, I guess nobody can complain that she showed favoritism in her gift-giving. She gave them equal shares of insults, yelling, and cursing.So, again, I need to ask the question that I ask every book: why the hell does Roarke like Eve? There isn't a pleasant bone in her body. Her favorite thing to say to him is \"kiss my ass\". She treats Peabody like an abusive parent treats their kid when they're drunk. She even storms into a police officer's Christmas party on Christmas Eve and freaks out that he isn't working.\n\"Where the hell are my reports? Where are my results? What the fuck's going on around here?\"\"Hey, it's Christmas Eve. Lighten up.\"Her hand snapped out, grabbed him by the shirtfront, and yanked him off the table. \"I've got four bodies and a woman in the hospital. don't you fucking tell me to lighten up, you little cross-eyed son of a bitch. I want my test results.\"\nWait a minute. This sounds familiar. Aunt Eve? Is that you? Stupid family holidays...Seriously, though, someone get this woman a Xanax. Stat!"}, {"userName": "Phrynne", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "It has been years since I first read this book and still it was oh so good! The dialogue between Peabody and Eve made me laugh and it made me cry. Ditto that between Roarke and Eve. I loved every single word in this book and enjoyed every precious moment! Each book in this series builds upon the character of Eve and it is very hard not to love her as much as the author obviously does. In this book she is coming to grips with the Christmas holiday and having to buy gifts for her ever increasing circle of friends. It is both funny and sad to see her as she struggles with something which is second nature to those of us who have had normal family relationships for the whole of our lives. Roarke and Eve both have to start laying down their own customs and traditions as they both led deprived childhoods.This is another brilliant episode in this amazing series. I am so much enjoying my second read through!"}, {"userName": "Jo ★The Book Sloth★", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/13870608-jo-the-book-sloth", "userReview": "This was my least favorite book so far, not because of the mystery aspect, I quite liked Santa Killer, but because Eve was acting like a bitch with Nadine, with Peabody, with Charles and generally with everyone at some points."}, {"userName": "Brenda", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "Lieutenant Eve Dallas headed in to the station early after the usual recurring nightmare had disturbed her sleep once again. But on the way, she was summonsed to a disturbance in a nearby apartment block. The murder scene was horrific – made worse by the festive season decorations surrounding the victim. And so, the beginning of a terrible run of murders for Dallas as the Twelve Days of Christmas played out with a sadistic killer on the loose, searching for his “one true love”. Santa had a lot to answer for as 2058 drew to a close – and Dallas was determined to stop him in his tracks…Holiday in Death by J.D. Robb is 7th in the series, and is another excellent mystery – a re-read for me, and as exciting to devour this time as it was last! Highly recommended."}, {"userName": "Beanbag Love", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/2598237-beanbag-love", "userReview": "[she finally decides to devote her evening to Roarke and head home from Peabody's apartment immediately after her friend has been attacked and almost raped/murdered! In fact, everyone leaves Peabody alone. Because she says \"I'll be fine\". With friends like these who needs people who don't give a crap? (hide spoiler)]"}, {"userName": "♥Sharon♥", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/12125670-sharon", "userReview": "I know what you are thinking. Another 5 star review, she has to be a bit bias. I guess I am. I have an awful crush on this character Roarke. Silly of me I guess. Especially at my age but seriously ladies this guy does it for me. He is tall dark and handsome and loves like no other. I know I am repeating myself but I don't care. I will say it a thousand times over. I LOVE how he LOVES Eve. It isn't your typical fairy tale love story but when it comes to Roarke and Eve it is perfect. ❤J.D. Robb has something fabulous here. I know there are many more books in this series that I will love and I can't wait to get to all of them.ROARKE ❤ ❤"}, {"userName": "Irene Sim", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/31914348-irene-sim", "userReview": "It's Eve and Roarke's first Christmas together. It was fun watching how the season's festive spirit seemed to make her grumpier than usual. This story is full of tension, the murders hit a rough spot on Eve's psych being sex-crimes.It has it's funny moments as always, the whole gang is present and I like McNab's addition to the team-after 2 books he seems like a permanent figure. The characters are all amazing and the relationships that form between them, just getting stronger and stronger with each book."}, {"userName": "Alex ♈", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/60595721-alex", "userReview": "Suspense 4 stars / Romance 3.75 starsMerry freaking Christmas… I felt so sorry for the victims, especially for he 1st woman. Damn, life is unfair! Romance. No ex for Roarke, but adoration of his good looks by almost all women incl. Eve’s BFF and aide razzes me… Poetic handsome… *yawn*"}, {"userName": "Hulya Kara Yuksel", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/32793174-hulya-kara-yuksel", "userReview": "WOW another fantastic book from J.D.Robb! <3 And I can't wait to read other 40 books soon. :D LOL I know, I know this is going to be a very long journey but I'm 100% sure it will be worth it! Because Roarke & Eve... I love them so, so much. <3\nHe held there, buried deep, panting as he blinked his vision clear to look at her. The fire that blazed in the hearth across the room shot flashes of light and shadow over her face, glinted into her hair, flickered in her eyes, which had gone dark and blind with what they brought to each other.\"It's me who has you.\" He drew back, thrust again. \"Always.\" He shifted, lifted her hips with his hands. \"Go up again,\" he demanded and began to destroy her with long, hard strokes.She fisted her hands in the bedclothes as if to anchor herself. In the firelight she could see him over her, dark hair gleaming, eyes too blue to be real, muscles sleek, skin pale gold and dewed with sweat.Need rose like a flood, and pleasure swamped her. Her vision blurred, turning him into a shadow, gilded at the edges. She heard herself choke out his name as her body shattered.\"And again.\" He lowered himself, taking her mouth with his, linking his fingers with hers, pounding his body into hers. \"Again,\" he managed, as his blood rioted. \"With me.\"And it was \"Eve\" he said, just \"Eve.\""}, {"userName": "Duchess Nicole", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/2204947-duchess-nicole", "userReview": "Ack, Robb's villains in this series are so skeevy. This guy was a really nasty piece of work, and the fact that it muddled Eve's mind due to how personal it was for her was not a new idea. However, it still stirs up a lot of pity from the reader...namely ME. I hope that Eve seriously addresses her issues soon. I love this series but something I just thought about while listening to this installment is how Eve is the one with all the problems. Girl is messed up. And I suppose entering into a relationship with Roarke and allowing all of these new friendships into her life are a big step in the right direction for her. Still, I would like to see some healing start to take shape.There's something going on between Peabody and McNab, and I'm loving that angle of the story. I have a feeling their romance will play out slowly, so it will be great fun to watch that unfold. The series seems to get a little sexier in this book. Roarke is awfully randy for his wife, and I'm okay with that :D Another great listen! Love the narrator. The story was, of course, very good. I just read awhile back about how this author has no plans to give Eve and Roarke a child...like, EVER. And I'm really bummed out about that. I think it would add an element to their relationship (and the series) that it needs. Give it some levity in a different direction than the same ole badass cop, hot husband thing. I'd love to see Eve as a mother. But woe is me...never gonna happen. I'll get my kid fix somewhere else, I guess."}, {"userName": "☼♎ Carmen the Bootyshaker Temptress ☼♎", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/16935457-carmen-the-bootyshaker-temptress", "userReview": "Read May 2014Re-Read Nov. 2016I really enjoyed the fun moments in this book. Of course felt bad for the lost of life but you have to love Peabody and her shopping ideas. She's just to funny and loved the gift from Eve to Roarke it was an aww moment and so special but she needed help and she had to ask her \"friend\" Summerset. hahaha, it was a great moment between them. LOL. I really enjoy there banter but love the Roarke and Eve moments as well. Really love how Roarke takes care of Eve and of course how he spoils her."}, {"userName": "Ann Lou", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/7284705-ann-lou", "userReview": "It's the Holidays in this installment. We have a controlled, calculating and organized killer who drugs his victims. Eve is being bitchy again. What she said to Peabody was uncalled for. Sometimes I think she's too much and her methods are too much but then I remind myself that her cool professionalism doesn't mean a lack of heart. One thing I can't fault though is how she fights for the dead. They are not just names and numbers to her. She wants to give them justice and tries hard to achieve it.Roarke is perfectly delicious. *yum* If you are too busy with work Eve, I will always make time for Roarke. LOL"}, {"userName": "Carolyn", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "Another terrific book in this series. Eve and Roarke are getting ready to celebrate their first Christmas together and start some new traditions of their own. However Eve is overworked, hunting down the Santa killer, a serial killer who rapes and murders his victims after bringing them a special gift. The murders seem to be connected to a dating agency and Peabody and McNab go undercover to find out what is going on."}, {"userName": "ElaineY", "userReviewDate": "Aug 26, 2008", "userURL": "http://www.goodreads.com/user/show/1301782-elainey", "userReview": "Despite the repetitiveness in some parts - Roarke's library, the dialog between him and Eve - I still enjoyed this installment. Not as good as the previous, Vengeance ID, but still enjoyable because of Robb's ability to keep the pace tight and zipping along like those futuristic cars.It's getting predictable but I expected this when I started the series a couple of months ago so I'm not complaining just yet. Still, I hope I haven't spoken too soon as there were some lines that seemed taken right out of the previous books so I hope Robb manages to Roarke speak them a little more differently in the next few books. Much as I love him, I'd like to have him say more than just \"You look tired,\" to Eve every time he sees her or use sex to energize her.I perked up at McNab and Peabody and look forward to their romance. There is one, isn't here?"}, {"userName": "Laura", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/7550380-laura", "userReview": "I picked the perfect time of year to read this book as the killer poses as Santa to lure his victims. Eve and Peabody with help from McNabb and Rourke work at a frantic pace to catch the killer before he can strike again. The case was exciting and I was hooked from the start. My favorite part though was the dynamics between all the characters. Eve, Peabody, McNabb and Rourke all worked together and Eve wasn't her usual antagonistic self. She was much more likeable in this book. It was comical when she slipped in Christmas shopping as she was investigating the case. This is Eve and Rourke's first Christmas and it was touching how sentimental Rourke was in his attempts to make holiday memories. My favorite so far."}, {"userName": "Diane", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/8776988-diane", "userReview": "I didn't mind this book - it had everything I like: police procedural, serial killer, lots of Eve and Roarke plus they share their first Christmas together - Peabody meets Charles, McNab feels Eve's butt, Eve and Peabody have a falling out - Eve and Roarke place a memory in their new memory box!A couple of things (besides getting the words wrong to the 12 Days of Christmas) stand out to me. Roarke says he will put the lights on after they decorate the tree - who does that? Lights go on first, then the other decorations. And secondly, cold contracts, heat expands - Roarke says he likes his showers cold because it opens the pores, sorry Roarke, you got that wrong, but I can let that slip.Two thumbs up and 5 stars - not a bad read."}, {"userName": "Anita", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/10765339-anita", "userReview": "Fantastic book. This series just gets better and better. Nora Roberts' sex scenes are erotic-lite and plentiful. Eve Dallas, as a partner in the marriage with Roarke is learning to accept that he loves her without question or reservation and will take drastic measures when she needs him to, even if she fights tooth and nail over it.Great plot centering around a killer who rapes his victims and leaves a token from The 12 Days of Christmas song. The rapes open not quite healed wounds for Eve and cloud her focus at times. I missed the baddie."}, {"userName": "Lisazj1", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/5816343-lisazj1", "userReview": "4.5 stars, loved it so much. I love watching Eve catch bad guys and seeing her being protective of those she's claimed as her family, even if she still goes about it the wrong way. This caring about people stuff still gives her a headache, LOL.And I love the way Roarke loves Eve, I love how they are with each other. Every single character in this book world has a piece of my heart. Even Summerset. He may not like Eve *not in a way he can admit* but he respects her and looks after her in his own way. That's a relationship I look forward to seeing how it develops over time, with all the fireworks entailed, heh. This was a tough one to read in some ways. These murders broke Eve's heart and she broke mine because it really did a number on her. The plot was interesting, the action kept things moving and in places had me on the edge of my seat. That Nora Roberts can do this with every book *and has for 40+ books, apparently* continues to blow my mind. The banter and dialogue is always amazing and funny as hell at times. The sex may not be explicit but it absolutely doesn't need to be, because it's always bone-meltingly hot between Roarke and Eve. Loved every bit of this."}, {"userName": "Lizzy", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "Holiday in Death as the number 7 in the  In Death series it's somewhat predictable. I’ve become comfortable with Eve’s routine of chasing after serial killers. That was expected, many will say, since that is at the heart of it all. I agree, but it starts to lack the thrill. Yes, it’s their first Christmas together, but also in Eve and Roarke’s relationship there is not much more to expect, at least for now. She works too much, he worries and cares for her; he helps her in the case being investigated; and so on. Not that I didn’t like them here. Despite it all, I loved Roarke and Eve, that is a given for me so far. There was a good mystery, we meet a sociopath dressed as Santa, ringing in bells to sexually attack and murder his victims.This case was not easy on Eve, as it could be expected it brings back hidden memories of a little girl with a monster for a father. So we get a cranky and bitchy Eve sometimes, especially with Peabody and Nadine. She was never an easy character, but I like her nonetheless.Despite its predictability, I still enjoyed Holiday. It was my least favorite book in the series, it’s true, but still another quite enjoyable read."}, {"userName": "Cyndi", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/7132123-cyndi", "userReview": "Eve and Roarke's first Christmas. I go overboard at Christmas myself, but Roarke is more Christmas crazy than I am, even. I really, really, really want the hologram showing during their party. \"The floor to ceiling windows showed not the nasty sleet that hissed over the city, but a hologram of a dreamy snow scene where couples skated on a silver pond and young children raced down a gentle slope on shiny red sleds.\" How cool would that be? Add to that, more wonders from my favorite house in literature. The holo room? I've wanted one since I saw it on Star Trek Next Generation. Then, the library, *sigh*. \"The walls of the two-level room were lined with books.\" and more, \"the rich smell of leather from the bindings, the glossy look of the spines as they marched along the dark mahogany shelves. There were two generous seating areas, more leather {I would actually rather have cloth covered chairs and sofas} in the wood-trimmed deep burgundy sofas and chairs.\" There are also lamps with jewel toned shades, wood cabinets and window seats with thick pillows. All of the books are organized on a computer system that is tucked into a cabinet. Ahhhh! I may even like this one better than the one in Beauty and the Beast."}, {"userName": "Ira", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/17838248-ira", "userReview": "4.5 stars!Eve bitches to everyone incl. to Roarke! Not nice at all! Guess what? Roarke tranx her haha... and she got a beauty treatment while she's out and wake up fresh beside her gorgeous naked hubby! Lucky girl!:))One thing upsetting me a bit, we didn't get to see how Roarke reaction when he got his Xmas presie from Eve, oh well..If I keep continue reading this series like this, it will make my pocket sore! Urgh!!!"}, {"userName": "Elvan", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/3769293-elvan", "userReview": "Back to back books about serial killers and the nastiness of these particular murders does not make this Christmas time book exactly festive. Add incest and overall creepiness and it's a good thing Eve and Peabody go head to head on the shopping for gifts/not shopping during work hours debate. It's also nice watching Peabody and McNabb share their Christmas Eve pie."}, {"userName": "Caro", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/5177773-caro", "userReview": "Frigid read! I loved the characters and getting to know them more. Fast-paced, twists and turns, emotions, family and friends, some action, and a good if somewhat a little somber ending. This had me whipping through pages, smiling, holding my breath, feeling, and gripping the book for dear life. A great read that you can't put down. Enjoy!Super great re-read and still enjoy!"}, {"userName": "Lisa Kay", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "★★★★½ Had to revisit this one for the holidays."}, {"userName": "Jessica", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/40203179-jessica", "userReview": "The love that Roarke shows Eve is one that I'm jealous of."}, {"userName": "Lena", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/35645863-lena", "userReview": "It’s Eve & Roarkes first family Christmas. They are decorating trees, throwing a party, and learning what it’s like to be happy and normal.But someone else is celebrating Christmas by dressing up as Santa and killing people violently.Eve’s not going to stand for it.I liked this one a little less than the previous but it was still page turning fast fun."}, {"userName": "Μαρία Γεωργοπούλου", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/4903642", "userReview": "Another great installment in this futuristic series by J.D Robb (aka Nora Roberts)! This time our favorite cop, Eve Dallas, must find a series killer who rapes and murder women and men in Christmas time. I am glad to see that after seven books this series the author continues to give us books with a quality. We still have a lot to learn for our favorite characters and for the futuristic world-building.I was sure that Eve would have a problem with this time of year. I was so right! As a woman with no good memories as a child, her reaction was expected. She is not used to have family and friends and now she has to buy presents for the people she cares about and have a party with her husband! Yes, that makes her uncomfortable. Sometimes she is abrupt and tactless she’s saying things in a wrong way. It’s good that she understands that she’s not right and she apologizes in her own way. In this book, because the case involves rapes, she takes it personal and she pushes herself too much. Some people will call her cold but I don’t think it’s true. I simply believe that she is afraid to feel. Rightly, if you want my opinion, because the one person that should have been there and take care of her, her father, was a monster who raped her when she was just a little girl. Roarke…. Best husband ever! Really, he’s there for her every step of the way. Sometimes it’s weird to see him put his own life behind so he can help Eve but his love for her and his need to protect her from herself is obvious. He’s still a mystery. Yes, we learn some things for his past but not everything and I am very curious about him. His need to belong and to have a family and make memories it’s obvious and sometimes I think that he knows Even better than she knows herself!Peabody is another character that I really like in this series and although she and Eve have some problems in this story, they care for each other a lot. It’s easy to see that Peabody feels lonely and that she has not the same mind with Eve and that means that Eve wants to protect her when there is no actual need for protection. Nevertheless, they respect each other and they always find a way to work things out. Also, I like this love/hate relationship between Peabody and McNab. I truly believe that they should give it a try and start a relationship! It would be hilarious! So, this was another great story with very well-written plot that I enjoyed too much! I just love this series!!!"}, {"userName": "Monica", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/2316533-monica", "userReview": "This was a tough one. It has been the hardest case for me so far. Not only was there a serial killer on the loose, but he was sexually attacking his victims. This was rough on Eve. It brought all those memories from being a young girl and having a monster of a father (I can barely type that last word). This case really wore down on Eve and I think it also was rough on Roarke. This is the first time, and last I suspect, that I saw him worn out and wanting more sleep. I loved seeing the lengths Roarke took to take care of Eve, even if it wasn't what she wanted. She definitely needed it and he knew that. She can’t rest until she gets her man, but the toll it takes on her is steep. This installment of the In Death series just reaffirmed that Eve is not just standing for justice, but she’s fighting for the innocent victims.I am still amazed at how much Robb (Roberts) is able to fit into her books. The case, romance, the development and growth of relationships (romantic and friendly), the futuristic aspects of the world she has created, humor, heartfelt moments, backstories, and everything else in between. She did not disappoint in Holiday. Eve’s relationships were strengthened and tested in this one. There were times I felt for her, laughed with her and felt that she was a tad bit out of line. But she’s new to the whole “family/friends” thing, so it’ll take her time to figure it all out. And I’m along for the ride."}], "description": "No one likes to be alone during the holidays. For New York's most posh dating service, Personally Yours, it is the season to bring lonely hearts together. But Lieutenant Eve Dallas, on the trail of a ritualistic serial killer, has made a disturbing discovery: all of the victims have been traced to Personally Yours. As the murders continue, Eve enters into an elite world of people searching for their one true love--and a killer searching for his next victim. A world where the power of love leads men and women into the ultimate act of betrayal...", "title": "Holiday in Death\n      \n          (In Death #7)", "url": "https://www.goodreads.com/book/show/238125.Holiday_in_Death", "average": 4.31, "cover": "https://images.gr-assets.com/books/1389932347l/238125.jpg", "reviews": 909, "authors": [{"url": "https://www.goodreads.com/author/show/17065.J_D_Robb", "name": "J.D. Robb"}], "type": ["Mystery", "Romance", "Mystery", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/238125.Holiday_in_Death", "http://www.goodreads.com/book/show/12143033-holiday-in-death", "http://www.goodreads.com/book/show/6699941-holiday-in-death", "http://www.goodreads.com/book/show/12401744-holiday-in-death", "http://www.goodreads.com/book/show/9185624-holiday-in-death", "http://www.goodreads.com/book/show/2502490.Holiday_in_Death", "http://www.goodreads.com/book/show/9999168-holiday-in-death", "http://www.goodreads.com/book/show/3062780-holiday-in-death", "http://www.goodreads.com/book/show/156293.Holiday_in_Death", "http://www.goodreads.com/book/show/479309.Naked_in_Death", "http://www.goodreads.com/book/show/268601.Glory_in_Death", "http://www.goodreads.com/book/show/238126.Immortal_in_Death", "http://www.goodreads.com/book/show/201175.Rapture_in_Death", "http://www.goodreads.com/book/show/268604.Portrait_in_Death"]}