{"ratings": 8091, "userreviews": [{"userName": "Just My Bucking Book Blog", "userReviewDate": "Dec 18, 2011", "userURL": "http://www.goodreads.com/user/show/6889136-just-my-bucking-book-blog", "userReview": "Title: Hollowmen (The Hollows #2)Author: Amanda HockingGenre: YA, Zombies, ApocalypticSeries: The HollowsPublication Date: November 8th, 2011\n3 BUCKING STARS!\nDo NOT read this review of Hollowmen unless you have read the book. A lot of the 'problems' I will be discussing in my review are huge spoilers from the book.** Instead of the traditional reviews that I usually do I'm just going to list out the problems, in my opinion, that I found within the books plot and characters. **\nPROBLEM #1\nNo Lazlo? Seriously? In the first book he was madly in love with Remy! He actually told her he wouldn't leave without and he would stay as long as she was there and he goes off in the first group out with Harlow. He clearly had no choice but why cut him out like that?\nPROBLEM #2\nWhen Remy finally does get a chance to talk to him they talk like they are strangers OVER A DAMN RADIO. I mean, seriously, it's being SIX MONTHS and all they have to say is how are you?? Are you bloody joking me? I hated this, they didn't say they loved each other or even that they missed each other. It's impossible to just cut off feelings for someone like that so I don't understand why that happened. I am literally baffled over it!\nPROBLEM #3\nRemy hooked up with Boden!! Oh my days, I knew it was going to happen. I actually thought it was going to be with Tatum but then he suddenly got killed off! I like Boden, really I do, but Remy is a damn slut hooking up with him knowing there is a chance Lazlo is out there waiting for her. Like literally waiting for her, they made a so called date to meet in Canada. I honestly scoffed when I read they hooked up, it made me so mad. (It was not a fun time, poor Lazlo! I really just hated he was like nowhere in this book)\n**Yes, most of my problems are about Lazlo, but it's total bollocks that he was nowhere in this book after being such big character in the first book! After finding Max, going after Lazlo should have being Remy's next quest. I mean, he helped her every step of the way in finding Max and she didn't even think about him at all during the book, it's so bloody stupid!**\n\nPROBLEM #4 \nHarlow died! That sucked but what's worse is that she wasn't in this book and we couldn't read it to find out how it happened. She was a main character in the first book so it was stupid to find out she didn't make it while Remy talk to Lazlo (They only time they did talk in the book and it was with that crappy bit of news) Ugh!Other than these problems I liked everything else (Except for Blue dying, that was so random and stupid. I almost put the book down when I seen he was a zombie) but there HAS to be a third book, no way it can end like that with not knowing what happened to Lazlo! If there's not going to be a third book I'm going to be beyond pissed!Okay, rant/review is over.Peace!\n\nJust My Bucking Book Blog"}, {"userName": "Jennifer", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "I want to start with the cute animated gif from my book 1 review shown above! Now how to even dive into this!!! I LOVED and HATED this with a passion! OMG I was dying for this and then HIGHLY disappointed by parts that really made no sense! I'm going to try to keep the spoilers down but a few will probably be seen, just a warning! So we ended in the first book with Remy locked up in the hospital of the quarantine. Six months later Remy is still stuck in that hospital undergoing gruesome and extreme medical tests and surgeries with no anesthetic. Zombies have become smarter and they break in and all the doctors and everyone runs out leaving Remy cut wide open on the table. She sews herself up(Yeah!) and runs out. She runs into Tatum in the hall and he explains that everyone has evacuated in small groups and that they are the last group of around 8 people. This is where one of my this made no sense RANT #1 comes in! WHY DID LAZLO LEAVE WITHOUT HER! He swore he would not leave the quarantine without her but he just took off and now she has no idea where he and Harlow went! The zombies disease is able to communicate with other zombies without being in close proximity. When one zombie finds a person it sends out for all the zombies to come! So the new plan is for all the people to break up into small groups and just run away north to where it is cold. Zombies don't like the cold(Who does?) so they have plans to head to Canada. Remy's group includes her mad scientist doctor, Daniels, an army guy Boden and some other new characters really not worth mentioning. Before they head north Remy insists on going to the compound where she sent Max and Blue six months ago. Boden, the quarantine army worker and basically head of the group, agrees hoping they can find more weapons because they are almost all out of bullets. So they venture out with the usual zombie attacks and fighting amongst themselves. Remy eventually finds Max and even Ripley. Then randomly they also find a radio where Lazlo's voice is coming through. NOW ENTER RANT #2! Lazlo is radioing out but he won't wait for Remy and won't decide a place to meet. They don't say they love and miss each other. It is just an awkward pointless talk. Why the hell was he even radioing out to people if he didn't want to wait to meet up with anyone?! THAT IS ALL HE HAS TO SAY TO HER AFTER SIX MONTHS! WTF!The rest of the story consists of Remy and her new gang heading north and slowly being killed off by zombies. Lot's of action but lacking a lot of the emotion of the first book. Don't get me wrong I enjoyed Boden but I just felt like it was handled poorly and that there was no real closure to Lazlo. RANT #3! REMY SHOULD BE LOOKING FOR HIM! Just ridiculous. So highly disappointed by the tiny one page of Lazlo we get! I am sure hoping for another book because I was not at all pleased with the way this concluded. Still an enjoyable read and I finished it all in one day. It was really short and I so hope for more. Just felt like many details were not explained or fully developed."}, {"userName": "Mina", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/5206143-mina", "userReview": "Wow, it all started going downhill on the 2nd page when doctors leave the heroine open and bleeding on the table, after a major surgery without anesthesia...and she sews herself back together, battles a bunch of zombies, and capers off with no residual ills to speak of. ummmm. I'll buy the zombie apocalypse but I draw the line somewhere...if this were a graphic novel I would've probably liked it. Writing was significantly poorer than the first installment, which was already questionable."}, {"userName": "Katrina Passick Lumsden", "userReviewDate": "Jan 05, 2012", "userURL": "http://www.goodreads.com/user/show/1964146-katrina-passick-lumsden", "userReview": "Where do I begin? I suppose at the beginning since it was there I first realized this wasn't going to end well. To be clear, I liked Hollowland, the first installment in Amanda Hocking's Hollows series. It had its problems, sure, but I liked the characters and had fun reading it. Hollowmen, however, was not so much fun as it was an exercise in patience. We begin six months after the end of Hollowland. Remy, our resident tough chick, has been in \"quarantine\" all that time, trapped in the medical facility while hordes of apathetic, bloodthirsty doctors perform experiments on her in an attempt to find a cure for the zombie virus plaguing the world. The reader is treated to a few brief, rather gruesomely detailed accounts of what Remy went through during the aforementioned experiments and procedures which seemed to center around the fact that the doctors regularly cut her open and splashed around in her vital organs like preschoolers in a mud puddle....all without the common decency of administering anything for the pain. This was the point where I began scratching my head and entreating the proverbial gods of literature to please, please tell me what the hell was going on. It's not that I don't understand the point Ms. Hocking is trying to make. It's not that I can't appreciate the fact that she's attempting to underline the philosophical debate about when man eventually loses his humanity. It's that I thoroughly disapprove of her mode of conveying these themes because it is ludicrous and nonsensical. A zombie plague has ravaged the world, a select few people are immune, these doctors have managed to get their hands on two of them, one of whom is currently in their custody and willingly subjecting herself to testing...and they care nothing about keeping her alive and healthy? Ms. Hocking's point is supposed to be that, in a world full of monsters, sometimes man is the biggest monster of all. This point falls flat, however, when she tries to imply that a monstrous disregard for others stems from mental retardation. These doctors hold the key to mankind's salvation and they're going to treat it callously? Without regard for the fact that the cure might just die with her if they're not careful? Is Ms. Hocking really trying to imply that these educated, competent individuals would be so desperate for a cure they would butcher its only source? Waste the life of the person who could be responsible for the salvation of the world? Being evil is not a side-effect of being stupid! If there were someone immune, they would undoubtedly be imprisoned and subjected to tests and procedures, but they would also be well cared for, the doctors not wanting to risk death or disease until a reason for the immunity was found. They wouldn't cut the person up and torture them, then shrug, throw up their hands and say, \"Hmm, it's too bad she didn't live long enough for us to find a cure.\" I mean, come on!*Pinching the bridge of my nose*Moving on. There is a zombie attack on the compound which causes the horde of evil minion doctors to scurry away like rodents, leaving Remy (yes, perhaps the only living key to a cure) strapped to an operating table, sliced open like a Christmas turkey. I'm not making this up, this actually happened. Remy manages to free herself from the table, clumsily and sloppily stitch herself up (foreshadowing, anyone?), and make her way out of the building. To make a long (and slightly familiar) story short, Remy ends up with a small band of six other people who want to make their way north under the assumption that the zombies don't like cold weather. Before anyone can leave, however, Remy announces she's going south to find her brother at one of the other compounds. She asks for neither permission nor company, but the de facto leader of the group, Boden, decides to go with her, citing there may be food and/or ammunition available at the other compound. Thus begins the first journey. Along the way, Remy encounters a zombie she knows. It's her friend, Blue, the one who helped her rescue her brother from the devil doctors and took him to the other compound. After decapitating him, Remy is left to ponder the ramifications of his infection. If Blue is here, infected, that means that the compound was most likely overrun by zombies and that they are, quite literally, on a suicide mission. Does she tell anyone? Nope. In fact, she hides Blue's corpse from the only other person in the group who could identify him and piece things together. Remy then hammers the reader with selfish justifications for her actions. She manages to convince herself that what she's doing is right, and she then never wavers from this conviction. She says she'll do anything to protect her brother, and that apparently gives her a pass regarding her complete disregard for the safety of others. And I'm supposed to sympathize with this selfish bitch? Anyway, they make it, they find Remy's brother, Max, holed up in the second story of a ransacked store with another child, Stella. They make it back out of town with no one getting killed (yup, absolutely no consequences for her actions), and begin the trek north. They lose some people along the way, there's some drama, some romance, some more stupid shit from Remy. She knows she's developing an infection where she stitched herself up, but she can't bring herself to ask Dr. Daniels for help because he was one of the people responsible for her when she was in quarantine. An infection that could quickly turn septic and kill her and she's too proud to ask for help? So much for being willing to do anything to protect her brother. It's OK, though. After Remy collapses, Dr. Daniels cleans her out with some booze, she sleeps for a couple of days, then she's all better. No, I'm not kidding. There's a near-rape which doesn't seem to serve much purpose other than shock factor and to give Dr. Daniels a slightly more dignified death than the more common ripped-apart-by-zombies mode of expiration. Would-be rapist Gen. Clark is introduced and allowed to leer and paw at Remy for a chapter or two until nearly taking her against her will over a motel room sink, stabbing Dr. Daniels in the stomach, then fleeing from Boden only to be caught and....well, ripped apart by zombies. This is the only purpose the character serves. He offers nothing else to the story.I loved Lazlo, the romantic interest from Hollowland, but he is conveniently tossed aside in this installment in order to make room for Boden, hunky army man with a heart of gold but very little personality. He had potential, but he was underdeveloped. There's some steamy hip action between him and Remy, however, and she admits she's falling for him, setting up what is sure to be a nicely melodramatic love triangle for the third book. One for which I'm certain one of the boys will have to die. Will it be sweet, naive Lazlo, who taught Remy to love again? Or will it be tough zombie killer Boden, Remy's kindred spirit who taught her (by way of a little light bondage) that it's OK to let go of your control every once in a while? Stay tuned.Aside from the horrible plot and the idiot protagonist, the writing itself was sloppy and juvenile. I understand this book didn't have an editor, and I can generally endure a hefty amount of typos from the self-published, but the amount of grammatical errors in this book made it glaringly obvious that Ms. Hocking couldn't even be bothered to read through her entries to weed some of them out herself. More often than not, there was at least one error on every page. If I managed to make it through a page without finding an error, it was only followed by finding two or three on the next. Perhaps I could have overlooked some of these flaws if the heroine weren't a completely selfish, immature, vile piece of crap. She's moody and ungrateful, and yet the only flaw she's ever called out on is her inability to relax and ask for help, her superhero complex, her unrelenting wish to save the world all by her little lonesome. When your wish it to portray a deeply flawed individual, passing off a tendency to care too much as her only objectionable trait is a bit puerile. Allowing her to get away with all the other objectionable things she does is infuriating. She blames herself for deaths that truly aren't her fault, but when she knowingly and willfully leads people into danger, nothing bad happens. How convenient. Not to mention annoying.Oh, and every single one of the supporting cast I liked from the first book? Gone or dead. Thanks, Hocking, thanks a whole hell of a lot.In summary, this book sucked. It was a bitterly disappointing installment after a fairly promising beginning. It did provide a few laughs, however. I think my favorite sentence in the entire thing would have to be this one: \"His face was buried firmly in a pillow, so I could unabashedly admire the counters of his back.\" Too good."}, {"userName": "Jess Leigh", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/5588802-jess-leigh", "userReview": "[warning: contains a couple spoilers for Trylle Trilogy~Ok so I was absoulutely in LOVE with Hollowland. I read it twice which is rare for me, and longly awaited it's sequal. Now as much as I love Amanda Hocking as a writer, I have still so far only read Hollowland, and the Tryle Trilogy by her. The Tryle triology's first book started out great, so i had bought both the second and third book after finishing. However, sequal completely dissipointed me. Much like Hollowland's sequal greatly disssipointed me. Now, Hollowland, no joke, was one of my favorite books of all time. Mainly because I was in LOVE with Lazlo, and I loved his and Remy's relationship. And then I also loved how Remy was a protagonist that actually could do things for herself, how she wasn't completely head over heels in love with Lazlo from the beginning, and instead took her time and waited for their relationship to grow. It made me really believe that they were truly in love, and that Remy wasn't one to just fall in love on an everyday basis. So I was expecting Hollowmens sequal to amazing too. Not to say I was expecting Lazlo to pop up at the first chapter (even though that would have been nice) I was expecting that throughout the entire length of the book Remy would have at least found him. But no, Lazlo make NO appearence in Hollowmen, I think he gets like one radio conversation with him and Remy saying \"Over\" after every four word sentence that quickly gets annoying. They don't even act like they love each other even though it could be the last time they speak to eachother. The entire thing kind of goes like this:Remy: Lazlo, Lazlo, are you okay? Over.Lazlo: Remy are you okay? Over.Remy: Ya, is Harlow okay? OverLazlo: No she died OverRemy: Oh, ok well I have to go, and I'll probably never see you again but take care of yourself. OverLazlo: .... oh okay bye Remy overWell maybe it didn't go EXACTLY like that.. but you get the point like come on, can't you at least say \"i love you\"? And I mean Harlow was a MAIN character last book, and that's all the acknowledgement you give to her death? Now even if the only bad thing was that Lazlo wasn't in the book, I could deal with it. I would understand that Remy was trying to find him, and Amanda would have written a really good book once again. BUT NOOOOO Amanda has to go and make the same mistake she made in the trylle trilogy. She goes and takes this random guy we didn't even know and first book, and makes our protagonist completely forget about her previous love intrest and instead fall in love with Mr. NoonecaresLike HELLO! From what I was held to believe Remy was a strong and SMART love intrest who deeply cared for Lazlo. So why the hell is she out there sleeping and falling in love with this guy when she still claims that she's in love with Lazlo. Now I don't know who this guy is, he could be amazing, he could be funny, he could be the absolute perfect guy for all i care. BUT HE'S NOT LAZLO. And the Remy I know would never hurt him like that. It's the fact that she even told Lazlo in this book that she was trying to find him, and that they would meet. And yet, she's sleeping with this guy, and claiming that she's \"never been happier\" I'm just very dissipointed, and even though I've waited months for this sequal, I doubt I'm even going to read it until the third book comes out ( I REALLY hope sh'e coming out with a third book) and I'll just be praying that somehow Amanda fixes this mess of an ending. And don't get me wrong I still think Amanda Hocking is an amazing, writer and I give her a lot of props for writing a believable story that actually made me get as angry and ranty as I did.  (hide spoiler)]"}, {"userName": "Jenelle", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/4794633-jenelle", "userReview": "I was so very excited to finally read this second installment of The Hollows books. However, I was sadly disappointed. I am a huge fan of Amanda Hocking. I have read every book she has written I have fallen in love with each one, except this one.It started with the very first few chapters and I knew I was going to struggle with the book. If anyone has read Hollowland then you know that Remy took her place in the research facility to spare her brother. Book two opens up with her in the facility after 6 months. They have been cutting her open, taking tissue samples, drawing blood, all to find a cure for the zombie disease. The masked doctors perform surgery on her while she's still awake. In the middle of one such surgery they have cut open her abdomen and are fishing around insider her when the alarms go off. So what to the doctors do? Drop everything and leave. Including leaving Remy behind. With an open incision in her stomach she some how gets out of the facility, only to start fighting off zombies, crawling through grass, hiking around like nothing happened. And on the second night she's doing push-ups? With basically just having abdominal surgery?? This is so highly unlikely it made me laugh! I've had plenty of surgeries and there is no way she could have done all that after just having her stomach cut into. She would more than likely not even be able to walk!My other issue with the book was how many conversations went like this: \"I'm sorry\" \"Don't be sorry, it's not your fault.\" I got so tired of the redundancy of this exchange.One more thing, there is a point at which someone is killed (lots of people die in these books, it's a zombie apocalypse), so there's a dead body on the floor, and two characters just start making out?? Ew! That to me was disgusting. There is a dead person and you are on the bed making out? Come on!!The first book made me care about Remy and her brother. The second left me wishing she'd ended the book with the first."}, {"userName": "Carol (StarAngel's Reviews) Allen", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/6294320-carol-starangel-s-reviews-allen", "userReview": "Loved it - but not as much as the first book.Why? Hmmm...the number one reason - no Lazlo, Blue, Harlow or any of the original characters.What saved the story? Ripley is back....Stella takes the place of Harlow.....the mean but gentle Dr. Daniel is along for the ride.Who takes the place of Lazlo? That I'm not going to spoil...but she does find love again! :-)Could there be another book or does it end like this?"}, {"userName": "Azbaqiyah", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/38427441-azbaqiyah", "userReview": "I'm always a fan for zombie and I like the thriller in it. Just like most all zombie story the ending seem to be unfinshed..."}, {"userName": "Becca", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/5116879-becca", "userReview": "Amanda's second book in her zombie series has serious follow-up teeth. In Hollowland (the first book) we met Remy King, our female lead, who displays toughness in a world gone crazy. She's managed to keep herself and several others alive. That's step one. But, her driving goal is to find her younger brother and somehow, someway, find a safe place for them both. Her journey to that end is dangerous and action-packed as a reader would expect in this type of book. Remy's toughness was tempered with just the right amount of vulnerability. My heart-strings were pulled and I bounced (like many others) on my toes; waiting not so patiently for the sequel. The sequel delivers! I stated in one of my updates that \"zombies scare me on the same cellular level as sharks - they tear, bleed and devour you while you watch them.\" The opening chapter catches humanity's ability to horrify you on that same cellular level. The journey that takes place after chapter one is full of twists, turns and death. That's as much as I'm willing to share...the plot sucks you in and won't let you go until the last scene.If you haven't read either book in this series, go correct that fact. The ebooks are either free or inexpensive. Couple that fact with the great characters, beautiful writing and full/scary plot, you have a winner (winner, chicken dinner!!!!)"}, {"userName": "Brigid ✩ Cool Ninja Sharpshooter ✩", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/886144-brigid-cool-ninja-sharpshooter", "userReview": "[But ... then he died. So that sucks. (hide spoiler)]"}, {"userName": "Mia", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/10607475-mia", "userReview": "ERGHPFFTBLEGGHH.i Just read Hollowmen -Amanda Hocking- and wanted to just . . . errgh, just throw the book of the floor. But I couldnt, because I was on my iPod. My God, that book is depressing. And THERE IS NO POINT IN HAVING THE PREVIOUS BOOK!!!!!! Except to depress the readers more. I mean Remy (the heroine) seemed fine with the fact everyone she was with in the last book (including the dude she apparently loved) is either dead or she won't ever see them again. And she just ups and gets a new boy - which I'm actually down with because i was team Tatum (Lazlo is just . . . erghh idk just not right for kickass Remy) but guess what?Tatum died. Straight up. No heroic death, just \"oh, im going for a pee\" then BANG he's dead. And this new story is based on characters we've never met before . . . okay with the exception of AMAZING Ripley the tiger . . . and we don't even see her til pretty late in the book. So, the previous book she's rolling with: Harlow, Blue and Lazlo. Last chapter is all the heartfelt, teary goodbyes; the \"i love you\"'s and the \"I'll wait for you forever\"....which I have to admit made me like Lazlo more in the first one, then (as I needed cheering up) I went and reread the first one and in this scene I wanted to punch him. In the face. With a metal pole. Now, first chapter is her getting TORTURED. But of course kickass Remy is dealing, still making herself stronger. (Unrealistic, I know) Then zombies have got into the compound so she escapes with Tatum (and at this point I'm thinking....awww she was tortured lets go kill thosee ...bleeeeeeeeeeep .... and OHMYGODDYAYYY!!! TATUM!!!!) so she asks about everyone else we actually KNOW ... and they've left her. They HAD to, but they didn't try get her out, check on her or ANYTHING. This Lazlo of \"I will wait forever\" blah blah BLAAHH!And then Tatum dies. BLERGH. And she sees Blue's dead corpse zombie thing. Depressing. And then (for you Team Lazlo's) she gets a radio with him on the other end. (This is quite far in BTW) And he's basically like \"Oh, yeah, I'm alive but we can't meet up because the zombies will kill us all, but we can meet up in Canada - no place, no time, no NOTHING but yeah, we can meet! Oh, BTW Harlows dead. Toodles.\"D.E.P.R.E.S.S.I.N.G.Oh and one of the people torturing her (literally cutting her open WHILE SHE WAS AWAKE because they didn't want to waste sedatives) is rolling with the group. Good news is, she's found her brother. But he was doing fine without her and doesn't add ANYTHING to the story. AT ALL.And also, by the time you get to ... not like because the extra characters in this book are completely POINTLESS and they have NO personality ... but by the time you get used to them they die. Seriously. Even the guy that tortured her, Remy becomes friends with. (Yeah, I was like ..Okaaaaaaaay as well.) EVERYONE dies except her new guy and this random guy they picked off the street. He says absolutely NOOOOTHING. The ONLY good thing is Bodem her new boy - he's kinda kickass too, army boy and that. In fact, he's kinda like Tatum. Just not dead. And them two get together and it ends with Remy like \"oh, I can't stop the end of the world, everyone's gonna die... but hey at least I have a nice guy to sleep with.\" -_____________-Considering I loved the first one, Hollowmen was just ...erghff. Crap is the wrong word, because Amanda Hocking can write - not literary write, I mean keep you wanting more and turning the pages . . . i mean, the books not BAD its just not something I like..."}, {"userName": "Nyimah", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/4517282-nyimah", "userReview": "Spoiler Alert.....................Hollowmen I'm not really sure how I feel about this read. I am an Amanda Hocking fan but I just didn't really care how this story player out. It just seemed overly brutal and I really didn't understand why she had to kill off all the previous characters it was like a favorite movie franchise got all new directors producers and writers for the sequel and they wanted to shake things up. And sometimes it was a bit inconsistent one moment she beheaded and older zombie with a broom stick. And the next time she had to hit an older zombie multiple times with a pan. And what's up with Lazlo being able to reach her by CB radio but be to far to. I mean the range on those things isn't that great right. ?!? And really she stitched herself up after multiple visisections and was doing crunches 24 hours later. I mean I know it's fiction and a zombie story but it just seems Remy kind of turned into an immortal super hero. I didn't hate it. I just was not happy with the direction of the story. Anywho still good writing that kept me engaged and I'm still a Fan :)"}, {"userName": "Kim", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/3113894-kim", "userReview": "Hollowmen starts exactly where Hollowland ended. Remy is in the quarantine being tested in every possible way for a cure for the zombie virus. The zombies are getting smarter and attacking all large groupings of humans so the quarantine disbanded and groups of humans left in all directions. Remy's main goal is to find her brother Max and she will go through anything & everything to do so. She unwittingly convinces her group to go along with her and this is all that I'm going to tell you. By my 5 star rating you know that I loved the book and can't wait for #3 to come out!"}, {"userName": "Jennifer", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/5719694-jennifer", "userReview": "I am so stoked for this!!!"}, {"userName": "Stephanie Moakes", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/11009566-stephanie-moakes", "userReview": "I was slightly disappointed by this book because although it picked up where the first one ended and the story never faltered it was almost an exact replica of the first book, in the sense that it was about Remy’s journey to find her brother again and then it swiftly turns into a journey across country to head to somewhere that isn’t overrun with flesh eating zombies.The one aspect of this book that really frustrated me was that I was hoping to find out more about the original characters in the first book but Hocking killed them off early on and introduced a whole new group to travel with Remy and although I developed connections with the new group of people it was hard not to think about Harlow, Blue and Lazlo. I missed Lazlo in this book, I missed his charm and carefree attitude and I was extremely disappointed that he was only present for a couple of pages because I was really hoping that Hocking would explore his and Remy’s relationship further instead of creating a Boden as a new love interest for Remy without a conflicting one.Again it was filled with brilliantly described action scenes and plenty of gore and there’s no doubt that Hocking is a beautiful storyteller but at the rate the characters are killed off I couldn’t help but feel that they were put in the story simply to fill up the pages. I enjoyed the book because I enjoy Remy’s world but I felt that the story had major holes in it and was again frustrated that there was no search for a cure to the Lyssavirus and the characters seemed to give up and just accept the world they are living in. The ending was sweet and I felt that the story came to it naturally but I was hoping for something that would provide some answers about the zombies and how exactly they came into the world but my questions remain unanswered. I can’t believe that someone with Remy’s nature would simply stop fighting and decide to settle down as a family, especially since from the beginning the story led us to believe that Remy and her brother were the only people that could save the world. I was hoping for another book but after reading Hocking’s blog can see that it’s unlikely there will be another one in the near future however if her plans change I will be looking forward to seeing what’s in store for Remy and her new family (also I hope Lazlo is thrown back into the story)."}, {"userName": "Amy Nielsen", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/1271874-amy-nielsen", "userReview": "You should read my review of Hollowland because a lot the same problems exist here as well and they start right away. Believe me, someone who has repeatedly undergone abdominal (and other) surgeries without anesthesia for 6 months will not be sane. They will have at LEAST post-traumatic-stress-disorder not to mention that surgeries like those depicted here take at least 6 weeks to heal even partially and yet she underwent MANY in 6 months time and was still able to hop off the table after being left there by all sorts of men who swore they'd never let harm come to her (Lazlo said he'd never leave and he did and didn't say sorry, nor did she ever venture to question his desertion!!! What??) *breathe* anyway, so she has to sew herself up, kick some zombie butt and then trek all over the country while recouping from yet another MAJOR abdominal surgery. Wow. Not even to mention her conversation with Tatum directly after her escape was so ridiculous in context considering WHAT SHE HAD JUST BEEN DOING!! How can that be so minimized. It just felt soooo contrived!This book is more of the same running around...find Max again...find another safe haven. Mirror image of book 1. We even found another stud for her to fall into bed with for who knows why since THAT relationship came out of nowhere. Some big long weird kiss in the room where a dead man lays, then nothing....then wham...they're in bed and playing house. Um Serg...AWKWARD. He's a little third wheel, right? No third book that I can see but this book did totally ended in the middle of nowhere, like no real ending at all. Like she just decided to be done after this paragraph. And nothing that's really causing me huge angst to get my hands on #3. They found a safe haven, zombie shows up probably alerts more zombies before he dies but no one seems too concerned and even though the zombies have virtually destroyed every concrete quarantine they've ever been in, Remy is evidently confident they can protect themselves in this house. That's laughable. I would have preferred a possible ending where a chance of total zombie annihilation presents itself. That would have made for a more enticing #3. As it stands, I have no faith for this little group. They won't see the next winter. They're going down."}, {"userName": "Tom", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/7476704-tom", "userReview": "More like 4.5 and I enjoyed this book so much more than the first. I really think it might have been a mood thing with the first book or maybe just because the world building was done in it, either way this book flowed from start to finish for me.Series books reviews…uggh Remy’s story starts off in the hospital in a very dark situation. She never gives up on her quest to get back with Max and find some kind of life in a post-apocalyptic zombie world.As I said earlier this book just flowed for me. And the intensity of her feelings really came out in the book, especially in the beginning. It was scream at your kindle moments where you want to just jump in there and beat someone’s ass!! I can totally see where the 5 stars reviews from my friends came from. Maybe it was my mood or something because there were so many characters that I really grew to like that “bit” the dust(pun intended) but while I’m reading it I was more like DAMN IT!! REALLY?? I don’t know why I didn’t get choked up at the loss of any of them. It’s not that I wasn’t engrossed in the story?? Maybe because there was just so much death that it was numbing. I really thought the story was going to take a different turn but loved the direction it went in and loved how it ended."}, {"userName": "Becky Johnson", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/24460767-becky-johnson", "userReview": "Gosh I love this duology so much. Very different and not a lot of romance. It focuses more on protecting her little brother and finding a safe place which is great."}, {"userName": "Trina", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/1451999-trina", "userReview": "This was pointless."}, {"userName": "Laura", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/2924342-laura", "userReview": "[Remy was important and she needs to stay alive in order for you to test her, so why would they treat her like crap to the point that they probably almost killed her a number of times? Also, why would they leave her when during the evacuation if they need her to create a cure? (hide spoiler)]"}, {"userName": "Bad Clown", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/21549544-bad-clown", "userReview": "I said I wasn't going to do it. I SWORE I wasn't going to do it. After reading the GODAWFUL stinker Hollowland, I swore I wasn't going to read the sequel, or ANY book by this hack \"author.\" But I am a curious sort. Morbidly curious, but curious nonetheless. Maybe a bit masochistic and a glutton for punishment. Anyways, whatever the nature of my mental failure, SONAVABITCH if I didn't get snookered again. Hollowmen is as bad- possibly WORSE than Hollowland. I say \"possibly\" because it really can't get much worse. But Ms. Hocking gives it a valiant effort. I gave it a good shot, but this turd of a book immediately became a hate read.I knew within just a couple of pages that I had been had again. As lazy as Hocking was with Hollowmen, she was even more so with this stinker. First, she STILL doesn't know what things are or how things work so she just wings it. For example, it would likely take about thirty seconds to get on google and learn:* What firearms the military uses. They do NOT use \"service revolvers\" as Hocking laughably believes. * That a person who has been imprisoned for six months, starved, and subjected to many, many experiments, \"dissection\" and \"biobsies\" would not immediately be able to get off an operating table, sew themselves up and then run around and fight zombies all in a matter of hours. Yep, we're to believe that a malnutritioned Remy can, after SIX MONTHS of \"constantly losing blood and occasionally an organ,\" escape her restraints after being cut open on an operating table, sew herself back up, escape a compound on her own two feet and immediately start fighting zombies. NO, you read that right. Remy was constantly losing blood and OCCASIONALLY AN ORGAN. The only reader who would swallow that tripe is one who has lost a major organ from his or her HEAD.* That it takes more than a just few days to hike from Utah to Idaho and from there to FREAKIN' CANADA. Come on, Amanda. Take two minutes to look at a map and look up distances!You know, I could go on and on about things like terrible spelling, terrible punctuation (commas are sprinkled throughout willy-nilly like grains of salt on bad fast food), typos, LAZY repetition (the word \"zombie\" appears about 20 times in any given 2 pages) and the fact that Hocking's writing style is devoid of emotional context, a monotone, robotic laundry list of events involving all new characters we don't care about. I could write on and on about all the crappy, LAZY way she shrugged off nearly all the characters from the first book and started over with a new set of characters she pulled out of her butt (well, she didn't pull them out of her HEAD. That takes creativity). But I have squandered far too much time on this drivel. I will NOT. I SWEAR BY ALL THAT IS GOOD AND SACRED that I will NOT punish myself with another load of manure by this author. EVER. This time I mean it."}, {"userName": "Beth", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/4979792-beth", "userReview": "Ever since watching The Walking Dead and picking up Amanda's first zombie book, Hollowland, I've been very much enjoying the idea of a zombie apocalypse (well, as long as it never actually happens). This book did not disappoint me in the least. Much like the first installment, the action very rarely stops, and there is a diverse cast of characters whom you grow to care about. When they kick the bucket (as they will, a LOT), you'll wince, you'll loudly cry out \"no!\" while reading by yourself in a restaurant, and you'll genuinely feel a bit of loss. To bring these kinds of emotions out of a reader is an accomplishment, and Amanda Hocking did it well.So many times when a well-liked character was killed I had to stop myself from becoming annoyed and realize that if there truly were a zombie apocalypse, that is exactly what would happen. With small groups of survivors trekking across the country, you would be losing people left and right. Having everybody survive unscathed would have been the unrealistic way to go, and Amanda chose not to take that route. I read in her Facebook posts that she \"took some risks\" with this book, and I think that is likely what she was talking about.Some people have said they were disappointed that Serg turned out to be \"nothing.\" Well, not really. He turned out to be a good guy among plenty of evil guys. We needed that contrast to show that in an apocalyptic world, we never know who we can trust - we never know when letting an outsider into our camp will be a good idea or a bad one, and sometimes we just need to take a chance.The only reason I give this book 4 stars instead of 5 is because of those darn typos and word omissions. At this point, when someone is selling thousands of books, it is inexcusable to me to publish something with that many errors. They become quite frequent towards the end, making me wonder if anybody proof read this at all - maybe not even Amanda herself.Still, I loved the book and highly recommend it. Even if you don't think you like zombies, Amanda Hocking may very well change your mind."}, {"userName": "Alex", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/2891880-alex", "userReview": "I had a love/hate relationship with this one, but for me, that's a good thing. It was like I didn't want to read it, but when I started I couldn't stop reading. There's such a capable voice here. You want so much for Remy and you want this all to be over. You scream out, \"I NEED THIS TO STOP.\" But it doesn't and that's scary. Because the whole time you're like, \"Well, what would I do?\" And as you're starting to care for the characters they end up dying grotesquely and then you have to move on as quickly as Remy does because everyone is just trying to survive, they just don't know for what yet. This is a book where Things Happen. They happen and they just keep happening so it's impossible to talk about it without spoiling things. So if you just want to know if it's worth it to pick it up, then it is if you read the first one, because come on, Remy is in the quarantine and their are still zombies out there and what's gonna happen with her? And her brother? And Lazlo? And Blue? And everyone else in this crazy zombie-filled America. So that being said, characters are going to be ripped away from you. One second people are talking and the next they're getting eaten, and you're like WHAT?! Yeah, and people you may have thought to be pretty big characters from reading the first book won't even be on the stage. This is Remy's story, and it's not supposed to be pretty. It's going to be tense with action and fighting and zombies showing up in unexpected places, BUT COME ON, YOU SHOULD HAVE KNOWN THEY WOULD BE IN THERE! Just..don't count on anything. Everyone is up for grabs. You get to meet new people in this one, whom I sort of enjoyed more than the first book. I like the band she's running around with this go around. I like a certain soldier. I like how tough her brother is. I like the end, even if I want RESOLUTION. But then, thought to myself, \"No, this is good.\"And it was.But spoiler alert.RIP Blue. Damn, that one was tough to take."}, {"userName": "♥ Ashleigh ♥  contrary to popular belief i'm not actually mad!", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/4690797-ashleigh-contrary-to-popular-belief-i-m-not-actually-mad", "userReview": "this book was SO MUCH BETTER than the first one!! of course Remy still did pretty unbelievable things but not like in the first book, it was toned down a bit which was great, though i imagine a half starved person wouldnt be able to do the shit she did in this book let alone if they had been repeatedly cut open and had blood drawn from them, but it was pretty easy to get over and just enjoy the book.the emotion this book put me though was pretty incredible especially for such a short book. i laughed, cried, smiled, was horrified and constantly kept on my toes! and the pacing was great, it didnt come across as rush or anything - which i find tends to happen when this much stuff is going on and its not a big book but Hocking out did herself with this one.Oh and dont get me started on the characters!!! my fave was deff Boden, no idea why i liked him so much but from the start i had a good feeling about him, thank good his relationship with Remy actually made sense this time, Laz was just a moron. max was as cute and adorable as always. his relationship with Remy was precious, i have to admit to being really jealous of it!! :Pif u hadnt gotten the idea yet of how good this book was let me tell u i started this book at 11pm thinking i'd read for about an hour and go to bed but i coundlt put the damn thing down!! i just kept saying just a little bit more and the only reason i stopped at 4AM!! was cause i had finished the book! it was just that good it didnt matter how tired i was i just HAD to keep reading!not sure if there's going to be a next book but if there is it had my name on it :P"}, {"userName": "Cindy Reid", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/4832158-cindy-reid", "userReview": "Wait, so...I'm just reading along and then suddenly...the book is over. How long was this? Like twelve pages?! (Okay, I admit that I'm being sarcastic on that point.) Was there a conclusion? Well, yes, I suppose there was. Was there a plot? Hmmmm...um, kind-of?If there ever was a way to like something while feeling extreme disappointment in it, Hollowmen was it for me. I think it's that I expected more from it. Hollowland was the ultimate end-all for me. It had everything that I love. Hollowmen started with the same basic elements but just couldn't stack up.Don't get me wrong - I enjoyed it, I guess. It was entertaining. But honestly, giving this four stars is stretching it for me. I think I might have thrown an extra star on this rating because my feelings for Hollowland were actually closer to a six and I couldn't include it there.So, why was it so disappointing? (I won't be doing any spoiler-age here.) There is a nearly complete lack of emotion. I also felt like most of the story was told instead of shown (I realized toward the end that I had no clue what ANY of the characters looked like besides Remy.) Death - just, you'll see. Of course there's lots of death, you say, it's a zombie book! To this extent? I don't know, maybe I'm being cynical. Lastly, but possibly most importantly, Lazlo. That's all I'll say on him, since you readers will find out for yourselves. Trust me, I like Boden - in fact, I really like him. But, Lazlo is just such a great character!*Sigh*, this had better not be the last book!"}, {"userName": "Anakah", "userReviewDate": "Sep 08, 2011", "userURL": "http://www.goodreads.com/user/show/5169932-anakah", "userReview": "[I loved the first one and was really looking forward to the sequel. I am extremely disappointed. The first one was very well thought out and didn't jump around all over the place like this one. I wanted to see how things progressed with Remy. I also expected her to somehow be saved or atleast reunited with Lazlo. She gets a whole new love interest and despite all her medical issues she's still almost super human as she battles the zombies. And speaking of zombies, suddenly they are smarter and have changed tactics but how and why is never explained. It's like she just gave in to the world be messed up and kind of oh well-ed the world and wanted to live in her pretty house with all the new characters. I hated that they killed off Blue, Tatum and Harlow. Really?? There was no plot in this one. She got out, found her brother and the plot fizzled. Their main goal? Let's go to Canada.  I wish this book had gone another direction. They never explained why Remy and Max were immune and to me it all just fell flat.  I did like Boden but I missed the chemistry between Remy and Lazlo. This one was more serious and had fewer laughs. Overall, I'm glad the book was only three dollars. (hide spoiler)]"}, {"userName": "Michele Wesley", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/42255387-michele-wesley", "userReview": "I enjoyed this second book as much as the first. I love a good zombie story and this one did not disappoint. I am curious to know if Remy will reunite with Lazlo and if they will figure out Remy and her brother's immunity to help what's left of the human race. I also love Ripley the lion. Overall, this is a fantastic series so far and I hope there is more to come."}, {"userName": "SheLove2Read", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/1708674-shelove2read", "userReview": "After reading some of the reviews, both good and bad, it seems like this would only piss me off to read it. Let's not and say we did."}, {"userName": "Anjana", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/5741554-anjana", "userReview": "\"This is the way the world ends - not with a bang or a whimper, but with zombies breaking down the back door.\"Nineteen-year-old Remy King is on a mission to get across the wasteland left of America, and nothing will stand in her way - not violent marauders, a spoiled rock star, or an army of flesh-eating zombies.Incase you haven't read Hollowland, let me start at the beginning.This series is set sometime way in the future where America (and possibly the rest of the world) is basically a wasteland since the spread of a virus known as 'Lyssavirus' which has turned most of the human race into zombies. It follows Remy King, the female protagonist, who goes across America in search of her eight year old brother, Max. She's formed herself a little group consisting of a Vegas show tiger, an ex-rockstar, a med student and a 13 year old girl who accompany her on this search. Max, like Remy, is immune to the virus for some reason, meaning they can't get infected. When Remy finally finds Max, turns out he's been tortured and used as an experiment by the last surviving scientists/surgeons who're trying to find a cure to the virus. In order to save her brother, Remy volunteers to take his place since they share the same gene. That's where Hollowland ends. I'm a huge fan of apocalyptic/dystopian/steampunk novels, especially ones that involve zombies because lets face it, they're AWESOME! I read Hollowland a few months ago and I loved it! So, obviously, I've had extremely high expectations for its sequel (having waited months for it to release).Amanda Hocking has created an awesome protagonist in this series. Remy is strong,brave and tough as nails. In Hollowmen, while she continues to be all those things, she had lost a bit that unwavering determination to survive - which I guess is understandable. I suppose Remy has changed. After what she went through it's natural, but I put her on a pedestal where she kicks ass no matter what. That's my own fault. However I expected more from this one. Hollowmen picks up 6 months after Hollowland. I had assumed that half of this book would be about the experiments but thank god it wasn't. The zombies have attacked the shelter Remy's at and almost everyone has evacuated or ended up dead. Remy leaves with the last group of people leaving the shelter and this book follows their adventures from there. While I wasn't disappointed, I did want more. First of all, this was way too short, at least seemed much shorted than it's prequel. That sucked. Also, Lazlo? He disappeared!!! I heard like 3 LINES from him! I don't blame Amanda Hocking for this though. I knew the minute I got to the part with Lazlo that Remy wouldn't end up with him. I understood why,although I'm not too happy about it. With Lazlo, Remy would always have to protect him, always be the stronger one. She's a survivor but he needs someone to take care of him. At least, that's what I think Amanda Hocking tried to create when she thought of his character. Boden on the other hand, he's capable of taking care of Remy. Hell, he does it from the beginning! I do like him, but he's not cute or happy like Lazlo. Lazlo had some lightness to him that I missed in this book. Anyway I'm mentally prepared for Remy to end up with Boden now, so if the final book goes the other way I think I'd have to pull my hair out. To be honest though, if Boden didn't exist and I didn't know this would happen, I would not have liked this book. There was no actual story to Hollowmen (except the part where they had to get to Canada).. it was way too short and too many pages were wasted on unnecessary stuff. The story's supposed to grow as the series progresses-get faster paced, more gripping, develop characters and such. While this book did grow in some aspects, it let me down in others. Also, I need longer books!That being said, I'm a huge fan of Hocking so I can't not like her books. I do like Hollowmen but am just not completely satisfied with it and I feel that it's not one of her best work. Anyway, its still a good read and I would definitely finish this series. Hope the next book makes up for what this one lacked."}, {"userName": "Jennifer", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/3945821-jennifer", "userReview": "Ok,wow, I'm not sure where to start, to be honest. I have been waiting since February, when I finished Hollowland, for this book to be out. I've been very busy with my review blog and life so I hadn't been stalking Amanda's blog for information like usual. I was surprised when I saw a Facebook post that it was available. It was an easy read, I breezed right through it. When I got to the end I thought \"Wait..What? That's it?\" It seemed like such a short read. This book picks up with Remy at the quarantine and what she had been through to get to the quarantine seemed like a walk in the park compared to what she is and has been going through. Because she is immune to the virus, the doctors have been using her as their lab rat to find out why and more about the virus. I have a pretty strong stomach but I even cringed a little at parts. One minute she is laying on a cold steel table being cut open and the next the alarms are blaring and she is left alone. After finding her way out of her predictable, as only Remy can, she meets up with others that were left behind and they all start off to the north, where it is colder and hopefully zombie-less. Remy is also hoping to find her brother along the way. During their travels and struggle for survival, their group gains some members...and looses some members. Overall I enjoyed this sequal, it was fast paced kept me wanting to read more. I enjoyed the ending (which I'm not going to discuss as don't spoil it for those who haven't read it yet). BUT, I could not give it 5 stars for the fact that by now, as popular and \"big\" as Amanda Hocking has become, I would of expected one, maybe two, grammatical errors. Things like pick tables instead of picnic tables or words missing to make a complete sentence (usually of or an) meant the difference between that last star to me, as I take grammar and spelling into consideration when writing my reviews. I know no one is perfect but the errors were little ones that should of been caught. I'm not sure if there will be another book in the series or not and I'm not sure where it would go after the ending of Hollowmen. All that said, I would recommend Hollowmen, or any of Amanda's books for that matter, and would like to read both books in this series again!"}], "description": "After six months in the quarantine, Remy finds out things are much worse than she feared. Her plans to escape come with a heavy cost, and she realizes that zombies aren't the worst of her problems.", "title": "Hollowmen\n      \n          (The Hollows #2)", "url": "https://www.goodreads.com/book/show/14588796-hollowmen", "average": 3.97, "cover": "https://images.gr-assets.com/books/1355033507l/14588796.jpg", "reviews": 599, "authors": [{"url": "https://www.goodreads.com/author/show/3486415.Amanda_Hocking", "name": "Amanda Hocking"}, {"url": "https://www.goodreads.com/author/show/3119333.Eileen_Stevens", "name": "Eileen Stevens"}], "type": ["Horror", "Young Adult", "Science Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/14588796-hollowmen", "http://www.goodreads.com/book/show/13037406-hollowmen", "http://www.goodreads.com/book/show/10579347-hollowmen", "http://www.goodreads.com/book/show/31351188-hollowmen", "http://www.goodreads.com/book/show/12180581-switched", "http://www.goodreads.com/book/show/11966216-torn", "http://www.goodreads.com/book/show/11947829-ascend", "http://www.goodreads.com/book/show/30123368-my-blood-approves", "http://www.goodreads.com/book/show/30123388-fate"]}