{"ratings": 53307, "userreviews": [{"userName": "Betsy", "userReviewDate": "Sep 14, 2007", "userURL": "http://www.goodreads.com/user/show/380493-betsy", "userReview": "Holy shit (literally). This book is riveting. It is a fictional novel based on the life of a guy named Jesus who is one badass motherfucker. The book chronicles some of his totally rad and awesome adventures, such as turning water into wine and coming out of a cave after he died! Any lover of fictional adventure books such as harry potter will love this book. It does have some slower parts, but it picks right back up every couple of chapters (the chapters are creatively named after people!). Also, I learned a lot from this book. It had some good messages, such as how killing and being gay are wrong! Happy reading!"}, {"userName": "Jon", "userReviewDate": "Sep 05, 2007", "userURL": "http://www.goodreads.com/user/show/316293-jon", "userReview": "As nothing more than a piece of literature, this isn't even a good book. As a basis for religion, life, and/or government, it's dangerous. The entire Old Testament is filled to the brim with outrageous fiction and illustration after illustration of a diety who can't make up his mind, doesn't think rationally and is ruled by emotion, and reigns down punishment on beings he created, knowing that the very composition of their beings would lead them away from his will. This diety created two imperfect beings and set temptation directly in front of them and when they disobeyed him, he was angry and told them to go make more of themselves. When they did, he got angry with how disobedient they were and wiped them all out through extremely elaborate, ineffective means on more than one occasion...well, almost all. Nobody even knows who wrote the books of the Old Testament or exactly when they were written but they take them as absolute, inerrant fact passed down from the mouth of god himself.The Gospels of the New Testament are nothing more than an illustration of a diety playing the part of a neglectful, absentee parent who, again through extremely elaborate and ineffective means, attempted to \"get back in touch\" with his creations using a middle-man. The letters from Paul that comprise pretty much the remainder of the New Testament are nothing more than the narrative of a mass-murderer who never even met the man over whom he spent so much time raving. Who wrote Revelation? Nobody knows, although there's plenty of speculation. Have the prophecies in Revelation come to pass? Nobody knows, because everybody has interpreted them a different way. Oh sure, I could write something cryptic on a piece of paper about two women being pregnant with the same baby and eventually something would happen where I could twist my words just enough to prove my statement. But that wouldn't make it fact.If you want to read a book, don't bother with this one. If you want a basis for belief, just look around you and think for yourself. If you want to be a sheep and ignore the logic and reason inside that brain that *god* gave you, this is your book!"}, {"userName": "Carole Bartholomeaux", "userReviewDate": "Oct 02, 2007", "userURL": "http://www.goodreads.com/user/show/449845-carole-bartholomeaux", "userReview": "I got my first Bible in 1974 and have been reading the Bible nearly daily since then. I have at least six Bibles. Two of them are falling apart, I've read them so much. God has such a great sense of humor. Whatever page I turn to, there is a message of what I need that day. I was born three months premature and the doctors did not expect me to live. Prayer made the difference. I cannot get through a day without prayer; I do not know how anyone does. The Bible helps me through the worst times in my life. I highly recommend it to anyone who is Christian. I highly recommend the Torah or the Koran to anyone who professes to be one of the other major religions in the world. By reading the Bible, one gains peace. If we as individuals are peace filled, we might bring peace to others in our world and peace to our world. It's worth a try!"}, {"userName": "Mountainman91", "userReviewDate": "Feb 04, 2008", "userURL": "http://www.goodreads.com/user/show/862547-mountainman91", "userReview": "The Bible, Hmm, how do you review God's Word? people have attacked it, scientists have expended their best energies trying to disprove it, governments have butchered millions to kill it, bu it remains 'For if their purpose or activity is of human origin, it will fail, but if it is from God, you will not be able to stop these men; you will only find yourselves fighting against God.'"}, {"userName": "Caleb Barrows", "userReviewDate": "Aug 19, 2007", "userURL": "http://www.goodreads.com/user/show/290930-caleb-barrows", "userReview": "It would be an understatement to say that this book changed my life. Knowing this book and its author is my life. Just today I read Psalms 81 and Romans 5 and it breathed life and mystery into me for my day. I have learned to better love the Saviour and hero of this book, Jesus Christ, and what my identity and life is in him. I would say that this book best compares to the food and water that we need for our bodies. In the same way we desire more food and drink throughout our day, so in the same way I thirst for the words of this book and the author of them. it is also interesting to learn how many people have died for the preservation, diginity, and spreading of this powerful book. What makes it so consuming and dangerous? What compels people to die for it? It is simply a beautiful book that can change the hearts of men and women."}, {"userName": "Werner", "userReviewDate": "Mar 07, 2008", "userURL": "http://www.goodreads.com/user/show/903390-werner", "userReview": "Note, Jan. 18, 2017: I edited this review just now to correct a typo.I've read the Bible multiple times, and intend to keep on reading it for the rest of my life. I know it to be God's communication to humanity, written by men under the guidance of His Spirit, and revealing His nature, His love, His plans for the universe and for our salvation, and the principles by which we should live. It's a bedrock foundation of truth on which to build our lives."}, {"userName": "Ij", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/4341680-ij", "userReview": "I have studied and read parts of the Bible throughout my life. However, I was never able to read the Bible from beginning to end. I failed each time I tried. I had even tried various Bible reading plans. I think what I lacked at that time was commitment. Well last year about this time I tried again. This time I set time aside for devotion and Bible reading, each morning. I placed my Bible and computer on my nightstand. I used the Our Daily Bread webpage for devotion. It is a very short read with Bible passages. The site also had a Bible reading plan which I followed. I found that using the Bible Gateway webpage for Bible reading helpful. One can also listen to an audio Bible as you read, the New International Version.I intend to keep using this plan, since I don’t believe one reading was enough for me to have a spiritual understanding of all that I read. I feel blessed to have had an opportunity to accomplish this goal."}, {"userName": "Beth F.", "userReviewDate": "Nov 13, 2008", "userURL": "http://www.goodreads.com/user/show/1310564-beth-f", "userReview": "How does one rate the Bible? Honestly. I’ve just spent the past 20 minutes reading GR reviews. The glowing reviews made me laugh (oh you, lol). The bad reviews made me laugh (oh you, lol). I’ve only ever read translations, so I can’t rightfully give it 5 stars. And I’m not interested in learning a foreign language for the sole purpose of reading it, so I probably never will give it 5 stars. But it has been around for a very long time and most of the books published in the world don’t have that kind of staying power, so I think it deserves more than 1 or 2 stars, even if you don't agree with what's inside it. So anyway, I’ve settled on 4. I haven’t touched a Bible in ages (aside from dusting it off) but I have read this book in its entirety, both for personal and educational reasons—I went to a private college where we were all required to take a class called “The Bible.” It was actually one of the more interesting classes I’ve ever taken because even though it was taught by a Lutheran pastor, we were studying the events from a historical perspective rather than from a religious standpoint. It was fascinating."}, {"userName": "Teo", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/4647185-teo", "userReview": "The Holy Bible is a fictional historical epic with elements of fantasy, and the supernatural in general. Epic is a word not out of place here, for the Holy Bible is indeed a very hefty read. There are actually various versions of the texts, the Hebrew and the Christian. I will talk about the Christian edition here, so when I say Holy Bible I will refer to it.The Holy Bible is primarily divided into two big chapters; the first is called the Old Testament, and the other the New Testament. Each of the two Testaments has its own subchapters, with the latter in reality being a spin-off of the former. The Bible does not have a plot, in the real sense of the word. In fact, it is much like Tolkien's \"Silmarillion\" which could be basically seen as an improved, and definitely more interesting version of the Bible.The central character in the Old Testament is a supernatural being referred to as God, or Yahweh. It is set in an alternate reality where he creates the world and humanity. What we basically follow are the lives of various humans and their adventures throughout a long span of time, in which God plays an active part.In the spin-off, the New Testament, the main hero becomes a lowly carpenter, and allegedly the son of God, by the name of Jesus. Even though ordinary in appearance, Jesus has magical powers and is in fact himself considered a deity. He decides to travel around the world, gathering disciples, much to the annoyance of the ruling Romans which do not look lightly upon it - they fear this mysterious wizard Jesus that came out of nowhere could be a threat to them. In this part of the Bible, God plays only a minor role, appearing only in specific instances crucial to the advancement of the plot.Although from the plot summary, it may seem that the Bible is indeed and intrigue-filled and exciting read, it is not. There are so many problems with it I don't know where to begin.First, and most important of all, the writing style and verbosity are piss-poor. In all honesty, it is style-wise a literal abomination. There are many, many repetitions in the narrative, and the story is conveyed in an almost childish form of sequential expression, like \"Character A did this. Then he said: \"blah blah\". Then character B went there and did something else.\" Believe me, it gets tedious very, very fast. Not to say, it is at times so convoluted, it'll make your brains hurt.There is also very little to no character development, let alone character descriptions. People and deities pop out of the blue, enter abruptly, and leave even more so. In addition, about 80% of the characters are total fillers, sons of sons of sons mentioned in name only and holding no relevance to the story. You know a book is bad when all you know about your main hero is his name; you simply cannot connect with him, or any other, for that matter.The exact same issues are with locales. Not a word of the surroundings, and basically you have no idea how the world the story takes place looks like.Besides, there are obvious inconsistencies even within the small amount of development present. For example, it is said that God is an all powerful, merciful supreme being on a higher state of evolution unfathomable to our puny minds. You would assume that if such a being indeed existed, it would have advanced beyond petty human concerns and concepts such as revenge, jealousy, egoism or hate. Well, despite his alleged kindheartedness, all this God does is throw threats at his subjects, and then proceeds to punish them in many painful ways - often condemning whole generations for the supposed sins of one man or woman. He demands unquestionable obedience and even gives an ultimatum - live your life as I command, or forever face eternal torment in a horrendous place called Hell. Basically, God is the ultimate opportunist: he will aid you only if it will somehow benefit him in the future. If not, he won't move a finger (and there is likely a chance he'll put a curse on you for bothering him).He is also quite bloodthirsty: in the case of two brothers, Cain and Abel, for example, he shunned Cain's tribute consisting of products of the land (fruits and such), while he looked very kindly upon Abel's blood sacrifice in the form of slaughtered animals. As the story develops, God, more or less directly, is responsible for several genocides and other criminal acts.In the spin-off, the New Testament, there is a blatant occurrence of a shortage of ideas. There, the course of Jesus' life is accounted by four different writers with minimal differences. So, you could say, you get the same event re-told four times. I mean, really, shame on you.Although there are many battles and action scenes (I said before the book covers a very great time span), they are written no better than the rest of this shlock. Overall, a serious rewrite is needed if this is ever going to become at least a somewhat enjoyable read.And it is simply mind-boggling, that despite its major flaws, and almost no redeeming quality, this \"literary\" piece is regarded in such a high esteem. The farce goes even further, and the Bible is officially the world's #1 bestseller of all times, having sold billions of copies worldwide.Avoid this by all means; read Tolkien instead."}, {"userName": "Molly", "userReviewDate": "Nov 23, 2008", "userURL": "http://www.goodreads.com/user/show/769943-molly", "userReview": "Marx said religion was the opiate of the masses, it's more like religion is the skirts feebleminded people hide behind to flee from personal responsibility and thought.Sad this bunch of dross inspired so much violence and hatred through the centuries and still does.ETA: Had to read this again for summer 2009 class - it's even more unbelievable to me after a refresher that anyone could believe one word of this and think it's the word of anything but humans bent on building a power base. the Old Testament doesn't even pretend there aren't \"other gods\" at the time of Jehovah's attack on every poor soul who happened to live where he wanted the tribes of Israel to settle. It's basically a chronicle of how some bumpkins who had the attention span of a fly were bullied and forced into mass murder so one \"god\" could become famous and powerful."}, {"userName": "MichelleMarie", "userReviewDate": "Jul 31, 2007", "userURL": "http://www.goodreads.com/user/show/231854-michellemarie", "userReview": "The only book to CHANGE the course of my life. To give me hope, something to feed on, something to guide me when I am lost, something to make me cry, fills me with awe, helps me find words to express and pray"}, {"userName": "Natalie Vellacott", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/34178791-natalie-vellacott", "userReview": "This was my Bible version from my teens until mid 20's and is therefore covered in colourful stickers and scrawled writing. It provides a good middle ground between versions like New American Standard Version (NASB) and English Standard Version (ESV) and versions like The Message and The Good News Bible or even The Street Bible. The former options are more accurate to the original text so I switched to NASB some years ago, however, if I'm struggling to concentrate I sometimes return to my trusty NIV which makes for simpler reading. I do not agree with those who dismiss it as a paraphrase. However, I would caution those adults who use the latter versions (The Message etc) as their primary devotional Bible. I am wary of making too much of Bible versions being aware that there are those who subscribe to King James Version only and who think that other versions are somehow irreverent or misleading. Some have become so focused on this as to lose perspective about what is important.My own view is that we should all be reading the most accurate translation that we can understand and apply to our lives. What is the point in persevering with a dated text using words that are no longer familiar when we have more modern translations that are accurate that we can understand more easily?"}, {"userName": "Tristan", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/4673373-tristan", "userReview": "Very unsatisfying fantasy novel. Awful writing, unconvincing and poorly thought out world design, undeveloped or pathetically two-dimensional characters, lack of suspense. Various narrators present accounts that neither correspond well nor create an interesting divergence of point of view where they disagree - the inconsistencies are so poorly used as a storytelling device that they almost appear accidental. Many sections, such as Leviticus, read like the Cetacea chapter of Moby Dick, only worse. The book's only saving grace is its ending; while as disjointed and confused as the rest of the novel, some the lines take on a quality of a haunting semi-poetry that does deserve some recognition. All in all, difficult to get through and neither provocative nor informative, would not recommend."}, {"userName": "Tina", "userReviewDate": "Sep 28, 2007", "userURL": "http://www.goodreads.com/user/show/432587-tina", "userReview": "I have been reading this book since 1992, the year prior to my salvation January 4, 1993. I love this book above all the books I own. This book is why I live, breathe and have my being. I love Jesus with all my heart and because of Him I am living; la dolce vita ~ \"the sweet life.\" If you want to know more about Jesus, you can visit my blogs at:http://creatingmemories.typepad.com/c...I have many blogs on their feel free to browse around. Tina"}, {"userName": "Jonathan Terrington", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "This review will likely not change any opinions about this book. It will perhaps give anyone interested a look into my particular worldview. Disagree with me all you like, for my worldviews are based simply upon questioning, reading and attempting to understand the world according to scripture and observation. For everything I have seen in my life and of the world confirms to me that there is a spiritual side to reality and that there is a powerful God who exists.When one considers the term religion in this modern world the first and most controversial often seems to be Christianity. Some have called it too violent, others too passive and these paradoxes have been discussed widely by G.K. Chesterton. Since everyone seems to have an opinion about Christianity and the Bible I thought I'd present my own. I specifically leave the rating blank because I do not consider that any star system could effectively 'rate' this book. I further might add that this past year, thanks to a reading plan, is the first time that I have fully read the Bible in its entirety. I consider that it must be read as a whole for what it contains and no one has succeeded in convincing me that basing one's life upon the values in this book will create evil individuals. Radical and revolutionary individuals yes, evil ones no. The Old TestamentI believe that the Bible must be taken in its entirety. Christianity sadly today appears washed out and powerless for having sold out to those who would say that their lifestyles are acceptable or that science has gone beyond the Bible. It is this kind of 'pick your own religion' thought that removes the power of conviction. Today's Christian lacks conviction and this can be seen in the ways in which pastors and believers pick and choose ideas according to their own views. I find it fascinating that it seems to me this same science which has 'superseded' faith is still bound by faith and vast (in my eyes often illogical) assumptions much as the Bible is. I will stand by my views that evolution as a process is flawed in how it has been presented and debated. It seems that 'evolutionary' processes are visible in nature yet the concept of evolution, the transformation of organisms into other organisms appears to me as bound up in a myriad of assumptions as Christianity/intelligent design. In other words when people look at the evidence I see that one could make the two different assumptions from the same pieces of evidence as nothing seems particularly clear cut. Though others are free to challenge me on this any time.The Old Testament is not only disliked by many for its reference to the act of creation (which many view as mythical) but for its supposed racism, sexism and general bigotry. Yes, racism, sexism and bigotry do exist within The Bible, yet they are not, in my view condoned by the Bible (or at least by God's words within the Bible) and every argument I have seen to indicate this has not convinced me. Firstly because the arguments are either weak or rely upon translations which are noted for being a touch unreliable or for taking liberty with the original text. Another issue that people have is the supposedly angrier version of God seen in the Old Testament, the God of fire and brimstone. One way to view this is that in the Old Testament men are under a different covenant with God than in the New Testament and that God is made distant by the sinful nature of man in the Old Testament. However in the New Testament Christ allows for God to react to men without most of that righteous anger as punishment for sin.One of my favourite books in this section of The Bible is the book of Job. It is a tale of suffering allowed by God to reveal his majesty and I love how it is a work of wisdom. Ultimately Job succumbs to believing that he has been unfairly judged by God or judged for his sin. Yet it seems to me that the message in the end is that man cannot understand God's ways, that we have not made this world and do not have the power to create that God does. Also I love that Job in the end is given more than he began with. There is so much to learn from this one book...The New TestamentUltimately this is a tale of love, a finishing tale composed across the historical narrative of the Bible. This is where the gospel can be seen, the essential message that because of 'original sin', the rebellion against God's original order, that all are sinners. Yet the gospel goes further than this in how it also tells that the pure sacrifice of Jesus Christ saves men from this original sin so long as they make the choice to accept that salvation. It appears to me that the God of the Bible, the God I believe in, always works to give humans choices for he is a God that does not want puppets.One of my favourite verses in this New Testament is this: 1 Corinthians 6:12 \"Everything is permissible for me\"--but not everything is beneficial. \"Everything is permissible for me\"--but I will not be mastered by anything.I find that it sums up the approach one should have to many things in life. For instance alcohol or drugs. Perhaps in small doses certain drugs and alcohol may be fine. Or sexuality expressed in the right ways is fine yet the issue comes when we allow ourselves to be enslaved by something else, to idolise an item or object. I intend to be master of my path through God. The famous poem Invictus says: \"I am the master of my fate: I am the captain of my soul.\" Yet I am a foolish and childish individual to be captain of my soul, only God can truly captain my soul...My final sayWhatever your thoughts The Bible will always be the most controversial book in the world in my view. It does this by being what it is: uncompromising. Individuals may attempt to spin it according to their own viewpoints and indeed one must attempt to understand the culture and climate in which sections of scripture were composed. I am no theologian in these matters (in fact this is a rough review as it was intended to be as how can I fully explain everything I see in this book?). I am simply a young man continuing to grow and develop emotionally, spiritually and intellectually. However the more I see the more I understand the truth of the words in this book. And the most important thing to me is that I have conviction through faith: Romans 10:10 For it is with your heart that you believe and are justified, and it is with your mouth that you confess and are saved."}, {"userName": "Andy Wakefield", "userReviewDate": "Apr 27, 2007", "userURL": "http://www.goodreads.com/user/show/50555-andy-wakefield", "userReview": "borrrr-ing."}, {"userName": "Cat *living for the One who breaths life into me*", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/6060961-cat-living-for-the-one-who-breaths-life-into-me", "userReview": "I believe the Bible is the Word of God. I think some will call me crazy but sometimes things don't have to be fully explained to be true. That is kinda the entire point of faith. I also believe there is a God shaped hole in all of us. No matter how hard you try to fill it with money, fame, realtionships, sex, other idols it will NEVER satisfy your soul. You will still be thirsty and searching.Books I have fully read:GenesisExodusRuthHoseaEstherPhilemon 1 PeterMatthewMarkLuke John1CorinthiansEphesiansCollosiansPhillipians1 Thessolonians2 ThessoloniansTitus1 Timothy2 Timothy2 PeterJamesHebrewsBooks I have read somewhat of:I am starting Leviticus (honestly all the rules get a little boring but they are important)And I've read about half of ReveletionAnd maybe a third of PsalmsA bit of IsaiahStarted ActsYes, there is a lot of abuse, murderer, killing, lying, cheating, stealing and many many more sins in this book but the entire point we as Christians study from this is to try NOT to do these things to the best of our abilities (yes, even Christians are NOT perfect). For example, why do we study the wars? Why is that so important to know about what happened hundreds of years before? What is so important about the past? After all, isn't the past dead? It is BECAUSE of the future that we study the past. We don't want what happened a hundred years ago to happen again, right? So we study it. We Christians don't want to make the same sins so and so did from the bible today. So? We study it. We study the outcome of what the Isrealites did and how it affteced there realtionship with God. Why? So we can try (I say this because yes Christians are NOT perfect because we are ALL human) not to do the same things. So we ca learn to obey what God tells us. When we read the Word of God we learn about how stubburn we humans can be and how even then God STILL loves us. I mean, isn't it amazing that this Holy Awesome Higher Being would want to have a personal realtionship with US?!!! I don't know about you but that just blows my mind. I don't care what anyone else really has to say. God is real and He loves us all a ton. What others have to take on that is there opinion."}, {"userName": "Rhia Frio", "userReviewDate": "Oct 22, 2007", "userURL": "http://www.goodreads.com/user/show/567802-rhia-frio", "userReview": "This is my BESTSELLER EVER!!! I started reading the Bible when I was still a High School student, on and off in college and through adulthood! But more and more so now! As in daily! And it is my source of wisdom, strength, guidance, everything. Because the bible is God-breathed! So go and start reading it daily you book worm! And after you've read all it's books, you can read it all over again and still get fresh revelations!"}, {"userName": "Mf", "userReviewDate": "Jan 28, 2009", "userURL": "http://www.goodreads.com/user/show/1911276-mf", "userReview": "Really interesting, but it tries to hard to be enlightening, the plot moves at a \"Lost moses in desert pace\" and the prose is a little dull. I am however, looking forward to the authors next work Bible 2: The Son Returns."}, {"userName": "Andrew", "userReviewDate": "Jul 08, 2007", "userURL": "http://www.goodreads.com/user/show/175164-andrew", "userReview": "There's too much to be said about this book.When you cut away any socio-political feelings you may have about it, there's no denying it's sheer importance in the literature world. Not even Shakespeare comes close.As a pragmatic spiritual guide for living, it also can't be topped. So, so much of Western and Eastern culture is based in it's concepts. Love it or hate it, but you're probably a product of it.If you're a believer you probably regard this as a five-star bit of literature. Well, I'm a bit more critical. Even the so-called word of God only deserves four stars in my book. Some parts are a bit dull. Maybe some historians find chronicles of important Jewish family lineages interesting; I don't. That, and there is some conflict amongst passages. It's not a cohesive work; which I think lends the book some dimension of error and simple humanity--both of which can be easily forgiven.If you haven't read this book then you're out of touch. Read it. Either to be a better Christian, better atheist, better human being or better reader. Makes no difference."}, {"userName": "Jerry", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "It's the Bible, aka God's Word, aka the best and most influential book ever written. What more do I need to say?EDIT: This is my umpteenth time reading through the Good Book in a year's time...and I plan on doing it again next year and every year after that!"}, {"userName": "Jessie Frederick", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/44760832-jessie-frederick", "userReview": "4.23.18 | Y'all, I did it. I have finished the Bible.I can't believe I really did this. On February 13, 2015 I started this journey that I've always wanted to do, and here I am, just over three years later, having accomplished such a profound and inspiring part of my life. It's surreal, and I'm kinda emotional about it.Over this time, my faith has grown exponentially, and I feel so much more rooted and at peace with my Truth. It's brought perspective, assuredness, contentment, and clarity to my life. It's a fulfillment that can't really be compared to anything else I've ever experienced.Of course, I'll always continue to study the Word of God. Finishing this read-through isn't the end by any means. I look forward to looking more in depth into the different books and studying from new angles. And I'm looking forward to reading the thoughts of Biblical scholars. This is only the beginning of a lifetime of further developing my relationship with God.As for updating on Goodreads, I likely will leave this review as it is. It has served it's purpose, and I'm happy with putting it to rest. For anyone who's maybe followed along this whole time, thanks for keeping up. Know that it's not the end for me.----------3.31.18 | It's the last day of March, and Easter is tomorrow! It felt like a good time to update, especially since it's been about a month and half since the last. I have finished what I mentioned in my last update - reading through the end of Acts along with the various other Books I wrote about. I've also moved on just a few more days and have read Philemon, Colossians, Ephesians, and Philippians. This brings me to just two more weeks of reading days!!I know I said last time that I thought I was still on track to finish by mid-April, but I don't think that's the case anymore. At this point I think beginning of May is much more likely. I'm working hard to read at least three times a week, but like I said in February, daily life has gotten much more demanding. But still, let's hope for May.Looking ahead, I'll be reading 1 Timothy, Titus, 1 Peter, and Hebrews. I'm not sure when I'll update next, but considering I'm nearing the end of this journey it shouldn't be too long.----------2.11.18 | This update is LONG overdue. To give you an idea of how my reading that I mentioned in my last update went, I did finish the Gospels in mid-January. I had a good feel for how long that would take me, and I finished right when I thought I would. As much as I obviously enjoyed reading the Gospels though, it was difficult. My reading plan was very intermingled, and the commentary website I've been using had a completely different set up for the Gospels, so it was a chore to get my reading done and read the commentary. I ended up having to make a big chart to make sure I didn't accidentally skip over anything. But now that the Gospels are done, the second half of the New Testament is business as usual and has been much easier to work through.I started the Book of Acts after the Gospels, and I'm just over halfway through with it as of today. Reading Acts, so far, has also been broken up with the Books of James and Galatians. Looking ahead, Acts will continue to interrupted with other Books including 1 and 2 Thessalonians, 1 and 2 Corinthians, and Romans before I wrap it up in another two and a half weeks of reading days. So let's leave it at that as the current agenda.My reading as slowed down a lot since the start of the year, but it's for exciting news. I FINALLY FOUND A JOB! My prayers have been answered, y'all! I'm so glad to have that stress lifted off my shoulders, but naturally my new schedule has meant having to develop a new routine. Rather than reading in the mornings, I'm reading once I get home from work. However, I have a long commute, house chores that still need to be maintained, and I've started doing OrangeTheory. Needless to say, actually reading every day when I get home from work doesn't always happen. I suspect it will continue like this, and I'm not necessarily looking to be more strict with myself. I'm still reading about three times a week at a minimum, and weekends provide a much needed time to catch up if needed. I'm still hoping to finish the Bible by mid-April.----------11.13.17 | I realized on my last update I did not include any info on my reading moving forward. Today I started the Gospels - Matthew, Mark, Luke, and John. Since all four of these Books are about the ministry of Jesus and different perspectives of the same events, they are read together. I have three months of reading days left of the Bible, and the Gospels will take up half of that - six weeks to get through them. I'll likely not update until I'm done with them as there really isn't a stopping point or midway point or any other significant moment to update on my progress. Each day I'll read from either one, some, or all of the Gospels, and frequently I'll only be reading partial chapters. It's definitely mixed up quite a bit.As much as I would love to finish the Gospels by the end of the year, I just don't think it's going to happen. In order to finish the OT by my birthday, I really pushed myself to get through my readings on time. Getting into the New Testament has had me excited in part because I'd not be under the pressure of a self-imposed deadline, and I'm mostly ready to not feel pressured to read every day or read double days to stay on schedule. And with the holidays coming, I think it's best to give myself a break from a strict reading timetable. With all that said, it's likely I'll finish the Gospels sometime in January, so that will be when I update next. My ultimate goal is to finish the Bible sometime in April at the latest, and I'm certainly on track for that.----------11.10.17 | Umm, my birthday is tomorrow, and I just finished the Old Testament?!?! YEAH! First of all, I am SO excited that I met my goal to finish the OT by my birthday. I stuck with my reading plan and even read double days just to stay on track. I feel proud of myself for seeing it through.Even though I still have three months of reading days left before completing the entire Bible, getting through the Old Testament is such a big accomplishment. The OT takes up the vast majority of the Bible. I mean, it is huge, y'all. And considering I formally started this journey in February 2015, getting to this moment has been a loooong journey. It has always felt so far away, but now that it's here it's surreal.I've learned so much about my faith: the origins, the history, the teachings, the prophetic implications... Having all of this knowledge... Knowing my religion for myself is liberating, and the confidence I have in my beliefs has increased 100 fold. I still have the entire ministry of Jesus to learn about. I still have all the teachings of the disciples to learn about. But even having so much more to learn, I feel grounded and secure in what I know now. And I can only imagine the enlightenment that will come over the next few months as I connect everything that happened in the OT with all that's to come in the NT. And then to be able to apply everything I'll have learned... This has been a deeply personal journey that I've always wanted to embark on; the realization that I have finally pursued it and that a day is coming soon where I can say \"I did that\" is wild to me. ----------10.23.17 | I'm in the homestretch! As mentioned in my last update, I've now completed 2 Kings and 2 Chronicles; I've also gotten through Jeremiah, Habakkuk, Lamentations, and Ezekiel. And today I read the short, three-chapter Book of Joel. I now have just 17 reading days left of the Old Testament! My birthday is in 20 days, so I am on track to meet my goal with a few days of cushion thrown in. The final Books are Daniel, Ezra, Haggai, Zechariah, Esther, Nehemiah, and Malachi. I'll also read the last two Psalms that I've yet to get to - 137 and 126. It's been ages since I've read a Psalm; I almost forgot that I had a couple left. It's exciting to be so close to such a big benchmark. I can't believe it's almost here. Just a few more weeks...----------9.15.17 | Wow! I didn't realize it had been so long since I last updated. Well, I've certainly covered a lot more ground since June. So I've completed 1 Kings, Song of Solomon, Proverbs, and Ecclesiastes. I'm also nearly done with 2 Chronicles and 2 Kings, which picked up right where 1 Kings left off and has been read alongside Chronicles. I'll actually do my final reading of these books in a little over a week of reading days. I've also read a TON of Books from the minor prophets - Obadiah, Jonah, Amos, Micah, Hosea, Nahum, and Zephaniah. All of these are pretty short and were read in just one or two days. But I've also read the big Book of Isaiah; at 66 chapters, Isaiah took me nearly a month of reading days, which were often broken up by the other mentioned Books.Today, I started the Book of Jeremiah. It's not quite as long as Isaiah, but it's still 52 chapters and will take a couple weeks of reading days to finish. Like I said, I'll finish 2 Kings and 2 Chronicles as I go through Jeremiah. I'll also read Habakkuk and Lamentations before my final \"big Book\" - Ezekiel. I'm nearing the end of the Old Testament, and I'd love to have it done by my birthday on November 11, so I'm working to be really disciplined with daily reading and even reading double days if I miss a day, which usually happens when we go out of town on weekends to visit family or go camping.----------6.20.17 | This past chunk of reading has seemed to have taken me forever. I've now read 2 Samuel and 1 Chronicles, and I've also read a TON of psalms. I think the psalms have really slowed my pace. I've read multiple psalms at least every other day, but many times I've had them to read for days in a row. So I'm pretty exhausted from this most recent section of reading that I've done. But looking ahead, the remaining psalms will be spaced out much more. This is a relief. On my next reading day, I'll be starting 1 Kings, and it will be read alongside 2 Chronicles. But it will take me quite awhile to read these two Books as it looks like they are frequently interrupted by the starting and finishing of other Books. Coming up most immediately, Song of Solomon, Proverbs, and Ecclesiastes. I'm excited about Proverbs since it's so often quoted.----------4.21.17 | So I've now read the Book of 1 Samuel. There were also 24 psalms intermingled with my reading. Up until this point, my chronological reading plan has basically followed the order of the Books with the exception of Job and a few psalms. Looking ahead though, it looks like the plan is going to start bouncing around more. I'll be starting 2 Samuel on my next reading day, and it will be read in tandem with 1 Chronicles as well as many more psalms. ----------3.20.17 | It's been just over a month. I've now read the Books of Joshua, Judges, and Ruth.----------2.17.17 | I first started the Bible on February 13, 2015. I was on a pretty consistent reading pattern, but then in May of that year I got my first full-time job, and slowly but surely, my reading got more and more sporadic to the point where I went months at a time without reading a single verse. Flash forward to the beginning of this year, I've now quit that job and have gone into real estate full-time. This has allowed me to have more control over my schedule, and I'm prioritizing my Bible reading once again.This is my first time reading the Bible, and I've decided to take on the journey with a chronological reading plan. I've also found a great commentary website to follow along with to help me better understand each day's reading and how to apply what I'm reading to my life as a 21st century Believer.Over the past two years, I've read the first five Books and the Book of Job. In order: Genesis 1-11, Job, the rest of Genesis, Exodus, Leviticus, Numbers 1-15, Psalm 90, rest of Numbers, Deuteronomy, and Psalm 91. After finishing Deuteronomy a few weeks ago, I decided that I wanted to reread the commentary I'd covered up to that point to refresh my memory before continuing on with the Book of Joshua. And that's what I finished today. Even though I was a little impatient with my commentary rereading, I'm glad I decided to do it, so now I can move forward with everything I've learned thus far fresh in my mind.I don't have the Bible on my \"Currently Reading\" shelf because it's much different than your typical novel, and I do want to always be reading God's Word. But this also means I can't really update my progress as I go, so I've decided to update here in this ongoing review. I can't really say if I'll mention insight or anything like that in these updates as I go along, but I want y'all to know that I am at least progressing, and if that opens the door for someone to ask me about God, then I want that to happen, too."}, {"userName": "Rebecca", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/4205990-rebecca", "userReview": "The Holy Bible is a letter from God about His family. He tells about His sons and daughters such as Moses, Abraham, and Deborah, and most of all, tells us how we can be saved through His Son Jesus Christ. The last section of this book, called the New Testament, explains how Jesus, who was God's Son, came to earth in the form of a man, and gave His life so that we could go to heaven to be with Him. Three of my favourite quotes from this book are \"God so loved the world that He gave His one and only Son, so that whoever believes in Him will not die but have eternal life\", \"If you confess with your mouth that Jesus is Lord and believe in your heart that God raised Him from the dead, you will be saved\", and \"Who shall separate us from the love of Christ? Shall trouble or hardship or persecution or famine or nakedness or danger or sword? No, in all these things we are more than conquerors through Him who loved us. For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.\"I really enjoyed this book because it completely changed the way I thought about the world. It taught me that getting to heaven is not achieved by good works, but by accepting the grace of God who loves me more than I could ever imagine. I strongly encourage you to read this book - it will change your life."}, {"userName": "roland0_o", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/7308383-roland0-o", "userReview": "It was easier to get through Atlas Shrugged than it was to get through this monster. Yes, all the awesome stories of rape, racism, murder and genocide that you expect to find are there. Getting to them, however, takes plodding reading through pages and pages of repetitive and boring recitations of how super awesome this god guy is. At least the bible has the fun parts, in comparison to the koran, which seems to be an extraction comprised exclusively of these mind-killing passages.The second part is slightly easier to read, as it at least follows a more cohesive narrative. The Rashomon approach to narrating the life of Jesus is interesting, though it's hard to understand where all the fanfiction gets its grounding from (and it's the fanfiction that mostly makes up our present image of the guy). There are a few quotable phrases in the second section, but again they are buried in bucket-loads of sexism and victimization. Even the more noble ideas in the book lead to questionable concepts, such as vicarious expiation, neutrality in the face of evil, intellectual irresponsibility and submission to authority.From a stylistic sense, the book has its merits, but again, they are buried in a barrage of repetitive, boring language. The arguments and narrative seem to be constructed by a 7 year old with ADHD, and the only reason the book has any linguistic significance is because it is quite old (and managed to get many things down on paper first). You will find more illuminating prose in other works from the same period."}, {"userName": "Lara (Bookish_turtle)", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/64318901-lara-bookish-turtle", "userReview": "The ultimate key to understanding life, death, and all that matters."}, {"userName": "Tom", "userReviewDate": "Jul 26, 2010", "userURL": "http://www.goodreads.com/user/show/595516-tom", "userReview": "a bit dicey in parts, some R-rated stories, too much violence, confusing, getting a PhD in it won't help, changes you when you read it (usually for the better; it's sometimes called \"the book that knows me\"), begins well ends in terror and joy (see what I mean about confusing?), only valid source of info about Jesus (but will the real Jesus please stand up?), needs an editor, you say you're going to read it straight through and you don't (you skip all the parts you can't pronounce or that bore you), needs more humor, lots of jeremiads and rantings, some really nice but overly emotional poetry, one-a-day wisdom vitamins, best book: Job or maybe Ecclesiastes, way too nationalistic in the first part, should come with a Surgeon General's warning, for some reason it still sells and keeps many of my friends employed trying to understand and teach it. Tom"}, {"userName": "Inder", "userReviewDate": "Jul 17, 2008", "userURL": "http://www.goodreads.com/user/show/250817-inder", "userReview": "I'm working on a major project, and I figured, since I've got several books on my currently-reading list that I'm not likely to complete for years, I might as well add another, and share my progress here. I am trying to read the entire Bible, as an adult, for real (no cheating, skimming, or skipping, not even dietary rules or geneologies). I have been meaning to do this since childhood, because, beyond the religious aspect, I feel that the Bible (or at least some big chunks of it) is essential reading for any educated person; furthermore, knowledge of the Bible is a great help if you're interested in literature. It's a book that many claim to have read, but few have actually read cover to cover, and understandably - this is not easy stuff. It makes the Odyssey look like a trashy adventure novel.I've been working on this for about a year now, and I'm obviously not moving too fast. My motto is \"baby steps, baby steps.\" Why the NIV? I'll be honest. Of all the translations I've looked at, this one is the easiest to digest, without being totally dippy. (\"The Message\"? Uh. No.) I tried the NKJ, but wow, that was slow-going. I prefer its poetry, but I also like to be able to progress through more than one sentence per sitting.As you can see, I started with the NT, but skipped Revelation (because ... whoa ... I have no idea what I'm even reading about there) and then started back into the Hebrew Bible, where I've almost polished off (survived?) Leviticus. It seemed easier to start with the NT (because, um, it's shorter) but now I'm realizing I'll have to reread it when I finish the rest of the book, because, hello, the NT actually doesn't make much sense without the Hebrew Bible. Smart people warned me that this was true, and I ignored them, but they were right. Ahem. This is gonna take a while.So here's where I am right now:1.\tGenesis - Read2.\tExodus - Read3.\tLeviticus - Read (this book has a bad rap - it's really interesting!)4.\tNumbers - Currently reading5.\tDeuteronomy6.\tJoshua7.\tJudges8.\tRuth9.\t1 Samuel10.\t2 Samuel11.\t1 Kings12.\t2 Kings13.\t1 Chronicles14.\t2 Chronicles15.\tEzra16.\tNehemiah17.\tEsther18.\tJob - Read (great stuff, but whew, those conversations get tough!)19.\tPsalms - Steve and I are tackling this, one psalm per night; check back in a 140-odd days.20.\tProverbs21.\tEcclesiastes22.\tSong of Solomon23.\tIsaiah24.\tJeremiah25.\tLamentations26.\tEzekiel27.\tDaniel28.\tHosea29.\tJoel30.\tAmos31.\tObadiah32.\tJonah33.\tMicah34.\tNahum35.\tHabakkuk - Read36.\tZephaniah37.\tHaggai38.\tZechariah39.\tMalachi40.\tMatthew - Read twice41.\tMark - Read42.\tLuke - Read43.\tJohn - Read twice (could go into how \"one of these gospels is not like the others,\" but this doesn't seem like the appropriate place for that)44.\tActs - Read45.\tRomans - Read46.\t1 Corinthians - Read47.\t2 Corinthians - Read at least twice (and still don't get much of it)48.\tGalatians - Read49.\tEphesians - Read50.\tPhilippians - Read51.\tColossians - Read52.\t1 Thessalonians - Read53.\t2 Thessalonians - Read54.\t1 Timothy - Read55.\t2 Timothy - Read56.\tTitus - Read57.\tPhilemon - Read58.\tHebrews - Read59.\tJames - Read60.\t1 Peter - Read61.\t2 Peter - Read62.\t1 John - Read63.\t2 John - Read64.\t3 John - Read65.\tJude - Read66.\tRelevation - ReadStay tuned for (very) periodic updates!P.S. Wikipedia is so cool. This is what I'm talking about."}, {"userName": "Nicki Smith", "userReviewDate": "Jun 12, 2007", "userURL": "http://www.goodreads.com/user/show/126940-nicki-smith", "userReview": "This is a great read! You'll never want to put it down. It has all the answers you're looking for and is beautifully written by God!"}, {"userName": "Alex", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/11622613-alex", "userReview": "Over-long, disjointed, repetitive in the extreme. The main character, 'God', is poorly sketched out by the anonymous author, and his supposed motivations are often contrary to his actions (showing his 'love' by acts of genocide). By the time the narrative shifts to the Roman occupation of Judea the author has given up all attempts at generating new material and repeats the same narrative 4 times in a row. Lazy.The final section, 'Revelation', reads like the ramblings of someone who has been eating too much of the moss that grows on his cell wall.Avoid."}, {"userName": "midnightfaerie", "userReviewDate": "Oct 10, 2011", "userURL": "http://www.goodreads.com/user/show/6610433-midnightfaerie", "userReview": "I read this twice. The second time I read it was on a challenge from a youth group leader. I earned a leather jacket from mexico for it. Still have it. The first time I read it was because it was a classic. Here, I thought, was a book that was known the world over. It caused disputes and wars, people killing each other over it, politics argued using it as its basis, and referenced by many a literature around the world. For this alone it was a book worth reading. The beginning bit was a a bit tedious…this person begot that person and that person begot this person. But then substance began to form. This is only a review, not a declaration of faith, so I will endeavor to keep my opinions out of it, at least on the religion part. Whether or not Jesus was real or any of the profits were real, it is definitely worth reading. For all the reasons I read it in the first place and more. Substance comes in some truth. I don’t believe anyone can deny the golden rule or the 10 commandments being good advice to follow, but also they are some basic truths that should be followed by any moral, sane person. I don’t believe if a person is honest with themselves, that they can argue that these are not good ideas. Being kind to your neighbor? Respecting your parents? Not stealing? Yes, there are exceptions to every rule, but this is not about the exceptions. On a very basic level, all moral, sane humans should follow these rules. So where did they come from? Did one person just realize it one day and then write them down? Was the bible the first place to note them? Surely not. So again, why is the bible so friggin controversial? Well, what else is in it? Then comes the descriptive stories about any and all human conditions that can be experienced. I think anyone would be hard pressed to find one not addressed in the bible. So it is a story that all of us can relate to in one way or another. Then there are eloquent ways of stating the obvious. Much like Shakespeare or poetry, there are ideas written well that touch us. For example, Ecclesiastes tells us most everything we hold dear is meaningless…our life is quick and in the end what does anything matter? Again this is not about belief, just about a written book. Modern pop culture uses verses from the bible for meaning…plays, songs, art…”To everything there is a season…” The Byrds. So for all these reasons the bible gets our attention. But what holds it? And again, why so controversial? I think the reason lies in the telling. We are human and therefore not perfect, so when reading stories that we can relate to (and we’ve already established that all can relate to something in the bible) we put ourselves into that story and when an opinion is given on the characters behavior, we put that opinion on ourselves. And since we’re not perfect, we can’t always do the said opinion or behavior, so we feel guilty, because, as stated before, in essence we know what’s right and wrong, and not doing what we believe to be right will make us feel guilty. Who likes this feeling? No one. So we turn it to anger upon the one who expressed the opinion on behavior. Thus, controversy. Again, it’s just an opinion from a small mind. Either way, I highly recommend this book. Again, not because of faith, for I declare no belief here one way or the other, except that we all know essentially what’s right and wrong, but for all the reasons I read it in the first place. A book that so many reference, used in literature, governments risen and fallen because of it, laws made from it…wars fought over it…to have such an influence, isn’t that alone worth reading a book? As for the opinions on behavior, well, what other way to stimulate your mind, then realizing some self truths about yourself, or arguing those behaviors? And we all know how I like to be stimulated. *grin* A classic? Definitely. I think we all can agree this has and will withstand the test of time, and it is a book like no other. As a side note I also have some other religious texts on my list such as The Qur’an.ClassicsDefined.com"}], "description": "The New International Version is the world's most popular Bible in modern English and is renowned for its combination of accuracy and clarity of language.", "title": "Holy Bible: New International Version", "url": "https://www.goodreads.com/book/show/280111.Holy_Bible", "average": 4.59, "cover": "https://images.gr-assets.com/books/1382581321l/280111.jpg", "reviews": 1988, "authors": [{"url": "https://www.goodreads.com/author/show/5158478.Anonymous", "name": "Anonymous"}], "type": ["Religion", "Christian", "Classics", "Reference", "Spirituality"], "outlinks": ["http://www.goodreads.com/book/show/280111.Holy_Bible", "http://www.goodreads.com/book/show/425792.Holy_Bible", "http://www.goodreads.com/book/show/12508774-gift-bible-niv", "http://www.goodreads.com/book/show/147628.Holy_Bible", "http://www.goodreads.com/book/show/1923820.Holy_Bible", "http://www.goodreads.com/book/show/323355.The_Book_of_Mormon", "http://www.goodreads.com/book/show/19351.The_Epic_of_Gilgamesh", "http://www.goodreads.com/book/show/93101.The_Arabian_Nights", "http://www.goodreads.com/book/show/5883777-the-holy-bible"]}