{"ratings": 83419, "userreviews": [{"userName": "Emily May", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“What I know now, my son: Evil begets evil. It grows. It transmutes, so that sometimes you cannot see that the evil in the world began as the evil in your own home.”\n4 1/2 stars. Homegoing is an incredible and horrific look at history, colonialism and slavery in Ghana and America, across 250 years. How the author managed to create such rich characters, cover so much history, and tell such a complex, but compelling story in only 300 pages, I do not know.I recently said in my review of East of Eden that I love family sagas. Those epic tales spanning generations and pulling you into the lives of so many interesting characters... yeah, they are some of my favourite kind of stories. Spending so long with the same family, watching them grow through the years and seeing their children face their own problems - it just feels so personal. I feel like I've grown with them.This book, however, is possibly the most ambitious family saga I have ever read. Most books like this feature three generations. Homegoing follows seven generations, fourteen perspectives in total. It all begins with two half sisters - Effia and Esi - who will never know each other. One's experiences lead her and her family to slavery in America, the other's family find themselves mostly in Ghana. Each chapter is from the perspective of a new character; first Effia and Essi, and then six of their descendants, as the story tracks the cultural changes in both Ghana and America - through colonialism, racism, and attitudes to slavery. Through the characters, we experience life during the tribal wars of the 1700s, the horrors of the transatlantic slave trade, the ways in which prominent leaders in Ghana aided British and American slavers, the fear created by the Fugitive Slave Act, and much more.I can't quite reconcile the knowledge that I've read only 300 pages with the amount of history and rich characterization I've just experienced. Considering that I usually grumble when a book has more than two perspectives, it's quite something that none of these fourteen perspectives felt lacking. Gyasi is just a great storyteller; she takes important subjects like slavery and colonialism, and peppers them with perfect little conversations and insights into human nature. \n“All people on the black continent must give up their heathenism and turn to God. Be thankful that the British are here to show you how to live a good and moral life.”\nAlso, the British really sucked back then. Thank god we got over that, pulled our heads out of our arses, and started embracing other cultures. Oh, wait.As is to be expected, there's a lot to be disgusted about in this book. True to history, it is full of blood, whippings, racist language, British superiority and other scenes that will turn your stomach. However, Gyasi handles it with sensitivity for her subject, ensuring that the violence is a honest portrayal of history, not gratuitous.A gritty, detailed story about the long-standing effects of the colonization of Africa and the slave trade. A real accomplishment to cover so much history in so few pages without feeling rushed.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "Roxane", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "Homegoing is a very confident debut novel. Exceptionally engaging and the strongest case for reparations and black rage I've read in a long time. Seriously, white men are the devil. The most interesting part of this novel, the structure, also becomes the most frustrating part of the novel. The story starts with two sisters who are never allowed to know each other, and what becomes of the generations they beget, starting in 18th century Ghana. The novel beautifully explores the slave trade and imagines life in Ghana at that time, and as we move forward through time, from one generation to the next, we see what slavery becomes in the US, and how it changes Ghana. The early chapters are rich and immersive and I could not put the book down. I am impressed by the magnitude of the novel's ambition and how much research went into feeling like the author had, herself, seen African in the 18th century or the American South in the 19th century or Harlem in the 20th century. The closer we get to present day, the more the chapters feel like they are designed, not so much as fictional narratives, but rather as vignettes meant to reveal specific historical moments and sociopolitical ideas-- the civil war, the end of slavery, the great migration, modern civil rights. The chapters become shorter. We have less time to feel connected to the characters and the narrative starts to feel less satisfying. And then there is the ending which is necessary for what the writer is trying to do but which also feels terribly convenient and insubstantial. Regardless, Homegoing is one hell of a book and because the writing is so damn good, I actually appreciated the novel's flaws as a reminder that even a writer this incredibly talented is human. I recommend Homegoing without reservation. Definitely a must read for 2016."}, {"userName": "Brina", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "I give 5 shining stars to Yaa Gyasi's Homegoing, the best debut novel I have read this year. In this semi autobiographical tale, Gyasi follows the family histories of two half sisters, Effia the beauty and Esi to reveal how their families end up. Each chapter is a vignette focusing on a family member in subsequent generations, alternating between Effia and Esi's families until we reach present day. Here are their until now largely untold stories. Effia the beauty had been raised by her step mother Baaba who did not love her as her own. Saved from a fire that plays a prominent role in her family's history for generations to come, Effia becomes the village's beauty long before she reaches marriageable age. Baaba, who always resented Effia's presence, sells her to the British in order to ensure the Asante's place in the slave trade, and Effia marries an English governor rather than a tribal chief. The only memory she takes with her is a black stone polished by fire. One village over from Effia's, Esi Asare becomes a spoil of a tribal war. In a subsequent war, she is enslaved and taken to the same Cape Coastal Castle where Effia lives as the governor's wife. Before becoming captive, Esi receives a black stone from her mother Maame and finds out that she is not her mother's first born, rather that she had another daughter who she lost in a fire. Through the stone and oral histories, Esi learns that separated sisters are to be forever cursed in their family history. In spite of hearing this tale, Esi is determined to hang onto her stone, even when she is sold into slavery and bound in horrid conditions for America. Gyasi interconnects the stories of Effia and Esi's descendants by alternating chapters. Each chapter tells the tale of the next member of each sister's family down to present time. Effia's family remains in Ghana whereas Esi's descendants move back and forth between the southern and northern United States. Playing a role in each chapter is the black stone and oral tradition as well as black pride and remembering where one came from through both the good times and the sacrifices made. In addition to the family, we read how their choices reflect the turmoil happening in both Ghana and the United States up through present times, which made the book even more powerful than it would have been if Gyasi only chose to tell a family narrative. Because Gyasi only uses twenty pages to tell of each generation, the pages are powerful and packed full of detail and flowing language. Thus, each chapter read quickly as I desired to find out how the families ended up. I enjoyed the vignette format as though it were Gyasi telling us in person the African style oral history of where her ancestor Effia started and where she ended up. It would have been interesting to know a few details in the gaps between generations, but Gyasi fills these in easily enough in the next story. An extremely powerful read being billed as this generation's Roots, I immensely enjoyed Homegoing and look forward to Gyasi's future novels."}, {"userName": "Raeleen Lemay", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "Read for Book Riot's 2017 Read Harder reading challenge: #24 Read a book wherein all point-of-view characters are people of colorThe premise for this book is amazing. Two sisters are separated at birth, and each alternating chapter follows a descendant of each sister. Great, right?My biggest issue was that this felt more like a collection of short stories than a novel. There's nothing wrong with that necessarily, but it just wasn't my cup of tea. When I read a novel, I want to feel connected to the characters and their stories, but with this book I feel like I never got to know the characters, like I only saw their surfaces. As an entire book, this was a fascinating read and I'm super glad I read it! It really shows how much can change over the course of a few generations, and looking at it like that makes me enjoy it a bit more. However, in the end, I rate books based on how much I enjoyed the actual reading experience, so this gets 3 stars from me."}, {"userName": "Diane S ☔", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Stunned, just absolutely stunned that this is a début novel. Spanning centuries and continents, the novel follows two families, one from the slave trading Fante nation and another from the Asante warrior nation, in the British colony that is now Ghana. Stepsisters, who are unaware of each others existence, one will marry a white man, a British official who lives in the upper part of the Cape Coast Castle. The other, in the lower dungeons of the same castle and sold as a slave, transported to the American South. Any book about slavery is going to be hard to read and this book is no exception. In alternating chapters, we go from Africa, to the south, and follow the descendants of the two women. We see what happens in Africa, the effects of the British Colonization and internal warfare. The South, slavery and then quasi freedom but under Jim Crow laws. South Carolina and its eugenic provram.Rather than reading as a novel it is almost like portraits, snapshots of the lingering effects of slavery. Characters change often, each chapter narrated by another though some overlap, this took some getting used to but each character was important, each character I took to heart. The writing is fantastic, the imagery of fire and water following the different family lines.Needless to say there is not alot of joy within, but there are occasional glimpses. The novel does end on a surge of hope and another fantastic visual. I cannot wait to see what this young, already accomplished author will tackle next. ARC from Netgalley."}, {"userName": "Book Riot Community", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "This multigenerational epic has already gotten lots of attention, and it deserves every bit of it. Gyasi’s debut novel begins with two half-sisters in 18th-century Ghana, strangers to each other. Effia marries a white man, and Esi is enslaved and taken to America. The novel follows the children of these two women through the generations, alternating between Africa and America. As we meet each new descendent, we see how the legacy of slavery plays out across history, both for the enslaved and for those complicit in the slave trade. Each chapter reads like a single short story, but the forward momentum across time gives the book a novelistic feeling. I adored this book, finding it illuminating, heart-breaking, and beautiful to read. I can’t recommend it highly enough.— Teresa Prestonfrom The Best Books We Read In March 2017: http://bookriot.com/2017/04/04/riot-r... ____________________Pretty much everyone at Book Riot has been raving about this book, but I’m going to rave about it some more. I hope you guys aren’t tired of hearing about this book, because it really is that good. It’s a multigenerational family saga about two sisters born in 1700’s Ghana and separated at birth, and each chapter alternates between the different family lines, looking at a different generation each time. You don’t get to spend much time with each individual character, but the breadth and scope of the story is mind-blowing. And with each new chapter, we see how the injustices of the past, whether they’re rooted in American slavery or African colonialism, build on each other to affect the future. The story is brutal, but the language is absolutely gorgeous, and this is a MUST READ for anyone looking for a new perspective on racial history. I’m blown away that this was a debut novel.–Katie McLainfrom The Best Books We Read In September 2016: http://bookriot.com/2016/10/03/riot-r...____________________Homegoing is a multi-generational saga that spans two continents and over two hundred years. The story follows two Ghanaian sisters and their descendents. One sister marries an Englishman and goes to live in Cape Coast Castle; the other is sold into slavery and passes through the castle on her brutal journey to the plantations of the American South. The book reads like a series of interconnected short stories, each chapter focusing on one character in the family tree. I was completely blown away by beauty and poignancy of Gyasi’s writing and the skill with which she executed a story of such grand scale. I was completely gripped from the first page.–Kate Scottfrom The Best Books We Read In August 2016: http://bookriot.com/2016/08/31/riot-r...____________________I don’t know what higher compliment to give this book that to say that it was responsible for a very burnt curry one night. I was just going to read a couple of pages while the sauce simmered! There is no “couple of pages” with this tale of two half sisters in Ghana, Effia and Esi, and their descendants. Rich, evocative and emotional, I savoured every page. — Rachel Weberfrom The Best Books We Read In February: http://bookriot.com/2016/03/01/riot-r...____________________This multi-generational novel has been getting all the positive buzz by other Book Rioters so I knew I had to pick it up myself and give it a try. The story begins with two half sisters and follows the family tree down those branches across around 100 pages through Ghana and (eventually) the United States. Each chapter follows a different member in the family line, alternating between different sides of the family. Despite the fact that you are only seeing snippets of each person’s life, Yaa Gyasi is still able to create a connection between the reader and these characters. Each chapter is filled with so much emotion and depth and tackles so many different topics. Even though so much of this book was so emotional, I didn’t want to put it down.— Rincey Abrahamfrom The Best Books We Read In May 2016: http://bookriot.com/2016/06/01/riot-r...____________________By now, you have heard several Rioters rave about this book, and you are sure to hear about it from several more. Possibly the best book of the year, this amazing novel stomped my heart flat with its wrenching story of sisters and slavery. Spanning three hundred years, Homegoing follows the stories of two half-sisters in Ghana – one made a wife, one made a slave – and the lives of their offspring in several countries, and throughout wars and jealousies, births and deaths. Gyasi’s writing is astoundingly remarkable. The fact that this is her first novel is almost incomprehensible, because it’s perfect.– Liberty Hardyfrom The Best Books We Read In June 2016: http://bookriot.com/2016/06/29/riot-r..."}, {"userName": "karen", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "congratulations! semifinalist in goodreads' best historical fiction category 2016!\"We believe the one who has the power. He is the one who gets to write the story. So, when you study history, you must always ask yourself, whose story am I missing? Whose voice was suppressed so that this voice could come forth? Once you have figured that out, you must find that story, too. From there, you begin to get a clearer, yet still imperfect, picture.\"this is a shockingly good debut novel. it's more accurately classified as a novel-in-stories, although there is a strong connective thread binding them together. it opens in the eighteenth century with the story of effia, followed by the story of esi. these women are half-sisters who have never met, born to the same mother into different villages and different tribes in ghana. effia marries an english slave trader while esi is herself sold into slavery. the rest of the book travels the bloodlines of these two women through time; in alternating chapters, we are presented with the perspectives of each subsequent generation born to the sisters, climbing the family tree for about 300 years and six generations, which means that after the initial story of each sister, there are twelve different POV chapters, each telling a new character's standalone story.in about 300 pages.phew.and i knew this about the structure from reading other reviews of the book, but by the time i finally read this myself (thanks for the push, alex!), i'd forgotten this fact, and i kind of wish i hadn't. it's not that she doesn't pull off the feat very well, because she absolutely does, but i kept wanting to return to certain characters, and, of course, it never does. it's not a bad thing, to be so intrigued by a particular character that you're left wanting more, but with each chapter, you're uprooted out of a storyline, in some places at a very tense moment, and you need to take a moment to process what you've just read before bracing yourself for what might come next. because chances are, there will be more horrors ahead. considering the struggles and brutality these characters often faced, my complaints are pretty damn trivial; if the worst thing that happens to you all day is boo-hooing over readerly dislocation, you're having a good day. and reading this book will make your day better. not in the sense that it will leave you with fuzzy feelings of how wonderful the world is and has always been, because this book is filled with death, horrors, violence, and it can get very brutal in its descriptions. this is 250 years of african history after all, and between the slave trade, the journey to america, the conditions of slaves in the new world, etc etc on to more contemporary and insidious forms of racism and violence, it's not an easy read, emotionally. but it will make your day better to know that there's a powerful new voice out there, telling important stories with truly captivating, transportative, effortless grace - it's exciting to read something that engages the mind and the emotions and makes you want more, especially in a debut. and it's a really gripping overview of a history made up of those \"suppressed voices,\" told in vignettes that cover a lot; providing that clearer, yet still imperfect, picture.the only thing preventing this from earning a full five-star celebration is that some of the characters, especially in the more contemporary times, were not as interesting to me as previous generations, and some were altogether forgettable, even though her writing remained strong and fluid throughout, so it's never a drag to read. and i definitely loved marjorie.Marjorie wondered if she was in love. How could she know? How did anyone know? In middle school she had been into Victorian literature, the sweeping romance of it. Every character in those books was hopelessly in love. All the men were wooing, all the women being wooed. It was easier to see what love looked like then, the embarrassingly grand, unabashed emotion of it. Now, did it look like sitting in a Camry sipping whiskey?the quickchange POV's sometimes forced me to refer to the family tree in the front, to remind me which a to b to c this character's line was on. it's easy enough to remember if you're on effia or esi's line, and to remember the generation just before each story, but when you get to the point where you have to remember 4, 5 generations back, when it's alternating between the two lines, it can get a bit blurry. not that that's necessary to understand or appreciate the book - it was just for my own needs, because i like to trace storylines and look for patterns, echoes, repetition. but warning - looking at the family tree is kind of spoilery because you know who's going to hook up with whom, and you know that they won't die before they breed. after that, though - no promises. it's always invigorating to come across a particularly strong debut novel; to know that this author is likely to get even better over the course of their career. i cannot wait to see what she writes next, because this was such an intense and beautifully-written book. i'd earmarked a ton of quotes that i wanted to share and discuss, but they don't seem quite right now, excised from their surrounding narrative. so you'll have to discover them yourself, in the course of reading this book, and i'll just leave you with the passage that hints at the book's title:\"One day, I came to these waters and I could feel the spirits of our ancestors calling to me. Some were free, and they spoke to me from the sand, but some others were trapped deep, deep, deep in the water so that I had to wade out to hear their voices. I waded out so far the water almost took me down to meet those spirits that were trapped so deep in the sea that they would never be free. When they were living they had not known where they came from, and so dead, they did not know how to get to dry land. I put you in here so that if your spirit ever wandered, you would know where home was.\"Marjorie nodded as her grandmother took her hand and walked her farther and farther out into the water. It was their summer ritual, her grandmother reminding her how to come home.and i also want to take a second to plug one of my favorite books of all time, one that also covers african complicity/involvement in the slave trade and its horrors: The Book of Night Women. it's jamaica, not ghana, and it's even more brutal than this one, but it also has one of the best characters ever written and it left me with the same feeling of discovering a new writer as this one did. and marlon james went on to win the man booker, so i'm wishing the same success to gyasi."}, {"userName": "Elyse", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"And so they waited. Ness and Sam and Kojo, working longer and harder in the fields than any of the other slaves so that even the Devil began to smile at the mention of their names. They waited out the fall and then winter, listening for the sound that would tell them it was time, praying that they wouldn't be sold and separated before their chance came\". \"Homegoing\" was one of the Fiction books nominated for best books of the year by members on Goodreads. It made the first round-cut. I'm on a mission to read other desired - TBR -nominated books before the year is up. Since there are many wonderful, \"HOMEGOING\" reviews before me, here on Goodreads....here's a little side dish to the already great community book-pot. ...Fantastic debut novel ....powerful storytelling ....Having the physical book made it easy to refer to the family tree of generations.  If I started to forget which person intimately belong to another, having the physical book made it easy to flip to the genealogy chart. .....The two main family sides to keep track of was Effie or Esi. ( given my name is Elyse...I had no problem keeping track of the connections that follow the 'E' girls. --I had already heard from other readers that they wished the stories were longer of each character....more information about them. KNOWING this ahead of time was useful information- for MY TURN in reading this book -- OTHER READERS REVIEWS HELPED GIVE ME A CONTEXT WITH THIS NOVEL....so that, I was able to avoid pitfalls - and get most value. The way I saw the short chapters were a little like short stories WITH A PURPOSE contributing to the GREATER CONTEXT.,....The author drives home the evilness that slavery is. The fact that in 300 pages, Yaa Gyasi covers 300 years-worth of the damaging effects that the 'institution-of-slavery' had on people through personal family stories.....getting a 'glimpse' at each of them.....is a remarkable achievement. .....The characters feel very real. If I was told ahead of time that this was a true story about real people... I would have believed it. The author allows us to see all sides of slavery ( none of it is a pretty picture).... but she steps back from judgement and allows us to look at the inner demons -of the self absorbed- greedy - misogynistic African and American man. Gyasi reminds me a little of another great author - another great storyteller who doesn't take sides on issues - even horrific evil issues - rather stays on purpose with his storytelling: T.C.Boyle. A book which comes to mind is 'Tortilla Curtain'. I don't mean to sound intellectual about this book because it's not where my heart lives.... I was simply trying to support another reader -in ways other readers have helped me. In a book about slavery through generations a with so much to cover, I feel 'communities' ought to read this book together, and talk about it. I WAS EMOTIONALLY touched ....THE STORYTELLING IS VERY MOVING ..  .....at the same time it's an important book. The history of how groups of slavery migrated from Africa to America is informative-- and fills in holes with our own understandings. This novel is both educational and intimately personal.Our hearts get filled ....and our minds are thankful!"}, {"userName": "Jennifer Masterson", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "My heart hurts and there is not enough Ben and Jerry's in this world to soothe it! After reading Homegoing I am literally spent! This is not a bad thing. This is just a very sad novel!!! Homegoing covers the mid 18th Century to present times. It follows two different tribes in Ghana ( Fante and Asante), two different families, and specifically two half sisters, Effia and Esi and their offspring. The sisters know nothing of each other. Both sisters are living in Ghana. One sister stays in Ghana and marries a British soldier working in the slave trade (although the soldier is married to another woman in England and has a family there as well) while the other sister is sold into slavery and is shipped to America. Why did I give it 4 Stars as opposed to 5? The book was too much for me. It spanned too much time and there were too many characters in it. I felt part one was a solid 5 extremely powerful stars. Part two was 3.5 stars because it felt a bit forced. The narration by Dominic Hoffman was fantastic and 5 Star! This is great on audio!I did find the black stone necklace that was passed down from generation to generation to be a very cool symbol that the author incorporated into the story. I read this book because of my friend Diane's review. It is much better than mine and she liked the book more than I did. Check it out here: https://www.goodreads.com/review/show...The writing is exquisite. Yaa Gyasi is an extremely talented writer. This is such a powerful debut and I can't wait to read her next book! Highly recommended to everyone. It's not an easy read but it is a very important one!!! Now I'm going to go and curl up with my furfamily and decompress. These past few days have been intense."}, {"userName": "Hannah Greendale", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend. Homegoing is a multi-generational saga that follows the descendants of two half sisters, Effia and Esi, across three centuries, beginning in eighteenth-century Ghana and arriving at the present day. Each chapter of Homegoing introduces a new character, which means readers are subjected to endless amounts of backstory - seamlessly integrated albeit wearisome. In many cases, when a character's story reaches its apex, the chapter ends, giving no immediate sense of resolution. Two chapters later, some explanation for how a character's story ends is tacked onto the narrative of whatever new ancestral character is being introduced. Reading this book is akin to reading a collection of short stories, most of which lack a complete story arc. The problem with introducing so many characters is that readers are afforded such limited time with each of them that it's difficult - almost impossible - to form any sort of emotional attachment to any of them. It gives the sense that readers are distant bystanders, too far removed from the story to be personally invested. The most notable characters are half sisters Effia and Esi. The entire book hinges on their having never met, and it seems like a missed opportunity not to have dedicated the novel to their story alone. \"And in my village we have a saying about separated sisters. They are like a woman and her reflection, doomed to stay on opposite sides of the pond.\" The writing is consistent and precise throughout, though nothing makes it special or striking. No memorable phrases or lush passages leap off the page. Homegoing's strength has to do with the author's depiction of Africa and America across centuries. Life and customs in Ghana are portrayed in rigorous detail, the horrors of the slave trade are acutely rendered, and the rising up of a nation built on prejudice and discrimination is depicted with exactitude. \"You want to know what weakness is? Weakness is treating someone as though they belong to you. Strength is knowing that everyone belongs to themselves.\" Homegoing is a commendable debut but doesn't live up to the hype."}, {"userName": "PorshaJo", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "There are sometimes when you read a book, you finish it, close the book, and think to yourself, that was good. Then, you simply and immediately pick up your next book and dive right in. Not giving that original book another thought. Then, there are those rare occasions where you read a book, finish it, simply close the book, and sit there stunned. You think to yourself, what the heck do I read next, knowing the next book will not compare. Knowing you can't get that original book out of your head and for days after finishing, that is all you think about. This is one of those rare occasions for me.Homegoing tells the story of two half sisters, Effia and Esi. Born to different villages, who grow up in different circumstances, and have *very* different lives. The book tells the story of many of their descendants covering over 300 years. It goes into great detail of slavery in the 18th century, how slaves were captured, and sold, and brought to America, used in mines, moving from Ghana to the South (Alabama) and to New York. There is so much tragedy on both sides of these families.Each chapter is a story of one the girls descendants, alternating between Effia and Esi's sides of the family. There are a lot of characters in the book and at times, it can be difficult to keep track of who is who. The book includes a family tree which makes it easier to keep track of them. Not every characters story is cleanly wrapped up and some character you learn more about what happens to them in their children or grandchildren's story. Some, you just don't know. And to me, this all added to the overall story. Perhaps some people might not like that and want each story neatly wrapped up.Homegoing is not an easy read. Often times, it's brutal in its depictions of what happened to these characters/people. I found myself thinking at times, did that really happen in our history, and it is quite sad to think, yes, it did. I think perhaps I should feed bad that I enjoyed (is that the right word) reading this book when it deals with such horrible atrocities. But I feel that I learned so much about this time in our history, even though this is fiction. It makes me sad to know this did happen. I'm also very shocked that the author is 26 and grew up in Hunstville, Alabama. To write a book so vivid on descriptions of Ghana and slavery and this epic saga over many years......I have no words. Congrats to Yaa Gyasi and I look forward to see what you give us next.I listened to this book via audio and the narrator was perfect. His voice, tone, and sometimes accent added to the overall experience of the book. I would highly suggest to pick up the audio but also, using the family tree of descendants to keep track of everyone.This is so far my best of 2016, a favorite, and one I would read again in the future. And I plan to read it next time."}, {"userName": "Carol", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "“Every moment has a precedent and comes from this other moment, that comes from this other moment, that comes from this other moment.” - Yaa Gyasi26- year old Yaa Gyasi wrote this debut novel after visiting Ghana, her native country, 18 years after her family moved to the United States. There to research a future novel, she visits Cape Coast Castle where slaves were kept in dungeons while awaiting transport to the new world. The author stated (in an interview) that the castle visit gave her the impetus to delve into this story. As a result, these early chapters were the most haunting sections of the book for me. It was almost unbearable to read Gyasi’s description of the brutal and horrific conditions that Esi, the half-sister, endured in the dungeon while awaiting her turn to board the ship. The scenes of stacked bodies lying within their own waste were so vivid that I also felt entombed, smothered and oppressed within that godawful dungeon.Cape Coast Castle located on the Gold Coast of GhanaIt’s an astonishing piece of work that explores interconnected stories and big themes such as the diaspora of Africans during the trans-Atlantic slave trade, the complicity of the West Africans with European enslavers and the appalling effects of long-standing racism. And…she miraculously accomplished this in 300 pages! The novel moves between continents and over centuries to follow the descendants of two half-sisters from Ghana’s Cape Coast. One sister is married off to a British slave trader and lives in the upper levels of the slave castle. Unbeknownst to her, the other sister is captured, held in the castle dungeon below before being sold into slavery in America.Each generation is a brief chapter and the characters within those chapters give a human face to a period in time in which they live. It’s a testament to the author’s talent that she is able to draw you in quickly with each short story that ultimately highlights the human dimensions of slavery’s legacy, racism and of a segregated culture.This is an eloquent, spare and poignant book. It’s beautifully told and compelling to the end. I recommend it highly!"}, {"userName": "Maxwell", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "An absolutely stunning debut; one of the best I've read. Yaa Gyasi captures so many stories and handles them beautifully. We need more novels like this. And it's only her first! I can't wait to see what she does next."}, {"userName": "Steve", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/236411-steve", "userReview": "When a book is as popular and praiseworthy as this one, it’s easy to join the chorus justifying why. It’s much harder to come up with anything new to say. I’ll attempt the latter in a minute, but first here’s a recap of what others have already said:» Young, debut author born in Ghana, brought up in Alabama writes a brilliant novel spanning multiple generations, putting faces on the African and African-American experience.» The story begins with Effia (the beauty) who seemed destined to become a tribal big man’s wife who instead is married off profitably to a British officer there for the slave trade. Esi, a half-sister Effia knew nothing about, is captured in a neighboring village, brought to the horrific dungeon (with worse conditions than a caged chicken’s) at the Cape Coast Castle where Effia lived, and is ultimately shipped off to America. » The book proceeds to tell the stories of characters in each subsequent generation, alternating between Effia’s line in Africa and Esi’s in the states.» Projecting into slavery and racism in the abstract is bad enough, but when it’s personalized through characters we come to know and admire, it sucks even worse.» Life in Africa wasn’t always great either with raids on villages, battles against the Brits, my-way-or-the-highway missionaries, and complicity among the Asante in the slave trade.» Character profiles allowed Gyasi to hit on many endemic hardships. Among the most affecting were: difficulties in being mixed race, severe pain and scarring from the lash, trumped up charges forcing labor in the coal mines, the lure of an artificial escape (narcotics), and racism that may attenuate over time, yet still persists.» The only real criticism I’ve heard is that the characters can seem underdeveloped. With only twenty or so pages for each one, we don’t get to know them all that well. Reviewers who dock a star invariably cite this as the reason. » Nobody I’ve seen docks more than one star – for any reason.Hmm… did I really commit to saying something new? Let’s see [scratching head, looking simultaneously sheepish and stupid]… Uh, well, there’s this:» Skin tones of different characters were often mentioned, almost always as some combination of a caffeinated beverage and dairy, with proportions varying.» At times, other properties of flesh (e.g., fullness, jiggliness) were detailed as well. Looks were emphasized quite a lot.» This isn’t so much a new thought as it is an amplification on a previous one. With the brief time spent with each character, Gyasi does an impressive job of highlighting personal experiences that may well have applied to many at the time. Each had idiosyncrasies, too. But if I’m honest, generations are already fading from my memory, and I’m only a week removed from them. Too many faces come in too short a time to keep track.» Related to the previous point, the character vignettes often ended abruptly. After seeing this pattern repeated, it felt like a device. And it kind of broke the spell.» Again commenting on the brief stints with each character, individual dramas had little time to build. I appreciate that Gyasi could bring forth an epic feel in 300 pages, but certain characters deserved more, I felt, to really permeate. Like I said, it’s hard to find anything new to say since Goodreads reviewers have already covered the relevant ground so well. As further evidence, I’m not the first to highlight the quote below. But it came from one of my favorite characters, a teacher in Ghana disfigured by fire, so I have to include it.\n[…]when you study history, you must always ask yourself, whose story am I missing? Whose voice was suppressed so that this voice [from the one in power] could come forth? Once you have figured that out, you must find that story too. From there, you begin to get a clearer, yet still imperfect, picture.\nNice take-away point, wouldn’t you say? Gyasi epitomized this view of history with her rousing historical fiction."}, {"userName": "Warda", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "*Since it is Black History Month in the UK, I thought I'd re-share my thoughts on this book. I read it a few months ago and found myself slowly becoming enwrapped in this compelling generational story, which perfectly portrayed the evolution of the struggles of the black movement. This is definitely a book you'd want to read to familiarise yourself with their continuous battle, but to also recognise, honour and celebrate their often neglected achievements.**I just had to change my rating to a 5 stars. It's resonating so heavily with me right now.*Wow. What an incredible story! I'm pretty much blown away by the scale of epicness of this book. It's grand and I felt fulfilled by the end of it. This novel, that reads like a collection of short stories, has the unique setting of each chapter following a different character's perspective, a new generation that follows on from its descendants - from Ghana to Harlem - that are often referred back to. It's structured like a family tree, where we follow it's branches down the line to its origin. The roots; which are constantly destroyed due to slavery, colonisation and police brutality. I'm amazed by the depth of the characters within each chapter. The story is emotionally brutal and complicated and the characters are extremely well-developed to the point we get to know them intimately though not much time is spent with them. Even though a generous amount of time passes between each chapter, it still reads like a full story. It left me wanting more when it ended and the point of view switched. ‘Homegoing’ adds a sense of urgency and relevance to the current political climate, pointing out the wrongs that existed then and now. A lot of things that happened in history are still taking place which is heartbreaking and angers the reader, but inspires empathy and hope in them equally, given a voice to those group of people who had it suppressed. Gyasi did an incredible job with this novel. A must read!"}, {"userName": "Cheri", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "4.5 StarsCovering the Asante and Fante tribes from 18th Century to the present, Homegoing follows two different families, two half sisters, Effia and Esi and their offspring. The sisters grow up knowing nothing of the other. Both are given a black stone necklace, to be passed down to the next generation. Both sisters are born in Ghana, spend their early years in Ghana, Esi is shipped to America as a slave. Effia stays in Ghana and marries a British soldier who works in the slave trade, living in the Castle above the caves, where Esi is first taken before beginning shipped to America. His other wife and family live in England. Effia’s lineage stays in Ghana, enduring their own terrible conditions, bearing their own sorrows, until one leaves for a life in America. There is a plethora of heartache and tragedy, despicable conditions. There is little reason for joy, but there is love, enough love to keep going, to keep hope alive. For me, it spanned so much time compressed down, some parts, as a result, felt a little rushed to me. There were so many characters, spread through so many generations that I wanted to know more about. Throughout, the story is undeniably gripping, the writing superb, even through the deeply dark stories of some of the lives. This debut novel is simply stunning. Reading this was an intense experience, Gyasi’s passion for this story will grab your heart and leave you thinking, and feeling for a long time."}, {"userName": "Adina", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "“We believe the one who has power. He is the one who gets to write the story. So when you study history you must ask yourself, Whose story am I missing?, Whose voice was suppressed so that this voice could come forth? Once you have figured that out, you must find that story too. From there you get a clearer, yet still imperfect, picture.” I was a bit afraid to read this novel because of its hype as it seems that recently I do not fare well with overpraised novels. I can safely say that I needn’t have worried. The book lived to my expectation and felt touched by most of the characters. The writing is beautiful, powerful, heart wrecking.  It took me a while to finish as I listened to half of it on audible. I usually listen to audio books when I run and due to the cold that did not happen very often. At midpoint I switched to the print version and that went much better, succeeding to draw me back into the stories as listening for 10 minutes here and there was distracting. The novel mingles the stories of two half-sisters which never met, who lived in Ghana in the slave commerce period and of seven generations of descendants that followed. We follow Esi as she is sold into slavery and then we are introduced to her descendants as they struggle as slaves and then as free black people in racist America. On the other side, Effia is married with an English slave merchant and moves with him in Cape Coast Castle. Her descendants struggle with their legacy as slavers, their identity as tribe members and the fight for a free Ghana. Each chapter is told from the point of view of one family member, one chapter from Effia’s descendants and then one chapter from Esi’s. It was impressive that for a small book (300 pages) it packs a lot of history of the hardship black people had to face because of slavery from the 18 century until recent times. The only downside for me was that, due to the large number of characters I had moments when I felt disconnected with the story. When I was beginning to understand and care for a character the next chapter started and a new story emerged, without too much connection with the one before."}, {"userName": "Jen", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "Homegoing is a journey of history. Black history. In this mesmerizing, breathtaking saga, a story of 2 tribes is told: the Asante and Fante in the Gold Coast in the 18th century. Two half sisters are born - one to each tribe and unknown to each other. Their lives go in polar directions with the white man determining their existence. One sister is selected to marry a white man who negotiates slaves and lives in prosperity; the other, is stolen and traded to live a life of hardship and heartbreak as a slave.The narrative takes several paths from these women - the generations that follow their legacy always bringing each home to their roots of who they are and where they came from. Beautiful prose, vivid descriptions and an emotional connection that was heartbreaking. Various themes throughout. This was an enriching and astounding debut. The only drawback was there were so many POV's that a closer connection to a protagonist was missing. But, upon reflection, I would reread this one in a heartbeat and this one will stay with me. 5*"}, {"userName": "Maureen", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "Right now it feels as if it's torn my heart and soul apart reading this deeply emotional book. It's been such a traumatic journey, and in addition to being profoundly moved by it all, I also feel both anger and shame at man's inhumanity to man.Homegoing tells the story of stepsisters, Effia and Esi, and it charts their lives and subsequent generations of their families from the 18th century onwards, but most importantly it's about the slave trade in all it's grim and sordid detail. These sisters know nothing of each other's existence, and the path that their lives take are chasms apart. Effia marries an English officer and lives in luxury in the upper part of Cape Coast Castle, Ghana, whilst Esi is imprisoned in the dungeons below awaiting transportation, along with countless other poor individuals. The conditions that these people were kept in was simply appalling, and it wasn't as if life was going to improve once they were transported to a new country, because they would be kept as slaves with no real identity - they were just some rich man's chattel, there to do their master's bidding. Imagine living in a little village in Africa, living a simple life in mud huts- their lives weren't always easy, but they were free, they had identities, those little quirks that made each person individual, and then suddenly you're torn away from all that you know, into a life of slavery.I have to say that this was a harrowing read but an important one, and I'm going to find it very difficult to put it behind me. When I finished this book I felt like a silence had descended, that feeling of how do I move on to another book immediately after reading this? How do I bring my thoughts together to write a review. I have to say that this book felt quite special. If I have just one criticism, it would be that each chapter featuring a different character, ended quite abruptly with no real flow into the next. However, this is a minor point, and didn't detract from the overall feel of the book.It's hard to believe that this is Yaa Gyasi's debut novel, she writes with such clarity, bringing the many characters to life, both in terms of their feelings, and the situations that they had to face, and it's such a powerful piece of social history, that I would recommend it without reservation. *Thank you to Netgalley & Penguin UK for my ARC in exchange for a fair & honest review*"}, {"userName": "Candi", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"He had always said that the joining of a man and a woman was also the joining of two families. Ancestors, whole histories, came with the act, but so did sins and curses. The children were the embodiment of that unity, and they bore the brunt of it all.\"Homegoing is an astonishing and heartrending debut novel written by the undeniably talented Yaa Gyasi. Truly epic in scope, the book covers a span of about three-hundred years from the eighteenth century straight into the twentieth century. Alternating between Ghana and America, Gyasi weaves a masterful account of the lives of two sisters, Effia and Esi, and their descendants. One sister wed to a British slave trader and the other doomed to the horrific fate of a slave bound for the American south, both will suffer from the legacy of slavery, injustice and greed as the consequences seep through the generations of each of their families. The reader follows a large number of characters who, for the most part, are given a single chapter in which we learn of their life, their hardships, fears and desires. On rare occasions, we are able to feel their joy. The symbolism of fire, water and a special necklace follow them all. I learned a lot about the tribal warfare of western Africa and the colonization by the Europeans, all which led to the realization of something as horrific as the trading of human lives in exchange for power and money. Some accepted the legacy of their fathers and mothers and others sacrificed so much to escape the injustices imposed on themselves and others. I was familiar with the stories of the southern plantations, the lives of those that were “free” but oppressed by the Jim Crow laws, and the great migration to the north where many sought what they hoped would be a better future for their families and children. But each story I hear is unique, each individual has their own personal sufferings, and I cannot help but feel for every single one. Many are such heartbreaking stories. Women like Willie who would set her soul free and learn to sing again, and men like Yaw who bore indescribable physical and emotional suffering but could also be set free by the gift of forgiveness – such accounts brought a glimpse of light back into their lives and this book. My only wish as I read this powerful story was that I could spend more time with each character. In some ways, this felt like a series of interconnected short stories. At first, I became a bit confused when the narrative jumped to a new character. A family tree at the beginning of the hard or electronic copy is definitely a plus. As the book progressed and I realized the intent, I easily settled in and went with the flow of Gyasi’s skillful writing. I just loved the way everything was tied together when I turned the last page. I will jump at whatever this author has in store for us next! I can only imagine the superb character development that would result from the penning of a novel with perhaps fewer characters. At the same time, I feel that the goal to present us with a saga illustrating the institution of slavery and its effect on multiple generations was accomplished with competence and dignity. I will not soon forget this stirring novel. Highly recommended with a rating of 4.5 stars!\"Evil begets evil. It grows. It transmutes, so that sometimes you cannot see that the evil in the world began as the evil in your own home.\""}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "I know I said I wouldn't review here anymore but then I READ THAT BOOK and I have things to say so here's me being inconsistent okay? Brace yourself, incoherent thoughts coming in 5... 4... 3... 2... 1...I can't help writing about Homegoing for the simple reason that it is BRILLIANT. I don't even know how many times I fell in love and got my heart broken but DAMN IT WAS WORTH IT.The truth is though, many readers won't read it, because of several excuses :First off : Homegoing deals with slavery, through an incredible family saga. The truth is, I've always been wary of sentences like, we already know about this so let's move on.Haha.We see how it goes when people *think* they know enough about History. Proof #1 - French people rewriting history and stating things like, \"we fought in 1940 so fuck off refugees!\"I'm sorry WHAAAAT? Nope most didn't. Nope. Stop saying this. STOP. You're merely showing how uneducated you are. Same with the ones who think that the EU was created solely for fighting the United States. Can you just stop? It's starting to get embarrassing, Trump. Proof #2 - Two days ago I've read a comment on Facebook stating that \"Palestinians were just ARABS who should come back to their country of origin.\"Oh my God school is GREAT. TRY IT.Proof # 3 - And then you have this :(you can read her post here)The disheartening and offensive papers this poor prof had to read show again that what we can be fairly uneducated on subjects we *think* we know, and in my opinion, 1) it's never too early to start educating people about this and 2) we have to reevaluate what we know fairly often because our self-assessment scale is often broken. About my first point : of course we're not going to teach slavery in Kindergarten, BUT children of 8 to 10 can start dealing with these subjects. In my class, for example, I teach the broad lines of triangular trades, according to the National curriculum. Yes, we talk about how Bordeaux and Nantes's merchants became rich because of it, and at this point, I don't care if some pupils come from these families. They need to know it even more, because... you don't get to be proud, guys. You don't. I don't care about fake patriotism. It's unhealthy to create some phantasmagoric history of your country. It always is. I think that one of the worst misunderstandings these days is that bullshit that makes people say that you are being unpatriotic if you point your country's flaws and horrors. It's the opposite, guys. I am being patriotic when I talk about the French involvement in slavery. I am, because I am trying to make my country better in the future. By hiding behind fake news and rewritten history, you are not. You are missing the point entirely, because what you're so proud of isn't your country but merely a fake, dangerous and empty shell.Then there comes the compelling excuse. \"I'm not reading that serious book of yours, I'm here for the entertainment, ha!\" You know what though? Homegoing is compelling and enthralling, I fell in love twenty times, my heart constantly breaking itself then healing then breaking then - the FEELS. .So. Let's sum it up.1. You're gonna fall in love and ship the fuck out of some of them and care and she manages to do that in 20 pages EVERY FUCKING TIME. Brilliant.2. You're gonna be captivated and forget everything that is not these characters.3. The FEELS. Prepare your heart because WOW OKAY? I felt so offended and furious and despaired and FULL.4. You'll be a little further from an ignorant jerk. IN OUR WORLD THAT COUNTS.5. It's an ownvoice novel.6. The writing is perfect did I say that????Tell me now why you shouldn't read this book.Fucking tell me.For more of my reviews, please visit:"}, {"userName": "Jibran", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/5407952-jibran", "userReview": "We believe the one who has power. He is the one who gets to write the story. So when you study history you must ask yourself, Whose story am I missing?\nA literary DNA test of Homegoing would reveal it to be a direct descendant of Chinua Achebe’s Things Fall Apart; but whilst the latter is a pioneering attempt at a coherent English-language novel that explores the sociopolitical impact of British colonialism on the Nigerian native, Ms Gyasi’s book suffers under the weight of its own scope and, as the interconnected stories accumulate, loses all claim to characterisation, coherence, effect, and that initial flurry of intimate and ominous writing that held my interest for the first few stories, before it fizzles out like a candle that is only half burned but cannot shine any more light. Let me explain why.It’s an ambitious project. Ms Gyasi has positioned the needle point of the compass on Ghana and, starting from mid-18th century onward, gone round and round and round and round the map, to encircle and record all major events in the history of the Black people - from the earliest slave ships bound out of Cape Coast to inopportune mixed marriages, and from being whipped to death at the hands of settlers at American cotton plantations to finding their lost voice in the Civil Rights movement two centuries later.Each episode is led by an eponymous character whose story is hastily and perfunctorily told in 20 to 30 pages, using the device of plentiful flashbacks to connect the dots, and just when you feel you’re getting to know your man (or woman), the story ends and a new character comes in to take the marathon stick and runs you through yet another gory episode in the universal history of the Black people.Now, this is enough criticism already. This is a debut novel and I must cut her some slack. So whence come the high rating? Clearly it’s the content, the material weaved into the stories: misfortune, war, tragedy, slavery, inhumanity, and oppression suffered by the weak at the hands of the powerful, by the barbaric races at the hands of the civilised people (irony, anyone?). The overall effect created by these stories rents your heart asunder. But still, it would serve to stress that it does not read like self-conscious pity-me misery porn, the appeal to raw sentimentalism, which I do not like in my literature.Although the writing is quite basic and the focus is entirely on narrating the events in the lives of each of the characters, I appreciated the three-four opening stories set in Cape Coast’s Fanteland (which is the most Achebe part of the book) where warring tribes eager for supremacy against their rivals had been helping the British to capture and enslave their own people. This shows that both British and the black natives were guilty participants in the original sin to start up the transatlantic slave trade but whilst Western countries gained a huge economy on the back of slave labour, what little the natives got paid for it did not benefit their local economies in any substantial way.I liked how a local Fante myth (superstition?) was used to imagine the story of the two half-sisters who did not know about each other's existence and whose mother at first suffered the fate of the captured slave, beaten and raped, from which a girl was born, but later found happiness with a man who had taken her after her fiery escape. For generations to come, both her daughters and their descendants would share in the fate of their ancestor.One half-sister is taken by a British officer as his “wife” – wife in inverted commas because:\nShe’d heard the Englishmen call them “wenches,” not wives. “Wife” was a word reserved for the white women across the Atlantic. “Wench” was something else entirely, a word the soldiers used to keep their hands clean so that they would not get in trouble with their god, a being who himself was made up of three but who allowed men to marry only one.\nThe other half-sister is captured and sold to the British colonists. She is enchained and put in a dungeon of shit and blood not far from where the other one lives a comfortable if lonely life. One gives birth to a half-caste boy who is eventually educated in Britain; to the other is born a girl who would end up a slave at a Mississippi plantation. One is water, the other is fire.\nAnd in my village we have a saying about separated sisters. They are like a woman and her reflection, doomed to stay on opposite sides of the pond.\nNote: DNFJuly '16"}, {"userName": "Melanie", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "Talk about ending my reading year with a bang; Homegoing by Yaa Gyasi blew me, and my expectations, away. It was everything I could ever ask for in a book, and the stories will stick with me for the rest of my life.\n\n“The family is like the forest: if you are outside it is dense; if you are inside you see that each tree has its own position.”\n\nThis is, hands down, the best family saga I've ever read, and this is only Yaa Gyasi's debut novel! In three-hundred pages, Yaa Gyasi shows us seven generations in fourteen different points of view; each of which will leave you haunted, and start important discussions about the world we live in today. This book leaves a powerful message about immigration and our views on it in today's world. For this alone, it should be required reading. 2017 is going to be a very important year; we all need to educate ourselves not only about current events, but also events of our past. America is a melting pot, and it is a beautiful thing that we shouldn't be ashamed of. We need to stop segregating, and begin embracing. This book even touches on the broken cycle that is the war on drugs, and police brutality. Yes, slavery was abolished in America in 1865, but that truly only abolished it on paper. Instead, whites incarcerated blacks for looking the wrong way, and forced them to do their punishment/sentences with more \"legal\" manual labor. This book heavily talks about the coal mining era and how terrible our journey was to make America \"great\". Seriously, if you read this book and still say \"All Lives Matter\" I will personally punch you in the throat. \n\n“Evil begets evil. It grows. It transmutes, so that sometimes you cannot see that the evil in the world began as the evil in your own home.”\n\nThere is also a strong underlying emphasis on nature vs. nurture, which readers won't be able to ignore. Seeing traits getting passed down and seeing the similar mistakes each side on this family tree is so interesting. The biggest of all these important messages is probably about the main theme that is the slave trade. How people think that even in 2016 it is still okay to own people is astonishing. How slavery impacts every generation, and pretending that it never happened doesn't help us grow or become better. Slavery, and the inexplicable horrors and devastation it creates, has to be talked about, and taught more accurately about. We have to learn from the past to create a better and equal future, where people aren't forced into the roles they are given. \n\n“Weakness is treating someone as though they belong to you. Strength is knowing that everyone belongs to themselves.”\n\nI loved all the characters and all their impactful points of view, but I couldn't help but love Ness a little more than the rest. In only twenty pages, she will stay in my mind and heart forever. She was so strong, so brave, and so very heartbreaking. I would be so incredibly proud to have someone like her in my family tree.Honestly, I wish every white American could read this, and see these generations and the struggles they did not ask for, but were forced upon them, and learn. This would open the eyes of so many people, if only they would start their journey to battle the racism and the hate that is still so prevalent today. I know I sound like a broken record, but this book is so important.Homegoing is a story unlike any other I've ever read; as stated above, we follow the seven generations of two half-sisters who never even got the chance to know one another. Both of their lives start in what will eventually be Ghana, a country on the West Coast of Africa. And even though they are born in a very close proximity to each other, they are from different tribes.One is married to a British man of great importance and they live together in a communal castle that is a hub for slave trade. While one of the sisters gets acquainted with her new life away from her tribe, the sister she never knew is getting prepared in that same castle, but to be sold out of the insufferable dungeons below. From there we get to see the different threads that originated from these two star-crossed sisters. And even though you only get to spend about twenty pages with each family member, you can't help but love them all. This book is so intelligent, and so well plotted. Yaa Gyasi deserves every dollar she received for this book before it was published, and this book deserves every ounce of hype it receives, because it is so important and impactful. I think it needs to be said, that I think the best way to read this book is to read it two chapters at a time. This makes it so that you will read roughly the same time period of the two different family trees of the half-sisters. Sometimes, some of the old characters show up with pretty important cameos in their descendant's points of view, and each time it felt like Christmas morning. I also became addicted to looking at the family tree every new point of view. I couldn't help it, this story was so immersing and I was so addicted. \n\n“The need to call this thing “good” and this thing “bad,” this thing “white” and this thing “black,” was an impulse that Effia did not understand. In her village, everything was everything. Everything bore the weight of everything else.”\n\nPlease give the book a shot. It is worth all the hype and will change your life. I will forever cherish this book and its message, while gifting it to all my loved ones. If I could only recommend one book in 2016 it would be Homegoing by Yaa Gyasi. It is truly nothing short of a masterpiece. Blog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"userName": "Jenny (adultishbooks)", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/3772692-jenny-adultishbooks", "userReview": "Go read this book. NOW.I don't care what you're doing or what you're reading. You should have intense FOMO about this. So much that you will stop what you're doing and get your hands on a copy ASAP.I don't throw around 5 stars often so you should take this as a huge \"get your ass to your library or bookstore and get a copy of this.\"Take the day off. Binge read the shit out of this book. Then, experience that rare book hangover that makes you question everything, including hard facts you know about yourself, including your name and DOB. Plus, this chick went to the Iowa Writers' Workshop, a program I despise and she still prevailed and rose above all the bullshit writers they have churned out over the years.I could keep going but I need to get back to work."}, {"userName": "Lauren Cecile", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/21468256-lauren-cecile", "userReview": "Great, well-researched book spanning generations and brilliantly showing how a people's past influences their futures. This was the first time I read anything that illustrated so vividly how Africans were complicit in the trans-Atlantic slave trade. (I believe that's part of the reason that the mainstream critics love it.)I enjoyed the scenes in Africa even more than the scenes in America although the chapters about how the Alabama penal system used wrongfully convicted convicts to work in the coal mines were especially compelling.I wish the author had varied the names of the characters a little more because the cast was already large and the names were so similar that it was difficult to keep up with them. Also as soon as I became emotionally invested in one character, the chapter changed and another character became the focus. It was mildly reminiscent of Twelve Tribes of Hattie except that there was continuity between characters, eras and geographic migrations.After reading this book, there were so many things I wanted to Google about colonialism, post-Civil War slave labor, etc.The last ten percent of the book was a little pedestrian and the ending a little contrived, but I still appreciated the author's effort to make everything come full circle."}, {"userName": "Fabian", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Because it--coupled with a once-in-a-lifetime trip into el mero corazon Azteca i.e. Mexico, Distrito Federal--affected me so much at just the correct time, Homegoing for me is THE BOOK OF THE YEAR. It tackles huge themes (the main and overpowering ingredient in all the realm of literature is this confidence on the auteurs part to handle & fashion the ethereal) with the verocity and insatiability of a killer shark. Gyasi is the perennial literary Great White Shark--less common this species is than the Great White Whale of Literatureland. Each one of Homegoing's stories is a tragic-filled morsel of third world suffering. Of omnipresent sorrow. The type which you, as a super lucky individual, couldn't even begin to fathom or properly imagine.Tribulation, plight, anarchy, struggle, struggle, struggle... With this masterful novel it's not a question of will you cry but when."}, {"userName": "Karen", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "4.5 Hard to believe this is a debut novel.This follows the families of two half sisters Effia and Esi in Ghana at the beginning of slavery in the eighteenth century. Effia gets married to a Brit and her descendants for the most part stay in Ghana through brutal conditions. Esi's descendants traded off to the American slave market and we follow them here...I never knew about the beginnings of slavery before this book... So many memorable characters. Very good, highly recommended."}, {"userName": "Zoeytron", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "An ancient humpbacked apothecary with a wildly rolling crazy eye stumps around with a serpent-headed cane. Watch out, this old woman has a predilection for spitting. Although she cannot make impossible things come true, she can 'make the possible attainable'. Black magic, voodoo, bad juju. One who dreams of a firewoman and another with a deathly fear of water. From the Gold Coast and slave ships to Harlem's jazz joints and junkies, this is an exceptional novel of slavery and freedom, and all that they imply."}, {"userName": "Mary", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/5304930-mary", "userReview": "So when you study history you must ask yourself, Whose story am I missing?, Whose voice was suppressed so that this voice could come forth?I’ve always been slightly envious of people with a clear-cut chronicle of their family history. Mine is vague, messy, and most definitely lost. Everything I know is half-truth and speculation, and so many are dead. My paternal grandmother, for example, died when my dad was a baby in a small mountain village in the middle of a war. Of what? “Women’s problems,” my mother whispered once, though she wasn’t born until more than a decade later. “TB,” my dad said another time, staring at the wall. Prior to that he said “cancer” and “heart problems.” How old was she? What was she like? Nobody knows. Nobody recorded anything.I only know what I’ve been told.So imagine that your family's history is documented for seven generations. Imagine you’re a child and you can see your family’s story through one descendant for over two hundred years, and with that you can watch the world change and the world stay the same. This is what Gyasi has accomplished in a remarkably economical 300 pages. From the Asante Kingdom and their complicity in the British slave trade, uprising and war, missionary oppression, and a new Ghana -- and on the other side there’s those who were dispatched from Cape Coast Castle into Great Britain and the New World of the American South, and on and on from the 18th century, past emancipation, past the civil rights movement, and then it’s the 80s, and this is how far you’ve come, and this is how you’re still in the same place. There’s a heaviness that this book leaves you with: a sadness for everything you'll never know and everything you've lost. Gyasi’s chapters are fleeting, almost vignettes, almost interconnected short stories. Time flew by. Centuries came and went. What changed? They would just trade one type of shackles for another, trade physical ones that wrapped around wrists and ankles for the invisible ones that wrapped around the mind."}, {"userName": "Marilyn C.", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/8170584-marilyn-c", "userReview": "I found reading Homegoing both thought provoking and frustrating at the same time. The story is about two sisters, Effia and Esi, and their descendants, starting in the early 1760's to the 1980's. Their lives take completely different paths; with Effia marrying an Englishman in Ghana,and Esi being sold into slavery and shipped off to America.The writing in this debut novel was outstanding, and it does not take a person in the literary world to see that Gyasi has tremendous talent. The characters and the alternating stories were well done, and if I rated this book on her writing alone it would be a 5 star. I really enjoyed some of these characters and reading about their lives; the marriage of Effia and James and the love between Kojo and Anna.The frustration comes in when Gyasi abruptly ends the chapter you are reading. I really wanted more of these stories, but it just does not happen as Gyasi has set the pace of quickly going through each generation and not letting the reader know these characters for too long. You cannot read this book and not have a heavy heart. I would put this book down at night and start researching the beginning of slavery, some of the stories I have not reread since I was in school. (My husband loved me doing this at 11pm-in bed!) This was such an inspiring read, and I will be looking forward to Gyasi’s next book. 4.5 Stars!"}], "description": "A novel of breathtaking sweep and emotional power that traces three hundred years in Ghana and along the way also becomes a truly great American novel. Extraordinary for its exquisite language, its implacable sorrow, its soaring beauty, and for its monumental portrait of the forces that shape families and nations, Homegoing heralds the arrival of a major new voice in contemporary fiction.Two half-sisters, Effia and Esi, are born into different villages in eighteenth-century Ghana. Effia is married off to an Englishman and lives in comfort in the palatial rooms of Cape Coast Castle. Unbeknownst to Effia, her sister, Esi, is imprisoned beneath her in the castle's dungeons, sold with thousands of others into the Gold Coast's booming slave trade, and shipped off to America, where her children and grandchildren will be raised in slavery. One thread of Homegoing follows Effia's descendants through centuries of warfare in Ghana, as the Fante and Asante nations wrestle with the slave trade and British colonization. The other thread follows Esi and her children into America. From the plantations of the South to the Civil War and the Great Migration, from the coal mines of Pratt City, Alabama, to the jazz clubs and dope houses of twentieth-century Harlem, right up through the present day, Homegoing makes history visceral, and captures, with singular and stunning immediacy, how the memory of captivity came to be inscribed in the soul of a nation. Generation after generation, Yaa Gyasi's magisterial first novel sets the fate of the individual against the obliterating movements of time, delivering unforgettable characters whose lives were shaped by historical forces beyond their control. Homegoing is a tremendous reading experience, not to be missed, by an astonishingly gifted young writer.", "title": "Homegoing", "url": "https://www.goodreads.com/book/show/27071490.Homegoing", "average": 4.41, "cover": "https://images.gr-assets.com/books/1448108591l/27071490.jpg", "reviews": 11855, "authors": [{"url": "https://www.goodreads.com/author/show/14493315.Yaa_Gyasi", "name": "Yaa Gyasi"}], "type": ["Historical", "Fiction", "Cultural", "Historical", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27071490-homegoing", "http://www.goodreads.com/book/show/30564665-homegoing", "http://www.goodreads.com/book/show/30849411-homegoing", "http://www.goodreads.com/book/show/28250847-homegoing", "http://www.goodreads.com/book/show/28683066-homegoing", "http://www.goodreads.com/book/show/39342969-no-home", "http://www.goodreads.com/book/show/29343887-spring-2016-debut-fiction-sampler", "http://www.goodreads.com/book/show/34146421-granta-139"]}