{"ratings": 546, "userreviews": [{"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "DNFAhhhh that dreaded DNF….I honestly can’t think of the last book I didn’t finish. Even on the worst of books I try not to quit in the middle-But sometimes you just can’t help it. I mean…think about it. What’s worse? Cutting your losses when you seem to not connect in any way or forcing yourself to read through every. Single. Page? I had the highest of expectations for this story when I received the ARC and a blog tour invite-this premise, as mentioned below in some of my comments, is actually a very hard story to tackle. So, of course, when one is presented in front of you that seems like it COULD be absolutely amazing, you take the chance. Well…after this one I think I’ll just trust my instincts.This really isn’t the worst ARC I’ve ever gotten by any stretch of the imagination, but it was boring enough that I finally just lost any interest in trying-I have like…..NO time to read or review anymore, so when I have the time, I refuse to waste it on a story that seems like it was barely looked over or edited. Chapters that were sometimes a half page long (or so it seemed) made it impossible to connect with any one character, and then when you did get an extra page or two for the chapter, the writing was so stilted that you almost felt as if you were a dog, tilting your head this way and that with a confused, furrowed brow. At one point I was all the way through a page (before I was even skimming) and was like…what even happened? I already had forgotten. I can’t say this book wouldn’t be better had I been in the mood and perhaps forced myself to really try to connect with what was being said, but in this stage of my reading life, knowing what I love and like to read, should I really have to force myself to get through chapters that are already short to begin with?As for the rest of my problems, why even bother? I can’t even tell you what percent I got to, but I know it wasn’t worthy of a normally18 paragraph Chelsea review. So, instead, I will just list my dislikes and let you decide if these, too, are your turn offs:-Short, choppy writing-No flow…whatsoever-Tiny chapters-Vapid female lead -Lack of a build-up-Lack of a good background-stupid convos-INSTA-LOVE -Fuck knows what else I missed skimmingEven now I can’t diss the main male lead who was partly to blame. I have issues guys…I really do. But maybe the real issue here is that I didn’t give this author or this story long enough-I feel bad, honestly, but when you just don’t connect with a book, you just don’t connect. It already has some wonderful ratings, so perhaps it’s just me. Maybe give it a chance and see what you think….I just couldn’t be bothered.For more of my reviews, please visit:"}, {"userName": "Lexie", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/20726801-lexie", "userReview": "Reviewed at The Honest Bookclub.4.5 stars.ARC graciously provided by the publisher (and the author, because I'm nothing if not a professional beggar) in exchange for an honest review.As Cait Grace and I have recently found out, this year Simon and Schuster has set out to fill all our disappearing needs - or the lack thereof. For those who find themselves growing translucent against their will, S&S are publishing Clare Furniss's How Not to Disappear - a practical guide to regaining a corporeal form. (Or possibly it's a YA contemporary about teen pregnancy and familial ties. One of the two.) For those who have accidentally stumbled upon a crime scene and have to fashion themselves a new identity, Ann Reidich Stampler's How To Disappear offers the alternative.Protagonist #1 - Nicolette Holland - a beloved, bubbly, popular girl - has stumbled upon a grizzly murder and promptly disappeared. Protagonist #2 - Jack Manx - a son of a notorious criminal - has been sent to find at kill her.Protagonist #1, as it turns out, isn't well-versed in disappearing. Which is just as well, because... protagonist #2 isn't well-versed in murder.And this battle of need-versus-want in a life-versus-death situation is exactly six kinds of wonderful (all of which are hard facts, too - wait and see).\nFact #1: The world needs more YA mystery/thrillers.\n For those yet on the fence about it - How To Disappear is sure to gently, lovingly... push you off said fence right onto the mystery side. It's spooky and ominous there, and there are guns and devious schemes, but it has action and mindblowing plot twists and all the best parts of the fast-paced genres we all know and love.\nFact #2: Morally dubious gray-area protagonists are the best protagonists.\n Nicolette is the universally-beloved stepdaughter of a rumored crime lord. She loves nail polish, carbs, her best friend and chaotic pranks. Jack is the universally-feared son of a confirmed criminal. He loves the academics, books, pretty girls and his mother. Then Nicolette is forced to run for her life. And Jack is ordered to end it. If ever there was a situation to bring out the anti-hero in us all, it's the life-and-death, fight-or-flight one. And if ever there was a book chockfull of just that situation - it's How To Disappear.\nFact #3: Dual narrative can be all kinds of perfect.\n Many an author has yet to master dual narration. Ann Redisch Stampler is way ahead of the curve. Nicolette and Jack read exactly like what two teenagers on the wrong side of the law would read like. Their banter is clever, occasionally dramatic and more than occasionally hilarious. Each has their own voice. Each has their own values. And as all good duos do - they very often clash. Which is the best part, really.\nFact #4: Nicolette Holland wins the day.\n Through all their ingenious decisions and ridiculously bad moves, both Nicolette and Jack are lovable. But Nicolette. Ah, Nicolette is the special kind of lovable. The kind who doesn't see the world in cliques, but as people. The kind who never forgets to eat and joneses for a chocolate bar. The kind who stays in touch with a best friend even when it's the least safe option she has before her. The kind who loves her thin body just as well as her heavier one. The self-sufficient kind who believes in self-defense. The kind who sets things in motion. And the kind who always has a plan. And we all need to be a little bit more Nicolette when push comes to shove.\nFact #5: forbidden romance is perfection.\n Not that this needed to be said.\nFact #6: there's dynamite in the climax and it will blow your mind.\n You have been warned.\nAnd a lie: you know exactly where this is going."}, {"userName": "Estefani", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/24569331-estefani", "userReview": "4 StarsReview also on Fiction Jungle\n“I’m supposed to figure out how to murder a blood-crazed girl who disappeared. Because if I don’t, maybe my brother dies or worse. Murder. Welcome to the family business”\nHOW TO DISAPPEAR is an incredibly dynamic thriller where you get to experience the story from each characters’ point of view, and it’s kind of refreshing in a way, where you need to join the dots to see a full picture, and that picture isn’t exactly pretty. And what can you expect from these characters with families of criminal backgrounds?If there’s something I love is couples who are constantly at each other’s throats. Nicolette Holland and Jack Manx are exactly that, once their paths intertwine, constant banter and battle of wits ensues, and aside from the fact that one is supposed to kill the other, you will be rooting for them because great chemistry just can’t be ignored. Nicolette is as unapologetic as she is charismatic, she has this way of carrying herself that completely grasps your attention from the very beginning and it actually makes you wonder even more; did she do it?One of the things that most impressed me about this novel, is how realistic it was. How realistic a cross-country YA Thriller can be? At what point you draw the line? How far can two teenagers go without messing it all up? HOW TO DISAPPEAR delivers an accurate atmosphere where its two main characters are bound to make all sorts of mistakes.With truly exceptional writing, full of anticipation and engaging dialogue this novel never failed to give the reader action-packed encounters and unsettling truths with a hint of an ever-present and enjoyable romance.\n“He’ll never know. I saved us. Ask me if I’m sorry. Or not. You know the answer.”\n\n\nThank you Simon Pulse and NetGalley for providing this copy in exchange for an honest review.\n\nBookstagram | Twitter | Tumblr | Facebook | Pinterest"}, {"userName": "Carrie", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Nicolette Holland is a high school cheerleader, the popular, likable girl that had never expected to be on the run. But when a young girl is murdered Nicolette finds herself doing just that, running. She changes her appearance and finds odd jobs to support herself all while trying to hide. Jack Manx is doing his best to not get dragged into his family's illegal business. He's a model student with the straight As and athletic trophies. But when his brother insists that Jack needs to find Nicolette Holland and kill her because she has killed someone or if he doesn't his family will be in danger Jack doesn't know how to escape living up to the Manx name. How to Disappear is one of those reads that I just expected a bit more from it when I was reading. It wasn't a bad read but it didn't have that grab me and not let go intensity that I enjoy from a thriller read. The story is told changing back and forth from Nicolette and Jack's perspectives with it starting off with Nicolette going on the run after something happened. By the time the two encounter each other it turns more into a romance type of read than anything. By the time it gets back to the thriller part of the story it almost felt like just rushed to a conclusion at that point. Overall, 3.5 stars, an OK read but would've enjoyed more intensity. I received an advance copy from the publisher via NetGalley in exchange for an honest review.For more reviews please visit https://carriesbookreviews.wordpress...."}, {"userName": "Becca  ❀ (PrettyLittleMemoirs.com)", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/4575185-becca-prettylittlememoirs-com", "userReview": "May contain vague spoilers. As reviewed on Pretty Little Memoirs: http://prettylittlememoirs.blogspot.c...This is no ordinary story, in fact, the story is just the beginning. From the start, How To Disappear is split into two different voices and perspectives: hunter and hunted. Nicolette is loved and liked by everyone. She's the perfect friend, companion and always loyal. She is up for any adventure - that is until a woman ends up dead in the woods near her house - and it sends her running from anything and everything that comes her way - especially Jack, who's mission it is to find her on his brother's orders. Jack is far from clean-cut, with his family's dark past looming over him like a dark cloud. Even his high academic achievements can't wash away the stain of them, so when his brother ropes him into hunting down Nicolette and make her disappear, he can't get away. If he disagrees? He doesn't really need to know the details of not following orders - although Jack's brother makes his warning clear - he won't make that mistake. Like a heartbeat, How To Disappear races with a vibrant pulse of transfixing action and a twisted love story wrapped up with murder, secrets and lies. The clock is ticking faster down to every last moment that they outdo each other, racing against time to tell the truth and solve the mystery that makes Nicolette so wanted. They shouldn't be together, not when they are worlds apart and supposed to be on opposite sides of the court. Still they find themselves pulled together like magnets and slowly tearing away at their fake identities and pseudonyms. Smart, addictive and captivating, How To Disappear is one of the best books I read in 2015. Afterparty was the last book I read in 2014 - also by Ann - and now How To Disappear was my last for our year just gone and both were the icing on top of the cake for a year of amazing books. Something tells me that Ann's novels will just keep getting better, like this five-star, phenomenal read."}, {"userName": " ⇝LEAH⇜", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/9683519-leah", "userReview": "Well...I really like the cover...Book Title: How to DisappearAuthor: Ann Redisch StamplerSeries: Stand AloneGenre: YA, Mystery ThrillerPublisher: Simon PulseSource: Received an ARC for review from the publisher via NetgalleyRatings BreakdownPlot: 2/5Characters: 2/5The Feels: 1/5Theme: 1/5Flow: 1/5Backdrop (World Building): 2/5Book Cover: 4/5Ending: 1/5 Cliffhanger: NoWill I read more from this Author? I don't believe her writing style is for me, sorry, it's a no for me.\n 1.5/5 STARS\nMy ThoughtsI almost DNF'd this book, more than once, actually. I kept soldiering on with it, even though with every new development of the story, it just brought my rating further and further down. It had all the right elements to be a good mystery including an ending I didn't really see coming, but, it was not well executed. Too many eye rolling, over-the-top and strangely uncomfortable situations for me. Sex Factor: Yes, and it was strange and uncomfortable too."}, {"userName": "Stephanie Ward", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/4831794-stephanie-ward", "userReview": "4.5 Stars'How to Disappear' is a riveting young adult thriller that will have readers eagerly devouring the pages to figure out the mystery at the center of the novel. The plot was mostly original and the author added lots of great details to make it stand out from others like it. I loved the use of dual narrators - instead of getting to really know just one of the main characters, we are able to connect with both Nicolette and Jack, and are given the rare opportunity to see both sides of the story. I loved getting to know both Jack and Nicolette as individuals as well as how they interacted with one another, and how each one dealt with what was happening around them. They were both great main characters with unique personalities and traits - smart, resourceful, down to earth, determined - I could go on and on. I also really loved watching their attraction and relationship change and grow throughout the book. I think the romantic aspect of the story only added to the story and I didn't find it to be a distraction at all. The dual narrative made things more fascinating, in my opinion. Usually we only get to know one of the characters on a deeply personal level - and that's only if the author uses the first person point of view. With the added viewpoint of Jack, the entire plot became more intense and exciting. I was flying through the pages to see what was going to happen next while trying to figure out what in the world was really going on. There were quite a few twists and turns that I didn't see coming - and sent me right back to square one with my theories. I have to admit that this book had me guessing and speculating up until the end - which doesn't happen very often. I always love trying to get to the bottom of things before the characters do, but that was pretty hard with this book. I did get frustrated more than once, but it was in a great way - not one that had me ready to give up. It only fueled my fascination and determination to figure out what was happening. I don't do spoilers in my reviews, so I can't elaborate much on the plot or what happens during the book. I'll just say that it kept me on my toes and was a fantastic blend of mystery, suspense, and romance. Overall, I really loved this book and I definitely recommend it highly to fans of the genre, along with readers who enjoy mysteries, contemporary fiction, romance, suspense, and thrillers. You really need to get your hands on a copy of this book as soon as you can!Disclosure: I received a copy of the book in exchange for an honest review."}, {"userName": "Liz at Midnight Bloom Reads", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/3973124-liz-at-midnight-bloom-reads", "userReview": "Addictive and deviously fun, Ann Redisch Stampler's How to Disappear is an absolute adrenaline rush to read! This fast-paced thriller may be over 400 pages, but it sure didn't feel like a long book. The pages positively flew by! Told in alternating voices, the short chapters revved up the tension and thrills, and fully captured my attention until the book's unforgettable conclusion.Jack Manx has done everything he can to distance himself from a father who was an infamous hit man and a brother currently in prison for armed assault. Straight A's and being varsity crew captain have ensured he can finally leave Las Vegas for college thousands of miles away, somewhere his last name doesn't garner so much recognition. That is, until his brother orders him to track down Nicolette Holland and kill her... or else their mother will pay the price.Nicolette Holland is a social butterfly. Cheerleader, beautiful, wealthy—life was perfect until the night a brutal murder occurred in the woods near her home in Ohio. And now she needs to disappear. On the run and evading detection, Nicolette is scared, alone, and carrying some very dark secrets. It's unclear what happened that night, if she's innocent or guilty, but that's what made How to Disappear such an absolute blast to read!The stakes are high... but Nicolette and Jack's attraction to each other is even hotter. Their relationship is so twisted and messed up, which made me love the book even more! Jack is caught in the middle, wishing to protect his mother and not wanting to hurt anyone, yet feeling pressured by his brother's threats. He can't stop the lust that draws him ever closer to Nicolette when they finally meet, but at the same time, he's unsure if she really did murder a girl he once knew as a child like his brother said.As for Nicolette... well, she's a total wildcard. She's savvy enough to fall off the grid and survive for weeks on her own, but she's also impulsive and naturally an extrovert. Being alone without human contact is hard for Nicolette. And that means she makes mistakes, which is how Jack eventually catches up to her. We begin to see Nicolette more in her element, with a spitfire personality that attracts Jack like a magnet.The ending! THE ENDING. I might've smiled with manic glee. It was just so perfect. All along, Ann Redisch Stampler had been carefully leading us on a path that just gets crazier and more dramatic, and the conclusion was so on point. Kind of ridiculous, but oh so entertaining, just like much of the book. I wouldn't have wanted it any other way. I absolutely loved How to Disappear! ** I received an ARC from the author in exchange for an honest review. **"}, {"userName": "Sofii♡ (A Book. A Thought.)", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/50405799-sofii-a-book-a-thought", "userReview": "I received this copy from the publisher via NetGalley in exchange for an honest review.I really enjoyed this book, has the potential to be a beloved book by readers.The writing is very good, I loved especially the double POVs when the story unfolds It kept me interesting through the pages , but has not finished convince me, I think my main problem was with the character of Nicolette, I guess we do not get along.The end has not really convinced me, but still still think it's a very interesting read, and as I say, not swayed by a review before reading a book, that is, are personal ideas and thoughts that can give you ideas that reading will be, although this can't convinced me , many people end for enjoying it.My points are mainly for the incredible writing that the book has and the plot is very interesting :)"}, {"userName": "Marissa Kennerson", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/14852632-marissa-kennerson", "userReview": "Ann Redisch Stampler has recently made her mark as one of my favorite authors. Her books are like the best bubble gum gloss with a barbed violence coursing just beneath (and at times right on) the surface. She is so talented! She'll draw you right in and not let you go until the end.Such was the case with How To Disappear. A total wild ride as we follow Nicolette and Jackson as they zig zag across the U.S. and across vast psychological territory. It's fast-paced, hard hitting, sexy and a a lot of fun. Be sure to read Afterparty as well - one of the best y/a books about a toxic friendship out there!"}, {"userName": "Michelle ", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/4253940-michelle", "userReview": "**You can see this full review and more at Book Briefs: https://bookbriefs.net**How to Disappear is a fast paced, murder mystery novel long chase that is sure to keep you on the edge of your seat. I loved this young adult book by Ann Redisch Stampler. It was really a riveting read, and please know that I don't say that lightly. Normally I am much more critical on my mystery and suspense books, especially in the young adult age group. They are not a sub genre that I read very often, but How to Disappear is a really great mystery, suspense and even romance.I loved that How to Disappear is told in dual narrative from two teens on the run. One reluctantly chasing and one very earnestly running. I loved that neither one of the characters was completely black or completely white. Both of them were firmly in the shades of grey camp, which made watching their stories unfold and more twists and turns popping up, all the more interesting. I genuinely had no idea which way this was going to turn out and what was going to be revealed. Normally, I am pretty good at reading characters and predicting plots but that was not the case at all in How to Disappear. This book kept me guessing, and seconding guessing over and over again. And I flipping loved that.I think How to Disappear is my favorite of Ann Redisch Stampler's books. It is so well executed. You will feel like you are running in the woods with Nicolette. You will feel conflicted, just like Jack. If you are a nail biter, be sure to coat you nails in that gross tasting stuff that deters biting. Trust me, this book calls for it. If you are a fan of mystery and suspense young adult, How to Disappear is a book that you can't miss out on. The characters will win your heart, and the plot will keep it pumping. I loved how fast paced and unpredictable How to Disappear is. This one is a winner for me. This review was originally posted on Book Briefs"}, {"userName": "Megan Sugg", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/40795165-megan-sugg", "userReview": "Writing one story is hard. Ann Stampler has written two stories in one. Two different characters. Two different voices. Two different perspectives. Interwoven in one story. The talent it takes to write one story in two views, written in such a way that the scenes, the story, is not repetitive, but each perspective falls into place to carry the story forward perfectly. Ann Stampler had pulled it off.As a writer, I am so impressed with the poetic structure that the different views brings to the novel. As a reader, I am impressed with Stampler’s ability to emerse a reader into the story. I was not just in Nicolette’s head, I was Nicolette. I felt her fears, her loneliness, her dangerous desire to trust anyone. I was not just in Jack’s head, I was Jack. I felt how close he was to escaping the family business of hunting things.I love the way the reader gets to know the characters in How to Disappear. I love the way information is revealed little bits at a time. I love that Ann Stampler parallels How to Disappear with other classic works of literature. I LOVED the ending that wraps up the story in a way that is perfect – some might read How to Disappear as a tragedy, and in a way, it is; others might read the hope in what is left unsaid. I read it as both.Visit iFandomsCollide.com for my full review!"}, {"userName": "Jessica Figueroa", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/5645492-jessica-figueroa", "userReview": "Nicolette stumbled on a murder and did the only thing she thought she could do - disappear. Now shes on the run and got a tail on her. Jack is a pretty decent guy, but its not like he can totally ignore the fact that his father is a notorious hitman and now his brother is leaving him in a situation he can't refuse. Either he finishes off Nicolette or his mother will be harmed. Its not the life he would've chosen but now he has no choice.I really enjoyed this book it was mysterious and fun. I loved with each reveal I was finding my self sucked deeper into this book wondering what was going to happen next. I loved the connection between the two and how dangerous that can make the whole situation they are in. I thought it was interesting getting to know Nicolette's background as well as Jack. It was hard not to feel bag for the guy and wonder how everything was going to play out. Overall a really great story I really enjoyed it."}, {"userName": "Snow", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/8699049-snow", "userReview": "Rating: 2.5 Full review will be posted in a few hours here : https://thesnowbookhollow.wordpress.c...I'm going to try and write a review here without spoiling anything. Not that there is much to spoil...Okay, so I'm going to explain why I did not like this novel but before I do that let me just say that I do believe that this might become a favourite amongst YA fans. It has all the elements to theoretically make this novel the perfect YA thriller. Romance, action, humour and suspense. However, I Snow, am a massive fan of mystery and thriller and maybe it's because I've read so many great thrillers that this book did not tickle my taste buds. Let us stop diddly-daddling the review will commence now.So basically it’s about a girl Cat, I mean Nick I mean Nicolette who is running away when a murder is committed in her town and about a guy James, I mean J, I mean Jack. Who needs to find her soon. My initial interest was that this was going to be a cat and mouse type of plot. The one trying to outsmart the other you know Sherlock VS Moriarty, Scar VS Mufasa. That was not what happened. It was more a Spongebob VS Patrick kind of vibe. Jolly enough character but not the sharpest tools in the shed.I initially really liked Jack Manx. Jack has always been judged because he has the surname of a man who used to be the biggest criminal around. Jack is not a criminal he just wants to quote poetry especially Robert Frost. His brother drags him into this business when the ones he loves is threatened. That is how this very smart 18-year-old goes on this not so smart adventure. What I liked in the beginning, was how awkward Jack and Nicolette both were. Here are these two normal teenagers, one who has to disappear and one who has to find the one who has to disappear. I kind of imagine that this is how I would be if for any reason ever I had to go on a mission. Just very awkward and not knowing how or what to do.I feel that the characters were weak. They didn’t have a real drive in them. At best Nicolette was just confusing. She would have this hell bent attitude on surviving then the first guy who winks at her has her in a puddle of jelly? I don’t like it when characters fall in love immediately. I will refer to this one as a takeaway romance. \"Ya want extra cheese with that line?\"At first, it was like walking on a chilly road not knowing what to expect and there was this element of danger which I liked but all too soon the snow melted and the landscape turned out to be a field. The most exciting thing was maybe passing the occasional cow chowing on some grass.For me, the most interesting and put together character was Liv I mean Oliva.Overall this was not my favourite book."}, {"userName": "Serenity", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/5117604-serenity", "userReview": "I'm so excited that I got another book by Ann! She has this writing thing down!Anywho.... It's time to disappear. After all, its what you do after you witnessed a murder and then have someone coming after you. Or maybe she committed the murder? Nicolette isn't the type of girl to go around killing anyone, so it looks like shes on the run from seeing someone being killed. And there is a boy trying to find and kill her. So how did she go from being the girl everyone liked and having a good life, to being on the run for her life?Well the murder happened near her house, so she was kind of caught in the middle. Now she needs to hide, after all a hit man is not really known for being nice and letting a witness run free. So thats where Jack comes in. He's a really good kid, despite his family doing some horrible things. He is so close to finishing school and leaving this family behind him. But next thing you know, his brother drags him in. He must get to Nicolette or else. Well things just got more interesting, fast paced and glued to your seat intensity. Yup, these two are so much fun to read about. They try so hard to outsmart the other and stay one step ahead to stay alive. But these two, you just can't deny how great they are together. Even though they really shouldn't be due to whats going on. But heck, they can both be on the run and have this crazy fun life together. But who know how it will all go.... (:I just love love loved this book! Ugh the feels were strong on this book. To the point where I just have to find someone and spill the entire book. Yup, I need more from Ann now, I love her writing."}, {"userName": "John Clark", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/3537117-john-clark", "userReview": "Both Nicolette Holland and Jack Manx have serious parental baggage in form of family crime connections. Her mom died not long after marrying her stepdad who has treated her like a real daughter. Now sixteen, she's popular and a good student at her Ohio high school. Jack is also an honor student at a private school in Nevada. His father is dead and his mom is an environmental lawyer. His father was pretty abusive before he was killed by other gangsters. Don, Jack's older brother, is in prison and is as unlikable as Jack is popular and well liked.\tNeither teen is aware of the other until Nicolette sees something happen in the woods by her house one night and has to flee for her life. When Jack is forced into going after her after being threatened by his brother, it's the beginning of an impossible to ignore chase, one that starts with Jack tracking her down, then forming an edgy coexistence, all leading to a slam-bang ending with a really crafty twist.\tYes, there's strong language, a sex scene (well done methinks) and violence, but when you're fearful for your life what else would one expect. This is a very well-crafted story with lots of tension and very appealing main characters and will be a good addition for public libraries."}, {"userName": "Lisa Dess", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/5352536-lisa-dess", "userReview": "I received an advanced reading copy from the publisher/author in exchange for a review. Nicolette has had some difficulties in her life and has made some choices she has consequences she has to face. Some consequences are too much though. Jack is struggling to separate himself from his family's name. Their paths get forced together and each of them are hiding their true selves. Throughout it all, each of them are tested.I enjoyed this book. Both Nicolette and Jack are relatable characters who were easy to connect with. The two of them really balanced each other out. I could understand why Nicolette took off in the beginning and felt she had to hide out. I also understood why Jack agreed to do what Don told him to. When more information came out about what really happened that led Nicolette to take off I was stunned. Didn't see it coming. Just like the last few pages, didn't see that either. Nicolette is definitely a smart badass. The pacing was good. I really enjoyed having both, Nicolette and Jack's perspectives. Each of their perspectives had a distinct tone which related to each character."}, {"userName": "Stacee", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "3.5 starsI really liked the premise of this and I'm a sucker for dual POV, so I was fairly eager to get to it. Nicolette and Jack are interesting MCs. They both have slightly sarcastic inner monologues, so by the time they start interacting, it's kind of a snark fest. The pacing of the book is pretty fast, but it still seemed a bit long and drawn out. I liked how everything went down and the surprises that I didn't see coming. I would have liked an epilogue or a sneak peak into the future, but I also thought the ending was fitting. Overall, it kept me interesting and turning the pages. **Huge thanks to Simon Pulse and Edelweiss for providing the arc in exchange for an honest review**"}, {"userName": "Jen La Duca", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/13206527-jen-la-duca", "userReview": "Nicolette Holland is a high school cheerleader who’s a popular and likable girl. She certainly never expected to find herself on the run. When a girl is found dead in the woods near her house, Nicolette must do exactly what she never expected. She changes her appearance and her identity then survives by taking any temporary jobs she can find. Nicolette must constantly move from place to place, she must not be found and she must always hide.Jack Manx is doing his very damn best to not get dragged into the family business and to stay out of his father’s shadow. He’s a great student who gets consistent As in school and generally just wants to stay out of trouble. But when his brother, Don, gives him the unfortunate task of tracking down the girl who killed a friend of theirs he finds he really has no choice. The criminals that Don is working for fear this girl knows too much. If he doesn’t do what they want then his family will be in danger. Jack doesn’t want any part of this but when his family is threatened, what alternative does he have?How to Disappear is the first book I’ve read by Ann Redisch Stampler and I gotta say, I loved it! When I read thrillers, I don’t typically like them to be written in dual POVs. I like to get completely absorbed into the mind of either the victim or the bad guy. I found myself equally engrossed with both Jack and Nicolette and was surprised by how well the dual perspectives worked. The story wouldn’t have been the same nor worked as well without having both Nicolette & Jack’s side of the story. The chapters are short and alternating which made this a very fast-paced thriller. Stampler also has a wonderful, seamless writing style that I love to get swept away in.This story is so well plotted that I honestly never saw the ending coming! Once I got to the end I realized there were so many clues that I missed along the way. This happens sometimes when I get so into a book that I’m reading at super speed. I’m not complaining though, I love it when books pull the rug out from under me right at the end. Stampler certainly did that to me here! I really thought I understood where this story was going. I thought I knew what each character’s motivations were, the reasons they each did what they did. Then I got to the epilogue and was like WHAT?!?!...my entire perspective changed and I just had to sit back and smile.How to Disappear is a wild ride that’s full of murder, secrets, romance, lies and so many twists and turns. I would absolutely recommend this one to anyone who loves YA thrillers with a side of romance, this one’s fantastic!A huge thank you to the publishers, Simon Pulse, and Rockstar Book Tours for putting together this amazing blog tour and for providing me with a complimentary, advance copy of this book in exchange for my honest review! \nAuthor Interview\n\n\n    \n      1) What inspired you to write How to Disappear and was any research needed before crossing over into the genre of young adult thrillers?\n    \n  \nI love reading thrillers – especially dark, noirish thrillers – and I’d always wanted to write one.  I wanted a thriller with characters who were so vivid and quirky that the reader felt their peril, failures and triumphs. And I didn’t want the reader to see what was coming, even though all the signs were right there.  That’s what I was trying to accomplish with How to Disappear.As for the research required to cross over, I suspect that the research I did had more to do with the demands of this specific story than for the genre in general.  For example, I ended up researching criminal law for a couple of states; guns and gunshot wounds; geography; tracking computer and phone locations; and hacking.\n\n      2)If you could spend the day with one of your characters from How to Disappear, who would it be and what would you do or talk about?\n    \nAs much as I love Cat, I think I’d spend a day with Jack talking about his take on the events that followed the murder in the woods.  The book left him at a particular place in terms of what he knew and understood; I’d like to explore whether his thoughts about what happened had changed, and about where his relationship with Cat was heading.\n3)If you could pick just one song or album that represents this book, what would it be and why? \nDifferent kinds of music, and especially songs that move me, tend to hijack atmosphere for me and makes me feel a certain way.  In a good way.  But when I’m writing, especially with first drafts, I tend to look for a silent environment so the words can create the atmosphere completely – so the feel of the music doesn’t end up soaking the pages.  When I write in a coffee shop, I want one with background music that doesn’t have a lot of emotional pull for me and that I can tune out completely, or the music rather than the story end ups creating the mood.\n4)Who were your favorite authors growing up and how have they influenced your writing today? \nToo many to list.   And I think that being a person who read widely influenced my writing more than one particular beloved writer did.  Because reading widely gave me a sense of what you could do with language, how you could use and shape it, and of the many, many different ways to tell stories effectively.\n5)What is one published book that you wish you’d been the one to write and why?\nPride and Prejudice became my favorite book when I was in my early teens and has continued to hold my affections for decades.   I want to hang out with the characters, and while I read (and re-re-re-read), it feels as if I am hanging out with them.  That quality of being able to absorb the reader completely while remaining so amusing and so arch just slays me.  And yeah, I want to do that.\n6)What are your thoughts about the current trends in the YA book market? What would you like to see more of?\nOne thing we’ve all been talking about and thinking about is diversity in its myriad manifestations.  I think I’m among the great majority of YA writers in hoping to see more openness to books that explore the very different backgrounds, experiences, and lives of our YA readership without any punches pulled.  Along with YA writers and editors who reflect the breadth of our culture.   We need to be aware that the craziness of non-white characters showing up on book covers in white-face, or without racial characteristics, and of writers being asked to delete or alter LGBT characters for no apparent (acceptable) reason is not a piece of historical trivia; it’s current.  But I love the fact that there’s progress, that once-taboo subjects are no longer taboo, and that there’s an ongoing conversation.*I love this response and couldn't agree more!! \nGiveaway!!!\nONE (1) winner will receive a $50.00 gift certificate for Booklocker, signed HOW TO DISAPPEAR bookmarks + a Nicolette’s disguise inspired Smashbox make-up kit. (Open Internationally!)\nContest Ends July 2, 2016\n\na Rafflecopter giveaway\n\n\nSave\n  Save\n  Save\n  Save\n  Save\n  Save\n  Save\n  This review was originally posted on My So-Called Book Reviews"}, {"userName": "angelette", "userReviewDate": "Apr 15, 2015", "userURL": "http://www.goodreads.com/user/show/5218231-angelette", "userReview": "Something terrible happened in the woods with Nicolette, so she has to run away from home. The once popular high school girl is forced to change her identity and take on any temporary job she can, jumping from place to place, so she cannot be found.Jack can’t escape his criminal father’s shadow, that’s one of the reasons why he always wants to be on the good side of the law. His brother, Don, on the other hand, is in prison and gives a grim task to Jack: He has to make Nicolette Holland - the girl who killed a friend of theirs, Connie – disappear, because the criminals Don is working for fear that the girl knows too much. Though Jack isn’t rushing to accept this deal, he’s forced to, when the mafia sets their house on fire, threatening his mother’s life.Stampler’s books have a special place in my heart: I love her writing style and the themes she chooses, so I was excited when the author reached out to me to ask if I wanted an ARC of her latest novel. Though it’s a thriller, Stampler’s writing strength, namely the characterization, shines here as well, the characters and their backgrounds are the main strength of this book, which is highlighted by the alternating POVs, so we can know both Nicolette and Jack’s side of the story.Nicolette’s plotline reminded me of the second season of Prison Break (maybe because I was marathoning the series at the first time while reading this book) – she has to run from one place to another, haunted by her (rather justified) paranoia. I enjoyed reading about an average, yet street smart girl’s survival on the run, and I liked her resourcefulness. Nicolette lost her mother at a young age, and she lived with her step father, so her voice had a bitter/sad tone to it, and though we don’t see what happened with Nicolette or what she did (murdered someone in coldblood, maybe?) at the beginning of the book, I still found myself rooting for her and I could easily symphatize with her. Her character’s main theme is what people are capable of for survival; we see her answering ethical questions most people don’t have to, for example, if she were hungry enough would she steal or lie, would she hold a gun on or shoot someone, if her life was on the line.Jack doesn’t have an easy family background either: his father not only was a part of the organized crime scene, but he abused and manipulated Jack and their family. While Don ended up in prison and continued in the steps of their father, Jack tries to be the antithesis of him, but as the story progresses he has to face with the question how our genetics affects what we could become – when he starts to develop feelings for Nicolette, he starts to fear that he’s more like his mother, who tolerated their father’s horrible deeds. Jack’s reflections, self-realization and the theme about how our parents define us and our lives are all add up to an interesting read.Due to the short, alternating POV chapters the story is fast-paced, which I liked, even if the two main characters don’t meet until the first third of the book. The only thing I disliked is that I couldn’t wait for the cat and mouse games mentioned by the blurb, because I love these kinds of dynamic – all the secret identities and frenemy feels -, but sadly, it was rather hit and miss for me. Nicolette is understandably starved for affection and wonders a lot about whether she’s still truly living if she can’t be herself and has to be alone, so I could roll with her falling for Jack rather quickly. But still… their chemistry just didn’t click with me, and I couldn’t fathom why Jack would want to sleep with a girl, who killed one of his friends. It could have been just lust or some sudden and overwhelming attraction, but in the end it just wasn’t for me.Though the book lost one star from me because of its romance plotline, I rather enjoyed this novel and its message: When do people snap and what makes someone capable of violence or even murder. The traits of two main characters toyed with these questions perfectly: Jack, who has violence in his blood due to his family and yet he’s rather incapable of hurting anyone, and then we have Nicolette, who’s at first sight couldn’t hurt a fly and yet she’s rather prone to violence if survival is the goal. And it begs the questions: Do we have a right to defend ourselves in a violent way? Is there a situation when the right reaction is violence? This is even highlighted by the parallel/differences between Jack’s father and Nicolette's aggressive acts.The end of the book compensated the rather slow and dragging middle, because though I had an idea what happened with Nicolette, the mystery and the info withholding wasn’t forced or annoying (and it’s a pet peeve of mine). And, I can only praise the conclusion, the ending lines have a big impact and I could see the whole story in a different light, and I had to wonder how much of the story was true, and what kinds of lies one of the narrators told me.How to Disappear is an engaging teen thriller, which asks questions about human nature and our capability of violence and what it means to survive.An ARC was provided by the publisher and the author in exchange for an honest review.P. S.: The reference to Hungary absolutely made my day. ♥"}, {"userName": "Paula  Phillips", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/1969584-paula-phillips", "userReview": "If you love teen suspense novels with assassins and on the run teens , then you will love How to Disappear and the amazing thing that surprised me to was that you get so engrossed into the book and with its fast-paced that you fly through the book even though it is over 400 pages long. Often with books this long, the story can get quite boring and repetitive or you start to feel daunted by the size of the book but not with How to Disappear. What got me, was the idea of this story as I have always been a big fan of the romantic suspense novels and witness protection stories like Ashley Elston's The Rules for Disappearing series. In How to Disappear , a girl called Connie has been killed and had her throat cut , Nicolette witnessed the crime occurring and overheard how she is next and so she does the only thing she can think of - she runs and tries to stay one step ahead of the bad guys. Jackson Manx has grown up with a name that is synonymous with crime and assassins as his father Art Manx was one of the best and now his brother Donny is sitting in Prison. His brother Don asks Jack for a favor, he must kill Nicolette before she talks otherwise it is their mother's life on the line. For the sake of his mother, he reluctantly agrees as if she really killed Connie, then she deserves to pay. As the story goes along, Nicolette goes through a handful of IDs and Jack catches up with her. Though when Jack meets up with her, he starts to believe that the story is a lie as she is definitely not the killing sort of girl. He plans to make her disappear instead but what will happen when she discovers the truth of why he is really following and hanging around her and demands that the right thing must be done? Find out in How to Disappear by Ann Redisch Stampler, a fast-paced Mystery YA Thriller that will have you sitting on the edge of your seats as you fly through the pages."}, {"userName": "Rachel", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/298806-rachel", "userReview": "Ann Redisch Stampler immediately pulls you into her story with the prologue. It lets you know right from the start that something bad has happened. It just doesn’t reveal all that happened, who might be responsible, or how exactly it relates to the characters. It piques your curiosity, grabs hold, and makes you want to keep reading until you know everything.HOW TO DISAPPEAR is a gripping page-turner that is full of surprises, suspense, difficult choices with grave repercussions, unexpected romance, and chilling secrets. It introduces two characters who are seemingly ill-equipped to handle the situations they find themselves in, but are more complex and capable than they might appear on first glance.Being forced to hide their true identities makes their connection all the more intriguing. Not being able to explain their behavior makes for a tension-filled read. Knowing what we know makes things positively nail-biting. And discovering what we don’t will stun.The story alternates between Nicolette’s and Jack’s point of view, giving just a bit more insight about one than the other, teasing just enough to become invested in each of their outcomes, but not so much that you’ll feel you can completely trust either one. Jack and Nick are both very different, both flawed, both damaged, both volatile, and a rather unlikely and unfortunate but interesting pair. And they are very much worth getting to know.HOW TO DISAPPEAR does not rush to the payoff at the story’s end. It keeps you in a state of anticipation. It keeps you guessing. But it promises to be well worth the wait. Author Ann Redisch Stampler has penned a story that is exciting, shocking and unsettling. It will make you rethink everything you thought you knew. It will make you root for someone and some things you never thought you’d root for. It will keep you captivated until the very last page."}, {"userName": "Marissa DeCuir", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/2967349-marissa-decuir", "userReview": "You know when people say they like a book so much they couldn't put it down? OK, well, literally couldn't put this one down. Read it in on sitting, and I think my eyes may have fallen out of my head from staring at the computer for so long (read an early electronic copy).So thank you Ann Stampler for giving me computer vision syndrome :)Ann Stampler has written a brilliant, fast-paced, high intensity YA Thriller with one of the best endings you should do yourself a favor of experiencing.The book is told through both Nicolette and Jack's view, and boy does Stampler let you into their minds. Their cross-country chase is not just exciting as a read but also explores the incredible complexity of trust."}, {"userName": "Danika", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/17571042-danika", "userReview": "I loved this book so much, I read it in one sitting! I feel like I can read it again and again which is rare for me. It’s so good the plot and the characters were amazing! I was hooked from the beginning and couldn’t put it down. This is a must read I think everyone should go out and buy it and read it especially if you’re a fan of thrillers and mysteries!!!Read full review here: http://goo.gl/mnYAio"}, {"userName": "carolina ☾", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/23231718-carolina", "userReview": "The premise made this book sound much better than it is. If you were expeting by the title to learn anything about how erase yourself completly of the lives of the people you love the most, you'll only learn how to fail at it."}, {"userName": "Angelle Barbazon", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/43008764-angelle-barbazon", "userReview": "I've been SO excited for Ann Redisch Stampler to release a new book, and here it is! \"How to Disappear\" is breathtakingly brilliant and I-N-T-E-N-S-E-! This is a beautifully written YA thriller, and I can't wait to see what the rest of her fans think!"}, {"userName": "Dahlia", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/4688700-dahlia", "userReview": "Well. Holy shit."}, {"userName": "Natalie", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/74604-natalie", "userReview": "Review to come. But: my heart is still pounding."}, {"userName": "Louisa", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/2618194-louisa", "userReview": "Such a great book, loved these characters, the mysteries, and all those twists, and takes on the same story, and how little changes and unknown details changed ideas of what really happened!"}, {"userName": "Caroline", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/48164689-caroline", "userReview": "Great thriller! First YA thriller I've read and I was pleasantly surprised how intrigued I was by this book...would definitely recommend!"}], "description": "This electric cross-country thriller follows the game of cat and mouse between a girl on the run from a murder she witnessed—or committed?—and the boy who’s sent to kill her.Nicolette Holland is the girl everyone likes. Up for adventure. Loyal to a fault. And she’s pretty sure she can get away with anything...until a young woman is brutally murdered in the woods near Nicolette’s house. Which is why she has to disappear.Jack Manx has always been the stand-up guy with the killer last name. But straight A’s and athletic trophies can’t make people forget that his father was a hit man and his brother is doing time for armed assault. Just when Jack is about to graduate from his Las Vegas high school and head east for college, his brother pulls him into the family business with inescapable instructions: find this ruthless Nicolette Holland and get rid of her. Or else Jack and everyone he loves will pay the price.As Nicolette and Jack race to outsmart each other, tensions—and attractions—run high. Told in alternating voices, this tightly plotted mystery and tense love story challenges our assumptions about right and wrong, guilt and innocence, truth and lies.", "title": "How to Disappear", "url": "http://www.goodreads.com/book/show/27206481-how-to-disappear", "average": 3.39, "cover": "https://images.gr-assets.com/books/1450451104l/27206481.jpg", "reviews": 153, "authors": [{"url": "https://www.goodreads.com/author/show/4949584.Ann_Redisch_Stampler", "name": "Ann Redisch Stampler"}], "type": ["Young Adult", "Mystery", "Thriller", "Contemporary", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/27206481-how-to-disappear", "http://www.goodreads.com/book/show/25361907-how-to-disappear", "http://www.goodreads.com/book/show/27221007-how-to-disappear", "http://www.goodreads.com/book/show/11724858-where-it-began", "http://www.goodreads.com/book/show/15751652-afterparty", "http://www.goodreads.com/book/show/8438622-the-rooster-prince-of-breslov", "http://www.goodreads.com/book/show/12420445-the-wooden-sword", "http://www.goodreads.com/book/show/16190362-the-cats-on-ben-yehuda-street", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}