{"ratings": 4208, "userreviews": [{"userName": "Deanna ", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "“When you don’t know what to do for yourself, do something for somebody else”\nSometimes a book comes along that makes my heart skip a beat. This is one of those times. I may not have come across this novel but a friend had just finished reading it and loved it. She thought I might enjoy it too.She was right. I loved it!Margaret Jacobsen has worked hard all of her life and things are starting to pay off. She’s dating an awesome guy, she’s going to be starting a great new job, and on a night out with her boyfriend, Chip, she has a strong feeling that things are about to get even better.We’ve all heard that saying that life can change in a moment, or the blink of an eye. And for Margaret, nothing could be truer when the greatest day of her life quickly turns into the worst day of her life. Her life is forever changed.\n “They say your life flashes before your eyes, but it wasn’t my life as I’d lived it that I saw. It was the life I’d been waiting for. The one I’d never get a chance to live.”\n“How to Walk Away” really was a fantastic read populated with so many awesome characters. Some good guys…some villains…but all well-developed and entertaining! Margaret is such a great character. Her personality won me over instantly. Her habit of filling the quiet with very strange but hilarious comments was just one of the things I loved about her.Heart-breaking one moment and laugh out loud funny the next (\n“Mes jambons sont eclatés” ). \nThis was an incredibly inspiring read that made me look at a few things in my own life in a different way.Katherine Center writes with honesty and includes all of the messy parts. For me this was more than just a good story….it was fantastic! Strained relationships and family secrets, many things were easy to relate to. A story about strength, determination, love and so much more. The plot held my interest from start to finish and the characters captured my heart. I may have been able to see where things were going but the journey was just so much fun. Witty, loving, and optimistic, I started reading slower because I didn’t want it to end.\n “Carry the sorrow when we have to, and absolutely savor the joy when we can” \nI’m looking forward to reading whatever comes next from Katherine Center. She has written five other novels about love and family. You can bet I’ll be checking out those books out too.I'd like to thank St. Martin’s Press for giving me the opportunity to read this book in exchange for my honest review."}, {"userName": "Melissa", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/9684061-melissa", "userReview": "*2.5 stars*Quotes alluding to a charming, witty and heartbreaking read from some of the heavy-hitters in the women’s fiction genre made picking up How to Walk Away a no-brainer for this reader. Finding the strength and tenacity to overcome a tragedy, along with a budding romance . . . how could this bleeding heart not love this book? Believe me, I tried. I really did. The approach Katherine Center takes in telling Margaret’s story of perseverance is what I feel differentiates this book from so many others, but it also makes it sort of contradictory in tone. Margaret is a twenty-something on the brink of having everything she ever wanted and through no fault of her own, loses it all in one fell swoop. It’s quite devastating actually. Yet, the author opts for a fluff-fest, laden with self-help lines and a saccharine tone to brighten the mood. It was a bit much, even for this optimist. I’m guessing here, but I think the overly-positive approach to the topic driving this plot will divide readers. There will be those that undoubtedly appreciate the lightness the author brings to such heavy subject matter and there will be others—like myself—that struggle to connect emotionally and yearn for something deeper, more meaningful and authentic.Piecing together what happens after the major plot point is revealed is pretty simple, so I’m not going to dissect things here, but I will say Margaret’s new reality lacked some credibility. Not only were there inconsistencies surrounding her condition that seemed to take shape depending on the situation she found herself in, but the absence of any questioning on her part—especially in the beginning—felt off. It’s not a far stretch to think anyone in her situation would demand answers, immediately. What I found to be even more inauthentic was the dialogue, behavior and non-stop drama brought on by the secondary characters. They were not an easy bunch for me to like or even understand. The author relied heavily on their exaggerated antics to carry the story forward, which only served to highlight how weak the heart of the plot truly was. Compounded by the predictability, the author’s ease in glossing over pivotal points, the number of coincidences and that ending . . . do I even have to say it? How to Walk Away has not landed among my favorites.*Thank you to St. Martin’s Press for providing me with a review copy."}, {"userName": "Larry H", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "4.5 stars for this one.When you can accurately predict nearly the entire plot of a book, yet you still can't tear yourself away from it—that's when you know you've found a good one.Margaret Jacobsen has always been an overachiever. She worked tirelessly to get good grades and succeed in school. She has been dating her handsome, steadfast boyfriend, Chip, for several years now, and she just landed her dream job, even though she wasn't quite qualified. Everything is leading her up to the moment she's been waiting for—she knows Chip is going to propose and they'll begin their journey to happily ever after.Yet how often does everything turn out just as you've planned it? In a split second, perhaps the most magical moment in her life to date turns into her biggest nightmare, and she's powerless to stop it. The next thing she knows, she wakes up in the hospital, having to face obstacles like she'd never imagined.\"We were the very definition of helpless, and as I realized that, it also hit me that everything I'd been looking forward to was over before it even began. Chip and me—and the lakeside wedding we'd never have, and the rescue beagle we'd never adopt, and the valedictorian babies we'd never make. They say your life flashes before your eyes, but it wasn't my life as I'd lived it that I saw. It was the life I'd been waiting for. The one I'd never get a chance to live.\"Suddenly, the woman for whom everything has worked out perfectly has her whole life turned upside down. Yet at the very moment when all she wants to do is wallow, she has to deal with those around her as well. Chip is drowning in self-pity and wants Margaret to forgive him and give him the easy way out, without an ounce of sacrifice on his part. Her mother has taken on this challenge as she's taken on every other obstacle in life—full steam ahead—and will stop at nothing to make her daughter fight to get every ounce of her life back and believe that is possible. Margaret's sister Kit returns after a three-year absence, and tries to help her with her quirky sense of humor and her unflagging sense of enthusiasm.And then there's Ian, Margaret's physical therapist. The one the hospital staff thinks is too mean for Margaret's wounded psyche. The only PT who doesn't encourage or laugh with his patients, but instead just pushes them harder. The one who seems as if he feels nothing for anyone, except rage for his boss and the situation he's found himself in.Margaret wants some semblance of her life back, but doesn't know what that entails, and she doesn't know how to handle those who purportedly know better than she does. How can she look forward to a life that will never be the same, never be what she had dreamed of? Will she even be able to have the things that \"normal\" people want—love, a family, a job, a future?\"I kept things calm, I stayed pleasant, I took my medicine—but the truth is, I had woken up in a dystopic world, one so different that even all the colors were in a minor key, more like a sour, washed-out old photograph than anything real. It looked that way, and it felt that way, too.\"From the very first pages, \nHow to Walk Away\n drew me in. As soon as I figured out what was happening, I knew where the plot would go, and while at first I was a little frustrated, this book won me over almost immediately. These characters seem familiar yet they are so appealing, even when they're acting selfishly, headstrong, impetuous, or insensitive. It didn't matter that I knew what would happen from start to finish—I cared about these characters and needed to be part of their story.This is a book about finding hope and courage where you think you have none, about how you need to be the person to motivate yourself and buoy yourself through tough times—you can't depend on those around you. It's also the story of how it's always great to have family and supporters and loved ones around, but you have to learn to do things for yourself, too.I'm being a little evasive with the plot even though many reviews explain just what happened to Margaret. I thought it was better to let the story unfold for you, even though you might very well predict it, too. This is tremendously appealing and so winning, that even when you wonder just how likely it would be that certain things would happen, you tell yourself to stop overanalyzing and keep enjoying.A book that tugs at your heartstrings and makes you talk to yourself: how can you ask for anything more? I can see a lot of people really loving this one.NetGalley and St. Martin's Press provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"userName": "Debra", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "3.5 Stars \"Sometimes the last thing you want is the one thing you need.\"At the beginning of the book, Margret Jacobsen was right where she wanted to be in her life. She had earned her MBA, she was about to start a dream job, and was in a relationship with the \"perfect man\". What could be better? Then on day, Chip, the perfect man, decided to take her flying. He knew that she was scared to fly, he knew that she had reservations, but he talked her into it. Never mind that although he is taking private pilot lessons and is so very close to getting his license - he was not a licensed pilot. He took out a plane and up they flew. What was supposed to be a romantic flight where they became engaged, turned into a nightmare. During landing they crashed, and Chip walked away without any injuries while Margret was not so lucky. In the hospital, she learned just how extensive her injuries are. She also learned some family secrets, faces heartbreak, copes with her medical situation and prognosis for her future. Her sister, Kit, who has been estranged form the family for several years, comes back into her life and provides a cushion for Margaret (Maggie) as she copes with her current situation, her parents, Chip, Chip's Mother and her own feelings about her physical injuries. As she struggles with her physical therapy and her attempts to get a smile out of Ian, her physical therapist, we watch as she learns she still has a future, can still enjoy her life, and move on from past hurts.People show you who THEY are in how they treat you. During the course of her hospitalization and recovery, Margaret learns a lot about the people in her life through how they treat her and react to her injuries.A lot of research went into Margaret's medical condition, burns, prognosis and physical therapy options. I did like how she is depicted as having various emotions during her hospital stay when learning of her injuries and her prognosis: shock, fear, hope, determination, worry, acceptance etc. I found that part to be realistic and made the book more enjoyable. She didn't just initially accept things and move on, she needed support which she mainly received form her physical therapist and her sister. Yes, her parents were supportive as well, but I really enjoyed her relationship with her sister and her physical therapist.This was an enjoyable book about moving on, second chances, inner strength, family, acceptance and not giving up.Thank you to St. Martin's Press and NetGalley who provided me with a copy of this book in exchange for an honest review.See more of my reviews at www.openbookpost.com"}, {"userName": "Crumb", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/53025065-crumb", "userReview": "Margaret thinks this is it! Today is the day that she is going to become an engaged woman. And she did! But her whole life got rocked in ways that she could never have foreseen or imagined. Something happened that day that changed every fiber of Margaret's being. On that fateful day.. Margaret lost herself. This is the story of how Margaret found herself. A story of finding Courage, Hope, Resilience, and Strength. This is the story of new beginnings. This is a story of second chances. I felt renewed by this story. I felt a resurgence of energy and hope within me. I don't typically read stories like this and I thought it was particularly refreshing. Everyone needs a palate cleanser once in a while, at least in my opinion. I think the protagonist was brave and personified the type of courage I would hope to possess if faced with a similar situation. This was definitely an easy read that was more character-driven than plot-based. After giving it much thought.. my final rating is a 3.5 rounded up."}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "5 Big Brilliant Beautiful Stars 🌟🌟🌟🌟🌟BEST BOOK of 2018 so far.... WOW! This book had all the feels.... I was absolutely captivated from first page to last... my emotions went on an amazing rollercoaster.... sorrow, anger, hope, elation, frustration, happiness, sadness, love, Hate, and so much more....Margaret was a remarkable and inspiring character... she had a bright future and then tragedy struck and it was all taken away from her.... this book was about Margaret’s struggle and journey to the other side of tragedy... along the way she found out who the true people in her life were....Margaret didn’t always do things how I would have liked, but who am I to judge? I’ve never fortunately been in this situation.... there were also some people in her life that frustrated me quite a bit, and some of the things said were mind blowing.... there were also some people in Margaret’s life that exceeded both her and my expectations.... I realize I’ve been pretty vague.... but I want you to go on this journey without too much information and enjoy it as much as I did.... something beautiful that was touched on in this book is the deeper the sorrow you have felt, the greater the joy you will feel....#TruthStrongly encourage you to read this beautiful book filled with hope and resilience and love.💕*** thank you so much to the publisher and Net Galley for a copy of this brilliant book ***"}, {"userName": "Jennifer Masterson", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "I loved this book so much!!! All the feels! All the Stars! Lots of laugh out loud moments, lots of tears, wonderful characters (her sister Kit and her Instagram was the best!) and smart dialogue! This was probably the best chick lit book I have ever come across (unless Me Before You is chick lit)! It was even inspirational! Margaret is in her late 20’s and has it all! She goes out to celebrate her new dream job, gets engaged to her longtime boyfriend Chip and then something suddenly happens right then and there, her life takes a turn, and all is changed forever! I wanted to say that this was the audio version. If you are looking to try audio, this would make a fantastic first listen! Therese Plummer is an amazing narrator! She makes this novel so easy to follow and so much fun to listen to! Thank you to all my Goodreads friends for putting this book on my radar! Highly highly recommended!!!"}, {"userName": "KAS", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/20691061-kas", "userReview": "THIS! BOOK! I completely fell in love and was glued to every page, every word. Yes, it was unputdownable!The roller coaster ride it takes you on is fascinating and totally captivating!It’s a story of courage. A story of determination and grit! A story of acceptance.It is also a romance, but don’t expect an alpha take charge, sexy, hot between the sheets kind of read. No, this is a heartfelt, hard fought for, humorous kind of love story that warmed my heart and pulled on it’s strings!The main characters are one of a kind, down to earth, and so lovable!And yes, of course, I went in totally blind, as those five star ratings piqued my interest ;)This is my first read by this author and can tell you she is one gifted author."}, {"userName": "Carol (Bookaria)", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/1880531-carol-bookaria", "userReview": "I absolutely loved this novel, it was lighthearted and engaging. Margaret's life is almost perfect. She has a wonderful boyfriend, recently finished her studies and has just (unofficially) landed her dream job. Her life falls apart when she suffers an accident that causes her to end up in the hospital with a life-changing injury and facing difficulties she never imagined. I was captivated from the beginning. The characters are likable, interesting, and made me smile throughout. This is a novel about overcoming obstacles, family relationships, and hope. Overall, I loved this book and recommend it to readers of contemporary fiction. I received an advance copy from the publisher via Netgalley"}, {"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "5 utterly uplifting stars to How to Walk Away! 🌟 🌟 🌟 🌟 🌟 I was gobsmacked by Katherine Center’s previous book, Happiness for Beginners. She almost writes in her own genre. Not too light, not too heavy, elicits just the right amount of emotion, loving characters, and completely uplifting at the end. I found out there is a genre that is exactly this- UpLit. How to Walk Away is another rendition of UpLit. Margaret is in the prime of her life, when it all may have been taken from her in an instant as the result of a tragic accident. Waking up in the hospital, she has choices to make. Just how will she move forward after the devastation she has experienced? Will her life ever go back to normal?I admired Margaret’s journey towards healing. She allowed others to help her. All of the expected and authentic emotions were present when one recovers from a serious accident, and Margaret had the perfect mix of vulnerability and strength. How to Walk Away is a charming, witty, heartbreaking, and affecting story of love and family, and it cheered me up when I needed it most. One of the messages in the book: savor the joy! Thank you to Katherine Center, St. Martin’s Press, and Netgalley for the ARC. How to Walk Away will be released on May 15, 2018!My reviews can also be found on my shiny new blog: www.jennifertarheelreader.com"}, {"userName": "Linda", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "It's the trying that heals you......Perfect days lack perfection when life leaves its oppressing thumbprint. We can spin out of control in a nano second and all that we have come to know is left in shambles in the whirlwind.Margaret Jacobsen knows only too well of the ridges and swirls of that thumbprint. With a freshly earned MBA and a handsome fiance in tow, Margaret reaches new heights. But those starlit heights have taken her on a flight with tragic consequences. Chip wanted the perfect setting high above the clouds when he presented Margaret with his grandmother's ring. That was not in the flight plan and neither were the serious injuries that Margaret would sustain while Chip walked away from the crash unscathed. A question for the doctor.......Katherine Center creates a storyline surrounded, at first, with the robust energy of youth and an open highway of opportunity. Her main character, Margaret, will wake in a hospital bed with a very dreary prognosis. Nurses and therapists refrain from giving Margaret any insight into her condition. They pipe up time and time again: \"Now that's a question for the doctor.\"Although we eye Margaret as our main concern, Katherine Center lines her story with interesting characters including an unpredictable sister, Kitty, that she hasn't seen in three years, and a mother who refuses to address this. Her father sits mostly on the sidelines, but his character will come to the fore when a \"family situation\" comes to the surface. Center weaves other noted characters throughout who may have a great impact on Margaret as she goes through the healing process.I was impressed with the research that Katherine Center must have done in order to address Margaret's injuries. Be aware that it's not all encased in a clinical environment. Center taps mightily into the emotional side as well giving us a fully rounded main character. There is an ease to the flow of her writing style and the humorous dialogue is edgy with the flavor of our own familiar conversations and comebacks. There's a lot of \"human\" going on in this one, folks. And that, I believe, is at the essence of the draw.I received a copy of How to Walk Away through NetGalley for an honest review. My thanks to St. Martin's Press and to Katherine Center for the opportunity."}, {"userName": "Reading.Between.Wines", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/5990485-reading-between-wines", "userReview": "⭐️⭐️⭐️⭐️⭐️ / 5Wow and here I thought the last book I read was emotional! How to Walk Away by Katherine Center made me cry even harder than The Ones We Choose did. However, in this book there is more romance and much more of an \"inspirational story\" vibe. Margaret Jacobsen is 27 years old when she gets on a Cessna prop plane with her boyfriend who is working on getting his pilot's license. She is terrified of flying, but she gets on anyway because she wants to face her fears (plus she thinks her boyfriend Chip is about to propose). This is a choice that will change her life forever.. What follows is the story of how Margaret copes with a life changing injury, and how everyone else reacts as well. This book made me cry like a BABY, and I loved what a strong personality Margaret is. If there is a real Margaret Jacobsen out there I want her to be my best friend because she was such a relatable character, and she was freaking hilarious. How to Walk Away is told entirely from Margaret's point of view, and I wouldn't have wanted it any other way. It felt like your best friend was telling you her life story and it just felt so real to me. This book is all about overcoming a life-changing tragedy. It was such a perfect combination of adversity, romance, and joy that it made it a very emotional but hopeful read. I was also able to read this book in a day which is saying something too!Final Thought: I loved this book and when I got towards the end I wished there wasn't an ending. It is so beautifully written, and I really can't wait to read more from this author knowing how much I loved this novel. I would recommend this book to anyone looking for an inspirational story with a bit of romance and sadness. There is a lot of pain in How to Walk Away, but a lot of hope and happiness as well.How to Walk Away in 3-ish words: Entertaining, Emotional, Conversational"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "4.5 Stars!HOW TO WALK AWAY by KATHERINE CENTER was an extremely uplifting, kind, and heartwarming novel that captured my heart and drew me in almost immediately. There is so much goodness within the pages of this book! This is a story filled with romance, forgiveness, hope, courage, love, and resilience. KATHERINE CENTER delivers a well-written and engaging read here with interesting, honest and believable characters. I absolutely loved the voice of our main character, Margaret “Maggie” she was so strong-willed and at times comical. The witty banter that ensued between the characters was extremely enjoyable and made me smile quite a few times. Maggie’s sister, Kitty was also such a great character and I absolutely loved her resourcefulness and the love and support she showed to Maggie through her recovery. This book was definitely an inspirational, entertaining, enjoyable, and unforgettable story that was a most welcome and refreshing read for me. The ending was bittersweet and very satisfying. This was my first novel that I have read by Katherine Center and it won’t be my last. Would recommend!Publication Date: May 15, 2018Thank you so much to NetGalley, St. Martin's Press, and Katherine Center for the opportunity of reading an advanced copy of this book in exchange for a review!Review written and posted on our themed book blog:Two Sisters Lost In A Coulee Readinghttps://twosisterslostinacoulee.com"}, {"userName": "Kendall ", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "So... funny for some reason I got the idea in my head that this book was about walking away from a break up? Well... not really haha.How to Walk Away was my first read by Katherine Center and I can definitely see why so many readers love her books! How to Walk Away is a very uplifting and powerful story about learning to move on from things that cannot be changed. I remember going through a very tough time in my mid 20's and I bought a journal that had the following quote on each page \"God, grant me the serenity to accept the things I cannot change, Courage to change the things I can, And wisdom to know the difference.\" This book I think goes by this quote very very well. Margaret has the ultimate dream job and her perfect fiance in tow. Unfortunately, this all comes crashing down by a terrible accident which resulted in her fiance Chip taking Margaret flying. Margaret is ultimately paralyzed by the accident and her fiance Chip doesn't even have a scratch on him. Margaret's world as you can imagine is turned upside in a matter of seconds.The story explores Margaret's journey of growth, forgiveness, and healing. Even though the story is focused mainly on Margaret, I enjoyed the dynamics of Margaret's sister, her father, and mother that the author nicely weaves into the plot. And of course we can't forget Ian... who is assigned to be Margaret's physical therapist through her journey of healing. This was a nice change of pace for myself... due to typically reading thrillers. It was a nice fluffy and easy/quick read for sure! I read this along side my lovely traveling sisters. I wasn't over the moon in love with this story because I found some of the story to be pretty unbelievable especially with her injuries. Overall, it was a nice fluffy feel good read.3.5 stars for me :).Thank you to Netgalley and St. Martin's Press for the arc.Published to GR: 4/22/18Publication date: 5/15/18.This was a traveling sister read... please check out their blog! :)"}, {"userName": "Diane S ☔", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "2.5 If you look at the average rating and glowing reviews of this book, you will soon realize I am definitely in the minority with my opinion. Excepting for one friend in the sisters group, everyone else loved it. Fluffy reads, feel good reads, they definitely have a place for many, after a heavy read, or sad read, we all need something to lighten our day. I can't say I didn't enjoy parts of this, I did. Some of the characters were great and I am always drawn to a good looking Scotsman. The author has z natural, easy flowing talent with words.I felt, however, that the jovial tone didn't match some of the tragic happenings in the plot. Even in my lighter reads I need a certain amount of credibility, realism, need things to make sense and I had serious questions about some of the happenings here. For me this went beyond feel good, to over the top, it was just too, too everything.....The ending so beautifully packaged, tied in a big bow. Seriously, whose life follows this pattern? So, yes I may be in the minority, but it's just how I felt. Don't let my review put you off reading this,unless your name is Irene, lol, I am probably just not the right reader for this type of book. ARC from Netgalley."}, {"userName": "Carol", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "COURAGE. HOW TO WALK AWAY is a multi-layered story....with a wham-bang of a start....about the turbulent life of Margaret \"Maggie\" Jacobsen, her darkest fears, disappointments and courage to overcome adversity.Author Katherine Center creates interesting characters....especially a resourceful big sister Kitty and gives our protagonist a strong will and witty voice to keep the reader engaged while the story moves right along.More here than your usual chick-lit fare. Read in a day and REALLY enjoyed it!Many thanks to St. Martin's Press and NetGalley for the ARC COMING MAY 15, 2018, in exchange for an unbiased review."}, {"userName": "Elyse", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Library Overdrive Audiobook narrated by Therese Plummer.“The earth dropped away from us ‘again’”...“Hold on”.Hold on to ‘what’, I was thinking. “They were the very definition of helpless”, Margaret says. Those were the last words before the plane crash.At the start —the audio- narrator was fine. I was engaged & curious to see where this story was going. Soon after the crash - my interest decrease. I felt the dialogue was lacking authenticity big time!!!!Both the writing and the reader were WAY TOO PERKY CHIPPER after a very tragic accident. I couldn’t take this book serious. The only person who didn’t feel like a caricature character was the mother. 2 to 2.5 stars...barley rating up."}, {"userName": "Carrie", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "How to Walk Away by Katherine Center is a contemporary read that while it does have some romance it also was so much more. The exact example of an emotional roller coaster of a novel it will have readers laughing through their tears.Margaret Jacobsen has always been afraid of flying and doesn't want to be anywhere near an airplane but dating a man who is becoming a pilot has him whisking her off to he airport for a romantic getaway. Battling her fears she goes along with the ride only to have Chip propose along the way but then what should have been a beautiful night turns to one of horror.When the weather took a turn for the worse Chip's inexperience as a pilot has the small plane crash landing. After the tragic event Margaret finds herself in the hospital with a back injury, her fiance no where to be found and a very long road of recovery with months of physical training ahead of her.The moment the story begins we meet a young woman with everything ahead of her in life and then see that in the blink of an eye life can change so drastically. The story is one that is tragically heartbreaking while being powerfully inspiring all in the turn of a page. There's humor in the heartbreak and hope in the darkest of places to make this one powerfully compelling read. Such a beautiful book that I do hope readers will give a chance and pick this one up for one emotional ride.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"userName": "Erin", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "Thanks to NetGalley for an advanced ebook in exchange for an honest review.This book isn't hitting the stores until May 15th and so I strongly recommend my fellow reviewers head on over to NetGalley and check it out. How to Walk Away is about a contemporary Texan family that is brought together after a devastating plane crash leaves one of their daughters(Margaret)in critical condition and prompts the return of their prodigal daughter, Kit. Margaret soon realizes that she's facing a life of paralysis which turns her \"perfect \" life upside down.  How to Walk Away is a poignant tale of how we must accept the things we cannot change and find the strength to move on. But don't fear, it isn't all doom and gloom. I found many times that there were humorous moments especially in the narrative style of Margaret's voice. Katherine Center makes her such a memorable character. At times, I wanted to throttle both her mother and fiancee for the way they behaved or what they said, but at least with the former, it was really from a place of love. As for the latter, he definitely is not in my good books. Oh and I loved Ian! Margaret's Scottish PTwas my favorite character in the book, even though we don't get to hear his p.o.v. 4 very powerful stars!"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nI immediately jumped at the chance for an advanced copy of How To Walk Away when a comparison was made to Me Before You - despite knowing the potential outcome of a book that might possibly give me feelings . . . . \nI accepted the challenge. And I’m so happy to report that I stayed strong and did not ruin my eye makeup! It appears not a whole lot is being said about the plot in the blurb, so I’m going to attempt to keep my mouth shut as much as possible as well. I’ll simply say the story here is of Margaret, who gets engaged one minute and finds her life cartwheeling out of control the next. The remainder of the book is what happens during the year following that life-changing moment. The only thing else I can say?????\nWhile there were definitely some easy comparisons to Me Before You that delivered the same types of feelz . . . . . \nIt was the story as a whole and Margaret’s family that pushed me over the edge into 5 Star territory. If you’re looking for a feel good book, How To Walk Away should go to the top of your to-read list this summer.And even though I know anything can be cut and I’m not supposed to post direct quotes, I can’t help but leave this one itsy bitsy lil’ thing right here because it’s perfect . . . . . \n“There are all kinds of happy endings.” \nKatherine Center . . . . \nMany thanks to St. Martin’s Press for believing that even an old curmudgeon like me might feel like smiling every once in a while."}, {"userName": "JanB ", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/260116-janb", "userReview": "How do you move forward when life as you know it ends? Everything you had planned for, hoped for, and dreamed about is over. For Margaret, her life changes in an instant with a devastating accident that leaves her severely injured.The focus of this heartwarming novel is how Margaret copes with the hand she's been dealt. And she has a colorful cast of characters that help her do just that. Some you will loathe, some will frustrate you, and others you will fall in love with. All are interesting, but her sister Kitty stole my heart. I’m paraphrasing, but the ultimate message in the book is you have to live the life you were given, look for reasons to be grateful, work to create them while finding inspiration in the struggle, and pull joy out of hardship. “Because that’s all we can do: carry the sorrow when we have to and absolutely savor the joy when we can. Life is always, always both.” I think the author successfully blended a happy feel-good story with the realities of life not always turning out the way we expect and she does it with humor and a lot of heart. Recommended to readers who enjoy humorous character-driven feel-good novels.*I received a copy of the book from Netgalley in exchange for an honest review *this title will be published May 15, 2018Many thanks to the traveling sisters I read and discussed the book with - you always make the experience of reading a book better. Please visit their blog at:https://twosisterslostinacoulee.com"}, {"userName": "Cindy Burnett", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "How to Walk Away is Katherine Center’s best book yet. She has crafted a beautiful, heartbreaking, and thoroughly romantic novel that is sure to be a hit with everyone who reads it. Soon after the book opens, Margaret Jacobsen’s world changes in an instant, and she must learn to forge ahead while trying to move on from the past. Margaret is tougher than she thinks and with the help of her sister and her physical therapist Ian, she slowly begins to create a new path for herself while learning to adjust to newly discovered family secrets and heartbreak. The story is clever, unpredictable, devastating, and ultimately unforgettable. Center has crafted fabulous, genuine characters that I loved and rooted for (Margaret, Kit, and Ian) and others that I wanted to throttle (Chip and his mother). And most importantly, the ending is outstanding.How to Walk Away is thought-provoking and handles a tough subject effectively and realistically, refusing to sugarcoat Margaret’s predicament which I appreciated. I find it frustrating when an author includes a tough topic only to downplay or gloss over the difficulty of the situation. Moreover, Center has clearly done her research on Margaret’s condition which adds depth and authenticity to the story – I learned so much that I didn’t know. I think my favorite part of the book is Center’s message that people do not always control what happens to them, but they do control how they handle the issues that arise, whether the issues are significant or simply a blip on the screen of life. That message certainly resonates with me and is a good reminder that while certain things cannot be changed, I can alter how I approach responding to those things.How to Walk Away is a fantastic book that I will continue thinking about for a long time. I highly recommend it, and when you sit down to read it have tissues ready. Clear your schedule before you start it, because you will not be able to put it down. I received a copy to read and review. All opinions are my own."}, {"userName": "Jessica", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/9314299-jessica", "userReview": "I received an ARC of this book for free from the publisher (St. Martin’s Press).This book tackles the heavy subject of ending up paralyzed after an airplane crash. When I first started reading this I felt very sad for the main character, Margaret. Her situation was very depressing. But luckily the book didn’t continue down that path. It got pretty uplifting about a 1/3 of the way in. I really enjoyed seeing Margaret’s state of mind change throughout her recovery. It was really inspiring. Often times I stopped and thought about what I would do in her situation. I loved the love interest, Ian. I liked that he did have his faults, which made him feel real. So many times books like these have a “Mr. Perfect” type of love interest, so I was very happy to see that Ian was different. As for the other characters, I really liked Margaret’s sister, Kitty. She was such a fun character. I also really liked that the book was realistic. Like I mentioned previously, Ian felt like a realistic love interest, but besides that, the way Margaret’s condition was handled felt very realistic as well. It could have gone down the “miracle” route, but didn’t. The author did a great job highlighting the reality of Margaret’s injury and did it proper justice. The writing style was also superb. It was written in a very easy-going, conversational manner, which made it a joy to read.Overall, I really enjoyed this book. The realistic characters and realistic portrayal of life in a wheelchair combined with great writing makes this book a hit!"}, {"userName": "Tucker", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/39633342-tucker", "userReview": "I don’t read a lot of what is typically classified as women’s fiction because sometimes the plots can be too formulaic and predictable. But there are authors in that genre who don’t fit into what I realize are probably my unwarranted and stereotypical beliefs about women’s fiction (and based on what I’ve read recently it’s time to change those beliefs!) I’ve read great women’s fiction by Jojo Moyes, Jodi Picoult, Abbi Waxman, and Liane Moriarty. And now I’m adding Katherine Center to that list. “How to Walk Away” was a wonderful story, filled with humor, wisdom, inspiration, great characters, and the reminder that, as one of characters says, “There are all kinds of happy endings.”Thank you to St. Martin’s Press and NetGalley for providing an advance copy of this book .in exchange for my honest review."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "Norma and I started off lost in a coulee with seven of our traveling sisters reading How To Walk Away. This story lead to another interesting and fun discussion amongst us as we dug deep into the layers and meaning to this story. How to Walk Away is an inspirational heartwarming story told by our memorable main character Margaret who experiences a traumatic accident. It is Margaret's story of recovery that focuses on second chances, acceptance and family support and love. Katherine Center does a great job creating likable, interesting well-developed characters and we loved the dynamics between them and their relationships. We all really loved the dynamics between sisters Margaret and Kit and loved the humor and warmth Kit brought to the story. Most of us loved the ending and were left lost in the inspirational, sunny sweet smelling lush coulee feeling so warm and happy with this story while one sister was left standing alone with a little too much sweetness that affected her enjoyment for this story till another sister joined her. We highly recommend for readers who like a lighter, inspiring feel-good story or for a nice change of pace from darker reads.Published May 15, 2018Thank you so much to NetGalley, St. Martin's Press, and Katherine Center or a copy to read and review. Review written and posted on our themed book blog Two Sisters Lost In A Coulee Reading.https://twosisterslostinacoulee.comCoulee: a term applied rather loosely to different landforms, all of which refer to a kind of valley."}, {"userName": "Marialyce", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "3.5 lovely to read starsThere was so many things to like about this tale of a young woman, Margaret, who has everything going for her. Unfortunately life was about to hand her a basket full of lemons. Sometimes when everything seems so very sweet, things can and do turn sour in a heartbeat. For Margaret that moment has come when the sweetness of life becomes a nightmare of tragedy.Magaret Jacobsen has it all, a gorgeous fiance, a soon to be dream job, and a loving family. She is beautiful, successful, and the world as they say is her oyster .What could be better really? The one thing Margaret (Maggie) fears is flying but when her soon to be fiance decides to pop the question while taking her flying, she acquiesces and reluctantly boards the plane. Chip is a new pilot, well almost a pilot but he is confident, he knows what he is doing and he has a plan. Things seem to be going ever so well and then turn and as life often does, and this dream becomes a nightmare. Margaret finds herself in a hospital and as time progresses, she learns the extent of her injuries. It is devastating but her missing for three years sister. Kitty, arrives along with her free spirit nature, and endeavors to help Margaret cope. There is heartbreak in this journey for Maggie, a long road to recovery, a secret within the family , and a person Margaret felt was in a corner deserting her. She is helped by not only family but also the hospital staff. In rehabilitation she to assigned to a therapist, Ian, a Scottish young man who is unfriendly, evasive, and bordering on mean. However, there is something about him that makes Margaret or as he calls her Maggie look to him for guidance and help. The sparks fly between them and one of the very positive things about this novel is the dialogue, attitudes, and feelings, and wit that are displayed by Maggie, Ian, and her sister. They make quite a trio! Her mother, a take charge person, tries to lead and direct, but Maggie's sister, a definite asset in the story,, wants Maggie to take charge of her own life, no matter which way it goes. We all need a sister like Kitty in our lives! She is the spark that ignites Maggie into action and Ian is the man who makes things come together and gives Maggie a reason to push forward. Told with humor and a spirit of I can do, this story is a quick, fun read, one that surely will be a hit. My one criticism for this book which I truly did like is that the medical issues that Maggie went through seemed to be painted in a trivial manner. I know this was suppose to be lighthearted fun story, but at times the suffering, that one could be sure Maggie was going through, was pushed to the background.This was a fun Traveling Sister read and as always we had great discussions on this book."}, {"userName": "Lori", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "An inspirational story that kept getting better and better as the story progressed. I’ve finally gotten a lil settled after moving & am starting to get some regular reading time back. I was glad that I had this novel to sneak a few chapters here and there. I loved Maggie and her attitude throughout. Her voice was honest and believable. The story itself felt real... no prefectly tied bows. ‘You get one life, and it only goes forward. And there really are all kinds of happy endings.’ 5 stars."}, {"userName": "Jennifer Kyle", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/9916227-jennifer-kyle", "userReview": "4.5 Stars!!\"There are all kinds of happy endings.\""}, {"userName": "Jennifer", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "★★★★½Although How to Walk Away is fiction, the moral of the story is very real: \n\n“...you have to live the life you have. You have to find inspiration in the struggle, and pull joy out of the hardship.”\n\n In my opinion, this story reads as if it were a nonfiction memoir. I actually paused to research Katherine Center and her tragic accident only to find that this was fiction. This was my first Katherine Center novel so I hadn't a clue. Ms. Center certainly did her homework though, and according to her acknowledgements, she researched multiple elements of this story by spending time with people who have firsthand experience (even with eating an entire blob of wasabi apparently). In my opinion, Ms. Center took a huge risk writing from the POV of a character struggling so deeply with something she has never physically experienced, while many people may be currently in the midst of it thinking \"easier said than done, lady\", but I think it paid off. Like I said, it felt like a real-life account and I found the overall theme incredibly inspirational and easily transferable to many of life's hardships. With plenty of humor, perspective, inspiration, and a touch of drama and romance, How to Walk Away has earned its rapidly rising attention in my opinion. Check it out!My favorite quote:\"Because that's all we can do: carry the sorrow when we have to, and absolutely savor the joy when we can. Life is always, always both.\""}, {"userName": "Andrea", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/27117435-andrea", "userReview": "Four things.....1. My first 5 star book of the year (and it’s already May), and it’s a romantic comedy?!!! Yep. Because it’s done exceptionally well. Pure fun. Great voice. Witty. Quirky sister-sidekick. Hooray! It checks ALL THE BOXES. 2. I’m literally still swooning over grumpy Scottish Ian. Damn, what a great character. The audiobook narrator was spot on, not only with his accent, but she captured his essence, which was a feat in itself. 3 “You get one life, and it only goes forward. And there really are all kinds of happy endings.”4. I’m so proud of Katherine Center, and I don’t even know her personally!! I’ve read everything she’s written. And although my favorite may just be “The Lost Husband”, each book is better than the next. She SHINES!"}], "description": "From the author of Happiness for Beginners comes an unforgettable love story about finding joy even in the darkest of circumstances.Margaret Jacobsen has a bright future ahead of her: a fiancé she adores, her dream job, and the promise of a picture-perfect life just around the corner. Then, suddenly, on what should have been one of the happiest days of her life, everything she worked for is taken away in one tumultuous moment. In the hospital and forced to face the possibility that nothing will ever be the same again, Margaret must figure out how to move forward on her own terms while facing long-held family secrets, devastating heartbreak, and the idea that love might find her in the last place she would ever expect. How to Walk Away is Katherine Center at her very best: an utterly charming, hopeful, and romantic novel that will capture reader’s hearts with every page.", "title": "How to Walk Away", "url": "https://www.goodreads.com/book/show/36249638.How_to_Walk_Away", "average": 4.25, "cover": "https://images.gr-assets.com/books/1507579931l/36249638.jpg", "reviews": 1258, "authors": [{"url": "https://www.goodreads.com/author/show/409113.Katherine_Center", "name": "Katherine Center"}], "type": ["Romance", "Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/36249638-how-to-walk-away", "http://www.goodreads.com/book/show/36431947-how-to-walk-away", "http://www.goodreads.com/book/show/21853666-happiness-for-beginners", "http://www.goodreads.com/book/show/2481019.Everyone_Is_Beautiful", "http://www.goodreads.com/book/show/15799352-the-lost-husband", "http://www.goodreads.com/book/show/777923.The_Bright_Side_Of_Disaster", "http://www.goodreads.com/book/show/6785581-get-lucky"]}