{"ratings": 363, "userreviews": [{"userName": "Aryeh", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/126223-aryeh", "userReview": "Truthfully, in spite of all the parts of this book I just don't agree with (namely: she's a bit heavy handed with lumping Conservative/Reform/Reconstructionist together, she calls herself a feminist but doesn't show it in her writing except in passive agressive comments here and there, the book is written really to a specific crowd of financially well off East Coast Orthodox Jews), this is in my opinion the best and most accessible 'how-to' book that I've read to date. Greenberg's personal perspective and painstaking description of not only how but also why, coupled with not just how to but how it FEELS to, etc make this one unique. A lot has changed since this book was written, politically and socially. I'd love to see an updated version, but in the mean time, this is one I would recommend (although possibly not to a first time enquirer, more to someone who likes reading things along these lines, as I do.)"}, {"userName": "Ray", "userReviewDate": "Jan 17, 2008", "userURL": "http://www.goodreads.com/user/show/797169-ray", "userReview": "I'm a Presbyterian minister of quarter-Jewish descent with, obviously, a strong interest in Judaism. I'm far from a specialist, so I don't have much to add to the conversation here other than my personal impressions. On the positive side, this book is a good read, highly accessible. It gives a very clear and beautiful window into the Greenbergs' household practices of Judaism. You can almost taste the food, see the candles, etc. But, as some others have noted, having read similar Orthodox sources, I get the strong sense that Greenberg is not representaive of most in that wing of Judaism. She is clearly not only Modern Orthodox, but represents the left-wing of that progressive half of Orthodoxy. She is a strong feminist, for example. And she is also probably not as knowledgable as some rabbinic authors. Also, this is a little dated now, having been written in the 1980s. For a more traditional guide to Orthodox practices and belief try some of the ArtScroll titles, like Rabbi Mord. Katz, Understanding Judaism."}, {"userName": "Vania Melamed", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/4141200-vania-melamed", "userReview": "This book was handed down to me from my mother, and she received it as a wedding gift from her Rebbetzin. Blu Greenberg writes from a female perspective on religious observance, gives you concise explanations of Jewish observances, and is your comic relief. Hide from the kiddies; Blu's pretty candid about the traditional Jewish view of marital relations. Also full of recipes and a guide for young ladies that answers all your embarrassing questions you're too shy to ask a Rav: niddah, yikhud, shalom bayit, mikvah, etc. Blu is so warm and open in this book, you almost want to share some gossip with her."}, {"userName": "Chelsea Wegrzyniak", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/30735932-chelsea-wegrzyniak", "userReview": "I LOVED this book. Blu Greenberg is an incredible writer who clarifies the tiny everyday details of observant life that sometimes get left out by other authors, leaving those of us without a religious upbringing missing important aspects of daily observance. This is by far the most detailed book regarding household observance; I unfortunately think that the promotion of books authored by men tends to crowd out fantastic female scholarship such as this. Greenberg perfectly balances the emotional and personal with the practical, creating a useful, enjoyable and engaging book. Anyone interested in taking on more observance or just learning about traditional Jewish household life ought to have this in their collection."}, {"userName": "Marit", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/1419866-marit", "userReview": "Greenberg's book is written from the perspective of a Modern Orthodox housewife, a unique viewpoint even among practicing Jews. However, her humor, use of personal anecdotes and flexible viewpoints make this book accessible to any person, Jewish or not, practicing or not, Orthodox or not. This book is lengthy because she goes into great detail about Jewish day-to-day life and what it means to live as a Traditional Jew and all the rituals, practices, traditions, etc. that demands. She does not go into much philosophical or religious discussion per se, only as much as is needed to explain the history or meaning behind a certain practice. I found it especially captivating when Greenberg would muse about how the current tradition is changing in her lifetime and will continue to do so (especially with regards to women's roles in Orthodox households). I highly recommend this accessible and informative book."}, {"userName": "Kristin Youngberg", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/63824828-kristin-youngberg", "userReview": "I read this years ago for a college class and I still remember how insightful she was on her thoughts on the Sabbath."}, {"userName": "Siobhán", "userReviewDate": "Jun 05, 2014", "userURL": "http://www.goodreads.com/user/show/11513040-siobh-n", "userReview": "I read this book on Yom Kippur because it seemed the best time to do it, and I do highly recommend that.While the edition I had is from the late 80s and I would definitely like to see it updated as some parts of changed way more than others (I'm not sure if there's a newer one), it was on the whole a fine enough book to read. Some parts I skimmed as they don't apply to me now or I'd never remember all the intricacies of preparing for these holidays by the time they roll about or I simply don't feel an attachment to that item, but I actually found I enjoyed the author's personal narratives interspersed throughout. It felt as if Blu Greenberg was there in the room and we were having a discussion, as when lovely Orthodox Jewish women would explain things to us on Shabbos in college.So while there's parts that don't apply to me or are too traditional for me to be sure I could integrate them meaningfully into my life, if you've an afternoon to kill, this is fast despite it's size. Plus the recipes at the end do look good."}, {"userName": "Jennifer", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/11802857-jennifer", "userReview": "I have certain differences in hashkafa with Mrs. Greenberg, such as whether or not it's permissible for an Orthodox Jew to eat in a non-kosher establishment. She ignores the issue of morris ayan (that someone who's seeing a visibly Orthodox Jew, such as a woman with a sheitel or other \"Jewish type\" haircovering may think that the restaurant is kosher, and eat there. Besides which, in her neighborhood of Riverdale there are plenty of kosher establishments. There are certain heterim when one is out of town or traveling, but those were not mentioned.However, all in all, it's a fairly well-written book, as long as one realizes that it is coming from a left wing part of Orthodoxy. My personal favorite was her description of a little boy describing his tzitis as \"the strings that attach me to Hashem\".For those of you reading this who don't understand some of the above terminology, Google will help you out, as will Aish.com."}, {"userName": "Melissa Yael Winston", "userReviewDate": "Aug 21, 2009", "userURL": "http://www.goodreads.com/user/show/1835423-melissa-yael-winston", "userReview": "An interesting read, dense with information. The problem is, you can never really tell who Greenberg considered her audience to be. On the one hand, her references to holidays, rituals and bits of Hebrew are oblique enough that one must guess she intends her book to be a how-to for the most Observant of Jews, ones who know off hand how much time passes between Pesach and Shavuot and the importance of abstaining from sex when a woman is considered \"niddah.\" On the other hand, many of her tips seemed geared toward new converts to Orthodox Judaism or even those who are simply curious about how the Torah applies to modern life. Her advice is aimed toward those who have not spent their lives absorbed in traditional Jewish culture, but the religion and culture she offers as context are likely to be understood only by those who have."}, {"userName": "Jeff", "userReviewDate": "Oct 18, 2008", "userURL": "http://www.goodreads.com/user/show/1602515-jeff", "userReview": "I'm not Jewish, and even though this book is specifically geared towards Jewish households, it still strengthened my own faith as well as helped me find ways to deepen my level of commitment to living my faith within the walls of my own home. As a Christian (Latter-day Saint), I feel a special kinship and bond with the Jewish people, and Greenberg's descriptions of several of their holidays and other practices helped me understand the history and meaning behind several of our own LDS traditions. A bit long, and some sections are obviously less applicable than others, but this book certainly has a large portion with reading (unless, obviously, you're Jewish, then this would probably be a 4 or 5 star book)."}, {"userName": "Samira", "userReviewDate": "Jun 01, 2007", "userURL": "http://www.goodreads.com/user/show/103226-samira", "userReview": "In the end, I ended up deciding that this book really serves the purpose of a reference book more than it is anything else. It is engagingly written and a good source for modern takes on traditional practice, though far more traditional than I, personally, have any desire to be."}, {"userName": "Nicole", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/700852-nicole", "userReview": "I continue to be very impressed with this book, and find myself coming back to it almost daily since buying it a month ago. It is a wonderful reference tool, and I definitely recommend this to anyone interested in how an Orthodox household is run."}, {"userName": "Christina", "userReviewDate": "Mar 15, 2009", "userURL": "http://www.goodreads.com/user/show/1562083-christina", "userReview": "I read this for a religions class I took at BYU (religion in the home). I loved how this author was able to describe and explain how a jewish home is run in an entertaining and, at time, humorous way. I really enjoyed reading it for the class."}, {"userName": "Andie", "userReviewDate": "Mar 15, 2009", "userURL": "http://www.goodreads.com/user/show/882498-andie", "userReview": "I loved the way that she writes this book. It's almost like she is talking to you, instead of writing a book. Very interesting information as well."}, {"userName": "Stacey", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/9842652-stacey", "userReview": "For an intrigued non-Jew in search of an educational it was, indeed, educational."}, {"userName": "Craig Bolton", "userReviewDate": "Sep 23, 2010", "userURL": "http://www.goodreads.com/user/show/2457780-craig-bolton", "userReview": "How To Run A Traditional Jewish Household by Blu Greenberg (1985)"}, {"userName": "Kristy Ann", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/2990961-kristy-ann", "userReview": "Great reference book."}, {"userName": "Suzi", "userReviewDate": "Oct 17, 2008", "userURL": "http://www.goodreads.com/user/show/1625885-suzi", "userReview": "Fascinating Read!!! It made it tired, but appreciative. I learned so many interesting things."}, {"userName": "Angie", "userReviewDate": "Nov 27, 2008", "userURL": "http://www.goodreads.com/user/show/1495948-angie", "userReview": "Amazing."}, {"userName": "Bruce", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/6752782-bruce", "userReview": "Step one: find a nice Jewish doctah..."}, {"userName": "Jenny", "userReviewDate": "Sep 19, 2008", "userURL": "http://www.goodreads.com/user/show/1537616-jenny", "userReview": "The definitive guide for any Bal Tsuvah or Convert to Judaism. Mrs. Greenberg's guide is easy to read, understand, and enjoy."}, {"userName": "Lisa", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5764605-lisa", "userReview": "I've read this book three times and each time I find more little tidbits that I can apply to my life and find meaningful. I suggest this book to anyone thinking about becoming more religious."}, {"userName": "Sharon", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/28556969-sharon", "userReview": "Love this book. As soon as I get my books back from storage, this will go on my bedside shelf as it is good to dip into."}, {"userName": "Jb17112", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/41504509-jb17112", "userReview": "1.6"}, {"userName": "Kris", "userReviewDate": "Apr 17, 2010", "userURL": "http://www.goodreads.com/user/show/990677-kris", "userReview": "Coming from a non-jewish household, this book was very insightful about the daily and holiday workings of a Modern Orthodox Jewish life. The book brought up many discussions around the dinner table."}, {"userName": "Joyce", "userReviewDate": "Sep 24, 2008", "userURL": "http://www.goodreads.com/user/show/1514907-joyce", "userReview": "This is an incredible resource on Jewish life. My Orthodox Jewish neighbor in London was amazed by it. She said it was very accurate."}, {"userName": "Rachel", "userReviewDate": "Mar 24, 2008", "userURL": "http://www.goodreads.com/user/show/1016370-rachel", "userReview": "Blu Greenberg has a really entertaining writing style, and it's a great book to learn about how Orthodox Jewish families live. Loved it!"}, {"userName": "Lindsay", "userReviewDate": "Apr 02, 2009", "userURL": "http://www.goodreads.com/user/show/999402-lindsay", "userReview": "Good insight into Orthodox Jewish practice."}], "description": "Through a mixture of the contemporary and the traditional, this book makes for a fascinating, personal insight into Judaism. Tens of thousands of copies have found their way into homes and libraries. A very popular selection for prize and presentations. This is the standard work on Judaism and how to live it.", "title": "How to Run a Traditional Jewish Household", "url": "https://www.goodreads.com/book/show/1073987.How_to_Run_a_Traditional_Jewish_Household", "average": 4.22, "cover": "https://images.gr-assets.com/books/1347772409l/1073987.jpg", "reviews": 31, "authors": [{"url": "https://www.goodreads.com/author/show/53404.Blu_Greenberg", "name": "Blu Greenberg"}], "type": ["Religion", "Literature", "Religion", "Nonfiction", "Judaism"], "outlinks": ["http://www.goodreads.com/book/show/1073987.How_to_Run_a_Traditional_Jewish_Household", "http://www.goodreads.com/book/show/93089.How_to_Run_a_Traditional_Jewish_Household", "http://www.goodreads.com/book/show/942714.On_Women_and_Judaism", "http://www.goodreads.com/book/show/1003445.King_Solomon_And_The_Queen_Of_Sheba", "http://www.goodreads.com/book/show/313525.Black_Bread", "http://www.goodreads.com/book/show/37711904-king-solomon-and-the-queen-of-sheba", "http://www.goodreads.com/book/show/26020674-judaism"]}