{"ratings": 13537, "userreviews": [{"userName": "Kalliope", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/3593962-kalliope", "userReview": "[https://www.goodreads.com/user/show/2... (hide spoiler)]"}, {"userName": "Fionnuala", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "How to write a novel about art - everybody’s doing it - without revealing the amount of research that has gone into it. There’s the twist.Research is important in a novel written in the twenty first century but partly set in Renaissance Italy. The author needs to comb the archives but burn her notes after reading. She needs to walk the old town she’s writing about from one end to the other but then she needs to throw the guidebook away and leave with only her impressions, any hard facts should be left in the library. But Ali Smith shows such creativity in every other aspect of this book that I’m going to ignore these niggles, drop them right now. Ouch! That was a lot of facts!But back to creativity. Creativity demands we go beyond what we know, experiment with new ideas, new forms, find new angles to present those new ideas and forms. Creativity demands inventiveness, and the enthusiasm and energy to turn the old on its head and reveal the new, to add an original twist. That twist again. Ali Smith possesses more than her share of inventiveness, and enthusiasm, and energy. This book is unique, in fact there ain’t never been nothing quite like this! There are two distinct halves which could almost stand alone but instead they are linked by a neat twist. Some copies of the book have one half first, some the other. Imagine a sheet of paper with story A at the top of one side and the same story repeated at the bottom. On the reverse side, you have story 1 laid out in the same way. You give the paper a twist in the middle and if you read one side only you get story A and then story 1 but if you turn over you get story 1 first and then story A. The author has written both halves very carefully so that while each touches on the themes of the other, neither steps on the other’s plot line too much. They are like an image and its mirror image, except not quite, as if there’s a little flaw in the mirror’s surface which causes a distortion, a slight twist in the perception of both stories. And perception is very important here. No question of Put your blindfold on. No. You have to keep your eyes wide open right through this book or you might miss a vital twist. Smith is very enthusiastic about her content, almost childishly enthusiastic. Here’s a different dance for you all to do, I imagine her saying to her readers. Spin your body like a screw, and we do because there’s no other way to keep up. The narrative voice is young, breathless almost, but oddly knowing too, old and young at the same time which can be destabilising for the reader - there's that twist again, can't avoid it, it seems.So I guess by now you’ve got the gist better not forget it on your shopping list!The Wilbury Twist"}, {"userName": "Violet wells", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "You could say the muse of this novel is Virginia Woolf’s Orlando. The mischievous, time travelling, gender crossing spirit of history who breaks down boundaries, reconciles opposites, defies death. I read the Francesco narrative first. Francesco is based on the real life painter Francesco del Cossa (who I had never heard of). The fresco which features large in this novel is a stunning piece of oddball invention and even if I’d hated this novel I’d be grateful to Smith for introducing me to it: Ferrara, here I come! Francesco is born a woman (though it’s easy to miss this very important premise and I only caught it by sensing I had missed something and going back to the beginning when I was about fifty pages in). History knows next to nothing about Francesco so Smith (or perhaps George, her other narrator) was able to more or less make him/her up. Which she does with compelling brio and mischief. Though Francesco’s voice can be a bit hit or miss, overly pretentious at times in its stream of consciousness highwire cavortings, at its best it’s definitely for me the most creative achievement in this novel. Smith does something new with language here – nothing revolutionary but she strikes up a deliciously quirky rhythm through Francesco’s voice. The other narrator, George, a girl with a boy’s name, is much more conventionally familiar and therefore safer. Smith uses George to introduce a lot of stock-in trade social satire, which might make you giggle but also might elicit a weary sigh. I’ve also been racking my brains to find Geoege’s twin in literature or cinema because I did have a sense of déjà vu while reading her narrative – an adolescent girl whose mother has just died and is left with an emotionally absent father and a shell-shocked younger brother. Hasn’t she appeared rather brilliantly somewhere else before? “What’s the point of art?” George asks her mother. How to be Both tries to provide various answers to that question. To be honest, I’m not sure I really understood the higher significance of the gender swapping except as a paying of lip service to feminist notions of gender interchangeability. Perhaps Orlando, her muse, led her a bit astray here. George’s sexual ambivalence was fine and subtle; Francesco’s seemed a bit too conveniently forced. Sometimes Smith’s determination to enter into mirrors everywhere was a bit heavy handed for me. Like a teacher lecturing you on how much profundity resides in this passage or those brushstrokes. The novel flows beautifully in parts and it’s usually when Smith is reinforcing her double agent surveillance theme that the flow is interrupted. The most exciting and thought-provoking moments of the novel are when the narratives intersect, when Smith gets the mirrors to smoke. This essentially happens twice and this is when you put most effort into trying to imagine the effect had you read the narratives the other way round. And when you try to answer the question, Are the two alternative versions a stroke of ingenious artistry or little more than a marketing gimmick? I’m glad I read the Francesco narrative first. The other way around and I think the novel would have been more dialectical, more emotionally detached. You’d also probably have the idea that George is inventing Francesco’s biography for her own purposes and this would surely make him less significant and poignant as a character in his/her own right. You’d also be deprived of the revelations that take place in the National Gallery which is a brilliant moment of bringing into focus everything you’ve seen so far. The principal achievement of this novel for me was not its philosophical maze of smoking mirrors but simply the hightide creative energy and the playful joie de vivre with which it’s written. A novel will always be more compelling when the author feels consuming love for her story and characters and manages to convey it. Smith certainly achieves this. I felt this more strongly with Francesco whom Smith clearly adored. George was less original as a voice though probably more accessible as a result."}, {"userName": "Diane", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "This experimental novel is challenging, but if you can give it your attention, it is wondrous.The novel has two parts: One part tells the story of George (full name Georgia), a teenage girl who is trying to cope with the sudden death of her mother. The other part tells the story of Francesco del Cossa, who was a real-life Italian artist during the Renaissance. The two narratives are linked because George and her mother had gone to Italy to see a fresco painted by del Cossa, and it turned out to be George's last trip with her mom. George became interested in the painter's life as a way to remember her mother, and she even researched del Cossa for a school project. This novel is an experiment because half of the books were printed with the story of George first, and the rest were printed with the artist's story first. The writing style in each section is very different; both have stream-of-consciousness prose, and George's teenage thoughts move lightning fast between the present and past memories. The artist's narrative is more poetic and fragmented. The prose is lovely, but it requires more focus.In my printed copy, del Cossa's story came first. However, when I first tried to read the artist's poetic beginning, I wasn't in the right frame of mind and couldn't concentrate on it. I had heard about the trick with the two parts, so I skipped ahead to George's section to read that first, and that is when I fell in love with the book. Truthfully, I wish the entire novel had been from George's perspective. (I think if it had been, this would have been a five-star review.) Poor, clever George. She used to pride herself on her wordplay games with her mom, but she regrets that sarcastic tone she used. Most teenagers don't expect to lose their mothers -- you expect to have time to grow older and apologize for your youthful arrogance. George didn't get that. Instead, she has lots of time with her thoughts and memories.After finishing George's story, I immediately went back to the beginning and read the artist's section, which I appreciated more on the second attempt. The novel has beautiful themes about the role of art in our lives, how we communicate with one another, and the connections between the past and the present, the living and the dead. I would recommend this book to readers who like stream-of-consciousness writing and who appreciate the mingling of poetry and prose.Favorite Passage:[George and her mother are talking about history]\"History is horrible. It is a mound of bodies pressing down into the ground below cities and towns in the unending wars and the famines and the diseases, and all the people starved or done away with or rounded up and shot or tortured and left to die or put up against the walls near castles or stood in front of ditches and shot into them. George is appalled by history, its only redeeming feature being that it tends to be well and truly over ...\"World War One is like a whole hundred years ago next year, George says. You can hardly call it relevant to us any more.\"What, the Great War? in which your great-grandfather, who happened to be my grandfather, was gassed in the trenches not once, but twice? Which meant he and your great-grandmother were very poor, because he was too ill to work and died young? And meant I inherited his weak lungs? Not relevant to us? her mother says. And then the break-up of the Balkans, and the start of the territorial trouble in the Middle East between the Israelis and the Palestinians, and the civil unrest in Ireland, and the shifts of power in Russia, and the power shifts in the Ottoman empire, and the bankruptcy, economic catastrophe and social unrest in Germany, all of which played a huge part in the rise of Fascism and in the bringing about of another war in which, as it happens, your own grandmother and grandfather — who happened to be my mother and father — both fought when they were just two or three years older than you? Not relevant? To us? Her mother shakes her head.\""}, {"userName": "Teresa", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "My dear friend Cathrine is the reason I first read Ali Smith about ten years ago and she is the reason I was able to read this book as quickly as I did. She and Ali Smith will be forever linked in my mind. When she gave me this book, she told me copies of the novel have either one of the two sections first: you get what you get. (Unless of course you go to a bookstore and choose the one you want.) Not surprising to us, I received a copy different than hers: because, you see, we too (two) complement (and, yes, compliment) each other.When I got home from my recent trip, which included my first face-to-face meeting with Cathrine in Norway, she emailed me that she'd heard from others who struggled with the section I had first that flipping to my second section first was 'easier.' Of course, I took that as a challenge, but I need not have worried: the reading of my first section wasn't a (negative) challenge (I wondered if maybe those readers hadn't gotten past the first two pages) and things began to be quickly, though gradually, revealed. In this beginning, I detected a whiff of Joyce's A Portrait of the Artist as a Young Man but really it was all Ali Smith. I loved its language and especially the voice for the artist that Smith conjured up with her magical skills: it was endearing and quite funny. (My colons are in homage to the 15th-century artist, who is both real and imagined.)To be completely honest, I'm not sure if this is as perfect as Smith's Hotel World, though it's certainly more ambitious, maybe even more ambitious than The Accidental, which I also loved. I found my first section so wonderful that I felt the second could only pale in comparison, and it does a little bit, if only because there's maybe a bit too much talking here and there. But still I loved it -- it dovetails into the other section, like a hand in a glove, like one puzzle piece into another. Cathrine and I had the same experience reading my second section, though she read it first in her copy -- that is, much googling of images, though we googled nothing in the other section. In that section Smith's rendering of the artist's works is enough.Many ways of \"how to be both\" are found in this novel (I won't list any as seeing those are part of its pleasure) and the structure of the book is not a gimmick, but another reflection of the theme."}, {"userName": "MJ Nicholls", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "I tussled for two weeks with this challenging and disappointing novel from the Best and Most Innovative Scottish Novelist Alive. Split into two separate narratives connected via the novel’s bipolar concept, the first section is quintessential Smith with its precocious teenage protagonist and her tireless obsession with words (these recurring characters are sentimental love-affairs with one’s formative time discovering language and its possibilities), while the second part is one of her riskiest experiments with style, voice, (mild) typography, wearing its Christine Brooke-Rose influence with pride, and for this reader . . . seems to fall facewards. Establishing a loveable character within a wondrous Smith world and dropping this after 170 pages for the rambling narration of a 15thC painter that splices epithets about art and painting between various tortured plot strands, written in frustrating run-on sentences in a semi-Italian accent, is ballsy and indulgent. The meandering aspect of the second tale and its seemingly slapdash effect impeded my fun, despite the isolated moments of quotable and perfect thought-making that leap out from the sprightly pages. Smith’s latest teaches one how to be both exhilarated and exhausted."}, {"userName": "Ron Charles", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Ali Smith’s playfully brilliant new novel makes me both excited and wary of recommending it. This gender-blending, genre-blurring story, which was shortlisted for the Booker Prize, bounces across centuries, tossing off profound reflections on art and grief, without getting tangled in its own postmodern wires. It’s the sort of death-defying storytelling acrobatics that don’t seem entirely possible — How did she get here from there? — but you’ve got to be willing to hang on.The games start even before you know it, as soon as you pick up a copy. In a flight of whimsy that is far too rare in publishing, “How to Be Both” is being released like some kind of literary Pushmi-pullyu: In half of the editions, a historical novella precedes a contemporary one; in the other half, the order is reversed. You won’t know which version you’ve bought until you begin reading. The two novellas make frequent references to each other, but how you interpret those references will depend on whether they’re looking forward or backward. (What a perfect complication for the adventuresome book group!) As one character says, it’s a lesson in “how to tell a story, but tell it more than one way at once, and tell another underneath it up-rising through the skin of it.”The 15th-century story is narrated in a stream-of-consciousness monologue by the impish ghost of Francesco del Cossa (c. 1430-c. 1477). An Italian painter about whom little is known, del Cossa worked on the frescos inside the Palazzo Schifanoia in Ferrara, Italy, until he apparently became annoyed with the meager wages. On the scrawny skeleton of that historical record, Smith fleshes out the life of a precocious young artist who binds her chest with linen, takes the name Francescho and pretends to be a man so she can get commissions.It’s a fascinating bricolage of history and speculation enriched with Francescho’s audacious patter, often comically incongruous with the Renaissance. Freely mixing genders and pigments, the young artist distinguishes herself early as a magician with paints — and she knows it. “I’m good at the real and the true and the beautiful,” she tells us. She can capture human figures in suspended motion, and she has mastered a sense of depth that transfixes the eye.That self-taught skill gets Francescho a job painting panoramic frescos at the Palazzo Schifanoia, and there we follow her working with the more famous Cosimo Tura. Amid her boasts and complaints about her artistic rival, we learn much about the way Francescho — and, by implication, Smith — relishes the trompe l’oeil effect of great art: “I like very much a foot,” she says, “or a hand, coming over the edge and over the frame into the world beyond the picture, cause a picture is a real thing in the world and this shift is a marker of this reality: and I like a figure to shift into that realm between the picture and the world just like I like a body really to be present under painted clothes where something, a breast, a chest, an elbow, a knee, presses up from beneath and brings life to a fabric.”The most delightful — and admittedly absurd — scene is one involving her trip to a whorehouse with her best friend, a male, who has no idea Francescho is approaching their sexual adventure with entirely different expectations. But soon the ladies are asking for Francescho (she paints their portraits behind closed doors). Francescho’s friend assumes his fine-featured buddy must be quite the stud. “Love and painting both are works of skill and aim,” she confesses to us.Francescho’s half of the novel follows a bumblebee’s flight pattern, darting forward and backward through memories of childhood and old age, alighting on certain sweet or painful experiences for a moment. “We go out anonymous into the insect air,” she says, “and all we are is the dust of colour, brief engineering of wings towards a glint of light on a blade of grass or a leaf in a summer dark.” Francescho assumes that she is dead, hovering in purgatory, but she has no idea how she got here. (Do any of us?)The most perplexing visions that pass before her involve a young man — no, wait, a young woman — in the year 2013. There, during unpredictable and baffling moments, Francescho can see her and her mother looking at paintings in a Ferrer museum and carrying a “holy votive tablet” upon which appear an impossible number of quickly changing portraits. Shifting through space and time, Francescho tenderly observes this teenager studying the little square images she has affixed to her bedroom wall.In the second novella — or the first, depending on your particular edition of this book — we follow the life of a 16-year-old girl, George, an acerbic high school student in contemporary England. Although it is told in the third person, George’s story, like Francescho’s, moves freely through time, circling back on significant moments and themes that gradually come into focus. Among her most cherished memories is a family trip to Italy, where she and her mother saw frescoes created by del Cossa. (See where this is going? Believe me, you don’t.)In the hazy months following her mother’s unexpected death, George returns to that happy trip, with its witty banter about art and feminism. Those memories are a respite from her father’s drunken sorrow and the platitudes of her well-meaning school therapist. Left largely alone in a fog of despair, George struggles to grasp the surprising dimensions of her mother’s life as a loving parent and a well-known online anarchist.This sounds like a novel freighted with postmodern gimmicks, but Smith knows how to be both fantastically complex and incredibly touching. Just as Francescho’s story is laced with insights about the nature and power of painting, George’s story offers its own tender exploration of the baffling and clarifying power of grief. How can a loved one suddenly not exist? And how can a painting bring ground pigment and oil to life? Standing in the Palazzo Schifanoia, George looks up at the frescoes and says, “What there is . . . is so full of life happening that it’s actually like life.” To which her mother responds, “Whenever it’s sardonic, a moment later it’s generous again.” So, too, with this swirling, panoramic vision of two women’s lives, separated by more than 500 years, impossibly connected by their fascination with the mystery of existence.This rest first appeared in The Washington Post:http://www.washingtonpost.com/enterta..."}, {"userName": "Cheryl", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/2375838-cheryl", "userReview": "It is an infinite loop. A book of mirrors. There are many kinds of both, inside the stories, outside the stories but in the book, over and over, back and forth. Like looking in a mirror of a mirror, to see endless reflection. The words line up one after the other, but they also reach out, silently, to pair up and mirror and reflect upon themselves across time, thereby bridging it.Time merges. The book somehow begins to escape time, to transcend it, to weave a fabric.”Past or present? George says. Male or female? It can’t be both. It must be one or the other.Who says? Why must it? Her mother says.”This is my pick for the Booker winner."}, {"userName": "Mom", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/6503374-mom", "userReview": "Well, I tried. It won the Booker Prize and had loads of rave reviews, so it must be good, right? Well I read the first half (about George) and it was okay maybe, with reservations because of the odd & difficult-to-understand word usage/style. Then I started the second section and decided that life is just too short and I have way too many books on my \"To Read\" list anyway. Perhaps Ali Smith is an amazing writer who's invented a totally new way to write a novel, but it sure didn't touch me."}, {"userName": "Michael", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "This is exactly what I like best in “experimental” writing. Playful vistas with depth, lives with layers and connections that bubble up delightfully into your awareness, the fruits of discovery there for taking and in enough plenty there is no want or penalty of missing some. We have one-half of the book devoted to the life of a female painter in Renaissance Italy posing as a man, Francesco, and a second half about a teenaged girl in contemporary England, Georgie, who is engaging with her dead mother’s obsession with Francesco’s work as part of her process of grieving. One could say the book is about the parallels between art and love, violation of the polarities of gender, hidden stories beneath surface forms, and the immanence of the past in the present through memory and imagination. There are a lot of balls juggling here, and it was fun to have another ringside seat after enjoying her “The Accidental” so much.Francesco’s story unfolds from her shuttling back in forth in time through memory. Francesco is the daughter of a mason whose talent in art inspires her father to teach her the skills of using tools and construction and to help wangle her work in the guise of a boy as a painter’s assistant. When she was a teen, she befriended a rich boy whose excursions with her to a brothel afforded her an opportunity to use the women there as models, paying them with her renditions of them. When we catch up with her in her 20s she has become a success with a painting of a saint being shown in the same room with works of a famous artist. She witnesses a boy grooving on her painting, and the allure of his form and ways of moving compels her to follow him. But he is following and spying himself on an older woman under his own spontaneous ardor. We soon learn that Francesco’s temperament has long led her to delight in love of both men and women. From her character’s first person narrative Smith does a masterful job of convincing me how talented artists must be wired to see the world differently. The book begins with a challenging section composed of poetical perceptions and metaphors for Francesco’s special vision and motifs she is driven to pursue. At a later point she reveals a bit of what she has learned from the works of masters in the following collage: … from looking at whose works I learnedthe open mouths of horses,the rise of light in landscape,the serious nature of lightness,and how to tell a story, but tell it more than oneway at once, and tell another underneath itup-rising through the skin of itAt another point I felt blessed to get an even more articulate version of her artist mind: It is a feeling thing, to be a painter of things: cause every thing, even an imagined or gone thing or creature or person has essence: paint a rose or a coin or a duck or a brick and you’ll feel it as sure as if a coin had a mouth and told you what it was like to be a coin, as if a rose told you first hand what petals are, their softness and wetness held in a pellicle of colour thinner and more feeling than an eyelid, as if a duck told you about the combined wet and underdry of its feathers, a brick about the wet kiss of its skin.Eventually Francesco gets a major commission from a Duke to paint three large panels in his palazzo in Ferrara, representing three months of life the service of the Duke’s as a just noble for his people, with other artists tapped to do the other months. Together with an assistant she jokingly calls the “pickpocket” she unleashes all her creativity to depict activities of the Duke in the context of the range of life among the villagers in the bottom section, activities of Roman gods above, and between a band of blue sky through which float some special people. But the Duke is stingy with his pay, and Francesco has to end the project prematurely. In revenge, she wreaks some subtle satire in the images. Other elements, such as using the image of a prostitute friend for the three Graces, conform to an assertion of her own private value system. Like all artists, Francheso struggles with trying to create something of lasting value when all else in life is so ephemeral. Sometimes she despairs:Cause nobody’s the slightest idea who we are, or who we were, not even we ourselves.But occasionally, she meets someone who recognizes and accepts the duality behind the gender he presents, as in the case of a bedraggled peasant man she meets on the road who explains his friendly response about it: It means, he says, you are more than one thing. You who exceed expectations.For the most part, however, she accepts the vibrancy of mortality:Other than these, we go out anonymous into the insect air and all we are is the dust of colour, brief engineering of wings towards a glint of light on a blade of grass or a leaf in a summer dark.Yet in the second part of this book, Smith tries to prove the words of an early philosopher of aesthetics Francesco admired who found common ground between human romance and art:love and painting both are works of skill and aim: the arrow meets the circle of its target, the straight line meets the curve or circle, 2 things meet and dimension and perspective happen: and in the making of pictures and love—both—time itself changes its shape: the hours pass without being hours, they become something else, they become their own opposite, they become timelessness, they become no time at all.The plot is only of vignettes of mystery, lessons in discovery of self. An image of a plant with eyes for buds precedes the first section, a motif the artist uses in her painting of the blind Saint Lucia. A wall-mounted monitoring camera precedes the contemporary section. This is Georgie’s world. Our high tech age of TV, camera phones, and lives laid out on the internet. She is a pain in the ass to her parents, always correcting their grammar, a stickler pedant that counters their easy going hippie heritage. But like the old song says,”there’s another Georgie deep inside.” She likes to be called George. She thinks her new special girlfriend wants to kiss her. Standing in the garden (Eden?), she forces herself to watch on her iPad pornography with a young girl used as an object and can’t get over how her existence as being used will persist indefinitely on the internet instantly available to hoards. Our hearts go out to her as she pledges to watch it in regular ritual as a witness. And experience her father trying to protect her and mitigate her horror with helpless platitudes that only lead her to lash out: “I can’t believe I am even related to you. “She hates history, with all its ancient wars and plagues. But her mother is now history. And she can’t get over how she can be gone but still live in her memory. She revives a lot of their lively exchanges, at first pausing to correct “she says” with “she said”, but then letting slide on such editing. Though she tells her therapist she must be getting by without feeling her feelings, she is seems to be beginning to feel the love she shared with her mother. She can see know how cool her mother was as the pioneer of radical satirical internet pop-ups that would put out artistic content over a political text or political messages over content related to the arts. She can feel the wisdom behind her gentle critique of her multitasking of TV and internet by saying, “You are a migrant of your own existence.”Her mother is a journalist of culture and politics and is scholarly about art and feminism. She becomes captivated by the few works by a Renaissance artist little is known about and is sensitive as a feminist to a lot of its gender-bending content. A trip to the Duke’s palazzo in Ferrara is a special memory George unfolds for us. At one point she is whining, “What is the point of art”, and her mother answers, “Art makes nothing happen in a way that makes something happen.” When George experience with her the wonders of Franceso’s panels, she begins to get her mother’s obsession: “What there is …is so full of life happening that it’s actually like life …We feel the excitement of her shared experience with her mother:It’s like everything is in layers. Things happen right at the front of the pictures and at the same time they continue happening, both separately and connectedly, behind, and behind that, and again behind that, and again behind that, like you can see, in perspective, for miles. I’ve never seen anything like it, my mother says. It’s so warm it’s almost friendly. …It’s never sentimental. It’s generous, but it’s sardonic too. And whenever it’s sardonic, a moment later it’s generous too.She turns to George.It’s a bit like you, she says.Only at this point do we get the real name of this artist and have a chance to look up the images. Luckily, in her wonderful review , Kalliope brings images of many of the paintings and their details together with a great commentary. Thanks to Theresa for first recommending this cornucopia of a book."}, {"userName": "Specialk", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/5631790-specialk", "userReview": "Sometimes, I think authors write books to have a laugh at us. And I think that we as people think that because we don't get it, it must be profound. Which means it must be amazing. And then everyone just follows suit and insists this book is stellar. I didn't get it. I hated the style. I loathe authors that can't be bothered to make something readable (hello, quotation marks for defining speech sections). I mean I got it. But I didn't _get_ it. And so I gave up maybe a quarter of the way through. Which isn't fair, but sometimes that's life, and I honestly believe this book is a laugh at us. Just to see how far we'll go to prove we are deeper than the shallow end of the pool."}, {"userName": "Julie Christine", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "...beauty in its most completeness is never found in a single body but is something shared instead between more than one body\nAli Smith upends the standard binary worldview in this gorgeous, complex, postmodern creation. It's a rare book that leaves me weeping at the end, but this is a rare read, indeed. At once playful and melancholic, absurd and achingly real, How To Be Both transcends boundaries of past and present, life and death, perception and reality—not to mention plot and character—to become something greater than the sum of its two distinct, but intertwined, parts. One part (I cannot say Part One because half the books were printed with one section leading off, half with, well, the \nother\n section) brings us the story of George, a teenager living in present-day Cambridge, England. George, named after the iconic 60s pop song Georgy Girl by The Seekers that reduced a young woman to little more than a pretty bauble, is searingly smart and self-aware, yet so vulnerable. She is navigating the murky waters of grief over the sudden loss of her mother, enigmatic and impulsive Carol. Seeking clues into Carol's psyche in a poignant attempt to connect with her mother, to know her and hold her in a way she could not before her mother's death—because we all take the living for granted, don't we?—George tumbles down the rabbit hole of Ali Smith's imagination. George stumbles upon her mother's obsessions, including Carol's certainty that she was being monitored (or minotaured, in a delightful turn of phrase and twist of plot) by the government, and a work of art by a little-known Renaissance painter, Francescho del Cossa. Along the way, George develops obsessions of her own, including an internet porn video, which she forces herself to watch every day as a way to honor the young girl victimized by the pornography; and a friendship that grows into puppy love with a classmate, Helene Fisker, known as \"H\". She also gently leads her dumbstruck father and lonely younger brother through their own labyrinth of grief, while waiting for her house to literally fall down around her. Although George's story is more immediately engaging, because it is told more or less conventionally, with a touching and tender perspective, it is del Cossa's madcap, meandering, stream-of-consciousness life story that anchors the book to its themes: the subversive power of art, the mutability of gender and sexuality, the way existence spills beyond the frames in which we try to contain it, all the madness and joy that is life, particularly life lived within art. \nI like very much a foot,” she says, “or a hand, coming over the edge and over the frame into the world beyond the picture, cause a picture is a real thing in the world and this shift is a marker of this reality: and I like a figure to shift into that realm between the picture and the world just like I like a body really to be present under painted clothes where something, a breast, a chest, an elbow, a knee, presses up from beneath and brings life to a fabric.\nI have this little notion, delicious to me, that George and H created del Cossa's narrative, or perhaps she, theirs, as she watches from a remove of 500 years. Or that somehow there was this beautiful melding of minds that melted the time and distance between these two stories, a melding that found purchase in a vibrant, revolutionary work of art. \nBut art and love are a matter of mouths open in cinnabar, of blackness and redness turned to velvet by assiduous grinding, of understanding the colours that benefit from being rubbed softly one into the other : beyond which there's originality itself, which is what practice is really about in the end and already I had a name for originality, undeniable, and to this name I had a responsibility beyond the answering of the needs of any friend.\nWait, what? you say. That makes no sense. Oh, dear reader. Let go of expectations, convention, allow yourself to be dazzled to the point of bafflement. The double helix of this narrative twists endlessly, spinning in possibility and wonder.  hello all the new bones hello all the old hello all the everythingto be made and unmade both"}, {"userName": "·Karen·", "userReviewDate": "Jan 28, 2015", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "[Françoise Hardy (hide spoiler)]"}, {"userName": "Robin", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/36555254-robin", "userReview": "Playful and unique in structure - this novel is comprised of two stories which, depending on the copy of the book you are reading, could start with the story of George, a precocious teenager who has recently and suddenly lost her mother, OR the narrative of relatively unknown Italian renaissance painter, Francesco del Cossa. What is kind of brilliant about this little trick, is that each person's understanding of the stories will be slightly different, depending on which story they read first. I read George's story first, and I believe that informed my reading of Francesco's story. Had I read them in opposite order, it would have been a different book.The link between the two stories is that Francesco is the favourite painter of George's recently deceased mother. Perhaps the second story is all George's imagining (since there's so little actually known about the painter, she could have free reign with her musings - even make her a woman). The stories overlap thematically and otherwise.Art lovers will enjoy this book. Those who feel at home in galleries and travel specifically to see original works wherever they are found, will find elements to love, as I did. In the present story George goes with her mother to the Schifanoia Palace in Ferrara to admire the Francesco del Cossa murals, knowing very little about the artist, with just the simple love of the experience of seeing the work. The other story features the actual artist, with many references to creation and painting and the outside influences that combine to the final product. In this way these stories intersect to give us perspectives of creating and admiring of art - both.Sexual duality and interchangeability is also touched upon - George (who goes by the ambiguous shortening of Georgia) is beginning a meaningful relationship with Helena. Francesco binds herself to disguise her femininity and teaches the ladies in the brothel a thing or two about physical love. ...all I could think of all that week was flowers for breath and flowers for eyes and mouths full of flowers, armpits of them, the backs of knees, laps, groins overflowing with flowers, and all I could draw was leaves and flowers, the whorls of the roses, the foliage dark.This flows into ideas of identity - Francesco seems to me a person who is barely known, except by her friend Barto who needs her to be someone else, so that he can be okay with not having her. She is a woman in secret, her life is cloaked physically and otherwise. This reflects beautifully with how George often feels.Cause nobody knows us : except our mothers, and they hardly do (and also tend disappointingly to die before they ought).I enjoyed George's story more. Francesco's story was slippery - I had a tougher time sticking to the pages, as it was more experimental in style, form, grammar, and was less grounded in reality (she is in a kind of purgatory, fairly sure she died but unable to remember), and I wasn't all that convinced of the time and place (1460's Italy) as I was in the first story. But I really appreciate what Ali Smith was doing; she's so very brave in her unique style, wildly creative thinking way off the canvas, and terribly intelligent in the execution of it all.How to be both plays with being the beginning and the end, the creator of art and the appreciator, dead and alive, male and female, remembering and forgetting. ...the bareness and the pliability, it takes, ho, to be both."}, {"userName": "Maria", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/57090347-maria", "userReview": "This wonderful, playful, beautifully written book contains two different stories. In one story, we meet George (short for Georgina), a teenage girl in present day London. George just lost her mother, and are having a difficult time handling the grief. In the other story, we leap 600 years back in time to meet Fransesco del Cossa, a renaissance painter. Fransesco is an actual, historical figure, and the paintings that are described in this book does exist. Very little is known about him though, so the story of his life as presented in this book is Ali Smiths creation. For example, when we learn that Fransesco is a girl pretending to be a boy in order to pursue a career as a painter, there is no historical reference in support of that. So, both protagonists in Smiths's book are girls with boy's names, which is typical of her play with gender, identity and stereotypes.In addition to being beautifully written, these two stories are weaved together in a very clever way. Fransesco was George's mother's favorite painter, so George thinks about her quite a lot, and reminiscences about visiting a museum displaying Fransesco's paintings with her mother. Fransesco tells his story after his own death. He wakes up as a spirit in a world he does not understand (our present day world), and his ghost follows George around, like he's stuck to her. It is fun to see how this renaissance ghost tries to make sense of George's world, with its cars, phones, ipads and so on:[…] and they look or talk or prey to these tablets or icons all the while by holding them next to their heads or stroking them with fingers and staring only at them, signifying they must be heavy in their despairs to be so consistently looking away from their world and so devoted to their icons.So, in Fransesco's story, we see George from the outside, in addition to Fransesco telling us about his life and his painting career. In Georges story we see Fransesco from the outside, through his art.Smith's stroke of genius in this book is that you can never know which story comes first. The book was published in two different versions at the same time. They look identical, but in one version George's story comes first, and in the other, Fransesco's. Which version you will get when you buy the book, is completely random (in my version, George's story comes first).So the question is: how will the first story one reads impact the second? Since each story contains an outside view on the protagonist in the other story, we can only approach the first one with a clean slate. I don't think I would have read Fransesco's story in the same way if I didn't already know George's side of things. This means that each reader is only capable of reading one of the stories, without having it colored by the other one. This is a very clever mechanism, that makes you think about how texts interact with and influence each other.When you read George's story first, it seems natural to think that she's simply making up the story of Fransesco. In other words, that the second story is nothing more than George's fantasy or daydream, something she thinks about while she's sitting in a museum looking at Fransesco's paintings. This interpretation does find some support in the text, for example in the conversations between George and her friend Helen. When they're working on a school presentation on empathy, they consider basing it on Fransesco's art. They try to imagine how he/she would have talked and behaved, and how he/she would have reacted if brought into the present time. In addition to this, we see George's mother at one point asking George to imagine being a painter, as part of a thought experiment: Okay. You’re an artist, her mother says.Am I? George says. Since when? And is that a moral conundrum?Ha ha. her mother says. Humour me. Imagine it. You’re an artist. Maybe George is simply doing what her mother told her to do, and dreaming herself into the life of Fransesco? That could also explain why Fransesco is described as a woman.If I had read Fransesco's story first, I would probably be less inclined to interpret it as George's daydream. Fransesco's language is so different from George's. It's very believable, fresh, alive, colorful, and just wonderful to read. George's voice is good to, but very different. The way Fransesco sees and describes shapes, colors and motives are incredible, as are the ideas and thinking process involved in making a painting. If you read Fransesco's story first, you could argue that Georges knowledge of the renaissance, and her life experience in general, is too small to imagine something like this. So both interpretations find some support in the text, and it's fascinating to watch how Smith has managed to balance the two stories up against each other.Fransesco and George has a lot in common. Both are women with a man's name. Both lost their mother while young and both are excellent observers. The book often dwells on pictures and situations, and describes them in a completely fascinating way. Both the picture on the cover, and the paintings on the inside jacket are described wonderfully in the text. How To Be Both is beautiful, tactile, playful and experimental, and I had to really study the pictures described in it, and google Fransesco's art to see for myself. At the same time the language always seems oral, spontaneous, and seamlessly moving from one topic to the next. This was the most beautiful book I've read in a long time."}, {"userName": "Douglas", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/3020662-douglas", "userReview": "This is one of the best books I’ve read in awhile. “It is a feeling thing, to be a painter of things: cause every thing, even an imagined or gone thing or creature or person has essence: paint a rose or a coin or a duck or a brick and you’ll feel it as sure as if a coin had a mouth and told you what it was like to be a coin, as if a rose told you first-hand what petals are, their softness and wetness held in a pellicle of colour thinner and more feeling than an eyelid, as if a duck told you about the combined wet underdry of its feathers, a brick about the rough kiss of its skin.”It’s the work of a true literary artist. She’s been compared to Virginia Woolf, but I think Ali Smith is in a league of her own. I honestly can’t even begin to describe this. I’m at a loss, really. I’ve read several reviews, and few succinctly describe it. Often, book reviews use adjectives like “playful” “evocative” or “thrilling” as descriptors, and these words seem to either be the same or synonymous between reviewers. But, I’ve noticed with this one, everyone is saying something different. No one is using the same adjectives and everyone seems to read it a little different, to “see” things differently. (Eyes and seeing are major themes.) Instead of this being symptomatic of the book and what it’s about, I suspect it may have more to do with the actual person or reviewer reading it. How do they see art and life? “Cause nobody’s the slightest idea who we are, or who we were, not even we ourselves - except, this is, in the glimmer of a moment of fair business between strangers, or the nod of knowing and agreement between friends.”This is a book about identity. It’s about how we see life and how we want to be seen. It’s about the art we create and what it says about us and how it reveals who we really are. It’s all of these things, and it’s immensely spectacular. At one point, George, the central character in one of the sections, is speaking to her father about being drunk. “It is lovely, being intoxicated, her father said the other night. It is like wearing a whole fat wooly sheep between me and the world.”For me, this book was intoxicating, and like great literature should do, it was a thick woolen blanket between me and the world. Immense thanks to Goodreads and Pantheon for the review copy. I’m greatly indebted."}, {"userName": "Tony", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/33771-tony", "userReview": "I'm not supposed to get everything, I know that. And I have a ready excuse, having read this book before and after Thanksgiving. That chronological reading experience was on my mind, even as I read this, because Ali Smith talks about before and after, then and now, in this ostensibly bifurcated novel(s).I better explain the plot/structure for anything of what I'm saying to make sense. There are two parts to this book, two equally divided stories. The first part, in my edition*, is in the here and now, because precocious teenager George (Georgia) often connects to the world via smartphone, and she connects to the past that way as well. She views her life now as being before and after her mother's death. And her story is told that way. This is lovely storytelling, familiar to anyone who has read Ali Smith, but it never felt like some template. One story within the before story is that George's mother became intrigued with the paintings of Francesco del Cossa and took George and George's younger brother to Italy to take a look. How cool a Mom is that? After the mom dies, the paintings of del Cossa become a lingering thread for George. While I had issues with some of the plotting of this part, I loved the storytelling. But that was before Thanksgiving.I shouldn't use a houseful of people and a daunting list of cooking chores as excuses for missing a literary point. (And, oh, did I mention the wine?) I'm perfectly capable of meandering off to sneak in a few dozen pages even at the peak of a party. But by Day 4, I was finding part two a bit of a chore.Part two takes us back to the 15th Century and to the voice of del Cossa as he learns his art. He has some recurring vision of a young girl looking at his painting.Now, Ali Smith is not writing some thriller here. There will not be some in-your-face moment when the connection, if there is a connection, will be explained. You'd be in the wrong aisle. There is no Del Cossa Code. Ali Smith is too good for that, and she respects her readers too much, to be that glib. And thankfully so. Still, the juxtaposition of these stories seemed a bit forced to me.I kept getting back to the before and after theme. Remember a time before the internet? When I read Hesse forty years ago, a reference to St. Matthew's Passion would send me scurrying to the library to check out the album. Now, I'd just YouTube it.Reading How to be both, I had to keep my laptop busy, simultaneously looking up St. Vincent Ferrer and St. Lucy and The Annunciation. Lucy's the one with the hand holding the eyes and the Annunciation is the one with the snail. What one learns is that you could be really weird, even in the 15th Century. Meaning: There have always been people WHO CAN SEE THINGS. That's comforting somehow. And this is no blasphemy, merely a reasserting of the power of the gaze back at us from outside us always on us. And, an eye with no light is an eye that can't see. There's a lot of eye symbolism going on.What I was getting at, before I meandered, was asking myself, and you, whether this book could be read without the internet. Smith certainly doesn't add glossy inserts. But her descriptions of the paintings were somehow inadequate. While I liked the way George told her story better than the fuzzied up way del Cossa told his story, the painter did try to explain what he sees: I like a nice bold curve in a line, his back a curve at the shoulder: a sadness? And I liked the pretense of two teenaged girls changing song titles into Latin. Adiuvete!Quem volo esPuella fuvis oculisRes vesana parvaque amor nomineHow's that for a playlist?*(I've heard that some editions reverse the orders of the stories, del Cossa going first. I didn't like this enough to experiment. But I've sure thought about it.)"}, {"userName": "Blair", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "[her narrative was invented by George (hide spoiler)]"}, {"userName": "Helene Jeppesen", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/21992464-helene-jeppesen", "userReview": "This book was so interesting that while reading it, I decided to order 5 other of Ali Smith's novels just because I knew I had to get to know her better. This book contains two fates and two stories which are told seperately. The writing style is unique and somewhat messy, but the tone of voice is clear and the two characters have very different personalities. Meanwhile, the lines between their fates shine through and that's one of the beauties of this novel. I was impressed by how they are both so different, yet so similar. This is a novel about art, loss and life decisions and I loved it. It's got a fresh and unique take on how to tell a story, and I most definitely see why a lot of people are in love with Ali Smith's works. I, for one, can't wait to get to know her authorship better."}, {"userName": "Mala", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/5960716-mala", "userReview": "[ the Eye section is a reimagining of 15th century renaissance Italy by a school girl for her Empathy-Sympathy school project. Logic, folks! (hide spoiler)]"}, {"userName": "Pamela", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/5927588-pamela", "userReview": "Yes, yes. Well done Ali Smith. You're very smart.If there is one thing Ali Smith's Bailey's Prize Victory with her novel 'How To Be both' has proven to me it is that even literary prizes can fall prey to the bells, whistles and buzz words of a good media campaign.'How To Be Both' was marketed as a genre defining, genre bending and genre creating novel of ultimate importance in the literary world. It hailed the rebirth of true stylistic originality, and Ali Smith has been described by one of the Bailey's Prize judges Shami Chakrabarti as 'a literary genius'. The problem is, I don't know a single person who liked it. The novel's main selling point is that it can be read in two different ways. We have a modern story about a teenager in Cambridge named George, and a story about Renaissance painter Francesco del Cossa. Depending on which copy of the book you pick up will depend on which story you are treated to first. The order in which each half is read is supposed to change the entire reading experience. From discussion with my book group a few weeks ago we deduced that yes, it did change the reading. But only those who read Francesco's story first derived any semblance of enjoyment from 'How To Be Both', and indeed seemed to understand the underlying a plot a lot better. Francesco's story is stylistically more complicated to follow, and is without a doubt less interesting than George's half. Reading George's story second seemed to feel like a reward, whereas having to read Francesco's half second felt like the ultimate punishment. Francesco's half was rather more abstract that George's, and this abstraction lent itself to understanding only if read first. Upon discussion we found that those of us who had read Geroge's story first simply did not put the connection between the two characters together, meaning we ultimately felt that we'd read two different stories rather than a cohesive whole. To me this would indicate that the central selling point of this novel's originality was ineffectual and I must admit I'm not even entirely convinced of its intrinsic originality. I feel like we are meant to see this as new and revolutionary for no other reason than Ali Smith told us to. Huge props to her publicist who deserves a raise for making us all believe it.The pages devoted to Francesco's story in 'How To Be Both' are stylistically experimental. They flow poorly and are not written in a style believable to the settings time period. Ali Smith has also made an annoying decision to replace the word 'because' with 'Cause' in every case within Francesco story. It truly grated after a while, and did not serve to heighten the plot, or give Francesco a convincing voice. Smith also foregoes the use of regular grammatical structure, something that I don't usually take issue with when implemented to the advantage of a novel. In this case however it felt like a self conscious decision to appear to be 'literary'. It is a plot device employed in what feels like a cynical move to appeal to the pretensions of judges who sit on literary prize panels. Do they make decisions of the merit of a work, or do they make decisions based on the fact that they, like everyone, gets so caught up in the supposed newness of an idea that they see a genius that simply isn't there because they so desperately want it to be?I know that I am not alone in seeing Ali Smith's 'How To Be Both' as far from the genius it has been claimed to be. I think what we have now is a large proportion of the reading public who are too worried about coming across as ignorant, or that they somehow just didn't get it. So they smile, nod and perpetuate the marketing jargon which makes us all think that 'How To Be Both' is the second coming of the novel, all so that their supposedly 'more learned' friends won't think them stupid. In my opinion there are a whole lot of disappointed book buyers out there who have spent good money on something that they were told was going to be brilliant and ultimately left them a little more empty than before they'd read it. It is simply a case of the literary marketing monster desperately making us want a thoroughly underwhelming product. Did I buy it? Yes I did. Did I enjoy it? I think the answer to that is obvious.http://iblamewizards.com/opinion-how-..."}, {"userName": "Maxwell", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "A new favorite. Innovative, original, and unforgettable. I'm confident in saying that I will reread this in the near future, because it was that darn good. Please do yourself a favor, and go pick this one up."}, {"userName": "BrokenTune", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "\"...and how to tell a story, but tell it more than one way at once, and tell another underneath it up-rising through the skin of it) –\"This book is a complete and utter but strangely beautiful mess - at least structurally. But then there are different editions to this book and depending on which edition you picked up, it either starts with the story of George or the story of Francescho. No matter which one it starts with, both stories are intertwined and both stories - though very different - toy with the idea of how opposing concepts can be combined.Luckily, my journey started with George. Luckily, because Smith's ambitious project would have confused me even more than it already did if the story had begun with Francescho's story and had lacked the introduction to the concept o duality that is introduced by George's dialogue with her mother. \"Past or present? George says. Male or female? It can’t be both. It must be one or the other. Who says? Why must it? her mother says.\""}, {"userName": "Deea", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/8111258-deea", "userReview": "5* (I would give the first story 10* and the second 4*, but I liked the idea so much that I cannot lower the number of stars because of the second story)How can one review this book? It is original, surprising, ingenious. It talks about art and how the concept of art and life can switch places so easily.\nIs it possible then that all the people of this place are painters going about their world with the painting tools of their time?\nArt. In art, just like in life  there are certain things that, said out loud, will change the hues of a picture like a too bright sunlight continually hitting it will.I am not attempting to review this book. I am just scrapping some ideas. This book is a labyrinth and it's made of two mysterious stories that complete each other. One is the key for the other and the other way around. There are two ways of reading it: EYES precedes CAMERA and CAMERA precedes EYES . I chose the first (the story of the painter first, then Georgia's story). I advise you to choose the second in order to keep the better part at the end, rather than the other way around. But then again, the experience of reading is so different for each individual. Isn't this what Ali Smith tries to show through this experiment? So, scratch what I said... read this as you feel like reading it.Life of a good work of art steps outside the picture. Then it does two opposing things at once. The one is, it lets the world be seen and understood. The other is, it unchains the eyes and the lives of those who see it and gives them a moment of freedom, from its world and from their world both. This is what Ali Smith does gracefully in her two connected stories: first she takes the work of art and gets inside the painter's head. Then she takes some of those who see it and to whom it gives that moment of freedom she talks about.Past and present. Can they happen simultaneously? They certainly can in a book...and if things really did happen simultaneously it'd be like reading a book but one in which all the lines of the text have been overprinted, like each page is actually two pages but with one superimposed on the other to make it unreadable. Except that Ali Smith found another formula and this one is perfectly readable. Can a moment in time be both past and present? It doesn't have to be one or the other. How to be both? Palimpsest of time?"}, {"userName": "Roger Brunyate", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "The Hand that Draws the HandAli Smith has produced the literary equivalent of that Escher print of a hand drawing the hand that is drawing it. In art terms, her novel would be a diptych: two panels of equal size, with different subjects, but intended to be seen side by side. In her case, two stories from different centuries that comment on each other, reflect each other, and (in that Escher twist) at times even write each other. The first half in my edition* is in the voice of a 15th-century Italian painter returned to earth watching a teenager looking at one of the artist's works in a gallery. The artist follows the youth through the city, and observes what seem like the symptoms of obsession. In between, we hear snatches of the painter's own story, growing up as the child of a stonemason, training as an artist, and achieving artistic but ill-paid success painting frescoes for a palace in Ferrara.The second half is told in the third person, and is the modern story of the teenager in the gallery, whom we learn is called George. George's mother has recently died. But a month or two before she did, she took George to Ferrara to see the artist's painting. It transpires that little is known about the painter, other than approximations of birth and death, and one of the things that George's mother and George do is to make up a life to go with the name, a fiction that resonates with the autobiographical information we have learned in the first half, but does not entirely match it. The novel ends just as George begins the behavior the artist observed at the start of the novel. A hand drawing a hand….No description of the novel can do as well as the short paragraph on the back cover, a reticent gem that nonetheless says almost everything that is important. Write at greater length and you come up against the fact that Smith keeps her ideas so close to her chest that it is almost impossible to describe the book without spoilers. For instance, I was able to identify the painter before the end of the first half (it helps to be a former professor of art history)—but Smith holds back the name until the last few pages of the entire book, so I shall also. Looking back with my present knowledge, though, I see how skillful the author was in incorporating the known facts, together with a lot that might reasonably be surmised; she clearly knows her history. But a lot must be invented, and one of her inventions is a doozy that turns out to be the thematic pivot of the entire novel.Oh dear, I realize that I must have made this sound like some dry intellectual puzzle, but not so. For Smith has given her painter an exuberant individual voice, with its own fractured syntax, idiosyncratic punctuation, and even typography (the whole book is printed with ragged right margins). It begins and ends in a poem about a snail, spiraling its way across the page, and the 150 pages in between are a poem in prose. Here is a complete paragraph as an example:\nIt is a feeling thing, to be a painter of things : cause every thing, even an imagined or gone thing or creature or person has essence : paint a rose or a coin or a duck or a brick and you'll feel it as sure as if a coin had a mouth and told you what it was like to be a coin, as if a rose told you first-hand what petals are, their softness and wetness held in a pellicle of colour thinner and more feeling than an eyelid, as if a duck told you about the combined wet and underdry of its feathers, a brick about the rough kiss of its skin.\nI did not need to get far before I was convinced I was reading a six-or-seven-star masterpiece. Unfortunately, the second half did not consistently sustain it. Perhaps it was the lack of the first-person perspective. Perhaps Smith left herself with so many themes to pull together that she could not quite find her focus. Perhaps it is that we are seeing George at a particularly awkward stage, lost, grieving, and not a little bratty. Even verging on autistic. But that feeling does pass, and there are some marvelous passages in this half too. Let me offer one more, about those Ferrara frescoes which contain, among many other details, a picture of a man wringing the neck of a duck. The voice here, repetitious but truly thinking, is that of the sixteen-year-old:\nIt is like everything is in layers. Things happen right at the front of the pictures and at the same time they continue happening, both separately and connectedly, behind, and behind that, and again behind that, like you can see, in perspective, for miles. Then there are the separate details, like that man with the duck. The picture makes you look at both—the close-up happenings and the bigger picture. Looking at the man with the duck is like seeing how everyday and how almost comic cruelty is. The cruelty happens in among everything else happening. It is an amazing way to show how ordinary cruelty really is.\nNot accidentally, this passage contains the word \"both,\" one of many \"boths\" that recur throughout the book, most of which I cannot comment on without spoilers. But this \"both,\" the coexistence of happiness and cruelty, and of the details within the bigger picture, certainly hits some of the themes that make this ambitious but deceptively casual novel a near-masterpiece.+ + + + + +*I gather that the sections are randomly ordered in different printings."}, {"userName": "Issicratea", "userReviewDate": "Dec 14, 2014", "userURL": "http://www.goodreads.com/user/show/23268828-issicratea", "userReview": "[ If we take the very strong hint at the end of the modern section of the novel that the del Cossa narrative is a fiction constructed by George, perhaps in collaboration with her friend “H,” then that means it is effectively written in the literary voice of, or filtered through the consciousness of, an adolescent girl or girls. That means the rather whimsical, anachronistic character of the del Cossa narrative, and the naïve elements in the reading of the Schifanoia frescoes, can’t be laid at Smith’s door  (hide spoiler)]"}, {"userName": "K.D. Absolutely", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "My 3rd Ali Smith book and what I can say is that each time is a different kind of reading experience. Her post modernist stream-of-consciousness writing style is difficult so I have to slow down but it is always rewarding in the end like seeing the finished drawing on a canvas.How To Be Both is composed of two stories. The first is set in a contemporary time and it is about a teenage girl named George and her relationship with her witty and funny mother. Each time they exchange banters, I immediately sit up straight and devour their conversations. That is for me is what makes this first part very interesting. This part that they (reviewers here on Goodreads) refer to as Camera.The second part of the book entitled One and referred to as Eyes is about a 15th-century Italian artist Francescho del Cossa. My reading of this second part became puzzling and it pushed me to continue despite the fact that it made me slow down for two reasons:1. While reading, I kept on wondering how this part relates to the first. Then it dawned on me towards somewhere in the middle of this part that it \"mirrors\" the first. It is like Francescho is George and George is Francescho and how Smith made this possible is just amazing.2. At times more than once, the narration mimics that of how painting is done. This second part is narrated by Francescho himself and the way he speaks is as if he is stroking the canvas. This makes the reading very interesting especially for me who does not know how to paint.This book was my last for 2014 and I enjoyed reading this, especially the second part, tremendously. The only reason why I am not giving this a full five-star rating is that I had to read many parts twice because Ali Smith is so stylish with her non-linear narration that I go back and forth figuring out if the George's mother is already dead or not (first part).Overall, another wonderful Ali Smith book. She is just a joy to read. My second finalist book in Booker 2014 and I thought this is a notch better than Karen Joy Fowler's We Are All Completely Beside Ourselves (4 stars). Just a notch for being stylish."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "If the Booker shortlist only had room for one book about art, I can understand the argument for why this would keep The Blazing World out (but I enjoyed reading that one more.) This has a great main character in the first half, someone who understands her dead mother enough to turn mourning into an outdated dance ritual, and to stalk her mother's friend instead of going to school. It was very readable, very current, almost too current, making me wonder if even five years from now the references would be understood. But then the book shifts to a gender bending painter from the Renaissance who sometimes speaks in poetry and tells her/his story from the past but also through the present in a connection to the previously mentioned central character. Phew. It's a strange pairing but also allows for a different angle on artness and identity. You just have to give yourself over to it, especially at the sudden halfway point shift.ETA: Discussed on Episode 014 of the Reading Envy Podcast."}, {"userName": "Shahirah Loqman", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/12725878-shahirah-loqman", "userReview": "Oh, this book! This wonderful, weird yet heartwarming book! I admit it was so  difficult  to get into this book at first. My narrative began with the 16 year old girl, George (short for Georgia) who recently lost her mother. But in the midst of her sadness and grief and attempt to move on without her mother, I became very, very attached to George. In truth, I am a sucker for mother-child stories and this hit me right in the spot. Then the story transitions into a Renaissance painter's narrative. She's a girl name Franschesca who hides her identity by being a boy (Franchesco) to get a job as a painter, since in those times female painters were not encourage/celebrated. Now it seems like these two stories are separate and not related, but they are. Not to give any spoilers, but there is a beautiful relationship between George, her mom and Franschesca's personalities. They revolve around the issue of feminism, self worth, passion and the loss of a beloved family member. The writing style is so  amazing  !Like I was blown away by how  close  I felt to George and that her life is relatable to mine. It's the story of pursuing your passions despite being in an unconventional situation, and having the faith that moving on is just as painful as it is liberating. A recommended read from me, experience the whole thing yourself. I don't think words could ever justify how amazing I felt this book is."}, {"userName": "Laura", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Even if I've tried hard to read this book, I am giving up on this one.Even if the author tried to use different styles of writing, she didn't get any close to the masterpiece written by Julio Cortazar in his famous book Rayuela."}], "description": "How To Be Both is a novel all about art's versatility. Borrowing from painting's fresco technique to make an original literary double-take, it's a fast-moving genre-bending conversation between forms, times, truths and fictions. There's a renaissance artist of the 1460s. There's the child of a child of the 1960s. Two tales of love and injustice twist into a singular yarn where time gets timeless, structural gets playful, knowing gets mysterious, fictional gets real - and all life's givens get given a second chance.", "title": "How to Be Both", "url": "http://www.goodreads.com/book/show/25371939-how-to-be-both", "average": 3.63, "cover": "https://images.gr-assets.com/books/1525349295l/25371939.jpg", "reviews": 1872, "authors": [{"url": "https://www.goodreads.com/author/show/68992.Ali_Smith", "name": "Ali Smith"}], "type": ["Fiction", "Historical", "Contemporary", "Art", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25371939-how-to-be-both", "http://www.goodreads.com/book/show/20439328-how-to-be-both", "http://www.goodreads.com/book/show/23164913-how-to-be-both", "http://www.goodreads.com/book/show/22232034-how-to-be-both", "http://www.goodreads.com/book/show/23255563-how-to-be-both", "http://www.goodreads.com/book/show/22392892-how-to-be-both", "http://www.goodreads.com/book/show/25058212-how-to-be-both", "http://www.goodreads.com/book/show/28446947-autumn", "http://www.goodreads.com/book/show/127630.The_Accidental", "http://www.goodreads.com/book/show/10187223-there-but-for-the", "http://www.goodreads.com/book/show/123036.Hotel_World", "http://www.goodreads.com/book/show/1527854.Girl_Meets_Boy"]}