{"ratings": 1344, "userreviews": [{"userName": "Dorine", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/6942470-dorine", "userReview": "This is a very cute book that we bought our grand-daughter for her birthday. The look on her face when she read the title was precious and she giggled as she read it. I can see this one becoming a favorite. I'm sure my husband will get even with me by getting the \"How to Babysit a Grandma\" book next."}, {"userName": "Kara Belden", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/6183712-kara-belden", "userReview": "Delaney - \"twenty hundred stars because it's funny!\""}, {"userName": "Colby Sharp", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/5186758-colby-sharp", "userReview": "Super cute book. I see a lot of grandmas buying this book for their grandchildren."}, {"userName": "JennE", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/3917964-jenne", "userReview": "\"Babysitting a Grandpa is fun-- if you know how.\" When Grandpa rings the doorbell, what should you do? HIDE!\" This fun books describes all the important points for babysitting Grandpas. \"How to\" tips include stay quiet like pretending to be a shark waiting for dinner, appropriate snacks for Grandpa such as \"anything dipped in ketchup\" and how to entertain a grandpa by putting on a scary play, somersaulting across the room and showing off your muscles. Finally, \"how to say goodbye to a Grandpa\" by giving him a picture for his fridge, give him a hug and a kiss and ask when can you babysit him again.\" What an enjoyable book that children and adults will love. 4 stars only because there are no diverse characters, but could be used with all ages as a mentor text as well."}, {"userName": "John", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/491443-john", "userReview": "My 2 and 1/2 year old grandson gave this to me as a Christmas present with a little help from my daughter. A cute read that had me laughing out loud. I loved some of the lines including the grandchild's response when PaPa (my grandson's name for me) rings the doorbell, which is to, \"Hide!\" Other lines I identified with (my grandson must have read the book before giving it to me) including snacks for PaPa and how to entertain me."}, {"userName": "Kay Mcgriff", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/5508658-kay-mcgriff", "userReview": "This is exactly what every kid needs to know before taking on the job of babysitting grandpa. It is chock-filled with advice on how to hide and stay quiet (pretend you're a shark waiting for lunch) to entertaining the big guy (put on a scary play) to saying goodbye (give him a picture you've drawn and lots of hugs and kisses). I can't wait to give this one to my nephew on our birthday celebration during vacation."}, {"userName": "Susan Kennedy", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/2462659-susan-kennedy", "userReview": "From two reflective teachersHow to Babysit a Grandpa by Jean Reagan would be a great mentor text for students learning to write \"All About\" or \"How to\" books, since there are instructions and bulleted lists on almost every page. This book is another resource for teaching students that sometimes they have more in their bag of writing topics than they think they do!"}, {"userName": "Maria Burel", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/5331555-maria-burel", "userReview": "How to Babysit a Grandpa ​​is exactly what it sounds like: a handy, dandy how-to guide for surviving an afternoon with those need-to-be-kept-busy charges. Survival tips include such important areas as snacks, what to do on walks, how to entertain, and how to wake sleeping grandpas. The childlike perspective is both humorous and, in the end, touching."}, {"userName": "Alexandra", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/4538194-alexandra", "userReview": "Super cute. Really enjoyed this one as well as the one on how to babysit a grandma. Loved the cozy illustrations and fun ideas about how to keep your grandpa entertained and safe! This book will be great for teaching kids to be responsible and think of others, not just themselves. I think every kid and their grandpa should read this together and do some of the fun activities :)"}, {"userName": "Read  Ribbet", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/2259568-read-ribbet", "userReview": "Probably a better book for home than school but a whimsical fun book about a boy and his grandpa and what they like to do together. Nice book for inter-generational themes. Written in part as a set of tips which could be a good mentor text for writing similar texts."}, {"userName": "Niki (Daydream Reader)", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/6152323-niki-daydream-reader", "userReview": "So fun! I can totally see my son and his Grandpa enjoying this book together."}, {"userName": "Peacegal", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/3078602-peacegal", "userReview": "Cute, clever, funny."}, {"userName": "Brindi Michele", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/6801754-brindi-michele", "userReview": "This book is awesome! Love the layout and the story line....definitely a fun book for story time."}, {"userName": "Kristen Rigau", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/39384378-kristen-rigau", "userReview": "The book How to Babysit A Grandpa written by Jean Reagan is about a young boy and his grandpa. In this particular story, the average roles of a grandpa and his grandson are reversed. In the beginning, it is shown that the grandpa is coming over to play and the boy immediately says, “Babysitting a grandpa is fun-if you know how.” From that sentence, you are then aware what the book is going to be about. They first begin by playing hide and seek, then the parents leave the house and the grandson is there to comfort his grandpa incase he is sad about their departure as a young child would be. Then, he begins to list the snacks that a grandpa would enjoy. They continue to do multiple activities and each is written in a how-to form. Lists begin with titles like, what to do on a walk, How to Entertain A Grandpa, How to play with a Grandpa, and What to Draw for a Grandpa. After a long day of watching over his grandpa, the young boy makes a list on “How to Say Goodbye to A Grandpa”. How to Babysit A Grandpa by Jean Reagan is written in how-to style writing. The layout of the book is in a sequence from the beginning of the day to the end. It covers all the basics of what to do when babysitting a grandpa. The designs are all very colorful and playful that goes along with the theme of the story and introduces each new topic as it is listed. Text/Author Elements:The theme of this story is about young children and their relationship with their grandparents. It is told completely from the grandson’s perspective because many of the topics are relatable to young children such as eating things like ice cream and ketchup, the game of hide and seek, and doing summersaults. It shows that children are capable to caring for people just like their parents and grandparents do for them. The grandson is in complete control and is shown to care for his grandpa in every way. This story connects to the audience, which is young children but also parents and grandparents who are reading this book to their children or grandchildren. It provides a great way for them to bond and laugh together. This book is something that they are able to have in common.The book includes a great amount of creative elements starting from the very beginning when the back of the cover page and the first page are covered in paintings done by the grandson showing each activity that goes on in the story. Also, each step that is listed is something that a young child can very much relate too. They are very creative topics that are designed to capture the attention of the child and add a sense of humor. The mood of the story is very fun and lighthearted the whole way through. There is never a dull moment. It is very quick and precise because children are usually seen to be very energetic and excited about everything and while reading the story you are able to get a sense of that mood. Comments throughout the story such as; “Don’t worry. They always come back.” Then right away, ask him if he’s hungry.” It shows that he does not like wasting any time and everything is very to the point. There is not much character development with the grandson in the story. Throughout the entire story, he is shown to be energetic, and very capable of knowing how to take care of his grandpa. Although, there is a small amount of character development shown in the grandpa because from the beginning he seems to be very content and excited with the activities his grandson is providing. He then becomes very tired and seems to be exhausted from everything. Then, it is shown in his facial expressions and detail that he gets frustrated with this grandson. The story is then concluded with a very content grandson and grandfather. The author of this children’s book, Jean Reagan, wrote this book for her two children and their grandparents. In order to get the specific ideas for this story she directly asked and watched her children and her parents to decide what activities they mostly enjoy together. Although she was inspired by many other creative stories her children had to share, there just was not enough room for them all. Throughout the story, it does not include any page numbers. This book was published in 2012 and was such a success that became an inspiration for six other how-to series. A critic for the Deseret News, Marilou Sorensen, commented this on the book, Salt Lake City author Jean Reagan has captured the child voice with perfection. The relationship of little boy with his grandfather is real — no patronizing phrases tucked in by an adult trying to capture the child-like quality. There’s never subtle attempts to clarify who is babysitting who; the child reader will get it.Another critic, Kim Tomsic, from the Bookshelf Detective website adds, “HOW TO BABYSIT A GRANDPA by Jean Reagan (illustrated by Lee Wildish) is one of the most delightful picture books available in the market. With every page turn, parent and child will experience laughter and amusement. Furthermore, if the premise isn't enough to satisfy a reader (it is!), the gorgeous and amusing illustrations will surely win you over.”Design/Illustrative Elements: The author of the book How to Babysit a Grandpa is Jean Reagan. The illustrations in this book are very bright and colorful but also very soft and subtle. The text and story line are exciting and busy enough that the illustrations are better to be less flashy. None of the characters are very detailed but they do not need to be. You are able to understand the emotion and mood of each of them from the text itself. The style of illustrations in this story would be classified as, abstract. The illustrations are very unrealistic but also playful and fun as well. The characters bodies are not proportionate to a body in real life but add a sense of humor and silliness to the story. He says that the characters in the stories are his main focus when illustrating which is very obvious throughout this short story. Although there is not much detail, they are very well done and show the love and care between the grandpa and grandson. Most, if not all of the illustrations throughout this book are shown from the readers view point. In most of the pictures it is almost as if we are sitting right there with them. Although nothing is really done with very much detail, having the picture so close up gives a more interesting point of view because it is almost as if we are there with them analyzing what is going on. The main characters, the grandfather and the grandson, are the only two people shown throughout the story with the exception of the parents. Showing them leaving so that the grandfather and grandson are the only two people at the house. The illustrator, Lee Wildish, did a very good job with directing the reader’s attention to the most important part of the story, which are the activities that the grandson actually has his grandpa doing. It is explained in the text and then shown in the illustration, which gives us the ability to not have to imagine it in our heads and see it first hand. It gives a sense of emotion to the story and also humor. There are also other small illustrations added to each of the pages that the reader might not notice at first glance such as the plate of cookies, the cat, or the two lizards always making some sort of facial expression. For a child, that is a very exciting surprise to see those things being repeated throughout the story along with everything else that is going on. Although the facial expressions of each of the characters are not very detailed or distinct, you are able to understand the mood and attitude of each of the characters. Specifically the grandpa, from the beginning you are able to tell that he is very laid back, calm, and content with whatever is going to happen which Is very relatable to most grandparents from a young child’s point of view. The grandparents are usually very easy going with their young grandchildren because they are very intrigued with their creativity and energy. The illustrations show great exaggeration with the body parts of each of the characters. The grandfather is shown to be a bit larger and rounder and this gives a sense of comfort and love towards his character. Each character has very light facial features, which makes the story feel more easy-going and lighthearted. Lee Wildish, a freelance illustrator, is one of the most unique children’s book illustrators because he was one of the first to start trade publishing with a digital style. This was helpful to his illustrations because it allowed him to have the texture and quality of real art but the bright quality of the digital illustrations. This book reached the number two spot on the New York Times best seller list, won Crystal Kite Member Choice Award in 2013, and the Kids Independent next list award in 2012. Marilou Sorensen from the Desert News also included this about the illustrator, “Wildish’s animated, digitally created illustrations, even on the endpapers, complement this tender story and takes it one step further with additional characters (a kitten snoozing on grandpa’s head, lizards that appear in unlikely places) and interesting details.”A critic who wrote in depth about this children’s book on her blog commented, “The illustrator (Lee Wildish) did a wonderful job at displaying the story that Jean wrote. The characters drawn are warm and cuddle, and we all like their spaghetti legs. There are cute animals in the book too, and the jacket artwork (drawings the little boy did for his grandpa) is endearing.”Read Aloud: For the Read Aloud section, I read this story to the two young children I babysit for. They are two years old and four years old-the perfect age for this book. It is a very fun and exciting book to read to them because they particularly have a very good relationship with their grandparents and are always going over there to be “babysat” by them. They are able to find it humorous because they know that the roles are reversed in this story and the activities are things that they find interesting. They would laugh as I read the list of things to do while babysitting a grandpa. They would reply, “That is sooo silly!” They were easily able to point out the grandpa’s reaction to each of the activities. The first thing they both pointed out is, “We don’t babysit out grandpa!” How to Babysit A Grandpa by Jean Reagan is a very humorous, fun, exciting story that will attract the interest of any young child and also help to build a relationship between grandparents and their grandchildren. I enjoyed the how-to style writing because it made the story very humorous and enjoyable to read out loud. It is such a simple topic but was created into something very relatable to parents, grandparents, and young children. It was very accurate because the author’s children and their experiences inspired each subject with their grandparents. The illustrations added another element of love and excitement with the soft but bright colors and the small characters incorporated into each page."}, {"userName": "Bree", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/77116638-bree", "userReview": "Summary In this story, a little boy tells us how to properly babysit a grandpa. This includes what to eat for snack, what to do on a walk, how to play with grandpa, and how to put grandpa to sleep for nap time. Then they must clean up their mess and say goodbye to grandpa with a hug and a kiss and ask “when can I babysit you again?”ActivityWith a partner, think of activities and adventures you would like to go on while babysitting your Grandpa/Grandma. Think of what you would like to have for snack time or where you would like to go. CitationReagan, J. (2012). How to Babysit a Grandpa. New York, NY: Random House Children’s Books"}, {"userName": "Maya Gutierrez", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/76207843-maya-gutierrez", "userReview": "This easy to read picture book is about a little boy who takes the roll of a babysitter to take care of his grandpa when his parents leave. Throughout the book the little boy, who is also the narrator, plays with his grandpa, takes him for a walk, makes him take a nap, and even has him clean up before Mom and Dad come home. This is an adorable book for kids to read to make them feel no so young when being babysat by a relative. When I was reading this I couldn’t help to think about some of my super young cousins and the crazy things they get my grandparents to do"}, {"userName": "Dana Thomas", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/19916231-dana-thomas", "userReview": "This is a sweet book about a grandson \"babysitting\" his grandpa. It's a clever book and pretty true to what happens in our family when our parents watch the grandkids. Love to see my parents interact with my children and how my children react.I would have liked to see something a bit more gender neutral but understand it's a boy with his grandpa. But what about a girl with HER grandpa? Maybe another book is in store?"}, {"userName": "Maddie", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/82043424-maddie", "userReview": "This book is hilarious, as it takes the concept of a child being babysat and flips it on its head from the perspective of a little grandson. Adorably the child goes through all the proper steps of \"babysitting grandpa\" which are all traditional activities from the perspective of an adult reader. Much of the story-telling is told through the great illustrations that playfully match the text."}, {"userName": "Annabel Rodriguez", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/56773873-annabel-rodriguez", "userReview": "(review by 6 yo)It was hilarious. A kid's not supposed to babysit a grandpa and a grandpa is supposed to babysit a kid. Until Mom and Dad came back, they had fun. My favorite part was when they were playing a game where they can't touch the floor because sharks will eat your toes."}, {"userName": "Andria Davis", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/67703167-andria-davis", "userReview": "This is a book written from a little boy's perspective on how to babysit his grandpa. It explains the whole evening of things to do with him as you are babysittingI thought this book was very cute. I liked the story, I thought it was funny and the pictures are very colorful.(Picture Book)"}, {"userName": "AnneMarie", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/49522972-annemarie", "userReview": "This is such a cute book. My daughter and my dad aka her grandpa I swear are best friends. I read the book to her tonight and I can very much see them doing this in the future. So many cute ideas and just dead honest ways to have fun with grandpa without any cost just pure love and joy."}, {"userName": "Hααℓєу♡ Ƒιѕнєя", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/24458169-h", "userReview": "This book was really cute. I found it funny how grandpa did things a little more wildly than grandma in How to Babysit a Grandma."}, {"userName": "Maria", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/136271-maria", "userReview": "Preparation is always the key when babysitting grandparents... make sure to have their favorite treats on hand."}, {"userName": "Kathy Broadnax", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/23075859-kathy-broadnax", "userReview": "Fun read to children and grandchildren. Enjoyed"}, {"userName": "Santina Galati", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/76212538-santina-galati", "userReview": "Great book for a kindergarten class on the steps on how to write a 'how-to' book, listing steps!"}, {"userName": "Lorelai Wilkinson", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/35599187-lorelai-wilkinson", "userReview": "This book is a must read to your child. It has a story line that your child will think is hilarious and you'll easily find yourself chuckling at it with them."}, {"userName": "Stephanie - Adventures Thru Wonderland", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/15308827-stephanie---adventures-thru-wonderland", "userReview": "RTC"}, {"userName": "Alanna", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/12604678-alanna", "userReview": "Oh, my heart. This is one of those picture books that will make parents emotional."}, {"userName": "Laura Haske", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/2393530-laura-haske", "userReview": "We need an illustrator who portrays grandparents kids are used to seeing - young and active. Picture book grandparents always look so old. The concept of these books is cute."}, {"userName": "Rachel", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/69915832-rachel", "userReview": "Very cute"}], "description": "A New York Times bestselling picture book -- from the creators of the hilarious HOW TO... series -- about a child spending time with his grandpa. Written in a how-to style, the narrator gives important tips for \"babysitting\" a grandpa, including what to eat for snack (anything dipped in ketchup, ice cream topped with cookies, cookies topped with ice cream), what to do on a walk (find lizards and dandelion puffs, be on the lookout for puddles and sprinklers), and how to play with a grandpa (build a pirate cave, put on a scary play). Filled with humor, energy, and warmth, this is a great gift for or from a grandparent, and perfect for lap reading when Grandpa comes to visit!", "title": "How to Babysit a Grandpa", "url": "http://www.goodreads.com/book/show/12663253-how-to-babysit-a-grandpa", "average": 4.18, "cover": "https://images.gr-assets.com/books/1363877315l/12663253.jpg", "reviews": 256, "authors": [{"url": "https://www.goodreads.com/author/show/2930734.Jean_Reagan", "name": "Jean Reagan"}, {"url": "https://www.goodreads.com/author/show/1018954.Lee_Wildish", "name": "Lee Wildish"}], "type": ["Childrens", "Childrens", "Humor", "Family", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/12663253-how-to-babysit-a-grandpa", "http://www.goodreads.com/book/show/18142364-how-to-babysit-a-grandma", "http://www.goodreads.com/book/show/24904752-how-to-catch-santa", "http://www.goodreads.com/book/show/30422615-how-to-raise-a-mom", "http://www.goodreads.com/book/show/32671984-how-to-get-your-teacher-ready", "http://www.goodreads.com/book/show/22694053-how-to-surprise-a-dad", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}