{"ratings": 7518, "userreviews": [{"userName": "karen", "userReviewDate": "May 07, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "i give it a three even though i enjoyed reading it in a four star kind of way. the three star means there are better books by her out there, but that this one is fun, if imperfect. and its a shame, because she really tells a good story. this one was just a little too ambitious with what it was trying to squeeze in, and there were too many storylines that either didnt connect gracefully, or had to be absorbed by inference. does that make sense?? i am inarticulate. towards the end it gets especially bumpy with several tacked-on epilogue-y things that broke up my reading flow. in conclusion, this is like \"behind the scenes\", but with a more experimental form that kind of breaks it."}, {"userName": "Kim", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "I'm a big fan of Kate Atkinson's witty prose and oddball characters, but I have to admit that this novel had a degree of weirdness beyond that found in those of her novels which I have read to date. In a mix of first person and third person narratives, it tells the story of Isobel Fairfax, a teenage girl from a most peculiar family, who finds herself unaccountably slipping through pockets of time. And that's the most easily understood part of the plot, because as time goes on, Isobel's life becomes even stranger and increasingly out of control. It took a while for me to get into the novel, as I found myself initially as annoyed by Isobel's smart mouth and sulleness as I had been charmed by Ruby, the narrator in Behind the Scenes at the Museum. After a while, the narrative became more compelling - but almost unbearably sad - as the reasons for Isobel being the way she is became clearer. Well, sort of clearer, because in many ways what's true and what's not is never entirely resolved as the narrative skip between various realities (or possibly unrealities). The novel is scattered with literary allusions - the Shakespearean ones being the most obvious to me - and Atkinson's writing is rich in clever wordplay. But ultimately it's one of those works which is exhausting rather than completely satisfying and I can't help but wonder if lots of it went over my head. Overall, this was not an easy book to read and I can't say that the experience was one of unalloyed pleasure. The characters have haunted me though, so that says something about the power of Atkinson's prose. This isn't a book to read if you need a linear structure, an easily comprehensible plot or a really satisfactory resolution. On the other hand, if you think you come from a dysfunctional family then you haven't met Isobel's relatives and maybe you should make their acquaintance. Or maybe Isobel's family isn't so dysfunctional after all. At the end of the novel I wasn't entirely sure about that point. This was something good to share with my friend Jemidar, even if we didn't really know what was going on a lot of the time. If someone with a less interesting style had written the novel, I'm not sure whether I would have finished it or how I would have rated it. As it is, Atkinson's writing is impressive, but I don't like this novel nearly as much as Behind the Scenes at the Museum or her Jackson Brodie series. It therefore comes in at 3-1/2 stars."}, {"userName": "Jemidar", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/3446052-jemidar", "userReview": "I love Kate Atkinson but don't feel this novel is one of her best. Her prose style is still wonderful but this one seemed to lack her usual humour. In places I found it overwhelmingly sad and in others I was totally confused. The ending wasn't as satisfying as it might have been and I felt more than a little let down. Maybe when I've mulled it over a bit more I may feel differently. Still good though, if not particularly enjoyable because of difficult subject matter.Buddy read with Kim :-)."}, {"userName": "Elizabeth  ", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/546969-elizabeth", "userReview": "This book wants to be in a cage match with McEwan's Atonement, but, lacking confidence in itself, straps some badly explained timetravel to its breasts and tries to distract everyone.Incest! Timetravel! Stolen babies! More incest! Family history! Teenage debauchery! Groundhog Day! Murder! All that....and more. Coming up next on What The Actual Fuck Channel."}, {"userName": "Tarin Towers", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/12201535-tarin-towers", "userReview": "Have you ever read a comedy of manners that involves time travel? Or a Gothic novel that takes place in the 1960s? Or a coming-of-age story whose rites of passage include meeting Shakespeare, witnessing several murders, burning down a house, and turning into a tree?Kate Atkinson once again blew me away with this book. I had just finished reading \"Case Histories\" (5 stars), an unforgettable non-traditional mystery and expertly woven tale of identity and attachment, when I found \"Human Croquet\" on top of a phone box in my neighborhood. This copy has been read by a young adult who circled all the words she didn't know (quite a few in this very British book). I'm not giving this book 5 stars, but I would give it four-and-a-half if I could. There are a few spots where, even in a book of alternate universes, there are some consistency problems, and a few places where the writing gets bogged down in descriptions of either philosophy or trees. (Interesting place to get bogged down, can't see the forest for, etc.)But the humanity, humor, depth, charaterization, and attention to detail, as well as the caliber of the writing itself, make this a book I would recommend to anyone, particularly someone seeking a strong, teenage female heroine."}, {"userName": "Sibyl", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/4161436-sibyl", "userReview": "I read this book more or less at one sitting.I alternated between admiring this book - and getting quite cross with it. I thought it was a mess. But a brilliant one. On one level I admire the author's ambition. The book tries to be everything. It's a romance, a historical novel, a medidation on time and nature, a work of magic realism, a homage to Shakespearean comedy, and an inspired set of variations and improvisations.In places the writing is wonderfully noir, and there are sections which are pure farce. (The best parts are where Kate Atkinson is noir and funny at the same time.) I especially loved the section in which Isabel, thesixteen year old heroine attends a party at which Malcolm the object of her affections is present. There are several different versions of this party, each one more horrific than its predecessor.I didn't feel the book hung together, but I loved the author's fearlessness and ambition. It made me want to go back and reread 'Behind the Scenes at the Museum' - and to tackle her more recent novels"}, {"userName": "L.B.", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/4763124-l-b", "userReview": "I'm torn about this book. On one hand I loved it. It's an impressive book. The writing is fantastic, superb, unique. I mean, she is a master at her craft. The structure is outstanding and also unique. It was one of those books that kept me up past my bedtime reading. And I'd walk around the house thinking about these characters and what was happening to them and I'd say to my husband (or whoever would listen) \"This book is just so weird. Like, in a good way. One of the most unique things I've ever read.\"However, the explanation for all of the weird events in the book turned out to be the most cliched (not to mention a cop out) explanation ever and a total disappointment! I can't say what it is, because I don't want to spoil it. So, on one hand I'd give this book five stars, and on the other hand two stars, so I settled somewhere in the middle.And even after the disappointing ending, I just might read it again. Just for the experience of the prose."}, {"userName": "Magill", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/2884323-magill", "userReview": "This book certainly presents me with a conundrum. The good: the writing style - it a pleasure to read; so jam-packed that, what in other books might seem overdone, here it was relatively light-hearted and literate. The moderate: the initial light-heartedness of the narrative belied the delicate, familiar strains of melancholy and fate, as the characters were lost and had suffered loss and had never entirely recovered.The book is an interesting ... melange, I am not even entirely certain how to describe. There are segment headings of past and present, which is not unusual, with the young narrator, Isobel, in the present, while the past segments tell the family tale. The 1st 3rd of the book has a bit of seeming time travel, and general oddity, but nothing to cause concern. The next 3rd, becomes odder, and the past, sadder. The final 3rd becomes downright surreal, and the limits to suspension of disbelief are reached. The over-all resolution to the story is an interesting exercise but essentially deconstructs the entire story and unravels the sympathy created for the characters by re-creating different versions of events. This would be the not so good part of the book, to me. While an interesting exercise, it is not one which really emotionally engages the reader, but perhaps that was not the author's intention - maybe she wanted to play with time and perspective in a pseudo-magical realism kind of way.That being said, I still preferred this over \"Behind the Scenes at the Museum\"... for some reason, I think because of the lightness of the style and maybe because the unpleasantness of some of the characters were not revealed quite so early on... plenty of unhappiness to go round though."}, {"userName": "Gail Goetschius", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/7249636-gail-goetschius", "userReview": "I really enjoyed this book. It is well written and chock full of eccentric characters realistically rendered. I'm rather fond of teenage characters( all those years of teaching high school) and Isobel is an endearing narrator . Her wry and witty perceptions of life prevent the tragic experiences she encounters from becoming too overwhelmingly depressing.While I expected time travel to play a more significant role in the book it seemed almost an afterthought . I usually don't enjoy that type of thing but this was fun. I did get somewhat frustrated by all the alternate realities in the final quarter of the book. The traditionalist in me wanted to know the \"real\" story, but that is Atkinson's point...that lies with the storyteller who \"knows how it ends\".I particularly loved the title of the book. On one level it is fun to imagine a quaint and happy family playing the corny games in Mrs. Baxter's book of entertainments. It would certainly never happen in any of the drastically dysfunctional families in the novel. On another level Atkinson is playing Human Croquet with the reader. We are sent off in one direction, blind to other possibilities, when suddenly we are ordered to stop and are sent in an entirely different direction through a different hoop.Atkinson is a highly clever and creative writer. I'm definitely going to keep reading her."}, {"userName": "Kate George", "userReviewDate": "Aug 31, 2010", "userURL": "http://www.goodreads.com/user/show/3158166-kate-george", "userReview": "Here's the thing. I really enjoyed 'Case Histories,' and was looking forward to reading Human Croquet. Anticipated it.But here's the rub, and this is the spoiler so don't read past here if you don't want to know, I think it's very bad form to mislead your reader. Less than a third of the way through the story something happens that the reader isn't told about. We continue reading thinking we are still in real life, when in reality everything that happens from that point in the story only happens in the protagonist's head. It's a dream.It's a dream (or halucination) we and we arent' told it's a dream until the very end of the book. It's not real. And it's a cheat.Bad form, in my book.What would have cleared it was if Ms. Atikinson had told us the truth. If she had mentioned that our protagonist has hit by a falling tree, everything from there on out would have been okay with me. I wouldn't need to be told that the protagonist was unconcious. I would have been okay with any of the strange happenings, I only needed to be told that something happened.To leave out that fact, well I'll say it again: It's a cheat and it does a disservice to the reader."}, {"userName": "Siria", "userReviewDate": "Jul 21, 2009", "userURL": "http://www.goodreads.com/user/show/115473-siria", "userReview": "I think that if there was some kind of Project Runway for the literary set, Tim Gunn would have taken one look at this book and told Kate Atkinson to bring an editing eye to it. There are so many interesting elements to this—the humour, the meta elements, the mixture of history and imagination—but for me it failed to become a cohesive whole, experimenting with different forms but never quite settling on one of its own. I could see what Atkinson was aiming for—looking at how the stories change with the teller, how a storyteller can work to twist an audience's sympathy for or against one character or another—but at times she was too obtuse and at times too lacking in subtlety. Still, recommended if you're a fan of Atkinson's prose."}, {"userName": "Catie", "userReviewDate": "May 31, 2011", "userURL": "http://www.goodreads.com/user/show/5541450-catie", "userReview": "I loved this book. Infused with gothic melodrama, darkly comic and yet wistful, literate and playful. The narrator is deeply unreliable so those readers who prefer a straight tale will probably not like it although the book is an enthralling page turner. Yummy"}, {"userName": "Katie", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/3600468-katie", "userReview": "Human Croquet is narrated by Isobel Fairfax and is the story of her family and their neighbours in the village of Lythe. Isobel and Charles’ exotic mother disappeared when they were very young, followed soon after by their father, leaving the children in the care of their steely, old fashioned grandmother and their irascible Aunt Vinny. Even after their father returns several years later no one seems willing to talk about what happened or why. In fact, lots of people in Lythe are hiding things and keeping secrets to themselves, not least Isobel, who keeps finding herself slipping into other periods of time without any explanation.This is in many ways a very odd book, but it was exactly my kind of odd. My family and I have always played word games and twisted phrases around on themselves, so Isobel’s narration reads rather like I think. The text is peppered with her humorous asides in which she pokes fun at herself: \"He runs a hand through his dark curls and brushes them away from his handsome forehead, ‘You’re a good pal, Iz,’ he sighs. I am his friend, his ‘pal’, his ‘chum’ — more like a tin of dog food than a member of the female sex, certainly not the object of his desire.\"At other people: \"Malcolm Lovat. If I am to have a birthday wish it must be him. He is what I want for birthday and Christmas and best, what I want more than anything in the dark world and wide. Even his name hints at romance and kindness (Lovat, not Malcolm).\"And, probably my favourite, when she takes common idiomatic phrases to absurd (yet also supremely logical) lengths: \"‘I’m just marking time at Temple’s,’ Charles says, in explanation of his remarkably dull outer life. (Ah, but what does he give it? B-? C+? He should be careful, one day time might mark him. ‘Och, without doubt,’ Mrs Baxter says, ‘that’s the final reckoning.’)\"Isabel’s narration is something that I suspect a reader will either love or hate, but for me it was one of the book’s main attractions.Another aspect of the book that I particularly enjoyed is the way that Atkinson plays around with motifs from fairy tales (Cinderella and Hansel and Gretel spring to mind immediately as examples). She gives the well-known stories subtle nods without ever explicitly copying them, in a way that suggests that all is not quite as it seems. I found it simultaneously reassuringly familiar as I recognised elements of particular stories and unbalancing as what I knew of those stories indicated that things were not going to go as I expected, which is really how the whole novel works: fundamentally a story about family relationships, it is quite happy to have characters turning into dogs or time travelling without any indication that this is somehow unusual.Atkinson has an approach to writing about different time streams which I have never come across before, but is so wonderfully simple I wonder why it’s not more common. When Isobel is talking about events taking place in the main timeline of the novel, she writes in the present tense; when she narrates scenes from earlier on in her life, they are written in the past tense. The clear definition between what has happened and what is happening is particularly helpful given how confusing and uncertain the reality of the present becomes, and I found the technique to be a good one. Given my dislike of present tense narratives I was surprised by this. It turns out that I quite enjoy the present tense when it is used in a carefully considered manner and employed effectively.Human Croquet is a bizarre and wonderful book which I suspect readers will either love as unreservedly as I did or find very odd indeed. Either way, it’s definitely worth trying."}, {"userName": "K", "userReviewDate": "Aug 06, 2009", "userURL": "http://www.goodreads.com/user/show/13779-k", "userReview": "While this book wasn't quite as good as Behind the Scenes at the Museum A Novel, it had many of its strong points -- excellent writing and characterization, acerbic wit, good pacing, etc. It was also more creative and postmodern, which I found to be both a strength and a weakness. Sixteen-year-old Isobel is a member of the Fairfax family, a long line of cursed individuals. And Isobel's life, like that of her predecessors certainly is miserable. Her mother disappeared permanently when she was young, and she continues to hope for her return as she struggles with becoming a woman and fantasizes about having a mother's guidance. Her father disappeared shortly after her mother, leaving young Isobel and her brother Charles to be raised by a crabby divorced aunt. Her father does return seven years later, but with an unlikeable wife who is becoming increasingly eccentric. In short, none of the adults in Isobel's life seem particularly invested in her, with the exception of her neighbor Mrs. Baxter, who has serious problems of her own. Isobel's older brother Charles leads a dead-end life and frequently retreats into a fantasy world. And then there's Isobel herself, struggling with adolescent unrequited love on top of everything else as she tries to make sense of her life, an effort which is hampered by a disturbing tendency to find herself going back in time unexpectedly and discovering alternate versions of her past, and even her present. I usually hate postmodern stuff, so I was pleasantly surprised when the constant alternate realities didn't bother me. There's still that stick-in-the-mud part of me that would have preferred a more coherent story, but I didn't feel nearly as strongly about that as I usually do. I actually enjoyed reading the book a lot. I did find parts of the story line overly dark, though, which I've come to expect from Atkinson but still found disturbing -- way too much incest, adultery, and Machiavellianism for my tastes. That's why, despite its great qualities, I could only give this four stars. But if you like Atkinson, you'll definitely like this one."}, {"userName": "Mónica Mar", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/19783066-m-nica-mar", "userReview": "Muchas reseñas señalan que Atkinson tiene novelas mejores, opiniones que no puedo respaldar puesto que apenas me inicio en los placeres de su prosa, pero sí puedo dar fe de que Juegos de interior no es una novela fácil de catalogar, y mucho menos de describir. Aunque corta, es robustecida por las múltiples historias que cuenta: historias sobre el comienzo del mundo y sobre su final; historias sobre deslices entre los entramados del tiempo; la historia de la génesis de una familia inglesa cuya estirpe cultiva extrañas relaciones con el bosque que los circunda y que ha logrado permanecer casi que enraizada en el mismo lugar pese a la naturaleza trashumante de sus miembros, el más joven de ellos una chica de dieciséis años llamada Isobel, la narradora principal. Isobel es una narradora nada confiable, pero su verbo almibarado, entremezclado con sus inclinaciones botánicas, físicas y metafísicas hacen de su narración un canturreo casi irresistible. La prosa de Atkinson es admirable, de una belleza sin esfuerzo, pulcra y sugestiva, dulce y engatusadora. Un narrador omnisciente le arrebata la palabra a Isobel para bambolearse hacia atrás en el tiempo, llenando los vacíos que esta deja, haciendo la historia un tanto densa, pero satisfaciendo el deseo de saber más, de responder cómos y porqués. Al final, la novela es corta, demasiado corta."}, {"userName": "Melissa", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/2327397-melissa", "userReview": "If you loved Atkinson's Life After Life or John Crowley's Little, Big, you have to read this immediately. The jacket copy hooked me like crazy, but the book isn't exactly as advertised. It's just as good, though weirder and more impressionistic than I expected--but with enough threads of story to keep me hooked. I'm a plot junkie, but in Atkinson's hands I enjoyed the flights of micro-to-macro, universe-spanning fancy nearly as much as finding out \"what happens next.\" Even when she's not writing about magic, her writing is magic.I enjoy the Jackson Brodie books, but I'm crossing my fingers she wraps them up and devotes herself, monklike, to these strange and luminous standalones."}, {"userName": "Julie Christine", "userReviewDate": "Jun 18, 2008", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "Surreal but grounded, quirky but not frivolous, endearing and sad- this is a mystery of lost identity, lost souls, crimes of passion, time warps and warped minds. It's delicious, clever, unsettling, grim and guffaw-inducing. Atkinson is a category unto herself."}, {"userName": "Vityska", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/44040570-vityska", "userReview": "У випадку з детективами Кейт Аткінсон затерта метафора про скелети в родинних шафах більш ніж доречна. Вони, ці скелети, у шафках і креденсах, схоже, лежать штабелями. І щойно читач необережно проходить повз них, вивалюються йому на голову. Навіть якщо читач затулятиметься руками й гукатиме: \"Годі, я не хочу більше нічого знати!\" - авторка його не пощадить. Принаймні, у \"Людському крокеті\" саме так: ти муситимеш дізнатися усі таємниці роду Ферфаксів довжиною у 300 років і його відгалужень, хочеш ти цього чи ні. Все починається як історія 16-річної Ізобель. За свій недовгий вік вона вже наковталася всілякого - то мама зникла, то тато пропав, потім, правда, повернувся, але з \"новою мамкою\". А ця новозеландська простакувата \"мамка\" Деббі - геть нерівня вишуканій Елайзі, їхній справжній мамі, яка так зникла, кажуть - втекла. Правда, й образ Елайзи геть вивітрився з пам'яті дітей. Ізобель і її брат Чарльз (рудий, веснянкуватий, некрасивий, дослідник загадкового і надприродного) намагаються сконструювати образ мами з деталей і артефактів, які час від часу знаходять у домі. От тільки справжня причина маминої \"втечі\" куди жахливіша версій про банальний адьюльтер. Взагалі це дуже заплутана історія, яка розвивається у кількох площинах - минуле, від початку часів і від першої леді Ферфакс, через усі гілки роду аж до Ізобель. Флешбеки не завжди пов'язані з оповіддю-в-реальному-часі.Ба більше, те, що відбувається \"тут-і-тепер\" - не завжди відбувається в реальності. На героїню (а відтак і на читача) читають розриви часо-просторового континіуму, паралельні реальності і безліч інших химер. А ще це дуже жіночий роман. Бо саме жінки - представниці різних поколінь сімейства і не тільки - головні рушії, сильні персонажі...і головні жертви у всій цій історії. Хотіла написати, що \"жіноче щастя- це не про них\", але зрозуміла, що вони просто далекі від звичайного людського щастя. Чим більше замкнених скриньох родинних історій відкривається перед тобою - тим більше з них виходить прикростей і горя. Інцести ведуть хоровод за руки з насильством у сім'ї, викрадення сусідять із вбивствами. Гріхи верховодять, гріхи (власні чи батьківські) змінюють життя. Під кінець хочеться кричати. Хоча авторка завершує оповідь майже оптимістично. Важливим плюсиком є прекрасний стиль оповіді. Це така вишукана суміш шекспірівської лірики і підліткового цинізму, де компоненти взаємно врівноважують одне одного. Не знаю жодного подібного тексту, якому вдалося б настільки вдало поєднати речі з зовсім різних площин. А ще цей текст повний несподіванок. Тому не дивуйтеся, що зустрінете на його сторінках самого містера Шекспіра. І не дивуйтеся, коли космологічні роздуми раптом перетворяться у закручений детектив. І будьте уважні - до людей і до імен. Одне із них, побіжно згадане лише раз, виявиться вкрай важливим для розуміння того, що ж там, в біса, сталося."}, {"userName": "Susanna Rautio", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/14889609-susanna-rautio", "userReview": "Ihanat hetket Kate Atkinsonin kirjojen parissa jatkuvat.Ihmiskrokettia on pääasiassa teini-ikäisen Isobel Fairfaxin tarina. Isobel on äiditön, ja vuosia jopa isätön, ja siksi vähän kadoksissa ja paljon omissa maailmoissaan.Ihmiskroketissa hieman kesti ennen kuin tarina pääsi vauhtiin. Ajattelin: nyt Atkinson vasta lämmittelee tulevia huippukirjoja varten.Vauhtiin päästyään Ihmiskroketti tarjosi parasta Atkinsonia. Isobelin tarinaan limittyvät vanhempien ja monien muiden kohtalot, niiden eri variaatiot ja jos-olisikin-tapahtunut-näin -muunnelmat. Tuttujen ihmisten taustoista paljastuu salaisuuksia. Tuntemattomaksi jääneet eivät enää olekaan niin vieraita ja etäisiä.Hypätään menneisyyteen, liikutaan ajassa ja unessa kiihtyvällä tahdissa ja lopussa vedetään yhteen myös tulevaisuus.Murhataan, kuollaan, rakastutaan, petetään, petytään ja selvitään. Voi mikä unohtumaton sekasotku!Olen aika lailla kirjan pauloissa vieläkin. Suosittelen kunhan muistat odotella: alun jälkeen paranee ja huimasti!"}, {"userName": "Laila (BigReadingLife)", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/117593-laila-bigreadinglife", "userReview": "Dazzling and weird. Part fantasy, part coming of age story set in England mostly in the 1960's (but with a sprinkling of time travel/alternate lives here and there.) Really playful writing but also sad. Incredibly readable. I'm going to have a hard time writing a post about this one. But I really liked it. AND it's a book I own, huzzah! It's been on my shelf for years now - that feels like a victory. I liked this one *much* better than Atkinson's first novel, Behind the Scenes at the Museum."}, {"userName": "C.", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/10501026-c", "userReview": "We need a better feedback scale, 10 stars. The 4 I admiringly bestow \"Human Croquet\", 1997, have no delineation from lesser books. I felt the heady enthusiasm of 5 stars for 70%. Kate writes with an enthralling stream of consciousness, achieving a juggernaut saga that is never boring. We are ensconced empathetically in Isobel's mind. Although we soar through erratic flashes and timeframes, a riveting mystery centres us. Even when we learn Eliza Fairfax's whereabouts, the experience keeps feeling like a rush without pause, for that 70%.Kate begins closing her voluminous storylines by enlightening us with nearly all information. Their number isn't the only thing making this a dense exercise. Cerebral and comical asides flit through them, then alternative outcomes suddenly flare up. They are creative and entertaining but with all of the author's undertakings considered, there is no possibility for a climactic, surging conclusion. The lids need to be closed on so many jars, a tamer, gradual denouement ensues. I needed the spotlight enhanced in some places rather than others and would have handled focus-allocation differently.This novel is adult despite featuring sister and brother in a wild mix of relatives and neighbours. It is intelligent, thematic, and refreshingly astute. Knowing I was excited at the rate of 5 stars for most of this creative journey, these are 4 stars at their highest. I think the best compliment one can give is: I have never read a novel like this and it is true! Thanks to a friend's gift of a newer Kate Atkinson novel that I look forward to reading, I dug out this one. I have had it a long time, not knowing it was this good. It exceeds its synopsis by far, which gave too feeble an impression of how much I would enjoy this."}, {"userName": "Sherry", "userReviewDate": "Dec 10, 2009", "userURL": "http://www.goodreads.com/user/show/193297-sherry", "userReview": "Kate Atkinson is an excellent writer. I've read Behind the Scenes at the Museum twice and all the Jackson Brody books. Human Croquet is her second book and deals with a young girl who has an odd habit of time-travelling, or does she? Human croquet is a game using people as hoops, balls (blindfolded) and controllers. Atkinson never has her characters play it, but she alludes to it often. In the book, Atkinson is the controller, bowling her characters this way and that, having them carom off each other in unexpected ways, taking them in different directions. Her wit is sharp and original, her writing breezy and charming, even though she is dealing with very serious stuff here. She is the master of the aside. I was reminded of Dickens, Midsummer's Night Dream, and Ground Hog Day."}, {"userName": "Jennifer", "userReviewDate": "Aug 21, 2007", "userURL": "http://www.goodreads.com/user/show/299397-jennifer", "userReview": "I adore Kate Atkinson and enjoyed the humor in this book. The story focuses on a girl in a small (and quite odd) family. She grows up amid a mysterious set of neighbors and relations, dreaming that her dead mother will return to help her through puberty (among other things). As if that were not enough, she also has an odd, uncontrollable habit of time-traveling. Though the story isn't as riveting as Behind the Scenes at the Museum (my favorite Atkinson novel), Atkinson's witty voice is very entertaining."}, {"userName": "Dark-Draco", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/18484922-dark-draco", "userReview": "I don't know any other author that can write about such detestable people, yet hooks you so completely that you just have to keep on reading. And the Fairfax's, and their neighbours, just aren't that nice. From a murderous father, a child-beating teacher, a neglectful Auntie, a lying grandmother, an absent mother, not to mention potential rapists, abandoned babies and neglected pets. Or are they?Because this is what this book does so well. Isobel, the main narrator, is a strange child - does she really slip between different times and different versions of her world, does she just have a fantastic imagination, or is she hallucinating while in a coma? Having read many a science-fiction novel that sort of deals with the same thing, I find that this one is one of the best - maybe because it is subtle, with no real answers and a whole atmosphere of other-worldliness that I love.The language and writing is excellent, and that's what keeps you reading, even if what you are reading is kind of hard to take. Isobel isn't so perfect herself, and while she criticises those around her so harshly, there are times that you just want to shake her and tell her to get on with it. But you can also understand where she is coming from - in her world (whether real or not), she's had a tough and weird upbringing, so the fact that she isn't all ok makes sense. A lovely read - worth picking up."}, {"userName": "Marijan", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/6193829-marijan", "userReview": "[I mean the whole fact that much of the book is just in the comatose imagination of Isobel so that the time travelling seems in retrospect kind of senseless. (hide spoiler)]"}, {"userName": "Carolynj", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/19127407-carolynj", "userReview": "Notes for ‘Human Croquet by Kate AtkinsonIt was a book where it helped to be familiar with Atkinson’s style. It was written between \"Behind the scenes at the museum\" and \"Life after Life\", and thematically the three novels follow each other and develop the underlying tropes as they go. That is not to say that the novels are a trilogy, the characters are not the same. Not the same in the story sense, but they are the same in the sense of a representative type. Atkinson does not disappoint, as always, her characters are deliciously appalling , unlikeable people, horribly flawed. Characters just like us readers and the people with whom we come into contact every day. Characters that have dark thoughts and inexplicable corners of the mind where reality and imagination merge to form alternative realities. \"Human Croquet\" runs riot on the theme of alternative realities as a precursor to Life after Life and gives the protagonist a more active role in the ‘time skip’ and family history theme than she had in \"Behind the Scenes\". I found it a more challenging read than both other novels, so a newcomer to Atkinson might be a bit confused and find it hard going, not to say unsatisfactory. One really has to ‘get’ Atkinson’s style to appreciate the finesse and genius of the writing. Sentence by sentence it is beautiful stand alone prose, sentences put together to make sense of a plot requires memory and analysis of the prose sentence by sentence. But it is worth the work. If one was expecting a novel of historical fiction or romance, forget it. The historical background is incidental to the themes of the psychological study of the time dimension, the horribly flawed human condition, predestination, abandonment, alienation and general futility of life. It is overtly brutal in some places, more subtly so in others which make these more disturbing. The tree imagery and food imagery sometimes feels over-cooked, but on reflection, this is not so, it has many layers and levels that can easily be missed. The woods, the forest and the trees are the real story, the characters are the trees. Some may find the ending device unsatisfactory and a disappointment. At first I would have agreed with this, even let out and audible groan. However, on reading on to the concluding chapters I realised that I had missed the utter brilliance of the underlying imagery, and that there would be no other real option (in a general sense, the particulars of course could have given different scenarios)to reunite reality and unreality/imagination/distorted reality. So much so, I have gone back to the beginning to re-read, and in doing so, am amazed at the absolute jaw dropping integrity of the whole novel. These Atkinson novels are always worth a few reads to really appreciate the nuances and how it is all put together. While many readers would not think it worth the study, others will find them almost life changing, and many will even find some psychological reassurance. I have tried to write this review without referring too much to the plot-lines or explanations as I see them in order to avoid spoiling this for other readers. There is so much that could be said in analysis, critique and appreciation."}, {"userName": "Carl R.", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/9314075-carl-r", "userReview": "Human Croquet is as good as Life After Life, which is right up there with my top fifty of all time. Kate Atkinson once again plays wondrous games with time and place, moving from era to century to event as she explores multiple levels of character and consciousness.Isobel Fairfax is the teen-age daughter of Gordon and Eliza Fairfax, living in a house situated near a wood named Arden. All conveniently coincidental, since Fairfax was once Shakespeare's patron, and the area was once part of his estate, and the mysterious, magical wood from As You Like It is also named Arden, and the initials \"WS\" are carved into an ancient oak on the estate. Of course there was a servant with the same initials in the Fairfax household, so there's considerable doubt about the provenance of the initials, but the locals believe what they want.Lots of stuff happens in Arden during the course of Human Croquet. Some of them happen several times, and Isobel keeps falling into different periods of history and either participating or observing the events. It's not just a science fiction/fantasy trick Atkinson is playing, though. \"Izzy\" is a complex creature. She's inordinately tall for a girl, even sliding toward the buxom. She's starved for love, both romantic and parental. Her mother--always treated with great hostility by the rest of the family--disappeared when Izzy was quite young. She yearns for her both her maternal attentions and her motives for leaving. As she wanders involuntarily into this or that time warp, she witnesses everything from infidelity to murder. Neither she nor we are sure what is real and what is not. No bigger Shakespeare theme than that. Especially when you throw in an amateur production of Midsummer Night's Dream into the equation.And you can't for get the lost-then-found father. Or the obese stepmother (there was a lost mother and an obese mother in Emotionally Weird, too. I'm sure a Kate Atkinson scholar could tell me what's up with that, but oh, well.)Way too many elements for most writers to handle, but not our Kate. In the end, we have both clarity and ambiguity, Along the way we have mystery, excitement, suspense, delicious language, and the kind of thrilling reading experience we've come to expect from Kate Atkinson. Yum."}, {"userName": "Meredith", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/1237462-meredith", "userReview": "6/2015: Just came across some notes from when I read this.They are the notes of a younger me, and I cannot defend them as I don't really remember the book (other than the cat sleeping thing (q.v. below)). \"This is a surreal journey through the life of a suburban English teenager and her family. As eccentric as they appear throughout the book, the ultimate feeling is that they are just as normal as everyone else, or that everyone else is just as eccentric. I was charmed by the voice of this girl. Recurring contemplations on the phrases surrounding the use of time: spending time, taking time, saving time (in banks of wild thyme), And the idea of people disappearing from their lives - for various reasons. Or remaining in their lives when they should disappear. Check out an Ambrose Bierce essay entitled 'The Difficulty of Crossing a Field'. The characterizations are ones to be emulated. There's a one-page introduction to the narrator's friend Eunice that recreates this girl in full color, and then a description of her Aunt Vinny's closet, focusing on shoes, which nails that character. Trees as motif. Human croquet: line up human subjects and let them go, set the stage and start the action, with uncertain but interconnected results.\"Quote from the book:\"Vinny is covered in Cats, like someone in a surreal film - three on her lap, one draped around her shoulders, one at her feet. I half-expect to see one on her head in a minute. ...(Why do cats sleep so much? Perhaps they've been trusted with some major cosmis task, an essential law of physics - such as: if there are less than five million cats sleeping at any one time the world will stop spinning. So that when you look at them and think, 'what a lazy, good-for-nothing animal', they are, in fact, working very, very hard.)\"This (I know, like the Red King) has stuck with me, and I frequently note it when regarding my sleeping cats: \"they're working so hard\"."}, {"userName": "Jessie", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/38239112-jessie", "userReview": "I picked this up after reading 'Life After Life,' which I first found very confusing, then slightly boring, then amazing. Reading 'Human Croquet' caused similar feelings in a different order (boring-->amazing-->confusing), which is fitting because Atkinson messes with time, order, reality, and perception quite often. Sound confusing? It is. I really, really loved Atkinson's prose in 'Life After Life' and even though I found it confusing initially, it all came together in the end and I was haunted by it for days. 'Human Croquet' doesn't really make much sense once it all comes together, or throughout most of it for that matter. It's a bit slow at times and there are way too many threads that don't get weaved together, but overall Atkinson's incredibly original style and beautiful prose (mostly) make up for it. I will read some of her other works, but take a break from her first...I'm okay with rule-breakers as far as order/time/perception go, but *some* semblance of a beginning/middle/end would be nice.Also know that this book has some pretty dark elements (incest, abuse, murder) that I wasn't quite expecting...it's more depressing than I thought it would be. The 'about this book' blurb makes it seem like the time travel/Shakespeare element will be much more central to the plot than it actually is."}, {"userName": "D", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/3299393-d", "userReview": "I've not read any other of Kate Atkinson's books. She apparently has a large, enthusiastic following; although many of those folks did say that this is not her best work.I enjoyed her writing tone, her sentence structure, the rich vocabulary that she employs to good effect. But I'm apparently too literal in my view of the world around me to appreciate, or certainly to follow, a book that has as many abrupt twists and turns as this one. I did not find it easy or entertaining to try to disern between the present and literal, the present and fantasy, characters in the present employing time travel without the benefit [for me] of flashing signs, or at least, cue cards that clearly state \"Attention: Time Travel Sequence!\" or something similar. Once I got to the end of the book, I realized I would have to re-read it in its entirety to sort out who it was that really died, by whose hand, and when; and then realized I didn't care enough to put that effort into it.It may be a wonderful book, worthy of much higher than 2 stars, but you couldn't prove it by me."}], "description": "Part fairy tale, part mystery, part coming-of-age novel, this novel tells the story of Isobel Fairfax, a girl growing up in Lythe, a typical 1960s British suburb. But Lythe was once the heart of an Elizabethan feudal estate and home to a young English tutor named William Shakespeare, and as Isobel investigates the strange history of her family, her neighbors, and her village, she occasionally gets caught in Shakespearean time warps. Meanwhile, she gets closer to the shocking truths about her missing mother, her war-hero father, and the hidden lives of her close friends and classmates. A stunning feat of imagination and storytelling, Kate Atkinson's Human Croquet is rich with the disappointments and possibilities every family shares.", "title": "Human Croquet", "url": "http://www.goodreads.com/book/show/28945.Human_Croquet", "average": 3.71, "cover": "https://images.gr-assets.com/books/1506972271l/28945.jpg", "reviews": 599, "authors": [{"url": "https://www.goodreads.com/author/show/10015.Kate_Atkinson", "name": "Kate Atkinson"}], "type": ["Fiction", "Fantasy", "Historical", "Contemporary", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/28945.Human_Croquet", "http://www.goodreads.com/book/show/41688.Human_Croquet", "http://www.goodreads.com/book/show/930976.Human_Croquet", "http://www.goodreads.com/book/show/1793735.Human_Croquet", "http://www.goodreads.com/book/show/11344878-human-croquet", "http://www.goodreads.com/book/show/1196002.Human_Croquet", "http://www.goodreads.com/book/show/27281274", "http://www.goodreads.com/book/show/17160685-ihmiskrokettia", "http://www.goodreads.com/book/show/36681905-human-croquet", "http://www.goodreads.com/book/show/18881646-human-croquet", "http://www.goodreads.com/book/show/15790842-life-after-life", "http://www.goodreads.com/book/show/16243.Case_Histories", "http://www.goodreads.com/book/show/3722183-a-god-in-ruins", "http://www.goodreads.com/book/show/3289281-when-will-there-be-good-news", "http://www.goodreads.com/book/show/7307795-started-early-took-my-dog", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}