{"ratings": 4060, "userreviews": [{"userName": "Chris Horsefield", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/14058695-chris-horsefield", "userReview": "So far out of the Young James Bond series, this is by far the best. It’s long, action packed and you really get into the book. I was upset when I had finished this, I loved it."}, {"userName": "Aaron", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/1196851-aaron", "userReview": "The Young Bond series presents the story of what happened to James Bond during his teen years. After the events of the previous book, James is still recovering from his injuries, and is taking a semester off from Eton. His Aunt Charmian had a schedule expedition in the jungles of Mexico and has decided to bring him along. While she does her assignment, James is going to be staying with her friend Jack Stone, a former flying ace from the war.Just as they are arriving, a hurricane comes ashore. Jack Stone offers to fly Charmian out to her expedition with the hopes that she can make it before things go bad. James will remain in the Stone mansion with Jack's children: Precious, a girl his own age with quite the empress complex, and JJ, a sweet kid who just wants someone to play with. As the storm is coming ashore, the Stone estate gets some company.A group of thieves have decided to try and take advantage of the storm to take Jack Stone's safe. They are a bit disappointed that Stone is not there and decide to take Stone's children along for the ride. James, pretending to be a local hoodlum, goes along for the ride in the hopes of saving the kids and recovering the stolen goods.Off the coast of Mexico is the island of Lagrimas Negras, which has become a hideaway for a number of scary criminals. To stay in the haven all they have to do is turn over a huge amount of funds to El Huracan, the \"governor\" of the island. The only problem is that no one leaves the island once they arrive. The idea is to protect the sanctity of the haven. The only way to get off is through an obstacle course, called La Avenida de la Muerte (the Avenue of Death) that follows a theme related to the ancient Mayan gods. No one has ever completed the gauntlet before.As you can probably guess, James will find his way onto Lagrimas Negras in the course of his adventures in Mexico. The only way he is going to get to save the girl, recover the treasure, and get out alive is take the challenge of the gauntlet.This, the fourth volume, is a nice addition to the series. Like the earlier novels, it is a typical Bond story, full of action, deception, and a quick pace. The series is a bit more challenging than the Alex Rider series by Anthony Horowitz, but they are just as good."}, {"userName": "Kate", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/13672657-kate", "userReview": "I decided to read this book because I had read the first ones in the series and really wanted to read to this one so when I saw it in the library I as over the moon and got it out instantly.This book fits under the category of ‘a book with a male main character’. I think that this is a great category as a lot of books fit under it and it gives a wide range of freedom. I like reading books about male main characters, as they are more out going in the dangerous side of things. For example James faces a crocodile and a jaguar just to get of an island, as it was the only way. “When Manny turned his head, James could see that he was badly injured. A section of his skull above his right ear had broken away and was hanging loose, still attached by a flap of hair-covered skin.As he moved, the flap swung backwards and forwards like a door opening and closing. And as it opened it revealed a glistening patch of pinkish-grey brain behind a rubbery membrane.\" I like how he describes his skull as it means that you can imagine it and it is a vivid image. The phrase 'a rubbery membrane' makes you feel as if you can touch it and feel the brain through the jelly like surface. This is just one of the many sections in the book that I have really enjoyed and I couldn't stop myself from reading it and all my free time I would be reading. I learnt from this book a bit about the landscape of Mexico and what it looks like. Vera Cruz is on the cost of Mexico and is close to the jungle around the old ruins of the lost city. The big cities in Mexico and separated by vast amounts of farmland and no mans land with little villages in-between them."}, {"userName": "Colin Gibson", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/3238101-colin-gibson", "userReview": "This is by far the best young James Bond book. It is a little like Skeleton Key the Alex Rider book, but its better, the book is very long.The story takes us to Mexico where a hurricane devistates the community and forces James to look after a young girl he ends up getting feelings for.Then we end up on a tropical island owned by the bad guys. The story is great and my favorite Young Bond book."}, {"userName": "Mariam Abood", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/32718728-mariam-abood", "userReview": "I'm not going to lie, I can't understand why this is the highest rated book in the series on goodreads. I thought it was the worst. I can only put it down to people giving up on the series by Double or Die, because I bloody well did.This book was just boring, I couldn't even finish it, I was just bored out of my skull."}, {"userName": "K.C.", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/71745210-k-c", "userReview": "This was a great action book. A little gory here and there, but nothing we can’t handle, right? Overall, I would very much recommend this book to others."}, {"userName": "Tysen", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/61576721-tysen", "userReview": "I thought this book was good in all sorts of ways. Charlie Higson explained everything thoroughly and with precise details. Of course they have new characters in every book and the way they brought the new ones into this story was amazing, one of the best ways to start the adventure with James Bond and his new friends. El Huracan, the man who tried to kill James, has made an island for criminals, the only thing is the only way of the island is through the death valley. The governments know about this place because it is actually an easy way to keep criminals off the street and keep them from killing people. Charlie Higson made James Bond go through a battle of a lifetime with him, an awesome adventure."}, {"userName": "Janaan", "userReviewDate": "Nov 06, 2011", "userURL": "http://www.goodreads.com/user/show/6470754-janaan", "userReview": "This book was amazing! I picked this book, because I already read the other books in the Young Bond Series, and I gave all of them 5 stars. This book is about how James Bond is taking a vacation in Mexico. He has to babysit 2 snobby kids of an ex-ace pilot. But soon after the pilot and James aunt was gone, a couple of criminal tourists attack and rob the mansion James Bond was staying in. But a giant storm wrecks the mansion, before the tourists can. James takes the kids to saftey. They travel all across the Mexican Jungle, to find saftey, all the while being chased by the tourists. Their adventure takes them from the city, to the Jungles, to the sea, and to a rumored island for criminals. I finished this book, because I wanted to find out what this island really was. I would recommend this book for anyone who wants to read an adventerous book!"}, {"userName": "Ms. Myers", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/12745304-ms-myers", "userReview": "The book is about bond as a young teen and he is on this island with a whole bunch of criminals who are hiding in paradise and nobody even knows about the island because it is kept a secret by el hurricane. It is very interesting if you are an action seeker. It is a sci-fi like book. The setting is a top secret island where criminals come to hide in paradise. The characters are James bond, el hurricane, Robert king, Dum-Dum white, And Luis Chavez. It is a really thrilling book if you are an action seeker.i liked it a-lot because it is a really good book about bond as a teen killer.other people who should read it is people who are really into James bond related stuff. Hurricane gold  Charlie Higson"}, {"userName": "Christopher", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/1072244-christopher", "userReview": "I have been reading this series with my 10 year old son and he finds them fascinating. Higson has struck the perfect chord; combining just enough complexity, plot twists, historical information, suspense, and even some Bond style violence, to make these novels real page turners and a wonderful father/son activity. The series takes place before the second world war so there is excellently handled prescient references to Nazis, Communists, and the European stage. True to Ian Flemming's Bond to come, Silverfin has some Dr. No type characters that are into some biological master race stuff - nasty as can be."}, {"userName": "Wyatt", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/20602967-wyatt", "userReview": "Another enjoyable installment of Young James Bond from Charlie Higson - this time highlighting another seldom-visited location (for the adult Bond, that is) Mexico and the Mayan ruins at Palenque, in addition to the fictitious island of Lagrimas Negras. We also see the Bond character's introduction to jiu-jitsu."}, {"userName": "Antonia", "userReviewDate": "Feb 04, 2010", "userURL": "http://www.goodreads.com/user/show/3131253-antonia", "userReview": "exotic setting and all the ingredients for a proper james bond adventure. the girl was terrific in all senses of the word and the whole story worked well, if a bit \"off the wall\". as are most james bond films / books anyway. can't go wrong with this series. marvellous."}, {"userName": "Jude", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/25066452-jude", "userReview": "It was amazing"}, {"userName": "Alex", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/47142455-alex", "userReview": "A well written novel"}, {"userName": "Andrew Farley", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/50816631-andrew-farley", "userReview": "Definitely the best Young Bond yet! I am sad I only have one Charlie Higson Bond book left. These have all been action packed, and Higson has nailed the Bond feel. With many truly evil villains to choose from, somehow you end up feeling something akin to sympathy for El Hurrican. I was a little wary at first of the similarities between HG and Dr. NO, but it ended up being more of a refreshing tribute than a copy. This book continued the theme of Bond being averse to using a gun to kill people. It is positioned as not wanting to kill in cold blood, but I am looking forward to the transformation into a Bond who can shoot when necessary. Again, great book. I would highly recommend this to bond fans or those who love action packed books. But I would say read them in order, because knowing how much pain he faced going into this story adds to the drama."}, {"userName": "Sarah Kenny", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/9369061-sarah-kenny", "userReview": "Read this to my son whilst in hospital. We both immensely enjoyed it. James is on a recuperation holiday with his aunt before she goes on an expedition. However, a hurricane ruins all plans. James was to stay with a friend of his aunt when burglars come in to take something from the safe. James gets caught up in protecting the children Precious and JJ. They escape though wounded and the adventure starts when they try to get to safety at Vera Cruz. They keep bumping into the robbers and go through pain and loses. Precious and James end up in a sort of prison where they have to go through many tasks to leave."}, {"userName": "SaraKat", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/10085593-sarakat", "userReview": "This was highly enjoyable! I was skeptical since it is a James Bond book and I'm not even a fan of the movies. I found myself not able to put this one down, though. Some reviewers talk about the book being formulaic, but it's James Bond--the formula has been working for decades! It was more gory than I expected from a book for middle grade/young adult. The beginning was a bit slow, but I'm glad I stuck around for the end. I read this as a stand alone, so it doesn't hurt even though there were a few passing references to things I didn't know about."}, {"userName": "Anna Bergmark", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/32506523-anna-bergmark", "userReview": "The third installment was sooo good it got my hopes up. Would the next book be as fun, as action packed, as adventurous?Mmmmm... no.The hurricane thing in the beginning is exciting, yes. A force of nature so terrifying it really doesn't need the addition of murderous criminals, but from this early peak it is a downward slippery slope into utter pointlessness. There's no way around it, I'm afraid. Intrigue wise this story is beyond weak. It's a road trip without direction, taking you to an island of disbelief, ending in a gauntlet of incredulousness. And where the humour ended up? Face down in a ditch, I suppose. Leaving us with the last nail in the coffin; the girl by Bond's side sure ain't no Kelly Kelly!2 disappointed stars and a nagging suspicion that \"Double or Die\" was written by a different author altogether."}, {"userName": "nur'aini  tri wahyuni", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/18262924-nur-aini-tri-wahyuni", "userReview": "sebenernya suka dengan ide \"jalan tikus\"-nya, cocok buat scenes di franchise SAW.tapi, penjabaran cerita yg berteletele plus segala kebetulan yg terjadi, baik kebetulan yg menguntungkan maupun merugikan terasa amat sangat tidak masuk akal."}, {"userName": "Ancy", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/68177409-ancy", "userReview": "very scary....... Mayan, Avenue of death ahhhhh One of the best books of Young Bond! It had the same effect as reading Sherlock Holmes. I feel so sorry for the bad guys.... you guys should stay away from James Bond! :P"}, {"userName": "Amandeep", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/58549101-amandeep", "userReview": "Action packed from the beginning!"}, {"userName": "Jack H", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/70605152-jack-h", "userReview": "Probably best one of the series."}, {"userName": "Jack Lugo", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/31238693-jack-lugo", "userReview": "As much as I enjoyed the first 3 books in the Young Bond series, I found this 4th book disappointing. It does improve a great deal towards the end but I found that the story dragged quite a bit for the 1st 2/3rds of the book. The biggest problem I have with it is with the character of Precious, the lead female character and meant to be sort of a prototypical \"Bond-girl\". The story takes place shortly after the events of Double or Die with Bond on a trip to Mexico with his Aunt Charmain after the Xmas Holidays. It's decided that it's in Bond's best interest to prolong his return to Eton and remain in Mexico so that he could fully recover from the previous ordeal / adventure. Aunt Charmain decides she wants to go off on her own private Mayan ruins expedition and decides to leave young James with a family friend, Jack Stone, the pilot who will fly her to her remote location. It's here where the story gets a bit frustrating because right away we are introduced to Jack Stone's daughter Precious, who is made out to be extremely unlikeable and behaves as the stereotypical rich spoiled brat we've seen countless times and it comes across here as very annoying for both James and the reader. If Charlie Higson had made the character a bit more likeable in the beginning of the book then it might have been an easier story to get through but as soon as we meet her we see her treat the wait staff horribly and pull a nasty trick on young James while vying for her father's affection. Then, Precious undergoes an enormous and very implausible transformation whereby she becomes a strong-willed heroine summoning up the strength to help save young James' life pulling him out of the water on several occassions and lifting James with one hand as they tried to traverse a log full of army ants in the villain's obstacle course towards the end of the book. Of course by this point, the character has become humbled due to the circumstances of having been kidnapped and held hostage, but the entire transformation this character undergoes just felt forced and took me out of the book. The overall plot presents the reader with certain shades of both Dr.No and Live and Let Die. I just wish the execution and the character development of Precious were handled a bit better. It's not a bad story at all. If you're willing to overlook the mishandling of the Precious character the overall adventure is actually quite entertaining. Young James spends most of the story either captured or fleeing from a small group of gangsters led by Mrs. Glass who invaded the Stone house to get their hands on secret American naval documents that Stone had smuggled onto his plane. Their plan was to steal the naval documents and sell them to the highest bidder but things go awry when the plans aren't in the house and they're forced to take Precious and her little brother JJ hostage. Young James manages to follow along and fool them into thinking he's a Mexican pickpocket in order to join their gang hoping to save Precious and her brother when the opportunity presents itself, but of course James' plan doesn't go so smoothly and he ends up getting pursued and captured several points in the story. The highlights include Young James learning jiu jitsu from one of the gang members, a Japanese man named Sakata, who had thrown in with Mrs. Glass but who proves to be the most honorable of the gangsters when he decides to help get the injured younger child JJ to safety. The backstories of the gangsters are actually very well done and Mrs. Glass' backstory is fascinating and includes a nod to Legs Diamond. The final third of the book is really where the novel picks up. James and Precious find themselves on a private island set up as a haven for criminals and run by El Hurrican, who basically provides this safe haven with the condition that no one who enters the island is allowed to leave. Of course, the criminals think they've got it made when they get there but once they run out of money, El Hurrican forces them into slave labor. The only way off the island is to run a dangerous obstacle course called La Avenida de Muerte with each stage in the course set up as a tribute to various Mayan gods. Both Precious and young James decide to run the course and this sequence does make for a thrilling read. It's just that I had a hard time believing the necessary transformation Precious had to undergo before she could run the course along with James. Overall, I'd have to say this was the weakest Young Bond book I've read so far, but my disappointment is only there because the previous books had impressed me so much that I've set such an impossibly high standard for these books. It's worth the read if you're willing to overlook the flaws I mentioned, but the first 3 books are so amazingly brilliant that I've decided to give Charlie Higson a pass for this one and give 3 stars instead of 2."}, {"userName": "Michael Greene", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/65064827-michael-greene", "userReview": "This was my favorite out of all the Young James Bond series!"}, {"userName": "Zach", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/40627961-zach", "userReview": "Recently I read the book Hurricane Gold by Charlie Higson. The book was published by Ian Fleming Publications Ltd in 2009. Ian Fleming Publications Ltd is based out of the city of New York. I would recommend this book to people who enjoy reading a fast pace action adventure books with a bit of mystery and crime. \tHurricane Gold is based on the topic of two kids going missing and later finding they got abducted after a recent hurricane that has destroyed the children’s town. Later to find out the Kid’s father has a very valuable map to a military base. James Bond is the main charter and he attempts to help the kids by acting as a young Mexican thief and joining a gang. James goes through a hurricane damaged country of Mexico and eventually arrives on a Caribbean island called Lagrimas Negras to save the kids. They will be kept on the island for the rest of their lives unless the abductors get the map to the military base or James can come up with a solution to save them. \tThought the book the book Charlie Higson goes in between English and Spanish. Such as “Stand up and put your hands on your head, Senor!”(Higson 221). I feel like this adds a great deal of importance to the book, because it helps make you feel like there is a strong Spanish culture where the book takes place, which there is. Also the book is written in a first person point of view, which works out well for this novel. The first person point of view is well because it allows the reader to feel like they are in the footsteps of the charters. For example when James says “What am I to do with you both?”(Higson 318). All thought the book there are all sorts of different charters talking in a first person point of view. Which adds a positive impact on the book.Hurricane Gold is the fourth book in the Young Bond series, with no movies based off of any of the books. Although movies have been created about the main charter James bond, only without being based off of the books. James bond movies have been very famous dating back to 1962 and his most recent movie Skyfall that hit the market in 2012. Also a new movie coming out in November of 2015 called Spectre. This book as well as all of the other books in the series would be great for anyone seeking a fast paced action adventure, thrilling read.In conclusion I would recommend this book to people who enjoy reading a fast pace action adventure books with a bit of mystery and crime. Will the famous James Bond save the kids? You must read the book to find out the mysterious ending."}, {"userName": "Simon Wood", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/17058793-simon-wood", "userReview": "That became a chore.Of course it's not fair for me to judge this book on standard merits as it is essentially for kids. (Even if it is pretty shockingly violent at times.) I decided to read it because my ten year old nephew started with the series and it seemed like it could be fun. And it was, to start with. Some really well conceived and realized action set pieces, and a nice on-the-run-through-the-third-world kind of plot. But the biggest problem with the book is that it's at least a hundred pages too long.The set up is very flimsy, with young Bond happening to be in the wrong place when some baddies kidnap their intended victim's children and then drag them across country as they search for the kids' father in order to force him to trade them for what they're after. Which is all well and good, but the book doesn't have anything else in the way of twists and turns to offer to keep things interesting. It's just a case of Bond and the others escaping for a little while, struggling ever onwards, getting captured again, struggling ever onwards, escaping, captured, again - on and on - with every instance coming about because of incredibly silly motivations or utterly contrived coincidences. And then when it finally rolls round to the climax, the reasoning for it coming about is just painful - considering these children fall back into the baddies hands of their own free will because of some notion of saving the day, but with no plan or real need to do it. And thus, having to simply again escape capture.I got so tired of it that I sped read the last 60 pages.And like I said, it isn't really fair for me to judge it too harshly as it is a kids book. But 355 pages. Jesus."}, {"userName": "Tyler Neff", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/46267311-tyler-neff", "userReview": "Hurricane Gold by Charlie Higson is a thrilling, action-filled book. Especially in the 3rd part of the book is where it gets really exciting, and thrilling. It is very similar to the book series \"Alex Rider\". This is the 4th book of the \"Young Bond\" series, and is my favorite.The book takes place all in Mexico. James is taking a break off of school, and is in Mexico to spend his time. Although, a huge, massive, severe storm is coming it's way throughout Mexico. James's guide, Garcia, knows Mr. Stone, where James can stay at during the storm. As James is at the Stones' house, he meets Mr. Stone's daughter, Precious, who has quite the mouth. James was with his Aunt Chiarman, and his aunt needs to be flown to a jungle expedition, and Mr. Stone, who is very rich, has a plane. James is stuck with Precious, and her little brother JJ, as Mr. Stone is flying Aunt Chiarman somewhere, before a massive storm. During the storm, however, a Mexican gang breaks into the house, and captures all the servants, even Precious and JJ. James is the only one who hasn't been captured. In time, James, Precious, and JJ, escape. Stranded with nowhere to go, their house destroyed and the gang gone, they find a way to survive, but soon meet again with the same gang. James is dressed as a Mexican, although. As the kids have to go through the risks and dangers the gang brings them, they find a way out of it, leading them to the most dangerous place in all of Mexico. I would recommend this book to any who loves action, and thriller books. Anyone who likes the \"Alex Rider\" series, or likes James Bond. This book would be great for James Bond lovers."}, {"userName": "Megan", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/7859783-megan", "userReview": "I had high expectations for this book. The premise sounded cool and a Young James Bond sounds totally awesome, loads better than he is as an adult. But I was wrong...From the very beginning, I realized that the plot would not take the natural turns I thought it would take. The author wrote a verrrry unnecessary \"prologue\", which introduces the villain, the settings, etc. And as I'm taking all this in, I'm thinking, why should I care?. Not a very good way to draw your readers in, if you ask me. I mean, I understood as the plot developed, but I don't like it when I'm given seemingly unnecessary details in the beginning. It being an action book I assumed it would be action first, explaining later. The author's formula still worked, but it really dragged.After the painfully long, aforesaid intro, James Bond finally comes into the story. Okay, things are looking up right now. Wrong again. Once the conflict starts, it's exciting for awhile, but then loses steam. I'll tell you why: 1) The main part of the book follows our protagonist on a rather long, rather boring, rather confusing road trip all across Mexico. Most of the time, I forgot the name of the the characters' locations. That's how fast they moved around. 2) James Bond didn't come into any conflict at all with the main villain until the last third of the book. Didn't the author know he was going in the wrong direction?I gave it one more star than I would have, because I could tell the author was really trying to deliver the story. Well, I'm story to say it really fell flat. But I'm feeling nice today. :) So, yeah... Two stars."}, {"userName": "Andrew", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/2730673-andrew", "userReview": "I have been waiting some time for this book to appear in a second hand book shop or charity shop..mainly as I had all the series to date from such places and this one eluded me..finally me patience paid out and I actually found two copies on one day...but needless to say only bought one..anyhow enough of me and my thrifty buying what's the book like.It's actually the best of the young Bond reads I have come across so far,I do still have one not to go but it will have to go some to surpass this.Bond suits a young treatment given the sometimes cartoonesque capers in some of the adult novels..by think I mean mainly the ones that came after Fleming's series.The idea of young Bond may seem a cynical money making ploy but they are well written,This one uses Mexico as its backdrop continuing the cosmopolitan nature of Bond adventures and the back story of an island of fugitives is only part of it...essentially that forms part of a journey and the book has aspects of a fugitive road movies.Given it's target audience was much younger than me I found this a quick read and yet an imaginative and worthy one..I understand a non Higson young Bond is about to drop..another one I shall scour the charity shops for post release."}, {"userName": "Kerenza", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/13799108-kerenza", "userReview": "I liked Hurricane Gold but to be honest it isn't my favorite. I like the setting in Mexico and i liked the characters Precious and JJ. I all start of with a storm one which tears apart the house and everything else in Mexico. His description of what has happen is really good and i enjoyed reading it.The villains in this story weren't as i expected and i was slightly confused about the main villain El Hurrican, as he doesn't appear untill three quarters of the way through. This confused m,e as there was a lot of description about him and the area in which he lived in, but when it got down to it, there was really not much about him. Plus he wasn't like most villains at the end! The really villains were Mrs Glass and the Gang who kidnapped James' friends. I like the area in which it is set in and the way the storm makes it even harder for them to move around. I love i idea for the Rat Run and thought that was a really good idea by Charlie Higson. Overall i really liked it and would tell my friends to read it. The ending and the problem i had with the villain is the reason why i only gave it three stars!"}], "description": "BEFORE THE MAN BECAME THE LEGEND.BEFORE THE BOY BECAME THE MAN.MEET BOND. JAMES BOND. As the sun blazes over the Caribbean island of Lagrimas Negras, its bloodthirsty ruler is watching and waiting. Criminals come here to hide, with blood on their hands and escape on their minds.On the mainland, in the quiet town of Tres Hermanas, ex-flying ace Jack Stone leaves his son and daughter in the company of James Bond. But a gang of thieves lies in ambush – they want Stone's precious safe, and will kill for its contents.James embarks on a deadly chase through the Mexican jungle. On this terrifying trail of greed and betrayal, only danger is guaranteed... Survival is not.The first five books and companion novel in the series are written by Charlie Higson, with the rest being written by Steve Cole. The series consists of the following titles;1. SilverFin2. Blood Fever3. Double or Die4. Hurricane Gold5. By Royal Command6. Shoot to Kill7. Heads You Die8. Strike Lightning9. Red Nemesis", "title": "Hurricane Gold\n      \n          (Young Bond #4)", "url": "http://www.goodreads.com/book/show/1660794.Hurricane_Gold", "average": 4.14, "cover": "https://images.gr-assets.com/books/1401322488l/1660794.jpg", "reviews": 146, "authors": [{"url": "https://www.goodreads.com/author/show/162326.Charlie_Higson", "name": "Charlie Higson"}], "type": ["Young Adult", "Adventure", "Fiction", "Mystery", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/1660794.Hurricane_Gold", "http://www.goodreads.com/book/show/3751846-hurricane-gold", "http://www.goodreads.com/book/show/2456159.Hurricane_Gold", "http://www.goodreads.com/book/show/10543110-hurricane-gold", "http://www.goodreads.com/book/show/10362974-hurricane-gold", "http://www.goodreads.com/book/show/14802313-hurricane-gold", "http://www.goodreads.com/book/show/8540357-the-enemy", "http://www.goodreads.com/book/show/603911.SilverFin", "http://www.goodreads.com/book/show/21888732-the-dead", "http://www.goodreads.com/book/show/278794.Blood_Fever", "http://www.goodreads.com/book/show/360918.Double_or_Die", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}