{"ratings": 107835, "userreviews": [{"userName": "Stephen", "userReviewDate": "Sep 21, 2008", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Like Lucy, this rating is gonna take some splainin. Unfortunately, I don't have a slide show or any multi-colored pie charts to provide visual assistance on this one, so I will try to splain it as clearly as I can, but I will be using quite a few \"i.e.\" and \"e.g.\" to provide supporting clarification for my commentary given I am performing this review without the safety net of visual aids. Please, do not try this at home. Oh, I've also decided to throw in the occasional word in Spanish...why you ask?....because I just watched some old I Love Lucy re-runs and am getting in touch with my inner Ricky Ricardo. Okay, from the standpoint of pure smile-spreading enjoyment (e.g., while reading, I look down and notice my toes tapping involuntarily to the smooth, jazzy, melodic flow of the narrative), I would probably rate this 3 to 3.5 stars (i.e., there was no visible toe tapping, but I did have the occasional feeling of warmth move through my tummy....though that could've just been the tacos). Richard Matheson is a terrific writer and this story, like his others, is a quality product and I have zero complaints about the prose or the technical choices he made took in constructing the narrative. My issue was really with the main character, Robert Neville. He just wasn't very compelling or interesting. He certainly wasn't the most engaging character I have ever come across. This is a bit of a problem since the entire book is spent lollygagging around with Robby as he provides running jogging sauntering commentary about the world around him. This was a negative for me and detracted from the number of happy units I was able to mine from the reading experience. So why the 4.0 to 4.5 stars? I shall splain as there are several reasons that are mucho importante (Oh, yeah...that's right, I just turned this into my first bilingual review). How cosmopolitan. First (Primero) is the plot. This book, written in 1954, was the genesis for EVERY zombie book that follows and provides the basic framework for most of the post-apocalyptic undead fiction being produced today. Amazingly, it is also one of the best of these stories despite being the first. Here is the basic plot or argumento: Robert Neville is the sole survivor of a pandemic that struck the world and caused the infected to exhibit all the outward signs of vampirism (vampirismo). He spends his days gathering supplies, fortifying his house and killing the sleeping “vampires” and spends his nights barricaded in his house and fending off attacks from the walking dead. Sound familiar? Well this is the book that started it all and I felt that deserved some serious recognition for both its originality and Matheson's being a trailblazer (pionero) of the zombie sub-genre. Second (Segundo), is the world-building/back-story and Matheson's explanation of both the plague and the “vampires” which I thought was nothing short of EXCELENTE (i.e., magnifico). While certainly not good science in the sense that it can be analyzed objectively, the explanations given are compelling and superb theater. I actually wish more time had been spent on this aspect of the book because I thought it was just fantástico (i.e....if you need a translation of this, please stop reading and go put the crash helmet back on). Third (Tercero), is the end of the book which, in my opinion, is worthy of 5 HUGE stars all by itself. I would say that goes double for the very last line of the book (which I think makes it a 10 MEGANORMOUS star ending if my math is correct). Thus, Matheson being the superb writer that he is, not only invents a sub-genre but then, over 50 years after the fact, can still claim to have written one of the best, most original examples of it. That is pretty especial, no? Thus for all of the above reasons (motivos), I am giving the book a rating of 4.0 to 4.5 stars despite not always “enjoying” the book as much as I would have liked. However, if you haven’t read this, I would highly recommend it as I think it has a lot going for it. HIGHLY RECOMMENDED!!"}, {"userName": "Jeff ", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "Straight outta Compton, another crazy ass vampireMore punks I smoke, yo, my rep gets biggerI'm a bad vampire killa and you know thisBut the pussy ass ghouls don't show thisBut I don't give a damn, I'ma make my snapsIf not from the garlic, from jackin the cropsJust like burglary, the definition is 'jackin'And when illegally armed it's called 'packin'Put a stake through a motherf…Chorus:[City of Compton, City of Compton][Damn that book was dope!]I know I’ve used the whole edited-lyrics-as-review before but I couldn’t resist. The story takes place in Compton and I need to build my street cred so – Viola! I’m making secret gang signs at the monitor as I type this so – yo! On with the review.There are advantages and disadvantage to being the “last man on Earth”:AdvantagesYou are your own moral compass.You can smoke in the house (or anywhere else for that matter)You can drink yourself into a stupor anytime you wantYou have plenty of time to try and work out a cureYou can park in front of fire hydrantsDisadvantagesLonely and isolated (this book does an excellent job of depicting this)Horny (shameless hussy vampires play on this by being provocative)Nightly attacks by vampires some are feral, some are lucid, none sparkly.You suddenly have to become Mr. Science Guy and MacGyver all rolled into oneAll you have to listen to is classical music___________________________________________There have been three films made from this story, all with similar scenarios: After apocalyptic nightmare that alters or kills the rest of humanity, hero is lone human survivor.The Last Man on Earth – This one has Vincent Price giving his typical overwrought, fey performance. It also has the undead moving about as fast as your Grandma using her walker. It adheres to the plotline of the book more closely than the other two.The Omega Man – Charleton Heston, during his SciFi period. Here instead of vampires, you have evil, albino mutants. Their mutant ability: being annoying.I Am Legend  – Will Smith, big budget, CGI zombies that move faster than Granma. Watching the movie will not spoil the book.This book also contains some of Matheson’s short stories. Matheson also wrote teleplays, some for The Twilight Zone, so a few of these stories do have that kind of vibe. Most notably: Buried Talents, The Near Departed, Person to Person, The Funeral.Dance of the Dead and Witch War both take place in the distant future.Mad House, a standout, and Dress of White Silk would be classified as horror. Mad House is set in the fifties, before the whole concept of anger management took hold. Prey has an odd familiarity to it. It reads like something you would have seen on Rod Serling’s Night Gallery … or a very special episode of Mr. Belvedere.From Shadowed Places is smexy*.George Romero, Stephen King and Anne Rice have all cited Matheson as an influence. He wrote a Star Trek episode and his short stories and books have been made into a number of films including Duel, Hell House, The Incredible Shrinking Man, Stir of Echoes and Somewhere in Time. If you have an interest in horror, fantasy or scifi, you should give this a read.*Yeah, that word again. Using Anne’s made up words will hopefully give me even more street cred."}, {"userName": "Lyn", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "This is technically a collection of short stories, but I am Legend is the centerpiece, masterpiece, main event, etc. I am Legend truly is a great story, deserving of all the accolades and an inspired source of all the horror genre influence over the past 60 years, including Stephen King. It's about vampires the same way Castaway, the Tom Hanks film, is about the South Pacific. It's about a man dealing with stress, nightmarish circumstances and his will to not just live, but to survive. Matheson tells a tale of isolation, desperation, perseverance and ultimately, absolution.The other stories are not even close, many just sketches, some are comical. By far the best is \"Prey\" and I remember watching the short film in the early 70s and being scared as a child. \"Mad House\" comes closest to evoking the same degree of anger and isolation as I am Legend, very dark and with an almost Kafka-esque absurdist twist at the end.Most notable about my reading the title story, though, was a growing understanding about the vampire / zombie fascination over the past few years. Matheson summed up that whole sub-genre here: it's all about de-humanization and isolation, a literary Edvard Munch screaming about who we are amidst an outside that we cannot understand nor be a part."}, {"userName": "Stephen", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "4.0 to 4.5 stars. Okay, this rating is going to a take a little explaining. Unfortunately, I don't have a slide show or any multi-colored pie charts to assist me as a visual aid on this one so I will try to be as clear as I can. Warning: I will probably be required to use quite a few i.e. and e.g. to provide clarification to my statements as well as some targeted use of bold and italics given that I am reviewing here without the safety net of my usual visual aids. I have also decided to throw in the occassional word in Spanish...why you ask?....why not I answer? Okay, from a pure “enjoyment” standpoint (e.g., Steve, while reading, looks down and notices his toes tapping involuntarily to the smooth, jazzy flow of the narrative), I would probably go 3 to 3.5 stars (i.e., no toe tapping, but I did have the occassional feeling of warmth in my tummy....though that could have just been the tacos). Richard Matheson is a terrific writer and, as with most of his work, this story is very well written(i.e., I have zero complaints about the prose or the technical choices Matheson took in constructing the narrative). My issue was really with the main character, Robert Neville who was not the most compelling or interesting character that I have ever come across. Since the entire book is spent lollygagging around with Robby as he provides running jogging walking commentary, it subtracted a bit (for me at least) from the enjoyment of the reading experience. So why the 4.0 to 4.5 stars? Several reasons that are mucho importante (Oh, yeah...that's right, I just turned this into my first bilingual review). First (Primero) is the plot. This book, written in 1954, was the genesis for EVERY zombie book that follows and provides the basic framework for most of the post-apocalyptic undead fiction being produced today. I would also point out that it is one of the best of these kinds of stories despite being the first. Here is the basic plot or argumento: Robert Neville is the sole survivor of a pandemic that struck the world and caused the infected to exhibit all the signs of vampirism (vampirismo). He spends his day gathering supplies, fortifying his house and killing the sleeping “vampires” and spends his nights barricaded in his house and fending off attacks from the walking dead. Sound familiar? Well this is the book that started it all and I felt that deserved some serious recognition for both for its originality and Matheson's being a trailblazer (pionero) of the zombie sub-genre. Second (Segundo), is the back story and explanation of both the plague and the “vampires” which I thought was nothing short of EXCELENTE (i.e., magnifico). While certainly not good science in the sense that it can be analyzed objectively, the explanations given are compelling and very interesting reading. I actually wish more time had been spent on this aspect of the book because I thought it was just fantástico (i.e....if you really need a translation of this that one, you need to put the crash helmet back on). Third (Tercero), is the end of the book which, in my opinion, is worthy of 5 stars all by itself. I would say that goes double for the very last line of the book (which I think makes it a 10 star ending, but I will have to go back and check my math). Thus, Matheson being the superb writer that he is, not only invents a sub-genre but then, over 50 years after the fact, still can claim to have one of the best written, most original examples of it. That is pretty especial.Thus for all of the reasons (motivos)above, I am giving the book a rating of 4.0 to 4.5 stars despite not always “enjoying” the book as much as I would have liked. However, if you haven’t read this, I would highly recommend it as I think it has a lot going for it."}, {"userName": "Nichole (DirrtyH)", "userReviewDate": "Mar 03, 2008", "userURL": "http://www.goodreads.com/user/show/74998-nichole-dirrtyh", "userReview": "There's not much to say about this story that hasn't been said about other reviews.The premise of this story was great. It was well executed, stayed interesting, and I really liked the ending. I have only two criticisms; the first being about the story, and the second being about the edition that I read.1. It was too short. This book would have been much better if he had taken the time to flesh out some of the ideas, stretch out the mystery (his search for the cause of vampirism), more character development (the flashbacks about his wife and daughter, and more info about Ben), etc. This could have been so much more than it was. 2. Nowhere on or in this edition did it say that after I Am Legend was a collection of Matheson's other short stories. The inclusion of short stories with this edition is fine; that didn't bother me. It was that I didn't know that half the book was short stories that irked me. I was halfway through the book when all of a sudden the story ended and I was really caught off guard. I kind of flipped through the rest of the book a couple times going, \"huh?\" before I realized the story was really over. Granted, there is a table of contents, but I assumed they were chapter titles. I didn't take the time to analyze the page numbers and figure out that they were short stories ahead of time. Maybe that's my fault, but it would have been nice if somewhere on the cover it had said \"I Am Legend... and other short stories by Richard Matheson.\" Or something like that. Grr. I did read a couple of the stories and they're fairly entertaining but predictable horror stories. Maybe they were more cutting edge when they were written; they probably inspired a lot of the things I've seen that now make them seem less original. In short: Great story, but be aware beforehand that it's very short (about 160 pages) and the rest of this edition is other stories!"}, {"userName": "Paul Bryant", "userReviewDate": "Feb 09, 2008", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Richard Matheson (1926-2013) In Memoriam.Such is the low profile of some great writers that it's only now I discovered that this early sf favourite of mine died five months ago. I discovered sf in my teens (as you know, the answer to the question \"when was the golden age of science fiction?\" is \"14\") and I Am Legend was the first novel I read all in one without a break because I couldn't do anything except read it, I was as hypnotised as a rabbit in the headlights of a big van being driven straight at my head. Man, what a trip. Those were the great days of reading when every page was like an explosion. This short novel, if I remember right, is frighteningly bleak, there's not the slightest chance of any kind of happy ending. It was the first apocalyse story I read. Now they're as common as traffic cones. How many times have you seen the Statue of Liberty's arm poking up out of a heap of rubble/the engulfing waters/a pile of corpses. Very surprisingly, the latest movie version of I am Legend was pretty good, I thought, except for the usual audience-tested fake ending. I usually mentally discount the last scene of every big budget movie these days, it's the next-to-last scene which is the real ending. It's a convention, they have to do it. I did enjoy the head of the Statue being hurled into the street in Cloverfield which was a great little apocalyse movie, and one I could imagine Richard Matheson writing. I gave that scene my \"Best use of the Statue of Liberty in an SF Movie\" award for that year. The wonderful tv series The Walking Dead is son-of-I Am Legend and I hope RM enjoyed the first couple of series before he died and didn't come back again."}, {"userName": "*TANYA*", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "Great book."}, {"userName": "J.G. Keely", "userReviewDate": "Aug 17, 2007", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "I know there is a lot going for this book, in terms of popular opinion, influence, and originality, so you'll have to forgive me for interposing my body with the flywheel; we'll see what's left at the end.In a discussion between Douglas Adams and Lewis Wolpert, the argument was made that the individual is unimportant in science, but is paramount in art. Walpert proposed that scientific discovery is inevitable, as the confluence of ideas will tend to produce parallel developments, such as with Newton and Leibniz, or Darwin and Wallace.However, I would venture that this is equally applicable to the arts, which respond just as readily to shared influences and social pressures. The process of an artistic movement developing is often geographically precise, and more an indication of similar origins than of proselytism.The vast cited influence of this book, then, is less remarkable when looking at the movements and ideas surrounding it. The themes of horror always follow scientific discovery, as the Industrial Revolution brought forth Frankenstein, or the Communist scare 'alien threats'. This book draws upon the same sources and brings in the idea of apocalypse--newly popularized by the nuclear age--to create something which is not altogether as insightful as it is inevitable.Apocalyptic literature was hardly new, whether in a modern vision like Shelley's 'Last Man' or ancient religious eschatology. The nuclear age personalized the apocalypse, so that it was no longer the result of chance or divinity, bringing it to the forefront in a way more pervasive than the religious warnings of a 'nigh end' which go unfulfilled every other year. Yet Matheson's vision is not this new, personalized apocalypse, but a continuation of plage fiction.For his proto-zombies, Matheson took influence from the 'Communist scare aliens' and bodysnatchers of the pulps to create a force which is mindless, anti-individualistic, and inhuman, combining it with the vampires of film. One can look at this as an early recognition of the danger (and power) of viral memetics.These same ideas will contine to be carried on after this work, not only though the oft-mentioned zombie stories, but also through speculative fiction as represented by the Twilight Zone and Outer Limits (which Matheson wrote for). Beyond this, you may see 'I Am Legend' as prototypical of the standard 'gotcha' ending on which these series came to rely more and more heavily.All these movements and ideas are rife with opportunity for writers looking for a paradigm shift, but I would argue that 'I Am Legend' fails to take advantage of these plentiful ideas. One might point out that it is an early example, but this alone does not save it, as we may point out earlier writings which tackle similar issues with a greater depth and sense of conceptual exploration.There is Shelley's 'The Last Man', Bierce's 'Can Such Things Be', or the works of Mann, Hesse, and Conrad, who explored similar themes of inhumanity, hopelessness, sex, death, loneliness, and plague; and who did so much more fully and with a sense of joy and artistry.There are many cases where pulp authors are later found to have overcome the simplicity of their genre, whether by sense of psychology, or character, or vibrancy, or theme. Shakespeare was considered a populist, and in all his fart-jokes, cliches, and story borrowing, we might compare him to 'Family Guy' or 'The Simpsons'; the latter drawing allusions from 1980's culture as he drew his from Greek Myth.But I digress; Matheson as an author does not bear these strengths, and misses many opportunities to take advantage of the themes he explores, which may be new in their particular combination, but not without literary precedent.Matheson often lays open his characters' psychological motivations. His every statement of action (or interaction) is followed by an explanation of the thoughts and events which have just occurred. However, his explanations do not expand our understanding of the characters. Instead, the accompanying narration is so simple that one begins to feel that Matheson is simply telling you the same thing twice; or even three times.If our protagonist asks a question, Matheson inevitably follows with 'he asked, incredulously'. It seems the fact that the character was both clearly incredulous and asking a question did not seem self-evident enough. Then again, nothing in the book is too self-evident to prevent Matheson from painstakingly explaining it several times.He tells us what his characters are thinking almost constantly, despite the fact that it rarely offers any further insight. One might achieve a similar effect by taking a Hemmingway story and having a high-schooler add in how the character would be expected to feel after every piece of dialogue.Matheson doesn't have a flair for psychology, and so his characters' reactions are often either unjustified or oversimplified. Instead of writing characters who fit the story, Matheson seems to constantly change the characters or the story to try to achieve his authorial goals. But then, how would one build an entertaining story around such shallow characters?The protagonist is fond of lecturing the reader on behalf of the author, at which point Matheson seems to recognize his own transparency, deflecting by providing the character with sudden mood shifts before slowly creeping back. Comparisons to Stephen King are apt: another author whose storytelling is jumbled and rough despite the potential of the concepts driving it.It is not difficult to understand why this book was so influential: in the process of reading it, I was constantly thinking of things I wished the author would do with the story. Every time he overstated a point or underexplored a theme, I began to imagine how I might do it differently. I pictured Romero closing the book having already built an entire movie in his head by simply extending where Matheson faltered.Indeed, the book often reads like a screenplay, complete with plodding character descriptions to keep the actors from getting lost. At every turn, it breaks the rule of authorship that it is better to show the reader what is happening than to tell him. Matheson's combination of ideas and influences should have been interesting, but his repetitive overexplaning mars the form of the story while his borrowed themes go unexplored for the sake of a gimmick ending.I will not deny that this work exists in a certain nexus along the development of some very important and interesting genres and works, but it is more rough draft than groundbreaking original. It is less an inspiring work than the one which revealed that there was a lot of space for other authors to re-introduce old ideas by new means and methods. If only Matheson had been able to take up this challenge himself, instead of making the void conspicuous by inhabiting it, we might remember this book not from where it happened to be, but from what it managed to do there."}, {"userName": "Amanda", "userReviewDate": "Jan 05, 2009", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Two points I want to make: A) the movie was crap, especially when compared to the book, and B) this is so much more than just a vampire novel. First, the whole movie thing. In both, Robert Neville is the last human on Earth--and that is where all similarities end. If you've seen the movie, it won't ruin the book for you as the two are nothing alike. The setting is different, the protagonist is different (except for a shared name), the creatures are different (vampires in the book and nocturnal zombie-like creatures in the movie), and the plot points--don't even get me started on the plot points. I can understand why diehard fans of the novel were upset by the movie. This is a case of film ruining a superior narrative. Robert Neville's pain, perfectly captured by Matheson, just doesn't translate to the screen.Second, sure it can be classified as a vampire book, but the vampires are somewhat in the background. What takes center stage in the book is Robert Neville's aching loneliness as he confronts the reality that he is destined to live the rest of his life without the hope of human contact or companionship--what's outside his door at night isn't nearly as terrifying as that prospect. The portrayal of his progression through the stages of acceptance is heartbreaking (the dog chapter was almost more than I could bear). Moral issues abound: what's the point in trying to survive if you know you're the last of your kind? Does it matter if you live to see another day? There are no easy answers, especially as his situation is given complexity by human nature's innate tenacity and stubborness. There's a lot to think about here, which makes it more satisfying than your run of the mill horror novel. Cross posted at This Insignificant Cinder"}, {"userName": "Petertpc", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/6720252-petertpc", "userReview": "Questions arising out of my reading of this book: 1. Why have I never read Richard Matheson before? 2. Why did no one ever tell me what an amazing storyteller Matheson is?3. How does someone channel such elegant prose, and such profound imagination, into a story with so much humanity?4. Why was I unaware of how incredibly influential Matheson's story has been on multiple genres, from post apocalypse tales, to zombie plagues and vampire ficion?5. Why did Will Smith and the Hollywood \"brain trust\" so completely alter the plot and ruin the spirit of the original?6. Why did no one get punched for the travesty mentioned in 5 above?7. Will I ever forget the haunting final words of this incredible story? (I think I know the answer to this one.)"}, {"userName": "Apatt", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "[a bacterial infection (hide spoiler)]"}, {"userName": "Andy", "userReviewDate": "Jun 17, 2007", "userURL": "http://www.goodreads.com/user/show/95217-andy", "userReview": "Ho-hum. That's about all I can say about this book. I was really excited to read I Am Legend and the first 70 pages were astounding, but then it just slowly got less and less enjoyable. You can't blame Matheson, though. When this book was first published in the mid-50s it was the first of its kind. A novella that took a scientific approach to explaining a virus that turned all but Robert Neville into a vampire. Reading the novel I kept thinking \"I've heard this before\" but, I realize now that Matheson was probably the first to do it, but now 50 years later others have done it...and better. If you are interested in this genre I would definitely read the book. Maybe two stars is a little too rough, but I'm not going to mask my disappoint in how a story can start so promisingly and just taper off so terribly. The ending was totally anti-climatic and I could see it coming from a mile away. This collection also had several short stories by Matheson and I read a few before giving up. They suffer from the same fate as I Am Legend. Matheson was the first, but over the years other people have taken his ideas and improved on them."}, {"userName": "Lou", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "When i read this i was not on goodreads so a review now would not do justice, so this is up for a re-read. Matheson is such a good writer and this tale of one man's struggle to preserve the human race and find a way to stop the spread of the hungry beings is short but legendary. There has been quite a few adaptations but most have played with the story and changed some important parts the book is much better.I Am Legend has been adapted to a feature-length film three times (or four, if one includes the Direct to Video film I Am Omega, which does not credit Matheson as the source).\n\n\n\n\n http://more2read.com/?review=i-am-legend-by-richard-mathesonThere is a 7 part in depth video interview of Matheson he talks about writing and the movies. HERE>> http://more2read.com/?p=2026"}, {"userName": "Riku Sayuj", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "Bram Stoker’s Dracula first popularized the word 'nosferatu' as a synonym for “vampire,” supposedly gleaning it from Romanian folklore. Popular etymology has ascribed the word to the Greek nosophorus, or “plague carrier.” The association of vampires to various diseases is an integral part of the vampire legend.Matheson’s was the first (?) fictional depiction of vampirism as the result of physiological disease, not supernatural forces. It thus gave an ironic twist to an old pattern: Where vampires once were believed to cause epidemics, here epidemics spawn vampires."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "I'm prepared to be burned in effigy for my rating. I just was not a fan of any of these stories. My only reason for faltering is the inspiration that so many modern horror masters have obviously taken from these tales. That's quite apparent. But I just wasn't entertained. Sorry guys!"}, {"userName": "David", "userReviewDate": "Sep 23, 2009", "userURL": "http://www.goodreads.com/user/show/1273901-david", "userReview": "A landmark book which has influenced countless writers and directors.Click here for the first part of my look at the novel and its various film adaptations: http://bit.ly/2bf7n1qAnd here's my look at Last Man on Earth starring Vincent Price: http://bit.ly/2cxJg3bHere's my look at The Omega Man starring Charlton Heston: http://bit.ly/2dE9m00And, finally, here's my take on I Am Legend starring William Smith: http://bit.ly/2gzlmSU"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "It was really good. Neville is a very interesting protagonist. You really want to root for him that he will survive. I don't want to spoil you, but the ending will definitely hit you like a one-two punch. I definitely wanted a different one. Nevertheless it was one of the best short stories I have ever read. I finished I am Legend more than a year ago. It had such an effect on my psyche that I had to put the book down. Let me tell you a secret. I am a bit of a whimp when it comes to horror. Yet like the worst masochist, I adore horror. I love being scared and that feeling of unsettledness that settles in your stomach like a heavy meal. Anyway, I felt like I wanted to finish it, because I really liked Matheson's writing. And I paid a lot of money for the book ;)I pulled it out the summer I moved back to TX and read some more. There were some excellently written stories, all deeply disturbing. One of the most effecting is one where a henpecked young woman under her mother's thumb buys a Zuni doll for her boyfriend that her mother has forced her to break up with. The Zuni warrior comes to life and tries to kill her. She manages to survive but her mind is possessed by the Zuni doll and she calls her mother over to visit. The story ends with her jabbing a knife into the floor in the same motion the Zuni doll uses. The end is particularly disconcerting because you know that a horrendous fate awaits her mother. Another story was a little too unsettling. It's set in the future after wars and people have barely managed to keep a semblance of normal life. A sheltered suburban girl meets a dangerous crowd in college. They go to the city to a club where there is a unique show. A woman who has become effectively a zombie from a drug that she overdosed on. That scene was really hard to read because the horror is knowing that this was a normal girl who was changed by this drug she abused. And the other element of horror rests in the fact that the young, sheltered woman is about to walk down the same path. That was not my favorite story. Another story features a man who goes to the funeral parlor to plan his wife's service and arrangement. It ends with him going home to kill his wife. Very unsettling. As I have described, some of the stories are quite disturbing, some horrific, and some humorous. I loved the story in the funeral parlor where a vampire wants a funeral and he invites a host of ghoulish creatures. And the witch and this other character has a fight. Of course the werewolf has to go because he is called by the moon to hunt. It was really funny. I also loved the one where the guy has been hexed by a witch doctor in Africa and his fiance calls her anthropologist friend who studied witch doctors to save him. It was really really good-my second favorite after I am Legend. I think it be great as a movie short. Probably the most disturbing story was the one with a man who has anger issues. His anger has possessed his house, for lack of a better description. He is a frustrated writer who cannot write and has allowed bitterness to kill him slowly. Strange things happen to him at home, rungs slip, pencils jab him, he bangs his knee everytime he sits down at the table. His wife has decided to leave him and he cannot ask her to stay, although he loves here. His friend at the university where he works who is a scientist warns him about the house but he doesn't listen. He manages to get fired by yelling at a student and goes home. His wife is there and asks him to tell her to stay, he runs her off, and the house takes his revenge. This story comes across like a Greek tragedy. You can see the path that the character is taking but you are helpless to stop it. This is the side aspect of horror. The horror lies not necessarily in the supernatural elements but the poor choices the characters make. I can see why Matheson is cited as an influence by Stephen King. He definitely has a feel for the horrific in various forms."}, {"userName": "Michael", "userReviewDate": "Jun 23, 2008", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "Before vampires were brooding, sparkly and sexy, Bram Stoker and Richard Matheson made them scary. They were creatures of the night, meant to be feared and avoided at all costs. If it was Stoker that introduced us to the world of the undead blood suckers, it was Matheson who took the genre the next step forward, exploring how the tropes of vampire mythology could be true based on scientific principles of the time.But to categorize \"I Am Legend\" as just as vampire story is a huge mistake. As with all of the best Matheson stories, the supernatural element is the gateway to exploring something deeper about human beings. In this case, it's an exploration of loneliness and the depths it can drive a person to.Robert Neville is the last survivor of the vampire apocalypse, started when China and Russia unleashed germ warfare as part of a border war. The germ proved too effective, quickly spreading across the globe and wiping out large chunks of humanity. Neville is immune to the disease thanks to a vampire bat bite he got while serving in Central America years before. Neville faces not only the horror of being tormented each night by a hoard of vampires led by his old friend, Ben Cortman, but he also has to live with the guilt that he had to kill his wife and daughter when they were resurrected as vampires by the virus. As the story begins, Neville is eking out a day to day existence in which his only concerns are ensuring his house is safe from the vampire hoards each night and trying to deal with the oppressive loneliness he feels every waking minute of the day. It's been a long time since Neville had any company of any kind and the hope of female companionship is just one of the lures the vampires try to use each evening to draw Neville out in a moment of weakness. Neville's essential isolation is underlined by his attempts to connect to anything that could possibly be a link to a normal life. Neville feels hopes when he sees an uninfected dog roaming the neighborhood and spends weeks trying to get the animal to trust him. Later he sees what appears to be an unaffected woman and he chases her down like a madman, trying to keep her from fleeing. Of course, what Neville doesn't realize is that the vampires are evolving and creating their own society. And that to them, he's become the monster and stuff of nightmares--an unchanged human with no regard to the fact that there are two different types of vampires now--some who are mindless killing machines and others who are evolving into something more. Neville is typical Matheson hero--the everyman facing extraordinary circumstances and trying not only to come to grips with them but to survive. Unlike many of the movie adaptations (when will Hollywood get this story right?!?), Neville doesn't start out as scientist but becomes one over the course of the story. Circumstances force him to begin a process of learning and studying to see if a cure is possible and why certain elements of the vampire lore might be true. Matheson's idea may or may not be scientifically credible in the real world, but they work within the confines of the story and make the entire novella that much richer for it.One of the good things about \"I Am Legend\" is that the vampires in it are scary monsters, something to be feared and protected against. But Matheson also shows not only the evolution of Neville, but the evolution of the vampires as well. Early on, the vampires try to tempt Neville with the women pulling up their dresses and Cortland telling him to surrender and leave his safehouse. But as the novel goes along, the vampires become less aggressive in their attack, setting up a devious trap that eventually leads to Neville's downfall. It's a fascinating arc to consider and one has to wonder what the vampire society being created might be like once the final page of the story is turned.\"I Am Legend\" is a great portal to exploring the literary world of Mattheson. Most editions of \"Legend\" will include a few short stories to give you a bit more of a taste of how good Matheson can be. In many ways, he's one of the most prolific and influential writers that most people haven't heard of. Stephen King often cites him as one of his biggest influences and the more you read of both, the more you'll see the connection.\"I Am Legend\" is a classic of multiple genres and worthy of a read or even a re-read. I've read it several times now and enjoyed it each time. If you've not read it, put it on the to be read list. If you have read it, maybe it's time to visit it again and sit back in wonder of how good Matheson can be.And Hollywood--it's about damn time you got the movie version of this book right."}, {"userName": "Faisal", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/28494245-faisal", "userReview": "I Am Legend and Other Storiesimage: I have waited for a long time to read this novel and when I finally finished reading it...I would rather watch powdery looking vampires of Omega Man (1971) to light up my horror fuse. But because of the originality of the narratives, I am rating it a five as it was first published in 1954; and it most likely gave birth to futuristic masters' of horrors.The novel is not as horrific as I thought but more of a personal survival journey of the only man left on earth supposedly. The rest of the world has been doomed from the unknown apocalypse that had turned the rest of the public into blood sucking leeches. If I have read this book 63 years ago, I would say that I would have been hunkered down somewhere. Nine years earlier, the U.S. had just dropped atomic bombs over Japan but the exposure of the reality of Hiroshima and Nagasaki took place in the 1950s. The author Richard Matheson probably got the idea of the apocalypse from that era of atomic race with a twist of leeches. I mean, who hasn't thought about being the only person alive on earth, I have and I am curious to what it would be like.The protagonist Robert Neville is a vampire hunter in the daytime while barricading himself up at night. The usual vampire stuff like burning up in the daylight, refusal of garlic and onions, stake to the heart and scared of crosses. Neville is also an alcoholic and he is depressed most of the time because there are no women around, only slutty vampires that he must learn to hate or kill. Thus this gave him the purpose of doing scientific research about vamps. I was surprised, Matheson put that much knowledge of real scientific and theoretical process in his novel. I believe the most disturbing moments is the story is of a stray dog that Neville encounters. The emotional attachment and friendly companion perhaps was too much. Not mentioning as what happened to his wife that is another story...yet I can see governments imposing laws and quarantine people during chaotic times. I see Mr. Neville is a drunken comedian as well. While during research on vamps, he knew vamps would be scared of crosses; but what would happen if the vampire was a Muslim or Jew and how would they react when faced with the cross, perhaps he/she would still come after you.This novel also has some short stories as well by Matheson. Dress of White Silk and Mad House, I considered to be superb. Others are okay to just bizarre. I recommend to read the book at least once.image:"}, {"userName": "Miss Kim", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/925549-miss-kim", "userReview": "Ok, So Kim didn't realize this is book of short stories.  I am Legend was excellent. Imagine my surprise when I got to page 157, and turned the page and though ‘What?! Really? It can’t be over.’ But it was. I felt for Robert Neville, and I didn’t want it to be over so quickly.Written in the 50’s, this takes place in the future of the late 70’s. Neville is the last human on earth. A plague has wiped out everyone, and those that did not die have become horrible monsters. They are vampires. Not your daughter’s vampires—those with brooding eyes, and perfect hair. No. These are disgusting, zombie-like fiends. They hunt Neville nightly. He’s barricaded himself in his home for three years, and in this time has been trying to find the answers to ‘why’, ‘how’, and ‘what’ about these creatures, and also if he could find a cure, in the hopes that he may find another human companion some day. His only sort of recreation is hunting Cortman. Cortman was his friend prior to being monster, and he seems to be on of the 'smarter' ones. Neville doesn't want to really 'kill' him, since he enjoys the game. Maybe I am sick, but I found humor in some of the scenes with Cortman. (\"Come out Neville!\" - Cortman's nightly shriek outside the house.)This story scared me. I was anxious, nervous, hopeful, sad. I rooted for Neville. I felt his loneliness, his fear, his determination. I praise the author for making me feel these things. I am now a fan of Mr. Matheson, and look forward to gathering all of his works. Being a huge Stephen King fan, I could clearly see how he was influenced by this wonderful author.I only read a few of the other stories, however, I lost interest at this time because I was still thinking about Neville, and I couldn’t concentrate on them. I do plan to go back and finish them all. I recommend this for all fans of horror. Pick up I Am Legend today!"}, {"userName": "Noah Soudrette", "userReviewDate": "Nov 21, 2007", "userURL": "http://www.goodreads.com/user/show/634816-noah-soudrette", "userReview": "Let me start by stating I had only one real criticism. I found many of the passages where Neville the main character was ranting and raving in despair, anger, or anguish to be a hair over the top. It’s not that the pain Neville feels is unwarranted. His feelings just don’t ring quite true. Of course, none of us have ever been in his situation, so who’s to say that we might all act in such a way given the circumstances.I really had no other problems with the story and found myself agreeing with the endorsement on the front cover. The book is simply way ahead of its time. From the post-apocalyptic feel , to the loner surviving in a besieged, boarded up house, to the razor sharp portrait of human society and the fine lines it contains, this book is a clear inspiration for much of the genre fiction and film that came after. It is impossible, considering the book was written in 1954, to not see the direct connections between this story and the zombie films of George Romero, or the critically acclaimed comic book work of Steve Niles (30 Days of Night). Being a relative newcomer to the works of Matheson, it is easy to see what all of the buzz, since his earliest publications, has been about. Also included in this edition of I Am Legend are ten of Richard Matheson’s short stories. The first story is called Buried Talents and concerns a strange man who is either very lucky or has latent psychic abilities. It’s an interesting story but has an unfinished feel to it. Story two is called The Near Departed and is a jokey little story with a predictable twist. Prey, the third story, is most well known for being used in the made for TV movie Trilogy of Terror and involves a manic Zuni doll which comes to life and attacks a woman in her home. It’s a simple story but effectively written and quite entertaining. The next story is called Witch War and is a highly imaginative number about a nameless war (that happens to bear a passing resemblance to WWII), in which one side is using a coven of virginal teenage witches to annihilate the opposing sides forces. Dance of the Dead, the fifth short entry, is also well known since its adaptation into an episode of the Masters of Horror TV series, directed by Tobe Hopper. The story itself feels a little dated because of Matheson’s future slang (the story taking place in a post WWIII 1997). However, the dance itself is powerfully written. Unfortunately, the ending feels a bit hollow. Tale number six, Dress of White Silk, is an odd number about a troubled child and her deceased mother’s room. The longest story out of the ten, Mad House, concerns a man with severe anger issues, the ending of an eighteen year marriage, and a house that may or may not be out to get him. I found this story to be the easiest to relate too, compared to the other shorts. While the main character isn’t very likable, he’s having problems that many of us face at one point or another. I also found Matheson’s depiction of a break-up on the nose. The Funeral proves a nice rest from the negativity of Mad House. It is a brief comic bit about a funeral home director and a rather odd client who wishes to host a funeral for himself, seeing as he didn’t have a proper one on the first go around. The penultimate tale in this book, From Shadowed Places, is a stunningly well composed story which deals with two subjects that can be quite uncomfortable to read about: African voodoo religions, and racism. Matheson takes a somewhat standard weird tale of a man hexed by a witchdoctor’s curse and turns it into a powerful parable about racism. To say much more would give too much away. If you’re picking this book up mainly for the novel and aren’t too interested in the short stories, at least read this one. It’s the only one quite on the level of the novel. The final story is called Person to Person and involves a telephone and the craziest son of a bitch you might ever read about."}, {"userName": "Wayne Barrett", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/21372390-wayne-barrett", "userReview": "Stephen King has stated that Matheson had one of the biggest influences on him as any other writer and I can see why after reading this masterpiece. This book is actually a collection of short stories accompanying 'I Am Legend' or I may have given it 5 stars...maybe.Already being weakened by the tragedy of losing your wife and child, could you then find it within yourself to survive an apocalyptic nightmare? And if you were strong enough to survive, how long would you even want to hold on to your life as the weight of loneliness slowly pulled you into insanity? Forget the movie adaption of this book that starred Will Smith. I'm not saying the movie was bad, but it was so far outside Matheson's novel that the two barely have any recognizable parallels. As a matter of fact, having watched the movie first, I had no idea that the creatures hunting Neville were vampires. There are only a few vampire novels that I think could surpass or equal 'I Am Legend'. I won't give anything away, but there was only one area of the writing that fell flat or else I would say this was a 5 star novel. If I had not known that Matheson wrote this in 1954 I may not have even noticed the time lapse. It's one of the things that makes this tale so easy to read; it doesn't have that antiquated feel that so many older books do. If you are a fan of horror, especially in the sub-genre of vampire horror, then 'I Am Legend' is a must read."}, {"userName": "Wil Wheaton", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/2040005-wil-wheaton", "userReview": "Everything you've heard about I Am Legend is true: it's scary, the way Matheson conveys Neville's descent into madness is brilliant, the post-apocalyptic world is well-crafted, none of the movies inspired by it do it justice ... and the whole thing feels very dated. This isn't to say that it isn't enjoyable, but if your friends have built this up like it's one of the greatest stories ever told, I'd adjust your expectations quite a bit. It is a great story, an in an historical context, it's pretty impressive and important - it was one of the first times (maybe the first time) a medical explanation was given for vampirism - but it feels like it was written in the 1950s, which may not go over very well with some readers.The volume I read contained some of Matheson's other stories, in addition to I Am Legend, which was a pretty quick read at 170 pages. A couple are real standouts: Buried Talents, The Near Departed, Prey, and Witch War were great, and if the book had just stopped with them, I would have given it 4 or even 5 stars.Ultimately, though, this book is too long, and it overstays its welcome. Matheson has a very distinctive voice, and as much as I enjoyed his storytelling, by the time I got to The Mad House (a story that I would have loved if it was half as long) I'd had enough, and I put it back on the shelf without reading the last few stories."}, {"userName": "Kelly", "userReviewDate": "Nov 28, 2007", "userURL": "http://www.goodreads.com/user/show/195890-kelly", "userReview": "Eh. While I can appreciate the reasons this book is considered influential, in the end I wanted to like it much more than I did. I liked the whole last man standing angle and the scientific approach to the traditional vampire tale was pretty innovative but ultimately I was let down. The erratic pacing of the story and the disjointed narrative grabbed my attention much more than Robert Neville's struggle to survive. For example, on page 55 of my edition, right after Neville realizes his vampiric nemesis, Ben Cortman, looks like \"malignant Oliver Hardy\" and collapses in a fit of laughter the narration, without transition, jumps to Neville driving stakes into unconscious vampires:\"He couldn't stop laughing because it was more than laughter; it was release. Tears flooded down his cheeks. The glass in his hand shook so badly, the liquor spilled all over him and made him laugh harder. Then the glass fell thumping on the rug as his body jerked with spasms of uncontrollable amusement and the room was filled with his gasping, nerve-shattered laughter.Later, he cried.He drove it into the stomach, into the shoulder. Into the neck with a single mallet blow. Into the legs and the arms, and always the same result: the blood pulsing out, slick and crimson, over the white flesh.\" (Matheson, Richard. I Am Legend . 2nd Edition. New York: TOR, 2007).Did I miss something? Is there a misprint in my edition, or is there really no connection whatsoever between these two scenes? I know it's a small piece of the story to fixate on but I couldn't/can't get over it. I must have read this chapter close to ten times trying to figure out what the hell I was missing. Any guesses? Besides the narrative glitches, I also wasn't feeling the ending. For while I love me some fiery apocalypse (in whatever form it may choose to manifest), it would appear that Matheson and Eliot share a common vision of the end. . . \"This is the way the world endsThis is the way the world endsThis is the way the world endsNot with a bang but a whimper.\"  ~(T.S. Eliot, \"The Hollow Men\")"}, {"userName": "K.D. Absolutely", "userReviewDate": "Jul 05, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "This 1954 science fiction/horror novel has already been made into 3 movies: The Last Man on Earth (1964), The Omega Man (1971) and I am Legend starring Will Smith (2007). I saw the last two prior to reading this book so I had an easy time following the storyline. This book is said to have influenced the development of vampire and zombie genre particularly the hypothesis that vampirism is to a disease. Incidentally, this idea will not fly for Edward (Twilight). Girls will not like the idea that their good-looking Edward has bacillus vampirus in his blood and Bella will not get infected by a bite but by Edward's airborne spores? So, Stephanie Mayer will have to stick to the old-fashion bite, the original idea concocted by no less than Bram Stoker in 1897.The storytelling of I AM LEGEND is crisp and calm that provides an interesting twist to the horror and danger that the main protagonist Robert Neville was experiencing. Being the last man on earth, he cried when the wayward ugly dog died. He fell in love thinking that the woman who was found to be a spy of the undead was like himself. Since he has the power to stay in sunlight at daytime, he killed most of the vampires who roamed his place during nighttime. Those that were able to survive developed fear for him and in the end, being the last human being left, he became a legend. Thus the title.In my edition of this book, there are also 10 short stories included. I particularly liked THE NEAR DEPARTED (short but effective) and DANCE OF THE DEAD (because of the flashes of scenes with the mother reminding the daughter not to have a drink when out with friends). At times, I even felt scarier reading these short stories more than following the travails of Robert Neville of the main story.This is my first book for this year's Halloween. I still have 2 more for this week to read."}, {"userName": "Mike Puma", "userReviewDate": "Aug 27, 2010", "userURL": "http://www.goodreads.com/user/show/4193758-mike-puma", "userReview": "Okay, you’re a sci-fi or horror fan. Maybe you are into ‘cult classics.’ Maybe, you just like reading the novels that movies are based on. It almost doesn’t matter. If you’re considering this novella, by all means read it. Matheson does a lot with this story and does it well. Every I is dotted, every T is crossed. Any “what about…” question is answered and every “why don’t…” is spoken to. He does everything you could hope for, except create characters you can care about. Don’t misunderstand, he creates characters you’re quite likely to remember (a form of caring, I suppose) but empathy seems unlikely. I have to rate this novella highly, largely because the author did so much correctly. For a novella/short story, there’s little extraneous—little to fault. I won’t spoil the ending; it’s unnecessary when reviewing. I will say, “Alas, poor Fortunato, I knew him.” The title—its relation to the story—is exquisite. Inspired."}, {"userName": "Jim", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "[ a robot. No sweat, perfect aim, same bowl, etc.. (hide spoiler)]"}, {"userName": "Stepheny", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/7091879-stepheny", "userReview": "2.5This was pretty hit or miss for me. I am Legend is probably the more, if not most, popular one out of this collection. It was not my favorite. I can say that I do see what fans were so angry about with the movie because holy shit, did Hollywood miss the mark on that one or what?!I gave that one 4 out of 5 stars. It contained a lot of science-talk where my brain went into SleepyLand. My brain hates science talk. It gets bored and confused and trips over biology terms it doesn’t like. I also hated that the main character gets referred to by his first and last name throughout the whole entire book. That annoyed me beyond belief. I get it. Last man on Earth. His name is important but holy shit you can call him Robert, or Mr. Neville, or Bob, or Rob. Does it really have to be Robert Neville every time? Robert Neville took a dump in the bathroom at the library. Robert Neville staked a vampire. Robert Neville cried. Robert Neville ate. Robert Neville drank some wine. Robert Neville is drunk. I’m not exaggerating, read it and see for yourself.I had this whole plan of listing each story and giving you my rating but I don’t really feel like it and I took too long and forgot all the ones I didn’t like anyway. (You can look at my status updates for each if you really want to know, though!) I will say only 2 stories in this collection received 5/5 stars.Prey- this was so fucked up, maniacal and evil I just loved it. The horrifying twistedness of it made me literally giddy. I just can’t tell you what it’s about!From Shadowed Places- If you ever want to know what it is I desire in a short story, read this one. It was executed perfectly and had just the right amount of everything. The rest were 1 and 2 star ratings. I was not, overall, impressed with Richard Matheson. I will pick up a few of his books in hopes of changing my opinion. Right now I am disappointed."}, {"userName": "Chris ", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/1956959-chris", "userReview": "What a ride! I loved this book. The title novella was the main attraction, and took up more than half of it. It was very good, a solid 4+ star effort.But what brought it up to 5 was the inclusion of 10 other great Matheson stories. These weren't simple filler; each story was enjoyable (and mostly creepy) on its own.Matheson has a talent for giving readers a snapshot of another world/reality/time/possibility. He doesn't use pages and pages to describe the settings where these stories take place, but just a few words. And they're so vivid. I've commented somewhere that any of these little realities could be so much more. They all have enough imagination and possibility wrapped up in them that they could fill long books or movies without losing anything.Short story collections don't always do it for me. Usually there are a few good ones, but a lot of \"meh\" stuff in between. While I liked some better than others, I can honestly say that Matheson is very consistent. Most writers don't hold up through an entire volume of short work quite this well. The big exceptions to that are Stephen King, as well as his son Joe Hill. Coincidentally (?), both have listed Matheson near the top of the list of their influences.Favorites:\"Witch War\" - just a few pages, but wow. I would love to see this expanded to a huge epic. I love it.\"Person to Person\" - Awesome way to cap off the book. Creep-fest that should have been a Twilight Zone episode.\"I am Legend\" - Main attraction. It's more than a scary story (though it is). It's a tale of survival as well as a story about the psychological effects of isolation. Very layered, simple in its telling but deep in meaning."}, {"userName": "Jennifer", "userReviewDate": "Dec 17, 2009", "userURL": "http://www.goodreads.com/user/show/2850786-jennifer", "userReview": "I only read I am Legend and not the ten short stories that follow in this edition of the book, so my review will only be of the one story I read and not the book as a whole.I am Legend is considered by many as a classic horror story. I previously saw the movie adaptation starring Will Smith and let me warn you now, that movie is nothing like the book. It was very strange seeing Will Smith on the cover of this book while reading about Robert Neville who is very different, physically and mentally than the character Smith portrayed.I am Legend is a not-sexy vampire book, closer to Salem's Lot (King calls I am Legend an inspiration for him) than the plethora of vampire romances today. Robert Neville is the only real focus of the book, being the last remaining non-vampire in the world. We see what he does all day, what he remembers of the past and his attempts to figure out a cure. The vampires are scary, but scarier still is the utter aloneness Neville lives with and his desperation to have someone to share this hell with. I really thought I knew where this story was going, but the last third of the book really shocked me. Having seen the movie did nothing to warn me of what was to come as the book and movie are so vastly different. I found the book to be scarier, but the movie was slightly more entertaining if it's really fair to compare them at all. I am Legend is a must read classic vampire tale with nothing in common with its movie adaptation."}], "description": "Robert Neville may well be the last living man on Earth . . . but he is not alone.An incurable plague has mutated every other man, woman, and child into bloodthirsty, nocturnal creatures who are determined to destroy him.By day, he is a hunter, stalking the infected monstrosities through the abandoned ruins of civilization. By night, he barricades himself in his home and prays for dawn....", "title": "I Am Legend and Other Stories", "url": "http://www.goodreads.com/book/show/929864.I_Am_Legend_and_Other_Stories", "average": 3.99, "cover": "https://images.gr-assets.com/books/1372663310l/929864.jpg", "reviews": 4497, "authors": [{"url": "https://www.goodreads.com/author/show/8726.Richard_Matheson", "name": "Richard Matheson"}], "type": ["Horror", "Fiction", "Science Fiction", "Paranormal", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/929864.I_Am_Legend_and_Other_Stories", "http://www.goodreads.com/book/show/547094.I_Am_Legend_and_Other_Stories", "http://www.goodreads.com/book/show/20326964-i-am-legend", "http://www.goodreads.com/book/show/2174950.I_Am_Legend", "http://www.goodreads.com/book/show/2843195-i-am-legend-and-other-stories", "http://www.goodreads.com/book/show/2370696.I_Am_Legend", "http://www.goodreads.com/book/show/14064.I_Am_Legend", "http://www.goodreads.com/book/show/33547.Hell_House", "http://www.goodreads.com/book/show/33553.A_Stir_of_Echoes", "http://www.goodreads.com/book/show/33555.What_Dreams_May_Come", "http://www.goodreads.com/book/show/33544.Nightmare_At_20_000_Feet"]}