{"ratings": 144, "userreviews": [{"userName": "Sean", "userReviewDate": "Dec 13, 2007", "userURL": "http://www.goodreads.com/user/show/322021-sean", "userReview": "Hm. A little inspiring, a little tame. Probably much more invigorating to the aspiring peace teacher. But more pointed and aggressive than I'd expected from a columnist from the Washington Post.I told Ryan I was reading this and he made some grumbling noises about people who do other careers, then teach for a year and write a best seller. This is a bit better than what I imagine that lot to be, but still an important critique. On the other hand (and maybe most personally relevant to me now...) McCarthy concludes by stating that the only way he was able to be so successful in bringing Peace Studies to such varied audiences (public high schools, colleges, law schools, prison schools) was by NOT making it his primary career. Interesting. Sorta how I feel about culture making in general? IE the corrupting influence of the wage/salary/\"living\"?I'm keeping it on the shelf, I suspect I may revisit over the coming years."}, {"userName": "Thing Two", "userReviewDate": "Feb 25, 2012", "userURL": "http://www.goodreads.com/user/show/3722823-thing-two", "userReview": "When the now retired Washington Post columnist Colman McCarthy was asked to teach a class on writing at Washington's School without Walls, he reportedly responded, \"I'd rather teach peace.\"This book is a collection of lectures given over a period of time to students all across the country. McCarthy believes if we don't teach peace to our children, someone will teach them violence. He's adamantly against war and lectures on non-violence, conflict resolution, and pacifism. My favorite lecture was one that included an exercise to cause students to reflect on the manipulation of authority. Excellent book - it should be required reading for all high school students."}, {"userName": "Brent Fernandez", "userReviewDate": "Apr 11, 2009", "userURL": "http://www.goodreads.com/user/show/1983771-brent-fernandez", "userReview": "if you teach social justice at any level, or wish to incorporate social justice in your classroom for any subject, please read this book."}, {"userName": "Stephanie Moran", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/6176855-stephanie-moran", "userReview": "I absolutely loved this book.McCarthy shares with the reader what a semester of teaching peace is like. He discusses his tactics with different groups of children/teens/young adults. I liked a lot of his ideas. Many of them reminded me of the way I hear my grandfather talk - for example - McCarthy states that students should ask for a refund of their public education because they don't teach the other side. Students know all about war and war generals - but we don't learn about peace advocates - save Martin Luther King Jr. - but even then, we don't hear his anti-war messages.This book is chalked full further resources, which is what I was primarily grateful for."}, {"userName": "Gabriella Bugge", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/50376535-gabriella-bugge", "userReview": "A must-read for anyone in education and anyone interested in peace studies or the promotion of peace studies."}, {"userName": "Larry Bassett", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "If you have a shred of idealism, read I’d Rather Teach Peace by Coleman McCarthy. The idealistic part of you will love you for it. It made me admire Colman McCarthy all over again. This book and its nonviolent message deserve every one of the five stars I am giving it.I am a lapsed peace activist. I have retreated to primarily being a financial contributor to the peace and justice movement. I am proud of my past activities and actions for peace that included community organizing and civil disobedience. I am willing to bet that, like me, Coleman McCarthy would like to do more. I try not to feel too guilty that I am merely a cheerleader. Books like I’d Rather Teach Peace remind me of my heritage of radical activism and give me hope that a new generation will take the struggle from the present to the future. Colman McCarthy was, for many years, a syndicated columnist for The Washington Post. He still writes occasional op-ed pieces. Last I heard he was teaching peace studies classes in high schools and colleges and speaking regularly at conferences. I once sat in on one of his classes in Bethesda, Maryland. I wanted to work out a partnership with Colman so we could do this work together. We talked about my proposal but Colman chose to continue volunteer teaching on his own, funded by a small non-profit, the Center for Teaching Peace, run out of his home. I was disappointed since I was sure he would want someone to join him in his work. I experienced rejection, something that many have to deal on a daily basis. But McCarthy remains a guide as to how someone can reach out to the entire age range of students and show them another way to think about the world. He teaches them about Gandhi, about King, about Dorothy Day, about the Berrigan brothers, and other people who chose a path of nonviolence.This is a how-to book. It shows by example how to teach nonviolence from preschool to law school. You get to sit in on the classes. The author has years of experience teaching peace and shares those experiences with us. And in that sharing, he teaches us about peace and nonviolence. It is an idea that is not in the main stream of American life. Pacifism is not something that boys and girls aspire to. McCarthy says that we have to change that, one person at a time, if we are to change the world. The book delves into animal rights, prisons and the justice system, the death penalty, the honor of teaching. These are all part of the realm of nonviolence.Why should you read this book? You want to learn about the history of nonviolent action. You want to learn about peaceful alternatives to war and violence. You are interested in contributing in some way to making a more peaceful society. You hope to become a better person and make a difference in the world. You want to achieve a greater awareness of the world. You want to further your own spirituality. You want to broaden your view of the political spectrum. These are some of the reasons students told McCarthy they had enrolled in his peace education classes. If you read this 140 page book, you will probably find yourself learning and changing. You will be encouraged to do something."}, {"userName": "Kelly", "userReviewDate": "Dec 25, 2008", "userURL": "http://www.goodreads.com/user/show/815638-kelly", "userReview": "This changed my perspective on the way I lived my life to the subject I wished to teach. I no longer saw history as a string of wars and economic crisis'. The work of Colman McCarthy inspired me to research and incorporate peace education into my daily teaching and my Masters project. This book is excellent for anyone interested in breaking the pattern of apathy, whereever they encounter it. You don't have to be a teacher.Like I said about the Alchemist...read it, it'll change your life."}, {"userName": "Abigail", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/29586892-abigail", "userReview": "This book is an inspiring collection of thoughts pulled from the mind of the wonderful Colman McCarthy. This book is well thought out and filled with shocking bits of knowledge that will make you think differently about the current state of our government, our peers and ourselves. I highly recommend this book to any person who desires to learn more about the world we live in and how to change it for the better."}, {"userName": "Tamela", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/499980-tamela", "userReview": "\"Tolstoy's, \"Patriotism or Peace\" equates personal egotism with national egotism. egomaniacs who are self-absorbed, who boast in subtle or obvious ways about their superority are seen as irrational, while collectively a nation can do the same and claim it as patriotism.\"\"Self-reflection, which is essential both for personality developement and change, is hard at any age...\"\"People in non-violent struggles are not unarmed. They are simply not armed with violent weapons.\""}, {"userName": "Liz", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/4423540-liz", "userReview": "This is a short book based on real life experiences in his classrooms. I kept wanting to take notes or underline passages throughout the book. It was eye-opening to see how \"violence\" is built in to our culture. I like a book that gives me a different perspective on how to see the world- \"Confessions of an Economic Hitman\" and this book, to name two, have done that for me. This is a book to read more than once. I gave my copy away about 3 years ago and I never got it back!"}, {"userName": "Emily", "userReviewDate": "Jul 21, 2009", "userURL": "http://www.goodreads.com/user/show/1852380-emily", "userReview": "Amazing, amazing, amazing.I have never sobbed through a book before, but it was well worth it. Every parent, teacher, student, (etc) should read this book. It truly made me think and really evaluate my life. (Sounds cheesy, but it's true!)"}, {"userName": "Mary Katherine", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/4984838-mary-katherine", "userReview": "An excellent introduction to the idea of peace education and a variety of the topics it can encompass, written with passion and from experience. A worthwhile critique of public school curriculum and organization."}, {"userName": "Eric", "userReviewDate": "Apr 06, 2008", "userURL": "http://www.goodreads.com/user/show/1012448-eric", "userReview": "Colman was the teacher that changed the direction of my life, and set me on the path that I'm now on today. Truly one of the best peace educators in the country today and still giving his life to this desperately needed work."}, {"userName": "Andy", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/5916924-andy", "userReview": "A must for anyone interested in how to teach peaceful concepts in the classroom, or for anyone who wants to expand their views a little."}, {"userName": "Beth", "userReviewDate": "Jan 23, 2008", "userURL": "http://www.goodreads.com/user/show/820402-beth", "userReview": "A thought-provoking read."}, {"userName": "Cappy", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/1213054-cappy", "userReview": "It's cliche - enough even to appear on the cover of the book - but this book really should be required reading for teachers."}, {"userName": "Lashanda", "userReviewDate": "Mar 18, 2008", "userURL": "http://www.goodreads.com/user/show/1003620-lashanda", "userReview": "My ex-boyfriend gave me this and he's a teacher. It's inspiring and thoughtful and really makes you believe in the ideal of a more peaceful world."}, {"userName": "Jill", "userReviewDate": "Aug 07, 2010", "userURL": "http://www.goodreads.com/user/show/4063472-jill", "userReview": "My inspiration for teaching peace studies."}, {"userName": "Glen Gersmehl", "userReviewDate": "Dec 26, 2014", "userURL": "http://www.goodreads.com/user/show/31165932-glen-gersmehl", "userReview": "by one of the great teachers of nonviolence"}, {"userName": "Kezia", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/7398206-kezia", "userReview": "What a great tome on teaching peace and the lasting effects it can have. I think I should start with my own home. This is a real motivator. I wish I could take his class."}, {"userName": "Jim", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/14203336-jim", "userReview": "Good read. We need more teachers like this."}, {"userName": "Beverly", "userReviewDate": "Feb 28, 2008", "userURL": "http://www.goodreads.com/user/show/951202-beverly", "userReview": "Love, Love, Love this book! It is short and a super fast read, but it will change the way you look at education forever. I've met the arthor and he is wonderful."}], "description": "For twenty-eight years Colman McCarthy was a syndicated columnist for The Washington Post. In 1982, when he was invited to teach a course on writing in a public school in Washington, D.C., he responded, \"I'd rather teach peace.\" What began as an experiment became a full-time career.McCarthy went on to teach his course on peace in a range of schools from a suburban high school in Chevy Chase to a juvenile prison, as well as Georgetown Law Center. I'd Rather Teach Peace tells the story of what goes on in these classrooms as McCarthy not only introduces the theory and practice of creative peacemaking but constantly surprises and challenges his students, subverting expectations about what education and life are really about.", "title": "I'd Rather Teach Peace", "url": "http://www.goodreads.com/book/show/302843.I_d_Rather_Teach_Peace", "average": 4.39, "cover": "https://images.gr-assets.com/books/1348162897l/302843.jpg", "reviews": 22, "authors": [{"url": "https://www.goodreads.com/author/show/174508.Colman_McCarthy", "name": "Colman McCarthy"}], "type": ["Education", "Teaching", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/302843.I_d_Rather_Teach_Peace", "http://www.goodreads.com/book/show/4631079-i-d-rather-teach-peace", "http://www.goodreads.com/book/show/1176305.All_of_One_Peace", "http://www.goodreads.com/book/show/4754699-strength-through-peace-the-ideas-and-people-of-nonviolence", "http://www.goodreads.com/book/show/23368343-teaching-peace", "http://www.goodreads.com/book/show/14118620-the-class-of-nonviolence", "http://www.goodreads.com/book/show/1176307.The_Pleasures_Of_The_Game", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}