{"ratings": 9733, "userreviews": [{"userName": "Joe Valdez", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "[feels her future being choked out of her (hide spoiler)]"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/3.5 StarsWelcome to . . . . \nI decided to take a break from my usual selections . . . . \nAnd read listen to this oldie-but-goodie to celebrate my favorite time of year . . . \n(Spoiler Alert: He’s really going to murder her for being a basic white bitch.)After having a pretty meh time with Killing Mr. Griffin during Banned Book Week, I set my expectations super low before starting this one. Imagine my delight when I ended up really enjoying it. The basic premise was the same – group of drunken stumbly teenie-boppers kill someone in a hit and run and then decide . . . . \nLittle plot twist: in the book version they didn’t run over an adult – instead it was a kid . . . . \nA year goes by when suddenly the teens start receiving notes . . . . \nThat have them concerned their secret might get out. Or worse . . . . . \nI Know What You Did Last Summer stood the test of time surprisingly well. While it has obviously been updated since its original release back in the ‘70s, a more thorough job was done here making the modern-day references more effortless instead of standing out like a sore thumb. It does date itself with antiquated remarks regarding things of a “girly” nature, but if you aren’t of the easily offended variety, you can simply laugh it off as talk of the olde days of yore. Although I did see the whodunit from about a football field away, there was a little something extra that I wasn’t really looking for that ended up being a pretty decent bonus. Fairly PG (references to underage drinking and smoking pot that wouldn’t pass the test with some parents) for youngsters to read this Halloween season."}, {"userName": "Rebecca McNutt", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Not the greatest film in the world and even worse of a book. I Know What You Did Last Summer is so cheesy and predictable that it seems almost on-purpose. The characters are ridiculous caricatures of \"typical teens\" and they acted completely ridiculous at the best of times."}, {"userName": "Darth J ", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/18974711-darth-j", "userReview": "[ Johnny Galecki's character from the movie  (hide spoiler)]"}, {"userName": "Christian Guzman", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/27310486-christian-guzman", "userReview": "I read this novel in one sitting. It wasn’t the most enjoyable book I have read, but it wasn’t unexciting either. I would have probably enjoyed this novel way more if I had read it when I was about 13 years old. The concept and plot of the book grabbed my attention which is why I decided to read it. Also, the length of the book was ideal, just in case if I didn’t enjoy it I wouldn’t have wasted too much time on it. It was quite entertaining, but it lacked suspense for me. At first I found it to be captivating, but during some chapters I felt like it was predictable. I did however enjoy the main characters, I felt like they were well written and weren’t confusing to keep up with. The author didn’t flood you with an excessive amount of characters in the novel so you could easily distinguish them from one another. I felt like I was watching a horror movie as opposed to feeling as if I was in the characters' shoes. I also expected a more intense ending. Nonetheless, if you are looking for a quick read that is also entertaining, this is an adequate book!"}, {"userName": "Diego Sanchez", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/66852158-diego-sanchez", "userReview": "3.5 stars As plenty of you, I know this movie since I think it is one of the most representatives from the 90's and one of my favorites may I say, since it has an iconic cast and I found it fun and suspenseful as well. Sadly, if you are looking to see the movie turning into a book you will be wrong (As me) and here are my thoughts:*Plot/Development: This book tells us the story of four teenagers who are involved in an accident, that ends up wrong since it turns for them to kill someone. Months later, Julie receives a letter with “I know what you did last summer” written on it and by then, everything changes.Honestly, the plot is always there, you will found it in every chapter and each one of the character is “tortured” in different ways, so that causes the students to create changes in their way of seeing their lives. The Development is a page turner, but I think it is very predictable since the middle of the book, at least for me, even though I read it till the end because I wanted to know what would happen.*Characters: With four main characters (two boys and two girls), it was amazing the fact that they had this oldie vibe and even when they are the cliché personalities (Good, Bad, Innocent, Silly, Handsome, Pretty, etc.) I found it interesting and I think this can be passed on because of the time it was written. As for the secondary characters, all of them play an important role: Parents changing situations and Friends creating gossips.*Genre: This is a YA Mystery which plays very good with it, I recommend it for the people who wants to get introduced in this genre and love the old vibes. It is not scary at all and if you love cheesy movies or books, this one would be your choice.*Ending: As I said previously, was predictable since the middle of the book for me, but for certain reasons, I enjoyed how it ends, not because it was the best ending, but because of the resolution and conclusion of ideas that were presented at the beginning. Could be an open ending, but based on the time that was written, it is an ending that could be totally inferred.*Writing: I read the second version of the book, which was re-written, so there is no other more to say that you will be reading a classic writing with “new” fashion vocabulary.As an extra, I loved the reader questions and the Q&A with the author, because my doubts about the film were solved.Favorite Character: HelenFavorite Quote: \"If you can't run away\", Julie said Chokingly, \"What can you do?\"\"Face up to it\""}, {"userName": "ChunderHog", "userReviewDate": "Aug 07, 2009", "userURL": "http://www.goodreads.com/user/show/886878-chunderhog", "userReview": "!!WARNING THIS WARNING CONTAINS A SPOILER THAT THIS BOOK WAS MADE INTO A MOVIE.!!Hopefully you didn't just read that. For those of you who were smart enough to skip that spoiler you can now read in confidence knowing that you will not be told that the book was made into a movie. You will live in happy naivety thinking that the book is a self-contained form of media in which this narrative lives. Unfortunately, you will be wrong.Since I have neither read the book, nor seen the movie. I can safely say that I am an objective critic when it comes to comparing the book to the movie. At this point I rate them dead even. Their titles are exactly the same and I have mild interest in finding out what occurred last summer in either format. In the movie I will expect great special effects and bad acting. In the book I will expect suspense and action emphasized at the expense of thematic meaning. The problem with comparing books and movies is that one tends to regard the version one experienced first as the gold standard. To avoid this I plan on reading the book and watching the movie at the same time. If I get too far ahead in the movie compared to the book, however, it will be the same as watching the movie first, so I plan on finishing the two simultaneously. I will accomplish this by enrolling in a speed reading course and by watching the movie on my old VCR that seems to be running at 1/4 speed.Everybody wish me luck! I'll update with results as I get them."}, {"userName": "Karschtl", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/321508-karschtl", "userReview": "Four kids drive home after a high-school-party, everyone - including the driver - a bit intoxicated and tipsy. Then happens what always happens in such situations: an accident on a dark road. They knocked over a young boy, riding with his bicycle. For fear of the police they don't administer first aid but instead do a hit-and-run.One year later - they've almost forgotten the incident - they're reminded of it via mysterious letters. Someone outside of their circle seems to know their dark secret. Lois Duncan wrote this book (and several other horror-mystery-books for teenagers) in the 1970s. In 1989 the storylines of her books caught up with her real life: her youngest daughter (18 at that time) was murdered under suspicious circumstances and found dead in her car. The case was never solved.More than 20 years after it was published, this book was made into a Blockbuster-movie, following the success of \"Scream\". Duncan herself despises the movie because almost the whole story was changed (a full list can be found on Wiki) and the drama about four teenager struggling with their guilt and own conscience was turned into a slasher-movie."}, {"userName": "Emily", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/7263649-emily", "userReview": "Wow. I remember loving this book as a 7th grader. Oh, how my tastes have changed. It was so bad. Nothing happens: boring, boring, boring! The only interesting part is what everyone already knows about the story."}, {"userName": "Bethany Ainsworth", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/22237668-bethany-ainsworth", "userReview": "I got this book because of the movie that I never watched. It seemed interesting, but reading the book made me feel so bored, I was positive that I would've actually turned into a board. That's how boring this book is."}, {"userName": "Trisha", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/1238273-trisha", "userReview": "I loved this guilty pleasure read. I thought it was different from the movie,but then again I couldn't really remember the movie. I think I was just in the mood for some mystery and silly suspense."}, {"userName": "Reading is my Escape", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/9411489-reading-is-my-escape", "userReview": "I Know What You Did Last Summer - audiobook  I wasn't a fan of this book at all. I didn't expect much to start with, I was just curious because I've seen the movie. Anyway, the voices the narrator did for certain characters were annoying. The characters themselves were flat and shallow and I didn't like any of them or care if (when) they died. There was very little to the plot and it ended too suddenly."}, {"userName": "Amy Y.", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/4421424-amy-y", "userReview": "\"I Know What You Did Last Summer\" is about these 4 teenagers named Barry, Julie, Ray and Helen had all coped with one little secret they had tragically kept for their whole summer. As things began to clear up, Julie recieves a threatning message... Immediately, Julie knew that someone has figured out her secret, a deadly secret. Julie and her friends undergo obstacles to find the messenger and put a end to their nightmares. They need to outsmart the killer before all of them dies before they even know it.\"Ummm\" was my first reaction after finishing this book. In my opinion, I don't really like this book at all. It wasn't very suspenseful, for my taste. In addition, it wasn't very scary. I am not a big fan of having teenagers trying to figure out who the killer was and undergo all of those crazy situations. I never like those kinds of books. The beginning of the story was very slow as well, which made it more boring for me. If I would've rate this book on a scale between 1-10, I would give it 6 for effort but a 1 for orginatlity."}, {"userName": "Audrey Maran", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/9025860-audrey-maran", "userReview": "I grabbed this at a used bookstore on a whim because I had no clue the movie was based on a book. In my experience, horror stories do not transfer well to film sometimes, so I thought I would see if the book is any good. It is actually worse than the movie. Didn't think that was possible? Then be prepared to have your mind blown, because it is. Least likable characters of all time. Sometimes, an author does that purposely, and I love that. In this case, I don't think it was deliberate. On top of that, Lois Duncan is absolutely obsessed with beauty. There were characters where the actual reason for one character not liking another was because they were 'dumpy and pudgy and not at all as pretty as her sister.' Anyway, not really worth reading unless you have nothing else to do with three hours."}, {"userName": "Susan Mackie Powers", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/27009520-susan-mackie-powers", "userReview": "I was not at all impressed with this book. The movie was cheesy, but fun, but the book was just silly. For one thing, none of the characters were likable; they just seemed like stereotypes of the different cliques we all knew in high school: the beauty, the jock, the brain, and the nice guy. The four main characters were out partying and driving too fast, when a little boy on a bike suddenly appeared in the road ahead of them. They hit the boy, and kept right on driving to save their own necks. One year later, they all begin receiving contact from someone who claims to know what they did. One by one, they figure out who is threatening them. Will they survive? To be honest, I cared so little for the characters that it didn't matter"}, {"userName": "Paula Brandon", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/60858230-paula-brandon", "userReview": "[In the book, two characters turn out to be the same person, but there's no way to translate that to film! I enjoyed the movie as a throwback to 80s style horror, and the Sarah Michelle Gellar chase scene is a ripper! The scene with Helen in the book as she tries to escape the killer was tension-filled too! (hide spoiler)]"}, {"userName": "Quill Ampersand Key", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/69857288-quill-ampersand-key", "userReview": "It’s been a year since Julie, Ray, Barry, and Helen accidentally killed a young boy. They ran over him in the dead of night and left him for dead, swearing never to speak of the incident again. But someone knows. Someone, who is now sending the four teens threatening messages…Lois Duncan had been writing thrillers and horror stories since the mid-60s, but I Know What You Did Last Summer and the 1997 film adaptation shined the spotlight on her work and had teens passing her books around twenty-five years later. For that reason, I Know What You Did Last Summer, is a classic book in the YA horror cannon.Read the full  I Know What You Did Last Summer  Review"}, {"userName": "Katie", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/5241292-katie", "userReview": "I slogged through this disaster because of its short audio version. Just horrible -- excruciating and outdated. The bad guy was so obvious, I was sure it was a red herring. And they tried to \"update\" it for modern audiences by throwing in some cell phones (always on chargers or left behind), CD players (😂😂😂), a GPS and swapping out Vietnam for Iraq. So seriously, nauseatingly terrible."}, {"userName": "Jessica", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/34951827-jessica", "userReview": "Not much to say to be honest, I think I may prefer her later books when I read them. I originally thought the book was from the late 80's, so when it was said Bud was an older guy who went to Vietnam, I was like \"Daaaaamn, how much older?!\""}, {"userName": "Allyson", "userReviewDate": "Jul 04, 2008", "userURL": "http://www.goodreads.com/user/show/1241365-allyson", "userReview": "Great horror book for anyone who loves mysteries and horror combined!"}, {"userName": "Josiah", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/1914201-josiah", "userReview": "If I were to describe Lois Duncan's writing style after reading only this book, I might say she's something like Robert Cormier, only much softer around the edges. The dangers to her characters don't feel as intense or physically sickening, stress building until the immediacy of the coming crisis sits as heavy in the reader's stomach as if it were actually happening to him or her. Though the plot of I Know What You Did Last Summer is, at least on paper, similar to a few Cormier novels, Lois Duncan takes a different tack in creating a suspenseful narrative. The story unfolds in a more relaxed manner, less like it's actually happening to the reader and more like he or she is watching a scary movie from the safety of home. It makes sense, then, that I know What You Did Last Summer was adapted into a 1997 motion picture, drawing an impressive cast of major young actors who propelled the film to become even more popular than the book which spawned it. But it all started with this novel in 1973, a notable offering of teen suspense lit that Lois Duncan is remembered for more than anything else she has written. Though she penned many other novels, some targeted at teens (Killing Mr. Griffin, Stranger with My Face, etc.) and some meant for kids (most significantly Hotel for Dogs, which was also made into a major motion picture), I Know What You Did Last Summer may endure as Lois Duncan's signature work.  It all starts not with the fateful car accident from a year earlier, but with a note left beside Julie's breakfast plate along with her college acceptance letter on a morning like any other. An incident left to decay in the uncertain ether existing between four guilty teenagers is thrust back into the light of day when Julie reads the note, proclaiming that someone knows what she did. Panicked that some individual has evidently become aware of the shameful coverup she and her three friends have longed to forget yet know deep down they never will, Julie goes to Barry, Helen and Ray with the cryptic warning she received, to see how they want to handle the situation. Emotional rhetoric erupts, with a variety of wild explanations for what might actually be happening. How could anyone know what the four of them did that night a year ago behind the wheel of their car, slightly drunk and influenced by recreational drugs, as well? And why would whoever it is be coming forward with the information so long after the fact? Furthermore, why wouldn't this person go to the police, instead of just threatening the perpetrators? Barry and Helen aren't even convinced the note has anything to do with their hidden transgression last summer, and urge Julie to forget her apprehensions and try to put the ugliness of the incident behind her for good. As additional vague threats surface, however, directed at the others as well as Julie, it appears increasingly less likely the mysterious notes could be merely coincidental to the secret they are keeping. Someone out there is intent on gaining retribution for the irreversible, tragic actions of that horrible night when a young life was cut short by four frightened teens unwilling to place their futures in jeopardy to own up to what they'd done, and the time has come to pay for their negligent crime. The killer lurks much closer than Julie or her friends realize, but has been careful to leave no trail to follow, no way of knowing who the vigilante is or what connection he or she has to the family devastated by the tragedy of a year ago. Can these four teenagers kept captive by their past figure out the identity of the stalker before they all become victims of his or her obsessive need for vengeance? \"There's something about being alone with no one to fall back on. You start learning how to fall back on yourself. You settle down in your mind and get your thinking into balance.\" —Ray Bronson, I Know What You Did Last Summer, P. 136 An unknown killer isn't the only factor pressing the action as Julie and her friends bump around in the dark, uncertain what their lives have become. The feelings of guilt sit so heavy they are almost unbearable, made so much worse because the four unwilling offenders escaped any punishment for their lethal misdeed. They avoided being tied at all to the accidental vehicular killing by fleeing the scene of the crime and phoning it in from elsewhere, but the four of them know exactly what they did, and nothing can erase the dark stain on their consciences. Julie feels it most; she wanted to head back and face the music from the start, be upfront with the authorities about all that happened and accept whatever punishments the justice system deemed fit. But Barry was driving the car that night, his judgment moderately affected by alcohol and drugs, and the thought of spending time behind bars and disrupting his promising young life was enough motivation for him to run from the police. Helen, Barry's girlfriend, seconded the idea, and Julie's boyfriend Ray surprisingly supported it as well. Thus, the pact was sealed, but no agreement can assuage the suffering of guilt laid upon a stricken human heart. Julie may have had it right all along; perhaps the only way for any of them to ever move on from the horrible mistake they made that night is to own up to the disgrace and take whatever punitive measures await. At least then the haunting memories of a child's life cruelly ended too soon might at last fade into the painful background of a life in which we all do things we'd rather forget. Even if the pain in our heart never does fully disappear.  Lois Duncan is an engaging writer, a seasoned pro at churning out sentence after sentence that appeals to all five senses. Her minimal stops for optional punctuation create a free-flowing story that reads smoothly and keeps the reader's mind always in the action. I Know What You Did Last Summer has moments of frightening violence but without ever being graphic, quarrelsome conversations without resorting to inappropriate language, and provides solid entertainment if you're looking for a good scary story."}, {"userName": "Natalie", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/86360-natalie", "userReview": "I was disappointed that changes were made to make this book more modern! Trying to update this book with mentions of email, texting, and the Iraq war (instead of Vietnam) really didn't work. The world view, etc. is too deeply seventies. It would have been more fun to read the original."}, {"userName": "Mehsi", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/6720768-mehsi", "userReview": "[ What revenge part? Not much happens, and by the time it really gets exciting... the book ends. Yep, the craptastic ending of all! Anti-climatic as hell too. The horror begins the book blurb tells us, yes the horror of falling asleep and being bored out of your head.  (hide spoiler)]"}, {"userName": "Misty", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/21374967-misty", "userReview": "2.5 StarsI came across this book sometime last year at a library book sale. I didn't know this was a book. I watched the movie a long time ago and I've watched it several times since then. When I saw this at my local library I decided to get it because I actually really liked the movie and I assumed I would enjoy the book just as much if not more. Unfortunately that wasn't the case for this book.As I mentioned above I watched the movie long before I ever read the book so its possible that if I had done it the other way around I would have actually really enjoyed the book. I was expecting this to be pretty similar to the movie but it was completely different.I can't really get into all the details of everything that's different without spoiling the whole book so this is going to be a hard one to review. Most of the characters were so annoying. Even though I watched the movie and knew how it was going to end because of all the changes I didn't know the who did it aspect but it was all very predictable. It's classified as a suspense thriller and to me the suspense was severely lacking.I know this review makes absolutely no sense but I just don't know what to say about it. I think the only reason I even continued reading this book was because I had seen the movie and loved it."}, {"userName": "Carolyn  Storer", "userReviewDate": "Feb 03, 2011", "userURL": "http://www.goodreads.com/user/show/2449271-carolyn-storer", "userReview": "As with many of you, I watched the movie 'I Know What You Did Last Summer' many years ago and didn't realise it was actually based on a novel. I say based loosely as the film doesn't really have much to do with the book - whereas the film is much more in the 'horror' genre, the book is just a light thriller.It was originally written in 1973 but I read the newly revised edition published by Atom. I'm not fond of revised books. I much prefer to read the original version, I don't like the idea of an author going back and changing aspects of the book that made it what is was. In this case 'I Know What You Did Last Summer' was a book rooted in the 70s, but the updates try and change it to current times by modifying certain elements. It didn't really work for me as the story and characters felt as though they were still very much from a different era and yet they were talking about mobile phones, emails and the internet.With this aside, 'I Know What You Did Last Summer' is an entertaining read. It does contain a certain amount of tension, although not as much as I would have liked, and I read it fairly quickly. I must admit that I didn't really like any of the characters, with maybe the exception of Ray. Julie, Helen and Barry all had many unattractive traits which prevented me from finding them likable in any way. Unfortunately the book isn't as intense as the movie and I did find this a little disappointing as I do like to be scared and given the willies...It maybe because nowadays we are saturated with high levels of blood, gore and violence (which I have no problem with, being a horror fan) and 'I Know What You Did Last Summer' just seems lame in comparison. I wonder if it created more of a reaction in 1973?It's a very short novel too, only 211 pages, so I think it was difficult to get enough character depth and suspense going in such a short space of time. I also saw the twist coming a mile away, as I so often do, and so the ending was predictable and also happened far too quickly. It would have been better if it was drawn out a little longer, especially when the characters were being tormented by the villain, but it was all over in a matter of pages.VERDICT:Despite all the negatives, 'I Know What You Did Last Summer' is a quick, entertaining bite-sized thriller (I say bite-sized as at only 211 pages it's a pretty short novel). However, it was disappointing to find that the thrills and chills were mostly kept for the movie and not the book. I also wish I had read the original work and not a revised edition."}, {"userName": "Liz Sealey", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/34327979-liz-sealey", "userReview": "In I know what you did last summer, the four main characters, Ray, Barry, Helen, Julie find themselves in a rather horrifying accident. The four college kids are driving late at night and they accidentally hit a young boy, who was crossing the street at that time. A year later, unexplainable murders begin to take place, this eventually takes a huge toll on them physiologically and one by one they become partly insane. I think Lois Duncan did a good job of setting up a suspenseful storyline especially when it came to adding in all of the correct literary mechanics in their respectful places. For instance, after the accident the four swore to secrecy to keep anyone from knowing about it; however each person begins to receive an anonymous letter simply stating \"I know what you did last summer.\" This builds suspense in the story because each time a character receives the letter, an unfortunate event occurs and it leaves the reader guessing on how the story is going to play out for the character. I found it interesting how the author had the characters try to keep themselves sane by mentally rationing things out in their head. For example, one of the main characters, Barry tries to calm himself as he has just read the chilling letter, \"Coincidence, Barry told himself impatiently. I'm acting as up-tight as those crazy girls.\" (Lois Duncan 21). This leaves a more humanizing effect on the character as well as giving the situation a bit of a surreal feeling, instead of having the characters posses the common ability to hold themselves together. One message that a reader could take from this novel is to be aware of who knows your secret because if it ends up being heard by the wrong person, the outcome could be devastating. I would rate this book a four out of five stars. I gave it that rate because I thought it was a good suspenseful book and I liked the characters in the book. I would recommend this book to a reader who likes suspense and drama. If a reader favors suspenseful horror books that were turned into movies, this book would be a great fit for that person."}, {"userName": "Mark", "userReviewDate": "Feb 05, 2008", "userURL": "http://www.goodreads.com/user/show/859623-mark", "userReview": "English 425\t\t\t\t\tSubmitter’s name: Mark PlaugherBook Bank\t\t\t\t\tBook Bank subject: Power PlayerReference information: Title: “I Know What You Did Last Summer”Author: Lois DuncanPublisher: Little, Brown and Company\tYear: 1973# of pages: 199\tGenre: Fiction NovelReading level\tInterest level: Middle School studentsPotential hot lava: Nothing out of the ordinaryGeneral response/reaction:I had seen the movie before I had read the book so I knew somewhat what the story was about. The book however, was different by far from the movie. There were twists and turns I had no idea about.Subjects, Themes, and Big Ideas:Suspense was definitely the theme throughout this book. A Teen book about what’s right and wrong. Kept you thinking the entire time.Characters:Julie- High School Senior, going to smith in the fallHelen- Golden Girl for Channel 5 News, good friends with JulieBarry- Helen’s love interest plays football at the University in townRay- Julie’s ex-boyfriend, moved away to California for a while, came back into townPlot summary:\tFour friends are out on a summer night joy riding, having fun and not paying attention. Little did they know what they were in for a year later.Strengths (including reviews and awards):\tI did not find any awards for this book. The movie apparently did really well.Drawbacks or other cautions:\tIf you are not into books about murder or suspense, this book is not for you.Teaching ideas:\tI would use this book to teach in a class. But if I was to teach it, it would be more of a free-lance book the students would read on their own. Asking the students at the end, what they would have done differently if they were the main characters and how they would have handled the situation."}, {"userName": "Jessica", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/7556661-jessica", "userReview": "My mother recommended this book to me. She's not a reader, but she did remember that she read this in Junior High and that she liked it. I read it because now it's something that we have in common. The feel of this book reminded me instantly of Richard Peck's Are You in the House Alone? mixed with a teenaged version of Agatha Christie's And Then There Were None. There are differences as well. It isn't exactly how I just described it, but all three have the anonymous threatening letters involved and a mysterious figure out to cause the main character's harm. (By the way, none of that is a spoiler. The reader practically goes into the book knowing this is going to happen.) It kept me interested. This isn't typically the type of genre that I go for. I can handle a murder mystery, but dislike when the wacko is lurking in the shadows, plotting his next move. I'd say that I liked it more than I thought I would. The climax IS the ending and I Hate that in stories whether it be in a movie or book. I'm the type of person to enjoy a bit of resolution before the close, not just BOOM! THE END. Now I'm going to check out how the movie version played out."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Sep 04, 2012", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "I've found that I love Lois Duncan's writing style, her stories, and her hidden layers, but this one fell a bit short. It's ironic since out of the stories I've read of hers, this is inferior, but it's the most popular because of the movie.The film, by the way, is much different. We don't get a hand hook killer tracking down the teenagers. Here it's a mini mystery. The ending is rather simple and cheesy. Backstory is depressing, you feel for the victim and the consequences. I liked the main character and her personality shone through pretty well. Since the pool of possibilities is narrow, the villain isn't a huge surprise. I dug the twist about the flowers and it's false impressions, painting a potential hero as the ultimate enemy.Tension is present, although nothing heart-pounding. There's little gore and a lower body count than the movie. As with the film, the sister of a character is unlikeable, maybe even more so in written form. The book is short so the pacing is fast, but there's not much space to draw anything out or dig too deeply into characterization.The opening of the book was interesting enough, although the center was the most rewarding, as it was going in different directions and actually building something. Even with the ending being an anticlimactic rush, it's a passable book, even if it's not one of Duncan's best."}, {"userName": "Marcus Simon", "userReviewDate": "Mar 07, 2010", "userURL": "http://www.goodreads.com/user/show/3338788-marcus-simon", "userReview": "This book is about some teenagers that went camping but the bad thing that happened when they were coming back home for their trip, there was a little boy on a bike who drove on the road. And the kids were drunk when they were driving so they didnt see him. So the teenagers hit the little boy on the bike, and they did kill that little boy. They made a pact to never tell anyone about it or ever bring it up again. It was working to, until this one little note that changed their lives forever.On this note said \"I KNOW WHAT YOU DID LAST SUMMER.\" that short sentence scared them to death. Then over the next couple of months these teenagers pretty much had someone stalking them. They kept getting werid letters and thiungs in the mail. One of the letters that were sent was a picture of the little boy that they ran over. So now they are just trying to figure out who was doing this to them. But that is all im going to tell you if you want to know what happens next your just going to have to read the book yourself.I would recommed this book to someone who is very into book that will make you think that there is know way that happened. It is a very good thriller book that will keep you at the edge of your seat. It is full of suspence and if your one of those people this is the book for you."}], "description": "One evening last summer a young boy was run over and killed by accident and the four young people responsible say nothing. But someone does know what happened that night and is intent on getting revenge on them all.", "title": "I Know What You Did Last Summer", "url": "http://www.goodreads.com/book/show/10380656-i-know-what-you-did-last-summer", "average": 3.51, "cover": "https://images.gr-assets.com/books/1347374725l/10380656.jpg", "reviews": 821, "authors": [{"url": "https://www.goodreads.com/author/show/26819.Lois_Duncan", "name": "Lois Duncan"}], "type": ["Young Adult", "Horror", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/10380656-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/7886313-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/9946623-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/47763.I_Know_What_You_Did_Last_Summer", "http://www.goodreads.com/book/show/9456082-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/3579391-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/8038330-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/6434437-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/2749230-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/6396229-i-know-what-you-did-last-summer", "http://www.goodreads.com/book/show/838768.Stranger_with_My_Face", "http://www.goodreads.com/book/show/510632.Killing_Mr_Griffin", "http://www.goodreads.com/book/show/538757.Down_a_Dark_Hall", "http://www.goodreads.com/book/show/477990.Summer_of_Fear", "http://www.goodreads.com/book/show/47751.Locked_in_Time", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}