{"ratings": 727, "userreviews": [{"userName": "John", "userReviewDate": "Oct 28, 2007", "userURL": "http://www.goodreads.com/user/show/77736-john", "userReview": "Kahunsha is a beautiful idea.I know a friend who is like this boy, they would understand.This book is:Outstanding, simple and freeing.Sad, trembling and understandably different."}, {"userName": "Louise", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "Anyone who loved Khaled Hosseini's \"The Kite Runner\" and Rohinton Mistry's \"A Fine Balance\" will love this novel just as much. What 10-year-old Chamdi, Sumdi and Guddi go through together is unbelievable.From back cover:\"In 1993, Bombay is on the verge of being torn apart by racial violence. Ten-year-old Chamdi has rarely ventured outside his orphanage, and entertains an idyllic fantasy of what the city is like-a paradise he calls Kahunsha, \"the city of no sadness.\" But when he runs away to search for his long-lost-father, he is thrust into the chaos of the streets, alone, possessing only the blood stained cloth he was left in as a baby.Chamdi struggles for survival in the harsh streets. But when he is caught up in the beginnings of the savage violence that will soon engulf the city, his dreams confront reality, and Chamdi finds himself growing up very fast.\""}, {"userName": "okyrhoe", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/825356-okyrhoe", "userReview": "The Song of Kahunsha is a forceful story. It offers a concise yet painfully grim glimpse into the microcosm of the street dwellers of Bombay, highlighting the acute social and psychological conflicts played out in the day to day conditions of life on the streets of the Indian megalopolis. At the thematic heart of the story is the boy’s existential conflict (where do I come from, why did my father abandon me) and his attempt to take fate in his own hands. Chamdi, a ten year old orphan decides to walk away from the protective environment of a Christian-oriented orphanage into the unknown labyrinth of Bombay, the world’s second most populated megalopolis (and model-city of urban planning for so-called Third-World cities in the new millennium). He is fuelled by innocent dreams of a fantastical alternate city, Kahunsha, that is the diametrical opposite of Bombay’s bleak and gritty living conditions. This journey eventually leads him to a most disturbing and dramatic quandary over right versus wrong. These are complex issues, and unfortunately the books’s compact length limits the exposition, so that the progressive development of character that one expects suffers as a consequence, and the novel fails to come to a compelling conclusion. The Song of Kahunsha serves up a rather spare and straightforward narrative lacking an expected complexity - the kind that I encountered, for example, recently in Jhumpa Lahiri’s short stories compiled in Unaccustomed Earth. There is an attempt to add some narrative layering, by placing a foreshadowing segment as the novel’s opening to create a sense of circularity. But this flourish isn’t a meaningful one; the time line juxtaposition doesn’t really inform the reader’s interpretation in any significant way.Maybe the novel’s shortcoming is due to the fact that point of view in Song of Kahunsha is a necessarily simple one predicated by Chamdi’s tender age. Yet there is more at fault than the limitations of a young child’s perspective. Irani states that “Story dictates style--the characters tell you what style you should use.... When I write about a boy's loss of innocence, it is essential to keep the writing as real, truthful, and simple as possible.” Unfortunately it isn’t so in this book.During the first third in particular I found the narrative techniques stylistically contrived. The environment of the orphanage is described through Chamdi's eyes, as if they are the lens of a camera panning the scene from one end to the other. I was aware of Chamdi as an expository tool to justify the description of his surroundings, rather than as a character in his own right : \"As he enters the room he sees....He turns his attention to....Now Chamdi watches...Now Chamdi sees....\" I also picked up several instances in the opening pages of the novel where the voice of Chamdi did not ring true for his age or for his specific circumstances (a confined world view that is up to that point limited by the walls of the orphanage): \"The moment you ask for something, the prayer room becomes a marketplace.\" What marketplace can Chamdi be cognizant of, if he has not yet set foot beyond the orphanage? In fact, his very ignorance of the marketplace is what tragically leads Chamdi to his eventual predicament.Later on, the street-wise Sumdi provides similarly pithy philosophical statements: \"The problem is that we live. We find just enough food to stay alive, and we are forced to live on and on in this hell.\" I found these to be more appropriate to Sumdi's character & circumstances, given the homeless boy's living conditions and the shady adults he interacts with. Even if Sumdi himself is too young to have thought it up himself, most likely he heard it from his parents, from Dabba the box-man, or even from Anand Bhai. Actually, it’s Sumdi's character that is the heart of this story, and once he is gone, the novel reverts back to the initial limitations of point-of-view. Sumdi is a most vivid character - at first threatening, aggressive, then protective, defensive; initially strong, then weak; swaggering, then practical; streetwise, but also naïve; possessing also an biting sense of humor (\"I'm in love. Biggest illness\"). Sumdi possesses a vibrancy that betrays the author may have been more (dis)engaged while shaping him, and thus allowed Sumdi to be who he is, unlike Chamdi who even at the most harrowing moments remains the narrative tool rather than a character in his own right. This is the novel’s structural limitation. Chamdi the narrative tool starts off the story as a Candide-esque symbol of an idealized Western morality (thou shalt not steal, thou shalt not kill) and then his attempt to take his fate in his own hands eventually lead him into a most disturbing and dramatic quandary of right versus wrong. One of the themes of the novel is the concept of dreams and storytelling as a means to (re)create an alternate reality/script from that which is being truly experienced. Chamdi dreams of his Kahunsha, the city of no sadness and the city where ‘no’ does not exist. He is also drawn to stories – he reads out loud to the younger children in the orphanage – and he is a creator of his own stories (The Boy Whose Ribs Became Tusks). Yet Chamdi’s relation to stories, dreams and alternate scripts is limited. Even though he can create a fantastical city – Kahunsha – or recount whimsical stories (\"So he made up his mind to achieve something so wonderful that if he were to tell anyone his life story, it would take days to tell, even weeks, and the ending would be a happy one…\"), he betrays one significant limitation. He is unable to make the connection between storytelling and lying – both fabrications – unlike Sumdi who uses storytelling (lies) to win over the taxiwalla, or as a secret weapon against Anand Bhai. Again, Sumdi’s character is more complex: Sumdi allows himself to be mesmerized by Chamdi’s story of The Boy Whose Ribs Became Tusks, as a temporary panacea for the pain of his miserable existence, yet he knows full well it’s just a temporary reprieve from his condition, just like the alcohol & drugs (& even sex) of the adults’ world he warns Chamdi against. Which is why Sumdi soon ‘forgets’ Chamdi’s story, much to Chamdi’s dismay. Chamdi himself is still living in the delusion of the story, while Sumdi has moved on. One wonders why Chamdi is not as preoccupied with fabrication (both storytelling, and outright lying) as a ‘mortal sin,’ as is the case with the other two Christian precepts that bring to light time and again the existential dilemma – that of the disparate realities between the ideal world of the orphanage and the complex realities on the streets of Bombay. Unfortunately the problematic point of view manifests itself in the novel’s climactic passage. The events of that scene are too engulfing and momentous to have any real impact on Chamdi the lost boy. What the reader imparts from that scene is very different from that something (if anything) understood by the character himself. Thus the story’s conclusion fades away, like the sunset view from the Gate of India, and it’s difficult to place Chamdi’s character in context. What opens the story (the discovery of free will) and the climax (the inconsequentiality of free will, and the triviality of moral arguments involving right versus wrong vis-a-vis the struggle to remain alive), cease to have any real structural meaning – there is no narrative resolution - when juxtaposed against ‘the horror the horror’ imparted on the reader: the relentless poverty and human cruelty that has become an integral element of the economic & political fabric of the megalopolis."}, {"userName": "Ronald", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/9687797-ronald", "userReview": "It is a brilliant book. Charles Dickens of India in a way. This novel is just like Oliver Twist but happens to be in Bombay. Poignant, and natural. One of the most underrated Indo-Canadian authors."}, {"userName": "Meital Ben-Daniel", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/33499409-meital-ben-daniel", "userReview": "A novel full of despair. I found no hope there! It was depressing and difficult to read."}, {"userName": "Stephanie Morrow", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/3223380-stephanie-morrow", "userReview": "You can read this review and others like it over at The Nomadic Reader.A friend was giving away some of his books because he’s running out of room, and of course being the book lover I am, I decided to pick out a few to add to my own collection. One of them was this Canada Reads book from 2007 that I had never heard of.The Song of Kahunsha is about a 10 year old orphan boy who lives in Bombay. One day he learns that the orphanage is going to be shut down, and instead of going that rout he decides to take his fate in his own hands, and sets out to find his birth father who left him on the steps so long ago.One of the great things about this book is the innocence that Chamdi has, no matter how many hardships he faces. This comes across as a child’s method of coping, and it’s written in a magical way that pulls the reader through his world. His world is one of heartache, pain, and violence but also one of incredibly colours, hope, and belief. He learns that the world is rough, and even though he meets up with two children around his own age, Sumdi and Guddi, things are going to get a lot harder. Together they start collecting money for Anand Bhai, who “turns people into boxes”. Chamdi’s world is further shaken when on the day he is supposed to steal from a local temple, something terrible happens (as if enough had not already happened).Still, Chamdi finds beauty. He sees things with the eyes of a child and he’s unable to completely give up his child-like ways, even though he sees evils all around him, evils that the reader understands but that the 10 year old Chamdi cannot.This isn’t a happy ending book but sometimes you need something deeply emotional to shake you up a little and get you out of a reading rut.4/5 Stars"}, {"userName": "Abi Versteegh", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/48882593-abi-versteegh", "userReview": "The Song of Kahunsha was written by Anosh Irani, who is an Indian-Canadian novelist born in 1974. The book took place in Bombay, which is where Irani grew up, meaning he was writing based on experience. This added to the value of the novel, making it a more personal story line.The Song Of Kahunsha is about a Chamdi, a ten-year- old boy who escapes an orphanage in the city of Bombay in search of his father. Chamdi is a very harmless, quiet boy who believes the city of Bombay is “Kahunsha,” the city of no sadness. His dream crumbles as he approaches the city and discovers the harsh environment and horrifying scenes of violence. The novel takes place in 1993, a time of racial conflicts and war-torn areas. Chamdi is welcomed by two other children living on the streets of Bombay, Sumdi and his sister, Ghuddi. Sumdi is quite brave and has a strong personality as she is able to stand up to the severe challenges she faces each day. Ghuddi is brave like her brother and does whatever it takes to survive. Chamdi takes on their lifestyle begging on the streets while working for Anand Bhai, who collects all their earnings. Anand Bhai is an abusive, greedy man who physically and emotionally punishes the young children. The novel extends, going into detail of their day to day lives of working for Anand Bhai and their plan to escape in order for survival. I had the pleasure of reading this novel for my grade 11 English final assignment, and it is an extremely well-written piece of fiction. This novel was emotional, suspenseful and is the definition of “great literature.” The novel starts out quite calm but gradually gets more intriguing and exciting. The novel goes into gruesome detail allowing the reader to visual Chamdi, Sumdi and Ghuddi’s experiences which add to the quality of the novel. One part that really caught my attention was when Anand Bhai said: “Now cut your tongue off, you lied to me, so hold your tongue out and slice it off.” At this point, I became hooked on the storyline and was unable to put the novel down. He continues to say: “I’m waiting, either you do it or I'll do it. The problem with me is that I'm a perfectionist. That means I will work slow and steady and make sure that the cut is in one straight line. If not, I'll start again.” Page 245. The novel will allow you to feel many emotions, and grab your attention at several parts. My favourite character was Chamdi. At first, he was very hesitant on doing the tasks he was assigned, but as the storyline progressed he developed into a brave individual who was willing to fight. He did not like to do the tasks that put his survival at risk, however, he pushed through and never gave up. He was able to put his fears behind him and move on to the next most important thing. Overall I thought this book was exceptional and a well worth read. If you chose to read the novel “The Song of Kahunsha” by Anosh Irani, you will not be disappointed as it will capture your attention, trigger emotions and keep you engrossed."}, {"userName": "Sandra ", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/8209529-sandra", "userReview": "I had the honour to meet Anosh Irani last year, as he was promoting \"The Parcel\", which I loved.I wanted to read more of his work and grabbed a copy of \"The Song of Kahunsha\"This book is a beautiful coming of age story, with strong yet vulnerable characters. The prose is exquisite, the setting is rich and the descriptions are vivid. A beautiful story written by a master."}, {"userName": "Deborah Denny", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/33150365-deborah-denny", "userReview": "I read this book in one day. I could not put it down, hoping for a miracle for Chamdi. It is overwhelming to read about the conditions and lives of children in Bombay. Hoping and praying it is not as bad as portrayed. Naive of me."}, {"userName": "Jane Glen", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/7439172-jane-glen", "userReview": "This was a 2007 Canada Reads selection. I don't know where it ended up, but this is one powerful, well-written novel. And very heart-wrenching to boot. It pays tribute to the human spirit and the hope that is always around the corner."}, {"userName": "Lauretta", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/70875002-lauretta", "userReview": "Un racconto toccante, a tratti straziante, della vita di strada a Bombay, a cui il bambino protagonista cerca di sfuggire rifugiandosi nella fantasia e nel conforto dell'amicizia."}, {"userName": "Mr. Christie", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/77309055-mr-christie", "userReview": "Available at SPL and SERC"}, {"userName": "Lester", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/5290247-lester", "userReview": "Anosh Irani..thank you for your stories!!(and I really enjoyed your website!! http://www.anoshirani.com/)"}, {"userName": "Padideh", "userReviewDate": "Oct 15, 2010", "userURL": "http://www.goodreads.com/user/show/4422125-padideh", "userReview": "“Dirty your face, it’s too clean. I wouldn’t give you a single rupee! Stop walking like you own the world. Carry the world’s weight on your shoulders. In a day or two you’ll feel it anyway! And take that white scarf off your neck. Bombay is not a hill station!” Then Samdi laughs and Chamdi feels it is a strange sight indeed, to watch this boy walk with a limp, a face black from smoke, and the widest smile in the world.Immersed in the world of destruction, violence, filth, and hunger, Chamdi, a ten-year-old orphan discovers the streets of Bombay outside of his orphanage. This gentle, compassionate story about a young boy sheds light to what 11 million orphans are facing today in India. Child labour, sexual exploitation and theft all circle around Chamdi as he tries to find his place among millions of other citizens who don’t show an ounce of kindness. When he was still in the confinements of the orphanage, Chamdi imagines a city of colour that blooms with warmth and no hunger. When he takes to the streets and befriends two other seasoned street orphans he learns the way one must live without protection. After exploring every rat infested street corner through the eyes of a reader, it’s easy to say that this book was intended to gauge a reaction. A typical North American student is blinded by societies distractions like Hollywood, sports, fashion, and studies to care about the outskirts of their own city. The Song of Kahunsha made me sprawl uncomfortably in the mud patch Anosh Irani left for his readers. Since Chamdi is such a young, inexperienced boy the audience is enlightened by his innocent, tender perspective on how the world is. His intentions and imagination drew me in with a delicate pull, making me develop a fond connection with a fictional character that I’ll never meet. The simple, literal language used prevents readers from feeling overwhelmed by the savageries of Bombay and allow room to encompass the realism of what an unprotected child witnesses. Chamdi’s struggles make him a hero for gripping onto hope even when faced with death and injustice. The colour of his imagination made me realize how pure young people are even when they have the option of giving up. The Song of Kahunsha reminded me strongly of Khaled Hosseini`s The Kite Runner, another vivid, melancholic read about the conflicts in the Middle East and how the rest of the world isn’t as involved as it should be. Overall, a beautiful, yet horrifying story, this novel is suitable for anyone who has willing eyes to read about the fragility of a society and colourful scope of a young boy’s endurances. “Chamdi slowly watches as the sun takes its place in the sky and sends its light around in a sparkling dance. Behind him, there is the sudden flutter of pigeons, as though they have all flown away at the same time. As the water gurgles bneath them, Chamdi moves closer to Guddi, and lets his hand touch hers.”"}, {"userName": "Ðɑηηɑ", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/3497553", "userReview": "Regular Indian book, actually. As you probably know -the book was written after Q&A was released, which symbolized a little something I like to call \"the new Indian literary age\", I mean that at 2007-2009 Indian writers were successful among Western readers. Yet, I didn't Love this books, because it was slow- moving, and not that well written (or the translation wasn't good?).We read about the poor reality of Indian people, but this is not true. Irani presents an extremely unrealistic image of life in India and ruins it completely. Indians are NOT those poor, orphaned, strange people you see on TV shows or read about in books. I think there is a real need of book which will actually tell the average American reader what living in India really is like.The Song of Kahunsha by Anush Irani is an okay book. After the book Q&A by Vikas Swarup was released and was very succesful, many many Indian wroters decided to go for it and write a book about the poor, hopless life of poor, hopless kids in India who barely have something to eat and most of them are orphans.On one hand, this book is well written and well captured the fictional India, but it seems as if Kahunsha is actually looking for trouble and not as if the troubles finds him unready and make him even poorer and sader. You see, the writer probably wanted to make the reader feel sorry about the poor little child and buy this book just because it's trendy.On the other hand, I think this book was so pathetic and unoriginal and really trashy, you know. All through the book, the one thought was:alright, okay, we get it, he was poor and sad and a survivor, no doubt about it. And yes, some Indian kids are unluckily poor and oh I feel so sorry for him oh and that cute face of him *looking at the cover*. Well, I say: Oh, please! In fact, the author himself did a pretty good job making us understand how poor this child was: \"he froze, \"he was hungry\", \"he was alone\", \"he was jealous of other kids\"...And the whole conflict with jesus guy. Ugh.So, the whole book left me empty. The idea, as mentioned here before about 20 times, was very repetitive and therefore, since the author did not come up with any new ideas, was unoriginal and very boring. Pathetic Kahunsha.I gave it 2/5 stars because I was it was not completely strange."}, {"userName": "Tânia Tanocas", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/27129200-t-nia-tanocas", "userReview": "Chamdi é um menino de 10 anos que foi abandonado num orfanato ainda bebé e tudo o que sabe da vida foi aprendido dentro das paredes desse orfanato em convivência com as pessoas que dele cuidaram.Acarreta o sonho de encontrar a família e compreender porque foi abandonado, sem nunca guardar ódio ou rancor por ter sido largado á sua sorte… Aliás o amor com que Chamdi fala e sonha com a família é tão puro que nem conseguimos julgar nem condenar tal ato. Também alimenta a fantasia de encontrar uma cidade que ele próprio criou na sua imaginação para descrever a Bombaim que desconhece. Um dia, todo o pessoal recebe a notícia de que as portas do orfanato vão fechar e terão de encontrar outro local para se manter unidos, Chambi com medo de se afastar em relação ao local de onde foi deixado decide fugir e procurar sozinho pela família.Mas Chambi, nada sabe do mundo que existe fora do orfanato e o que vai encontrar não vai ser fácil nem para ele, nem para o leitor que o acompanha. Nem tão pouco encontra uma Kahunsha (a cidade sem tristeza).Enquanto caminha ela cidade Chambi, vai ter a companhia de Guddi e Sumdi, dois irmãos que o vão ensinar a sobreviver, mas o perigo anda sempre lado a lado destas personagens de palmo e meio, mas que em termos de vivência supera muitos adultos. Não gostei do final, mas infelizmente a realidade é assim mesma, nada é como o que sonhamos e a aventura de Chambi é a prova disso mesmo… Mesmo assim, não deixa de ser uma leitura que nos deixa seriamente a pensar e com um enorme nó no estômago. Pequenos excertos:“ O céu é o mesmo em toda a parte, tranquiliza-se. Por mais estranha que a cidade possa parecer ou se torne, pode sempre olhar para o céu e ver alho familiar. É o meso espaço aberto em todo o lado e pertence-lhe tanto a ele quanto a qualquer outra pessoa deste mundo.”“Diz a si mesmo que tem de ser forte. Tem dez anos e precisa de encontrar o pai. É uma tarefa difícil e por isso não permitirá que algo tão trivial como a fome o desencoraje.”“Chambi pode ser órfão, mas sabe ler e escrever, é um pedinte temporário.”"}, {"userName": "Claudia Sesto", "userReviewDate": "Apr 11, 2014", "userURL": "http://www.goodreads.com/user/show/23094890-claudia-sesto", "userReview": "\"Volerò sopra il mare come un uccello imbattibile e non mi fermerò mai.\"Un bambino che vive in un orfanatrofio desidera ardentemente ritrovare il padre che lo ha abbandonato alla nascita, inizia così per lui un'avventura per le strade di Bombay. Scoprirà una città dove la povertà regna sovrana, fatta di bimbi che vivono per le strade facendo l'elemosina, vite costellate di disgrazie e infelicità, lotte religiose tra indu e musulmani, dove a rimetterci sono sempre i più deboli, una realtà cruda, pesante, che a tratti mi è risultata difficile da accettare. \"E' veramente possibile vivere così?\", questa domanda mi ha danzato nella mente durante tutta la lettura del libro ed alla quale non ho trovato risposta, non sono riuscita a capire perchè ancor oggi esistano queste tristi realtà dove chi ne soffre maggiormente sono i bambini. Chamdi sopravvive grazie alla sua grande forza di volontà e perchè sogna un mondo migliore dove non esistano persone cattive e dove si può trovare cibo senza difficoltà, dovrebbero leggerlo i ragazzi che vivono nelle nostre città che hanno tutto e che non si accontentano mai! \"Chamdi vorrebbe chiedergli di Bombay, del perchè non vi vedono colori, canzoni, facce sorridenti, effusioni. Ma poi si dice che è in città da troppo poco tempo. Prima o poi si imbatterà di certo in qualcosa che assomiglia al luogo della sua fantasia.\" \"Chamdi si chiede quante lingue esistano al mondo. Un giorno lui creerà la sua. E' un pensiero che gli mette allegria. Inventerà parole positive, che fanno solo bene e non feriscono mai anche se non è certo che sulla terra ci siano persone abbastanza forti da saper usare parole di bellezza. Creerà una lingua che non contempla il NO. Allora sì che le sue richieste di cibo sortiranno sempre l'effetto desiderato.\""}, {"userName": "Steve Woods", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/3688618-steve-woods", "userReview": "This book really tore me up! It cut very close to the bone; children trapped in suffering under a cruel hand. The depth of the emotion it evoked in me is doubtlessly linked to my own childhood and that has deeply marked me such that seeing children in those circumstnces and feeling that old pain opens primary emotions that are always overwhelming. I have always felt for children cuaght in this kind of trap and I have known many. In Cambodiain the late 90's the kids selling themselves on the street, begging and rolling drunks who were then visited by their handlers and mercilessly beaten force them to hand over whatevcer they had taken that day. It seems that this particular system of cruel exploitation is in place all over SE Asia.It struck me very deeply at the time and I felt helpless to help them. I learned then that giving them food was the only thing I could do was give them food and watch them eat it and if I was to treat their wounds or their illness it all had to be done immediatley and I had to watch medicine consumed, otherwise they had to hand that over as well because it could be sold.This book lays it all out through te eyes of a sensitive, intelligent little boy in his own words. He is gradually robbed of everything, hope and dignity and made to commit a terrible crime that locks him in guilt and shame.I struggle constantly with the the sense of the world as a threatening and evil place and the suspicion that the bulk of humanity fits the bill both so deeply ingrained in me. The fact that people treatr children in this way just opens up in me a pit of depair, and the knowledge that there is nothing I can do to change it simpley haunts me; always just below the surface except when the concentrated pit is peirced as this story pierced it."}, {"userName": "Peachy", "userReviewDate": "Nov 18, 2009", "userURL": "http://www.goodreads.com/user/show/2095554-peachy", "userReview": "Chamdi’s name means “a boy of thick skin,” as appropriately given to him by Mrs. Sadiq, his caretaker at the orphanage where he has spent his short life sheltered from the evils that lurk behind the towering and concrete walls, in the streets of Bombay. His upbringing has been humble, with the same meals of rice and vegetables provided three times a day, a cot with a white sheet to sleep on, and a basic education affording him the knowledge to read and write. You can’t help but feel sad for Chamdi and his situation, until the closing of the orphanage sends him to the streets of Bombay where we quickly learn things can be much worse than he had ever experienced. Chamdi’s road becomes increasingly harder, as he struggles to stay alive with no food in his tummy, money in his hand or a roof over his head. His saving grace and the true inspiration of this story is Chamdi’s ability to dream in colours. No matter how dark, dismal and desolate his circumstances appear to be, Chamdi need only close his eyes and dream of Kahunsha, his make believe recreation of Bombay, where there is no sadness, criminals, or starvation. This is a truly inspirational story that will not only make you thankful for all that you have, but hopeful for all that you have the power to imagine."}, {"userName": "Aban (Aby) ", "userReviewDate": "Sep 18, 2010", "userURL": "http://www.goodreads.com/user/show/1802881-aban-aby", "userReview": "This is the story of a ten year old boy, Chamdi, who leaves an orphanage in Bombay to look for his father. He calls the city \"Kahunsha\" (the city of no sadness) but his dream city bears no relation to the Bombay that awaits him. Chamdi is befriended by two other children: a brother, Sumdi, and his younger sister, Guddi. They beg in order to look after a sick mother. Like all beggars, they have to give their money to a man, Anand Bhai, who controls the beggars in the area. (This book brings back memories of Rohinton Mistry's \"A Fine Balance\".) The book takes place in 1993, a time of racial conflict between Hindus and Muslims. The children fall victim to the conflict and Anand Bhai's desire for revenge.This is a grim book, reflecting the harsh reality of street life in Bombay. There's violence in it but, unlike the violence in \"The Girl with the Dragon Tatoo\", it is not gratuitous. Moreover, running like a silver light through the darkness, is the innocence of childhood and the genuine goodness and sweetness of Chamdi. I thought the book was beautiful and well worth reading."}, {"userName": "Olya Eryukova", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/7426899-olya-eryukova", "userReview": "Приют – это дом, где живут дети, у которых нет родителей. Сироты.– Не, это место по-другому называется.– Как?– БомбейИстория десятилетнего Чамди начинается с его побега из приюта. Казалось бы бежит он от плохой жизни. Но все, что ждет его на улицах его любимого, разукрашенного мечтами, Бомбея ни в какое сравнение не идет с жизнью в приюте. Еще не раз вспомнит Чамди свой приют, прошлую жизнь и добрую воспитательницу.. Но все это уже в прошлом для мальчика и за несколько дней он узнает весь ужас жизни на улице. Ему быстро находят работу и \"хозяина\". Нам покажут всю жуть бомбейских трущоб.. И читать об этом не так то просто. Картину всего происходящего усугубляет чистое сердце ребенка, его мечты, его наивный взгляд на происходящее и вера в то, что все можно исправить.. К концу, правда, и это проходит, Чамди сломлен и, кажется, нет уже того доброго мальчика, но песня Кахунши звучит с новой силой и мы понимаем - надежда еще есть."}, {"userName": "Conta-me Histórias", "userReviewDate": "Nov 01, 2009", "userURL": "http://www.goodreads.com/user/show/2460861-conta-me-hist-rias", "userReview": "Lindo! Gostei muito. Este livro é uma história diferente, que não acaba nem bem nem mal, acaba com aquilo que pode ser um novo princípio.Chamdi sempre viveu num orfanato, mas sonha conhecer os seus pais. Um dia, levando consigo a peça de roupa manchada de sangue com que foi deixado à porta do orfanato, sai para as ruas de Bombaim, à procura do pai.Não encontra o pai, mas encontra Shumdi e Guddi, dois irmãos, duas crianças como ele. Shumdi e Guddi planeiam assaltar o templo da rua onde vivem para poderem fugir com o dinheiro das esmolas e sairem assim da exploração de que são vítimas... e Chamdi é o escolhido para levarem avante o seu plano.No entanto o plano não chega a concretizar-se pois algo de terrível acontece...Esta é a história de três crianças de rua de Bombaim, usadas e exploradas por adultos sem escrúpulos. É uma história triste, cruel, mas de uma beleza inexplicável, que o autor relata de forma quase poética.Um livro que se lê com o coração!"}, {"userName": "Briard", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/698281-briard", "userReview": "Reactions: So far.. I'm really bored and I ended up starting the other book right after I started this one and finished it within 24 hours. But everyone else said it was good, so I'm waiting for it to catch me.Ok.. So yea this is definitely not one of my favourites. Like I did enjoy it sort of, but not my style of book and all. It was basically about a boy who runs from an orphanage and goes in search of his father. The only clue is a white cloth with three drops of blood. He gets off course when he meets a family living in the streets and he soon gets caught up in there affairs.It does get intense.. but intense too late for my liking.Who know's you might like it but I sure didn't."}, {"userName": "Karena", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/2068371-karena", "userReview": "After finishing this novel a few nights ago I was relieved. The Song of Kahunsha may be described as a cross between A Fine Balance and The Kite Runner. The story follows the orphan boy Chamdi, who runs away from the doomed orphanage to find his father. He ends up on the streets of Bombay (now Mumbai...there is a reference to the new name in the novel) and meets Guddi and Sumdi, two children surviving on the street by their wits and by the grace of Anand Bhai, who controls the neighbourhood through violence and fear. If it wasn't for the bright imagination of Chamdi this would be a bleak novel...but watch for the splashes of colour and hope."}, {"userName": "bjneary", "userReviewDate": "Jan 28, 2008", "userURL": "http://www.goodreads.com/user/show/62411-bjneary", "userReview": "Vividyl written story about Chamdi, a 10 yr old boy living in an orphanage in Bombay. He has a dream of a city \"Kahunsha\" where there is NO SADNESS, ONLY JOY. Due to rising violence, the orphans are kept close to the orphanage. Trouble starts for Chamdi with the close of the orphanage. He runs away at night and the streets of Bombay are not what he envisioned. Street dwellers, Sumdi and his sister, Guddhi show Chamdi the ropes but as times get more difficult, Chamdi must work on the streets for evil Anand Bhai. He shatters Chamdi's childhhod innocence and in order to survive, he if forced to make decisions that child should ever have to make. A great multicultural read."}, {"userName": "Sarah", "userReviewDate": "Sep 30, 2009", "userURL": "http://www.goodreads.com/user/show/2793072-sarah", "userReview": "Oh, boy, this was rough to read. I knew things were bad for orphans in India. But this was tough. Chamdi is an orphan in Bombay. When he finds out that his orphanage is closing, he runs away. And, oh, the life on the streets is horrible. Within three days, a friend dies a brutal death, he is planning on stealing from a church, he starves, and he falls in love with another homeless girl. He sees people with no arms and no legs who are forced to serve as spies for the local thug. He almost has his tongue cut off. He gives up on ever finding his father who left him at the orphanage. Yet he doesn't stop dreaming of a better life."}, {"userName": "Sarah", "userReviewDate": "Oct 04, 2012", "userURL": "http://www.goodreads.com/user/show/7912941-sarah", "userReview": "Blake would be proud. This was a lovely story about innocence and experience. (it even had the Tygers!) There was so much potential for poetry and depth, but it felt a bit like young wine--immature and a touch too sweet. It needs to ripen a bit more to achieve a real kick. If I had to identify a specific fault, I would say the psychology was weak, but the characters were endearing and the motif of circularly perpetuated violence was effective. I would recommend this to people who don't have the patience to read Rohinton Mistry."}, {"userName": "Rajshree Balaji", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/34672229-rajshree-balaji", "userReview": "This book was alright yet it showcased the plight of orphaned kids in Bombay quite accurately. Anosh Irani's writing is very straightforward with bits of dark humour. I so wanted the main characters (Chamdi, Guddi and Sumdi) to escape from the wraths of Bombay. But I realized that author was realistic with his setting. However, I was not too impressed with the ending as I felt like it just ended abruptly. This is a good book for someone who wants to read about the misery of children stuck in the clutches of poverty."}, {"userName": "Arlene Richards", "userReviewDate": "Apr 28, 2009", "userURL": "http://www.goodreads.com/user/show/2084068-arlene-richards", "userReview": "I read this book some time ago but it is such a powerful book I had to introduce it to my friendly readers. Many reviewers liken this book to Oliver Twist but I found it to be much harder to read than Oliver Twist. This 10 year old ,Indian, orphan boy, who delights in everyday wonders, is subject to the horrendous savageries of Bombay streets during an Hindu-Muslin uprising. The writing is gripping, understated and horrific. I can not comprehend how the spirit of youth could survive such a life. Well worth reading but it will haunt you for days."}, {"userName": "Sarah Hogman", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/32511902-sarah-hogman", "userReview": "This book depicts a loss of innocence like nothing I've ever read before. There is no happy ending, no conclusion to Chamdi's quest to find his father, no retribution from his enemy Anand Bhai, and no discovery of Chamdi's idealized Bombay (Kahunsha). Chamdi's innocence is crushed like an egg, but despite that, he is able to find a source of comfort in his friend Guddi's song. Heart rending, yet beautiful. 4 1/2 stars."}], "description": "Bombay, 1993. Chamdi ha dieci anni e vive alle porte della città, lontano dai violenti scontri tra induisti e musulmani, dalle moschee bruciate e dai negozi svaligiati. La sua non è una vera casa, è un orfanotrofio, perché i genitori lo hanno abbandonato appena nato. Il suo mondo è fatto del colore acceso delle bouganville, delle canzoni, dei giochi. E delle preghiere silenziose perché qualcuno arrivi e lo porti via. Ma lui ha un grande sogno, che Bombay si trasformi in una città senza tristezza, un luogo in cui i bambini possono giocare per le strade e in cui non ci sono figli senza genitori. Chamdi sa che quella degli orfani è una vita a metà, i loro occhi non splendono, hanno solo una luce presa in prestito: per questo sembrano tristi anche quando ridono. Così decide di andarsene, di partire alla ricerca del padre, con in tasca una manciata di petali di bouganville. Perdendosi per i vicoli sporchi e affollati, Chamdi incontra Sumdi e la sorella Guddi, che per strada ci vivono fin dalla nascita. E in breve si trova a chiedere l'elemosina insieme a una spaventosa corte dei miracoli al servizio di un bandito senza pietà. Eppure Chamdi non vuole abbandonare i suoi sogni, e quando Guddi sarà in pericolo di vita, scoprirà quanto sia fragile l'innocenza ma quanto forte possa essere l'amicizia.", "title": "Il bambino con i petali in tasca", "url": "https://www.goodreads.com/book/show/9673642-il-bambino-con-i-petali-in-tasca", "average": 3.69, "cover": "https://images.gr-assets.com/books/1339162025l/9673642.jpg", "reviews": 67, "authors": [{"url": "https://www.goodreads.com/author/show/43097.Anosh_Irani", "name": "Anosh Irani"}, {"url": "https://www.goodreads.com/author/show/1432972.Anna_Rusconi", "name": "Anna Rusconi"}], "type": ["Fiction", "Cultural", "Cultural", "Historical", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/9673642-il-bambino-con-i-petali-in-tasca", "http://www.goodreads.com/book/show/530304.The_Song_of_Kahunsha", "http://www.goodreads.com/book/show/299773.The_Song_of_Kahunsha", "http://www.goodreads.com/book/show/1399109.The_Song_of_Kahunsha", "http://www.goodreads.com/book/show/9724839-il-bambino-con-i-petali-in-tasca", "http://www.goodreads.com/book/show/7081454-a-cidade-sem-tristeza", "http://www.goodreads.com/book/show/28185967-the-parcel", "http://www.goodreads.com/book/show/75788.The_Cripple_and_His_Talismans", "http://www.goodreads.com/book/show/7919341-dahanu-road", "http://www.goodreads.com/book/show/948415.The_Bombay_Plays", "http://www.goodreads.com/book/show/37791458-le-colis", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}