{"ratings": 12985, "userreviews": [{"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "Reviewed by: Rabid ReadsHave you ever discovered a new book, by a new author, and absolutely LOVED it, so you go out and immediately buy the next book the author writes, and it's not quite as good as the first one, but it's still pretty good, so the next time a new book is released by that same author, again, you go out and buy it immediately, only this time it's not very good at all, and you start to think maybe the author is a one hit wonder?<------that's a REALLY long, yet (mostly?) grammatically correct, sentence.That's also really NOT what happened here. In fact, it was pretty much the reverse.I discovered Tiernan's SWEEP series probably 10 years and inhaled it (all 15 installments). It was okay, but the most I can say about it is that it was entertaining. Then I found her BALEFIRE series, which was thankfully much shorter (only 4 installments) and it blew SWEEP out the water.So when I stumbled across IMMORTAL BELOVED, I was like, \"Ooohhh . . . that looks interesting.\"And it was fantastic.Nastasya, Nasty to her friends, is an immortal. No one is sure where the first immortal came from, but they can be found among every race and nationality. As is usually the case, they are not truly immortal--if you cut off their heads, burn their bodies, and scatter their ashes, they will not survive, but that's a rather specific set of circumstances, so I don't begrudge them their \"immortal\" status.They also have the ability to learn and use magic.If you know anything about Tiernan, then this is not a surprise. Tiernan excels at writing all things witchy, and IMMORTAL BELOVED is no exception. But Nasty avoids her magic, b/c she learned at a very young age how dangerous it was for her to let others learn of her abilities.Why is it dangerous . . . ? I think you know where I'm going with this--READ THE BOOK *winks*But Nastasya can no longer avoid her magic when she leaves the life she's been living in London, and the friends she's been living it with for the last hundred years, behind.This book . . . is a very emotional story to read. Nasty has money and beauty and immortality and a collection of friends who have all of those things as well, and . . . they're pretty damn awful to tell the truth. Nasty leaves without a word after Incy, her best friend, uses magic to break the back of a rude cabbie . . . b/c he can. B/c he was angry that the cabbie dared to call them out for their juvenile behavior. So he . . . broke the poor man's back . . . left him in a puddle on the street beside his cab . . . used magic again to prevent the man from calling out for help . . . and then went clubbing.YEP. Incy's kind of a bastard.And while Nasty is shocked and horrified by Incy's behavior--she had no idea he could use magic that way--she allows herself to be steered towards the bar that the rest of her crew are headed for, starts drinking, and does not one thing to help the man.The next day, she wakes up hungover and completely disgusted with herself, and decides that something has to change. She has no idea how she became the person she currently is, but she's terrified of what it might mean for the rest of her very long life.So she runs to the states.She'd met a women about 80 years ago, you see, who told her simply to come if she decided she wanted more out of life.So she does.From there she enters a kind of rehab for immortals. It's hard and it hurts, but Nastasya has reached a place where no matter how bad it is with River and the other immortals at the retreat, she can't stand the thought of being anywhere else either . . . so she stays.This book would be an excellent story even without the paranormal elements. Nasty doesn't need to be an immortal or capable of magic for her story to draw you in, make you feel her agony and despair and determination to change, be better, be MORE. But she is . . . and that only makes things more interesting . . .And then there's Reyn . . . the Viking GOD. Well, okay fine, he's not really a god, but he's several inches over six feet of blond Viking warrior, and that's good enough for me.And they HATE each other. It's fantastic. Nastasya and Reyn achieve the kind of slow burn combustibility that's only possible when legitimate dislike is present, and it's HOT.So the characters are awesome. And despite what I said earlier about no one really knowing where immortals came from, the world-building in this series is VERY cool. It's a mix of mythology and paganism, and I loved it. AND b/c even the youngest characters are as old or older than your grandparents, and no part of this story takes place on a high school campus, this is one of those YA novels that even readers 10+ years out of high school can enjoy. IMMORTAL BELOVED is an excellent first installment to this excellent trilogy. I recommend it to anyone who likes witchy UF and hot Viking gods."}, {"userName": "Bgurl (don't h8 me cuz I'm honestful)", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/4166814-bgurl-don-t-h8-me-cuz-i-m-honestful", "userReview": "Immortal Beloved (IB 01) by Cate Tiernan: 2 “Captain Obvious” Stars.“I’m here because I can’t bear to be not-here anymore. I’m here because I can’t tell right from wrong, light from dark. I’m here because I can’t stand being me.\" ~ NastasyaIn the 1960s, her name was Hope. In the 1920s, Christiane. In the 1500s, Sunna. Before that, another name. A name she never thinks of. A name she’s running from, but can’t. And she’s tired. Tired of being cynical. Tired of being lonely. Tired of being numb. “ ‘Like what?’ I asked.She shook her head, her brown eyes sad. ‘You can have so much more, be so much more.’ ” ~ Nastasya & River In the 16th century, she was a farmer and a servant. In the 17th Century, she survived the great plague. She saw French royalty beheaded. Lost a husband in the Anglo-Indian Wars. Sipped champagne while dancing The Charleston. And turned on, tuned in, and dropped out with the Hollywood elite. By the 21st century, she’d been everywhere. Done everything. Invented the frigging T-shirt! She doesn’t know what “more” there could possibly be. But she wants to find out. “ ‘I want to be myself. I want my power back. I want to be my mother’s daughter, my father’s heir.’ My voice choked up.A new light flared in River’s eyes. ‘Yes. I want that for you.’ ” ~ Nastasya & RiverFor 450 years, she’s been running, now it’s time to stop. It’s time to confront her past. Face her fears. Discover what she is. Who she is. And who she’s destined to become. “Being good is something we choose every day, throughout the day, for the rest of our life. A day is made of a thousand decisions, most small, some huge. With each decision, you can work toward light or sink toward darkness. The point of life isn’t to be good all the time. It’s to be as good as you can. No one’s perfect. No one does it right all the time. That’s not what life is.\" ~ AsherSome writers subtly weave life lessons into their text so it feels organic to the story.  Tales such as these are often an adventure, as messages aren’t easily identifiable, and different readers interpret the same story in different ways. Cate Tiernan is not a subtle writer. Hence, the life lessons imparted in Immortal Beloved are blatantly obvious. So be forewarned: if you’re not a fan of “In Your Face” moralizing, you may want to avoid this series.For a more detailed critique of this book, check out Mara's review: Click Me Baby!Links to my reviews of books 2 & 3:Darkness Falls (IB #2): Click Me Again!Eternally Yours (IB #3): Click Again (you know you want to!)For information about my rating system, see my profile page."}, {"userName": "oliviasbooks", "userReviewDate": "Mar 06, 2010", "userURL": "http://www.goodreads.com/user/show/2843533-oliviasbooks", "userReview": "2016: Isn't it utterly marvelous, when a favorite aces the re-reading experience with flying colors after almost five years?2011: I can't really comprehend that I am sitting here pressing determinedly the five-star-button - in spite of the first chapters, which obviously have been patched together rather sloppily and almost caused me to switch books with one click on my Kindle, ... and in spite of the undeniable cliffy. Yet - here I am am doing precisely that and feeling completely comfortable with it.Really, at the beginning I had the fleeting, horrible impression my paranormal \"favorite\" Infinite Days would manage to catch up with me. The cruel, excitement-addicted, immortal heroine - unable to feel for mere mortals - and her gang of equally shiny, but worthless companions, who break a taxi driver's spine for fun. I got very angry about repetitive sentences that should have been edited away and I moaned about unbelievable scenarios like an immortal girl hiding a burn-mark from her best friend under a scarf for over a hundred years - in spite of drunken and drugged party nights, shared hotel rooms and beach holidays, or like the same girl being shocked about said best-friend's pleasure at causing someone deadly pain. As if it would be possible to hide a personality this rotten for over a century from someone that close to you. I held out and was rewarded with 180-degrees-style improvement. From the moment Natasya boarded the plane in order to leave her old life behind, the nasty crinkles smoothed out and the story enfolded beautifully in front of my eyes. And Natasya/Lilja \"magickally\" wormed herself into a cosy nook of my heart - the one reserved for heroines, who are prickly and nasty and damaged on the outside, but hurt and helpless and lovable deep within. \"Immortal Beloved\" could probably be described as a cross between Rachel's Holiday, Secrets of Truth and Beauty and maybe Succubus Blues. It is the story of a girl whose long, long life has made her unable to feel attachment, unable to sleep without \"self-medication\", unable to decide for herself what she really wants. It is a story of a girl at the point of no return. A girl who turns herself in at a rehabilitation center for wayward immortals, because she vaguely remembers a woman inviting her 50 years ago to come and stay with her should she hit the bottom end of things and change her mind. The rehab plot unexpectedly uncovered some very interesting strings of thought about the burdens of immortality, but also about a fulfilled life in general. That might have easliy turned into something preachy-soppy, but Natasya's own snarky, sceptical attitude and her ongoing inner monologue fueled by exaggeration lightens the mood and gives her stay at \"River's Edge\" a pretty hilarious note. I was really relieved not to have to read about the hot-hot-hot love-interest without reprieve. He is of the - in my opinion - hot sort and I began to look forward to Natasya's encounters with him (nothing like enemies falling for each other hard, isn't there), but I was glad that the romance was not taking over the already interesting story as soon as the potential supernatural heartbreaker made his first entrance.I have to say, I not only guessed the connection between Natasya and Reyn, I really knew when she implied that his face looked familiar. But at that point I did not mind anymore. I was too much enamoured already to care. So. Same as with Die for Me for instance, falling in love with this book has been an entirely individual process that cannot be easily explained by check-marking off its shining points. Thus it makes recommending it to all my friends a tricky thing. I won't do it to be on the safe side. I certainly do not want to be lynched. But realize that maybe you are missing out on something rather satisfying and heart-cuddling. I, for my part, crave to read the sequel now. But ... I, too, know what a sequel can do to a lovely story (exasperated sigh)."}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Mar 28, 2014", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "This was a fun book that got me through a really rough weekend when nothing else was working-So I guess that means it was worth every moment spent reading it. And while it wasn't an instant favorite nor a must read type of rec, I do think there was a lot that kept me addicted enough to want to immediately read book two. I hear book three is the best one, so I guess I'll see.There were a couple things that bothered me, but I am hoping they are ironed out as we move along in the series. For now, though, I will think fondly of Reyn and look forward to seeing him again soon. :PFor more of my reviews, please visit:"}, {"userName": "Sophia.", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/6520961-sophia", "userReview": "[really, Nell is the culprit? Come the fuck on. (hide spoiler)]"}, {"userName": "Kristalia ", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/5705623-kristalia", "userReview": "Final rating: 4.75/5 starsFinal rating - for the whole series: 4.75/5 starsThis was so cool. I like it that this book is about immortal meeting immortal, and as it seems, falling in love with immortal, and making awkward situations with immortal, instead of immortal falling in love with human. I have seen that story way too many times. This is something new. And i like it :D I was getting tired of the overused paranormal-human. And there is actually very little of romance between the characters, which i also liked. Oh and it is also  mature ya , which is awesome <3 And i loved the writing, because i dont like this style where there is only one POV, and from female's perspective, but this was nice and very good :D“Being good is something that one must choose over and over again, every day, throughout the day, for the rest of one’s life,” Asher said. “A day is made of a thousand decisions, most small, some huge. With each decision, you have the chance to work toward light or sink toward darkness.”____________________________________________\n\nStory\n\n: ____________________________________________The story itself was interesting as well. Its about immortals, their lives, and powers. Magick powers xD....(why not magic).....Anyway, as it seems, all immortals are born as Dark - Terävä, and they can gradually become Light again - Tähti . MC called Nastasya, Dark immortal, is trying to escape her group when their evil passed the limits she could bear. And escaping, she found that she had done some things that she wasn't exactly proud of. She then remembers an immortal called River who said that Nasty is welcome to come to her place. In River's Edge, she learns how to appreciate life, nature, everything around her; that by caring about herself, she will care about the others as well. Nasty then tries to live her life in whole different way that she was used to. But going Light doesn't mean staying Light forever, there will always be situations where she/they could revert to Dark in matter of seconds. “None of us here just decided one day to embrace good, or light, and leave darkness behind forever,” Asher said patiently. “It’s not a decision you make once. Being Terävä is how we’re born, but not how we have to stay. Being Tähti can be achieved, but once it’s achieved, it’s easily lost again.” But story itself is kinda slow, without action, so there is no fights between the immortals or using their powers. This is more of the type with how immortals choose to live their looooong lives, although there is always way to die-beheading. Also, the part that was in the synopsis about someone trying to kill her, happens around 70% of the book...So yeah.......xDBut, the story hides something interesting, and that was interesting. Some parts of it will probably be important in the next books though.____________________________________________\n\nCharacters\n\n: ____________________________________________This is also one of the rare books where i actually support the heroine way to much, and i am basically in love with her. Nastasya is ideal type of heroines i love and those are rare. There are also a lot of characters, 13 in River's edge: the 4 teachers-River, Solis, Asher (who was River’s partner), and Anne, and students: Daisuke, Reyn, Nell, Rachel, Charles, Brynne, Lorenz & Jess. And in her previous group: Stratton, Innocencio, Cicely, Boz & Katy.... Like i said, many characters :D And the others: Old MacIntyre, his daughter Meriwether, Dray(short for Andrea)- aka goth girl.... and soooooooooo on xD\n\nNastasya \n\n: She is very interesting type, and i could just connect with her. She is in other words, awesome. She had some awkward situations and i found her cute as well. She is not self centered or too confident. She knows her limitations, and she knows to differ right from wrong. I liked her and she never once betrayed my expectations....I like that she is being honest to herself and that she admits that she is in love with Reyn. Some scenes between the two were very funny, like:“You’re—you’re really not that good-looking,” I finally snapped. His eyes opened slightly—he had probably expected a comeback of somewhat higher quality. “Your nose is too pointy.” I was mortified to see my chest heave as I sucked in breath. “Your lips are too thin, you’re too tall, and your hair is really more brownish, not gold. Your eyes are small and squinty!”Now he was looking at me as if he’d never seen someone having a psychotic break before and found it fascinating.I flung down my dish towel, humiliated to be doing something so—clichéd. “Plus,” I hissed, “you’re such an asshole!” And she still thinks he is hot xD. Buuuuuuuuut..........there were some things that still shocked me.Other than that, she has lived for 459 years, but being in bad company made her closed to others, shy, and not so revealing type. Once she witnessed what her own best friend was capable off, including breaking the taxi driver's spine for amusement, shocked her to the core. She run away soon after that, trying to understand why she followed her friends to party instead of helping poor man. She felt guilt and she wanted redemption, she understood that she needed change.As for her life, previous one, i didn't quite expect anything, but i got something interesting....Especially the part with concerning someone.... \n\nReyn\n\n: was all doom and gloom and i-do-not-want-you-here type. He was way to withdrawn, quiet and guarded. He also keeps his emotions under tight control. But the revelation about him and his past was something quite interesting. Where i was like:His relationship with Nasty though, was something quite else. It is not rushed, they didn't even interact so much between themselves. Oh and how i laughed about the ways Nasty called him: Viking, Viking god, Odin, and things like that. \n\nOthers\n\n: I liked Dray, the gothic girl, and i liked River, the wise leader of all. On the other hand, that Incy guy has much issues... xD Or he is just obsessed with Nasty way to much. As for Nell....i think the next img shows enough of what i think about her:____________________________________________\n\nOverall\n\n: ____________________________________________Fun, fun, fun, fun, fun, fun, fun, fun, fun, fun, fun, fun, fun book :DWell, not much of a LOL type, but it was highly entertaining read.My body is ready for second one >:D____________________________________________● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ● ●____________________________________________ REVIEW(S) RELATED TO THIS BOOK:>>  Immortal Beloved (Immortal Beloved, #1)  <<>>  Darkness Falls (Immortal Beloved, #2)  <<>>  Eternally Yours (Immortal Beloved, #3)  <<"}, {"userName": "Misty", "userReviewDate": "Jul 23, 2010", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "Weirdly, unexpectedly, I was sort of amazed by this.  I'd heard of Cate Tiernan but never read anything by her.  I'd had friends  that pushed this on me (especially one who shall remain Allison nameless).  It has a grandiose, somewhat silly title that I can't help but like because it reminds me of Gary Oldman and Beethoven.   But somehow I still just wasn't expecting much from it.  Maybe it was the idea of an eternal club kid that just made me turn up my nose and say, Um, no.  But for all of the good I've heard about Cate Tiernan, I went into this with my expectations low.  And the b*itch proved me wrong.I friggin loved it.There were so many times it could have gone wrong - even should have gone wrong.  So many pet peeves and really bad tropes that had the potential to just kill it dead. And yet, Cate Tiernan not only made those pet-peevish things work, she made me like them. She made me say, yeah, ok. I'm with you. 460 year old club kid? Sure. Protag who is powerful and special and gosh darn incredible without realizing it?  Okay.Melodrama, crazy instant attraction, and a healthy dose of angst?  Bring it.Viking alpha male almost-rapeyness?  Why the eff not? I don't understand it.  If you had mentioned even one of those things, I probably would have quirked an eyebrow and said \"Pass\".  I would never have conceded to the possibility that I might end up liking any one of them.  But I did.  Like, a lot. Cate Tiernan, you're a crafty one.  I understand why you write about witches, because clearly you are one.I have to say, I love when someone proves me wrong. I love when someone takes something that I think is never going to work, and then makes it work.*  In less skillful hands, so much of this could have been very bad.  In less skillful hands, this book could have ended by being tossed against a wall, and this review could have been a rant.  But I wasn't irritated.  I didn't hate everything.  I didn't hate anything.  I feel vaguely warm and fuzzy. It's more than a little unsettling.I could tell you all of the reasons that it worked, or all of the things I really liked, like how it was a great set-up for the series and had interesting world-building. Or how I really liked Nas and wanted to know more about her, and Reyn, and River and Incy, and all the rest.  I could tell you about how the flashbacks kept me intrigued and flowed well, rather than feeling abrupt and \"foreshadowy\" and pissing me off.  I could tell you about how it handles the concept of immortality better than just about any vampire/immortal/paranormal YA out there, or how it has this almost epic feel to it.I could tell you all of those things, but what would be the point?  All I really want to tell you is to pick this one up and give it a chance, and let you find those things out for yourself.Immortal Beloved was a strong start to a promising series - really really really readable and engaging, and I definitely get the appeal of Cate Tiernan now.  I love when something thwarts my inner bitch and robs me of a good rant.I like you Cate Tiernan; I've got my eye on you...~ Other shiny editions ~\n\n\n\n*Did anyone else just hearTim Gunn in their head?"}, {"userName": "Nafiza", "userReviewDate": "Feb 10, 2010", "userURL": "http://www.goodreads.com/user/show/2483439-nafiza", "userReview": "Let me start off by saying that I loved Cate Tiernan’s Sweep series. I must have read them more than a dozen times. Okay, I loved them all except for the last book where the main character gets old. Afraid of my mortality? Who me? No, of course not. But anyway, point is, I like Cate Tiernan’s writing. I like her characterizations and, most of all, I like her plotting. Suffice it to say that she’s mostly brilliant in my opinion. So when I found out that there was a new book coming out by her, I was excited. Because, hello, awesome books will make for awesome reading. Okay, potentially awesome. I didn’t get to read it until some months after it was released but before that I read some reviews and they were mostly of the mixed variety. I was not really perturbed. Reading is so subjective. But I finally did read it and let me say this: It was awesome.I love, love, love flawed characters. I know they walk a thin line where they can easily become unlikeable but I felt Tiernan created Nastasya with just the right mix of spunk and irreverence. What she has been through, what she has experienced and seen does justify her attitudes. And she is irreverent, even caustic at times, very bratty but the reader senses early on that this attitude is a front she has nailed into place so that she is not vulnerable to the world and it’s many ways of hurting her. Is she annoying? I certainly didn’t think so. Her voice is fresh and compelling and her unwilling acceptance of her own imperfections are paired with just the right amount of disgruntlement that you can’t help but be won over.Tiernan has proved herself a master of weaving mythology through her narrative flawlessly. As she did with the Sweep series, she does so again with Immortal Beloved. The “immortals” are becoming a popular trope in both adult and YA paranormal novels and, like every other thing that is regurgitated endlessly, there is a potential for this theme to be overused. However, I like how Tiernan does not gloss over the negative side of what it means to live forever. She doesn’t romanticize the whole issue either. I won’t go so far as to say that it was wholly realistic, it is a YA paranormal novel after all, but I will say that it was tinged with a lot more realism than many books dealing with the same things. Nastasya has been married, she has been a mother, a widow – she has had multiple lifetimes and these things are bound to change a person’s perceptions of the world – I am not sure you can even call her a YA heroine. However, she does retain a sharp wit, an understanding of her own self and that vulnerability that is so reminiscent of the teenage years.On to the love interest. Reyn. There is no, “he is perfect, I want to knit him woolly scarves” kind of vibe here. There’s attraction, of course. Lots and lots of attraction. The kind that will have you fanning yourself or choking back a laugh at one of Nastasya’s wry remarks. But the attraction is tempered by many other issues which are remain important despite being historical. I like Reyn. Nastasya likes…well, I wouldn’t say she likes him but she does uh…like him. Yes. Anyway, he is an intriguing love interest.Other characters. Nastasya’s “friends” remain interesting though largely absent in the story. I am sort of glad about that because they seem like people beings I wouldn’t want to have contact with. Obviously Nastasya is going to need to confront them, perhaps in the next book but until then, they remain psychotic. Other characters at the “rehab” station that Nastasya ends up at are interesting. They are shadowy though and ambiguous but since the story is told in first person, I am not too concerned about it. Nastasya’s voice is loud enough.Anyway, I thoroughly enjoyed this book. I loved the idea of a rehab for immortal beings, being brought back to nature, trying to find value in time again when they have so much of it. I like Nastasya’s prickly composition and Reyn’s dense stoic self. The mythology is well constructed and the setting is detailed. I think you should give this book a chance if you haven’t done so already. If nothing else, you’ll enjoy a laugh or two or many. I know I can’t wait for the next one in the trilogy."}, {"userName": "Katrina Passick Lumsden", "userReviewDate": "Nov 17, 2010", "userURL": "http://www.goodreads.com/user/show/1964146-katrina-passick-lumsden", "userReview": "I absolutely love this book. It surprised me because I've read some of Cate Tiernan's Sweep series and, while I enjoyed those, they never in a million years would have led me to believe Teirnan was capable of the kind of writing I encountered in Immortal Beloved. The characters are believable, beautifully flawed, and interesting. The dialog is simple and realistic. The romance alternates between sweet, confusing, terrifying, and heart-wrenching. At first glance it may appear that the protagonist is awfully immature for someone who's been around for over 400 years, but that's kind of the point Tiernan's making; Nastasya IS immature. And she's immature because she's spent 459 years avoiding her traumatizing past and refusing to grow up. This book combines a little romance with the supernatural world of Immortals, but it's mostly about Nastasya's struggle to find herself, and that journey isn't an easy one for her. I loved her as a character. She's strong and funny, but there is an underlying fragility that keeps her from coming off as uber-bitchy. The love interest, Reyn, is not your typical supernatural YA hunk, either. He's a villain who's reformed, sure, but he's not wallowing around in self pity or trying to come off as a bad ass. While he seems genuinely contrite regarding his past behaviors, he knows he can neither justify them nor will them away. No projections or illusions with Reyn and that makes for a thoroughly enjoyable character.There's a small bit of mystery interlaced as we travel with Nastasya through her memories and slowly uncover who she is and where she came from (and the mysterious tie that she and Reyn share). There's also rivalry in the form of a younger immortal who is vying for Reyn's attention. Not to mention some rather unsavory friends of Nastasya's who are out looking for her when she doesn't want to be found. I found this book altogether enjoyable and completely worthy of a second, third, and maybe fourth read. The only complaint I have is that I have to wait until September for the next in the series."}, {"userName": "WillowBe", "userReviewDate": "Jan 04, 2011", "userURL": "http://www.goodreads.com/user/show/1842059-willowbe", "userReview": "I LOVE this story. I LOVE it so much, I stopped reading it. I will control myself and wait for the other two books in the trilogy to come out so that I won't sit around bemoaning the wait. I am so into this story, so into the guy, that I just need to back off. This is the type of teen book that easily satifies an adult reader. These charactars are less immortal teenagers than immortal beings that happen to look like teens, but don't necessarily act like them. The charactar's navigation of the timeless issues of loss, redemption and the difficulty of making moral choices daily is riveting. The existential angst is what I find intriguing; it adds depth to the tension, caused by the suspense of the overt mystery that carries the books events (which any adult reader of paranormal fic will easily unravel). And no vampires were used in the making of this book!BTW IB reminds me a bit of Sarah Rees Brennan trilogy- the Demon's Lexicon, Covenant- two other books by an Irish writer that I wish I'd waited for the trilogy to be completed before I started reading. Ms. Tiernan is a much better writer, or rather her experience and mastery of the form is evident in her prose."}, {"userName": "shady boots | #20gayteen", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/4972138-shady-boots-20gayteen", "userReview": "This review is also available over at my blog.__________________________This book is probably my most favorite book about immortals that I've read so far.Nastasya─or Nasty, as her friends call her─is a 459-year-old immortal who's been living life and partying with her crew of other immortals. Until one night, her best friend Innocencio─Incy, for short─tortures a cabbie right in front of her, and she's suddenly filled with fear and decides to run away, seeking a house called the River's Edge. She soon finds out that the house is a rehab for wayward immortals, and there she meets River, the owner of the house, and Reyn, the fellow immortal that she can't help but be attracted to, but who she finds is somewhat familiar to her. Just when Nasty thought she was going to belong there, she finds out that someone wants her dead.I definitely noticed the difference from other YA immortal books out there. Most immortal books in YA tell of a regular human girl meeting the mysterious immortal boy, but this one is so much more than that. Nastasya is an immortal girl who has really been through everything. What I loved about this book are the flashbacks and memories of Nastasya's life in different times, and also when she was still very young, before she knew of her immortality. Most of those scenes were very heart-wrenching for me, mostly due to how graphic they are.Nasty is just awesome. I loved her attitude and her way of thinking, and how she would call Reyn, the love interest, the Viking god or Odin the Odious. She definitely made me giggle and smile a lot, and she was just overall a very likable protagonist.Reyn . . . He's actually a love interest that was hard for me to figure out. He wasn't a jerk, no. He was . . . I don't know. Quiet, dense, I never really connected to him. But I loved the big reveal about him, and Nasty's overall relationship with him. There was nothing rushed at all about their romance. We barely even get to see it, besides some sexual tension here and there, but there will probably be a lot of it in the next book.Nell was the bitchy character in the book, but she had a nice facade in the beginning. But the more and more you progress through the book, the more you would notice her start to crumble and lose her cool. But even though I hate her guts, I'll admit she did make the book a lot more interesting.River is the owner of the River's Edge house, and she's about 1300 years old. I did like her, but there wasn't much about her that stuck out to me. I liked the other minor characters in the house too.What I also loved is how the immortal thing works in this book, and what the purpose of the River's Edge house is. Every immortal is born Terava─meaning evil or dark. At River's Edge, the immortals are taught to appreciate the little things in life, and to become Tahti─meaning good. But once you do become good, that doesn't mean it'll stick. You will have to make sure to stay good, and not give in to dark magick, thus becoming Terava again. I thought that was very interesting.I definitely get why I've seen a lot of positive reviews for this book, and I'm very excited to see where this series will go. I already recently bought the second book and can't wait to read it! I would recommend this book to you if you want a great YA book about immortals, because most of the other ones I've read had never impressed me as this book had."}, {"userName": "Jessica", "userReviewDate": "Jul 07, 2010", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "I picked this up as an ARC at ALA, mostly because I saw the words \"Viking god\" on the back, then promptly stuck it on the bottom of my \"to read\" pile. MISTAKE! I should have read it immediately! What a fabulous book! I was giddy as I read it. GIDDY!First of all in our things to love: our protag, Nastasya, a name that I didn't care for, and thought on the first page, \"I'm going to hate her soon, because of her name.\" But it isn't her real name, it's not even close, and the reason why no one has called her her real name in centuries is revealed in heart-breaking little flashes. She's a heroine that you soon grow to love, because she feels herself to be unlovable, but not in a self-suffering, oh-poor-me way. She's very matter-of-fact about it. She's done terrible things, suffered some very real horrors, and hates herself as much as she thinks anyone hates her. She has a tender place in her heart, however, for teenage girls like the one she used to be. She has a sharp sense of humor, and wields sarcasm as delicately as a rapier. (Anyone who says sarcasm is the lowest form of humor has clearly not heard it done right.) I was howling with laughter at the things she said, and thought, and her discovery that she can get rid of her boss by asking him to do a price check on Kotex is the best. thing. ever.More to love? The very realistic look at immortality. After four hundred years, Nastasya has literally seen and done it all. She's traveled the world, eaten every kind of food, done every sort of vice, been married, had kids, tried everything a human can try. Now what? The average immortal is, essentially, a partier. Because they can drink all night, sleep with anyone who crosses their path, and then walk away from it all. No cirrhosis of the liver. No lung cancer. No STD can stop them. And the weight of the years, and decades, starts to wear on them until they will do anything to numb the pain for a day or an hour. They have magic, but for most of them it means drawing on the lfie force of others, leaving animals and plants dead in their wake, and for what? A party trick that impresses your friends and makes you forget your dead loved ones for a few minutes? So what do you do, and how do you make it all stop?Intrigued yet? YOU SHOULD BE! Go, grab a copy of this book, and hold it to your bosom for a just a moment before you dive into one of the best books you'll read this year!And remember: when you're buying pants, most people try them on first.11/15/12 Reread: Loved just as much as the first time."}, {"userName": "Mandy at Blythes & Books", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/6007547-mandy-at-blythes-books", "userReview": "Immortal Beloved by Cate Tiernan Series: Immortal Beloved, book 1Genre: YA, Fantasy Published: September 2010Pages: 407My rating: 2 stars UNFINISHED!For more reviews hop on over to my blog, www.blythesandbooks.blogspot.comIt couldn’t have been just the blurb that got me to buy this book, because that still made me wonder what on earth the book was about. So, other than the beautiful cover, it must have been a review that drew me to the book instead. Because reading the summary on Goodreads didn’t do it for me either, to be honest…\nNastasya has spent the last century living as a spoiled, drugged-out party girl. She feels nothing and cares for no one. But when she witnesses her best friend, a Dark Immortal, torture a human, she realizes something's got to change. She seeks refuge at a rehab for wayward immortals, where she meets the gorgeous, undeniably sexy Reyn, who seems inexplicably linked to her past. Nastasya finally begins to deal with life, and even feels safe--until the night she learns that someone wants her dead.\nSo, how interesting can a book about an immortal wasting her (not so-precious) time be? After the overdose of vampires, angels, witches, faeries, dragons and other supernatural beings we’ve had lately, it was high time for a ‘new’ supernatural species. Why not drag out the old (pun intended) immortals again?! Okay, why not? Okay, why so? After reading the initial paragraphs I wasn’t even that curious to find out WHY Nastasya’s life had been turned upside down, because she sounded like a drag. But I read on anyway. (One thing that stood out immediately though: the book is written in the third person! Finally! I was beginning to think they stopped making them all together!) However, as I said before: Nastasya’s mind, where I found myself the entire time, never stopped spinning in circles with the same uninteresting, selfish thoughts. After what happened in the beginning I really didn’t like this girl. Woman. Antique. At all. I was baffled that someone her age (about 450 years old!) still acted so adolescent. Her friends seemed like ‘the wrong crowd’ also; an elite, arrogant, sadistic, superficial, egoistic clique. Especially Innocencio. (Note: I understand people had different names in the past, but these are truly unpronounceable…) But, a good thing happened when ‘Nasty’ didn’t like herself either and ran away, ending up at a kibbutz/rehab centre for immortals. Reyn sounded like a dream come true, being, you know, the guy you usually don’t encounter unless he’s on the cover of cheap romance novel. Swoon. Not certain whether to blame my own lack of reading mood/time, or the promise of having to continue this particular book, I choose to go with the last reason after all. I gave the book another chance last night and continued reading. It seems the only time Nastasya really had been happy was during the sixties: when she was on drugs, at parties. How shallow. How pathetic. Things became even worse (be it with a heads-up provided by Cate Tiernan herself) when Nasty found out about Reyns German background/origins and decided to act on them when he suggested she could rinse the dishes. Proving that maturity doesn’t necessarily come with age, I saluted and goose-stepped to the sink. ‘Yes, Herr Kommandant!’ My jaw practically dropped to the floor upon reading that, feeling vicariously embarrassed for Nasty. The story proceeded to drinking herbal tea, kneading bread and Nastasya’s thoughts about those things, as well as her thoughts on the self-grown vegetables. Not only extremely boring to her, also to me. Nastasya is a failure, a loser, a quitter, a very adolescent girl despite her age. She’s all the things I mentioned above about her ‘crowd’ which makes her an unattractive person, unappealing to me and underserving of my further attention. I don’t care what’s going to happen to Nasty, whether she will succeed in becoming a better person. It only took her 450 years to realise what a horrible person she is, I however already knew after reading the first page. (Maybe that IS a sign of good writing though?!) She couldn’t have had a better nickname. After reading about 82 pages I finally decided to give up. I’m not wasting my time reading her story, the way she wasted her eternal life. If I happen to find myself being immortal after all, I might give ‘Immortal Beloved’ another chance. Until then it’s ‘Immortal Whatever’ to me."}, {"userName": "Jen (The Starry-Eyed Revue)", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/4659650-jen-the-starry-eyed-revue", "userReview": "When you're out of audiobook options and you stumble upon a book at the library that you didn't even know you needed to read. That's this book. I'd seen a few friends enjoy this series over the years, but I paid it little mind as I was rocking' and rollin' through my own TBR. I should know better…it's the quiet books, the ones that get less attention that usually end up being well worth my time. And this book was, especially with that narrator. She had Nasty's snark and attitude down pat. Such a fun and different take on immortals. Which is why I downloaded the second book from the library before I had even finished this one."}, {"userName": "Mara", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/6879652-mara", "userReview": "Dear Immortal Beloved,I had my doubts from the very beginning. You are not the sort of book I usually grab. Party girl immortal, rehab center, undeniably sexy dude - these are all warning signs for me. But I had to read you for several reasons. So I set aside my doubts and went into you with an open mind. I bet you fifty bucks to guess what my response was.Nastasya is a 600+ years old immortal. She's experienced every horror life has to offer. Her family was murdered in front of her very eyes, she's been forced into marriages, watched her children die, suffered through famines and plague and wars. Somehow, though, instead of turning her into a callous, tortured soul who has seen humanity's cruelty, Nastasya has stayed a spoiled, angsty, self-absorbed teen. Who is also inexplicably, but conveniently, independently wealthy. She's buried her pain in drugs, bad fashion choices, drinking, snogging, and hanging out with a bunch of equally-immature, eons-old immortal teens. But then, everything changes, when her buddy Innocencio (don't laugh; that's actually his name) decides to take things a little too far and uses \"dark magic\" to snap a poor mortal's spine just for fun. Nasty (yes, that's what people call her for short) finds this disturbing behavior so out of character with creepy Innocencio that she packs her bags and heads to a rehab for immortals in the middle of nowhere. Once there, she spends the rest of the 300+ pages. . . .doing household chores. And throwing tantrums and crying because she doesn't fit in with the good, natural path immortals at this crazy ranch. And oggling super duper sexy Reyn. Oh, and there's a \"weird scar\" on her neck she doesn't want anyone to see. But that would be too interesting to explore. Nah, let's talk about floor scrubbing techniques. That's much more interesting.You suffer from three major crimes: being boring, a punchable protagonist, and too many shirtless men - including men who are not actually shirtless, but somehow still manage to be. I can appreciate a sarcastic protagonist, but there's a fine line between a sarcastic female and a complaining bitch. Nasty landed in the latter category. I wanted to sympathize with her - I really did; it would suck to live for so long and suffer so much. But she was so teen and had so many freaking meltdowns that I finally just wanted someone to ram her head into a door. Just put her out of her misery, please. It will do the entire world a great service. I can't even really tell you what I thought of the other characters, except Reyn. Ohhhhh, broody, godlike, sexy Reyn. The world's most shirtless man, right next to Matthew McConaughey.Reyn is a very typical \"hot hunk.\" Temperamental, moody, broody, violent, and too hot for his own trousers. And in case there's any doubt in the Reader's mind, Nasty makes it clear every time he steps into a room just how handsome a hunk of man flesh Reyn is. Yes, their romance is totally and completely carnal. Nasty even fantasizes about what it'd be like if he slammed her against a wall and kissed her until she was bruised. Mmmm, sounds just sooooooo romantic, now doesn't it? Who wants a gentle, good man? Give me a woman beater any day! Reyn's personality follows his shirt: it isn't there.Your plot, Immortal Beloved, literally consists of Nasty's tantrums, lusting after Reyn, and household chores. Occasionally the monotony is broken up with flashbacks to Nasty's past, but these flashbacks do nothing more than make the Reader weep when we are forced to return to the present narration - and also break up the natural flow of writing. There's some hinting at Nasty's scar; what it means, how she acquired it, why Innocencio maybe liked having her around so much. But mostly? We get to read about Nasty complaining about scrubbing floors, doing laundry, baking bread, currying horses, planting kale, suffering from dizzy spells after a bit of magic practice, and oggling Reyn some more. If I want to read a book about chores, I will pick up Little House on the Prairie - a much, much, much more fascinating read.Right when the plot starts to show a tiny bit of promise, in the form of an assassination attempt on Nasty's life, it boils back down into a bitch fight. See, Nasty isn't the only one who notices Reyn's blinding hotness. There's another immortal: Nell. Nell has a thing for Reyn and she sure as hell isn't going to let little petite Nasty encroach on her man flesh. Suddenly Nasty is facing down little jealous rages, snide remarks, and little annoying things that make her chores just a bit more difficult. And no one suspects Nell might be behind the ill magic directed at Nasty. No, not at all, because no one else would want to harm charming Nasty, would they?Oh, sorry; was that a spoiler?? NO! Because it was so flipping obvious!!!! Let me be perfectly clear about my feelings towards you, Immortal Beloved: I wanted to claw my eyes out by page 8. You begin so abruptly that the Reader has no time to appreciate the \"sudden\" change in Innocencio's behavior. Suddenly we're whisked off to the rehab center, where you boil down to 300+ pages of chores, self discovery, tantrums, and one of the world's shallowest romantic interests - complete with a jealous bitch. There's some hinting at magic and mysterious destinies and ancient houses and all that jazz - but it's hardly explored. When there seems to be promise of a villain, it becomes painfully obvious that no, it's just more bitch fighting, and your climax seriously boils down to a jealous rage over man flesh taken way too far. Your characters were either aggravating or flat at best. It was like pushing through a sandbox while wearing lead shoes, finishing your final 100 pages. I couldn't throw you across the room fast enough when I finally got to the end.And that is how I felt about you.Feeling BORED,~ Mara A. ~"}, {"userName": "Keertana", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "Not for the first time, I am intensely annoyed at whoever named this book. Actually, this series as a whole. If you're anything like me, then you've been burned by the YA Paranormal Genre too many times to count and have solidly shut and locked that door behind you, burning the key while you're at it. Yup, that's right, I have moved onto brighter - more satisfying - pastures. Thus, you can imagine my surprise when I was recommended Immortal Beloved by a close and trusted friend. In my mind, the words Immortal Beloved = Vampire Romance = Run Away Screaming. Not a very promising start for a series, but I was reassured - multiple times - that this book had nothing to do with vampires and I am incredibly glad I picked it up. Folks, sit up and listen because this, this is good Paranormal YA. (Yes, it exists! It's not a myth!)When Nastasya, an immortal having lived on Earth for well over four decades, witnesses her best friend paralyze a cabbie driver with his dark magic, she gets the wake-up call she deserves. For many years, Nastasya has partied and sinned with a group of immortal friends, fed-up of seeing her lovers and children grow old and die. Now, however, Nasty is disgusted that she could become the person she has become and she quickly flies to Boston to attend a rehabilitation center for immortals run by River, a woman she briefly met in France many years ago. As Nasty will realize, though, rehabilitation for immortals doesn't simply mean becoming a good person, it means embracing the emotions she's shut herself off from for centuries. What I love about Immortal Beloved is that it is a primarily character-driven novel. We become one with this snarky narrator and her struggles soon seem like ours. As Nasty learns to give up her old habits of drinking, as she soon becomes immersed in the organic lifestyle at River's, as she begins to open herself up to other people - new friends, both immortal and mortal alike - her transformation is remarkable. It isn't easy and it is littered with dark thoughts, sharp flashbacks into the past she has lived through and tried fruitlessly to forget. Tiernan crafts Nasty in such a way that her voice is relate-able and real. It's common for humans, not just immortals, to stamp down on bad memories and seeing Nasty learn to face her past and her fears is an experience that readers can connect to. Furthermore, Nasty's past allows us a glimpse into different windows of history. Seeing Nasty herself change from those time periods to embrace the present makes us all the more cognizant of what we have today. One of my favorite aspects of this story, though, is the romance. Reyn, another immortal Nasty meets, is strange and aloof, but the chemistry between him and Nasty is palpable. If anything, these two circle each other, both uncertain of whether or not to start something new. It simmers, is shockingly sweet, and remains a very small element of the novel overall. Nasty's narration is hilarious and gripping, one you won't want to stop reading, and the thought Tiernan has put into creating an immortal character - one who has suffered through so much, century after century - is admirable. I absolutely adored this introduction to the trilogy and cannot recommend it enough for fans of YA who believe the paranormal sub-genre is dead. Clearly, it isn't."}, {"userName": "Elise ✘ a.k.a Ryder's Pet ✘", "userReviewDate": "Aug 06, 2014", "userURL": "http://www.goodreads.com/user/show/13567836-elise-a-k-a-ryder-s-pet", "userReview": "“It’s hard,” Reyn said. “It’s the hardest thing I’ve ever done. It’s a constant battle. It’s life or death.”“And why do you try?” “Because to not try is to admit the other side has won. To not try is to embrace death and eternal darkness. And in that way lies madness and despair and unending pain.”\n\nMy casting: (Just a little bit younger, considering Reyn supposed to look 20 years old and Nastasya 17 years old.) I have a... hate-love relationship with this book. I love the story, the finding yourself, finding a place to belong, it's great, BUT, yes there is a but, the book was waaaay too long.. It was dragged out almost to the point where I wanted to quit, or to where I almost fall asleep. Luckily I didn't do that, because the book picked itself up xp Not much happened other than Nastasya trying to find her place, trying to find herself. But it worked, and I don't regret reading this book at all. + there's no insta-love here, and that's just perfect for me, because I HATE insta-love. Reyn's hot, and who the hell says no to a viking god? I diffidently want more of him, so I have to start reading next book :) Let's hope next book has more action :D! Rate: 4/3 stars."}, {"userName": "Cynthia", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/16856264-cynthia", "userReview": "Immortal Beloved is now one of my favourite PNR/UF series.This trilogy reminded me of the Vampire Academy books, except much improved in basically every aspect.I liked almost all the characters, which is rare for me. It's set in sort a centre for troubled Immortals so everyone was flawed, yet interesting and totally relatable. Nasty was such a great heroine and I loved seeing her character develop throughout the series. What I liked most about her was her sense of humour. There was a couple times I had to stop reading because I was laughing too hard.These books are seriously underrated. If you like PNR/UF, definitely pick this up. It's a really fun and entertaining read."}, {"userName": "~Tina~", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "TBR Reduce Challenge #28- 2011 (Arlene)I don't really have much to say about Immortal Beloved. I didn't hate it nor did I love it. The writing is well done the concept intriguing and it's characters likable.Nastasya is a pretty complex character who has been immortal for the last 450 years and at the start of the story we find her scared and nervous about what she had seen her friend do. What he's become. How that darkness that's very much apart of her is something she wants nothing to do with. So she runs away in a constant inner-struggle between her desire to better her soul and the desire to sink back into her old routine of partying it up and finding her next emotional fix.When she finds a Zen lifestyle that could save and betters her soul, she takes it, but it starts to get a little more complicated once she realizes who Reyn really is and how he's linked to her past.Some of the scenes genuinely captivated me while other scenes dragged a bit. Still it definitely had it's moments and while I probably wont go out of my way to read the next book once it hits the shelves, I'm still curious enough to see what happens next.A decent read."}, {"userName": "Nerea", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/22579621-nerea", "userReview": "Pues al final coge un poco de ritmo y no está nada mal. Es bastante introductorio y la trama un tanto simplona, pero a mí me ha entretenido. Me voy a por el segundo."}, {"userName": "Sita", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5831199-sita", "userReview": "Read the first 50 pages, but couldn't bring myself to read the rest. Not worth your time."}, {"userName": " ⇝LEAH⇜", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/9683519-leah", "userReview": "A slow burning, contemplative tale...that is both historical and contemporary.Book Title: Immortal BelovedAuthor: Cate TiernanNarration: Kelly LintzSeries: Immortal Beloved Trilogy #1Genre: Urban Fantasy, Paranormal Romance, MagicSource: Audiobook (Library)☆My Pick for Book Theme Song: My Immortal by Evanescence (Between the title and the tone of song, I think it fits perfectly.)Ratings BreakdownPlot: 4/5Characters: 5/5The Feels: 4.2/5Theme: 4/5Flow: 5/5Backdrop (World Building): 5/5Originality: 4/5Book Cover: 4/5Narration: 4/5Ending: 3.5/5. Cliffhanger: \"to be continued\"\n\nOverall Rating: 4/5 STARS\n\nMy Thoughts\nFirst Impression: Immortals who are not Vampires…I think I like this.Nastasya has lived an incredibly long life and she has so many stories to tell. This story snuck up on me slowly, their isn't a lot of action, but there is a lot of introspection. I do have to say for someone who has lived as long as she has…she has a lot of growing up to do. With that being said, I still think she is a cool, and seriously badass chic. I liked her, because she seems to be on the right path now.The world of Immortal Beloved is alluring yet intimidating. It seems to me living that long could get really boring, especially with the life she had been living lately. On other hand, think of all the books you could read with that kind of time.Sex Factor: Not really any.Will I continue the series? I think so, because I'm intrigued to see where this thing between Reyn and Nastasya is going."}, {"userName": "Steph Su", "userReviewDate": "Jun 05, 2010", "userURL": "http://www.goodreads.com/user/show/2010935-steph-su", "userReview": "Is it weird that I’m wavering whether to give this book 3 or 5 stars, and not something in between? (4-star books are my babies and not given out lightly. *hugs*) IMMORTAL BELOVED really did something for me. I lament the repetition in paranormal literature nowadays, but while immortality is not news, the careful way in which Cate Tiernan layered this story is something to take note of.Tiernan incorporates flashbacks into the narrative in a way that doesn’t feel forced. At first we think we know what the smart-mouthed Nastasya is about: oh, just another poor little tortured soul of an immortal being who’s lost sight of her humanity until she meets the right person, or people. But the more time I spent with Nastasya, the more compelling I found her. Yes, she’s fallen into some despicable times and habits, but her flashbacks reveal her behavior to be a perfectly justifiable defense mechanism against some horrible memories. The flashbacks serve not only to illuminate her character, but also to add a sliver of suspense and investment with every page we read, so that while in the foreground nothing truly remarkable happens—Nastasya runs around a farm for reformed immortals and struggles to adjust to their ways—we can’t help but be sucked in. Nastasya reminds me of some of my favorite paranormal/urban fantasy female characters: strong, a wiseass, independent enough not to obsess over Reyn, despite his sullen bad-boy hotness. She’s attractive because she refuses to play the “docile, hurt female” role expected of her, and so I can see why Reyn is attracted to her (thank God for the absence of inexplicable paranormal romantic attraction!).IMMORTAL BELOVED is admittedly slow, especially if you feel like flashbacks are a cop-out from true plot. However, the characters have convinced me of their interestingness, and Nastasya has secured my empathy and respect, so I will be really interested to see where Cate Tiernan takes us next. IMMORTAL BELOVED just might remind us paranormal lit cynics (yes, that’s me) that good writing and strong, well-developed characters can still take us all the way."}, {"userName": "Angela", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/3594909-angela", "userReview": "This is not your usual YA novel. No vampires, no angels, no werewolves. The main character is a girl named Nasty that is immortal. She has let her life run off the rails as she has lived her different lives. But now she has realised she needs to straighten her life out and start really living. This includes giving up partying, drinking, etc. As she struggles to re-organise her life old lives come back to her as well as a deep power she never knew existed inside her. Meeting new friends and enemies, the book uncovers the mysteries of Nasties forgotten legacy and lives.I found this book rather interesting. I do admit there were times where I got a little bored, but if you can get past them in really does grow into a great story. The ending leaves you satisfied yet also interested to see what happens next. Can't wait for the next installment."}, {"userName": "Katie", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/33336161-katie", "userReview": "Absolutely beautiful. I'm so glad I reread this book. I can't wait to get into the second one. I need to order the third one right away. I neeeeeed it!!!"}, {"userName": "Lid", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/5673919-lid", "userReview": "Reseña: http://librosdelcielo.blogspot.com/20...Re-lecturaAmor inmortal es un libro que se devora por su agilidad y el sarcasmo con el que está contado. Gracias a la historia de los inmortales nos tropezamos con unos seres sobrenaturales distinto a lo acostumbrado -existen más cosas aparte de vampiros y licántropos- y resulta muy curioso que te cuenten historias de su vida en años pasados."}, {"userName": "Chibineko", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/4436152-chibineko", "userReview": "It is with a heavy heart that I finished this book. Why was it heavy, you ask? Because it made me realize that I've got about a full year until the next book in the series is supposed to be released. For once I'm reading one of Tiernan's series & not had the luxury of having all of it finished by the time I started reading it.The Immortal Beloved trilogy follows the character of Nastasya (aka \"Nasty\"), an immortal being who has spent much of the last century drunk or otherwise incapacitated. It's easier for her to go through life not being aware of any of it than it is to face the darkness in her past. When one of her friends cripples a human over a perceived insult & treats it like a joke, Nasty knows that she's got to get out. She was once offered a safe haven years ago by a fellow immortal at a place called River's Edge, so that is where Nasty heads off to. She doesn't know if the person is still there or if the invitation is still open, but it is the only place left open to her. What she discovers there is a harder truth than she might be willing to bear.Once I started reading this book, it was incredibly hard to put down. Like Tiernan's other works, this is very much an addicting read. The characters are all beautifully flawed, which makes them not only people you can root for but also makes them believable. This book is much larger than her other series, but I'm chalking that up to her being with a different publisher, one that is willing to allow her to write a larger book. (The original publishing house for the Sweep series limited her to a certain number of pages per book, among other things they tried to control.)This is a fabulous book, but I have to warn potential readers- there's a lot in here that is very, very familiar. Many of the themes & elements have been used in Tiernan's other works & at times many of her characters showed marked similarities to characters from the Sweep & Balefire series. This wasn't a bad thing, mind you. With any other author it might be, but somehow Tiernan manages to take these similar elements & weave them into something so readable & fun that by the end of the book I wouldn't have cared if she'd suddenly made everything a carbon copy of her other books. The book is just that good.The bottom line is that if you've loved Tiernan's other books, this is guaranteed to be something you'll love. I love seeing Tiernan write with a little more freedom & I'm excited to read the other two books in the trilogy. I'm not sure if this will replace Sweep as my favorite of her works, but so far it's pretty darn good."}, {"userName": "JonSnow", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/39746437-jonsnow", "userReview": "Something about this novel captivated me, as is always the case with Cate Tiernan novels. Pinning it down is often curious.As a huge fan of Cate Tiernans Sweep and Balefire series', I was hesitant to read these, fearing they might not be as good. While I will always reserve a deep connection and love, of the Sweep series especially, it having been essential to influencing me as I grew from a teenage boy, into a young adult, I thoroughly enjoyed the mystery set forth and subsequently revealed in Immortal Beloved. I still maintain Sweep as her all time magnum opus, that said.MINOR SPOILERS (no specific plot reveals but read at your own discretion)I enjoyed the mysteries and their revelations thereafter. The sexualized tension between Nastasya and Reyn is palpable, yet odd. First cold, their relationship becomes uncertain, and even hostile, before turning to passion. Perhaps that is what makes her books so entertaining, that personal connectivity she interlaces between her characters.I do not wish to say anymore. for fear of spoiling things, but will say that if you enjoy fiction with a wiccan spin, with immortality and magick and neat flashbacks and uncertain mysteries, two seemingly unfit people falling in love, and a woman who becomes empowered by a force of magick deeply rooted to her lineage, you will enjoy this.In many ways this rings similar to Sweep. Girl meets boy. Girl and boy fall in love, boy being too hot for girl. Girl turning out to be a powerful being of magickal lineage. What seems to be coming is an ensuing struggle between light and darkness, good and evil, Nastasya and her past versus the new people of Rivers Edge and the positive future she hopes to endeavor upon with their help as she shuns the darkness pressing in upon her for centuries time. She must accept who she is, what she is, and fight for her right to be herself in the face of those who would use her power for ill means, those who she once considered best friends, but who themselves have strayed into a bleak black abyss of evil and darkness."}, {"userName": "Suzanne", "userReviewDate": "Dec 22, 2010", "userURL": "http://www.goodreads.com/user/show/1581374-suzanne", "userReview": "Gotta admit that I am a little perplexed at the high rating this novel has on GoodReads. Not that I think it's bad exactly--I was entertained enough to finish it), but it's fairly seriously flawed for the first book of a YA supernatural romance trilogy. Here's why I think so: Yes, there needs to be lots of exposition to start a series, but come on already & expedite the plot. MORE needs to happen, seriously. It's not until the last third of the book that magic, flashbacks, and making out get things frothy enough for teen readers in particular. Another problem: Nastasya might look 17ish, but she is over 400 years old. Her ennui and burn-out might not play as well with fresh young things, particularly when things take a turn for the Eat, Pray, Love turn and our heroine runs away from the immortal club scene fast lane for nowheresville, Massachusetts where a much old immortal woman named river invited her 80 years prior when the two met by chance. It's like rehab for immortals there--a commune, an ashram kind of joint where Nasty learns to give up booze and partying for chores and organic food that she must help prepare and clean up--and even a part-time minimum wage job. I'm not sure the SLOW pace of her awakening will hold the young'uns' attention. Now to give both the author and my teen reader friends the benefit of the doubt, I have read Tiernan's Sweep series, so maybe her readers expect and enjoy a more reflective twist of the supernat rom genre dial, but I was a might disappointed. I may still tune in for the second book, assuming it gets the bloody show on the road faster, more at the pace of the last segment of this one in which Nasty faces (and kisses) the raider of winter whose family was responsible for the death of her entire family centuries before and she faces a variety of menaces, from the mundane immortal who wants Reyn to her former best friend who is hunting for her vigorously and seems to need her dormant power, a power it appears she will come to learn to use more and more under the tuteluge of the instructors at River's Edge."}, {"userName": "Jacinda", "userReviewDate": "Dec 06, 2010", "userURL": "http://www.goodreads.com/user/show/3692307-jacinda", "userReview": "My review of Immortal Beloved on my blogThis is probably going to be a short review because I just loved the book without much of a reason as to why!Immortal Beloved is about Nastasya, an over 400 year old Immortal , which is just a regular human who is immortal, but can also perform magick. After 100 years of living the same crazy life she’s been living, she decides she needs change after her best friend creates dark magic that bothers her. She leaves England and ends up in Massachusetts were she meets Reyn(or Rain for those of us not skilled in pronunciation, haha) who she remembers from her past.I think I might actually be in love with Reyn, well not really, but I do love him as a book character! He’s described a billion different ways as being sexy and the strong and silent type, which is fine by me, haha.I’m also in love with Nastasya. She just witty and makes me laugh throughout the book, which I love. Nastasya strengthens emotionally(any physically) during the course of the novel and she ends up being such a strong person, the complete opposite of herself in the beginning. It would have to be rough living over 400 lifetimes and still learning things about yourself, who you are, and where you came from, but she pulls through it.I will be reading the second book in the trilogy, Everlasting Dark, when it comes out. I want more! I wish I didn’t have to wait! I’ve never read any other books by Cate Tiernan, such as the Sweep series, but I’m going to look into reading them sometimes soon since I enjoyed Immortal beloved."}], "description": "Nastasya has spent the last century living as a spoiled, drugged-out party girl. She feels nothing and cares for no one. But when she witnesses her best friend, a Dark Immortal, torture a human, she realizes something's got to change. She seeks refuge at a rehab for wayward immortals, where she meets the gorgeous, undeniably sexy Reyn, who seems inexplicably linked to her past.Nastasya finally begins to deal with life, and even feels safe--until the night she learns that someone wants her dead.", "title": "Immortal Beloved\n      \n          (Immortal Beloved #1)", "url": "https://www.goodreads.com/book/show/7823549.Immortal_Beloved__Immortal_Beloved___1_", "average": 4.1, "cover": "https://images.gr-assets.com/books/1341291825l/7823549.jpg", "reviews": 1366, "authors": [{"url": "https://www.goodreads.com/author/show/191456.Cate_Tiernan", "name": "Cate Tiernan"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/7823549-immortal-beloved", "http://www.goodreads.com/book/show/19713514-immortal-beloved", "http://www.goodreads.com/book/show/8961636-immortal-beloved", "http://www.goodreads.com/book/show/9397178-immortal-beloved", "http://www.goodreads.com/book/show/8406607-immortal-beloved", "http://www.goodreads.com/book/show/11731706-amor-inmortal", "http://www.goodreads.com/book/show/9816020-immortal-beloved", "http://www.goodreads.com/book/show/675614.Book_of_Shadows", "http://www.goodreads.com/book/show/675615.The_Coven", "http://www.goodreads.com/book/show/775981.Blood_Witch", "http://www.goodreads.com/book/show/775977.Dark_Magick", "http://www.goodreads.com/book/show/775983.Awakening"]}