{"ratings": 12266, "userreviews": [{"userName": "Raya راية", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/23224678-raya", "userReview": "\"الوحوش غير موجودة. الأشباح والإنسان الذئب والساحرات جميعها خرافات لتخويف الأغبياء مثلك. ينبغي أن تخاف من العِبَاد لا من الوحوش.\"\n\nما إن بدأت بقراءة هذه الرواية حتى شعرت بأن فيها شيئًا يشبه السحر يشدّني إليها بقوة. فعدت بذاكرتي إلى تلك الأيام التي كنت فيها بسنّ ميكيلّي أميترانو وأصدقائه، طفلة تعدو وسط حقول القمح مع رفاقها الصغار، وكنّا ما إن ندخل الحقل الواسع، حتى تأتي الجدّة \"أم غازي\" فتركض خلفنا لتطردنا من حقلها! كم كنّا نخافها! فتتقطّع أنفاسنا من الجري هروبًا منها! واتذكر \"محمد\" ابن الجيران الذي كان أكبرنا سنًا والشهير بأنه \"كذّاب\" فيتفنّن بإخافتنا من قصص الأشباح والجنّيين! واتذكر حين ذهبت إلى محل الألعاب ورفضت أن اشتري \"باربي\" واشتريت كرة قدم لونها برتقالي، منتفخة على آخرها، صلبة وقاسية، ورائحتها بلاستيكية قوية، كنت أحتفظ بها داخل شبكتها حتى لا تُخدش أو تتلف! يا الله! كم كانت مخاوفنا عظيمة من وحوش اخترعها خيالنا، أشباح تحت السرير، وحوش الليل، الغولة، العجوز الشريرة، الحشرات العملاقة التي تسكن باطن الأرض...! كنًا نعتقد بأن الشر يتمثّل بهذه الكائنات فقط! كم كُنّا أبرياء!كهذا هم الأطفال! يرون العالم بعيون ملوّنة بريئة، لا يعرفون حقيقة أن الشر يمكن أن يختفي وراء وجوه بريئة باسمة، وجوه أشخاص قد نحبّهم وقد يعنون لنا كل العالم! يعجز خيالهم البريء عن فهم وإدراك وتصوّر \"الشر\". يقفون عاجزين عند اكتشاف أن الشخص الذي يعني لهم العالم ويحاول أن يعلّمهم وينصحهم بالسلوكات الجيّدة، يقترف أشنع الأفعال! كيف يمكنهم أن يفهموا دوافع تلك الأفعال! كيف يمكنهم أن يستوعبوا تناقض الإنسان! يا لشقاء الأطفال ويا لقسوة الإنسان!رواية بديعة، أشبه بسمفونية موسيقية جذّابة ومؤثّرة، تأسر حواسك، برقتها وقوّتها وعُمقها وبما تحمله من كل المعاني...."}, {"userName": "Lori", "userReviewDate": "Oct 21, 2009", "userURL": "http://www.goodreads.com/user/show/2211350-lori", "userReview": "I'm not sure how to describe this book. Is it a shattering of innocence, a coming of age story, a mystery, a suspense novel or is it all of these? I was drawn into the story immediately by the short terse prose, the descriptions of the countryside and the dialogue and actions of the young children in the story. Ammaniti, has captured with accuracy the actions and thoughts of a child who is caught in an adult situation. As the reader you are viewing the events from the eyes of nine year old Michelle and you feel the same confusion and detachment that he does when placed in a situation where an incredible event is occuring. As he learns more and sees more from the actions of his parents and the other adults around him be begins to understand what is really happening and can no longer remain detached. He can no longer remain neutral, he must act. The book moves along at a quick pace and ends in a nail biting climax. This was a good story with beautiful detail and a realistic portrayal of a nine year olds reactions and thoughts. I really enjoyed this book."}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "A real horror. Evil is committed in pursuit of the \"good\", the victims are innocent and young, their innocence lost in the most painful way possible, and the story ends without any expectation of redemption or happiness for anyone.And what a unique and brilliant narration! The author inhabits the mind of a nine-year-old boy and tells the story like a real nine-year-old. Reminded me of Esther Freud's \"Hideous Kinky\" but with really something extraordinary: it doesn't take Niccolo Ammaniti whole paragraphs to jolt his readers. He does it with just one or two short sentences, often when his fictive boy narrator makes a wrong perception of something (which at first seemed real). Then all that the boy has heard, felt and seen he ties them up in the end, like a bundle of hard wires, then hits you with it in the head leaving you dazed.Now thank me for not giving away the plot which, by itself, had it even been badly presented, would have netted five stars from me."}, {"userName": "Sarah saied", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/29240052-sarah-saied", "userReview": "جميل هو عالمنا القاسي المخادع..حينما ننظر إليه بعيون طفل..ربما هذا ما نحتاجه حقا كي لا نفقد الشغف بهذه الحياة...سنجد حتما ما يستحق الحياة لأجله...كأنها حكاية متصلة برواية آخذك وأحملك بعيدا..هو نفس ذلك العالم الذي يرويه لنا آمانيتي في حكايته..الحياة من منظور طفل صغير...بكل ما تحمله روحه من براءة ساذجة وتوق الي المغامرة.."}, {"userName": "Traveller", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/3145526-traveller", "userReview": "A poignant coming of age story about the loss of innocence of a rural Italian boy. The tale is told with enough balance as to be emotionally and intellectually engaging without being overly sentimental.The style comes across as so effortless and the plot is so well handled, that one almost feels as if this could very well really have happened, which makes the chilling and ironic conclusion feel even more shocking and resonant...and since truth is stranger than fiction, who knows, perhaps it did happen; and in a certain sense, it did. The novel is apparently partly based on real-life historical events that took place in 1970's Italy.Although the events that take place is the stuff of crime fiction and thrillers, it's given a fresh 'take' by being told from the point-of-view of the young protagonist who finds himself initially 'outside' the events that eventually rob him of his innocence and introduce him into the harsh world of adult reality.What makes it really stand out from your general run-of-the-mill thriller though, is the insight that Mr Ammaniti shows into the psychology and souls of the characters he brings to life in this deftly-told novel.Ammaniti poignantly brings to life the mind of an innocent child through the protagonist's initial interpretations of events; and it is a stomach-churning and heart-wrenching process to travel with young Michele into the realization of what is actually going on."}, {"userName": "Diane S ☔", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Set during the heat wave in the summer of 1978, in rural Italy nine year old Michele and his friends pretty much have the countryside to themselves. The parents stay in and try to alleviate the heat in whatever ways they can. Michele is only concerned about today, like most children and does not yet think about the wider picture, world events or other things that have affected his town. His only concern is having to drag his little sister everywhere, his friend Salvatore and the unelected leader of the group who can be very cruel. Yet one day, an top of a hill and in a old house everything for Michele will change in an instant.Almost from the beginning, I felt a palpable tension in this book, the heat, the barren countryside and the short sentences all added to this feeling. I found this to be a gripping read of lost innocence as what Michele finds causes him to mistrust those he previously trusted the most, even his own father. By the ending things have happened that cannot be undone and I was left thinking, what a heavy price there was to pay for trying to do the right thing. I was so proud of this little boy for going the extra mile for what he thought was right. Rather short novel but awfully though provoking."}, {"userName": "Debbie", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "Despite its title, I’m scared and so is Michele, the 9-year-old narrator of this suspenseful story. It’s fast paced and wild, and you can’t help but be pulled in immediately and with full heart and soul.Ammaniti knows how to create a grim story that has a loveable, heroic boy at its center. And he knows how to keep you sitting on the edge of your seat. The book is scary, but addictive. It reads like a nightmarish fairytale. There’s good versus evil all over the place. There’s one small good guy against a slew of big bad guys. And Michele is constantly being exposed to terrifying situations. For example, I died (along with Michele) when his mother insisted that a scary and gross old man would be sharing Michele’s tiny bedroom.Michele stumbles upon a criminal secret and then spends his time frantically trying to help right the wrong. There is much urgent bike riding as he crashes through the wheat fields in the sweltering heat in Italy. We’re routing for him the whole way, but we share his fear that things could get uglier at any second. And they do, repeatedly. Michele is scared, but he’s also brave and determined to make things right, hindered again and again by the evil adults who hold the power.Michele’s innocence, combined with the impact of the horrific discovery, affect his perception of reality. He begins questioning everyone’s motives and the basic goodness of people. In a minor scene, when he sees his friend dunking her dog in a disgustingly murky pond, he thinks she is killing him. Michele rescues the dog, and the girl insists she was just trying to wash off ticks. Always the helper, Michele then proceeds to remove the ticks. (Ammaniti gives us the gross and graphic details; and we keep watching, the same way we keep watching a car accident.) But was she really trying to kill the dog, or was Michele just being paranoid? Did he save the dog’s life, or was he merely a friend who helped remove some ticks? Ammaniti is a genius at setting up such ambiguous realities.I have four complaints. First, I didn’t think this book was quite as tight as “Me and You,” but that’s only because I’m not a fan of scenery (and I know many people will argue that describing the setting was necessary in order to create the right atmosphere). Second, the translation was poor in the first half of the book. In several cases, the translator used the Italian word instead of the English equivalent—it seemed more a sign of laziness than lack of skill, since some words seemed like they would be easy to translate. Third, even though the ending was clever and dramatic, I thought it was too abrupt. I would have liked more closure. Fourth, I had trouble buying the fact that there was a whole slew of bad guys—including people you would expect to be good guys. I’m just not sure that worked.I give it a 4.6--I knocked off a tenth of a point for each of my four complaints. It’s darker than “Me and You,” but that didn’t stop me from loving it. Wait till you learn about “wash bears.” I hope more people discover this author; he’s a gem."}, {"userName": "Gabyal", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/36232063-gabyal", "userReview": "No estoy segura de cómo describir este libro y lo que me hizo sentir. ¿Es una ruptura de la inocencia, una historia de madurez, un misterio, una novela de suspense o es todo esto? La prosa es simple y breve, las descripciones del campo, el diálogo y las acciones de los niños en la historia me atraparon de inmediato. El autor, ha capturado con precisión las acciones y los pensamientos de un niño atrapado en una situación adulta. Como lector, lógico vi los los eventos desde la mirada de Michele, un pequeño de nueve años, y me hizo sentir la misma confusión y desapego que se siente cuando uno se encuentra en una situación en la que ocurre un evento increíble. A medida transcurre la historia y ve más de las acciones de sus padres y de los otros adultos a su alrededor, comienza a comprender lo que realmente está sucediendo y ya no puede permanecer distante ni indiferente. Ya no puede permanecer neutral, debe actuar y lo hace. El libro avanza a un ritmo rápido y termina en un punto culminante de morderse las uñas. Esta fue una buena historia con hermosos detalles y una representación realista de las reacciones y pensamientos de un niño de nueve años, en donde descubre que los monstruos existen y tienen forma humana. Tren de primavera Cafeteria de Audrey"}, {"userName": "طاهر الزهراني", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/2787742", "userReview": "ذات يوم من أيام الصيف مر \"أمانيتي\" بسيارته على حقول القمح بين بازليكاتا وبوليا ولاحظ صعوبة العيش بالنسبة للأطفال في تلك الحقول فكانت الرواية... في بداية الرواية تحضر الحقول الصفراء، الحقول الصفراء الشاسعة الممتدة، فيكرس الكاتب هذا اللون في مشاهد البداية، الشمس، السنابل، القمح، الطفولة المتعبة، العرق، التحول من مرحلة إلى أخرى من وعي إلى آخر، من إخضرار يانع بريء إلى صفار مريب متردد، من بياض مسالم إلى سواد متوحش، من شر مختلق في قصص الأطفال، إلى آخر قريب من أناس لم نتوقع أن يصدر منهم ما يسوء.لهذا كان اللون الأصفر له دلالته الموظفة في النص. ..وكمعزوفة لا يمل منها \"أمانيتي\"' يجلس وحيدا منزو يشد ضفائر الثنائيات كعادته في أعماله، البراءة، التوحش، الطفولة، الكبر، النوايا الحسنة، والخبث، الانحياز للخير، الانغماس في الوحل..ثم ماذا يحضر، يحضر الصيف الملعون عام 1978 ليصهر كل هذا في لوحة يجيد أمانيتي إبهارنا بها، وهكذا بأسلوبه المدهشة، ولغته السلسة، وصوره التي ينجح في نقشها في الذاكرة، يجعلنا الكاتب نضع الرواية جانبا بعد كل فصل لنأخذ جولة لنستوعب الحدث الصعب، والمأزق الذي لانعلم كيف سيكون فرجه.ولكن بحيوية الأطفال يمسكنا أمانيتي ليدلنا على الحقول، فنقطع المساحة الصفراء دون خوف سياط الشمس الحارقة، لنتسكع خلفه دون خوف الوحشة، والجفاف، والعطش، ليقول دعوا الثقلاء في البيت، دعوهم للساعة السادسة مساء، هناك حدث يستحق أن نخرج في هذه الظهيرة من أجله، فالحقيقة هناك في حفرة صنعها الكبار الأشرار.الطفولة ستنحاز للخير، ولن تسلم من الضرر والمآسي في هذا العالم الذي يدع قوى الشر تفعل ما تريد.إنه صيف عام 1978 الصيف الذي ولدت فيه، يجعله \"أمانيتي\" فرناً للطين الذي خلقه، ليبقى رنانا صلدا بين أيدينا بعد ذلك.إن هذا الإبداع واقعي وقح، مبهر، نزق، مدهش، جارح،نقله لنا المترجم أحمد الصمعي مراعيا أجواء الطفولة بعيدا عن الابتذال كما يقول، مما جعلنا نفتقر لتلك الأجواء التي حضرها لنا معاوية عبدالمجيد بكل أمانة وفن في رائعة أمانيتي \"أخذك وأحملك بعيدا\"...أخيرا سنبقى ننتظر ترجمات أعمال هذا الكاتب المدهش كأعياد لا مواعيد لها."}, {"userName": "notgettingenough ", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/2658311-notgettingenough", "userReview": "Well, he may not be scared but call me utterly terrifed. I find it hard to believe the book could be better or even equal to the film which I've seen twice and I wasn't any less scared the second time.I must confess that I've done no more than flick through the book and check the odd scene here and there. Sorry, book, but the visual spectacle of the film simply outdoes in spades anything you can do in words. The first thing I wanted to do when I saw this film was give it to my father. It was a story of what his life would have been like if my grandfather hadn't made the decision to leave Calabria for something better - Australia, as it happened. Since my father bitterly resents his childhood, I thought it might do him good to see how bad it might have been.But I couldn't make myself do this. I was plain scared of how terrified he would be. I was scared of the demons it would awaken inside him.See the movie if you can, it's brilliant. And don't be put off by my terror. It is also sweet and gentle, and a lovely reflection on childhood."}, {"userName": "Beatrice", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/18677437-beatrice", "userReview": "I read this book for my Italian class. Reading in another language, especially it being my first time reading a full-length novel in Italian in this case, was a really rewarding experience and it allowed me to experience one of my favorite activities in a completely different way. I read this with a pencil in hand and circled all of the words I didn't understand (there were quite a few). I hope to do this again in the near future, with Italian and other languages, because I really enjoyed the challenge. The book itself was quite wonderful, riddled with aspects of magical realism, though quite a few questions, it seemed to me, were left unanswered. By the end I was both shocked and confused, leaving me with mixed feelings that I hope to clear up by watching the movie adaptation."}, {"userName": "Snow", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/31719636-snow", "userReview": "Sizzling story of a childhood and the horrid events that changed the aspects of the growing up process in one boy's eyes!Great story telling..."}, {"userName": "Vonia", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "My second book from Nicolo Ammanati. The first was \"Me and You\". \"I'm Not Scared\" was able to rectify my complaints about the first (lack of believability, focus on only one character's development, rushed story and rash examinations of important issues), but things I was impressed by in \"Me and You\" fell by the wayside here (insightful emotional examination, keeping the reader's interest, no unnecessary scenes). \"Spine-tingling\"? I hate to say this (because I love his writings, I really do, but neither of the books I have read by him have all the components necessary for that really good book), but not so much. I lost interest a few different times. I feel like the suspense waned as the book continued, with not much explanation for different events, except that Michele was unable to learn everything from the secretive adults. Believability? That a group of men in a small town, one of which is our narrator's father, together manage to kidnap a nine year old boy for ransom? Yes, likely it has happened before. That they are all mostly good people? Certainly. That the wives are mostly in on it and if not condoning, have accepted it? Maybe not so much, but given the time period, yes. And it is the extremely rare but very possible events that make the best fiction. After all, real life has the best stories. One could never make some of that stuff up. The book was good, but not great. Pacing issues, character depth focused almost entirely on the narrator (understandable, as it is not an omniscient voice, but makes the important point that this particular story may have been better served if it were), and, most importantly, anticlimactic. I was very upset with the ending. The vagueness of it, the ridiculousness. It left me feeling cheated."}, {"userName": "Trupti Dorge", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1656694-trupti-dorge", "userReview": "This is one of the best thrillers I have read this year. This book is translated from the Italian version. The suspense in this book was not overpowering. It’s not one of those fast pace modern day thrillers. It opens in a small isolated Italian town where a 10 year old boy discovers a secret in an abandoned farmhouse. He struggles to keep it a secret and to make sense out of what he has discovered. The descriptions of the prairie and the region are so wonderful that I could actually imagine being there. I could actually feel the oppressive heat and the sensation of being stuck in a place where nothing ever happens. The end is really sad. I urge you to read this. This is one of the very few books where you actually feel the fear of the little boy, the kind of fear that reaches deep down into your bones and grips you. For people who love good thrillers with good writing, this book is for you. I cannot recommend it enough. F.A.N.T.A.S.T.I.C."}, {"userName": "Nahed.E", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/37363150-nahed-e", "userReview": "القراءة الأولي لـ نيكولو أمانيتي ..ولا أدري لماذا بدأت معك بهذه الرواية ، بعد أن كان مقرراً لي أن ابدا معك بروايتك الأشهر : أخذك وأحملك بعيداً في البداية جذبتني الرواية للغاية .. فحين تري الدنيا والأحداث وتفسر المواقف بعيون وعقل طفل في التاسعة من العمر تري الأمر حقا بعيون جديدة بعيدة عن عمرك ونظرتك للأمور ..توقعت أن اراها معه بعيون مختلفة تجذبني أكثر وأكثر للرواية .. أن أراها من خلال نظارة ملونة أو علي الأقل عدسة ملونة وعدسة سوداء ..ولكن أن تكون النظارة كلها سوداء قاتمة بهذه الطريقة .. ؟؟هذا ما لم أتوقعه ولا أريده أيضاً !!خاصة حين تكون الأفكار كلها سوداء بهذا الشكل !!!وللأسف هي ليست سوداء فقط .. هي مقززة أيضاً .. !!نيكولو أمانيتي .. تجربتي الأولي معك ليست جيدة علي الإطلاق .. أتمني أن تكون التجربة الثانية معك مختلفة ..أتمني .. !!"}, {"userName": "·Karen·", "userReviewDate": "Sep 04, 2010", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Perfect for the learner, as this is written from a child's viewpoint which means the language is not too precious or over literary and you get to learn some of the earthy expletives (but not the truly disgusting ones) that barely figure in polite beginners' books. On top of that, it is extremely exciting, so tense that you are forced to push on to find out what happens. After the first couple of chapters I blithely ignored all that precious vocabulary that I didn't know and really ought to look up, in order to discover what happens to the little boy that Michele finds hidden in a kind of cave. What is the mysterious connection with his own family? And is the whole village in the know?"}, {"userName": "Melisa Müller", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/40739494-melisa-m-ller", "userReview": "Reseña completa: http://perdidaentrepaginasymas.blogsp...La verdad es que si no fuera porque el libro ganó por votación en el club de lectura probablemente fuera un libro que nunca leería. No me llamaban ni la sinopsis ni la portada. El libro es sumamente corto y la lectura bastante amena te lo lees en muy poco tiempo. Esta narrado desde el punto de vista de Michele y esto es interesante ya que uno puede ver el trasfondo de todo lo que pasa como un adulto mientras que Michele no se da cuenta de la mayoría de las cosas por su inocencia.El final es muy duro. Y también me pareció algo flojo, es de esos finales que dejan a la interpretación del lector y creo yo que no hubiese estado de más un par de paginas mas para dejarlo aclarado y bien cerrado."}, {"userName": "Tracey Allen at Carpe Librum", "userReviewDate": "Feb 16, 2011", "userURL": "http://www.goodreads.com/user/show/4986986-tracey-allen-at-carpe-librum", "userReview": "I'd been looking forward to reading this book for quite a while. Knowing it was about a young child who discovers a boy being kept hostage/prisoner in a hole and and what unfolds next was enough to significantly grab my attention.Reading it however was a completely different experience and a major disappointment. Set in Italy, the translation from Italian to English is extremely noticeable and often interrupts the natural flow of the descriptive sections of the novel. The setting and location felt isolated to me and not well developed. The discovery of the kidnapped boy in the beginning of the book was the most exciting part, and then it was all down hill from there.The middle of the book was frustrating as I struggled with the direction the 9 year old boy was taking with his new found knowledge. There was a slight surprise in the circumstances surrounding the kidnapping which I thought was building to an exciting big 'reveal' at the end which unfortunately didn't happen. The ending was very predictable and reminiscent of 'The Boy in the Striped Pajamas', although I'm happy to report that it appears this novel was published first.In fact the ending was so lacking an explanation for the kidnapping that I thought I must be missing a page or two. Perhaps it had fallen out of the library book. This idea kept me going for a few minutes, and led me to the ever faithful Amazon and Google.I guess you could say this is proof of a terrible ending and a great disappointment. The ending went beyond ambiguous to just plain lacking.This was a terrible read, and I wouldn't recommend this book to anyone."}, {"userName": "Knjigomanijak", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/16730144-knjigomanijak", "userReview": "Svaki puta kada uzmem knjigu od Niccola Ammanitia u ruke, budem doslovno iznenađena nenadmašnom snagom njegovog pisanja. Ni jedna njegova knjiga me nije ostavila ravnodušnom, pa tako ni ova. Uvijek mi se sviđaju njegovi likovi koje on vješto opisuje . Od onih negativnih( kojih u ovoj knjizi ima podosta), pa do pozitivaca koji izgledaju kao da se ne mogu sasvim uklopiti u surovi svijet oko sebe.Mene osobno najviše pogađa zlostavljanje i otmica djece, a ovdje se upravo o tome i radi.U malenom talijanskom , naizgled mirnom selu, jedan dječak igrajući se s ostalim drušvom otkriva jednu stravičnu tajnu koja ga progoni čak i u snovima. Naime, nedaleko od sela u kojem živi naići će kraj jedne osamljene i napuštene kuće jamu u kojoj se nalazi dječak njegovih godina. Tko ga je oteo? Zbog čega je tamo i kako će se priča završiti ne bih vam govorila. Mogu samo reći da je roman pisan izuzetno lako za čitanje, te da je napet, kako od početka, tako do samog kraja.Pisan kao viđenje 9-godišnjeg dječaka, te njegove nedoumice i odluke koje mora donijeti, a teško se snosi s njima ,jer je samo jedan maleni dječak kojemu je ukradeno djetinjstvo na brutalan način, čini ovu knjigu malim remek djelom. Barem za mene.  Ako volite napete priče, ovo je upravo jedna za vas!"}, {"userName": "Anne", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/17465866-anne", "userReview": "Feel the heat. A blazing summer in the small poverty-stricken village in southern Italy where the action takes place is so well evoked you almost sweat. Told in the voice of a 9 year-old boy, it’s a vivid portrayal of childhood combined with a deeply disturbing discovery of what it means to be adult. This is gripping and unforgettable storytelling with a convincing juvenile narrator."}, {"userName": "Elizabeth A", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/3123067-elizabeth-a", "userReview": "“Stop all this talk about monsters, Michele. Monsters don’t exist. It’s men you should be afraid of, not monsters.”This coming of age story is translated from the Italian by Jonathan Hunt. A bunch of kids are out riding their bikes in a tiny village in Southern Italy. On a dare one of them enters an abandoned farmhouse and stumbles upon something horrible. The protagonist of this story is a nine year old boy, and themes explored include the loss of childhood innocence, and the confusion of trying to make sense of the adult world. I really liked the setting, and the sense of place in this story. Much of the confusion for the reader makes a certain amount of sense as we only know what the nine year old knows - though there are some things we, the adult reader, understand that he does not. While I liked it, it didn't get a higher rating because I wasn't really sucked into the story and things seemed to happen at an emotional distance, though maybe that's because the character is only nine. The buildup is slow which made the rushed ending seem out of place. I for one did like that final scene, a tad predictable yes, but it was good nonetheless."}, {"userName": "Laura", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/38856944-laura", "userReview": "No leí ni la sinopsis de este libro y es lo mejor que pude hacer. Me ha sorprendido bastante. No me esperaba para nada todo lo que ha pasado.Se lee muy rápido, sobre todo a partir del primer tercio, porque quieres seguir leyendo para saber qué narices está pasando.Y el final me ha tenido con el corazón en un puño. No me gustan los finales abiertos, pero este me ha emocionado."}, {"userName": "نورة  العجمي ", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/16571051", "userReview": "-لا أسمح لنفسي أن أقرأ أو أشاهد عن كل ماله علاقة بالطفل ، الطفولة ليست مجال متعة .ماحصل هنا كان سوء فهم حيث أنه في البداية ظننت أنها مسألة صفحات وسيكبرون مالم أتجاوز الفصل الثاني على أقل تقدير ، كبر الخوف بداخلي ولم يكبر الأطفال ."}, {"userName": "Nicole", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/2994959-nicole", "userReview": "Spaventoso. Non c'è altra parola per descrivere il romanzo di Niccolò Ammaniti. Io non ho paura afferma il titolo, ma non è vero. Il protagonista è impaurito e lo siamo anche noi.Il romanzo si svolge durante gli anni di piombo. Il narratore Michele è un bambino di nove anni che vive con la sua famiglia nel mezzogiorno d'Italia in un piccolo paese chiamato Acqua Traverse. Ma è un nome ironico perché c'è solo una cisterna e non ha piovuto per tutta l'estate. È l'estate più calda del secolo e gli adulti si chiudono in casa. Solo Michele e i suoi amici hanno il coraggio di giocare fuori nelle strade e avventurarsi con le loro biciclette nei campi di grano dorati. Il calore è soffocante e tutti hanno i nervi a fior di pelle.È in questa atmosfera che Michele scopre un terribile segreto. Un crimine terrificante. Un ragazzino tenuto prigioniero in un buco. Michele non sa cosa fare. Ben presto scopre che niente è quello che sembra. Che cosa puoi fare quando non puoi più fidarti di quelli che ami? Quando il mondo della tua infanzia viene trasformato in un istante in un incubo?Il racconto mi ha tenuto col fiato sospeso. Ammaniti descrive perfettamente il pensiero di un ragazzino che ha una immaginazione vivace e quindi non prende decisioni come un adulto. Ma Michele ha un buon cuore e, essendo solo un ragazzino, la sua situazione sembra più pericolosa. Mi è piaciuto molto il romanzo e l'adattamento cinematografico. Entrambi sono pieni di suspense e colpi di scena. Mentre leggevo mi chiedevo cosa avrei fatto se fossi stata Michele. Sicuramente io avrei avuto paura."}, {"userName": "Malak Czar", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/17623734-malak-czar", "userReview": "حين أكون في مزاج سيء أهرب الى السحر الايطالي فأي شيء يأتي من هناك جميل وروحي تواقة اليه ، اخترت هذه الرواية عن سبق اصرار لمعرفتي بأسلوب الكاتب اللين الجذاب ليكون اللقاء الثاني الذي يجمعني به بعد رائعته آخذك وآحملك بعيدا .. يروقني جدا هذا النوع من الروايات... أحب هذا المزيج من الاثنين المغامرة والإثارة مع مخاوف وشغب الطفولة ،أحب التشويق..بطل هذه الرواية طقل في التاسعة من عمره يكتشف سر والده والذي سيكون سببا في مغادرته عالم الطفولة مبكرا واصطدامه بالمجتمع الوحشي الذي يعيشه الكبار. على الرغم من أنها مترجمة الا أنني عشت بالجو الايطالي الصيفي في الريف وكان يمكنني أن أتصور حقول القمح و صيحات الشخصيات فيها بأصواتهم ، لأن أمانيتي يعرف كيف يمكن إنشاء مشهد بكلمات قليلة جدا وبدقة وصف مدهشة.سأشاهد الفيلم لتكتمل متعتي بالقصة ....أحمد الصمعي ترجمته متقنة وواضح جدا شغفه باللغة."}, {"userName": "Andy Weston", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/313206-andy-weston", "userReview": "Ammaniti chooses a 9 year old boy as narrator and hero of his story of a ‘kidnapping gone wrong’ in a rural part of southern Italy in a hot summer of the late 1970s.  We could do whatever we liked. No cars ever went by. There were no dangers. And the grown-ups stayed shut up indoors, like toads waiting for the heat to die down.  Of great appeal is what goes on in the mind of a boy of that age. It is story of innocence lost, as he is just beginning to sort out right from wrong, and real fears from imagined ones, monsters from pigs, dogs from the  lords of the hill . His father tells him,  it’s men you should be afraid of, not monsters. , but the adults play distant roles, it is a story about childhood, written for adults. Until the last page it is an exciting and unpredictable thriller. It’s not easy for the reader to anticipate the actions of a 9 year old, and that is a reason why it works so well. I especially enjoyed the dramatic and eloquent descriptions of the rural setting, and it’s contribution to the aura and mood that is created.  We were cycling, all of us, just like the first time, towards the hill. We rode rode in single file. Only my sister was missing. The atmosphere was close and the sky was an unnatural scarlet colour. The clouds, previously massed on the horizon, were now gathered above us and jostling each other like hordes of Huns before a battle. They were large and somber. The sun was opaque and turbid as if a filter was screening it. The air was neither hot nor cold, but it was windy. At the sides of the road and on the fields the hay was packed up in bales, which were arranged like pawns on a chessboard. Where the combine harvester hadn’t passed, long waves formed, ruffling the wheat. Those shouts were like the spitting of green lizards. Green lizards, when they can’t get away and you’re about to catch them, open their mouths, swell up and spit and try to scare you because they’re more scared of you."}, {"userName": "Arwa Saraireh", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/33471329-arwa-saraireh", "userReview": "طفلان في نفس العمر، أحدهم مخطوف، أوحى لهُ خاطِفوه بأنه ميت و هو الآن مدفون، أو ربما هكذا فهم هو من تلقاء نفسه، المهم أنه هو على يقين تام بموته و موت كل من لهم صله به ، يردد كلاماً غريباً بصوره أليه ، تستشف منها أنه تم تلقينه بشكل جيد، درجة الانصياع لديه عاليه جداً؛ فلمجرد عصب عينيه و وضعه في حفرة مُظلمة أقتنع بأنه مدفون و فوق ذلك ضرير.الطفل الثاني دائم التفكير و التحليل فيما حوله، غريزة البحث و الاكتشاف لديه قوية مما دفعه لدخول حفرة في مكان مهجور و متهالك ليجد طفل مخطوف، يتعرف عليه و تنشأ بينهم صداقه، و يحاول بطفولته البريئة تبديد كل ما يعتقده ذلك الطفل المخطوف و يُردده كالببغاء بلا أدنى تفكير.هي مواجهة بين الانصياع للآخر و الرضا بما يُفرض و اعتباره الواقع الذي يجب التكيف و الإستكانة و الخضوع للظروف و بين البحث و السؤال، ربط الأحداث فيما حولنا و تحليلها و الاستنتاج، التحرر من ربط القدرة على حل المشاكل بالعمر و المال، التشبث بالأمل ولو بقيت وحيداً، مواجهة يتنصر فيها الطفل المُغامر للطفل المخطوف و يخسر أباه، أحد الخاطفين."}, {"userName": "Calzean", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/26416859-calzean", "userReview": "Nine-year-old Michele is the narrator. He lives in Southern Italy in a small settlement of four houses surrounded by farmland. He has a small circle of friends, his family is poor but he and his sister live in a loving home.Michele stumbles upon a boy of his own age who has been kidnapped. What follows is Michele coming to grips with a boy being kept in a hole. Somehow there is an apparent normality as the entire settlement seems to be involved. Written in the first person and narrated by a nine year old, the language is simple and Michele's thinking quite believable for his age and his knowledge of the world. There was tension in the storyline, loyalty towards friends and family tested and a fitting climax to be a well told story."}, {"userName": "Tarek Wisdom", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/29908654-tarek-wisdom", "userReview": "عادية جدا ... قصة قد تصور بشاعة النفس الإنسانية وبراءة الأطفال وصفاء روحهم، ولكن ككل القصة جد عاديةاستمعت إليها من خلال الرابط التاليhttps://goo.gl/qZrnHG"}, {"userName": "MJ Nicholls", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "A small-town kidnapping tale, told from the POV of an ickle boy. What vexes me about narrators close to the child's perspective is that the narrator is usually a grown-up narrating their childhood from twenty or so years on. The same is true here: the grown-up Michele is narrating his childhood twenty-odd years later. My question: why would a grown-up write his story with such a close childhood POV unless he was a writer who had consciously taken that decision to sustain such a narrative position and style? Answer me that, Consuelo!Regardless, this reads basically like a film script: extremely fast action, a new paragraph break every sentence, picturesque Italian scenery, manipulative child-beating. Someone ought to make a film version. Oh wait . . . they . . . they . . . they'd have to pay the writer. Never mind then."}], "description": "A sweltering heat wave hits a tiny village in southern Italy, sending the adults to seek shelter, while their children bicycle freely throughout the countryside, playing games and getting into trouble. On a dare, nine-year-old Michele Amitrano enters an old, abandoned farmhouse, where he stumbles upon a secret so terrible that he can't tell anybody. As the truth emerges, Michele learns that the horror in the creepy old house is closer to home than he ever imagined.", "title": "I'm Not Scared", "url": "http://www.goodreads.com/book/show/1197776.I_m_Not_Scared", "average": 3.8, "cover": "https://images.gr-assets.com/books/1181807532l/1197776.jpg", "reviews": 874, "authors": [{"url": "https://www.goodreads.com/author/show/243571.Niccol_Ammaniti", "name": "Niccolò Ammaniti"}], "type": ["Fiction", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/1197776.I_m_Not_Scared", "http://www.goodreads.com/book/show/14741009", "http://www.goodreads.com/book/show/110428.I_m_Not_Scared", "http://www.goodreads.com/book/show/3096744-no-tengo-miedo", "http://www.goodreads.com/book/show/151633.Io_non_ho_paura", "http://www.goodreads.com/book/show/3290487-io-non-ho-paura", "http://www.goodreads.com/book/show/13485601-no-tengo-miedo", "http://www.goodreads.com/book/show/883718.I_m_Not_Scared", "http://www.goodreads.com/book/show/432417.I_ll_Steal_You_Away", "http://www.goodreads.com/book/show/12992945-me-and-you", "http://www.goodreads.com/book/show/6341275-as-god-commands", "http://www.goodreads.com/book/show/7062441-che-la-festa-cominci", "http://www.goodreads.com/book/show/2816931-fango", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}