{"ratings": 318, "userreviews": [{"userName": "John", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/56438628-john", "userReview": "3.5 Stars"}, {"userName": "Stacey Voss", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/2193244-stacey-voss", "userReview": "I started to read this book, but really couldn't finish it. I wanted to like it. I like zombie fic and the premise of having a pre-historic zombie melt out of a glacier was original. I also thought the cover was good.At first I thought the cheesy writing was because it was aimed at a MG audience, but the swearing quickly showed that this was supposed to be an adult novel.My main issues were that the story was rushed and the character development was irregular. I didn't need to know a lot about characters that were going to die within the next page, but I did want to get to know characters that were going to be with us for awhile. I felt like characters were behaving in ways that weren't consistent and I actually found myself reading bits to my daughter who is a zombie fanatic. I really, really wanted to like this book. I just didn't. I think the premise was good, but there was no follow-through."}, {"userName": "Holden Attradies", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/5973016-holden-attradies", "userReview": "I picked this up because I adore zombie lit and I adore Alaska, where I live. I had been warned by, oh just about everyone, that this was a pretty sub-par book and that it was full of typos. Was it? Yeah, it was. But in spite of all it's flaws I ended up enjoying it far more than I thought I would. I think this primarily came from the fact I was so easily able to visually where the events of the book take place, being I have physically stood in pretty much all the specific locations mentioned in the book. I think if I had not lived in Anchorage I would have detested it and probably not finished it. It has a slow, weird start. The ending is a real let down (although maybe just leaving it open for a sequel). The middle was pretty engaging though, but again I doubt it would have been had I not been familiar with the locations where it was happening."}, {"userName": "Felicia A", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/1739957-felicia-a", "userReview": "YAYYYYYYYYYYYYYY! Another editing project is now a published book! More zombie goodnessssssssssssssssss. And don't forget to watch for the sequel, Containment, out later this year."}, {"userName": "Jennifer", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/4047391-jennifer", "userReview": "Small children vacationing in Alaska find caveman coming out of a glacial ice-block. One gets bitten and that's pretty much it for Alaska. Kid rapidly infects the hospital staff and patients and you soon have a fast-running zombie horde. A store clerk, businessman, two kids, cop, doctor and a couple of others are on the run in two separate groups that eventually converge. No real ending to this one. Eh. The writing was a little stiff, self-conscious. Characters were not especially engaging and we didn't feel a lot for them. I think the author tried to make them personable but they just didn't have the depth. Zombie action was fairly standard - nothing exceptional, nothing really bad. Kind of how I feel about the whole book. I read it with interest, being a zombie afficionado, and was entertained, but didn't feel there was much new ground in this one. Try Craig DiLouie's book by the same title, instead."}, {"userName": "Rosann", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/5819763-rosann", "userReview": "I actually liked this book. It was very fast paced and the author kept it ( imo) realistic. Even though the zombie \"infection\" in the book happened current day ( as described in several parts of the book) some of the characters have seen zombie movies so they are not completely blind or dumb.Other part in book that I like was that the characters in the book didnt automatcially \"know\" to shoot zombie in the head. Mistakes were made (deadly) mistakes that cost lives because of it.. but gradually throughout the book the characters were realizing that like the movie the zombies did have to be targeted in the head for them not to get back up. Anyway ..so thats my thoughts"}, {"userName": "Darren Dilnott", "userReviewDate": "Mar 23, 2014", "userURL": "http://www.goodreads.com/user/show/24963189-darren-dilnott", "userReview": "No word has been conceived yet to aptly describe how damn amazing this book was. It literally blew me away. Incredibly, deep characterization, with realistic reactions and fears. No gun toting heroes here.Just terror, brutality, and utter dread.It is a ZA book which begins with the outbreak, which i enjoy more, and quickly descends into hell on earth. Sean puts you in his world and you feel the fear, and the hopelessness.By far one of the best books i've ever read."}, {"userName": "Taksya", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/28722085-taksya", "userReview": "Escludendo l'ambientazione non c'è niente di nuovo sul fronte apocalittico zombiforme.Tanti personaggi introdotti, molti eliminati dopo poche pagine o dimenticati del tutto. Pochi quelli che seguiamo fino alla fine, un insieme di cliché che colpiscono poco e riescono pure ad infastidire.Da quel che ho letto in giro, la descrizione dell'ambientazione è perfetta ma, se non si conosce Anchorage, si perde metà del divertimento. Non un punto a sfavore ma, per i non locali, neppure positivo.L'epidemia in sé parte bene. Originale che il paziente zero sia un cadavere appena scongelatosi da un ghiacciaio... ma la velocità con cui il contagio si trasmette è troppo veloce e, a seconda delle necessità di trama, troppo variabile.Non mi è piaciuto che uno dei primi personaggi introdotti, un adolescente in piena crisi ormonale, sia stato abbandonato al suo destino (e con uno zombie mezzo scongelato su cui nutre sentimenti di vendetta), soprattutto considerando le possibili ripercussioni.In circa 24 ore, non si riesce a seguire lo scorrere del tempo, la città di Anchorage è zombificata... e non una volta qualcuno (anche il narratore onniscente sarebbe andato bene) pensa a quello zombie mezzo scongelato, libero di fare altrettanti danni nel resto dello Stato.Il finale è un altro punto negativo.Quando, come sempre, per i protagonisti arriva il momento di lasciare il posto sicuro... l'epilogo ci avvisa che nel secondo episodio scopriremo cosa è accaduto.Se lo stile fosse stato meno approssimativo, se i personaggi fossero stati in grado di trasmettere qualcosa, se non si fosse trattato solo di uno scarso nuovo primo capitolo di una nuova saga, forse la curiosità di proseguire poteva essere in qualche modo stuzzicata.Ma, visto l'effetto globale dato dalla lettura, se Amazon non metterà il secondo capitolo in offerta a 0.00 euro dubito che proseguirò."}, {"userName": "Sarah Stanley", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/58225002-sarah-stanley", "userReview": "Not a great book. But highly entertaining to read about a zombie apocalypse in your home town..."}, {"userName": "J.R.", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/7586367-j-r", "userReview": "This is one of the few books in the genre that place the outbreak in Alaska. For most people, when they hear Alaska they unconsciously think that it’s always snow and cold. True, there are places in Alaska where snow stays year round but for the most part the state has sun, rain and even times when snow doesn’t cover the ground. Keeping that in mind, Infection- Alaskan Undead Apocalypse follows the story of an eclectic group of survivors. We have children, doctors, officer workers and retail store managers to name a few.The novel starts out mild and lulls the reader into a sense of complacency with a family vacation to Alaska. There’s the Houser family, Alec the older brother, Martin the middle brother and Julie the sister along with mom and dad Houser, and Martin’s friend, Danny Mahoney, all together to spend a nice vacation getaway in the wilds of Alaska. Picture and experience the melancholy feeling of hearing birds chirping, seeing fish jumping in the stream and deer and elk grazing in yonder meadow.Then, as it must happen, the shit hits the fan when Martin, Danny and Jules find something that might have been encased inside a glacier but now is partially thawed out in the spring weather. This made me think back to the bodies that were shipped to Alaska following the Influenza outbreak in 1918.Martin is unlucky enough to be bitten by whatever it is facilitating a mad race to the hospital. Martin’s condition worsens until he dies. Or does he? He become reanimated and attacks people in the hospital spreading whatever he was exposed to around for all to share. Give the gift that keeps on giving. The outbreak spills out from the hospital and we’re introduced to Neil Spencer, an office worker in a building a short distance from the hospital. Neil is the kind of guy who shows up early at work to start the coffee and have those few precious moments alone before the rest of the staff shows up. This morning, he’s witness to the erupting chaos caused by Martin and his biting frenzy.Rescuing a fellow worker, Neil decides that retreat is the better part of valor for we all know that he who runs away lives to fight another day. Neil and Rachel, the rescued worker, head to Fred Meyer's to stock up and then head for a safe location if there truly is one. It’s at Fred’s that they run into Meghan, the store manager who upon hearing the shit storm that is happening outside, helps them stock up and then joins their merry little band of survivors along with Danny, Jules and Jerry who have escaped the horror of the hospital now turned charnel house.Thus that’s how Infection-Alaskan Undead Apocalypse continues. Unlike other works in this genre, there are no high-speed, highly trained soldiers that appear to save the day. It is utter chaos and well played by Sean Schubert.The reader is thrown into the overall helplessness of an outbreak caused by a small child. An outbreak that occurs in a facility that is relatively safe, a place one would go for help not horror. From there the story spins off into separate plots as groups of survivors attempt to get out of the city and seek refuge somewhere far away from the undead horde. One other nice twist is the authority figure that becomes mentally unstable. Kudos for that one as not everyone can handle that kind of stressful situation no matter how well trained they may be.Two minor issues and I do mean minor. There is a mention of Blackhawk gunships. OK I can see that. The reference is to the UH60 Blackhawk helicopter used by the military. Sure you can arm them with door guns making them armed troop transports but they don’t really fit into the category of gunship unless you’re referring to the BattleHawk which is a dedicated weapons platform.The other item is pulling back the hammer on the machine gun. In this context it’s a vehicle mounted heavy machine gun and they, unlike handguns, do not have a hammer to pull back. They have a charging handle on the side that chambers the first round in the linked belt. Again, these are minor issues I just wanted to bring them to the attention of the author so that they are aware of this. By no means do these issues detract from the overall reading enjoyment, it’s just me being anal about technical details regarding military equipment, vehicles and weapons.I found Infection-Alaskan Undead Apocalypse to be a very entertaining read and look forward to the next book in the series."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "Infection: Alaskan Undead Apocalypse takes place mainly in Anchorage, and begins with a family of tourists from Minnesota who are traveling to Alaska on vacation. The younger boy, Martin, has brought along a friend, Danny, and the family plans on spending time out in the woods at a cabin near a glacier. Almost immediately upon arrival at the cabin, Martin, his sister Jules, and Danny discover what appears to be a dead body stuck in the melting glacier. Thinking it is a caveman, they pose next to it, taking pictures. When the caveman turns out to be a thawed zombie, and Martin gets bitten, the family races back to Anchorage to a hospital as Martin’s health rapidly deteriorates. All hell breaks loose when the boy ends up dying in the hospital, gets back up, and attacks everyone around him. Things rapidly spin out of control from there, with a plague of undead spilling outside the walls of the hospital and onto the streets of Anchorage. Within a matter of hours, the entire city is under siege by a horde of fast moving undead devouring and infecting everyone in their path. Throughout the course of this book, the first in a planned trilogy, we are introduced to the people that make up two main groups of survivors. One group is led by Dr. Caldwell, who was treating Martin at the hospital, and the other lead by Neil, an office worker who witnesses one of the first zombie attacks outside of the hospital (and the two surviving children-Jules and Danny-end up with him as well). The pages telling the story of these characters are intermingled with various graphic scenes of carnage as Anchorage is ripped to shreds and the police and military are unable to do much to stop the tide of death rushing over them. Infection: Alaskan Undead Apocalypse is a fun, fast-paced tale of zombie mayhem that barely gives you time to breath, and zombie fans who crave plenty of gore and undead action should enjoy it. The main characters are well developed and give the reader a few folks to root for as well as one in particular to loathe, which keeps things interesting from start to finish. As I always try to do, I point out areas of concern with a story, and I have a couple of them with Infection. The first is a minor point, but one that I feel deserves mentioning. Alaska appears in the title of the book, and as such, I expected this story to bring some unique elements to the table based on the locale. Unfortunately, while the author knows Anchorage like the back of his hand, the city felt no different than any other place on the map. Perhaps the sequels will insert more of the distinctive ‘flavor’ of Alaska in them that will make this story stand out more.My second issue has to do with one particular character, a police officer. I felt that he would have been far more intriguing character if he wasn’t a cop, but I found it hard to buy into him being an officer of the law. From the beginning, he makes no effort to take a leadership role in a crisis situation, letting Dr. Caldwell handle that role in a non-medical crisis. All I know is that if I were trying to flee from the impending apocalypse and I was in a group with a police officer, I would be looking to him for direction, not a doctor (even as you are racing down the halls of a hospital). But strangely enough, no one calls him on this until well into the book, and by then, I was wondering how this guy ever passed whatever psychological test is required to become an Anchorage cop in the first place. Again, he would have been a far more interesting character were he not a cop. Overall, I felt that this story has the potential to be a solid zombie trilogy. Infection doesn’t really bring anything new to the table-there are no big surprises to be had for zombie fans here-but my hope is that the author turns things up a notch in the sequels to give this story a flavor of the northlands that leaves a lasting impression."}, {"userName": "Badseedgirl", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "Anyone who has ever looked at my reading list will know that I have a love hate relationship with the genre of Zombie fiction. When it is good, it can be a well written and entertaining. But so often in these days of self and e-published novels that should have never seen the light of day, picking up a “Zombie novel” should come with Vegas odds as to how bad it will be. Fortunately for every double zero that comes up on the wheel, I will also find a novel like Infection: Alaskan Undead Apocalypse by Sean Schubert, while if not one of the best zombie novels I have ever read, is at least near the top of the middle of the pack.To be honest, I never had much hope for this novel, with expectations that low; Sean Schubert would have had to have written complete crap to have met my expectations. And that was because of the title; or more specifically the subtitle, “Alaskan Undead Apocalypse.” To be honest I was expecting some kind of piss poor rip off of Kurt Russell’s classic movie “The Thing.” The novel started out meeting my low expectations. Three small children while on vacation in the woods of Alaska find what they think is a caveman frozen in a glacier. While posing next to it, one of the children was bitten because, Surprise!! It was a zombie encased in that ice. And here is where I started to be pleasantly surprised by Infection; I suddenly realized that this was actually a very well written novel. I felt sorry for the characters, and what was about to happen to them. This was not a novel of Alaskan survivalist thriving in the zombie outbreak, but was a story of average people struggling to survive. We see characters surprisingly rise to the challenge and others collapsing under the pressure.My only real disappointment for me was the ending. I know that this is the first novel in a series, but the ending of this first novel felt less like a cliff hanger and more like the author had written a much larger novel and just decided to cut it in half. I guess the word that best describes it would be abrupt. The ending was too abrupt. Still I plan to go another round with this author."}, {"userName": "Justin", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "Previously self-published and now reissued by Permuted Press, Infection: Alaskan Undead Apocalypse is the first book in a projected series by author Sean Schubert. The book starts when three children on vacation in Alaska discover a mostly-frozen man in the woods. They believe it's a preserved caveman corpse...until it takes a bite out of one of them. The victim is rushed to a local hospital, where you can guess what happens next. One bite leads to another and soon the whole town is in full-on zombie apocalypse mode.Zombie 411: Schubert's zombies are more or less the Romero-style undead. They're quicker, but the basic rules seem to apply.The good - Aside from what I normally expect to see done well with this kind of book (namely a brisk pace and well-choreographed violence), Schubert also did a great job introducing his characters. He provided some background and insight into each character - even the ones with less than a page to live - and did it in a way that wasn't awkward or forced, which is not an easy thing to do. The dialogue was solid and (mostly) believable as well.The not so good - While I don't have any issues with the characters or overall execution, the fact is Infection reads like just about every other zombie book out there. The infection hits, people panic, the army and police are useless, only one person in the whole town has ever seen a zombie movie, isolated survivors soon form a group, and then it abruptly ends. The only box that isn't checked is first person narration or a journal entry format. The only real distinction I see is the setting, and even that didn't seem to play much of a role in the story.Infection: Alaskan Undead Apocalypse is a solid enough story, but there's just nothing here that sets it apart from a very crowded pack. If you're a major fan of all things zombie it's worth reading, but it's not a story that will stay with you the way World War Z: An Oral History of the Zombie War or Ex-Heroes do."}, {"userName": "Brad T.", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/3634478-brad-t", "userReview": "I read a lot of independent apocalyptic fiction and I have come to expect certain things. Things like editing and writing experience come into play but I don't expect 5 star fiction in this genre. I look for two things: originality and good characters.Originality - The only thing about this book that was original was the setting, you don't see a lot in this genre written about Alaska. I was disappointed to discover though that this could have been set in any city. The fact that it was Alaska seemed really unimportant in this book. It could have been Denver, Colorado and it would have been the same story. Characters - The book featured a lot of cliched characters. There always has to be a cop but I liked that this one was bat shit crazy. Kids without parents - check; gay guy - check; girl in love with gay guy - check; guy who hasn't had the best luck in life turns out to be the hero - check, hot girl who likes him despite his self loathing - check.If I were a first time reader to the genre, I would have probably really liked this book. I didn't dislike the book and I will read the second book in the series for no other reason than I really hope that the Alaskan setting plays more of a role in the book. I just don't think this book added to the genre.Overall, I did actually enjoy the book and I can't put my finger on why I did. It made for some brain dead reading which is all I am looking for some times."}, {"userName": "Jennifer Macdonald", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/12579474-jennifer-macdonald", "userReview": "[ what's his face dies, I care very little because I don't really know him. I care more for those little kids who were waiting for the bus in the morning and were turned more than I care about somebody I'm actually supposed to \"know\".  (hide spoiler)]"}, {"userName": "Daphne", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/5964949-daphne", "userReview": "This was recommended to me by a student of mine. I do like the Walking Dead TV series and thought it would kind of be fun to read something about Anchorage and Zombies, a light read. This it was. Don't be looking for superior writing and a dynamite plot. This doesn't have it, however, it'll pique your interest enough to keep you entertained. Sometimes we all desire an easy quick read and this would be perfect for that. I read the second book, Containment quickly after this one. It gets better. I think the author begins to realize the potential he has with the characters he develops and builds them more so in the second book.Be patient, it's different, and it'll ramble on for awhile in some parts, but all in all it's a good light read.Definitely not a Pulitzer prize or book of the year, but it doesn't try to be either."}, {"userName": "Pam", "userReviewDate": "Oct 31, 2012", "userURL": "http://www.goodreads.com/user/show/7062431-pam", "userReview": "I get books on kindle now and really only buy those that are at least 300 pages. But i bought this because he donated a signed copy for a auction for Zack Mohs..It was kind of cool reading a book where you know all the places, the roads, streets, stores and hospital. Would have gave it a higher rating but it seems all books today are shorter and left open with no ending so they can make book 2,3,4 on and on...i like more books in a series but not if there is really no kind of ending and if the book is short just to make another. The book was pretty good though...the best thing about kindle is getting to read these books you might never have gotten to..p.s favorite part was the part about blowing up the bridge to Palmer....lol thanks for writting."}, {"userName": "Taddow", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/7060018-taddow", "userReview": "Because I live in Anchorage, Alaska and because I enjoy apocalyptic-type stories, I think these were the main reasons why I enjoyed reading this book. Sure there were times when I thought the writing was a little weak, the characters cliché and the scenarios with how the zombies quickly overwhelmed the authorities (despite their training and firepower) and spread were unrealistic, but then I realized that I was still enjoying the book despite these things. I liked how the author references actual locations in the book (so far my neighborhood has not been mentioned) and I think this adds to the story for those that are familiar with the area. I look forward to reading the next installment..."}, {"userName": "Drew", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/7983972-drew", "userReview": "Infection is your run of the mill Zombie book. It has a lot of flesh tearing action, but doesn’t add anything to the genre or some great character to separate itself from other zombie books. Most of the characters are pretty quick to realize what is happening which is the only way they survive, but there is nothing that draws you to these people and many of them aren’t likable. Finally the book doesn’t really resolve anything. It needs to be read as a series so you have to commit to more than one book. If you’re looking for another Zombie gore book stop here and get ready for a ride. If you’re looking for something more I would move on."}, {"userName": "Sean", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/18315798-sean", "userReview": "I gave up on this book after 3 chapters because even though it's a rather brutal zombie story, it felt like it was written for a 10 year old. I'm usually an easy-going guy, but some things aren't meant to be geared towards kids.At first I thought the writing style was based on the character's focus (the first chapter is from a kid's POV) and would change as other characters were the focus of future chapters, but that didn't turn out to be the case. Even when the focus shifted to an adult in the second chapter, the writing style stayed the same."}, {"userName": "Gar", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/24819389-gar", "userReview": "Spoiler:Nice take on the apocolypse genre. As would be in real life and not fiction, real established characters can and will be killed off before your eyes. I kind of find it hard to believe that up in Alaska, there would be so many of the undead as in the books but hey.... whatever. Definitely not the best zombie books but still a good read. These books had me anywhere from 2-4 stars at different times. overall, 3.5"}, {"userName": "Emily Nolan", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/14276548-emily-nolan", "userReview": "Re-reading bc I can't remember this book to be able to follow the sequel :X #bookaddiction I like the characters I also like that the kids are part of this. A huge thing I enjoy about this zombie book is that some actually prepare for Zombies! Like in this day in age we wouldn't know what zombies were? I think not! Yes there can be complaints about character development but it's bc this is meant to be a series. So read the next rinse and repeat :D"}, {"userName": " PuMbA's MoMmy*•.♥.•* ", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/4756353-pumba-s-mommy", "userReview": "This book started off great and then it just stayed dormat. Other than the people trying to evade the zombie-mash, there wasn't much going on between the characters that was dramatic or made for a high climax. Overall though I did enjoy the book and liked the descriptions when the zombies would tear the flesh off their victims."}, {"userName": "Miranda Grimes", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/31437680-miranda-grimes", "userReview": "I was a little more than halfway into reading this book (on Oyster), when my 5 day free trial was through. I about cried. I don't like not being able to finish a book, but can't afford to pay a monthly subscription, either. Tried to see if I could read it on here (frustrating that I can't)... I'll have to just order this series myself *sigh*"}, {"userName": "Ruth", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/7445389-ruth", "userReview": "I'm not a huge fan of Zombie stories, but just couldn't resist this one simply because it's set in my home town. It was kind of neat to \"follow\" the main characters as they made their way thru the story."}, {"userName": "Ann Love", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/2545343-ann-love", "userReview": "Not bad until the abrupt ending pimping the sequel..."}, {"userName": "Barclay", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/4568520-barclay", "userReview": "Familiar and entertaining."}, {"userName": "David Colenutt", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/16549379-david-colenutt", "userReview": "Loved the book, read it in a day because it was so hard to put down"}, {"userName": "Casey", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/38806817-casey", "userReview": "loved it, if your a walking dead fan this is a great book. I love that I can relate to were they are and their surroundings because I live in anchorage. can't wait to get the next book."}, {"userName": "Mia Michalek", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/5315486-mia-michalek", "userReview": "This was not one of my favorite Zombie reads!"}], "description": "If this is the end of the world, what do you do? Do you have the will to survive? And in surviving, what or who are you willing to sacrifice? With their city overrun by a plague of Biblical proportions, a group of survivors is forced into answering those questions for themselves.About the Author: Sean Schubert lives in Anchorage, Alaska, and writes part time. He is the proud father of two wonderful children and is married to the coolest wife he knows. The author earned a degree in English from Wabash College in Crawfordsville, Indiana. He and his wife moved to Anchorage in 1993 for the summer and have been living there ever since.", "title": "Infection\n      \n          (Alaskan Undead Apocalypse #1)", "url": "http://www.goodreads.com/book/show/9500884-infection", "average": 3.61, "cover": "https://images.gr-assets.com/books/1349007200l/9500884.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/4406756.Sean_Schubert", "name": "Sean Schubert"}], "type": ["Horror", "Horror", "Fiction", "Apocalyptic", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9500884-infection", "http://www.goodreads.com/book/show/13446637-infection", "http://www.goodreads.com/book/show/10699104-infection", "http://www.goodreads.com/book/show/15845700-infection", "http://www.goodreads.com/book/show/16159616-containment", "http://www.goodreads.com/book/show/19545418-mitigation", "http://www.goodreads.com/book/show/22753446-resolution", "http://www.goodreads.com/book/show/20456672-infection-and-containment", "http://www.goodreads.com/book/show/34668032-fyre"]}