{"ratings": 117940, "userreviews": [{"userName": "Paquita Maria Sanchez", "userReviewDate": "Sep 17, 2010", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "I just want to start off by saying that \"Through me you enter into the City of Woes\" would make an EXCELLENT tramp stamp. Jump on it!Being that I am an atheist living in the \"Bible Belt,\" I was certain that reading this would lead to some sort of goodreads tirade, which can at times feel about as good as vomiting up a sour stomach or...you know...doing other stuff like shit that ladies don't do. However, I was from the outset hypnotized by Dante's très Baudelaire-esque-grotesque imagery and overall style. For such a holy shitfuck, he had quite the murky mind. He was dreaming up torture scenarios that wouldn't even BEGIN to be trumped until Gilles de Rais and Vlad Tepes came around, like, a century later. And don't be surprised if he zaps you with the occasional rotting pustule or maggot-infested knife wound. These aren't literal examples, but they illustrate just how THE OPPOSITE OF FLOWERY some of his language is. So I went into reading this with a huge wall up (I know, I know, a terrible way to read), but then I realized that I wasn't JUST going to be proselytized to...I was going to be threatened with nasty, rotting, coldsore-herpee-mange-pits all over my body that George W. Bush and Paris Hilton are going to take turns pouring their boiling-hot-diarrhea-snot into. Dante, you sick bastard! AWESOME!!!So onward I galloped, discerning through all the filthy language that:A) I am, in fact, going to hell.B) They will have trouble determining the circle I will end up in because I could be placed in EVERY SINGLE ONE OF THEM save maybe, like, one or two (I stopped counting after awhile).C) The Dalai Lama, too, is going to hell.**In fact, the \"higher-ups\" are apparently so sadistic, they sent people to hell who had lived morally just lives but were BORN BEFORE THE COMING OF CHRIST! He'll punish you for not worshiping Him before you even know who He is!!! If there was ever a better use for \"WTF?\", I don't know what it is. That's like your mom smacking you in the mouth for getting pregnant while you're still a virgin, or like wanting to ban a book that you haven't even seen in real life yet! That means that every intelligent being for the first few BILLIONS OF YEARS is in hell RIGHT NOW! ALL OF 'EM!!! Every evolutionary step forward up to the first Homosapien Christian is a batch of poor bastards that has been ferried across the River Styx. HARSH.\nI mean seriously...even Moses and Noah were in hell until Jesus came through with the VIP passes. Apparently, the wholly omniscient creator forgot to put them on the guest list. Ain't that some shit?One specific gripe about the story...I'm not digging this whole \"emasculated devil\" thing. I mean, wallowing in your own filth freezing your ass off with bitch-tears in your eyes at all times? This is the malevolent force that the Christians live in constant fear of, seriously? It's a non-stop temptation to be like HIM? Come on, everybody knows the devil is confusingly sexy and he likes to smoke fancy cigars and drink brandy and wear fine suits and tell hilarious jokes. How else is he supposed to charm us away from the true path? Keep up, Dante...sheesh.\nForgive me, father, for I have sinned. THE END!Oh, and if you hated this review, I have a back-up review BELOW:\"Papa Said Knock You Out\" (aka \"The Inferno\")by Lil' J.C.----------------------------------------------------C'mon man[News Report]And with the local DBT news, J to the motherfuckin' C with a triumphant comebackbut tonite...[JC]Don't call it a comebackI been here for yearsRockin my peers and puttin suckas in fearMakin the tears rain down like a MON-soonListen to the bass go BOOMExplosion, overpowerinOver the competition, I'm towerinWreckin shop, when I drop these lyrics that'll make you call the copsDon't you dare stare, you betta moveDon't ever compareMe to the rest that'll all get sliced and dicedCompetition's payin the price[Chorus:]I'm gonna knock you out (HUUUH!!!)Papa said knock you out (HUUUH!!!)[REPEAT 4X]Don't u call this a regular jamI'm gonna rock this landI'm gonna take this itty bitty world by stormAnd I'm just gettin warmJust like Muhummad Ali they called him CassiusWatch me bash this beat like a skullCuz u know I had beef witWhy do u riff with me, the maniac psychoAnd when I pull out my jammy get ready cuz it might goBLAAAAW, how ya like me now?The river will not allowU to get with, Mr. Smith, dont riffListen to my gear shiftI'm blastin, outlastinKinda like Shaft, so u could say I'm shaftinOld English filled my mindAnd I came up with a funky rhyme[Chorus][JC]Breakdown!!!Shadow boxin when I heard you on the radio (HUUUH!!!)I just don't knowWhat made you forget that I was raw?But now I got a new tourI'm goin insane, startin the hurricane, releasin painLettin you know that you can't gain, I maintainUnless ya say my nameRippin, killinDiggin and drillin a holePass the Ol' Gold[Chorus]Shotgun blasts are heardWhen I rip and kill, at WILLThe man of the hour, tower of power, I'll devourI'm gonna tie you up and let you understandthat I'm not your average manwhen I got a jammy in my handDAAAAAM!!!!! Oooooohh!!Listen to the way I slaaaaay, your crewDamage (UHH) damage (UHH) damage (UHH) damageDestruction, terror, and mayhemPass me a sissy so suckas I'll slay himFarmers (What!!!) Farmers (What!!!)I'm ready (we're ready!!!)I think I'm gonna bomb a town (get down!!)Don't u neva, eva, pull my leverCuz I explodeAnd my nine is easy to loadI gotta thank GodCuz he gave me the strength to rockHARD!! knock you out, papa said knock you out"}, {"userName": "Glenn Russell", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/23385697-glenn-russell", "userReview": "Dante’s Inferno - the first book I was assigned to read in my high school World Literature class. Back then I couldn’t get over how much the emotion of fear set the tone as I read each page. I recently revisited this classic. Rather than a more conventional review – after all, there really is nothing I can add as a way of critical commentary –- as a tribute to the great poet, I would like to share the below microfiction I wrote a number of years ago: JOYRIDE One balmy July evening at a seaside amusement park, Hector and his date strolled past the merry-go-round, toddlers’ swings and tooting fire engine out to the more hair-raising rides. At the very end of the pier, beyond the Wild Mouse and giant Ferris wheel, there was a new roller coaster that looked pretty frightening. Not only did the tracks have steep climbs and amazing plunges but there was an opening in the boardwalk where the roller coaster took its passengers under the pier.\"Look,” Hector said, pointing to the hole in the boardwalk, “I’ve never seen a roller coaster whose tracks go beneath the surface.”“Oh!” his date squealed, eager for as much of a thrill as the amusements had to offer, “that must really be scary. Let’s go.”They took their place in line behind the last thrill-seeker and watched as the roller coaster ascended, hurled down and sped around hairpin turns, finally climbing the highest hump of track and descending to where the track ran beneath the pier. Hector looked over at the spot in the boardwalk from which the train would eventually reemerge. He waited and waited. This was taking much more time than he though.Hector’s girlfriend squeezed his hand. “Wow! I bet they’re really getting spooked down there.”Hector heard shrieks coming from some place underneath their feet – shrieks not of delight or pleasure but shrieks to make your blood run cold.“Oh, I can’t wait!” his date said, tugging at his shirtsleeve.Hector crouched down to hear the shrieks and howls more clearly. Waves of heat rising from the spaces between the wooden boards of the boardwalk burned his face. After several uneasy moments he stood back up and watched as the roller coaster finally rolled through the cavernous opening in the boardwalk and stopped near the line.All of the passengers’ faces were ashen and a middle-aged woman in the front seat was weeping on her husband’s shoulder.“This must really be something,” Hector’s date said.One terrified passenger unbuckled herself and climbed out. She walked past, eyes downcast, and Hector could both see and smell her hair was singed.And if this wasn’t enough, the cheerless bearded man running the ride collected everyone’s tickets and pronounced lots would be drawn to determine who would have to ride in the first car. Hector’s date called out that if nobody else wanted, she would gladly volunteer for the front seat.When the old man nodded, she pulled Hector by the hand to the front of the roller coaster and strapped him in next to her. Hector noticed for the first time the name of this ride – spelled out in red iridescent letters over their heads was “DANTE’S INFERNO.” Hector slunk down in his seat next to his girlfriend, who was now giggling and playfully poking him in the ribs. As the roller coaster began moving, Hector tried to console himself with the grim fact that everyone on the preceding ride did at least come back alive."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "One of the great classics that everyone should attempt reading once. For Walking Dead fans, had there been no Dante, there could never have been a Kirkman. There is incredible violence and suffering (it is Hell after all), but the relationship between Virgil and Dante is a beautiful one that evolves as their descend lower and lower.I read both the John Ciardi translation in verse (rhyming for the first and third lines in each stanza trying to keep to Dante's 11-syllable structure) and John M Sinclair's prose translation (which also includes the original on the left pages). Both are highly commendable and have great notes and footnotes. \"Midway in our life's journey, I went astray from the straight road, and woke to find myself alone in a dark wood.\"Here Dante shows that the book is autobiographical (\"I went astray\") and at the same time universal (\"our life's journey\"). It also moves between dreaming and reality (\"I went astray...and work\") which characterizes his depictions of hell, purgatory, and paradise that follow. The forboding of the \"dark wood\" is a perfect introduction to the description of hell that awaits us. Even the fact that he strayed from the \"straight road\" seems to presage the curvy, circular path he will take through hell's many circles. This is one of my favorite openings and chills me a bit whenever I reread it.If I were to see this book at a painting, the first one that comes to mind is Guernica by Picasso where the suffering is so painfully evident - albeit in black and white perhaps echoing the black text on the white page. The implicit condemnation of the perpetrators and the overall feeling of suffering in Inferno as in Guernica is overwhelming. I suppose I could also choose from one of Otto Dix's paintings or Bosch's but the very first that I thought of was Picasso."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 11, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Inferno (La Divina Commedia #1) = The Divine Comedy of Dante Alighieri: Volume 1: Inferno, Dante AlighieriThe Divine Comedy (Italian: Divina Commedia) is a long narrative poem by Dante Alighieri, begun c. 1308 and completed in 1320, a year before his death in 1321. It is widely considered the preeminent work in Italian literature, and is seen as one of the greatest works of world literature. The poem's imaginative vision of the afterlife is representative of the medieval world-view as it had developed in the Western Church by the 14th century. It helped establish the Tuscan language, in which it is written, as the standardized Italian language. It is divided into three parts: Inferno, Purgatorio, and Paradiso.تاریخ خوانش: در سال 1968 میلادیعنوان: دوزخ - دانته آلیگیری - کمدی الهی؛ نویسنهد: دانته آلیگیری؛ مترجم: شجاع الدین شفا؛ تهران، امیرکبیر؛ 1335؛ در سه جلد: جلد نخست: دوزخ؛ جلد دوم : برزخ؛ جلد سوم: بهشت؛ چاپ بیست و یکم 1393؛ موضوع: شعر شاعران ایتالیائی قرن 14 مدر نیمه راه زندگانی، خویشتن را، در جنگلی تاریک یافتم، زیرا راه راست را گم کرده بودم، و چه دشوار است وصف این جنگل وحشی و سخت انبوه، که یادش ترس را در دل بیدار میکند. چنان تلخ است که مرگ جز اندکی از آن تلختر نیست، اما من، برای وصف صفایی که در این جنگل یافتم، از دگر چیزهایی که در آن جستم سخن خواهم گفت. درست نمیتوانم گفت که چگونه پای بدان نهادم، زیرا هنگامی که شاهراه را ترک گفتم سخت خواب آلوده بودم. قسمتی از سرود اول دوزخ. ا. شربیانی"}, {"userName": "Manny", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "Since it's Good Friday, and thus exactly 717 years since Dante's pilgrim descended into the underworld, I thought it would be an auspicious moment to tell people about the project I've been pursuing together with Dr Sabina Sestigiani, an Italian lecturer at Swinburne University in Melbourne. Dante's poem is celebrated as one of the treasures of world literature - but it is not very accessible, being written in archaic Italian. Although there are translations, and even these are wonderful, a translation of a poem can never be more than a shadow of the original. T.S. Eliot famously advised people just to dive in and start reading. It worked for Eliot, and you feel that in principle it must be the right approach. All the same, most readers find it a daunting prospect. We wondered if there was any way to make the voyage easier. Using the CALL platform we've developed at Geneva University, Sabina and I have been putting together a first version of what a electronic poetry appreciation assistant might look like. If you have a headset and you're on Chrome, Firefox, Safari or Explorer - I'm afraid we don't yet have it available for mobile devices - try going here. Log in as 'guest' (no password required) and click 'Allow' on the popup to let the app access your microphone. You should now be on a screen that looks like this:On the right, there's a scrollable pane with the first 30 lines of the Inferno in slightly modernised Italian orthography. You can hover your mouse over any line to see it in Longfellow's English translation - we chose Longfellow since he's both a great poet in his own right and translates very literally. At the top, there's an embedded audio file where you can hear Sabina reading the text aloud. Italians who've tried out the app have been complimentary about her interpretation.On the left, we have an area where you can practise reading yourself. You're shown the poem one line at a time. If you press the Help button (question-mark icon), you'll get Longfellow's translation and hear Sabina reading just that line. The intention is that you should listen a few times, then press on the Record button (microphone icon), keep it pressed down while speaking, and release. You should hear your voice echoed back, and the app will let you know if you said it approximately right: you'll get a green border for \"okay\", red for \"try again\". You use the arrows to move to the next and previous lines. We currently have six extracts loaded, taken from Canti I (opening), III (the Gates of Hell), V (Paolo and Francesca), X (Farinata), XXVI (Ulisse) and XXXIII (Ugolino). You can find the other extracts by using the Lesson tab on the left.Speaking just for myself, I've found the app very helpful for developing my appreciation of the beautiful language; I've soon got to the point where I want to learn pieces by heart, and find myself repeating them mentally. We're curious to hear what people think - please let us know! If you want to try creating your own interactive versions of poems, it's straightforward and just involves copying text onto a spreadsheet and recording the audio using an online tool. Message me and I'll send you details.Happy Easter!______________________My multi-talented colleague Irene Strasly (she makes a guest appearance in this review) has used the platform to create interactive versions of several of her own poems. Italians who've heard them say they're quite good.______________________Two poems by Antonia Pozzi. Here is the first one, with a beautiful translation by Peter Robinson:\nAmore di lontananzaRicordo che, quand'ero nella casadella mia mamma, in mezzo alla pianura,avevo una finestra che guardavasui prati. In fondo, l'argine boscosonascondeva il Ticino e, ancor più in fondo,c'era una striscia scura di colline.Io allora non avevo visto il mareche una sol volta, ma ne conservavoun'aspra nostalgia da innamorata.Verso sera fissavo l'orizzontesocchiudevo un po' gli occhi. Accarezzavoi contorni e i colori tra le ciglia:e la striscia dei colli si spianava,tremula, azzurra: a me pareva il maree mi piaceva più del mare vero.Love of distanceI remember, when in my mother’s house,in the middle of the plain, I hada window that looked ontothe meadows; far off, the wooded bankhid the Ticino and, further on,there was a dark line of hills.Back then I’d only seen the seaone time, but preserved of ita sharp nostalgia as when in love.Towards evening I stared at the skyline;narrowed my eyes a little; caressedoutlines and colours between my lids;and the line of hills flattened out,trembling, azure: and seemed the sea to meand pleased me more than the real sea.She wrote it in 1929, when she was only seventeen. Nine years later, she was dead.______________________Our friend Kirsten has added an interactive English poem - Shakespeare's sonnet CXXXVIII, which I'd never properly noticed before. You can find it here."}, {"userName": "Manny", "userReviewDate": "Nov 27, 2008", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "The other day, in the comment thread to her review of The Aeneid, Meredith called The Divine Comedy \"lame\": specifically, she objected to the fact that Dante put all the people he didn't like in Hell. Well, Meredith, you're perfectly welcome to your opinions - but I'm half Italian, and I've been politely informed that if I don't respond in some way I'm likely to wake up some morning and find a horse's head lying next to me. So here goes.I actually have two separate defenses. First, let's consider Dante's artistic choices, given that he's planned to write a huge epic poem where he's going to visit Hell, Purgatory and Heaven, each of which is divided up into a large number of smaller areas corresponding to differents sins and virtues. Now, who is he going to meet there? One option would be to have allegorical figures directly representing Pride, Wrath, Charity etc. That's what Bunyan did in The Pilgrim's Progress, but most people agree that it's not a very good solution: The Divine Comedy is much more fun than The Pilgrim's Progress. Or he could just make people up, but then he wouldn't have any space for character development, and you'd never be able to keep track of all the invented figures. Lindsay tried that route in \nA Voyage to Arcturus\n, and, even though the book's worth reading, he showed how hard it is to make it work. Every time someone interesting turns up, they always seem to get killed fifteen pages later.I think the choice Dante made was the best one: to use real people. Of course, it is a bit presumptuous to decide that the ones going to Hell are mostly guys he doesn't like, but nothing else makes sense. If you want damned souls to populate the Hell of the Hypocrites, isn't Caiaphas, the high priest who falsely condemned Jesus, a sensible choice? If you're looking for Traitors to Lords and Benefactors, then don't Brutus and Cassius fit pretty well? And every now and then he meets his friends down there too. His beloved teacher Brunetto Latini is damned for sodomy, which shocks Dante just as much as it does me, but in his world-view it makes perfect sense; homosexuality is plain wrong, that's all there is to it. Okay, that was my first defense. My second is that it's far too simplistic to say that Dante is self-righteously damning all his enemies and extolling his own virtues. The theme that continually comes back through the first two books is that Pride is the root of all sin, and Dante is very conscious of his own sinful nature. For example, he's way too happy to gloat over the fact that his enemy Filippo Argenti has been condemned to the Hell of the Wrathful, and Virgil gently points out the irony. Then, later, he has to spend the whole of Book 2 climbing up Mount Purgatory, which is hard work. He's got plenty of sins to purge.To me, the real problem with Dante is that his world is so very different from mine, and I keep having to scramble to the footnotes to get the necessary background; so it's hard to keep the flow of the book, since you're constantly being interrupted. But even so, it's still a remarkable piece of work. We just don't think seriously any more about the nature of Good and Evil, Sin and Redemption. Dante's world thought they were crucially important, and he's one of the few people who's still able to give us a window into that view of life. It's nowhere near as irrelevant as we like to make out.Don Corleone, will this do? Or do I have to add footnotes as well?"}, {"userName": "Joshua Nomen-Mutatio", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1447864-joshua-nomen-mutatio", "userReview": "THIS BOOK IS ABOUT HOW HELL IS GONNA SUUUUUUUUUUUUUCK"}, {"userName": "Nefariousbig", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/7016129-nefariousbig", "userReview": "A fantastic representation of Dante's Inferno - Nine Circles of Hell as divined by divine Lego artist, Mahai Marius Mihu. This is as close as I hope to get to understanding the Nine Circles according to Dante Alighieri. i. LIMBO - A place of monotony, here the souls are punished to wander in restless existence while they moan helplessly in echoes between the ruins of a templeii. LUST - Surrounded by erotic representations, those overcome by lust are forced to watch and experience disgusting things, ultimately being condemned to drown in the menstrual riveriii. GLUTTONY - The circle itself is a living abomination, a hellish digestive system revealing horrific faces with mouths ready to devour the gluttons over and over for eternityiv. GREED - This pompous place is reserved for the punishment of the greedy onesv. ANGER - In this depressing place the souls are trapped in the swamp, they can’t move and they cannot manifest their frustration which is making them even more angryvi. HERESY - The giant demon watches closely over his fire pit, dwarfing the damned that are dragging the new arrivals in the boiling lava. Those who committed the greatest sins against God are getting a special treatment inside the temple where they are doomed to burn for eternity in the scorching flamesvii. VIOLENCE - A place of intense torture where the horrific screams of the damned are eternally accompanied by the hellish beats of drumsviii. FRAUD - : In Fraud the Demons enjoy altering the shape of souls, this is how they feedix. TREACHERY - Lucifer lies here chained by the Angelic Seal which keeps him captive in the frozen environmentARTIST – Mahai Marius Mihu (All rights and photographs are property of Mahai Marius Mihu/Rex Features. I claim no ownership to any information in this review, and I own absolutely no rights to any of the property mentioned herein.)"}, {"userName": "Bill  Kerwin", "userReviewDate": "Jun 30, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "An excellent translation--even better than John Ciardi. Like Ciardi, Pinsky is a real poet and makes Dante the poet come alive. His verse has muscularity and force, and his decision to use half-rhyme is an excellent one, since it allows us to attend to the narrative undistracted."}, {"userName": "emma", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "whoa this book is wild.in place of a review of this whole book, i'm just going to write about this single line in Inferno that i full on cannot stop thinking about. warning: this is completely nasty. blame Dante. also: all credit goes out to my literary foundations professor. i'm essentially regurgitating his argument.in Canto XXXIII, the pilgrim encounters Count Ugolino. Ugolino, a former governor of Pisa, is feasting on the neck of Archbishop Ruggieri. in life, Ruggieri betrayed him, leading to his imprisonment. Ugolino was trapped in a tower along with his four sons. as days passed and Ugolino and his sons began to hunger, Ugolino bit into his own hands. his children bade him to eat them before he'd eat himself: \"Father, it would be far less painful for us if you ate of us; for you clothed us in this sad flesh it is for you to strip it off.\"on the fourth day of imprisonment, the first of his sons died. the remaining three died over the next two days. Ugolino concludes: \"Then hunger proved more powerful than grief.\"CAN. YOU. BELIEVE. THAT. DOUBLE. MEANING.either this guy should have died of his grief, but rather died of starvation, or - you know what's coming - homeboy ate his sons.I MEAN.that's impressive stuff, but it's not even over!!Dante is often called a \"theological poet.\" however, theology and poetry are opposed when it comes to the trajectory of Inferno. if it's a theological work, then we should feel less compassion for the people we encounter as we progress, because Dante is descending in hell and meeting more and more sinful people. but if it's a tragedy (or poetic), then we should feel more compassion, because the peak of pity has to occur toward the end of the work for the sake of catharsis. so which side of Dante is the dominant side when it comes to Inferno? it's been the subject of scholarly argument for centuries.the really impressive, unbelievable, can't-stop-thinking-about-it thing: this entire argument comes down to this single line - Canto XXXIII, line 75: \"Then hunger proved more powerful than grief.\"because either Ugolino is a story of immense tragedy, a story of near-faultless suffering, and we should pity him immesnely - or he's committed the horrifying, grotesque sin of eating the bodies of his children when cannibalism would not aid his long-term survival, and we should be largely unable to pity him! and it's completely ambiguous. we'll never know.Dante, you madman.bottom line: !!!!!!!!!!!!!"}, {"userName": "Fernando", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "El Infierno tan temido...Ese que transitaron Hércules en sus desafiantes trabajos, aquel al que descendió Eneas en el capítulo VI de la \"Eneida\", ese pavoroso y horrendo lugar que describe con impactante realismo en su sermón el padre Arnall en el libro \"Retrato del artista adolescente\", de James Joyce al que considero de una perfección casi cercana a la de Dante Alighieri, o ese otro infierno urbano en el que camina Adán Buenosayres durante la novela homónima y que Leopoldo Marechal narra con tanta maestría en el séptimo y último capítulo, el \"Descenso a la ciudad de Cacodelphia\".El Infierno también puede expresarse de otras maneras: puede ser psicológico y alojarse en la cabeza de los personajes, tanto en la auto tortura psicológica de Rodion Raskólnikov en \"Crimen y castigo\", en la desesperante situación de Gregor Samsa en \"La metamorfosis\" o en el sufrimiento Akaki Akakiévich con la pérdida de lo más importante que posee en \"El Capote\". También atraviesan un Infierno muy particular aquellos personajes que se alían con el Diablo, Lucifer, Satanás o Mefistófeles (el Demonio posee tantos nombres...), como ocurre con el Fausto de Goethe, el Doctor Faustus de Marlowe y en el calvario al que es arrastrado Macbeth o en el tortuoso desandar solitario de la criatura de Frankenstein. Del mismo modo, el infierno puede de remitirse también a un lugar, sea ciudad, isla, habitación, celda, etc. Ese temido infierno se transforma en una ciudad dominada por \"La peste\" de la ciudad de Orán que con tanta dureza describe Camus. ¿Acaso no es un lugar infernal una ciudad que se infesta de un hedor de muerte y desolación? ¿No sucede también que la tierra se transforma en un infierno deshabitado y apocalíptico como en \"La peste escarlata\" de Jack London, o la desolación infernal de \"La carretera\" de Cormac McCarthy?¿Acaso no vive Winston un infierno en la distópica Oceanía del libro \"1984\"? Ni que hablar del Infierno cósmico creado por HP Lovecraft en el que somete a todos sus personajes, quienes sufren las amenazas y castigos propias de Cthulhu. El Infierno puede también tener forma de prisión y puede ser real, se puede vivir en carne propia, como lo que narra Fiódor Dostoievski durante sus penosos y durísimos cuatro años de reclusión en Siberia, donde no arden llamas, sino que todo está terriblemente helado, como el mismo Cocito donde Lucifer despedaza a Judas Iscariote.Como podemos apreciar, el Infierno tiene muchas formas y todas ellas aterran.Debo reconocer que al leer este primer libro de \"La Divina Comedia\", uno reafirma que sigue siendo el más atrayente y entretenido de toda la obra, de todos modos a mí siempre me gustó muchísimo el Purgatorio y creo que no tiene muchas diferencias con el Infierno en la medida de que todas aquellas almas que están sometidas al monte del Purgatorio tienen castigo casi iguales al del estadio anterior. Recordemos que en el Purgatorio, las almas deben rendir cuentas por sus correspondientes pecados capitales cometidos.La cuestión de la lectura del tercer libro, el Paraíso, es resistida por muchos lectores, dado que para muchos es el la parte que menos gusta. Muchos la consideran tediosa y de una carga teológica muy alta (bueno, estas eran las convicciones de Dante en la época).Cabe destacar la manera (casi brutal) en que Dante Alighieri describe los castigos que sufren los condenados.Algunos de ellos son indescriptible y demuestran cabalmente qué poder de imaginación tenía el escritor mantuano, hasta qué punto podía llegar en este aspecto.Indudablemente, es también un lugar en el que confina a todos sus enemigos, a todos aquellos adversarios políticos (algunos de ellos aún vivos) y de cómo desnuda la realidad del momento político coyuntural que se vivía en la Italia del año 1300.Párrafo aparte, es de remarcar que la elección de Virgilio no está hecha para nada al azar. Sólo un poeta de ese calibre podría haber acompañado a Dante al Infierno, puesto que es su guía, su maestro y mentor, aunque Virgilio forma parte de ese limbo previo al Infierno, que contiene las almas de aquellos que no fueron bautizados antes Dios y que por ende, no puede ascender al Paraíso. Virgilio acompañará a Dante hasta cierto punto del Purgatorio, por lo que Dante deberá continuar su viaje solo.Yo leí esta parte de La Divina Comedia, publicada por Editorial Losada en tres libros, con el agregado de aclaratorias notas adicionales, pero tuve la suerte de conseguir un volumen de 1946, ilustrado por Gustave Doré, a quien admiro mucho y con el agregado de que el libro tiene la primer traducción que se hizo al español, y la hizo quien fuera Presidente de la República Argentina, Bartolomé Mitre. Muchos expertos destacan que sigue siendo esta la traducción más clara y fidedigna que se ha hecho de esta obra de arte al español.Es increíblemente atrapante leer el Infierno de la Divina Comedia. Como suele decirse en inglés: It's a hell of a ride!"}, {"userName": "Leo .", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/71478086-leo", "userReview": "Maybe Dante was referring to the levels of materialism. The more one has the more one wants, spiraling downwards, deeper and deeper until the matter consumes. So dense and dark with matter and at absolute evil, Hell, where Satan resides.🐯👍"}, {"userName": "James", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Book Review\n\n4 out of 5 stars to Inferno, the first of three books in the \"Divine Comedy\" series, written around 1320 by Dante Alighieri. A few pieces of background information for those who many not know, before I get into a mini-review. Inferno, which means \"Hell\" was one of three books Dante wrote in the 14th century, essentially about the three spaces people occupy after death: Hell (Inferno), Purgatory and Heaven (Paradiso). I've only read Inferno, so I'm not able to discuss much on the other two, but I'd like to some day. They were not written in English, so I have read a translated version. These works are considered comparable in fame and beauty as those of William Shakespeare. OK... that said, my thoughts:For as long as people have been alive, Christians, that is, they have worried about what happens after death, turning to God and the Bible. In the 14th century, religion was one of the only things people did with their lives besides work and raise a family. They had a lot of time to spend on it, wondering what might happen. Dante captures the exact sentiments we've all felt throughout our lives, and he displays it through the nine circles or gates of hell. He presents it as a torture for all those who did bad things while they were alive. The story, in its basic form, is Dante himself traveling in a boat through the river that runs through Hell, stopping to see each realm. He's led by the famous poet Virgil. He encounters people or archetypes of people he knew and those he's heard of. Essentially, it's a story of justice and the contradictions in religious beliefs for all of God's followers. Dante pushed people to think about their actions and beliefs. And he created a story based on his own journey to say everything he felt about what he's experienced in life.It's full of questions. It's been the basis for so many movies, books and plays in the future. It's so often quoted or referenced, it's literally one of the most famous works around... and to think it was written nearly 700 years ago is amazing. Though it's no where near a comparison, it reminds me a little bit of The Ninth Gate, a movie with Johnny Depp, that I love, about people trying to reach the Devil. And it's a translation of a new Spanish author I'm very fond of: Arturo Perez-Reverte. I've read one of his books and plan to read The Club Dumas soon.As for this one, I encourage everyone to find a passage from The Divine Comedy, even if you prefer Paradise or Purgatory, something a tad more positive, just to see the language and the lyrics Dante shares. It's beautiful. I could go on and on, but hopefully this is enough to wet your appetite. \n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by."}, {"userName": "Maureen", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "I DID IT. I FINISHED IT. BLESS.This is such an interesting book, though definitely very hard to get through. I think if I was able to read it in Italian it would be a little easier as it would actually be read like Dante intended, but it's still really cool to see all the concepts! This is such an influential piece of literature and is referenced SO MUCH in culture that it is really cool to have a basis for it. I think I may reread this in a different rhyming translation next time to see what that would be like, though I know the rhyming translation leaves a lot of the content out, or I may read a more modern translation so it will be easier for me to understand. Either way, I'm really glad I read this! Dante's version of hell is so interesting and poetic (har har) that it's hard not to like it.NOTE TO SELF AND OTHER READERS: LONGFELLOW TRANSLATION IS OLD ENGLISH. If you would rather NOT read old english, pick something else. I read Longfellow's translation the whole way through and just looked at another (why i waited this long I have no idea) and the other was a lot easier to read! SO JUST FYI!"}, {"userName": "7jane", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/28266234-7jane", "userReview": "(2016: review to 9780141195872 cover - hardback, red devils cover art:)(I didn't read the main text of this one, but I think I will read the English half at some point.)This one has chronology, introduction, map of Italy, plan of Hell plus commentaries and notes at the end. The main text itself is shown with Italian text on the left side, English on the right side. Commentaries include many comments on the linguistic details that I don't remember the paperback Penguin version having. There is also a cord for bookmarking one's place.I don't know exactly why I would want another copy of this book, but it just looked good. The Inferno (edit: I mean, Hell) is not my favorite of the three, but I can see why it would be the most popular - it certainly can feel exciting and the religion part is less in the front. (And also you can feel the climb from how especially the Paradise can feel like a place where air is thin :) ) So getting this was more about liking the whole, not just this part. But it is enjoyable kind of a book. Again."}, {"userName": "Algernon", "userReviewDate": "Feb 15, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "Before I start talking about the book proper, I have a confession to make: I wasn't sure I really wanted to read philosophical poetry written seven centuries ago. I had doubts about style, quality of translation and my own lack of literary background in decyphering the numerous Christian and mythological references, not to mention political and cultural trivia from Dante's Florence. Thanks to my Goodreads friends, I took the plunge and I can report back that it was well worth the effort. Even better, it wasn't an effort, but a joyride, thanks primarily to my lucky pick of the Ciardi translation for my first foray into the phantastical world of Dante. So my answer to the questions: can we still read Dante for pleasure and not for academic study is a resounding yes. Another big Yes is the answer to the relevance of the Commedia for the modern reader. The fundamental soul searching questions about the relationship between spiritual and material life, morality and political power, religious and secular governance, reason and faith remain unchanged over centuries and must still be answered by each of us after our own fashion. Dante is as great a choice as the lightbearer showing the way to redemption, as Virgil was to the poet on his descent into Hell. Nell mezzo del camin di nostra vitami ritrovai per una selva oscurache la diritta via era smarrita.\" Right from the start it is evident that the poet's major talent is to say so much with such economy of words and with such elegance. Page after page of commentary has been written about these famous opening lines. The key to deciphering the poem is here: an allegorical journey of self discovery and liberation from doubts, uncertainty and fear. Dante is the hero of his own epic poem, and he starts with a confession of how he almost lost his faith in his search for the ultimate truth through the books of ancient philosophers and the myths and legends that have been passed on from antiquity. But Human Reason on its own is not enough, and salvation for Dante can come only by way of Divine intercession. Somebody up there loves him (Beatrice, the love of his life, symbol of purity and innocence, taken away to Heaven in her early youth). She sends a guide to help Dante on his perilous journey: the Roman poet Virgil, the mentor and personal hero of our narrator. Together they must pass through the underground halls of the damned, there to witness the justice administered by a stern God upon sinners of every variety. Only after renouncing and condemning sin, can the upward journey begin. Lasciate ogne speranza, voi ch'intrate Another famous quote that has entered into the world's cultural heritage marks the gate to the depths of eternal torment and despair. I have no intention of enumerating every level of the arhitecture of Hell and every lost soul that Dante and Virgil encounters. What impressed me most though was the rigid organization and the careful planning of each punishment, designed to reflect the gravity of the crime and to correctly assign the torment most appropriate for each category of sinner. For example, thieves must steal from one another the very shapes in which they appear. Nothing is left to chance, and accurate maps can and have been drawn of the allegorical geography of Hell, its nine concentric and descending level, its dark rivers and fiery pits. Instead of chaos and anarchy I discovered an inflexible and merciless order, with Minos as the judge who weights each soul's guilt and then sends them to their correct circle and niche, like with like, crime and punishment linked together for eternity. There is no place for pity here. Who is more arrogantwithin his soul, who is more impiousthan one who dares to sorrow at God's judgment. The escalation of dread and horror is well served by the poet's imagination, who starts the journey with sights and dialogues still anchored and related to the world above, but grows more grim and grotesque as the deeper levels are reached. Monsters and tortures grow more elaborate, more frightening, more inventive with each circle, until the senses are overwhelmed and humbled. The main lesson in Hell is to be aware of the wages of sin: O endless wrath of God: how utterlythou shouldst become a terror to all menwho read the frightful truths revealed to me! And an example of a gargoyle riding a centaur, an image worthy of the brush of Brueghel: Upon his shoulders, just behind his heada snorting dragon whose hot breath set fireto all it touched, lay with its wings outspred. Coming back to the sinners Dante meets in his downward journey, it should be noticed that he is not above paying back some personal political woes, by placing his contemporaries and adversaries inside particularly gruesome torture chambers. These human foibles, coupled with the apparent vanity and pride of the poet conscious of his worth as an equal of the ancient masters, are a source of humour and gentle irony at his own fallible nature, a more enchanting and entertaining portrait than his pious and hollier than thou alter ego. As a literary device, Dante uses prophecy to warn about the risks of the future of his beloved Florence, from which he was exiled by conspiracies within his own party, aided and abetted by the papal legate: Two are honest, but none will head them. There,pride, avarice, and envy are the tonguesmen know and heed, a Babel of despair. I should also mention the major political aspect of the poem, on one hand denouncing the corrupt and venal warring families of Tuscany, and on the other launching impassioned attacks on the degradation of the church in its power games and search for material governance. These ideas will be later developed into a pamphlet (De Monarchia) that was quickly put on the list of forbidden books by the papacy. Dante argues in favor of a secular government coupled with a church that renounces wealth and power and takes care only of the spiritual needs of its flock. He is well ahead of his time in this humanist plea for separation of powers and in his references to the ancient philosophers.Another major appeal of the journey for me was the recognition of many of the mythological characters residing in Hell. The most often referenced sources are Ovid with his metamorphoses and Virgil with his Aeneid, but the erudition and the variety of Dante's interests (history, cosmology, art, etc) are reason enough to name him among the greatest personalities of a nascent Renaissance movement.Much has also been said and praised about his liberation of the Italian language from the restrictions and limitations of Church latin, putting his vision into the live and colourful 'vulgata' dialect of the people. John Ciardi has this to say about the style of the poem, and he should know best, as a poet himself and a native speaker of Italian : I do not imply that Dante's is the language of common speech. It is a much better thing than that: it is what common speech would be if it were made perfect. Like Cervantes and Shakespeare centuries later, Dante stands as a national idol that defines a culture and makes it universal. I did try to read some of his verses in the original Italian and I was struck by the musicality and the rhythm that is so difficult to translate in another language. Ciardi did an excellent job in keeping the faith with this singsong quality of the poem, even if he is said to have taken liberties with the actual content. Not being a scholar or a purist, I was well satisfied with the result, especially as he kept the introductions and the end of canto notes to a minimum, allowing me to get immersed in the story instead of chasing endless commentaries and interpretations.The Ciardi translation is also the reason I am reviewing separately the three books that comprise the Commedia (The Divine was apparently an appelation added by later commentators) , as I have them published individually. I should warn though that The Inferno is not a standalone book. In the big concept of Dante's allegory, it is only the first step towards salvation, and the next two books are just as important in the final judgement. I had several more notes and quotes saved, but I'll stop for now, hoping I've managed to convince some of my friends to put Dante on their reading lists. In the words of Arnie:\"I'll be back!\" (After Purgatory)"}, {"userName": "Richard", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/6014887-richard", "userReview": "For the Celebrity Death Match Review Tournament, The Complete Tales and Poems of Winnie-the-Pooh versus The Divine Comedy(All citations from the Inferno are from the Longfellow translation.)To YouPaw in paw we come Pooh and the BouncerTo lay this review in your lap.Give us one of those sultry little smilesand say you're surprised!Say you can't get over it!Say it's just what you've always wantedand it's even more fun than a day at the spa(because, let's face it, hunny honey, on my salaryI couldn't afford to give you a day at the spa).Because it's all yours--Because we think... well, because you're just drawn that way!(And wouldn't old E. H. Shepard just have a fitif he could see us all together now!)Oh, wait a minute... Here's a note from the Poet too. He just wants to say: To see your face is like a foretaste of Paradise.Isn't that sweet?CANTO IIn Which Pooh and Piglet Go on an Expotition with a Very Inflooenshul PoetPooh was wandering round and round and round in the Hundred-Acre Wood. His friend Piglet was with him to keep him company. After they had been walking for some time, they looked around and noticed there was a Man walking along beside them. He had rather strange clothes on and looked lost. Piglet worried that perhaps this was Trespassers William come to reclaim his house and his sign. (You see, Pooh's little friend had told everyone that Trespassers was his grandfather, but it wasn't really true!) “Whatever will I do if I have to find another place to live?” thought Piglet. “Eeyore's house is too far away. And I don't really want to live with Owl. He tells such long stories about his relations! Oh dear!”But the Man greeted them politely enough and then added that he found himself “within a forest dark / For the straightforward pathway had been lost.”“This is the Hundred-Acre Wood,” said Pooh helpfully. \"All the Animals live hereabouts. Christopher Robin comes to visit too--when he's not Bisy Backson, that is, or imagining adventures in his room.\" The Man gazed at him with a rather forlorn expression, so Pooh added kindly, \"We get lost here too sometimes.” “Are you Christopher Robin's Papa?” asked Piglet. You see, he'd already noticed (being pretty clever for such a little Piglet) that the Man tended to talk in poetry. But it wasn't in songs or hums, like the ones Pooh made up, which was rather refreshing for a change. The Man eyed them quizzically. Perhaps he was surprised that they had never heard of him. He was a VIP after all. (That means a Very Inflooenshul Poet.) But he was polite, so he merely said that he had met some other Animals earlier that day. There was “A panther light and swift exceedingly / Which with a spotted skin was covered o'er!” “Oh,” said Pooh, smiling. “I think you met Tigger! Did he Bounce at you?”“No Pooh!” hissed Piglet. “Tiggers don't have spots. They are more stripedy-looking.” “You're right of course,” laughed Pooh ruefully. “It's true; Tigger does have stripes. So does his cousin Hobbes, for that matter. But then you know, I'm a Bear of Very Little Brain.” Piglet looked around fearfully and started to whimper. “Maybe it's a Jagular! Oh Pooh, I don't like Jagulars! Couldn't we go home?” The Very Inflooenshul Poet seemed to sympathize, for he declaimed, “Never moved she from before my face / Nay, rather did impede so much my way / That many times I to return had turned.”“Christopher Robin once told me a poem about Panthers,” said Pooh, who hadn't quite caught up yet. “It's by Mr. Nash (at least I think that's his name): “If called by a Panther,Don't anther.”Pooh laughed delightedly at his own little joke. Now it pains me to criticize Pooh, who is one of my very bestest friends. After all, I've known him almost as long as Christopher Robin. But I have to admit it is rather bad manners to do this kind of thing.But let us get back to our story.Pooh had just laughed, as I said, at his little joke. But Piglet looked startled. And the Very Inflooenshul Poet looked not only startled, but confused and offended. Pooh, realizing dimly that he had committed a rather serious faux paw, said, “Well, you can return with us if you like. It's about time I had a little something anyhow. But you'll have to be careful coming into my house. You're rather big and tall, and I'd hate for you to get stuck in my doorway.”The Very Inflooenshul Poet sighed and trudged after them. It had turned out to be a very bewildering day. He was sad because he was missing his little friend Beatrice. (She doesn't come into this Story until later, but I just thought it might be a helpful kind of thing to know.) And when Pooh mentioned having a little something--well, that made him feel even worse, because he was getting hungry too. He didn't ask for much, but the thing he really liked best was Italian food. And somehow he doubted he was going to get very hearty fare at Pooh's. He was starting to abandon hope of finding anything at all to eat, let alone making his way out of the Hundred-Acre Wood and back to Florence. \"Oh bother!\" he muttered under his breath. Then he froze in his tracks. Pooh and Piglet looked back, wondering why he had stopped. Pooh even made an impatient little gesture with one paw (not the faux one, the other one), to tell him to stop dawdling and come along. But he could not move, for he was very, very frightened. Wave after wave of terror was washing over him. In fact, he looked nearly as terrified as Piglet the day he'd been introduced to Kanga's bathtub!For the Very Inflooenshul Poet had just realized that he was starting to talk like Pooh."}, {"userName": "Riku Sayuj", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "About TranslationIt took me a while to decide on the translation to use. After a few days of research and asking around, I shortlisted Musa and Hollander. Went with Hollander since it seemed better organized. Turned out to be a good choice.The translation is fluid and easy on the ear. The Italian version is also available when you want to just read the Italian purely for the sound of verse. I am no judge of the fidelity of the various translations, but this was an easy read and that was good. There is enough difficulty in the poem without the translation adding to it. Besides, Dante’s own Italian is supposed to be written in an unaffected style anyway. To me the more important consideration in choosing the edition was the quality of the footnotes and the ease of accessing them.About FootnotesHere the notes are scholarly yet accessible with very little arcane stuff (and mind you this is a classic for which proper footnotes are essential to the reading to keep up with the erudition (classical, political, geographical, etc) displayed by Dante throughout the Comedia). As an intro to the Longfellow translation (Barnes & Nobles: The Inferno: The Longfellow Translation) says: The best advice to the reader of The Divine Comedy in general and to the Inferno in particular is to pay attention to the literal sense of the poem. The greatest poetry in Dante resides in the literal sense of the work, its graphic descriptions of the sinners, their characters, and their punishments. In like manner, the greatest and most satisfying intellectual achievement of the poem comes from the reader’s understanding (and not necessarily agreement with) Dante’s complex view of morality, or the sinful world that God’s punishment is designed to correct. In most cases, a concrete appreciation of the small details of his poem will almost always lead to surprising but satisfying discoveries about the universe Dante’s poetry has created.OrAs Ciardi’s (The Inferno) intro says:Dante demands more careful reading. Because of that demand, because of the immense and minute scholarship that has been expended upon Dante, and because too few English readers have been pointed in the right direction to him, Dante has acquired a reputation as an immensely difficult poet.It is true that Dante writes in depth. Though his language is normally simple, his thought is normally complex. But if the gold of Dante runs deep, it also runs right up to the surface. A lifetime of devoted scholarship will not mine all that gold; yet enough lies on the surface—or just an inch below—to make a first reading a bonanza in itself. All one really needs is some first instruction in what to look for. Thereafter he need only follow the vein as it goes deeper and deeper into the core of things.But of course, footnotes is not all. The footnotes are like our Virgil through these pages, the guide that is Reason. But at some point we have to surrender to the Poet to truly fathom its depth of feeling.+++After I finished Hollander I raced through the Ciardi translation, without pausing for the notes much. I also hope to read Carson (NYRB - Inferno) in the future. Earlier I had read the Inferno with Longfellow, and sad to say I had been left as scared as Dante at the beginning of his own journey after that encounter. Hollander is the one who offered to be this reader’s gentle Virgil. Overall the Ciardi translation is grander and more familiar - since a good chunk of the famous quotes and phrases come from it, and Ciardi also tries to force us into looking at the symbolism of the poetry overtly by pointing it out at the very beginning of his cantos. This is helpful, but in the final analysis, the Hollander is the better choice for the new reader. So in case you are searching for the right translation and using that as an excuse to procrastinate (like me), you can go with Hollander and get down to it.+++For ComparisonJohn Ciardi:\nMidway in our life’s journey, I went astrayfrom the straight road and woke to find myselfalone in a dark wood. How shall I saywhat wood that was! I never saw so drear,so rank, so arduous a wilderness!Its very memory gives a shape to fear.Death could scarce be more bitter than that place!But since it came to good, I will recountall that I found revealed there by God’s grace.How I came to it I cannot rightly say,so drugged and loose with sleep had I becomewhen I first wandered there from the True Way.But at the far end of that valley of evilwhose maze had sapped my very heart with fear!I found myself before a little hilland lifted up my eyes. Its shoulders glowedalready with the sweet rays of that planetwhose virtue leads men straight on every road,and the shining strengthened me against the frightwhose agony had wracked the lake of my heartthrough all the terrors of that piteous night.\n&ABANDON ALL HOPE YE WHO ENTER HERE.Henry Wadsworth Longfellow: \nMIDWAY upon the journey of our life I found myself within a forest dark, For the straightforward pathway had been lost.Ah me! how hard a thing it is to say What was this forest savage, rough, and stern, Which in the very thought renews the fear.So bitter is it, death is little more; But of the good to treat, which there I found, Speak will I of the other things I saw there.I cannot well repeat how there I entered, So full was I of slumber at the moment In which I had abandoned the true way.But after I had reached a mountain’s foot, At that point where the valley terminated, Which had with consternation pierced my heart,Upward I looked, and I beheld its shoulders, Vested already with that planet’s rays Which leadeth others right by every road.Then was the fear a little quieted That in my heart’s lake had endured throughout The night, which I had passed so piteously.\n&All hope abandon, ye who enter in!Robert & Jean Hollander:\nMidway in the journey of our life I came to myself in a dark wood, for the straight way was lost. Ah, how hard it is to tellthe nature of that wood, savage, dense and harsh—the very thought of it renews my fear!It is so bitter death is hardly more so. But to set forth the good I found I will recount the other things I saw.How I came there I cannot really tell,I was so full of sleep when I forsook the one true way.But when I reached the foot of a hill, there where the valley ended that had pierced my heart with fear, looking up, I saw its shouldersarrayed in the first light of the planet that leads men straight, no matter what their road. Then the fear that had enduredin the lake of my heart, all the night I spent in such distress, was calmed.\n&Lasciate ogne speranza, voi ch’intrate (Inf. 3.9)ABANDON ALL HOPE, YOU WHO ENTER HERE."}, {"userName": "Vessey", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/30910845-vessey", "userReview": "I realize that I need to edit one particular part, but this review means a lot to me and I would like for it to stay the way it was written, regardless of the revalations and events that took place later.Beautifully written and emotionally draining. However, this isn't simply a tale of terror. It is a philosophical and, I suppose, historical work as well. (I learned interesting historical facts). Who among us are sinners? Who are the righteous ones? Are people and deeds simply right or wrong, good and evil? Dante weeps for all the souls condemned to eternal torture. Yet, he seems rather certain that they deserve their fate. If so, why does he weep for them? If we believe someone worthy of our tears, aren't they worthy of our forgiveness as well? I believe in the importance of integrity. I admire people to whom moral is important. I am one of them and I have often been angry towards those, who I consider cruel. However, I would always choose the sinner who sins, but also forgives, over the saint who never sins, but never forgives either. I am borrowing the closing words of Steve Sckenda's review of Anna Karenina. \"Inevitably, others will judge us. May our judges look upon our love rather than upon our sin. May they crush us with mercy.\"Read count: 1"}, {"userName": "Nahed.E", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/37363150-nahed-e", "userReview": "عشت مع كلمات دانتي ليلتي أمس .. وتأملته وهو يصف حال الفلاسفة والشعراء الذين نتغني بأعمالهم طوال عمرنا وهم في الجحيمفقد كان مأواهم جميعاً في الجحيم تخيل أن تجد سقراط وافلاطون وأرسطو وأبيقور وديموقريطس وهوميروس واين سينا وابن رشد وكليوباترا وأخيل وكثير من الفلاسفة والشعراء والزعماء الذين تظل تقرأ لهم وعنهم طوال حياتك وقد أصبح مصيرهم جميعاً الجحيم !!!!شئ غريب للغاية أن يتخيل شاعر إيطالي هذا المصير لكل هؤلاءوالأكثر غرابة أن يصف لنا حالهم وسط الأهواء والرياح والنار والهوة السحيقة المظلمة التي يعيشون فيهاشئ غريب أن يأتي بكل هؤلاء المشاهير ويجعل مصيرهم الجحيمويجعل للجحيم درجات تبعاً لمدي الذنوب التي اقترفوهارحلة خيالية عجيبةرحلة ستجد فيها كل من في مكتبك من شعراء وفلاسفة قدماء في الجحيم !تُري لو كان دانتي حيا في عصرنا الحالي من كان سُيضاف إليهم من رجال عصرنا ؟"}, {"userName": "Ahmed Ibrahim", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/35008106-ahmed-ibrahim", "userReview": "استغربت حين رأيت على غلاف الكتاب أنه ترجمة د.سامي الدروبي، وما أعرفه أنه لم يترجمها، ولم تخرج ترجمته خارج الأدب الروسي.. لكن بعد أن قرأت مقدمة المترجم وجدت أن التوقيع عام 2002، ضحكت كثيرًا على كونهم لصوص أغبياء، فسامي الدروبي متوفى في أواخر السبعينات. وعندما وجدت أن الترجمة جيدة، وحواشيها مفصلة بشكل ممتاز، فعلمت أنها مسروقة، فتصفحت في ترجمة كاظم جهاد وجدت أن هذه النسخة بالفعل مسروقة منها بدون أي تغيير.دار الألف كتاب لصوص لكن بشكل أرقى من بائعين الكتب الكوبي. الكوميديا الإلهية ملحمة شعرية من أشهر وأهم الملاحم في التاريخ، بدأ دانتي كتابتها عام 1308م وأنهاها عام 1321م. تنقسم إلى ثلاثة أقسام: الجحيم، والمطهر، والفردوس أو الجنة. هي رحلة فيما بعد الحياة، بطلها دانتي ذاته.يجد دانتي نفسه في غابة مظلمة، تائه لا يعرف أين يذهب، يجده الشاعر فرجيليو صاحب \"الإنياذة\" ليكون مرشده في جولته عبر الجحيم لكي يصل إلى المطهر..\" عبري يذهب السائرون إلى مدينة العذابعبري يذهبون إلى الألم الأبديّ عبري يذهبون بين القوم الهالكين \" يعبر من بوابة الجحيم بصحبة مرشده، يبدأ رحلته في حلقات العذاب التسع، في كل حلقة هناك أناس يتعذبون، في كل حلقة خطيئة مختلفة بنوع مختلف من العذاب.. بعض الحلقات يكون بها العديد من الدوائر، مثل: \" الحلقة السابعة: الدائرة الأولى: مرتكبو جريمة العنف بحقّ الآخرين مغموسون في نهرٍ تغلي فيه الدماء. \"\" الحلقة السابعة: الدائرة الثانية: مرتكبو جريمة العنف في حق أنفسهم. المنتحرون ممسوخون إلى أشجار تتكلم وتنوح. \"\" الحلقة السابعة: الدائرة الثالثة: مقترفو خطيئة العنف بحق الله مستلقون على الرمل يتلقون مطر النار. \"هذا هو الإطار الخارجي لأحد الحلقات التي عبرها دانتي، وفي كل حلقة يقابل العديد من الأشخاص، بعضهم منبعهم الملاحم الأسطورية: الإلياذة، والأوديسة لهوميروس، وإنياذة فرجيليو، وبعض الأساطير الأخرى، كما قابل أو تحدث عن بعض الأشخاص الحقيقيين من معاصريه، أو من زمن مختلف عنه لكن ذو شهرة، ومن هذه الشخصيات: صلاح الدين الأيوبي، وابن رشد، وابن سينا.. ووضعهم في الحلقة الأولى: اليمابيس: وهي أرواح فاضلة لم تعمَّد، لا تتعرض لعذاب آخر سوى الرغبة غير المرضيّة في رؤية الله... وهكذا يرحل بنا دانتي في رحلته الخيالية عبر حلقات الجحيم. وبعد انتهاء الحلقات التسع يخرج دانتي من الجحيم، في الاستعداد للدخول إلى المطهر. وما أردت أن أختم به قولي مرة أخرى بأن الترجمة عظيمة."}, {"userName": "Foad", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "ای آن که بدین مکان داخل می شوی، از هر امیدی دست بشوی!سر در دوزخکمدی الهی، شاهکار \"دانته\" شاعر ایتالیایی، شرح سفر خیالی او از دوزخ به برزخ و سپس به بهشت است. دانته در توصیف طبقات دوزخ و بهشت، از تلفیقی از الهیات مسیحی و اساطیر رومی و تخیل خویش بهره برده است.معشوق او، \"بئاتریس\" که ساکن بهشت است، یکی از ارواح را (روح \"ویرژیل\"، شاعر رومی) می فرستد تا دانته را راهنمایی کرده، از دوزخ نجات دهد و به بهشت برساند. برای این سفر، دانته باید از طبقات دوزخ یک به یک پایین برود و از میان ارواح معذب بگذرد تا در قعر دوزخ، به دریچه ی برزخ برسد.چرا کمدی؟در ادبیات آن دوره، اشعار دو دسته بودند: اشعاری که زبانی فاخر و پایانی فاجعه بار داشتند، \"تراژدی\" نامیده می شدند.و اشعاری که زبانی عامیانه و پایانی خوش داشتند، \"کمدی\".و چون کمدی الهی هم زبانی عامیانه دارد و هم پایانی خوش (رسیدن به بهشت)، خود دانته بر آن نام \"کمدی\" نهاد که بعدها به \"کمدی الهی\" مبدل شد.جغرافیای دوزخبنا بر کمدی الهی، تمام سه مرحله ی دوزخ، برزخ و بهشت، بر روی زمین هستند.بر اساس جغرافیای قرون وسطا تنها یک چهارم زمین قابل سکونت بود که از شرق به هند، از غرب به اسپانیا و از جنوب به استوا محدود می شد و مرکز آن، شهر مقدس اورشلیم قرار داشت، و باقی زمین همه آب بود. دوزخ، در زیر سطح این نیمکره ی مسکونی قرار دارد و بهشت، دقیقاً در زیر اورشلیم، در آن سوی کره ی زمین.دوزخ، حفره ای است به شکل قیف که بر اثر سقوط مهیب شیطان از عرش الهی بر زمین ایجاد شده است. شیطان، خود، در قعر این گودال (در مرکز زمین) تا کمر در زمین فرو رفته است و باقی گنهکاران، در طبقات پلکانی نه گانه ی آن عذاب می شوند.﻿"}, {"userName": "Alp Turgut", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/6891472-alp-turgut", "userReview": "Dante'nin Homeros, Ovidius ve Vergilius gibi yazarların mirasını kusursuz bir şekilde devam ettirdiği \"Divine Comedy / İlahi Komedya\", yazarın şair olarak tam anlamıyla şov yaptığı bir başyapıt niteliğinde. Zaten yazara yolculuğunda Vergilius'un eşlik etmesi başlı başına referans. Eserin ilk bölümü \"Inferno / Cehennem\" ile kusursuz bir politik alegoriya imza atan Dante, okuyucuyu sadece Cehennem'in dokuz katına yaptığı yolculuğa ortak etmekle kalmıyor aynı zamanda Platon'dan Brutus'a kadar birçok ünlü kişiyi de bu yolculuğa ortak ederek eğlenceli bir destan okuyucuya sunuyor. Dante'nin özellikle Cehennem'in son katmanlarında İslam peygamberiyle karşılaştığı bölümün fazlasıyla dikkat çekici olduğunu belirtmeliyim. Okudukça hayran kaldığınız eserin eleştiri odağındaki yer ise Dante'nin memleketi Floransa. Bu yüzden, İtalyan tarihini ilgilendiren bazı yerlerde dikkatiniz ister istemeden dağılabiliyor. Buna rağmen, anlatmak istediğini eksiksiz biçimde okuyucuya anlatan kitap, bir sonraki bölüm olan \"Araf\" için sabırsızlanmanıza neden oluyor. 20.08.2016İstanbul, TürkiyeAlp Turguthttp://www.filmdoktoru.com/kitap-labo..."}, {"userName": "Γιώργος", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/22671170", "userReview": "uscimmo a riveder le stelle (εβγήκαμε να ξαναδούμε τ' άστρα)Έτσι τελειώνει η Κόλαση, με τον Δάντη και τον οδηγό και δάσκαλό του Βιργίλιο να τελειώνουν το ταξίδι τους βγαίνοντας από τον αναποδογυρισμένο κώνο της Κολάσεως στο νότιο ημισφαίριο της Γης. Μου είναι πολύ δύσκολο να μιλήσω για το πρώτο μέρος της Θείας Κωμωδίας. 34 άσματα, 4.720 στίχοι. Γραμμένο πριν 7 αιώνες. Περιγράφει το ταξίδι του Δάντη στην Κόλαση του Χριστιανισμού όπου τιμωρούνται με σκληρότητα οι κολασμένοι από τον Δίκαιο μα καθόλου Πανάγαθο Θεό. 9 κύκλοι λοιπόν και ο καθένας περιέχει σωρό κολασμένους με αποκορύφωμα τον Εωσφόρο, τον Έκπτωτο Άγγελο που έχει τοποθετηθεί στο κέντρο της Γης και βασανίζει ο ίδιος τον Ιούδα, τον Βρούτο και τον Κάσσιο.Αυτά τα γενικά για το πρώτο μέρος του έργου, την Κόλαση. Αν και ο Δάντης ήταν αναμφίβολα ένας δεξιοτέχνης του λόγου και της Ποίησης, καθώς κατάφερε με μέτρο και ομοιοκαταληξία να παραστήσει με τρομερή ενάργεια τον Άδη και όλο αυτό να το κάνει σε μια γλώσσα που βρίσκονταν τότε στα σπάργανα, έχω κάποιες ενστάσεις, όχι φυσικά για το έργο του και τη σημασία του, αλλά για τις δυσκολίες που θα μπορούσε να έχει ο αναγνώστης του 21ου αιώνα για να απολαύσει και να κατανοήσει το έργο. Είναι γνωστό ότι ο Δάντης συνθέτει το ποίημα αυτό όντας εξόριστος από την αγαπημένη του πόλη, τη Φλωρεντία. Είναι, επομένως, λογικό να αναφερθεί σε πρόσωπα της εποχής τα οποία αντιπαθούσε ή του ήταν γνωστά. Ο σύγχρονος, λοιπόν, έχοντας ανάμεσα σε αυτόν και τον ποιητή ένα χάσμα 7 αιώνων χάνει το πάθος με το οποίο τιμωρεί ή ευσπλαγχνίζεται τους ανθρώπους ο Δάντης στο δημιούργημά του. Οι υποσημειώσεις δεν βοηθούν και τόσο καθώς οι ξερές πληροφορίες για τα διάφορα πρόσωπα δεν αναπληρώνουν το χάσμα αυτό. Η δεύτερη δυσκολία που συναντά ο μη ιταλόφωνος αναγνώστης είναι το ότι χάνει την ποιητική τεχνική που χρησιμοποιεί ο Δάντης, την τερτσίνα και την ομοιοκαταληξία, κάτι εντυπωσιακό για ένα έργο συνολικά 14.233 στίχων.Εξαιρουμένων των παραπάνω εμποδίων που μπορεί να αντιμετωπίσει κανείς, για τα οποία φυσικά δεν ευθύνεται ο ίδιος ο ποιητής ο οποίος χρησιμοποίησε τεχνηέντως την πραγματικότητα και τις προσωπικότητες της εποχής, αλλά ο Πανδαμάτωρ Χρόνος, είναι αδιαμφισβήτητο ότι η «Κόλαση» είναι ένα έργο ύψιστης ποιητικής αξίας. Με απόλυτη οργάνωση και δομή, ο Δάντης δίνει σάρκα και οστά σε κάτι τόσο αφηρημένο που δε θα μπορούσε να συλλάβει ποτέ ο πήλινος Νους μας, καθώς είναι Άυλο και για πολλούς ανύπαρκτο. Δείχνει την πορεία του αμαρτωλού ανθρώπου ο οποίος «σε δάσος βρέθηκε σκοτεινιασμένο / γιατί είχε το σωστό δρόμο χαμένο» τελικά φαίνεται να κατανοεί την κατάστασή του και να οδεύει προς τον Καθαρμό αφού όμως πρώτα περάσει από την απόλυτη φρίκη των φοβερών αμαρτημάτων. Δεν ξέρω κατά πόσο εγώ ο άπειρος κατανόησα το μεγαλεπήβολο αυτό έργο αλλά τουλάχιστον το απόλαυσα και πέρασα από τον καταρράκτη του ποιητικού λόγου ενός μεγάλου δημιουργού, ο οποίος ευτυχώς έχει και συνέχεια.Η μετάφραση του Γιωργή Κότσιρα από τις εκδόσεις Ζαχαρόπουλος είναι αρκετά καλή, κατανοητή, έμμετρη και με πληθώρα σημειώσεων. Ένα μόνο λάθος εντόπισα το οποίο θα ήθελα να αναφέρω εδώ γιατί είναι σημαντικό για την κατανόηση του κειμένου. Στο 11ο Άσμα, σελ. 91, στίχος 82 ο Κότσιρας μεταφράζει: «Κακία, ακολασία και κτηνωδία». Στον αμέσως επόμενο στίχο (83) λέει ο ποιητής «κι η πρώτη», και ενώ ο Δάντης αναφέρεται στην ακολασία (incontenenza) ο αναγνώστης καταλαβαίνει την κακία και δημιουργείται σύγχυση για όσα ακολουθούν. Κατά τα άλλα δεν εντόπισα άλλα θέματα.Εύχομαι να απολαύσει το Αιώνιο Έργο όποιος αποφασίσει να βυθιστεί σε αυτό!"}, {"userName": "Joseph", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/1281880-joseph", "userReview": "The Inferno or Dante Alighieri need little introduction. Most people are familiar with the Divine Comedy regardless of their religion or lack of one. The Divine Comedy is one man's journey with his guide, through Hell and Purgatory, Virgil. Beatrice is his guide in heaven. The Inferno is the journey through the nine layers of hell and, to many, the most interesting of the three journies. Purgatory is a boring place by design and Heaven is well, heaven.I always felt The Inferno contained the best place to spend eternity, but not in an AC/DC \"Hell Ain't a Bad Place to Be\" way. The outermost layer is Limbo and it is the place for the unbaptized and the noble pagans -- Socrates, Plato, Saladin and others. Here Dante answers his days equivalent of is Gandhi in Heaven or Hell? He was a great person, wise, peaceful, a good leader so he should be in heaven, but he is not Christian so how can he be any place but Hell? Dante takes care of this in Limbo. It's a part of Hell, but the company there is great. There is also a chance to leave Limbo as Jesus and a few other Biblical characters did by the intervention of God. As one descends the circles, each for a particular offence, lust, greed, wrath, heresy, violence and so on, the punishments increase in severity until the inner circle of hell where the three greatest enemies of man are gnawed on by Satan. The three are a bit dated but fitting for Dante's time. Who else resides in Hell? Dante's enemies. If you can't get even in life; get even in eternity or your creation of it. Dante's \"The Divine Comedy\" was unique in its style the rhyme scheme reflective of the Trinity and the number 100 -- the perfect number. His work is divided up into three sections of thirty-three cantos with a single cantos introduction making 100 cantos. Three is used through the book three times three layers of hell and so on. The Inferno is filled with symbolism and hidden meanings. One can spend a great deal of time studying this story not only for its literary value but also for its political and religious history. Also, unique Dante wrote in Italian instead of the accepted Greek or Latin. This did help make Italian a literary language with Petrarch soon to follow in that tradition. The reason why they wrote in Italian is not well explained, but perhaps had more to do with regional identity. The idea they wrote in Italian so more people could read it is not practical. The educated were literate and to be educated one would learn Latin and Greek. The literates were the rich or the scribes who copied books. Books were very expensive meaning again only the rich and educated could read. The literacy rate at the time was under 10%.What makes the Dover edition special is the inclusion of Gustave Doré engravings. I first saw Doré’s engravings in a copy of \"The Rime of the Ancient Mariner\". They were haunting and his work fits into The Inferno well. The engravings add an extra touch of dread and reinforce the entrance sign of Hell “Abandon all hope, ye who enter here!” This edition is also translated by Henry Wadsworth Longfellow who first introduced The Divine Comedy to America in 1867. Well done and very worthwhile addition to anyone’s library."}, {"userName": "Mary Ronan Drew", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/2986995-mary-ronan-drew", "userReview": "4 Reasons to Read Dante's Inferno1. To finally figure out the difference between the Guelphs and the Ghibellines. Dante was a Guelph.2. To discover why Constantine made his famous donation.3. To learn some new and ingenious ways to torture your enemies. Dante is very imaginative in this regard.4. To find out what happened to Potiphar's wife, Mohammed, Ulysses, Atilla the Hun, Cleopatra, and Helen of Troy. We meet them all in The Inferno.I recommend Dorothy Sayers' translation because of the excellent introduction and notes."}, {"userName": "Hamad", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/54464244-hamad", "userReview": "I never thought I'd read this but a friend gave it to me as a gift and I can't stop myself now.Let's venture into HELL -quite literally!"}, {"userName": "Sura  ✿", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/11383902-sura", "userReview": "في البداية لا يمكن انكار ان الترجمه سلبت الكثير من هذه الملحمه الشعريه لكن انصح بترجمه كاظم جهاد فهي الافضل وتحتوي على الاجزاء الثلاثه , بمجلد واحد تعكس هذه اللوحه الرائعه اضطرابات الوضع السياسي والديني في تلك الفتره , وسيطرة الكنيسه وفسادها انذاك لذا نرى دانتي يترنح بين الشاعر العاطفي الميال الى الرحمه وبين رجل الدين المتعصب الذي يحكم على من اعتنق دين غير المسيحيه بالعقاب في الجحيم , حتى وان كان نبيا -قبل او بعد المسيح- فهو يواجه هذا المصير.وهاهو يرمي خصومه الذين عاصروه - وحتى من لم يعاصرهم لكن يختلف معه في الفكر والعقيدة- في الجحيم . عايش دانتي الفتره التي حكم فيها المسلمون الاندلس , وكانوا على مشارف فرنسا وهذا يفسر عدائية دانتي لهم وللنبي محمد صلى الله عليه وسلم بالاضافه الى بعض افكار الكاتب الغير منطقيه , او غير اخلاقيه يذكر في احدى الاناشيد كيف التقى فلانه و فلان- الضحك ممنوع !عفوا لكن فعلا لا استطيع حفظ الاسماء اللاتينه الصعبه- حيث ان فلانه كانت متزوجه لكن راودت اخو زوجها عن نفسه وشغفته حبا لذا قتلهما زوجها - واخو العشيق- وهنا دانتي يتعاطف معهما ويثني على حبهما ليقع مغشيا عليه ! انا ضد القتل وضد جرائم الشرف - ان صح التعبير- لكن هي ليست مجرد خيانه , فقد زنا العشيق بزوجة اخاه لكن دانتي لا يرى اي قبح في هذا الفعل بل يتعاطف ويبكي . ادرج الكثير من تفاصيل الاساطير اليونانيه التي -رغم اني احب قصصها- اعجز عن حفظ اسماء ابطالها , تشكل الاسماء حاجزا بيني وبين هذه الاساطير  لا اعلم ان كان دانتي يحفظها عن ظهر قلب ام كان يستعين بالمصادر فهو عمل عبقري يستحق الاحترام في الحالتين . \n قصة تذكرني بأخرى مشابهة لأحد الخلفاء العباسيين الذي صنع له احد مساعديه فرناً ذي اشواك يوضع فيه الضحيه ويترك للموت والعذاب , وبعد خلاف بين الخليفه والمساعد وضع الخليفه غريمة في الفرن , نعم في فرنه الذي صنعه بنفسه ترك ليموت لمده ثلاثة ايام . وهذا يذكرني بمقولة لأحمد مطر : هذا يقتل بالإنجيل وهذا يقتل بالتوراة وهذا يقتل بالقرآنلا ذنب لكل الأديان , الجرم بطبع الانسان تشير بعض الروايات انه قد سرق فكره (رسالة الغفران) لأبي العلاء المعري . لا اعلم صحه الامر ولن اقحم نفسي بالبحث في هذا الخصوص ,.. فالنار حق والجنه حق ودانتي نفسه يعرف عذاب اللصوص ووضع لهم خندق خاص في الحلقه الثامنه! فالخوض في هذه المواضيع لا فائدة منه والحساب لا مفر منه  صدع راسي .. لكنه عمل رائع فعلا مجددا, قرأت العمل بترجمه كاظم جهاد والاجزاء الثلاثه تقع في مجلد واحد لكني اود ان اقيم كل جزء على حده ."}, {"userName": "Sarah ❤", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/10822409-sarah", "userReview": "I really liked this book because it was just so interesting to learn all the different levels of hell, whose in each, and what the punishment is for every sin.Here’s all the levels:Here is a good map of all the people there:1st Circle of Hell: LimboSecond Circle of Hell: LustThird Circle of Hell: GluttonyFourth Circle of Hell: GreedFifth Circle of Hell: WrathSixth Circle of Hell: HeresySeventh Circle of Hell: ViolenceEight Circle of Hell: FraudNinth Circle of Hell: TreacheryWell I’m not sinning anymore, no way am I going to Dante’s Hell!So for all you sinners out there..."}, {"userName": "Debbie", "userReviewDate": "Jan 26, 2009", "userURL": "http://www.goodreads.com/user/show/854147-debbie", "userReview": "I'm not sure where the copy of the book came from. The copyright is one year before I was born, but I don't remember picking it up in a used book store. But I guess that's neither here nor there.I wish I could honestly check off 5 stars and say that my eyes were opened. That I really felt transformed by having read this classic of literature and that I will make it point to re-read it every year on the anniversary of my having discovered the error of my ways in not reading it at age 5.But I can't.It was a long slog for me. Things did pick up when I quit reading the summary that preceded each canto. This translator gives said summary, then the canto itself, then the footnotes explaining all the people and places that would have fallen into the dark recesses of history had Dante not immortalized them. Irony? Because Dante obviously thinks very little of most of the people he populates hell with. And that leads to my biggest problems. This is a \"burn book\". A centuries old burn book, but still. \"Here are all these people who did what I consider terrible things and here's what I hope happened to them in the afterlife.\" If the book hadn't been couched in religious (and a very specific religion at that) terms, I don't know that is would have lasted as long as it has. So, while I admire the structure of the work, the discipline it must have taken to adhere to such a rigourous format, that's about all I admire. I have the other two thirds of the whole. I'll probably tackle them just to be able to say I read the whole Comedy. Maybe things lighten up a little and it won't feel like such a punishment for this reader."}], "description": "Guided by the poet Virgil, Dante plunges to the very depths of Hell and embarks on his arduous journey towards God. Together they descend through the twenty-four circles of the underworld and encounter the tormented souls of the damned - from heretics and pagans to gluttons, criminals and seducers - who tell of their sad fates and predict events still to come in Dante's life. In this first part of his Divine Comedy, Dante fused satire and humour with intellect and soaring passion to create an immortal Christian allegory of mankind's search for self-knowledge and spiritual enlightenment.", "title": "Inferno\n      \n          (La Divina Commedia #1)", "url": "https://www.goodreads.com/book/show/15645.Inferno__The_Divine_Comedy__1_", "average": 3.99, "cover": "https://images.gr-assets.com/books/1520255019l/15645.jpg", "reviews": 3946, "authors": [{"url": "https://www.goodreads.com/author/show/5031312.Dante_Alighieri", "name": "Dante Alighieri"}, {"url": "https://www.goodreads.com/author/show/275033.Anthony_M_Esolen", "name": "Anthony M. Esolen"}], "type": ["Classics", "Poetry", "Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/15645.Inferno", "http://www.goodreads.com/book/show/19155.The_Divine_Comedy_Vol_1", "http://www.goodreads.com/book/show/150027.The_Divine_Comedy", "http://www.goodreads.com/book/show/2357667._", "http://www.goodreads.com/book/show/723016.The_Inferno", "http://www.goodreads.com/book/show/19152.The_Divine_Comedy_I", "http://www.goodreads.com/book/show/15647.The_Inferno_of_Dante", "http://www.goodreads.com/book/show/306150.The_Inferno", "http://www.goodreads.com/book/show/29637805-infierno", "http://www.goodreads.com/book/show/175251.The_Inferno", "http://www.goodreads.com/book/show/19150.Inferno", "http://www.goodreads.com/book/show/15648.The_Inferno", "http://www.goodreads.com/book/show/19163.Inferno", "http://www.goodreads.com/book/show/10642212--", "http://www.goodreads.com/book/show/31141066--", "http://www.goodreads.com/book/show/3782420", "http://www.goodreads.com/book/show/18856169-lahi-komedya", "http://www.goodreads.com/book/show/23249066", "http://www.goodreads.com/book/show/27778116-the-inferno", "http://www.goodreads.com/book/show/569284.The_Inferno", "http://www.goodreads.com/book/show/6656.The_Divine_Comedy", "http://www.goodreads.com/book/show/19164.Purgatorio", "http://www.goodreads.com/book/show/32812.Paradiso", "http://www.goodreads.com/book/show/540422.Vita_Nuova", "http://www.goodreads.com/book/show/13634127-la-divina-comedia-la-vida-nueva"]}