{"ratings": 3410, "userreviews": [{"userName": "Mogsy (MMOGC)", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/4379514-mogsy-mmogc", "userReview": "3 of 5 stars at The BiblioSanctum http://bibliosanctum.com/2016/01/03/y...2015 was a great year for YA fiction, with lots of new ideas and debut authors breaking onto the scene. When S. Harrison’s Infinity Lost popped up on my radar late in the fall, I thought it sounded like an interesting book to check out.The story takes place in the near future, following the life of a girl named Infinity “Finn” Blackstone. Her father, CEO of Blackstone Technologies, is one of the richest and most powerful men in the world, but while his company’s world-changing services and products are nearly ubiquitous, Richard Blackstone himself remains a highly reclusive figure. Not even Finn has ever met him. Raised by her father’s staff, all she knows about the man is what others have told her and what she sees on the news.Finn is seventeen when she and her classmates from boarding school are taken on a field trip to visit the Blackstone headquarters. Elated, Finn believes this could finally be her chance to meet her father and confront him with all her questions. Lately, she has been having strange dreams, even though a part of her knows they are more than that. The visions feel like memories, but how can that be when she cannot remember actually experiencing them herself? Finn is determined to find some answers, and she believes Richard Blackstone is the key.Beyond that, I really can’t say more; suffice to say, the plot takes a surprising number of turns and ends up in a place I never saw coming, and if I give away anything else I would be hovering dangerously close to spoiler territory. What I can say is that Infinity Lost was a really quick read due to its relatively modest page count, which along with being jam-packed with action and tight storytelling made this one a really fast-pace and entertaining read. I also thoroughly enjoyed the future setting which featured some innovative tech, some of which were pretty farfetched but nonetheless very cool. The book also stood out to me because of its departure from certain YA norms, such as downplaying any romance (at least in this first book) though quite honestly, the plot moves along so quickly that there’s hardly any room for unnecessary drama.That said, while a lot of things in Infinity Lost worked for me, there were a few issues that tripped me up as well. First, you should know that technically, the “real story” doesn’t start until late in the novel, because the first half contains almost nothing but random and sometimes confusing flashbacks. Finn has these dream-memories, and the time jumps can get very jarring and tiresome after a while. Second, I’m a bit disappointed that we didn’t get to see more of the wider world, though this is mainly due to the limitations of looking through Finn’s eyes in the first-person. She’s being kept in the dark, and so by extension, we are as well.Third—though this is not a problem for me personally, I still figured I should mention it—reading this book was a little like watching a movie that starts off PG-13, but then ends with a full-blown R rating. The final chapters are a veritable bloodbath, with heads popping off, bodies being blown into red mist, etc. all brutally described in vivid and graphic detail. I’ve read a lot worse of course, but I was still shocked at the lack of warning; the beginning held absolutely no clue that this book would end in such over-the-top, indiscriminate violence. If that kind of content turns you off, I would approach this with caution.But my biggest issue was the cliffhanger. In this day and age of seemingly nothing but YA trilogies and series, I grudgingly accept the need for them, but at the very least I think each book should still contain the resolution to its main conflict. I don’t like it when a book ends abruptly in the middle of a scene; it’s clumsy and awkward and I end up with more questions than answers, which is not a good feeling. Unfortunately, this was the case here. There were too many loose ends, and the book did not in any way feel complete.Even in the face of all these issues though, I liked the book well enough that I would be open to continuing the series, if nothing else to find out what happens to Finn. Infinity Lost felt very much like a long intro, and I feel confident that the meat of the story will be in the sequel Infinity Rises, out January 5, 2016."}, {"userName": "Joy", "userReviewDate": "Oct 18, 2015", "userURL": "http://www.goodreads.com/user/show/22660848-joy", "userReview": "Infinity is REALLY lost! The back and forth realities of past and present make for a confusing read. The molestation of Finn by a group of men is sickening.I could not finish this. I am so glad that it was free with prime, though even zero dollars is almost too much to pay for such drivel."}, {"userName": "Dan", "userReviewDate": "Oct 30, 2015", "userURL": "http://www.goodreads.com/user/show/5786398-dan", "userReview": "Got this book for free through Amazon Prime, thank goodness I didn't waste any $s on it. The concept is promising but the plot just gets dumber and dumber as the book goes on, not to mention the gratuitous violence which really does nothing to enhance the story. This was book 1 in a trilogy which I will not be reading books 2 and 3."}, {"userName": "Daniel Kelly", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/16611460-daniel-kelly", "userReview": "What a fascinating read this was. I picked it up free as the October Kindle First book, and stayed up late, to keep reading. I immediately added the sequel to my wishlist. I don't want to add any spoilers, but if you read the blurb and it sounds interesting, grab it immediately!"}, {"userName": "Z-squared", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/13235258-z-squared", "userReview": "This is an imaginative, fast-paced cross between Divergent and the really morbid parts of Charlie and the Chocolate Factory. Things get suuuper bloody toward the end, which makes this a book I would actually cringe to give a teenager but a fine read for us old fogies that still read YA. Lots of readers complained about the split timeline/flashback narrative, but I think it was actually a strength of the book. At no time did I have any trouble following the action, nor did I ever get confused as to which timeline I was currently reading. The biggest weakness, IMO, was the worldbuilding. The opening is a clunky infodump with a premise that is too weak even for YA readers. I would have forgiven that eventually, except then the author repeated most of that info again later in two more repetitive infodumps that didn't add anything further to the weak foundation. Worse, not a lot of work was put into describing the universe as a whole. It wasn't even until three quarters through the book that I even determined what continent we were in. Just because the protagonist leads a relatively sheltered life doesn't mean she would be ignorant of basic facts about the world around her. Moreover, half the fun of dystopian fiction is determining how the fictional universe went off the rails--and what that says about the real world. With so little work put into showing the reader this fairly basic building block of the genre, I feel a smidge cheated. Where's my scathing social commentary masquerading as a silly sci-fi shoot em up?I waffled between three and four stars. I finally rounded up because I thought it was being unfairly skewered in reviews. I think a lot of people, myself included, got this book free from an Amazon promotion. The problem with giving away a book free to such a wide audience, though, is that people end up reading it who never, ever should have. So if you don't like YA, sci-fi, M. Night Shyamalan-style plot twists, or gratuitous violence, this book is not for you."}, {"userName": "Chelle", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/25329088-chelle", "userReview": "This book had so much potential but fell painfully flat. It was boring. It was predictable. Worst of all, it was full of really cheesy stereotypes. The bitchy blonde popular girl. The two bumbling idiot jocks. The quiet genius computer hacker. The cute new trouble-maker. Seriously? The author couldn't come up with better characters? Also, in a world where people have their perfectly-functioning organs replaced with super-efficient bionic ones at the age of 30, why are there still girls having asthma attacks? I can't figure that one out. Some of the writing was actually cringe-worthy. What self-respecting, high-ranking military colonel would ever say something like \"What a crock. We'll find you, mister computer hacker.\" Really? No, really. Don't even get me started on the completely gratuitous violence. It seems as if the author is being overly disgusting just for the sake of being disgusting. I have read some very disturbing and violent books, but this was just over-the-top and didn't really add anything to the story.I would not recommend this book."}, {"userName": "Lindsay Nixon", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/3493901-lindsay-nixon", "userReview": "2.5 stars. AI (robots) and light sci-fi meets YA. My experience reading was \"okay... yawn... I might quit.. OH WAIT...never mind... boring boring... oh wait... never mind... meh... meh... is it over? Oh well maybe I'll... nah\"For the most part it was a snooze, suffering from a confused plot. It did pick up at parts and catch my Attention but it was always short lived. By the end I was just finishing it to finish it and there was no way I'd continue with the series."}, {"userName": "Meg Hammond", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/32825847-meg-hammond", "userReview": "AwfulShallow character development, terribly written narration, boring dialogue, predictable storyline..I didn't realize this was a young adult novel but what makes YA novels good is that they don't necessarily read like a 16 year old wrote it. This is not a good novel of any sort. I will not be reading the rest if the trilogy."}, {"userName": "Michael", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/6956574-michael", "userReview": "The Best of the Amazon FirstsThis is the best of the Amazon Firsts I have read and it reminds me of what I always liked best about science fiction. Finn is a well realized character, and the plot is compelling, always keeping what is going on a little out of reach...even at the end."}, {"userName": "Mika Wallenius", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/62800335-mika-wallenius", "userReview": "Really fun read. I just wish it didn't end like a TV show. I mean, really? In the very middle of an action scene?"}, {"userName": "Lizzie", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/39446933-lizzie", "userReview": "The idea was ok, but from the very beginning I was aware of what was happening to our main character. The story was slow. It jumped back and forth in time. The characters were flat. By then end of the story, not much had really happened. It went into my boring/delete folder. A free prime read that I only finished because I kept hoping it would get better."}, {"userName": "Christopher", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/12306131-christopher", "userReview": "decent story that gets muddled by really poor narrative choices (repeated flashbacks with jarring transitions makes it difficult to follow along and know which timeline you're actually it).Infinity Blackstone is the daughter of the wealthiest and most powerful man on the planet. The CEO of Blackstone technologies--kind of Facebook/Apple/Google/Raytheon all in one. Infinity has apparently NEVER met her father has been raised by a kind but gruff former soldier/bodyguard and a cruel nanny. Infinity seems strangely OK with this (which is a little odd to accept as an opening premise but whatever). Things start to go sideways when we hear snippets of conversations about the danger Infinity poses to the world. As time goes on, Infinity learns more about herself and why so many people seem to fear her. It's not a BAD plot, per se. But the story jumps around WAY too much. We get climactic battle scenes early in the book with a teenaged Infinity followed by a high school field trip and then back to being a precocious six year old. While there's ostensibly a \"reason\" behind these jump-arounds (many are presented as vivid dreams), it's quite difficult to track which is the actual present POV timeline and what knowledge THAT iteration of the character actually posseses.It's also a very short book so the plot elements come at you fast and often without a lot of buildup or explanation. The audiobook takes a day to get through so it's not like a major time investment. Decently entertaining if flawed."}, {"userName": "Merredith", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/1583037-merredith", "userReview": "It was a hermit weekend, most people were away for Thanksgiving and such, and I was pampering myself for my birthday weekend by being lazy. I woke up, didn't even get out of bed, chose a book from one of the many unread ones living in my kindle, and read the whole thing that day. Granted, it's not a terribly long book, but it's not often I do that anymore. In this book, most everything is made and owned by one company. They make the best phone, computers, search engine, etc. The main character is the daughter of the reclusive man who owns and invented everything. For the first years of her life, she was home schooled and locked away on his estate, but now she goes to a boarding school where no one knows who she is, except her roomie/best friend, who happens to be the daughter of the other company. One day, the best students get to go on a field trip and be the first school to see inside the company's factory complex, which is akin to a tour by Willy Wonka. Only the thing is, this girl doesn't even know her dad. He's always hired other people to take care of her. And throughout, we flash back and forth from her childhood to now, and it seems almost like they're too different people. Some things happen by the end, and I won't give it away, but it was adventurous and interesting enough for me to preorder book number two. A solid and entertaining sci fi YA novel starting out The Infinity Trilogy."}, {"userName": "Jeanne", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/7743315-jeanne", "userReview": "[(It's unclear who is good, who is not; expect more flip flops in the next books) (hide spoiler)]"}, {"userName": "Kat", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/812731-kat", "userReview": "The writing was decent and well paced. The reason I only gave it two stars is the ending or lack of ending. I'm absolutely fine with vague endings, but this was not vague and not really an ending. This is book 1 or a trilogy (apparently) and the end of this book felt like the author just decided to stop book one here in order to make the reader buy book 2 to get the rest of the story. In my opinion, each book in a trilogy (or any series) should stand completely on its own even if the overall arc isn't completed until the final book. I do not feel that this was a complete story in book 1."}, {"userName": "Jennifer", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/43355129-jennifer", "userReview": "Boring waste of time!This book started out with a good idea but promptly descended into patchwork timelines & story prompts. It felt to me like a TV series that finds out it is losing episode amounts and ending at the end of the season!"}, {"userName": "Dave Flodine", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/46960804-dave-flodine", "userReview": "This is not a finished book. It's not a self contained story and ends upon a character realization. I would have liked to read the whole story, but if it's going to be chopped up and sold in peace meal fashion, I can find other books."}, {"userName": "Jesse", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/46343531-jesse", "userReview": "Excellent overallSlow start but by the end I couldn't put it down. Well written and interesting despite a relatively transparent plot."}, {"userName": "Erika", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/9623000-erika", "userReview": "[Finn is having strange dreams, and her roommate is acting strange. They are preparing to go on a field trip to Blackstone Tech and she has conflicting emotions, since the father she never sees is supposed to be there and she doesn't know if she will get to see him. They arrive at the facility and they are received by a woman wearing her mother's face. She passes out, and then discovers that the woman was an android. Every time she dreams and even when she passes out the dreams, that she is starting to think are memories, show her things in her life that she doesn't remember or remember in a different way. During the next step in the tour, she is attacked by a construct, that claims to be her Nanny Theresa, she tries to kill her, and she passes out again, recovering another memory where she watches Theresa dying. She wakes up and start to panic, trying to get out of there and gets into a fight. The chaos causes her and another five classmates to get detention. Her friend Bit is still acting weird, and she doesn't know what's happening to her and the memories are starting to affect her, she even sees herself killing a person. While they are in detention, they watch as the rest of their classmates are witnessing the rest of the tour, the AI that claims to be Nanny Theresa takes control of a war machine and starts killing students while trying to get to Finn. After killing most of her classmates, she uses the video feeds to find Finn in detentions and goes after her, then she takes control of one of the robots in Finn's room and tries to kill her again, when she is about to die, her personality changes and Infinity takes control, showing that all the dreams were indeed memories, only not from her, but another personality, that was in fact in contact with Bit. So Bit knew about the double personality stuff and knew both of them. So after Infinity takes control, they still have to get out of there.  (hide spoiler)]"}, {"userName": "Reanne", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/5508082-reanne", "userReview": "[It also raised several questions and made me really want to know the answers. Such as:– What is Finn? Genetically- or technologically-modified human? Android? Clone?– For what purpose was she created/modified?– Is her father really her father or just her creator? Is he human? Does he even really exist?– Is she ever going to meet him? Why has she never met him yet?– Why does the crazy lady want her dead?– Is her childhood friend really dead?The big problem here is that none of these questions are answered, not even the one about the villain’s motivation. I know that, as the first book in a series, it’s not necessary that this book answer all the questions it raises, but it really should provide some answers.The plot of this book doesn’t feel like a complete story. In fact, I’m pretty sure it’s not. Here’s my own summation of what happens in this book: Finn finds out her class field trip has been changed at the last minute to go to her father’s company rather than wherever it was going before. It’s strongly hinted that this is because of interference from her hacker best friend. They go on the field trip. They see a bunch of “cool” stuff (really, it’s pretty over-the-top). All hell breaks loose and lots of people die, but Finn mostly just watches all that happen on a video screen from a room in another part of the facility. She has a brief fight scene with the villain. Cliffhanger non-ending. Interspersed through the first half or so of the book are Finn’s dreams/memories showing some stuff from her life growing up.It starts out strangely, with Finn floating in nothingness which morphs into a dream, but it’s really a memory. These memory-dreams keep coming back through the whole story, revealing her backstory to us (and to her, as she was previously unaware of many of the things she experiences in these memories). One problem with this is that it means Finn is constantly falling asleep, getting knocked out, fainting or otherwise becoming unconscious. Which makes her seem a bit narcoleptic. I mean, think about reading a book about a narcoleptic character, where the narcolepsy isn’t really a major part of the plot. It’s kind of weird. Also, aside from naturally falling asleep, it seems like that kind of thing happening that frequently could not be healthy for one’s brain.Anyway, the memory scenes are actually some of the more exciting parts of the book. For a very large portion of the story, the present day stuff is kinda dull. The entire present day plot is pretty much that her school class takes a field trip to a technology company and it all goes horribly wrong. To me, that’s just not enough plot for an entire novel. The constant interruption of the present day plot by the memories was a bit jarring and kind of prevented me from investing fully in the plot.One specific thing that didn’t make sense, plot-wise, was that the field trip was evidently the result of Finn’s friend Bit hacking the Blackstone system. Considering the tour guide later says that he was surprised to see the tour on his schedule, that it was only the fourth tour ever given, and that it was the first for students, I have a really hard time believing the tour guide would not check this oddity with his superiors. And, if they were going to give a tour, considering the top-secret nature of the facilities, I’d expect them to want to know the identities of everyone attending prior to their arrival. And in doing so, I’d expect them to know that one of the students (Bit) is the daughter of the owner of Blackstone’s biggest competitor and therefore, recording devices or not, would be extremely unlikely to show her (at least) their secrets. So … yeah, basically I found the whole setup of what goes on in the present day part to be unbelievable.Tone-wise, most of the book goes along like a pretty typical YA sci-fi. There’s a normal girl with a best friend doing a fairly normal thing (field trip). As it goes on, we find out that there’s more to her past than it seemed, and she is just now becoming aware that some weird stuff is going on with her. There’s some romantic interest, but not a huge amount. Then, bam, all of a sudden it’s a gory horror flick with people running and screaming and getting splattered by gunfire and skulls being sliced off.The book feels very short, mostly because of the split attention and the paltry plot of the present day parts of the book. When the book ends, it really feels like it should be the end of act one of the book. So I think, if the next two books end up the same way, it will probably turn out that this story would have been better off edited down a bit and released as one long book rather than three short ones.Oh, yes, one other thing. Even though I like Finn and I think she has good potential as a protagonist, the fact is that (aside from the memory scenes) she really doesn’t ever do anything to drive the story forward. Well, maybe once, when she freaks out and tries to get the heck out of there and falls and knocks herself out and then gets marched into field trip detention. Which … doesn’t actually move the plot forward at all. Pretty much, stuff happens to her and she freaks out (as one probably would), but she never really makes decisions or takes action. This will probably change in later books, I assume, but in this one she just didn’t really do much.So, my opinion is that the book was not very well plotted or paced. It annoyed me that it ends on a cliffhanger without any kind of resolution or any questions answered. And I feel a little cheated that the book I was expecting, about a girl who is going to meet her father for the first time to get answers about what’s happening to her, is not the book I got. The whole “her father’s the richest, most powerful man in the world, and she’s never met him” thing is really a tiny, tiny part of this book, and there’s no payoff (she never meets him, and there’s never any indication that he’s even there when they’re on their field trip to his company).And yet, I do still want to know the answers to those questions. Maybe I’ll read the next books, but they’re not an absolute necessity for me. (hide spoiler)]"}, {"userName": "sh(e)reader", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/7982709-sh-e-reader", "userReview": "I heard about this series somewhere, looked it up on Amazon and saw that it was available to borrow in the Prime Lending Library. It was my December pick ... but I was not impressed and won't be continuing on. In the blurb, it sets up this new \"perfect\" world, yet we aren't really introduced to it much. There is an article at the start. Was that supposed to set things up? Not much world building there. As for the story ... first person, present tense. As another review mentioned, there is a lot of flipping between the present, and past (are they real memories? Dreams?) and it is NOT clearly defined (some novels will clearly mark things like that in chapter headings ... here, it was almost like the author was trying to really blend them to make it more confusing. Ending and starting with a similar situation, then we come to realize we have switched storylines based on the characters present). Still, I thought it started off promising ... but then it just got bogged down and a little crazy. Very violent and gory. I'm still just a bit confused about the whole Finn/Infinity situation. I called some of it early on, but as things happened near the end ... um, what happened exactly? I didn't care enough to re-read and try to figure it out. I just wanted to finish and say I was done ... I might peek at the blurbs of the other books, but I don't think I'll continue the series."}, {"userName": "Clay Kallam", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/961119-clay-kallam", "userReview": "You’d think we’d heard and seen enough about Steve Jobs, but S. Harrison’s “Infinity Lost” (Skyscape, $9.99, 262 pages) makes it impossible not to think about a mysterious leader who treats his daughter badly and creates a monolithic tech company. No, Jobs is not mentioned by name, but Dr. Richard Blackstone and his namesake company are close enough to the tech wizard and Apple that the comparison is inevitable.The narrative, though, is driven by Infinity Blackstone, the daughter, and “Infinity Lost” is pretty clearly the first of a series. Finn, as she’s known, has just turned 17, and is haunted by strange dreams, and there are plenty of wheels within wheels. There’s also some action, some teen romance and some promising writing from Harrison, so I’m on board for volume two. That said, though, I’d urge caution before pulling out the credit card, and maybe wait for the next installment’s review before diving in."}, {"userName": "Kaily Baute", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/48603656-kaily-baute", "userReview": "I don't like giving negative feedback because I can't even imagine how much work and creativity goes into writing a book to begin with... but if I'm completely honest I wouldn't continue this trilogy if it wasn't part of Kindle Unlimited ($10 a month subscription for unlimited books) so in my mind it's free. If I had to purchase the next book myself, I wouldn't for two reasons: I don't like the blood and gore (was not expecting it and don't have a taste for it) and I don't feel enough connection with the characters to care what happens to them. I do feel like the book is easy to follow (even though we travel back and forth between the present and Infinity's past a lot) and I do think the concept is unique, so I'm hopeful that I'll enjoy books 2 and 3 more."}, {"userName": "Jeff", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/18107306-jeff", "userReview": "Slow Burn with Intrigue. This book starts with a 17yo girl, Finn, dreaming. For the first time in her life. As we get more into the story, we see her dreams becoming more and more disturbing - including the scene when she is 6yo that has gotten this book several 1 star reviews. But progressing from there, the book picks up and turns slightly in an action direction, after a bit of fantastical science fiction. And then the conclusion... well, it ends a bit abruptly, clearly designed to pick up from there in the next book. We get few answers in this book, and the answers we get mostly serve to whet the appetite for what is to (hopefully) come - with the ultimate question never answered here. Overall a great, immersive tale. Looking forward to seeing where this goes."}, {"userName": "Mel ♡", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/19086405-mel", "userReview": "It's extremely rare that I rate a novel so low, yet, I didn't even find the concept of the book having potential — mainly because it wasn't even explained! There was no true synopsis that was expressed as the beginning of the story, and, as I continued to read, I realised that we were not going to receive one.And the character of Infinity? Finn — Infinity? The ending especially just swarmed me with confusion. If there was more of a plot, I think I would have enjoyed the story yet, even after reading it, I'm not even too sure what her father exactly does alongside what society they were in.It was a real shame."}, {"userName": "Christine Bishop", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/55735209-christine-bishop", "userReview": "Loved This Book!The book is told from Finn POV and jumps from present to past. She has strange dreams about her past. A past that she doesn't exactly remember the way she dreams it. She is the daughter of the owner of Blackstone technology, but she's only met her father one time in the middle of the night. She's been raised by nannies, guards, cooks, and maids. But everything amd everyone in her life are not how they seem. I loved reading this book. I read it straight through in one day and I'm about to start on Infinity Rises."}, {"userName": "David Allison", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/45912506-david-allison", "userReview": "This book, and I use the term rather loosely, is roughly 20% plot, and 80% filler. From the scene where a group of men effectively molest an 8 year old girl, to the attempt to illustrate a teenage girls lustful desires towards a boy (hint: it's ALL about the abs!); this collection of random words thrown together in a semi-coherent order is amongst one of the worst things I've ever read, and I've read Supernatural Wincest fan fiction on Tumblr. However, it only cost £1 hence the 2nd star."}, {"userName": "Carly Kirk", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/13567923-carly-kirk", "userReview": "Oh my holy cow! Talk about an amazing book! This is just an awesome wild ride! At the beginning I wasn't sure I'd like it because it really felt like the Finn was overlooking quite a bit of what was going on around her (and within her) but those feelings quickly gave way to the exceptional story being told. And once things heat up action wise they really heat up. I can't wait to dive into the 2nd book!"}, {"userName": "Katie Berryman", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/31905244-katie-berryman", "userReview": "Really good read. It was interesting the entire time and kept my attention. I very frequently looked at my kindle longingly wanting to just stop what I was doing to continue to read the book. I was a bit startled at the abrupt ending, but because the book flowed so well and was such an easy read, I will definitely be continuing on into the next book in the series."}, {"userName": "Brittney Garrison", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/34057537-brittney-garrison", "userReview": "I really wanted to enjoy this book, but that didn't go quite as planned. Also, I'd like to mention that in the first few chapters six-year-old Finn is molested by a roomful of men. This scene made me highly uncomfortable, and I wanted to warn others that this could be a trigger. Check out my full review at https://bookishbartender92reviews.wor..."}], "description": "In the near future, one corporation, Blackstone Technologies, has changed the world: no disasters, no poverty, and life-altering technology. Blackstone has the impunity to destroy—or create—as it sees fit.Infinity “Finn” Blackstone is the seventeen-year-old daughter of Blackstone’s reclusive CEO—but she’s never even met him. When disturbing dreams about a past she doesn’t remember begin to torment her, Finn knows there’s only one person who can provide answers: her father.After Finn and an elite group of peers are invited to Blackstone’s top-secret HQ, Finn realizes she may have a chance to confront her father. But when a highly sophisticated company AI morphs into a killing machine, the trip descends into chaos. Trapped inside shape-shifting walls, Finn and her friends are at the mercy of an all-seeing intelligence that will destroy everything to get to her.With no hope of help, Finn’s dream-memories may be the only chance of survival. But will she remember in time to save her own life and the lives of those around her?", "title": "Infinity Lost\n      \n          (The Infinity Trilogy #1)", "url": "http://www.goodreads.com/book/show/26580636-infinity-lost?rto=x_gr_w_carousel_bp", "average": 3.61, "cover": "https://images.gr-assets.com/books/1442394657l/26580636.jpg", "reviews": 239, "authors": [{"url": "https://www.goodreads.com/author/show/392697.S_Harrison", "name": "S.   Harrison"}], "type": ["Science Fiction", "Young Adult", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/25169902-infinity-lost", "http://www.goodreads.com/book/show/26873770-infinity-rises", "http://www.goodreads.com/book/show/26980196-infinity-reborn"]}