{"ratings": 2499, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "For years, Edith has offered a home in her Brooklyn Brownstone, a building that her now dead husband, Declan, had bought for them after they were married. Their daughter left home for Haight Ashbury he seventies and hasn't been seen again, their son, the villain of the piece only wants what he feels he is owed. Tenants came and went, until the last several years when the group of residents have stayed the same. A disparate group of people, all seeking a shelter from their lives, a group of wonderful people with problems of their own. Edith now provided shelter and succor to this group of people with very real needs. Until Edith has problems of her own, memory loss, confusion and now Edith needs help herself.It is the people in this novel that draws one in and grab hold , not to let go until the very end. I came to know and love all these characters as if they were actual people in my very real life. So wanted things to work out for them.Poignant, yet at times humorous, amazing writing, this novel slowly sneaks up on the reader. A novel of families, the ones we make and the ones that are given us. Friendship, putting everything on the line to help other people. Home and what the term really means. Sometimes the home and family doesn't come to us, we must go and find it. A big sigh at the end of this book, I am so very glad to have met these characters. Unforgettable."}, {"userName": "B the BookAddict", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "Alcott weaves a mesmerising tale about the bonds formed between the landlord of a brownstone and her tenants. Over several years, this group has formed within their abode, tight connections whose strength comes to the fore when the nucleus, landlord Edith, starts slowly descending into the mists of dementia. Thomas, the artist and recent stroke victim, who no longer feels any creative impetus; he will begin the most unlikely relationship with Adeleine, the agoraphobic who has made herself a world she can exist in inside her apartment, crammed full of vintage memorabilia; Edward, the cynical and no longer funny stand-up comedian, who can only see his life and past relationship now as failure; he will by some strange turn of fate become friend to Paul who suffers from Williams Syndrome, a neurological disorder characterized by his elfin facial appearance, his cheerful demeanour and ease with strangers, he is developmentally delayed, has strong language skills and a heightened affinity to music; Paul’s sister Claudia lived nearby but has recently left her husband and taken to sleeping on Paul’s couch after an episode landed him in hospital. All these tenants, who have formed unexpected relationships with their co-tenants and with Edith, will be shocked when Owen, their landlord’s estranged son steps into the picture. His aim is to have Edith consigned to a nursing home and take over ownership of the place that the tenants have all realized signifies home is truly where the heart is.Alcott paints an eye-catching portrait that warmed my heart, made me laugh and at times gave me a lump in my throat. Rich and intricately character driven, it is beautifully written and eloquent and it does not fail to appeal with each new chapter. These tenants will become people who are very real and one cannot help but continue to think of them long after the novel is finished. Alcott’s second novel deserves nothing less than 4.5★ rating."}, {"userName": "Zoeytron", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "'How do you tell someone her life has become too much for her?'Renters in a Brooklyn brownstone. Thomas the painter, now sidelined due to a stroke which has left his left arm wilted. The childlike Paulie, living with Williams Syndrome, an endearing, happy, social butterfly. Adeleine, an agoraphobic who truly believes she just prefers to stay at home. Edward, a standup comic, but nobody laughs anymore. These are just some of the irregular weaves who live in Edith's building and they are all about to lose their homes. Edith, with her gnarled old hands, is rapidly losing her grip on reality. I cared about the people and what happened to them in this story. Lovely prose, bittersweet without being a sap-fest."}, {"userName": "Larry H", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Lyrical, moving, and absolutely exquisite, Kathleen Alcott's \nInfinite Home\n had me marveling at her beautiful, almost poetic prose, reveling in the memorable characters, and even getting a bit choked up from time to time.This is a book about how we find comfort, and sometimes anguish, in the home we make for ourselves and the family we choose to embrace, biological or otherwise. It's also a book about finding strength where we didn't know we had it, and the different ways we adapt to and cope with change.Edith has been the landlord of a Brooklyn apartment building for years, since she and her late husband Declan bought it. The building was home to some of her greatest joys and some of her greatest sorrows and regrets. She is a model landlady, caring for and nurturing her tenants, knowing when they are in need and knowing just what to give them, although she can't solve all of their problems. Her tenants are a group of troubled but giving people—Thomas, a successful artist whose life is turned upside down after a stroke leaves one of his arms paralyzed; Adeleine, whose obsession with antique objects helps her build a home she never wants to leave; Edward, once a popular comedian, whose childhood has scarred him emotionally; and the amazing, childlike, loving Paulie, whose sister Claudia fulfills her parents' wish that her brother be taken care of appropriately.When Edith's mental and physical condition weakens, her estranged son returns home to claim the building and wants to evict all of her tenants. As they try to navigate the thoughts of their future, they each must confront challenges and determine what is next for them. But this will require courage, strength, even going beyond their comfort zones.I absolutely loved this book. It's told in very short chapters, but Alcott's use of language and imagery made me literally sigh and gasp at times. There was one point that I worried she was going to take the book down a path I absolutely dreaded, but she resolved that thread quickly and to my satisfaction, differently than I expected. This is a memorable book, both for how it is told and the characters on whom she focuses, many of whom will stick in your brains and your hearts as they did mine.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Cheri", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Edith, the kind-hearted widowed landlady who can’t seem to recall where her errant husband, Declan, has gone off to or when he will return. Paulie, a man in his mid-thirties with William’s Syndrome, his sister Claudia who struggles with taking care of her brother, Claudia along with Edward, a comic who dislikes almost everyone and everything.Adeleine, beautiful but overwhelmed by the world outside her door. Thomas, a successful artist who struggles with the limitations a recent stroke has brought to his life.These are the people who live in Edith’s apartment complex; a place that has been home to Edith since the day she and Declan first bought this Brooklyn brownstone. Almost every memory of hers is attached to this home, her mind going between the here and now and the past that refuses to stay there. The tenants have lived there seemingly forever. Each is broken in some way, emotionally, spiritually, physically. Between them, they somehow manage to make accommodations for each others missing pieces and together come up with a whole solution and ultimately a whole, if makeshift, family. Until Owen. Owen is Edith’s son, who feels entitled to the brownstone. Owen can’t wait to toss each of the tenants to the curb, with marginally kinder plans for his mother. Owen threatens the security, love, self-worth, everything they have found in this ramshackle family. Edith’s decline prevents her from addressing the problem, let alone thinking of a solution, but they can’t all just sit by and let this happen, or can they? Their actions come out of their desire to protect Edith as much as a desperate wish to avoid their fears associated with moving. Throughout their years with Edith, she has always taken care of them when needed; they have always cared for each other. Can they summon the courage and strength to overcome their obstacles and work together and rescue them all from Owen’s plan? Despite the “negative” of keeping track of multiple characters that hop around in segments/chapters almost as if they had a life of their own, Infinite Home is a lovely story filled with charmingly endearing, quirky characters who I grew to love. Be prepared to take some time to get to know each and every one, and enjoy life in this Brooklyn brownstone."}, {"userName": "Claudiapiepenburg", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/44046350-claudiapiepenburg", "userReview": "I so so want to like this book. I'm now half-way through and still want to like it. But I have this urge to take my highlighter and start accentuating every simile and metaphor and that Ms. Alcott uses, and tonight I came to the realization that if I do that, every page will be filled with color. The story is an intriguing one, and I've fallen in love with some of the characters (which is the only reason I will finish the book) but she is trying way too hard to show all of us that she's a WRITER!!!!! I'm a writer who can come up with 10,000 ways to describe the simple act of putting something on the stove or walking down the street. 10,000 ways to compare it to something else that, when you think about it for even a very short while, there's really no comparison at all. Does every action have to be compared to another? I wish I had a dollar for every time Ms. Alcott uses the word \"as.\" She needs to exorcise that word from her vocabulary. Example: \"These things are delicious,\" she exclaimed, waving the biscuits as though trying to keep the attention of a baby. Why? Why did you write that? We get it, she waved the biscuits. Enough already, leave it at that. This will be the last book of Ms. Alcott's that I'll read (I said as if walking away from a lover who can't understand the reasons I'm leaving)"}, {"userName": "Cher", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/4776032-cher", "userReview": "2.5 stars - It was alright, an average book.Felt overwritten and slow in places. To illustrate what I mean by overwritten, below is the first chapter in its entirety (all the chapters are short). This writing style can be beautiful when used sparingly but is over the top when it flows continuously.THE NEIGHBORS HADN’T NOTICED the building’s slow emptying, didn’t register the change until autumn’s lavish colors arrived and leaves sailed through the windows the man hadn’t bothered to shut. The wind captured various vestiges—a sun-bleached postcard covered in outmoded cursive and a chipped plastic refrigerator magnet shaped like a P and a curling photo of a red-haired woman asleep on a couch—and flew the tenants’ things before relinquishing them to the sidewalk.\t\t\tHe was often visible in the evenings, backlit by a feeble table lamp, immobile in a plastic school chair placed against a top-floor sill, and he seemed untouched by any changes in sound or light or weather, an ambulance’s amplifying moan or the snap of a storm on parked cars or the inked saturation of the sky at dusk. Some nights his seat remained empty, and yellows and whites and golds briefly filled each room before darkening and appearing in the next, the lights traveling from the first floor to the third, and the movement of electricity was a quiet spectacle, like the reappearance of hunger after a long illness.When the cold knock of air came and New York turned white, he closed the windows.-------------------------------------------Favorite Quote: “Aging gracefully” was a model much talked about, though Edith doubted anyone ever felt elegant or nimble amid the nearly inescapable fatigue, the persistent mutations of once-simple tasks and the shame thereafter.First Sentence: The neighbors hadn’t noticed the building’s slow emptying, didn’t register the change until autumn’s lavish colors arrived and leaves sailed through the windows the man hadn’t bothered to shut."}, {"userName": "Jill", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "Once, when I was getting ready for a move, a friend said, “Remember, home is nothing more than a piece of real estate.” But I knew then – and I know now – that it is really much more. Home is the place where you are your most authentic self, a place of sanctuary and acceptance.Kathleen Alcott wisely understands that. In a run-down Brooklyn brownstone, overseen by an octogenarian named Edith who is beginning to lose her mind, a ragtag small group of men and women feel anxious for their future. All are damaged, physically or emotionally: Thomas, a once-time well-known painter who is now partially paralyzed by a stroke, Paulie, a child-man who suffers from Williams Syndrome and his tightly-coiled and doting sister Claudia, Adeleine who is an agoraphobe and hoarder, and Edward, a comedian who hides his fears with caustic humor. Together, they recreate the definition of family and learn to trust and love each other.This author’s prose is gorgeous – sometimes, breathtakingly so, and her insights are similarly beautiful. One description of Edith: “She was upset because she said (her memories) were sort of losing their foundation, like they were flooded and pushed into the wrong rooms.” There is the fear of “playing nonsensical checkers with incontinent zombies.” Or, in this description of fireflies: “They had seen only little flashes like the beginnings of lonely ideas but not the crowd of busy angels he had come for.” After a little while, I began noting that every single chapter could actually stand by itself as a short story, although this is definitely a novel with a forward propulsion. Each of thse chapters shimmers like gems.And oh, the themes: what is home? (One character answers, “No need to bring home with me, dear. I know what it feels like.”) What happens when we are forced out of our own poor facsimile of a self-created Garden of Eden into the world to seek answers? Can we recreate ourselves to give ourselves a second chance – through trust of others, the open road, cults, or the great outdoors? The answers are nuanced: some of these characters can, some can’t. I would give this novel 5 stars were it not for one particularly one-dimensional character. Owen, Edith’s son, is the embodiment of menacing evil, and the reasons for his malaise are way too pat. Also, Claudia’s devotion to her brother Paulie sometimes seems idealized and cloying. Still, with those exceptions, this is a fine book with mesmerizing prose that fully addresses how and why a life is worth living."}, {"userName": "Emily M", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/8112372-emily-m", "userReview": "Kathleen Alcott is a tremendous writer, and she delivers extremely strong prose here. However, I strangely felt like there was both way too much and not nearly enough going on throughout this book. A worthwhile read, but not as unputdownable as I would have liked."}, {"userName": "Shannon", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/4752397-shannon", "userReview": "After years of cycling through tenants in her Brooklyn brownstone, Edith comes to expect the four apartments in her building will be empty not long after they are filled. But as she ages, she fails to notice a defined group forming in her halls and settling down for good: Eddie, a lonely, washed-up comic; Paulie, a tender-hearted young man with Williams syndrome; Thomas, an artist adjusting to life after a stroke; and Adeleine, an anxious and reclusive young woman. Over time, the four tenants discover their unique connections, both to each other and Edith, just as the stability of their home is threatened.Infinite Home is an absolute wonder. Kathleen Alcott knows how to weave words into sentences so lovely they often cause pause and demand a re-read. But the novel doesn’t hinge only on her gorgeous writing—she spins her words into the intricacies of characters, creating fully realized, unique personalities from the smallest details.The novel’s plot moves forward with many shifting, sometimes nonsensical, pieces that require some suspension of disbelief, but Alcott makes this easy with the hazy, nearly dreamlike world she creates for her characters. Though their lives are far from perfect, Alcott lifts them up to shed light on the beauty of change, challenge, and imperfection. Wonderfully balanced between sweet and sentimental, with both weight and whimsy, Infinite Home is easily a new favorite for 2015.More at rivercityreading.com"}, {"userName": "Book Riot Community", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "Now in paperback: A group of unusual tenants in a Brooklyn brownstone have been living quiet lives together, each dealing with their own problems and pains, but when their kind elderly landlord’s mental capacity begins to weaken, the tenants are faced with eviction when her greedy estranged son takes over the building. They have always found solace in each other, but now must decide what they will do back out in a world that has always treated them cruelly. It’s a beautiful story of living on the outside of society and what it means to choose your own family. (Also, does the cover make anyone else want to play Q-bert? No? Just me?)Backlist bump: The Dangers of Proximal Alphabets by Kathleen AlcottTune in to our weekly podcast dedicated to all things new books, All The Books: http://bookriot.com/listen/shows/allt..."}, {"userName": "Rochelle", "userReviewDate": "Sep 06, 2015", "userURL": "http://www.goodreads.com/user/show/26846131-rochelle", "userReview": "When you look for \"purple prose\" in the dictionary, this book should be listed as example number one. I have never seen such overuse of metaphor, simile and adjectives. For example:\"The bubbly pleasure drained from Paulie’s face. He looked at Edward like tourists look at the mona lisa, searching & wary as they wait to be touched by glory.\"If it were only used here & there it might be okay, but the sentences that don't use heavy handed descriptors are few and far between.\"Claudia permitted herself a restrained snort against the tightness of Paulie's body which pressed against her like a vigorous current\" “…crumpled, like dead things are”\"…his face dropping on to hers like a hammer onto a wall, noises like kissing, but also not, as though something were being excavated”\"She gave an insignificant sound, one as echoeless and quickly spent as that of a bird leaving a fence.\"\"…and held her determined, like algae clinging to a sea beaten rock.\"It's almost every sentence. I love descriptive prose. Adore it. This however, is something completely different. The descriptors add nothing to the text and are an irredeemable distraction from the story.This is a book that makes you want to go and kill people. Especially people who use adjectives and similes. It's like a fucking jackhammer, hitting your brain repeatedly until you're a gibbering idiot, blowing in the wind like a lost leaf with alzheimers, forgetting why you even started this sentence.Christa Lewis, the narrator of the audiobook has a lovely tone, very enjoyable. The only downside of the narration were occasional pauses where no comma or stop would make sense, where it was clearly the middle of a sentence. Otherwise, very nice narration & production. Not enough to make me want to finish this book."}, {"userName": "Marion Honey", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/3100016-marion-honey", "userReview": "Everyone's review says this but that's because it is true: this is a beautifully written book. Something to read if you want to get yourself back into reading and/or writing. Alcott pulls out the metaphors so effortlessly yet with an eery sense of familiarity. A portrait into the lives of five tenants and their landlady in Brooklyn, this is a simple story with strong storytelling. It takes a little time to get into but Alcott quickly hits her stride. I chuckled, I choked up. I had to stay up til 1am on a school night to finish it. Makes you want to phone up your parents and give them a big dang hug."}, {"userName": "Christopher", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/1753826-christopher", "userReview": "Always, always, it's about the writing. And boy, oh boy, does this young lady know how to compose beautiful sentences. Lyrical, powerful writing. I loved this book!"}, {"userName": "Terri Jacobson", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/8370501-terri-jacobson", "userReview": "This is a finely written novel about a group of rather strange characters who end up living in a small apartment building in Brooklyn. Edith, the widowed landlord, has always looked after the group in small ways. Edith, however, is disappearing into the mists of dementia, and things in the building come to a crisis. The characters in the building are lovable journeyers on various life paths. There's Edward, the \"last comic;\" Thomas, an artist who had a stroke as a very young man; Adeleine, a recluse; and Paulie, a young man with Williams Syndrome, a disease that will keep him childlike all his life. The character sketches are brilliant, and the writing is crisp and memorable. I came to care about the characters, and the book tells a lovely story. The way strangers can bond and become each others' family is the message I came away with. A beautifully written book."}, {"userName": "Sally Howes", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/23122552-sally-howes", "userReview": "4.5★s - A real microcosm of humanity in all its eccentric gloryi! These characters are exquisite - their strengths, their frailties, their joys, their sorrows, their tenderness, ruthlessness, loves, hates, and above all, their authenticity. The language is of the highest quality, which is the least these wonderful characters and their enthralling story deserve. Most highly recommended!"}, {"userName": "Jessica", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/188447-jessica", "userReview": "I liked Proximal Alphabets much better than this, which often felt bogged down by a lack of forward movement and heavy prose trying too hard to be lyrical. I wanted to like it, but I was ultimately underwhelmed."}, {"userName": "Tyler Goodson", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/7540065-tyler-goodson", "userReview": "This was beautiful and I felt like I found a home in this world, this writing, and these characters."}, {"userName": "Chad Donnick", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/8049303-chad-donnick", "userReview": "Infinite Home just did not engage me. The biggest issue I had was that the characters were uninteresting and simply not written well. It was very difficult to get into the characters with very short chapters killing any momentum that may have been building up. I also felt that the author's writing style tries to squeeze too much information into sentences. I love commas more than most, but wow.I read another review about the characters being damaged. I found this to be true, but it didn't have to be problematic. Damaged characters bring a sense of realism to the story and when written the right way can be quite engaging, but I failed to have any sympathy (or feelings whatsoever) about these characters. The only thing I did enjoy was the references to the Fort Greene (Brooklyn) neighborhood in which I live. Myrtle Ave, Fort Greene Park, Pratt, the old elevated line. It did help me paint a better picture of the story."}, {"userName": "Shari", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/38856247-shari", "userReview": "I won this book on Goodreads first reads!"}, {"userName": "Dan", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/11623993-dan", "userReview": "I finished this book a couple of days ago and now that I am going back to write up my thoughts, I wonder if I am giving this the correct rating with 4. Let's put it this way, it earned at least that much!A story about Edith, the rooming house she owns in Brooklyn and its' tenants. I found myself pulled into this ragtag collection of individuals and really loved the characters. A story about family, both in the true sense of the word as well as more loosely, as in this case, the boarders. With family, comes all that that entails, the love, the trials and the tribulations. This story had it all and told in a perfect manner."}, {"userName": "Sheri", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/6970638-sheri", "userReview": "This novel is simply a collection of crazy people. Alcott has a great way of showing how all of us are just holding it together and once it starts to leak out we are in trouble. Most of this novel reminds me of the David Foster Wallace quote about how we are all so busy hiding our own issues that we don't notice any others and that if simply asked what is wrong we will erupt into a ball of chaos. Alcott's crazies all live in a small apartment building owned by Edith in NYC. They are long term tenants and rely on each other to share the burden of their issues. During the course of the novel, things come to a head as Edith lapses into old age dementia and her son Owen begins to think about remodeling and evicting the tenants. I really thought the forced plot was rather Disney (something about Owen reminded me of Cruella d'Vill from 101 Dalmatians) and unbelievable that he would hold Adelaine hostage in her own apartment and destroy things (even though he knew that she was weak and would not escape or call the police he had to anticipate that eventually Thomas would come back and that the police would be called; landlords CANNOT do what he did). Ultimately, I think the story was best before Thomas went off to CA; it really didn't need the plot movement. Alcott has a great way with words; she is very concise, but her turns of phrase manage to convey a lot. A few of my favorites were: \"Of course she loved her children--this was never in doubt--but when they became, more and more, the people they were, Edith felt as though nothing she could have done would have made any difference.\"\"The kid's brain was broken, but Edward couldn't of course recommend the health of his own. Paulie, it was clear, chased and cornered happiness daily.\"\"She dreamt, like a dog, kicking often\"\"The conversation came back to him like an infection, worse and larger in its return\"I liked Proximity to Alphabets better; thought the plot was better and more thought out (again, this didn't NEED the plot that Alcott forced upon it), but overall certainly a good, solid read."}, {"userName": "John Naylor", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/15654295-john-naylor", "userReview": "I received this book for free via Goodreads First Reads.It took me a while to decide on a 2 star rating for this book. It is well written, it shows the author has a talent for words that few authors have, it deals with issues such as Williams Syndrome as well as dementia and the book has a lot of interesting characters. There are a lot of positive things about this book and a few things I enjoyed.I just feel it was overwritten, slow and the plot was weak at times. As much as I enjoyed the writing I think it could have been cut by a third and told the same story. I like an author to find their voice and to use a lot of words as a rule but in this book it felt like nearly every page was made up of extra words that were not always needed. One of the characters barely speaks and that seems almost like a welcome relief when she becomes part of the story. I would recommend this book to readers with a lot of patience or those that want to study the art of writing. It is by no means a bad book but it is one that will not suit every reader."}, {"userName": "Marilyn Woodward", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/5580287-marilyn-woodward", "userReview": "Disclosure: I received an advance copy of this book from the publisher but that will not affect my review. There was much about Infinite Home I really liked--the assortment of people who live in the Brooklyn brownstone and the owner were interesting, intriguing characters. However. I have to say that I was put off by the actual writing style, which seemed to need a bit more simplicity and less imagery and metaphors to describe--everything. I kept thinking the author, who writes well, needs to read some Alice Munro and learn how to simplify a bit. I appreciate the effort that goes into writing any book and wish I could have rated this one higher."}, {"userName": "Robert Blumenthal", "userReviewDate": "Sep 21, 2015", "userURL": "http://www.goodreads.com/user/show/10110896-robert-blumenthal", "userReview": "This is what one would call a beautifully written novel. It is apparent that the author crafted every sentence as carefully and artistically as she could. I thought of her as the \"anti-Raymond Carver\", where Carver is as spare and unencumbered as a writer of fiction can be. On the other hand, Kathleen Alcott strives to make every sentence unique and poetic. Although I appreciated this craft, I did find myself tiring of it a bit as the novel progressed. She does create wonderfully drawn characters, each with some problem or disability: an aged woman who is becoming senile, a beautiful young woman who is bipolar and extremely agoraphobic, an artist who has had a stroke, a young man with a disability called Williams Syndrome which causes him to act very immature. These flawed individuals all come together in a Brooklyn brownstone where they are tenants of the sweet, dotty matriarch Edith. The chapters are all very short and skip around from character to character. They become involved with each other in various ways and there is somewhat of a plot where they are trying to save the building from the clutches of the evil son, Owen, who wants to evict them all. It is generally a lovely read, with some deeply emotional moments."}, {"userName": "Sarah Forester", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/10437412-sarah-forester", "userReview": "The words that I perpetually relate to this book are the lyrics, \"Potentially lovely, perpetually human, suspended and open\" One of the greatest joys of reading this book is the way none of the characters feel forcibly quirky or lazily caricatured. The delicate balance of details and mystery is most striking in the way the characters narrate the past, and most comforting in the ways that the characters accept the present. It felt like the parting smile of a hospice patient, leaving you sad, hopeful, and questioning.I can't tell if I've been swindled into accepting half baked archetypes though. There were plenty times where the book have easily fallen into hackneyed tripe. My own sentimentalism of moving into an apartment by myself more than likely filled in the missing gaps. It was a good book for me at this point in my life."}, {"userName": "Andrea MacPherson", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/2025163-andrea-macpherson", "userReview": "A novel in short vignettes, about the lives of all the renters in a brownstone. Much to enjoy, but a few storylines that felt unnecessary and melodramatic (specifically Edith's two-dimensional son, and the implausible failed search for her daughter). Each of the characters is damaged in their own way--body impaired after stroke, agoraphobia, Williams Syndrome, dementia. While they each work individually, it also felt like too much in one place. Alcott has lovely writing, and the ability to create layered characters."}, {"userName": "Zoe Hall", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/34708201-zoe-hall", "userReview": "I received this book as a result of winning a Goodreads giveaway so thank you very much for sending me a copy of this book.Now what can I say about this book? I really, really wanted to love this book. It'd been on my TBR list for a while so of course I was very excited when I saw I'd won a copy. However, and please don't take this the wrong way, but I just didn't enjoy this book as much as I was expecting. I only really cared for Edith. I actually found myself skimming pages and even whole chapters which I really hate doing but some of the narrative just didn't quite hold my interest.Having said that... The writing in this book is sublime, in fact the prose is wonderful and it's this that kept me reading to the end.All in all, I don't think this book was for me but Alcott's writing is beautiful in places so that's worth a read in itself. 3 stars."}, {"userName": "Drew", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/3679784-drew", "userReview": "Alcott's characters are beautifully drawn and their plight, so simple and ordinary and yet given urgency for those very reasons, makes it easy to become an honorary member of this apartment building's \"family.\" The novel takes a few minutes to find its footing (the opening page-long prologue is not a great introduction) but almost before you know it, you are drawn into the quiet near-melancholy of this fading moment and propelled along to the equally quiet near-joy of the next moment's birth. A beautiful novel (with, by the way, a BEAUTIFUL jacket; the pictures don't do the colors justice) and a heartfelt depiction of the homes we create for ourselves - and the lengths that we will go to protect them, no matter what shape they take.More soon at RB:"}, {"userName": "Dennis Jacob Rosenfeld", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/4609269-dennis-jacob-rosenfeld", "userReview": "Infinite Home revolves around the spaces we carve into the world and call home. About how they reflect our personalities and take shape accordingly, but also how they might end up shaping us. They can provide comfort as well as turn into prison cells. They may shelter us only shortly or for many years. A beautiful book with quite wonderful prose and descriptions of human nature that struck a chord deep within me."}], "description": "A beautifully wrought story of an ad hoc family and the crisis they must overcome together. Edith is a widowed landlady who rents apartments in her Brooklyn brownstone to an unlikely collection of humans, all deeply in need of shelter. Crippled in various ways—in spirit, in mind, in body, in heart—the renters struggle to navigate daily existence, and soon come to realize that Edith’s deteriorating mind, and the menacing presence of her estranged, unscrupulous son, Owen, is the greatest challenge they must confront together. Faced with eviction by Owen and his designs on the building, the tenants—Paulie, an unusually disabled man and his burdened sister, Claudia; Edward, a misanthropic stand-up comic; Adeleine, a beautiful agoraphobe; Thomas, a young artist recovering from a stroke—must find in one another what the world has not yet offered or has taken from them: family, respite, security, worth, love. The threat to their home scatters them far from where they’ve begun, to an ascetic commune in Northern California, the motel rooms of depressed middle America, and a stunning natural phenomenon in Tennessee, endangering their lives and their visions of themselves along the way. With humanity, humor, grace, and striking prose, Kathleen Alcott portrays these unforgettable characters in their search for connection, for a life worth living, for home.", "title": "Infinite Home", "url": "https://www.goodreads.com/book/show/24611962-infinite-home", "average": 3.59, "cover": "https://images.gr-assets.com/books/1429627924l/24611962.jpg", "reviews": 347, "authors": [{"url": "https://www.goodreads.com/author/show/5399365.Kathleen_Alcott", "name": "Kathleen Alcott"}], "type": ["Fiction", "Contemporary", "Literary Fiction", "New York"], "outlinks": ["http://www.goodreads.com/book/show/24611962-infinite-home", "http://www.goodreads.com/book/show/25502604-infinite-home", "http://www.goodreads.com/book/show/29662086-infinite-home", "http://www.goodreads.com/book/show/26052228-infinite-home", "http://www.goodreads.com/book/show/25609369-infinite-home", "http://www.goodreads.com/book/show/13263533-the-dangers-of-proximal-alphabets", "http://www.goodreads.com/book/show/34696063-six-shorts-2017", "http://www.goodreads.com/book/show/40220855-america-was-hard-to-find", "http://www.goodreads.com/book/show/31685642-america-was-hard-to-find", "http://www.goodreads.com/book/show/26017737-infinite-home-excerpt", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}