{"ratings": 933, "userreviews": [{"userName": "Margaret", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/33672102-margaret", "userReview": "finally got my mitts on this one, thanks to faith (you are my rock faith) and the event of my birthday.it was good. not incredible, but good. an overwhelming sense of potential pervades the book, a potential which came to fruition in the thief but especially in the queen of attolia. a few of the stories were nearly in the very good range, especially the one from which the title was taken and the baker king. what i thought most interesting was that each story had, in itself, the potential to become something longer if given the opportunity. it makes me wonder if the thief began as another attempt at a short story before shrugging off the restrictions and becoming a newbery-award-winning novel. there are a few similarities to eugenides' world in these stories. there are traces of megan's famous pull-the-rug-out-from-under-you plot-twists (which she has now honed to a fine art), the youth-centricity of her stories, and her almost deadpan sense of humor. the last story even takes place in a grecian setting. overall, it was kind of like reading a concept draft for her novels, or like the earliest of ideas pitched to a publisher. being the fan of mwt that i am, it was a fascinating glimpse into what pre-thief megan was writing. this was her first attempt at fiction, and all things considered it's not half-bad. .....did i just write an actual review? i rather think i did.reread: 4/17even more delightful this go round. i found a greater appreciation for the structure and execution of each story individually. this is not just a precursor to her novel-length fiction, they are worthy stories all on their own."}, {"userName": "Elizabeth", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/29034676-elizabeth", "userReview": "I loved these stories. I think they were each engaging and made me want to find out what happened, and had originality."}, {"userName": "Allison Ruvidich", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/20777474-allison-ruvidich", "userReview": "A Plague of Leprechaun: 2 stars. Not a bad concept, but much, much too short for the reader to have any emotional reaction to the events beyond polite interest.Leroy Roachbane: 2 stars. Virtually the same as the first. Clever concept, half-hearted execution.The Factory: 2.5 stars, tentatively. Morally incorrect, but fascinating and kind of sweet at the same time.Aunt Charlotte and the NGA Portraits: 3 stars. The story was fun and creative, but since the reader was hearing it second-hand, the interruptions took away from the flow somewhat. (I don't dislike the telling-a-story premise, but it was overused here.)Instead of Three Wishes: 5 stars. Utterly enchanting. It made me giggle! I loved the concept of an elfin queen and her son forced to operate in modern society, when mortals no longer want the traditional rewards.The Nightmare: 3 stars. Cute, kind of feel-good. Nothing special.The Baker King: 5 stars!! This (and maybe Three Wishes) is the only story where you can see the roots of Attolia. It is not set in the same world, but it definitely has the same themes and culture. Absolutely loved it. : )Average: 3.214 stars."}, {"userName": "Yune", "userReviewDate": "Jan 26, 2009", "userURL": "http://www.goodreads.com/user/show/8561-yune", "userReview": "Picked this up because I'm a big fan of Turner's Attolia trilogy, and I was curious what her short form was like. I remembered only later that I hadn't particularly liked \"The Baby in the Night Deposit Box,\" a story she published in a different anthology, but it's a good thing I recalled it after I made my clumsy, over-tall way into the children's section of the library to nab this. I did frown at the jacket description of \"commonplace magic in everyday worlds\" (surely others sympathize with my secret wish for a historical Greek setting).However, the inside flap also calls it \"a sparkling collection,\" and having finished the collection, I'll cheerfully go with that. I balked at the first story, \"A Plague of Leprechaun,\" because I'm not much into stories about leprechauns, but a couple pages in I was much reassured by the wry tone. Turner does a marvelous job in bringing modern, sensible characters into unusual situations. I was particularly charmed by the title story, where Selene and an elf prince meet on a traffic island.The quote on the back, which does a great job of imparting Turner's voice:He pulled out a wallet. From the wallet he extracted three small white cards and pushed them at Selene.They looked like business cards. Instead of a printed name, a filigreed gold line wrapped itself in a design in the middle of each white rectangle.\"What are they?\" Selene asked.\"Wishes,\" said the elf prince. \"You've got three. Just make a wish and burn a card. It doesn't\"--he looked her over with contempt--\"require a college education.\""}, {"userName": "Margaret", "userReviewDate": "Oct 27, 2010", "userURL": "http://www.goodreads.com/user/show/162759-margaret", "userReview": "This is a collection of charming little stories. Nothing here is as good as her novels, but they're well told and offer some fresh perspectives on old tropes. I particularly liked the title story, in which an elf prince tries to reward a girl for helping him but can't come up with anything she really wants, and the last story, \"The Baker King\", about a kingdom which has misplaced their prince."}, {"userName": "Natalie", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/63694841-natalie", "userReview": "Cute, fluffy stories, although I vastly prefer the Attolia books. My favorites were the sweet dystopian ghost story, the Attolia-esque Baker King one, and the one about the girl who refuses her 3-wish reward and the frustrated elf who has to figure out what to give her instead. Also, I found \"The Nightmare\" a little disturbing, but not in the way it was intended to be, I think."}, {"userName": "Cait", "userReviewDate": "Sep 18, 2010", "userURL": "http://www.goodreads.com/user/show/1005037-cait", "userReview": "I had read the title story in some collection, so I was a little worried that I'd already read this whole book and just forgotten to record it, but no, the others were all new, and all good. I definitely enjoyed Instead of Three Wishes again, about a young woman who finds traditional fairytale rewards vaguely embarassing in that teenaged way, and I really liked Leroy Roachbane and The Nightmare too, both of which are about little boys being boys but with very different takes. The Baker King was funny but more fairytalish than the others, and didn't really fit. Factory didn't really fit either -- it's a bittersweet scifi/dystopia ghost story, sort of -- but I like it more so I mind less. A Plague of Leprechaun was cute, and Aunt Charlotte and the NGA Portraits was playful, and I'm sure it was no mistake that their framing devices matched their themes so neatly (in a fun way, not a clunky way)."}, {"userName": "skein", "userReviewDate": "Jul 28, 2009", "userURL": "http://www.goodreads.com/user/show/1213453-skein", "userReview": "A perfectly charming set of stories. I am positive I read it before (when? when?), so my enjoyment was a bit dimmed - expecting to be surprised by twists & endings, I kept thinking 'oh - right'. Entirely my fault, because I expect these to hold up to repeated reading.Turner is such a good writer. This is her first published work, & it's less intricate, less polished than her books, but she still creates entire worlds & full characters with just a few lines. (If I'm reading the dedication page correctly, these were written for her son - and while most are funny and emotionally provocative, one is creepy & disturbing - hard to imagine requesting that to be read as a bedtime story.)There are a few very early traces of her Thief books, too - and since I can't think about that wicked Eugenides without being bathed in a warm glowing warming glow of writerly admiration, it was just an extra delight."}, {"userName": "David", "userReviewDate": "Nov 26, 2013", "userURL": "http://www.goodreads.com/user/show/8379541-david", "userReview": "Overall Rating: 3/5Megan Whalen Turner’s The Queen’s Thief series is, without a doubt, one of the best things I’ve ever read. By the middle of book three, The King of Attolia, I had already decided to add her to my list of favorite authors on goodreads.However, the best thing about those books is, by far, the characters. Turner has a knack for great, multi-dimensional characters the way Brandon Sanderson has a knack for cool magic systems, or the way Patrick Rothfuss has a knack for pretty words, or the way that Gene Wolfe has a knack for world building. It is her strongest trait by far. Which is not to say that those books don’t have decent world-building, lore, and plots behind them, because they do, but they’re just regular good. I was very excited when I found out that Turner had a short story collection I could read, though now that I’ve read it I realize that her strongest trait, character, is something that typically takes a back seat in short stories so that unique ideas, plots, or styles of writing can take center stage. There’s simply not enough words in a short story to develop strong characters (usually), but the length is perfect for experimentation in other areas. These stories, unfortunately, are not at all experimental. They’re charming, but woefully predictable, and they all wrap up a little too cleanly for my taste. I would say that the majority of short stories I've read have at least somewhat ambiguous endings, and that's probably for the best. You can get away with stuff you otherwise couldn't, so why not take advantage of that? We really don't like ambiguous endings in western culture, but somehow that type of ending thrives in short stories and that's a big part of why I'm drawn to them.\nA Plague of Leprechaun (1/5)\nTourist start flocking to a small town when a leprechaun is sighted. An artist visiting to paint landscapes gets the gold. Quite boring. \nLeroy Roachbane (1/5)\nSome kid likes to kill roaches to an unhealthy degree. He has to write a report about his black heritage for school, but he lives in Sweden and the school library only has history books about white people. He crashes his bike and has some sort of hallucination about killing roaches for ancient Swedish tribal people or something. What the shit? Seriously, what the shit?\nFactory (4/5)\nThis is a great little story about a sort of dystopian future where people sleep, eat, live, and work for fourteen hours a day in a giant factory. Work is apparently so scarce that there is a selection process to get in, if you can believe it. The main character, John, due to the results of his psych profile, which indicate he's a loner, is assigned to the 'high crane' where he is isolated from most of the other workers. In fact, it takes him so long to climb up and down the ladder to his crane that he very quickly stops climbing down to take his lunch breaks at all, which further isolates him from the rest of the workers. At first he enjoys his job, doesn't mind being alone at all, and loves reading the books the factory library provides. He hears rumors of how the previous workers in his position have quit after a short time because they saw ghosts. The official story from the factory, however, is that they quit “because they got bored and lonely.” At first he ignores these rumors, but eventually he meets one of these ghosts and forms a friendship with her. Turns out she's one of the people who lived in a mansion on this plot of land a long time ago, before the factory was built. They share poetry, she tells him what nature in her time was like (John's people call pigeons 'birds' because 'there's only the one kind' and he's never heard of a squirrel).They become really close and he comes to realize that he would rather live in her world, a world that never changes, than grow old and leave her, and so he talks to her mother (who is the one who figured out how to ghost-ify the whole family in the first place) and does exactly that, bringing not only himself but a ton of new books and chocolates into his new friend's unchanging world where they can sit and read and eat chocolate together for all eternity. It's short, sweet, character-driven, and speaks to what is truly important in life (relationships with other people, ideas, contentment, happiness) vs. what really isn't important at all but a lot of people really think is incredibly important (forward progress, manufacturing, profit, money, work work work and more work). It really resonated with me and my own personal world-view and I enjoyed it immensely. \nAunt Charlotte and the NGA Portraits (3/5)\nAn old woman tells a story from her youth, about how she befriended this older woman during a vacation who was magical. At the end she gets sent into a painting to retrieve a fur coat for said woman and meets several people who are, in actual fact, not real but people from several different paintings. Basically it's her way of explaining why she sees certain painting as friends, and what parts of it you choose to believe are up to you, as aunt Charlotte would say. \nInstead of Three Wishes (4/5)\nThe 'title track' of this collection if you will, this story is yet again a sweet, character-driven story that shows off Turner's strengths. It all starts when a young woman named Selene helps an elf prince cross the street. He, as elves do, offers her a gift in exchange for her help—three wishes, printed on business cards—which she promptly refuses because he could be a crazy murderer or something, and besides, how often do wishes go so very wrong in stories? She accidentally tells him where she lives in her attempt to escape the situation and receives gift upon gift at her doorstep, all of which she refuses for reasons of practicality and common sense. A mansion she can't afford to live in; a fairy tale prince meant to be her husband who can't read, write, or do anything useful; etc.Finally, not knowing how to please her, the elf prince disguises himself as a human and takes up lodging in Selene and her mother's house in order to find out what she likes so that he can repay his debt. Turns out a nice lodger was exactly what they wanted, and Selene's delicious baking is exactly what the elf prince wanted. The three of them slowly become friends, and when Selene gets accepted into an exclusive culinary school that she can't afford to go to the elf prince knows exactly what to do. He pays her tuition, and moves Selene's mother into his own house where his mother lives. What started as a single-minded, almost business-like attempt to repay a debt ends with Selene being able to go to the culinary school of her dreams, and her, her mother, the elf prince and his mother, all becoming good friends. Just like Factory it emphasizes the importance of friendships and other people over material goods. Selene chose to make new friends instead of making three wishes, and she was smarter than most of us for doing so. \nThe Nightmare (2/5)\nSome high-school freshman harasses a woman who throws something at him. Turns out it's a nightmare that he has every night of what the people he saw throughout the day think of him. It turns him into a better, more empathetic individual and at the end of the story he passes it on to someone else, just as the woman did to him.\nThe Baker King (3/5)\nA charming story written like a fairy tale, but a fairy tale that seems...perhaps a little too familiar? Basically a king sends his son off somewhere to learn the ways of life, but dies before he tells anyone where the boy actually is. His ministers manage just fine without a king until an infamous bandit sends word that he'll be taking up the position, whether they like it or not. They realize they can't call upon the army without a royal decree. One minister decides to find a random young man who fits the lost heir's description and tries to convince him that he is, in fact, the king. Turns out the man he picked actually is the lost heir, and knows that he is, but he doesn't want to be king. He pretends as much as he needs to in order to convince everyone that the throne is cursed and will kill anyone who sits on it besides the true heir, which scares away the bandits, and then returns to being a baker's apprentice while the ministers go back to running things."}, {"userName": "Lucy", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/8577532-lucy", "userReview": "Seven stories of magical beings and happenings. First published in 1995, so maybe that's why it's less than wonderful, though pretty good.stories are: A Plague of Leprechauns – Leroy Roachbane – Factory – Aunt Charlotte and the NGA Portraits – Instead of Three Wishes – The Nightmare – The Baker King.I liked the Nightmare's way of dealing with bullies. You get what you ask for, even if it's not what you think you're asking for."}, {"userName": "Joe", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/3937170-joe", "userReview": "Tales of Magic and Mischief.Words and writers of words.Some writers are full of technique. Megan is a story-teller.You get drawn in with each story.I really enjoy the short story format.Get in get out. Just a slice of life [not the whole life]."}, {"userName": "Kyrsten Newlon", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/67199396-kyrsten-newlon", "userReview": "Enchanting stories! I love Megan Whalen Turner's storytelling voice and how it sweeps you along on a magical adventure every time you open one of her books. Another collection of short stories to amaze!"}, {"userName": "Katherine", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/4455057-katherine", "userReview": "The elf story is the strongest one, but the others were a bit uneven, a little predictable, and didn't hang together as a collection all that well. Not necessarily satisfying if you've been re-reading The Queen's Thief books recently and just wanted more of that (HYPOTHETICALLY)."}, {"userName": "Doria Waldner", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/60478683-doria-waldner", "userReview": "The Baker King and Instead of Three Wishes were the BEST! You can see Megan Whalen Turner's writing coming out fine and clear, and the Baker King has the same political elements that Queen's Thief has...they are awesome!"}, {"userName": "Mabel", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/20820677-mabel", "userReview": "Cute little spins on traditional fairy tales/fantasy!"}, {"userName": "Billy B", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/895689-billy-b", "userReview": "LOVED THIS."}, {"userName": "Kristi", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/1957828-kristi", "userReview": "HAD to read it, since I have read all the Thief books."}, {"userName": "Scoper", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/75248427-scoper", "userReview": "Short, but fun. Enjoyed all of the stories and wished there were more."}, {"userName": "Ruth Anna", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/16906873-ruth-anna", "userReview": "Quirky short fairy tales - very fun!"}, {"userName": "Kristin Hoffpauer", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/26385332-kristin-hoffpauer", "userReview": "There's only one way I can describe these stories. Absolutely delightful!"}, {"userName": "Deep S", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/22012628-deep-s", "userReview": "Being a Big fan of the ATTOLIA word and whelan's stories, there is no surprise that I picked this book.Magical world and stories always fascinate me. This book is short and the stories short and very crisp.I loved 2 stories in particular , INSTEAD OF THREE WISHES & THE BAKER KING.Baker king being the best and closest to the attolia stories.Other stories were good too.Overall a Sweet and Nice experience reading the stories.4/5 Devil D"}, {"userName": "Andrew Hicks", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/29779942-andrew-hicks", "userReview": "Instead of Three Wishes\n, from 1995, is Megan Whalen Turner's debut. Turner is best known for 1996's \nThe Thief\n, a YA fiction classic that begat a number of sequels and was itself a tightly plotted fantasy with mythology that didn't annoy me and a twist I didn't see coming. Eventually, I'll get to the \nThief\n sequels, but in the meantime I was perfectly happy to read \nInstead of Three Wishes\n's quick 130 pages over the course of an evening's free time.This book is comprised of seven short stories, unconnected but all dealing with some fantastical element or another. Turner, in an interview I read somewhere, said the trick to creating a good short story is to: a) devote just as much attention and care to world-building as you would a full-length novel, and, b) include an A-story and a B-story, both with satisfying resolutions. The quality of stories in this collection varies, and mainly what's lacking here (when there's something lacking) is in the plotting and resolution departments, but the book zips right along, enjoyably. As a reader, I felt enveloped by the atmosphere and description - Turner is a wizard at turning a phrase - from beginning to end. If this book was twice as long, or if another book just like it existed, the momentum would no doubt carry me through to a quick finish.Highlights include:- \"The Factory,\" in which a young new hire at a mysterious factory is placed on a job by himself, way up in the rafters. The previous three men to hold the job couldn't take it, and we're not sure why, but we think it has something to do with the ghosts. Although we are not allowed to talk about the ghosts.- \"The Nightmare,\" which pleasantly reminded me of the old Stephen King short stories I read in collections like \nSkeleton Crew\n. A nasty school bully jokingly attempts to mug a poor single lady and ends up in possession of her terrible affliction - sanity-destroying chronic bad dreams you can't shake until someone unwittingly demands them from you.- \"Aunt Charlotte and the NGA Portraits,\" constructed almost entirely of backstory told by Aunt Charlotte to her niece, about the youthful summer she spent at the lake with her dad, in isolation, save the one strange lady who had the painting you could walk into.\nInstead of Three Wishes\n, unlike most of the reading material in my ongoing YA odyssey, was actually found in the kids' section of the library. Indeed, at the age of 10 or so, I would've loved this book, had it existed. As an adult, it was still easy to give \nThree Wishes\n respect and admiration on its own level - even in a debut collection of literary hors d'ouevres, you can tell Turner's voice as an author will be one to be reckoned with."}, {"userName": "Elevetha ", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/11828657-elevetha", "userReview": "[ Selkie!! I knew it, I knew it! (hide spoiler)]"}, {"userName": "Josiphine/Tessa", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/6575298-josiphine-tessa", "userReview": "[I'm usually not a big ghost person, but this one didn't bother me. I'll read it again. (hide spoiler)]"}, {"userName": "Kendra", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/1713151-kendra", "userReview": "Instead of Three Wishes: Magical Short Storiesby Megan Whalen Turner160pp USAEos 5.99ISBN 9780060842314A annoying elf prince trying so hard to get a unwilling girl a gift.A leprechaun sighting all you need to know. Leroy and the roaches giant and small.A factory worker and a ghost girl having a fateful meeting.Olga the mysterious and the NGA painting.Nightmares for those who are not careful what they wish for.A prince who returns not to be king but someone else.The elf prince, his mother, and unwilling girl and her mother all wanting something different but in the end all getting together and having a good tea time,eating pastries. The trouble of a leprechaun the help of a gold coin and a phone call.Leroy goes back in time and helps out prehistoric Sweden.A beautiful voice, a mysterious women,a puzzle in a painting,and a little girl who loves solving puzzles.Chocolates and book for two ghosts.A imaginary glob when you ask for something you shouldn't have.I recommend anyone to read it because there are the many kinds of stories. And all are very interesting like the one about nightmares.Here is a quote which will make you want to find out more : Whatever you got Kevin,i want it.Do you understand?... He cupped his hand around invisible jello and tossed it in to the older boys waiting hand.Or when the prince thinks the girl expects a reward and hands her 3 small business like cards.And they are  Wishes."}, {"userName": "Andrea Wall", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/4611476-andrea-wall", "userReview": "When I read this book I kept imagining me reading it to my future children. I do not know why.These are are cute/great fantasy stories. For the most part. Unfortunately there were some not-so-great ones too. The first one and Instead of Three Wishes were predictable and didn't really interest me. It was worrisome when I started this book. It reminded me of a sophisticated child writing, not the brillant-it-makes-me-feel-stupid style of writing that I joined to Turner in my head. I was worried. But I kept reading cause I always finish a book (Usually) and I knew it was technically a children's book, so my expectations should be a bit different. So here is my advice for this book: KEEP READING!! Factory will make you happy and actually make you pause for a minute. Factory is five stars. The rest are all a steady three, maybe 3.5. I'm glad I kept reading. It was light and lovely fantasy. I think it could make children actually get into fantasy. Like I said before, I picture me reading it to my children. :p Don't let the stupid (and ugly) cover stop you. Don't let the not-so-great first story stop you. It's a worth-it read and it will take you a day. If you like fantasy you'll like this. (I think. I make no promises of course.)"}, {"userName": "Kristine", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/582776-kristine", "userReview": "In my extended, continuing search to read every word written by Megan Whalen Turner, I've been led here: one of her first published works (and she doesn't have many). I read a few of the short stories and decided Ellie would like them so much we're starting over but 'reading aloud' this time. Last night Ellie informed me that 'it's boring'. So I just finished it myself. This is a collection of short stories that would probably fit a 4th grader better. I really liked them. MWT con put so much complexity into her plots it will blow you away. But these weren't like the Attiola series. You can still hear her voice and sense of humor, and things happen in every story that might surprise you and make you think. MWT certainly likes characters that follow the beat of a different drummer, which I love. Some stories are better than the others, but it is one of her first published works.If you have a tween, I'd recommend it."}, {"userName": "Kate Brown", "userReviewDate": "Aug 11, 2015", "userURL": "http://www.goodreads.com/user/show/17617291-kate-brown", "userReview": "Not a great, but not a terrible collection of magical/fantasy short stories. This book is part of the Schoolwide collection of mentor texts for the fiction unit in 7th grade. There are seven stories in the collection including; \"A Plague of the Leprechaun\", Leroy Roachbane\", \" Factory\", \"Aunt Charlotte and the NGA Portraits\", \"Instead of Three Wishes\", \"The Nightmare\", and \"The Baker King\". My favorites were \"Factory\" and \"Aunt Charlotte and the \"NGA Portaits\". In \"Factory\" there is a man who must work on the crane at the top of a factory. He discovers that all employees who held this job before him quit when they started seeing ghosts. In \"Aunt Charlotte\" an older woman shares a story of how she entered a painting of Venice and attempted to track down a fur coat belonging to a strange and mysterious woman. Both had strong themes and were easily relatable. The other stories dragged in some parts and seemed to have extra information that was not always necessary in building their plots."}, {"userName": "Kenzie", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/26207268-kenzie", "userReview": "This was a delightful book of short stories. I read them in between classes at school, or when I got finished with my in class assignment. I also read a couple before I went to bed at night. It was very nice to have something short enough to squeeze in my, otherwise too busy for a novel schedule, but still long enough to be enjoyable. Here are my ratings on each of the short stories within. These ratings are based solely on my own personal taste and how much I enjoyed them. It could be drastically different for many other readers.A Plague of Leprechaun - 4.5 stars (Delightful!)Leroy Roachbane - 3 stars (Fun one.)Factory - 5 stars (Intriguing.)Aunt Charlotte and the NGA Portraits - 5 stars (It was on the long side, but the story was rather lush and imaginative.)Instead of Three Wishes - 3.5 stars (It was humorous, but wasn't quite as interesting as I hoped.)The Nightmare - 2 stars (I just didn't know what to think by the end of this one.)The Baker King - 2.5 stars (There were interesting ideas, and the start of something bigger, but it didn't seem quite fulfilled.)"}, {"userName": "Jamie (ReadsInTrees) Dacyczyn", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/5407713-jamie-readsintrees-dacyczyn", "userReview": "2016 Reading Challenge: A book of short stories.I can't imagine that I haven't read this book before (since MWT is the author of my favorite series of all time), but none of the stories felt familiar. Well, now I have read it for sure.I'm giving this one a 3.5. I don't particularly care for short stories because there just isn't enough to to get to know the characters that much, or to really dive into the worlds within the stories. Still, I found a few of these stories charming enough that I didn't dislike the book. \"The Factory\" was probably my favorite, being a story that included a bookish ghost girl. I also appreciated \"The Baker King\" because the setting where it took place reminded me a bit of Sounis/Eddis/Attolia where the aforementioned favorite series takes place. I might add this one to my collection, just to HAVE it since it will complete my collection of MWT works (which, by the way, is way too sparse because it's been SIX YEARS since the release of the last book!!!)."}], "description": "A leprechaun is sighted in small–town New Hampshire. A city boy becomes a hero in prehistoric Sweden. An elf prince tries to reward a girl who wishes he'd just leave her alone. In these and other delightful stories, magical adventure appears in the most unexpected places!Instead of Three Wishes is a captivating collection of witty and sparkling fantasy stories from the Newbery Honor author of The Thief.Ages 10+", "title": "Instead of Three Wishes: Magical Short Stories", "url": "http://www.goodreads.com/book/show/40157.Instead_of_Three_Wishes", "average": 3.77, "cover": "https://images.gr-assets.com/books/1386923884l/40157.jpg", "reviews": 119, "authors": [{"url": "https://www.goodreads.com/author/show/22542.Megan_Whalen_Turner", "name": "Megan Whalen Turner"}], "type": ["Fantasy", "Short Stories", "Young Adult", "Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/40157.Instead_of_Three_Wishes", "http://www.goodreads.com/book/show/936725.Instead_of_Three_Wishes", "http://www.goodreads.com/book/show/936724.Instead_of_Three_Wishes", "http://www.goodreads.com/book/show/448873.The_Thief", "http://www.goodreads.com/book/show/40158.The_Queen_of_Attolia", "http://www.goodreads.com/book/show/40159.The_King_of_Attolia", "http://www.goodreads.com/book/show/6527841-a-conspiracy-of-kings", "http://www.goodreads.com/book/show/8306741-thick-as-thieves", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}