{"ratings": 173, "userreviews": [{"userName": "The Reading Bibliophile", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/16424516-the-reading-bibliophile", "userReview": "Un thriller/polar d'une redoutable efficacité et une réflexion sur plusieurs sujets douloureux.https://readingbibliophile.com/2016/1...3,5/5"}, {"userName": "Brett", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/3089943-brett", "userReview": "eh, standard formulaic kidnap thriller I guess - there were some interesting quirks, probably make a decent movie I guess, didn't see anything different enough or stylistically unique enough to really rave about it but it was a good story."}, {"userName": "Dave Wayne", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/53633993-dave-wayne", "userReview": "A worthy suspense novel. I could not put it down! My entire family wound up reading it... we all agreed it was a really fine thriller. Well-written, though the ending was a tad implausible."}, {"userName": "Catrina Bradley", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/2054273-catrina-bradley", "userReview": "A literal page-turner! I read this book in one sitting. I had to stop reading a few times and take deep breaths to stop my heart from racing."}, {"userName": "Kathy", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/10910494-kathy", "userReview": "Excellent thriller that kept me racing to the end."}, {"userName": "Nick", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/23015771-nick", "userReview": "Excellent!"}, {"userName": "Elke", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/1105232-elke", "userReview": "I chose this novel on impulse, based only on the summary. In the Night Season provided a very intense reading experience and was a real page-turner.Plot summary:It all begins with racist motivated hate mails directed at Ed Bishop, the black neighbor of recently widowed Nora Michaelson, who takes care of her son in the afternoons while she is still at work. When Ed Bishop is murdered, everyone suspects that the so-called \"Virginia Front\" is behind this crime, putting into action their announced threats. But as it turns out, the murder is related to some illegal business Nora's husband Jack was involved with. Now Nora and her son are at the mercy of Jack's partners, who are desperately searching for something Jack hat in storage. This is when Nora's world is turned upside down and the last years of her married life turn out to be a lie, throwing her into an cat-and-mouse game for her and her family's life.My two cents on the novel:The story gets by on only a handful of people and places, providing a strong feeling of intensity, like watching a play onstage sitting in the first row. Through the whole novel you are kept in a constant state of tension. At first I was craving for an explanation for what's going on, then I was anxious to find out about the mysterious something everyone was after and wether it would be found or not. The outcome was not completely unexpected but nonetheless suspenseful to the end."}, {"userName": "Debra", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/4816194-debra", "userReview": "Stephen King recommended book. In his book On Writing, published 2000, King says on pages 285-286: \"These are the best books I've read over the last three or four years, the period during which I wrote The Girl Who Loved Tom Gordon: A Pop-up Book, Hearts in Atlantis, On Writing, and the as-yet-unpublished From a Buick 8. In some way or other, I suspect each book in the list had an influence on the books I wrote.\" He continues to say \"...a good many of these might show you some new ways of doing your work. Even if they don't, they're apt to entertain you. They certainly entertained me.\"Please click here to check out my group:\n Books Stephen King Recommends"}, {"userName": "Mary", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "Nora Michaelson and her eleven-year-old son, Jason, are both going through a difficult adjustment after the accidental death of Jason's father, during a time when the family's small business was failing. The loss of Jack Michaelson has left his wife and son nearly destitute. It has also placed their lives in jeopardy from several people who it is very dangerous to cross. This is a story of terror, and resourcefulness in the face of terror, from a master storyteller.I really enjoyed this book; it was such a good read for me. I liked the plot and the characters, and got sucked into the story so that I had to find out what happened next. The tension was palpable, and I gave this book an A+! I must say that Richard Bausch is a new author for me - In the Night Season: A Novel is actually the first book that I've ever read by this author, but I will certainly be on the lookout for more books by Richard Bausch to read in the future."}, {"userName": "Frederick Bingham", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7252906-frederick-bingham", "userReview": "A thriller about a mother and her son. Her husband died in an accident several months previously. A group of thugs show up at her house suddenly one day looking for a mysterious package. They take her and her son hostage and use them to help search her house.A local sheriff (the story is set in rural Virginia) finds a neighbor murdered and is investigating it, along with a series of racist letters he had been receiving anonymously. It turns out the neighbor was killed by the thugs looking for information."}, {"userName": "Richard J. Alley", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/1087173-richard-j-alley", "userReview": "A word about my ratings. I don't adhere so well to the star rating system. If I like a book a lot, it gets three stars. If I dislike it, one. Don't read so much into what it all might mean, it's very simple, if I like a book and think you should read it, it gets three stars. Five stars are not for mortals. Five stars are reserved for bananafish, Gatsbys, potato barns, Havishams and lords of the apes.Many times I will expound on a book or books at my blog, Urf! (http://uurrff.blogspot.com). Come see me there!"}, {"userName": "Gerry", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/11108005-gerry", "userReview": "This one-day read grabbed me at the start and never let go. Nora and her 11-year-old son Jason are being terrorized for something they know nothing about, secrets Nora’s husband took with him to the grave when he was killed in an auto accident. Paralleling their story is that of Phil Shaw, who lost his son in a drowning incident and whose marriage couldn’t survive that devastation -- and who begins to find redemption in building a new relationship with Jason."}, {"userName": "Kyra", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/1510307-kyra", "userReview": "Interesting book. Well written, suspenseful and well-paced. So why only a measly 2 star rating ? The entire time I was reading this book, I felt as if I were watching a black and white cop show from the 1950s - perhaps an episode of Perry Mason. The characters, the dialogue, even the action are all for some reason very old-fashioned and thus a bit clunky. This created a sort of odd disconnect between what was going on in the book and what it actually felt like. An uncomfortable feeling."}, {"userName": "Sibel", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/804413-sibel", "userReview": "The violence in this one is pretty unmitigated and is approching the border of being too much. I also think Bausch is one of those male authors who doesn't write women very well. That said, it's terrifically suspenseful (and a quick read). But this may be too stressful a read to recommend."}, {"userName": "Shonna Froebel", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/14633278-shonna-froebel", "userReview": "Very good."}, {"userName": "Lynn", "userReviewDate": "Dec 12, 2009", "userURL": "http://www.goodreads.com/user/show/1483254-lynn", "userReview": "An intense crime novel which details the psychological trauma. Lots of description and very engaging."}, {"userName": "Diane", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/4466764-diane", "userReview": "Suspense novel set in rural Virginia, a good scary read."}, {"userName": "Debbie Prothero", "userReviewDate": "Feb 19, 2016", "userURL": "http://www.goodreads.com/user/show/15258033-debbie-prothero", "userReview": "Chilling and suspenseful. It will have you holding your breath."}], "description": "Nora Michaelson and her eleven-year-old son, Jason. are going through a difficult adjustment to life after the accidental death of Jason's father. at a time when the family's small business was failing. The loss of Jack Michaelson has left his wife and son nearly destitute. It has also placed their lives in jeopardy. This is a story of terror, and resourcefulness in the face of terror, from a master storyteller.", "title": "In the Night Season", "url": "https://www.goodreads.com/book/show/552142.In_the_Night_Season", "average": 3.64, "cover": "https://images.gr-assets.com/books/1347314169l/552142.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/82718.Richard_Bausch", "name": "Richard Bausch"}], "type": ["Thriller", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/552142.In_the_Night_Season", "http://www.goodreads.com/book/show/15905664-la-saison-des-t-n-bres", "http://www.goodreads.com/book/show/1281322.In_the_Night_Season", "http://www.goodreads.com/book/show/9454826-in-the-night-season", "http://www.goodreads.com/book/show/2454475.Peace", "http://www.goodreads.com/book/show/17582.The_Norton_Anthology_of_Short_Fiction", "http://www.goodreads.com/book/show/323103.The_Stories_of_Richard_Bausch", "http://www.goodreads.com/book/show/18473919-before-during-after", "http://www.goodreads.com/book/show/6716245-something-is-out-there"]}