{"ratings": 21661, "userreviews": [{"userName": "Nicole", "userReviewDate": "Jan 25, 2008", "userURL": "http://www.goodreads.com/user/show/201360-nicole", "userReview": "I wanted to like this book. The story was great and I loved the concept, but there were too many things that ended up annoying me. On the positive side, it was very well written. I did love the character Fiammetta. I wish the book had focused on her throughout. And I liked the descriptions of courtesan life and of Venice. I especially liked the fact that the author took a real painting by Titian and seemingly created a story around it. Now for the less positive stuff. [Spoiler Alert] About 3/4 of the way through the book, the plot abruptly changed from focusing on the two main characters, Fiammetta and Bucino, to a secondary character, La Draga. This wouldn't have been a problem, and it was interesting in and of itself, but it had very little context, and it seemed a bit hastily thrown in at the end. I found it somewhat unbelievable that Bucino would just \"discover\" that he was in love with her. There wasn't really any motivation, except that he bumped into her a lot throughout the book, thought she was weird, and was annoyed by her.There were also a lot of small plot details that could have been developed but instead seemed to be randomly picked up and dropped along the way. For example, the Jewish pawnbroker makes a few appearances, disappears for a long interlude, and then briefly returns, only to contribute nothing to the story and disappear again. The Turk seems interested in Fiammetta, spends some time trying to convince Bucino to return home with him, and never appears again. The author describes a turbulent, vicious prior relationship between Fiammetta and Aretino, only to have the two instantly become friends in Venice, which didn't seem terribly believable, especially given that Fiammetta is blackmailing him. Also, the half-hearted way in which the two main characters sell pages out of their infamous book to help La Draga, when they could have been using it all along, annoyed me. It all just seemed a bit sloppy.All in all, this was a good story and the perfect thing to read on vacation, as long as you don't get all nitpicky over the plot like I did."}, {"userName": "Doug Bradshaw", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/808994-doug-bradshaw", "userReview": "Set in the 1500s in Venice, Dunant gives us a sometimes raunchy, sometimes touching and always realistic view of the world in this era. The book is written by the partner/manager of a gorgeous \"courtesan\" which I like to think of as more like a geisha than a prostitute, but make no mistake, our heroine is a high end prostitute and entertainer of rich men of the era. The partner is an extremely likable, insightful, resourcesful dwarf who is well aware of his position in life as a freak and sometimes entertainer and court jestor. I laughed out loud many times at his views and comments about himeself, other people's reactions to him as well as his general take on things that works today. The partnership of the two works extremely well as they escape without much but their lives from Rome which is under siege and then move to Venice to carefully try to rebuild their whole business. Our courtesan has lost her hair and her confidence. With the help of a blind healer, they find their way back into business as usual and then the fun begins with the various and sundry wealthy clients, friends from the past, etc. There is humor, there is wisdom about human sexuality, there is history and there is a great and touching story."}, {"userName": "Amalie ", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/4164661-amalie", "userReview": "For starters, the title and the cover page of this really can mislead you! \"In the Company of the Courtesan\" sounds erotic and this is the cover page of my book which I can't find here (I'm guessing Amazon must have stolen it!): I started to read this while going to and coming home from work and I began to notice some are staring at the cover :) so I started to read this before going to bed. Anyway there is no noticeable erotic content in the novel although it is an insider view of the business of high-end prostitution. The novel's name however is also misleading because it should be something like \"In the Company of a Dwarf\" or if you want to go with the job description, \"In the Company of the Pimp\". Because the narrator/the protagonist of this is Bucino Teodoldi, the pimp of Fiammetta Bianchini, the Courtesan. Bucino may be a dwarf but his observations are often philosophical, sour, ironic but always honest and smart. The deep understanding relationship between them is also unique. They highly rely on each other, understand each other and honest to each other. But the most interesting relationship in the book is between La Draga, the healer & Bucino whose relationship put Fiammetta into the background.In short, the novel is about 3 sinners/misfits of Venice, the sin city full of sinners during 16th century: Bucino, a deformed pimp, La Draga, a female healer branded as a witch and Fiammetta, a young courtesan/prostitute. This book has most everything you would want in a historical fiction. It's well-researched and the sights, sounds, smells of 16th century Venice are almost lifelike. You can imagine you are there. So if you feel like it's too long don't give up! You'll not regret a minute of holding onto this."}, {"userName": "Savvy ", "userReviewDate": "May 28, 2008", "userURL": "http://www.goodreads.com/user/show/1194018-savvy", "userReview": "Having had the pleasure of being in an on-line book discussion of IN THE COMPANY OF THE COURTESAN last year with Ms. Dunant, I came away with a much finer appreciation of the historical honesty of this novel! A few months ago, I had the opportunity to finally meet Sarah Dunant at a book reading and signing of this book in Seattle. Her passion for history is evident and just listening to her enthusiastic account of the research she does in crafting her novels was awe-inspiring! As she read a few passages, she took me back to the sights, smells and shadows of life of a courtesan called Fiametta (little flame in Italian) and her companion and business partner, the very clever and endearing dwarf, Bucino! Sarah's artistry with words brings everything alive with a master touch! When little Bucino (who is deathly afraid of the canals of Venice, certain he'll drown in them) passes along the narrow walkways, hugging close to the building, you are standing there feeling a bit green and vertiginous alongside him! Descriptions are so vivid and characters are so well developed, that it's easy to move around inside the deceitful society that was Renaissance Italy. Sarah shows us that this is a society built on religious beliefs and rules and the rules those beliefs put in place, but in reality, it's equally built on the acceptance of deception, fraud, and dishonesty. Priests give fake confessions for money, men deceive their wives with courtesans and courtesans deceive men with their own fake sense of pleasure. Sarah tells us in one of her posts. \"One might argue that the only time in which man is/was not in deception is when faced with God, who by definition knows and sees everything. Interesting I am not sure that God is in this book. Certainly he/she is less present within the characters than say in THE BIRTH OF VENUS.\" The Courtesan will not disappoint! The story is richly rewarding on multiple layers. The mix of real characters (Aretino, the writer and poet...Titian, the artist) with the fictional (Fiametta, Bucino, La Draga, etc.) works very well in the novel! They come boldly and fabulously alive...and we are left standing beside them with all of their hardship, grandeur, and decadence...thanks to the consummate and very gifted wordsmith that is Sarah Dunant! I can hardly wait for her next novel!!!"}, {"userName": "Alice Poon", "userReviewDate": "Dec 25, 2016", "userURL": "http://www.goodreads.com/user/show/28700577-alice-poon", "userReview": "After reading “Blood & Beauty: The Borgias”, I always wanted to read another novel by Sarah Dunant. At some Goodreads friends’ nudge, I decided to pick this one up. Throughout the first three-quarters of the book I was more emotionally twined with the character of the dwarf Bucino than I would care to admit. The fact that he is also the first-person narrator is supposed to give immediacy and sense of reality to the scenes and things happening to him, but I must confess that I consciously and stubbornly clung to my skepticism. However, by the time I reached the denouement, I was obviously already too invested in him to be able to detach myself from his pain and anguish, or hold back my tears. That Dunant is a brilliant writer needs no further proof.The plot would seem simple enough but nonetheless enthralling: a famed courtesan Fiammetta and her dwarf Bucino must escape the carnage of Rome’s invasion by foreign powers and are forced to find their footing again in prospering Venice, where they meet their friends and foes. With their loss of a precious jewel, we are led down a path of intrigue behind a veil of fog when Fiammetta’s healer and friend – a blind hunchback called La Draga – starts to snatch our attention. From that point on, I was loath to put the book down. The ending didn’t surprise as much as it saddened me.Apart from being a skillful storyteller, the author is also adept at painting a vivid picture of 16th century urban Venice. In true historical fiction form, real historical characters abound in the novel to enhance the sense of place and time: painter Tiziano Vecellio (or Titian), engraver Marcantonio Raimondi, writer Pietro Aretino, painter Giulio Romano, and healer Elena Crusichi (fictionalized as La Draga).I’m giving this novel 3.7 stars. [Warning: the language may be a bit raunchy for some readers’ taste.]"}, {"userName": "Jeanette", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Two superlative protagonists- partnered but never lovers.A singular woman who cuts through boundaries and forbidden studies for her time, and yet heals as much as she deceives.Three under characters who are defined more precisely to their actions and with deeper onion like layer complexity than a titled figure of and in a play by Shakespeare. Just superb in any one of 3 other categories outside of these prime personalities because it is also of a piece. Mood, progression, knowledge- all increasing as years pass. Losing portions of one thing, but trading them for something else. Often nothing of what was expected. Not even for trust or the most \"known\". Plotting and pacing! Reveal and then anti-reveal. Immaturity in forms and content, and then growth to a formidable full adulthood. But in some ways also incorporating the universal human conditions. More than a few, but most kernel like- that condition of difference, or of being \"the other\". All sublime in their levels of recognition.And if that's not all- it also has within it the most finely evaluated ingredient content for the essence of one city in mid-16th century Italy against another's. The best I've ever read myself for their tone and approach in conversations. This context/ particular set of sensibilities and \"eyes\" for the Roman. And now for the Venetian. And it still exists to this day.The beginning was off-putting to me. It took my attention into a distraction that until the entire combination set \"in\" to see the entity of the pair working their skills. All the pragmatism! Until then, I had a difficult time setting the crude and foul temper meanness of language, aside. But DO continue. Sarah Dunant truly has created a cast to remember in this one. And she also knows about the black fractions of millions of pieces of solid that live in the water at night. This is the world of dark bodies of water. Of lakes and lagoons everywhere.Strongly recommend. Very few physical, mental, or emotional human commodities of natural occurrence are obscured in this book. It's often raw and it often tends to seductions. Not only to the biological impulses, but to levels of other comprehensions, most forbidden to those who hold them.Come and watch Bucino juggle the Murano glassware duds, the throwaways. And live within his mind these years."}, {"userName": "Chrissie", "userReviewDate": "Jul 06, 2008", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "I totally loved this book. What a story! Pure escapism into a real historical past. Marvelous - such a good story. At the end of the book the author clearly states what is fact and what is fiction. I had already looked up several of the characters and deeds. This book and Wikepedia make history into an engaging story. Five stars. I have read through page 110. Wonderful entertainment. The reader is pulled into Venice of the 1500s. You are there with the dwarf, the courtesan and the sparkling, mpving water and shimmering lights of that world."}, {"userName": "Susan", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/43420-susan", "userReview": "I kept waiting for this to be lusher and smuttier than it was. The story follows the dwarf companion of a renowned courtesan in Venice's heyday. It starts with a dramtic escape from Rome as it's being sacked by some sort of protestant infidel, and watches the courtesan trying to make a name for herself in a new city as she befriends a strange, witchy woman. The relationship between the dwarf and the courtesan is the important one, but lacks meat until the book is nearly over. It's telling that I returned from vacation, picked it up to finish it, and had forgotten that I already had. Meh."}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "Jun 08, 2008", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "Bucino is a dwarf employed by one of the most favored courtesans of Rome, Fiammetta Bianchini. When Rome is sacked by Spaniards and Lutherans in 1527, Bucino and Fiammetta barely escape with their lives and a few jewels they managed to swallow. They are forced to start over again in Fiammetta's native city of Venice. The going is slow at first, but they are both determined to rise to the top again, with the help of some unlikely accomplices.This was really about 3.5 stars. I enjoyed reading it, I liked Bucino, and I truly enjoyed reading about Venice. But towards the end I started asking myself what the point of the whole thing was. It didn't really seem to be going anywhere. When it did finally get to something like a conclusion, it was all over pretty quickly. I would have liked a little less build-up and a lot more exploration of the final conflict, for lack of a better word. As it was, I felt like the ending sort of came out of nowhere. And I don't mean that in a good way. Also, looking back at the beginning of the book to remember how to spell Fiammetta's full name, I realized that her character really wasn't very consistent. Her moods and really her overall character seemed to shift to suit whatever needed to happen next in the book. Sometimes that makes a character seem more real, but in this case, it felt like the author didn't know how to get the story where she wanted it to go without changing Fiammetta.I would recommend this book if you're going to Venice soon (I am! Lucky me!). I'm so excited to go see the places that Sarah Dunant described so well! But for a great Renaissance-era book set in Italy, I think I would recommend Susan Vreeland's Passion of Artemisia instead. It's been a while, but I remember that book pretty well, and I think In the Company of the Courtesan will fade pretty quickly from my mind."}, {"userName": "Laurie", "userReviewDate": "Oct 22, 2007", "userURL": "http://www.goodreads.com/user/show/255327-laurie", "userReview": "I liked this book alright. The story was interesting enough to keep me flipping pages. I do have sort of a bone to pick over the narrative voice, though. Enter Bucino: affable dwarf, loyal friend, astute business partner, curious bed buddy, annoyingly detached story teller...I had a tough time bonding with the characters in this story; I don't feel like I really got to know any of them. As the narrator, Bucino kind of peripherally describes events and characters' feelings about said events, but you never feel present in the story's action and you can't really grasp the characters' emotions or motivations. I'm reminded of the \"show not tell\" mantra from Middle School Language Arts class. Dunant might have been better off writing this story after hanging out with Ms. Phillips for a semester or two."}, {"userName": "Janice", "userReviewDate": "Mar 20, 2007", "userURL": "http://www.goodreads.com/user/show/32653-janice", "userReview": "While I enjoyed Dunant's first novel, The Birth of Venus moreso than this work, I think she has a great knack for writing extremely interesting characters. Bucino is a great hero for her novel and she also does a wonderful job of characterizing 16th century Venice as well. The novel started off quickly, however the middle moved VERY slowly and made the ending less exciting. I was hoping for more of a resolution, and more exposition, but in the end the book doesn't really need to provide the reader with a concrete conclusion. I'd love to see this made into a film. I think Peter Dinklage would make an astounding Bucino - hopefully someone will option the book and do right by the source material."}, {"userName": "Kate Quinn", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/2232084-kate-quinn", "userReview": "For once, a novel that does not romanticize the life of a courtesan. Sarah Dunant continues her mastery of the Renaissance in her second novel, which details the adventures of the Venetian courtesan Fiammetta and her dwarf companion Bucino. The dwarf is the narrator, cynical and worldly, and behind his clowning role at his mistress's back they have forged a shrewd partnership. Fiammetta is a delightful mix of beauty, vanity, courage and desperation as she is left destitute after the Protestant sack of Rome. She returns to the waterways of Venice to make her fortune all over again, and Bucino acts as friend, confidante, manager, and business partner. They endure poverty and persecution, winning their way to riches - but more subtle dangers await the pair when Fiammetta turns from her rich and aging clients to fall in love for the first time in her life. Salvation or damnation lies in the hands of La Draga, a young blind healer whom Bucino has never trusted. Powerful storytelling and a surprising twist power the story along, told in Bucino's world-weary voice."}, {"userName": "Phyllis", "userReviewDate": "Mar 31, 2008", "userURL": "http://www.goodreads.com/user/show/879601-phyllis", "userReview": "This book was great, as the plot was creative,the characters interesting and there was lotsof action. At first I figured that I wouldn'tbe able to relate well to the story of a courtesanand dwarf, but the themes of love and friendship,hardship and politics, drew you into the story.Sarah Dunant is a talented author, I enjoyed heruse of analogies. I especially liked reading about Venice in the 1500's, and thought heraccount of the times was well documented. Of course I checked the net to see the completepainting of Venus of Urbino."}, {"userName": "April Cote", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/3235570-april-cote", "userReview": "A beautiful novel rich in detail, adventure, and history. A story of a beautiful friendship that is completely out of the norms for the time, and their struggle to survive the hardships of life and scandals of a courtesan and a dwarf. Highly recommended for lovers of historical drama and political and society scandal."}, {"userName": "Arttemizza", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/7462102-arttemizza", "userReview": "Achei o enredo muito interessante e mais ainda quando verifiquei que o narrador é um anão que tem uma relação de criado/amizade com uma cortesã. A acção central baseia-se essencialmente no processo que envolveu a crescimento da notoriedade de uma cortesã que se refugiou em Veneza após ter fugido de Roma devido à guerra. Gostei das descrições dos ambientes da altura e da sociedade, no entanto, considero que o desenrolar da trama é muito lento e muitas das vezes faz perder o interesse pela leitura. Sou uma romântica e por isso adoro que um livro que me brinde com um pouco de romance, ora neste livro, só após mais ou menos 290 páginas é que se tem um cheirinho de romance e acabou por se revelar tão levezinho que nem deixou marcas. Bom, nesse aspecto para mim foi uma desilusão já que andei todo o livro à cata de algo que não se concretizou. Para além de o titulo dar a entender que talvez aparecem cenas de cariz mais erótico isso não acontece.Tenho sempre alguma dificuldade na leitura dos livros desta editora por causa do formato da letra e dos espaçamentos e isso reflecte-se num abrandamento na leitura. Neste caso a escrita da autora acabou por ajudar a avançar mais rapidamente, o que me surpreendeu, já que, ela não tem “papas na língua” e trata tudo pelos nomes, sem grandes jogos de palavras, é uma escrita nua e crua, muito preto no branco."}, {"userName": "melydia", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/1264081-melydia", "userReview": "Our story begins with the 1527 sack of Rome, and famous courtesan Fiammetta Bianchini is readying her household for the soldiers' arrival. She and her dwarf companion Bucino, who narrates this tale, flee to Venice to start their lives over again. The description pulls no punches, as it were, laying it all bare without nary a euphemism in sight. But it's not just crudeness and filth that is described this way, but great beauty and purity is as well. All in all, a sumptuous presentation of Renaissance Italy as told through the eyes of a cranky dwarf. I wish there had been more plot - I would have liked to know more about what happened to the Jew and the Turk, for example, and that more ends had been tied up by the end - but I suppose that isn't always possible with first-person narration, and the looseness of the story did make it feel more realistic. I especially appreciated the historical notes at the end, explaining which characters were based on real people and where things deviated from fact. It appears there's nearly as much history as fiction in this historical novel. I'll definitely be on the lookout for more by Dunant."}, {"userName": "Sara Giacalone", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/2548242-sara-giacalone", "userReview": "I thought this book was absolutely fantastic. I loved the setting (early 16th century Venice, with a little Rome thrown in for fun), the characters (especially the dwarf, who's point of view we share), the story and detail, and especially the ending which felt so satisfying. I know I will be reading it again, probably more than once."}, {"userName": "Michelle", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/808405-michelle", "userReview": "This is the second time that I have enjoyed a story by Dunant. This time, a risqué tale, narrated by the humorous dwarf Bucino of his ventures with his courtesan sidekick in 16th century Venice. A real treat to enjoy the last pages in the sunshine of an April day!"}, {"userName": "Pauline Montagna", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/9460135-pauline-montagna", "userReview": "I was rather disappointed in Sarah Dunant’s previous venture into Italian historical fiction so I approached this book with some reservations. Happily I found it to be a much more successful novel.The story begins in 1527 on the eve of the infamous Sack of Rome. The dwarf Bucino goes to the walls of Rome to find out the latest news for his mistress, the beautiful courtesan Fiammetta. Warned of the imminent arrival of a marauding army of war-hardened Spaniards and fanatical Protestant Germans, Fiammetta devises an ingenious strategy. Rather than run or hide, she will charm the invaders with her wit and beauty. The plan almost succeeds, but even the resourceful courtesan cannot escape the city’s fate. Having been stripped of her beautiful hair and most of her belongings, Fiammetta persuades Bucino to join her in escaping to Venice where she was born. There, with the help of a hunchback and half blind wise woman, known as La Draga, Fiammetta slowly regains her beauty and confidence and re-establishes herself as a successful courtesan.A large part of the novel’s charm lies in its depiction of Venice, its culture and its physical beauty, all the more engaging as the city is seen through the eyes of a narrator, Bucino, who arrives in Venice already prejudiced against it, but who unconsciously comes to love it. But fundamentally, its major success lies in its characters. Each of them is well-rounded and finely drawn, especially Bucino.And there, I feel, lies the reason why this is a much more successful novel than The Birth of Venus. Here, Ms Dunant has not attempted to get inside the Italian family, an insular institution not easily penetrated by the unfamiliar, but has instead created a cast of outsiders who are therefore free to create individual lives and forge unique relationships, thus creating a much more credible and engaging story.This is a novel I can highly recommend."}, {"userName": "Victoria", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/6553644-victoria", "userReview": "I really enjoyed this book. It's beautifully written and incorporates several of my favourite things...Italy, art and of course history. The story focuses on Fiammetta, who is a Roman courtesan and her pimp/sidekick Bucino, whom happens to be a dwarf. During the sack of Rome, they flee with a few choice possessions, (jewels) and money, to Venice. Venice is the birth state of Fiammetta, her mother still lives there, or so she believes. On arrival, things aren't as they should be. I won't go into details as I don't want to spoil the story. Fiammetta and Bucino build a life for themselves, with the help of La Draga, a hunchbacked, blind, healer and are soon back in the position they were in when in Rome. They have good, wealthy clients, a nice house with beautiful fittings and a few members of their own staff. Events happen and the situation changes. There is a thief in their midst. Who? Bucino makes it his mission to discover what happened and there are dire consequences. The story is written from the point of view of Bucino. There is absolutely no romanticisation of the life of a courtesan. We see a more real side to how an Italian courtesan and her pimp would have lived. With the addition of several real Venetian people, you get the added factual element and with the artist Titian, a little bit of art history. I loved the reference to Murano and the famous glass made there, that really appeals to my love of all things antique. The author provides a thorough historical note and also a thorough author's note at the end. You can tell by the story, how we'll researched it is and I'd say fairly accurate to it's time. She also provides an extensive bibliography."}, {"userName": "Rusty", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/3379953-rusty", "userReview": "Ah, this is the third novel I have read by Sarah Dunant and by far the best. I loved the story from beginning to end that is told by the indomitable Bucino. Bucino tells the story from his diminished height and short legs. I found myself cheering this man who deals with ridicule day after day. Fiammetta, a lovely courtesan, and Bucino, her intellectual and wily companion, flee Rome in 1527 when it is invaded and burned. Fiammetta's hair was brutally cut from her head and she suffered a cut on her face before they flee the city. Although they lived well in Rome they reach Venice with only jewels that they can hide on their persons. Depressed but hopeful they arrive to find Fiammetta's mother has died but they settle in her home and wait for Fiammetta to recover. The two have an almost perfect partnership with Bucino taking care of the business end and Fiammetta the marketing and luring of clients. However, when their most precious jewel turns out to be an almost perfect reproduction the future looks bleak but they find monetary safety in the form of a banned book, an original that came into Bucino's possession before they left Rome. Since the book was written by a man who is also making his new life in Venice, they enlist his help to develop the new business. More than once they find that people close to them who deceive and rob them almost bringing about their downfall but their friendship holds them together. The ending is a delightful surprise when Bucino and Fiammetta find their life entirely changed by a lovely young lady."}, {"userName": "A Miuda Geek", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/6663444-a-miuda-geek", "userReview": "Este livro trem uma premissa e um enquadramento histórico que poderia ter feito dele um livro bom, excelente mesmo.Mas,por alguma razão que não consigo bem definir, simplesmente didn´t ring my bells, ou seja, seja porque foi escrito do ponto de vista do anão/chulo/segurança/contabilista/whatever da cortesã e não ELA, seja por outra razão qualquer que não consigo bem apontar com certezas. Certeza é de que não achei nada de especial.Lê-se bem, a escrita da autora é fluida, o livro está bem documentado e pesquisado, portanto havia aqui a grande maioria dos ingredientes para fazer deste um romance histórico memorável e que me desse vontade de me preocupar com as personagens. Tendo por comparação Outlander, que estou a a ler ao mesmo tempo e que ainda por cima até já vi os episódios da série, tenho muito mais interesse no Outlander do que tinha neste.A unica personagem interessante nesta trama toda foi a que menos apareceu.Foi uma leitura ok, mas sem brilhantismos e sem me marcar de todo."}, {"userName": "Redfox5", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/3816075-redfox5", "userReview": "Really enjoyed this book, it feels like ages since I read a good historical fiction. I loved Bucino and I'm glad it was told from his point of veiw. I've read alot of books from this time period but none that have been set in Venice. Made a nice change."}, {"userName": "Katelyn Powers", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/8844899-katelyn-powers", "userReview": "This book was not at all what I expected it to be. It was very clever, and very well researched."}, {"userName": "Paula Berinstein", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/3181081-paula-berinstein", "userReview": "When I read historical fiction, I'm often struck by how boisterous people were in the past. Whether this is because many authors choose to write about lively people and places or whether the past was noisier and less private than now I'm not sure. Certainly that seems to be the case here. Of course when you start with the sack of Rome what do you expect, but even when the narrative gets past that, the overwhelming feeling--at least for me--is of noise and action. What a wonderfully immersive environment the author builds!I loved this book, not just for the gorgeous but accessible writing, but because it made me wonder. I kept imagining what life was like for Fiammetta--the courtesan of the title--and her partner, the dwarf Bucino. When they were at the height of their profession they were dazzling, but yikes--all the work that went into getting and keeping them there! Outwardly glamorous, they worked their butts off every day to maintain their image. The day-long beauty treatments, the \"marketing,\" the household management, the security were all-consuming. But for them, this was what was necessary to survive.Despite the subject matter, I did not find this a sexy book. Thrilling, suspenseful, sumptuous, and engrossing, yes, but not erotic, so if you're looking for sex scenes, I'd look elsewhere. But if you love history and Italy and unusual characters, you might want to give it a try."}, {"userName": "Adrianne daSilva", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/32443636-adrianne-dasilva", "userReview": "I debated between 3 stars and 4 stars. If I could I would give it 3.5 stars. The story is well written and I appreciate the historical research that went into this novel. I loved Birth of Venus so I had really high hopes for this one.Personally, I would of shortened some of the first half of the book and needless plot details (at times felt like fillers) and really expanded on more of the ending of the story.There was a lot in the end that felt rushed or glossed over. Like Bucino falling in love with La Draga? La Draga being an imposter? Having a child? Giving the child to Fiammetta? The child being named Fiammetta? So many things in the end that left me confused and trying to piece it all together."}, {"userName": "Charles Matthews", "userReviewDate": "Dec 17, 2009", "userURL": "http://www.goodreads.com/user/show/3010528-charles-matthews", "userReview": "Historical novels are always as much about the present as about the past. When Margaret Mitchell was writing \"Gone With the Wind,\" for example, women had recently received the right to vote and a certain measure of sexual freedom. Scarlett O'Hara is more like a flapper of the Roaring Twenties than like any actual Southern woman of the Civil War era – more Zelda Fitzgerald than Mary Chesnut. The trick is to keep up the illusion of the past. In her first historical novel, \"The Birth of Venus,\" published in 2004, Sarah Dunant just barely concealed her contemporary concerns -- about the rise of fundamentalist theocracies and the subjugation of women and gays – behind the façade of a novel set in 15th-century Florence. Her new book, \"In the Company of the Courtesan,\" is a smoother performance. Dunant's 21st-century sensibility – her attitude toward sexual politics, religious intolerance and the treatment of the disabled – is neatly blended into a plausible portrait of life in 16th-century Venice. When the novel opens, we are in Rome, where 21-year-old Fiammetta Bianchini has already earned a fortune in a career that offers, let us say, horizontal advancement. What better place for a courtesan to strike it rich than a city full of wealthy, amoral and supposedly celibate men? \"Ours was a house that had seen cardinals and diplomats gamble away the tribute of a small town over which of them should share my lady's bed that night,\" says the novel's narrator, the dwarf Bucino, who is Fiammetta's confidant and financial manager. But it's 1527, when Rome was sacked by the troops of Charles V, and Fiammetta and Bucino are forced to flee the raping and pillaging. They haven't lost quite everything: They swallowed some of her jewels before they fled, and Bucino has in his possession a book that will prove to be even more valuable. But Fiammetta was set upon by a gang of angry women who shaved her head, so restoring her beauty -- and thus her livelihood -- will be a top priority. After a harrowing journey, they arrive in Venice, where Fiammetta enlists the services of a blind and deformed young woman known as La Draga, known for her skill with potions and ointments. Bucino is wary of La Draga, but he's won over when her treatments repair the damage done to Fiammetta's health and beauty. Fiammetta becomes the queen of Venetian courtesans, and Titian immortalizes her face and figure as \"The Venus of Urbino,\" a sensuous nude whose erotic charge may be measured by the fact that Mark Twain described it as \"the foulest, the vilest, the obscenest picture the world possesses.\" But the novel is as much about Bucino as it is about Fiammetta. Dunant has skillfully imagined what it's like to have his physical limitations, his pride and self-consciousness and loyalty. Bawdy, funny, cynical and smart, Bucino keeps the narrative literally and figuratively down to earth. Indeed, he's a better-drawn character than Fiammetta, who doesn't entirely rise above the prostitute-with-a-heart-of-gold stereotype, and whose wit and power over men we are more told about than shown. It's through Bucino's eyes that the novel's fabulous setting, Venice, comes to life – sights, sounds and smells, riches and perils. There wouldn't be much of a novel without the perils, and Dunant skillfully piles them on, starting with the gruesome sack of Rome, and she keeps some deliciously hair-raising secrets for late in the book. The book suffers only a little bit from historical-novelese: It's hard to write period dialogue that doesn't veer into either highfalutin archaism or contemporary colloquialism. There are a few cameos by actual historical figures, such as Titian and the corrosive satirist Pietro Aretino, and you can feel Dunant straining to make them seem as real as the characters that come mostly from her imagination. In a note at the end of this colorful page-turner, Dunant apologizes for her conscious distortions of fact as well as for any unwitting mistakes, lamenting \"that extensive research and a deep love of the period cannot, alas, turn a fiction writer into a historian.\" Not to worry, Sarah. When you keep us as entertained as you do here, that's good enough. Besides, reading a historical novel for the history is like eating chocolate for the antioxidants. The history and the antioxidants are just fringe benefits – the true appeal lies elsewhere. In this case, it lies in a good story well told."}, {"userName": "Elena", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/19313082-elena", "userReview": "I had been hearing praises for Sarah Dunant's books for ages, so after waiting way too long I finally decided to start with In the Company of the Courtesan, a novel set in Florence during the 16th century. I really like historical fictions with rich, believable setting, and this is clearly a strong point in Dunant's writing. Her descriptions of Rome (which we see briefly at the beginning of the story) and Florence are beautiful and captivating, and give the reader a perfect sense of the magnificence and the corruption of the times. I tend to struggle with too long and too frequent descriptions, but I really enjoyed those. They made me want to re-visit both Rome and Florence, which I haven't seen in some years.The two main characters, Fiammetta and Bucino, are very well characterized. I liked both of them: Fiammetta is not only a beautiful courtesan, but also a resourceful and smart woman. She is a very strong character but also has weaknesses, so that it is easy to understand and sympathize with her. Bucino, a dwarf, is her most faithful servant and also a loyal friend. Like her, he has a sharp mind and is also quite cultured. Their relationship is beautifully written: their affection for each other is strong and sincere because of their similarities, but it is not devoid of contrasts. The secondary characters are also interesting, and some of them are even real historical figures. The plot has some slower parts than others, but over all is still solid and very much interesting. There are many parts dedicated to the profession of courtesan, but this peculiar subject is never vulgar or too heavy. And, most importantly, there are not explicit sex scenes, so don't let the title fool you. After a completely positive experience with In the Company of the Courtesan I will definitely check out Sarah Dunant's other books in the future. For now, I highly recommend this one to all readers who love well written and believable historical novels."}, {"userName": "Chris Witkowski", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/5929196-chris-witkowski", "userReview": "An ugly dwarf, a luscious, highly successful prostitute, a blind, misshapen healer ( or witch?), are the main characters of this terrific historical novel set in the glittering, exotic, city of 16th century Venice. Bucino, the wily dwarf, and his mistress Fiammetta, use their cunning to survive the sack of Rome, fleeing to Venice in the hopes of starting up their lucrative business again. They make it, but Fiammetta, having endured much abuse, her hair nearly burned off, wounded and nearly starved, is in no shape to be numbered among the sought after courtesans of the city. It is La Draga, the old, bent, blind healer, who they turn to to nurse Fiammetta. Through healing potions, ointments, oils, Bucino's mistress is restored to her former beauty and they are back in business. But of course a story set in the 16th century, in a city known for intrigue, clever merchants, dark and dank calles, smelly canals, public executions, notorious Jewish money lenders, and corrupt church leaders, is going to have more than its usual twists and turns. There comes a time when Bucino does not trust his mistress, they have a terrible argument, setting off a series of catastrophic events. This novel is so rich in plot, but more than that, it reveals a terrific knowledge of human nature. It takes a tremendous amount of pain before Bucino ultimately learns the real meaning of love, loyalty and friendship. And one more thing - if you ever wondered about the mechanics of the world's oldest profession - this novel if for you! Exceedingly bawdy, there are many passages that could make one blush! An entertaining, rollicking and poignant read."}, {"userName": "Marie", "userReviewDate": "Mar 05, 2011", "userURL": "http://www.goodreads.com/user/show/220178-marie", "userReview": "There are a lot of great things going on this book, but in the end if fell a bit flat for me, never fully capitalizing on what could have been so fulfilling. Things I liked:* the story is set in Venice in the 1500's, at the height of the city-state's power* the characters are unusual and interesting - a dwarf, a courtesan, a healer, and a cast of wealthy, corrupt Venetians/Romans* The storytelling is good - the writing is solid and the voice is true to the eraThings I didn't like:* the story seemed to have changed focus several times throughout the book. La Draga's identity and Bucino's last-minute change of heart seemed rather out of the blue to me, and the story ended not so much on Fiammetta's rise from the ashes or planning for her future, which was the original story line, but on La Draga and Bucino.* even within the Bucino-La Draga story, I felt like so much went unanswered. * there were long passages of unnecessary detail that I skimmed over, wanting to get to the point.* Fiammetta and Arentino's relationship deserved more backstory.* The part about Fiammetta and \"the pup\" seemed unnecessary - leading us to potential ruin, and then simply going away.So, I liked it, but didn't love it."}], "description": "My lady, Fiammetta Bianchini, was plucking her eyebrows and biting color into her lips when the unthinkable happened and the Holy Roman Emperor's army blew a hole in the wall of God's eternal city, letting in a flood of half-starved, half-crazed troops bent on pillage and punishment.\nThus begins In the Company of the Courtesan, Sarah Dunant's epic novel of life in Renaissance Italy. Escaping the sack of Rome in 1527, with their stomachs churning on the jewels they have swallowed, the courtesan Fiammetta and her dwarf companion, Bucino, head for Venice, the shimmering city born out of water to become a miracle of east-west trade: rich and rancid, pious and profitable, beautiful and squalid.With a mix of courage and cunning they infiltrate Venetian society. Together they make the perfect partnership: the sharp-tongued, sharp-witted dwarf, and his vibrant mistress, trained from birth to charm, entertain, and satisfy men who have the money to support her.Yet as their fortunes rise, this perfect partnership comes under threat, from the searing passion of a lover who wants more than his allotted nights to the attentions of an admiring Turk in search of human novelties for his sultan's court. But Fiammetta and Bucino's greatest challenge comes from a young crippled woman, a blind healer who insinuates herself into their lives and hearts with devastating consequences for them all.A story of desire and deception, sin and religion, loyalty and friendship, In the Company of the Courtesan paints a portrait of one of the world's greatest cities at its most potent moment in history: It is a picture that remains vivid long after the final page.From the Hardcover edition.", "title": "In the Company of the Courtesan", "url": "https://www.goodreads.com/book/show/62212.In_the_Company_of_the_Courtesan", "average": 3.77, "cover": "https://images.gr-assets.com/books/1386924737l/62212.jpg", "reviews": 1245, "authors": [{"url": "https://www.goodreads.com/author/show/15830.Sarah_Dunant", "name": "Sarah Dunant"}], "type": ["Historical", "Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/62212.In_the_Company_of_the_Courtesan", "http://www.goodreads.com/book/show/108222.In_the_Company_of_the_Courtesan", "http://www.goodreads.com/book/show/301299.In_The_Company_Of_The_Courtesan", "http://www.goodreads.com/book/show/818308.In_the_Company_of_the_Courtesan", "http://www.goodreads.com/book/show/108223.In_The_Company_of_The_Courtesan", "http://www.goodreads.com/book/show/6626249-in-the-company-of-the-courtesan", "http://www.goodreads.com/book/show/6385785-na-companhia-da-cortes", "http://www.goodreads.com/book/show/22717783-a-cortes", "http://www.goodreads.com/book/show/20882705-la-cortigiana", "http://www.goodreads.com/book/show/28078.The_Birth_of_Venus", "http://www.goodreads.com/book/show/6060130-sacred-hearts", "http://www.goodreads.com/book/show/16142157-blood-beauty", "http://www.goodreads.com/book/show/672409.Mapping_the_Edge", "http://www.goodreads.com/book/show/30375755-in-the-name-of-the-family", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}