{"ratings": 725, "userreviews": [{"userName": "Beatriz", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Reto #20 PopSugar 2018: Un libro escrito por un autor local\nSiempre he valorado los libros por lo que me hacen sentir durante y después de su lectura, y la verdad, esta novela me ha calado muy hondo. Antes de iniciarla, había leído algunas críticas poco favorables, que aludían a un lenguaje demasiado pomposo, descripciones poco relevantes y carencia de acción. Increíblemente, todos esos epítetos negativos fueron los aspectos que, en mi caso, me hicieron sumergirme y disfrutar al máximo cada una de sus páginas.En primer lugar me enamoró la prosa de la autora, cálida, íntima e inspiradora, con frases realmente bellísimas que invitan a ser leídas más de una vez para saborearlas mejor, que van desnudando a esos personajes que son el verdadero misterio de la novela y por los cuales es imposible parar de leer a fin de conocerlos, comprenderlos y reconocerse en ellos. Si bien hay una intriga asociada a si alguien (y quién) estuvo detrás del accidente de la escritora Vera Sigall, Contigo en la distancia es una novela de personajes más que de argumento, por lo que no me extraña que más de alguien se haya sentido defraudado, a la espera de un thriller que nunca llega, pero que nos muestra cómo la fuerza de los secretos es capaz de arrastrar vidas.Terminé la lectura queriendo más, no porque no haya sido una obra completa, sino que al alejarse de los personajes, se siente una sensación de vacío, como cuando un gran amigo se va y sabes que no lo volverás a ver."}, {"userName": "Elyse", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Chilean literary thriller —-A ‘few’ details about this story........Vera Sigall was 80 years old - in the hospital- she was put into an induced coma.... and given her age it was likely she would never wake up again. .....Daniel Estevez, neighbor, to Vera, found her on the floor. What at first seemed like an accident ( she fell?)....looks suspicious. .....Emilia Husson, was a Chilean student to traveled to Santiago to write a thesis on Vera. She had just gotten engaged to get married before she left behind her fiancé. Does that seem a little suspicious too? It did to me....but ... gotta read the book........Horacio Infante...a poet.... had an affair with Vera when they were younger.Much was mysterious to me in this historical thriller — not only ‘what happened to Vera?’....but each character becomes mysterious. There’re lives have holes in them even to themselves which they need to discover. I enjoyed learning about the history and literary figures mentioned in this book. Alter Kacyzne, a Jewish writer, poet, and photographer, being one of them. Some of history surrounding the Russian Civil War was new to me. I like Latin American Literature — Isabel Allende, Gabriel Marquez, Salman Rushdie to name a few....so it was a delight to discover author Carla Guelfenbein. Her writing is lovely - the crafting worked perfectly....and I enjoyed the intimacy between the characters and the story."}, {"userName": "Milly Cohen", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/21590911-milly-cohen", "userReview": "Uy si!Una buena trama, pero sobre todo, una muy buen escritura, un ritmo que va de menos a más, llevándote a descubrir la verdad mientras disfrutas a los personajes, me gusta y me parece un típico-premio-alfaguara, pero de los buenos."}, {"userName": "Susana", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/5814242-susana", "userReview": "En realidad 4,5. El final, un tanto truculento y de telenovela, no terminó de convencerme. Un excelente libro, cuya mejor reseña es el acta del jurado que le otorgó el Premio Alfaguara 2015. compuesto por grandes escritores como Javier Cercas, Héctor Abad Faciolince, Ernesto Franco, Berna González Harbour, Concha Quirós y Pilar Reyes (con voz pero sin voto) y que transcribo a continuación:\"El jurado quiere destacar que la obra premiada es una novela de suspense literario construida con gran eficacia narrativa en torno a un memorable personaje femenino y al poder de la genialidad. La autora ha sabido entrelazar amores y enigmas con una escritura a la vez compleja y transparente. Tres voces muy bien ensambladas iluminan las zonas oscuras de la mentira y la verdad, del talento y de la mediocridad, del éxito y del fracaso. Centrada en la ciudad de Santiago de Chile, la historia abarca tres generaciones que, sin saberlo, comparten un secreto poético que es al mismo tiempo un secreto existencial\"La historia se construye a través de tres personajes muy bien diferenciadas: Horacio, Daniel y Emilia, cada uno con su propio estilo, cada uno con sus propias dudas y expectativas, cada uno con un rol vital para despejar las incógnitas que se descubren a lo largo del libro.Y me renovó la curiosidad por leer a Clarise Lispector, de quien Carla Guelfenbein afirma haber tomado elementos para construir a Vera Sigall, cuya presencia es tan fuerte durante todo el libro, que podría jurar que hay capítulos relatados por ella, cuando no es así.Para cerrar un par de citas memorables:\"El dolor no tiene un ápice de belleza ni de grandiosidad. Es una bestia perversa y mezquina que lo deforma y lo estropea todo.\"\"Cerré los ojos y los poemas aparecieron ante mis ojos con sus imágenes y sus cadencias, como un paisaje de la infancia que había guardado en el trasfondo de mi memoria.\""}, {"userName": "Eduardo", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/6038892-eduardo", "userReview": "Ningún premio literario puede acertar en todos sus fallos. Y el Alfaguara de novela no es la excepción. Con esta novela el desacierto es extra, requete hipersonado.O los miembros del jurado estaban borrachos/drogados al dictaminar, o las otras setecientas seis novelas presentadas no eran mejores. Con mucha probabilidad lo primero.Contigo en la distancia es de la chilena Carla Guelfenbein, autora de otras novelas con títulos igualmente sospechosos (El revés del alma, La mujer de mi vida, El resto es silencio, Nadar desnudas). Contigo no es más que una novela rosa cribada: el resultado no es mucho mejor que la intención inicial. Los miembros del jurado han premiado un mediocre melodrama romántico con pretensiones literarias.Y definirlo así es una redundancia casi, porque el melodrama no es más que una de las manifestaciones vulgares (que no es lo mismo que ‘vulgares manifestaciones’) de la permanencia del romanticismo en nuestros días. Sería posible imaginar un melodrama cínico, que ya es un producto posmoderno, uno de los antirromanticismos actuales.El romanticismo en la novela contemporánea del género rosa se delata por el dramatismo y la teatralidad que el narrador o narradora otorga a todos los eventos y personajes (esto no es nuevo; ya se hacía en la segunda mitad del siglo diecinueve). En la vida real vamos a montones de actos sociales, vemos y conocemos a montones de personas, hacemos montones de acciones rutinarias, y nada de ello tiene la menor trascendencia las más de las veces. Pero en una novela como esta, cualquier reunión de personas conlleva inaudito misterio, una tensión apenas contenida; los seres que importan en la historia tienen todos características extraordinarias, como superpersonajes. Sus pecadillos se magnifican y se convierten en fallas abracadantes porque sus promotores o infractores son o muy malos o muy buenos (malévolos como diablos o tontos como ángeles). No hay idea o acción mediana; todo se presenta como un extremo. La rutina adquiere resonancias dramáticas. Los personajes son siempre exageraciones de sí mismos. Imanes irresistibles para los demás. En este tipo de novela todo gesto, todo acto, todo comentario adquiere una dimensión capital.De todas maneras, la trama en sí pudiera haberse salvado en manos de una mejor escritora. Contigo en la distancia está llena de clichés. Pero de vez en cuando la narradora inserta una imagen, una metáfora, un símil, como para acreditar la criba a la que sometió su historieta de amores. Así nos encontramos con estos ejemplos, tan ilustrativos de la capacidad \"lírica\" de la autora: “De mi garganta salió una risa ácida que envenenó el ambiente”“Un ramalazo de aire frío se coló entre mis huesos y mi piel, como una cámara de hielo”“Vinieron labios en mis pechos”, para decir que la besaron ahí“Como si la muerte nos hubiera alcanzado con sus garras grises para llevarnos consigo”“Dentro de mi pecho un peso me impidió respirar”“Tus largas manos como pájaros que hubieran olvidado el arte de volar”“Tu cuerpo, como un árbol derribado, yacía inerte...”Etc, etc.Y para probar que la criba no fue tan exquisita o refinada como se pretendía, nos topamos de pronto con esta absurda inserción naturalista:“Después de comer, Emilia se alejó unos metros, y de cara al mar se acuclilló para orinar”.¡Qué desperdicio de premio esta vez!"}, {"userName": "Palindrome", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/7902626-palindrome", "userReview": "Reč je o drami koja u sebi ima i pokušaj trilernog momenta, koji, prema mom utisku, i nije baš najuspešnije odrađen, međutim, činjenica da se roman, posvećen rekonstrukciji lika i književnog i životnog dela kultne umetnice Vere Sigal, sastoji iz tri pripovedna ugla (koja tvore osobe na ovaj ili onaj način zainteresovane za ovu ženu), zaista spašava ovu knjigu.Kroz roman o sebi i Veri progovaraju tri osobe: - Danijel, njen komšija i bliski prijatelj koji i pokreće onu gotovo nepotrebnu krimi sumnju da je Vera u bolnici jer je neko pokušao da joj naudi. Istovremeno, u obraćanjima Veri on progovara o distanci koju je ona zauzimala kada je trebalo dublje da govori o sebi; on svedoči o njihovim momentima bliskosti,ali i u sebi i o svome braku.- Orasio Infante, pesnik, velika ljubav Vere Sigal - on se obraća mladoj devojci koju je i zainteresovao za Verin opus, ali iz njega progovara njegova ljubavna i umetnička prošlost koju je delio sa Verom Sigal, snaga talenata koju su podelili i razdor prizemnosti koja ih je sukobljavala. U tim se redovima nižu lepi opisi zajedništva koje teče u punoći i snazi razumevanja ali i teskobe koja se rađa među njima dovodeći ih do konačnog razlaza. Mnogo dobrih i snažnih rečenica o umetnosti može se naći u ovim Infanteovim redovima. - Emilija, zatvorena i mnogofobična devojka koja, rešena da svoj doktorsku disertaciju usmeri na Verinu književnosti, tokom tog poduhvata nailazi na nepojmljive i nezamislive stvari i u književnosti kojoj se posvećuje i u sebi samoj. Sva tri glasa dobro su ukomponovani u jedno - niti jedan ne postoji kao suvišan i autorka je dobro splela niti njihove povezanosti, pogotovo na kraju romana, gde je postavila neočekivani obrt.Uz to, knjiga ima solidan broj fusnota koje usmeravaju na književna dela i pisce.Sve u svemu, da se skrati priča: roman koji je zaslužio 3,5.Knjiga na granici lakog i teškog, sa dobrim balansom između zamornih i dobrih delova.Dobra je za poklon ženama u čiji ukus niste sigurni, pa da ne uvredite limunadom ili ne odbijete klasikom."}, {"userName": "M.  Malmierca", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/23807070-m-malmierca", "userReview": "El Premio Alfaguara de novela 2015, Contigo en la distancia, de la chilena Carla Guelfenbein, es, a mi entender, merecido. Homenaje a una persona real, la escritora brasileña Clarice Lispector, es una novela que te seduce desde el primer momento: íntima en los personajes, las situaciones y los temas. Amplia tanto en lo temporal como en lo espacial y, sobre todo, impregnada de ese tono poético que le va perfecto a los temas tratados: la pérdida, la traición, la tristeza, el amor, la mentira, el talento, el éxito... y sus correspondietes antagonistas. Novela casi coral (tres narradores distintos), que gira alrededor de un personaje casi muerto (en coma) que, no por eso, deja de ser el verdadero protagonista de la historia, el eje alrededor del cual giran el resto de los personajes. Si algo se le puede achacar es que toca muchos frentes, desde ciertas pinceladas románticas hasta un tema de misterio que para mí es irrelevante. Pero parece ser que hasta para ganar los premios prestigiosos hay que sucumbir a la moda de los géneros. En cualquier caso no gustará a los que busquen novela negra donde no la hay, aunque la promocionen así."}, {"userName": "Dana Burda", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/50666924-dana-burda", "userReview": "Romanul scriitoarei chiliene Carla Guelfenbein a apărut la editura Litera în colecția Buzz Books în anul 2016 cu titlul \" Cu tine în depărtare\". Un roman deosebit de frumos scris, premiat în 2015 cu premiul Alfaguara. Recenzia poate fi găsită pe sit-ul Literaturapetocuri.com"}, {"userName": "José Sifogrante", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/15792003-jos-sifogrante", "userReview": "Para mí, Carla Guelfenbein no es una escritora. Es una arquitecta del lenguaje. \"Contigo en la distancia\", es uno de los más exquisitos thrillers literarios que he leído. Vera Sigall, famosa escritora con un talento único en su generación, sufre un accidente al caer por las escaleras de su casa quedando en estado de coma. No sólo es la vida de Vera la que queda en suspenso, sino la de Daniel, su joven amigo y confidente que la encuentra tras el accidente, y la vida de Emilia, una introvertida y extraña joven francesa a quien conoce en el hospital cuando ambos visitaban a Vera. Entre ambos surge una especie de lazo misterioso que los ata y los une por su amor a las letras y a la infortunada escritora. Pronto descubrirán en la obra de Vera Sigall, los secretos sobre los que fue construida la misma que al final, terminará por involucrarlos a ambos de un modo totalmente inesperado.Carla Guelfenbein brilla en todas y cada una de las líneas, insertadas con precisión quirúrgica, el firmamento del castellano presume una nueva estrella."}, {"userName": "World Literature Today", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/6289911-world-literature-today", "userReview": "\"Chilean writer Carla Guelfenbein’s Contigo en la distancia is the 2015 winner of the prestigious Alfaguara Novel Prize. Like Guelfenbein’s previous four novels, this work revolves around the intimate lives of a limited number of characters and reflects the author’s own life and experiences. Despite this historical and autobiographical grounding, this is primarily a novel of suspense and of the development of characters. It is also a novel about literature and literary influences. Given that two of the main characters, Vera and Horacio, are renowned writers, the novel abounds in references to writers and major works of literature.\" - Edward Waters HoodThis book was reviewed in the May/August 2016 issue of World Literature Today magazine. Read the full review by visiting our website:http://www.worldliteraturetoday.org/2..."}, {"userName": "Constanza", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/21439155-constanza", "userReview": "Tenía muchas ganas de conocer a la autora, de leer sus historias y pensé que comenzar con el libro ganador del \"Premio Alfaguara\" era la mejor opción, lamentablemente no fue de mi gusto.Las dos primeras partes del libro giran entorno a Vera, una conocida mujer de letras, pero tras un \"extraño\" accidente, queda en coma, a través de otros personajes vamos conociendo su historia y como se enlaza con el presente.Sentí que era una novela demasiado sencilla cuyo final aventuré sin darme cuenta, contada de tal manera que me aburrió un montón, no sentí ese aire de misterio, el hecho más importante se terminó en media página con suerte, las escenas de sexo estaban contada con un lenguaje tan adornado que me pareció un coñazo, podría seguir, pero bueno...De los personajes, el único que me gustó y por el cual terminé de leer la novela fue Daniel, otros como Horacio, Vera y Emilia me parecieron lateros y sin gracia.No descarto leer algo más de la autora en el futuro y tal vez encantarme con sus historias."}, {"userName": "Nacho Rauda Salazar", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/1025499-nacho-rauda-salazar", "userReview": "Aún cuando dejé pasar un par de meses prácticamente para continuar, me tomó un par de días para leer el 95%. Me sentí envuelto en la narrativa de la misma, con una ágil e inteligente manera de entrelazar la trama entre los personajes.Disfruté enormemente el ir desenvolviendo los temores, ambigüedades y logros de los protagonistas, hombres y mujeres con dudas, con anhelos. Una novela que si bien no necesariamente busca redescubrir hilos negros, pero sí encuentra en la elegancia de su prosa y en el apelar a las contradicciones humanas una historia cálida, humana y serena, sin dramas innecesarios, pero fuerte y profunda.Particularmente, permite contrastar diferentes claroscuros de los personajes, y especialmente darle una presencia a quien no narra nada de la historia, pero que sin duda es el gran leitmotiv: Vera Sigall."}, {"userName": "Sue Davis", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/2124304-sue-davis", "userReview": "Me encantan todos los aspectos de esta novela: la estructura, el argumento, el estilo de la escritura y los personajes. No es solo un romance sino además una exploración de los límites del amor. Me hace querer leer algo de Clarice Lispector"}, {"userName": "Annie", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/1616058-annie", "userReview": "In this multi-layered novel, three people slowly discover the secrets of the mysterious cult writer Vera Sigall. The three characters take turns narrating the tale after Vera falls down the stairs of her Chilean home and has to be put into an induced coma while the swelling in her brain goes down. As In the Distance with You, by Carla Guelfenbein and translated by John Cullen, develops it explores creativity, soulmates, incompatibility, unequal relationships, curious parallels, and literary influence. The more I read, the more I enjoyed this novel...Read the rest of my review at A Bookish Type. I received a free copy of this book from the publisher via Edelweiss, for review consideration."}, {"userName": "Lilias Lolipop", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/27911537-lilias-lolipop", "userReview": "No he terminado todavía, pero voy a ir editando la review mientras vaya avanzando para saber si el premio Alfaguara es serio, comprado o este año habían puras novelas malas. Es que no me creo que este libro haya ganado. En el resto del mundo el género del romance es mirado en menos.Por ahora son 2 estrellas ¿Por qué? Porque creo que no es un libro serio. Tiene aires a Allende, osea romance rebuscado, y aparte una mujer se cayó de las escaleras sin calzones (no bromeo en esto último). Dioses, el mundo no gira alrededor de la sexualidad y el romance melodramático ¿Por qué a latinoamérica nos toca puras novelas solo muestran este aspecto? ¿Es que acaso me pierdo ese momento cuando las mujeres se encuentran a ese neandertal que habla como Antonio Banderas? El resto del mundo tiene novelas por así decirlo decentes, que no giran alrededor de algo tan estereotipado.Un ejemplo que me molesta (Y a la mierda los spoilers): Es lo irreal de que el papá de Emilia se haya quedado con su esposa aunque le engañó, haya invertido dinero en una hija que no era suya (Por amor al cielo, te lo acepto, cuando te enamoras de una mujer que antes de conocerte ya estaba embarazada y todo, pero a este tipo lo cagaron y el iba a estar feliz, porque ¡Todos aman a los bebés!) ¿Que le costaba adoptar a esta tipa?Y por cierto, no me gusta el insta-friendship que tiene Daniel con Vera. Muéstrame razones, no te quedes ahí parada, diciendo, \"en el momento en que te ví quise protegerte\" justo después de pasar por al lado de un vagabundo.Eso. Por ahora."}, {"userName": "Luis", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/19968477-luis", "userReview": "Alfagurara Prize is a very voluble one. From true masterpieces (remember  Diablo Guardián, La Piel del Cielo  or  El ruido de las cosas al caer  to stuff like this book. Maybe Ms Guelfenbein was awarded as she is a Vanity Fair editor, I don't know. But while this book can certainly interest the reader, it is very clear that it lacks the depth of many other awarded books and uses a vocabulary that is limited in its pseudopoetic intent. A book to read in the subway, not worth for any praise."}, {"userName": "Encarni Prados", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/65764694-encarni-prados", "userReview": "Me ha sorprendido mucho y gratamente, la forma de escribir es sublime, de los libros que te gusta leer despacio porque está lleno de expresiones y gestos de buen gusto, en los que la historia, a pesar de ser buena, es lo de menos, en los que te dejas llevar por cómo te cuentan las cosas. Es un libro con pasado y con misterios que se resuelven a fuego lento y con mucho gusto, sin duda leeré más libros de esta autora"}, {"userName": "Mientras Leo", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/6348927-mientras-leo", "userReview": "Aunque va de más a menos, es una historia que juega con el misterio, los sentimientos y la literaturaMás aquí"}, {"userName": "Rommel", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/15925579-rommel", "userReview": "Un sólo conducto que por dos generaciones cuenta diversas historias, diversas formas de amar, distintas formas de actuar, diversas formas de vivir."}, {"userName": "Stephanie", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/11751450-stephanie", "userReview": "I'm a bit surprised that this novel, the winner of the Alfaguara prize in 2015, has won such critical acclaim. Told through three first-person perspectives, it centers on a mysterious personage, Vera Sigall, a Chilean author of Jewish descent, who has suffered a fall and is in a coma. Guelfenbein does a good job of maintaining both the mystery of Sigall's past, her romantic and literary relationship to poet, Horacio Infante, and Infante's promotion of a young doctoral candidate, Emilia, whose thesis focuses on the interplay of the two writers. The character of Daniel, Sigall's neighbor and friend, never crystalizes, however, and the obtrusive insertion of what each character is wearing, in nearly every setting must be owing to Guelfenbein's stint on the editorial staff of \"Elle.\"I read this book in Spanish. I found the quality of the writing uneven and the sexual sequences uninteresting."}, {"userName": "LuisAdri", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/56383489-luisadri", "userReview": "Esta obra recoge el pensamiento de la autora, frente a nuestras emociones, un sentido muy humano de lo que somos en realidad, sinceros y mentirosos, interesados y generosos, leales y desleales, soñadores y realistas, según el momento de vida que tengamos.Narrada en un tono muy personal, en tres partes y 53 subcapítulos, nombrados a su vez con el escenario para el personaje; va relatando las vidas, y el cómo llegaran a unirse en un punto donde el nudo se ha de comenzar a deshacer.La historia no es sobre la vida en sí de Vera S, la escritora, o sobre su muerte, el texto nos lleva a saber que hay detrás de las personas que rodearon su existencia, un ser casi inerte sirve de hilo conductor, para descubrir el pasado y ponerlo de manifiesto y para dar sentido a otra vida.Los personajes, que resultan siendo cuatro, tres se mantienen en escena, por la voz que la autora da a ellos y van haciendo un recorrido por sus vidas, hasta un espacio donde se encuentran; un momento difícil, que alberga incertidumbre y dolor. El accidente de Vera, en ese momento parte la trama, la que tiene en vilo cada página, y nos hace dudar, creer o esperar.Es un buen argumento, me ha gustado que la autora no tiene como fin único, dejar una enseñanza, su fin va mas allá, mostrarnos la sencillez de las cosas, las que nos dan la felicidad, los momentos que despreciamos entre afanes de la rutina y que son como el pilar para seguir la vida; me ha gustado que la autora pone de manifiesto los secretos, ese afán por guardarlos como el tesoro y luego tenerlos como el recurso; para dar sentido, para cerrar caminos y abrir puerta a la esperanza.Muy interesante el hilo conductor, partiendo de un hecho en presente y dando vueltas en el tiempo acercando a las personas a este, retornando a su pasado para de nuevo estar en su presente y saber que tomar de la vida. Tuve la oportunidad de conocer a la autora, y creo que en sus palabras, como en sus textos hay sinceridad, hay un profundo interés de ofrecernos párrafos que nos toquen que nos hagan cómplices de los personajes, hasta la última página, hasta descubrir que de nuestro pasado nos hace mas fuertes o débiles. Ha sido muy bueno este, como el primer libro de esta autora Chilena, y me deja el total interés de conocer mas de su obra."}, {"userName": "Isabel Jazmín", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/679528-isabel-jazm-n", "userReview": "Tenía mis reservas a leer este libro pero no me arrepiento de haberlo leído: la historia te va atrapando casi sin sentirlo. Aunque al principio el personaje de Emilia me chocó sobremanera, con su transformación y los descubrimientos de su pasado me fue cayendo mejor. Daniel me sigue causando sentimientos encontrados, me parece uno de esos hombres que no puede tomar decisiones por sí mismo y necesita que las circunstancias lo arrojen: ¿por qué no dejó a Gracia y ya desde el principio? Tuvo que llegar Emilia para sacarlo de ahí. De Horacio creo que no tengo nada positivo qué decir: patético personaje que no sabe guardar secretos ni aceptar que una mujer sea mejor que él, que no vio el amor que le tenían y por puro orgullo lo desechó, que no supo ser pareja pero sí aprovecharse, todo mal con él. Con todo lo que supimos de Vera sigue sin ser un personaje completo, todo lo que le ocultó a Horacio nos lo ocultó también a los lectores, me hizo falta por lo menos un capítulo desde su perspectiva.Altamente recomendable esta historia de amores y desencuentros."}, {"userName": "Ariadna73", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/7541671-ariadna73", "userReview": "Esta novela me ha encantado. Es maravillosa; no podía soltarla y a la vez no quería que se acabara. Es muy bonita y está muy bien escrita. Es toda una delicia. La trama gira alrededor de la octogenaria escritora de culto Vera Segall que se ha caido por las escaleras y está en coma en el hospital. Allí acuden a visitarla dos personajes -Emilia y Daniel- que cargan con la tarea de contar la historia de esta mujer, desde perspectivas totalmente incompletas. Más adelante aparece un tercer personaje Horacio Infante, un poeta que tiene un pasado romántico con Vera, y que puede contar también muchos secretos que los otros no conocen.Personalmente, creo que está escrita de una manera muy entretenida, aunque le haría algunas correcciones para mi gusto, y definitivamente le arrancaría y quemaría dos páginas que contienen descripciones sexuales muy fuera de lugar en una novela que desde todas las demás perspectivas está escrita con buen gusto y elegancia. Aparte de eso, voy a buscar más obras de esta autora, pues me ha cautivado su voz."}, {"userName": "David", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/3143117-david", "userReview": "As the winner of the Premío Alfaguara de novela 2015, I can see why? A brilliant and beautiful book about love, family and deception. The language is at times simple but evocative in images and tone and the story reads flawlessly to the end. A perfect summer read.The book starts with a famous Chilean poet Vera Sigall falling down her stairs and ends up in a coma. Her architect neighbor Daniel stays by her side even though his marriage is faltering. Enter young Emilia, off a plane from Grenoble, France who is researching the famous poet's life when the accident happens. All the events and stories unfurl to fit together the pieces of love and lies. An absolute enjoyable read.Read in Spanish."}, {"userName": "Mi Camino Blanco", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/12610472-mi-camino-blanco", "userReview": "Una historia con personajes prometedores, intensos, en los que cada gesto y frase adquiere una importancia difícil de trasladar a la realidad y una lectura ágil con imágenes dulces y evocadoras, seguro que difíciles de encontrar si el autor fuera masculino. Sin embargo, la supuesta intriga que desarrolla el argumento va perdiendo interés a medida que avanza la trama y los personajes pierden ese punto de romanticismo evocador en pos de un naturalismo poco creíble.Lo mejor: la reflexión sobre la poesía, la belleza, el talento como contrapunto al esfuerzo y la búsqueda (o a veces el simple encuentro) de la gloria frente a la autorrealización.https://www.micaminoblanco.blogspot.c..."}, {"userName": "Stephanie", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/44381467-stephanie", "userReview": "Este libro me gusto bastante tanto la historia, como la forma de narrarse y el hecho de que el relato es realista, con situaciones que pueden ser reales.La autora nos muestra la historia de una escritora llamada Vera Sigall, lo interesante aquí es que ella nunca narra, son otras personas las que te cuentan todo lo que sucede alrededor de ella.Te encuentras entre una historia pasada y una presente, los personajes entrecruzan sus historias, y descubren misterios entre las personas que menos imaginaban."}, {"userName": "Patricia Ibarra", "userReviewDate": "Dec 08, 2015", "userURL": "http://www.goodreads.com/user/show/2140110-patricia-ibarra", "userReview": "La famosa y anciana escritora Vera Sigall es encontrada inconsciente al pie de la escalera por su joven vecino Daniel. Daniel no sabe que esta amistad que se desarrolló y que lo impulsa a investigar qué pasó cambiará su vida. ¿Fue una caída o alguien lo ocasionó? Su búsqueda estará acompañada por Emilia, una introvertida e insegura joven dedicada a estudiar la obra de Vera. Es una novela de suspenso, amor y desilusiones que va desentrañando enigmas en la vida de todos los personajes."}, {"userName": "May ", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/17052033-may", "userReview": "La historia se enmarca en un suspenso literario. Saber si lo sucedido a la escritora Vera Sigall fue un accidente o no. Tres voces: Daniel, Emilia y Horacio que se alternan para contar la trama, cinco vidas que se van entrecruzando como si las Moiras estuvieran tejiendo sus destinos hasta que surge el colisión en un final impactante e inesperado. Desde que Andrés Neuman ganó el Premio Alfaguara con El viajero del siglo en el 2009, otra no me había gustado tanto hasta Contigo en la distancia."}, {"userName": "Regina", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/13573328-regina", "userReview": "Even it took me a while to read this book (not because of the book itself), I have to say I enjoyed every word, the narrative is envolving, not simple but very clear, I adore how you begin to fall for the characters in it, their stories... And it has so many phrases I had to write down, poor book it kind of ended with some folded pages :/ I fully recomend this book :)"}, {"userName": "Cuentalibros", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/14249609-cuentalibros", "userReview": "Se lee muy bien y tiene fragmentos bonitos, lo mejor son su personajes. Una historia que genera cierta intriga pero que podría haber sido menos previsible. Tengo la sensación de que se le podría haber sacado más partido en general (a la prosa y la trama) se queda en lectura agradable."}], "description": "Spanish DescriptionLos laberintos del amor y la mentira, y el talento desigual como desafío de una pareja son los grandes temas de esta novela de Carla Guelfenbein, una autora que ha deslumbrado a Coetzee y a miles de lectores en el mundo.A Vera Sigall y Horacio Infante los une un amor de juventud y su pasión por la literatura. También un lazo misterioso que dos jóvenes, Emilia y Daniel, intentan desentrañar. Sin embargo, este no es el único enigma en sus vidas. Una mañana, Vera Sigall cae por las escaleras de su casa y queda en coma. Al principio, la noción de que su caída no fue un accidente aparece como una sospecha para Daniel. Pero con los días y las semanas, la duda irá creciendo hasta volverse una certeza.Emilia y Daniel se encontrarán en la búsqueda de la verdad acerca del accidente de la mítica escritora pero, sobre todo, en la necesidad de entender sus propios destinos.«Una novela de suspense literario construida con gran eficacia narrativa en torno a un memorable personaje femenino y al poder de la genialidad. La autora ha sabido entrelazar amores y enigmas con una escritura a la vez compleja y transparente.» Del acta del jurado del xviii Premio Alfaguara de novela, presidido por Javier Cercas y compuesto por Héctor Abad Faciolince, Ernesto Franco, Berna González Harbour, Concha Quirós y Pilar Reyes.", "title": "In the Distance With You", "url": "http://www.goodreads.com/book/show/40026463-in-the-distance-with-you", "average": 3.77, "cover": "https://images.gr-assets.com/books/1525303012l/40026463.jpg", "reviews": 113, "authors": [{"url": "https://www.goodreads.com/author/show/1281607.Carla_Guelfenbein", "name": "Carla Guelfenbein"}, {"url": "https://www.goodreads.com/author/show/8166829.John_Cullen", "name": "John Cullen"}, {"url": "https://www.goodreads.com/author/show/1281607.Carla_Guelfenbein", "name": "Carla Guelfenbein"}, {"url": "https://www.goodreads.com/author/show/8166829.John_Cullen", "name": "John Cullen"}], "type": ["European Literature", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/36755921-in-the-distance-with-you", "http://www.goodreads.com/book/show/40026463-in-the-distance-with-you", "http://www.goodreads.com/book/show/25246570-contigo-en-la-distancia", "http://www.goodreads.com/book/show/25577581-contigo-en-la-distancia", "http://www.goodreads.com/book/show/31289602-contigo-en-la-distancia", "http://www.goodreads.com/book/show/6781980-el-resto-es-silencio", "http://www.goodreads.com/book/show/15847005-nadar-desnudas", "http://www.goodreads.com/book/show/3037894-la-mujer-de-mi-vida", "http://www.goodreads.com/book/show/17694117-el-rev-s-del-alma", "http://www.goodreads.com/book/show/39677811-ll-vame-al-cielo"]}