{"ratings": 103, "userreviews": [{"userName": "Larry Bassett", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "I am in the process of deciding how much I want to devote myself to reading more Joyce Carol Oates. Reading Invisible Writer has helped me tentatively decide that more JCO is in my future. I do have to find something for JCO post-1998. (Ending in mid life of a prolific writer is the major disability of this book.) I am giving it four stars. I enjoyed reading it and think it will be a good reference as I cast into the JCO Novel and Short Story Pond for future reads.Joyce Carol Oates extensively uses her own life and her observations of the lives of others to construct her fiction. What the book portrays as it moves through her life in tandem with her abundance of writing is that she does not alter characters to give some privacy to the specific people written about. This may be one thing if the person is a serial killer or the work is historical fiction but quite another if s/he is an ordinary person who is living her/his own private life. JCO has no scruples about using real people and situations without any evident regard to any possible negative impact on a person. You can see that by using her real-life experiences of the world, she can achieve psychological and sociological realism. While this is a skill, calling it art is questionable. It is one thing to expose yourself and quite another to expose an innocent human being through satire or unkind references to another’s private life. She has taken some flack in her career for this invasion of privacy but never changed her ways. Her books often found their genesis from a sensational newspaper headline.I have read several of Joyce Carol Oates’ books and expect to read more. I was curious about this author who writes about strange people and violence so I thought I would look at a biography.  Invisible Writer  is the first biography I found. It is a friendly, authorized biography. While there are no damning revelations, there are some negative characteristics that are presented as what others think about JCO. Her books got some bad reviews and some people don’t like her and even may be considered as enemies. While everyone has a right to their opinion, biographer Greg Johnson mostly tries to give you the facts rather than his opinions so you can draw your own conclusions. Maybe it does not need to be said, but JCO is a very complex person. It does a good job winding together her life and how much of her work is autobiographical. We move with her from her young days as a bright student in a one-room rural school to her days as a financially well off and famous adult, a professor at Princeton University. For me, it helped connect the dots of JCO’s life and work.This is a linear book that takes JCO’s life several years at a time in order. It tells about the events of her life and the books she wrote. It does include the “how” of her writing, interesting to see that change over the years not to mention how she had a hard time being rich and famous. It is possible that she has thrown away more manuscripts than many authors have published in their lifetimes. And all of this with a typewriter and not a computer. She did try word processing briefly but found it did not fit her style of writing so she went back to a typewriter.In her teaching Ms. Oates typically use the name J.C. Smith, her married name. She has written books under several pseudonyms. She tried identifying herself as J.C. Oates as well as J. Oates Smith to disguise about her gender. Women writers faced discrimination in the literary world. She found this was true in publishing and in academic studies throughout the period that this book covers. She comes to consider herself a feminist although, like most things about her and her work, there is some disagreement about that self identification.The most notable problem with this biography is that it was published in April, 1998 and JCO continues being a prolific writer. So the book, with its good coverage from 1938 to 1998, just ends fairly unceremoniously. You have to find another book for the years after 1998. I suppose that this is always a problem with biographies of living people: they just keep on having a life even after the publication date. JCO has probably written another 40-50 books. Anyone got a recommendation for a post-1968 book or are we going to have to wait until she dies?Invisible Writer is not quite a leisurely stroll through JCO’s life. JCO was a jogger and did not slow down or take a break from writing. I do not know if she is still a jogger at her current age of 73 but she was “obsessive” about it when she was sixty. That is probably a good word for a lot of things about JCO. If you have read or plan to read a lot of JCO, you will find this biography interesting as well as instructive for your reading. We go through her writing almost book by book. The biography will give you some ideas about which books you might want to read. You have a lot of choices and she does move through her social cause period and her mystical period and her realist period. You might pick a few books at random when you start as I did but you will very likely want to know about your choices before you get into the deep water. (Actually, there may only be deep water, no shallows.)Invisible Writer is very interesting since it relates so much to the author’s books. It has significant notes, a bibliography and an index so it can be used as a reference book. It also has a list of JCO’s published works as the 1998. The book covers the first sixty years of the life of a prolific writer who has kept churning her words right up until this very moment. Whatever big events in writing or living that have happened since 1998 are not to be found here.In many ways, psychological, physiological and in work habits, Oates swung like the pendulum. Think bipolar. For quite some time she never read newspapers and at other times she found her ideas for novels in the newspaper. She would be outgoing and then shy, high energy then depressed. One thing that has been a constant in her writing career is her significant output of words. At one point she wrote a finished product start to finish with minimal revisions. At another point she laboriously revised and reworked as the major aspect of the completion of the novel. She once withdrew one novel at the publisher to replace it with another. She even modified one novel after it has already been published. What is it about Joyce Carol Oates? Is she psychologically differently abled, protected by her wealth and status? She does specialize in writing about some pretty quirky, weird, disturbed people. And they are in many ways evidently based on her view of herself and her life."}, {"userName": "Janet", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/1421407-janet", "userReview": "Every few years I reread this book of our preeminent living American writer--Joyce Carol Oates. I know, some people would put Roth up for this, but not me. I started with those early collections--Upon the Sweeping flood, By the North Gate, Wheel of Love, Marriages and Infidelities, in falling-apart Fawcett paperback editions, dotted with my mother's home hair dye... when I was learning to write, these were the stories I returned to, time and again. what emotional extremes! Then came the early novels, Garden of Earthly Delights, and them... The Gothic, long sentence American fiction that's a direct line from Faulkner and Flannery O'Connor... wonderful to go back through her development and early years, the successes of earthly delights and the National Book Award for them... Her sheer productivity seems to have somehow kicked her out of the running as our greatest living literary genius. CRazy. What a pleasure to trace the interplay of this life and the life of her fiction."}, {"userName": "Diane", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/4760059-diane", "userReview": "Fascinating, well-written, but also enough to make any ordinary writer feel like a total slug!"}, {"userName": "Cynthia", "userReviewDate": "Aug 20, 2007", "userURL": "http://www.goodreads.com/user/show/102271-cynthia", "userReview": "This biography was fascinating. I learned of her interest in the mystery of friendships and the criminal mind. Her husband Ray does not read her work. She was in a sorority, and many of her female characters have food issues and sex issues. She writes a LOT (but you probably knew that)."}, {"userName": "Maria Stevenson", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/24129559-maria-stevenson", "userReview": "A fairly intimate look at the obsessive, ultra-focused, ultra-driven (self-driven, always), ultra-intelligent, multi-talented-in-the-realm of writing, Joyce Carol Oates. Having read this book I can now say, \"Ah yes, it all makes perfect sense...the parts that I previously did not know, like JCO being part Jewish, on her paternal grandmother's side, or the parts that I previously only suspected, like JCO being a periodic anorexic (the label \"compulsive non-eater\" came to me as befitting JCO.) She is truly a racehorse of writing, (an aside: she and her husband had a brief stint co-owning a racehorse, but sold their share despite success at the track, because they found the upkeep of such a beast too expensive!! JCO has the child-of-immigrants, working class thriftiness despite her [well-deserved] financial success.) One thing that I'm still confused about is the inspiration and degree of reality (as in, true story, not fiction) of the novel \"them.\" I was really haunted by \"them\" and have read it I believe three times in my life. Part of the fascination is the Author's Note at the beginning telling us she took the story almost directly from a former student who wrote to her and spilled her life's squalid and amazing story. Well in \"Invisible Writer,\" Johnson makes no reference to this aspect, except to mention a rather conflicting account of a black female student of JCO's husband telling him about being raped and severely beaten by the mother's boyfriend. Johnson says that this is where JCO got the idea of Maureen Wendall (who is white) being raped and beaten like that. But in JCO's \"Author's Note\" she says she basically took ALL of the \"Student-who-inspired Maureen Wendall\"'s recollections and the story practically wrote itself. I don't know what to believe any more, and I would write to JCO myself, resisting the urge to spill my own family skeletons to the amazing writing machine, but just ask about the Wendall saga and the Author's Note. I suppose because, (if the Note is true), these are real people and their privacy needs protection, we will never know. The lines between truth and fiction remain ever-blurred.Invisible Writer: A Biography of Joyce Carol Oates is a privileged glimpse at a writer who is likely very misunderstood as being a \"private person\" when indeed she is more of an \"invisible person\" because her writing is almost everything to her, \"life's blood\" as she has stated a few times, and the wispy thin, pale ghost-like person banging away at the typewriter comes across as quite likable and generous with her intellect. This book made me want to read more of her works, besides \"them\" and \"You Must Remember This\" although I will probably give her Gothic phase a pass. Some people think in terms of all the things they want to do before they die. JCO thinks in terms of all the things she wants to write before she dies. (She may have had a slight change of focus: this biography was written a couple of decades ago; since then JCO's beloved husband Raymond Smith has died, and she has remarried and, last i read, she wants to lighten up and experience travel and fun...so, who knows?)As another reviewer on goodreads said, JCO is a complicated person. I found myself liking JCO and then at other times feeling irritated by her. For all her fascination with morbidity, she seemed utterly unprepared for real-life losses such as when a middle-aged alcoholic woman friend of hers died of alcohol-related illness, and later when her middle-aged male editor also died of disease. The biography ends before JCO even has to suffer the death of her own parents, or her husband Raymond in his late 70s, but I gather (from the books she later wrote) that JCO did not do well with those losses either. There's almost this wide-eyed innocence when something actually happens to her, I suppose because her life had been in books and ideas for so long that reality was a bit of a smack to the core of the JCO system.I found it odd that JCO's autistic sister Lynn just sort of appears out of nowhere, granted she is 18 years younger than Joyce, but it's like, oh by the way, this happened...but we don't really get any sense of Joyce as a sibling to either of her sibs, her brother of six years younger or her sister of 18 years younger. I can't really trust JCO...I feel that she herself is perhaps on the spectrum and hence looks after herself first and basically all her emotions are filtered through her writing. Still it's an achievement that Greg Johnson pieced together this portrait of a remarkable woman. I certainly feel that though I can't trust JCO, and I know that her writing comes first and she steals or borrows without intention of giving back, if needs be, for her stories, she is nevertheless a genius and quite lacking in a major ego. I feel like i got to know her, even if there is still so much about her that is unavailable due to the incredible discipline and passionate love she has for her craft, her art, her \"life's blood.\""}, {"userName": "Susan ", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/1978459-susan", "userReview": "Contains more information about JCO than many (most?) people might want to read. I discovered her writing late, with \"We Were the Mulvaneys\", found in an airport store while contemplating a long and uncomfortable series of flights. I was devastated by the book. Then I read \"them\" and I was caught for good. JCO is so prolific that I'm not sure I'll ever read everything she has written in a single life-time. This biography explained so much about the source of her personal character, and her writing. Unfortunately this book was published in 1998, and she's written so much since then, so there's more...much more....I want to know."}, {"userName": "Robert", "userReviewDate": "Jan 05, 2010", "userURL": "http://www.goodreads.com/user/show/521920-robert", "userReview": "Excellent portrait of an extraordinary woman. I was completely entertained and fascinated and plan to continue reading much more by JCO. Lord knows there is *plenty* to choose from."}, {"userName": "J. Guapster", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/19703901-j-guapster", "userReview": "Johnson weaves together literary analysis and Joyce's biography very expertly. A little repetitive in places, however. A quick read."}, {"userName": "Clare", "userReviewDate": "Feb 19, 2008", "userURL": "http://www.goodreads.com/user/show/340856-clare", "userReview": "I enjoyed learning Oates' writing & editing techniques and how her personal experiences have shaped her writing. She is very disciplined and prolific."}, {"userName": "Jen Hsieh", "userReviewDate": "Mar 16, 2007", "userURL": "http://www.goodreads.com/user/show/18495-jen-hsieh", "userReview": "An intimate look at one of today's most prolific writers."}], "description": "Johnson reveals little-known facts about Oates's personal and family history and debunks many of the myths that have arisen about this brilliant, enigmatic woman. Johnson takes readers from Oates's impoverished childhood in upstate New York and the birth of her autistic sister through Oates's studies at Syracuse University, where her talent was immediately recognized, to the full breadth of her astonishingly productive career. His astute examination of Oates's novels, short stories, and plays demonstrates how her art has been informed by her life.", "title": "Invisible Writer: A Biography of Joyce Carol Oates", "url": "https://www.goodreads.com/book/show/129550.Invisible_Writer", "average": 3.83, "cover": "https://images.gr-assets.com/books/1171988271l/129550.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/9856.Greg_Johnson", "name": "Greg Johnson"}], "type": ["Biography", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/129550.Invisible_Writer", "http://www.goodreads.com/book/show/423186.Invisible_Writer", "http://www.goodreads.com/book/show/206554.Pagan_Babies", "http://www.goodreads.com/book/show/2297247.The_25_Days_of_Christmas", "http://www.goodreads.com/book/show/689706.World_According_to_God", "http://www.goodreads.com/book/show/10264350-a-very-famous-social-worker", "http://www.goodreads.com/book/show/29492944-amazon-prime"]}