{"ratings": 1562, "userreviews": [{"userName": "Jan-Maat", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "[one must allow for coffee breaks (hide spoiler)]"}, {"userName": "Issicratea", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/23268828-issicratea", "userReview": "I can’t believe quite how dismissive, or damning-with-faint-praise, the English-language reviews of this novel on Goodreads are. It’s a relatively early novel of Fontane’s, considering his late start as a novelist (it was published in 1888, when he was almost 70), but I think it’s a minor melancholy masterpiece, almost up there with his great Effi Briest. The German title of this novel is Irrungen, Wirrungen—Confusions, Delusions, as a previous English translation renders it. I like that far more than the more portentous On Tangled Paths, which is the title of the Penguin Classics edition in which I read it. Irony seems to me key to Fontane’s art, and the sense that human experience can be simultaneously tragic and banal.Fontane is at his most minimalist here (if I can generalize on the strength of having read only three of his novels so far). There are no dramatic events of the type we find in Effi Briest or Irretrievable, and Fontane deliberately underplays what little action there is. The arc of the narrative is familiar and predictable to the point of cliché: a love affair between a lower-class girl and an impecunious young aristocrat, preordained to end in tears. Everything falls out pretty much as almost every character in the novel has been predicting from the first pages, but that doesn’t weaken the novel in the least. The feelings of both protagonists are explored in a characteristically sensitive, mobile, oblique, slightly understated manner. It’s there that the interest of the novel resides.The sense of place is very strong in this novel, as in the other two novels of Fontane I have read. Lene’s childhood home on the outskirts of Berlin, where many of the early scenes take place, is an evocatively rendered location, as is the local holiday resort Hankel’s Stowage (Hankels Ablage), where she and her lover Botho slope off for a poignant failed tryst. I also liked Botho’s meandering cab ride to the cemetery at Rixdorf to lay a wreath on Lene’s mother’s grave: the kind of completely inconsequential and yet strangely emotionally charged episode at which Fontane excels. There’s an elegiac feel to the topography of the novel, as well as to its sentimental texture. The first sentence, describes the market garden near Lene’s house, as having “still” been there in the mid-1870s, when the fictional narrative begins, as if it seems extraordinary, only a decade later, that such a thing could ever have existed so near to the center of Berlin."}, {"userName": "Cat {Wild Night In}", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/5284431-cat-wild-night-in", "userReview": "First published in 1887, Irrungen, Wirrungen tells the story of two lovers who are doomed to never spend their lives together despite wanting to.Although the theme was hardly a new one, even to contemporary readers, the way the story unfolds is beautiful- Fontane has a knack of leading the reader by the hand, showing and not telling the depths of the main characters’ feelings for one another.Lene, the main female character says from the start that her relationship with Baron Botho cannot last. Instead of the couple fighting against tradition and society’s expectations, the pair of them whole-heartedly embrace said expectations. Later in the novel, a friend of Botho says that he is going to defy convention and marry the penniless love of his life. Botho replies that if he goes ahead with a marriage, it will bring misery to both of them in the long run as it goes against the status quo."}, {"userName": "Julia", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/9424947-julia", "userReview": "Eine Novelle, die den Realismus bedingungslos repräsentiert. Keine romantische Verklärtheit, kein Spannungsbogen, keine Auflösung. Nur das Leben, tragisch in seiner Einfachheit und deprimierend Lebensnah.Dieses Buch sollte man nur lesen, wenn man sich für klassische deutsche Literatur, oder das Werk Fontanes interessiert. Das bewundernswerte hier ist schlicht sein ergreifender Realismus und um den zu erleben, kann man auch einfach aus dem Haus gehen.Die Geschichte hinterlässt höchstens einen Anflug von Melancholie bei dem Gedanken daran, dass es im wahren Leben nun mal kein Happy End gibt und die Liebe nicht die Antwort auf alle Fragen ist."}, {"userName": "Leonie Zeller", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/36665779-leonie-zeller", "userReview": "3.5 ⭐ best book I had to read for school (in German)"}, {"userName": "Elisa", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/46580546-elisa", "userReview": "Edit (May 2018): 2 ⭐️April 2017: 1.5 ⭐️"}, {"userName": "bookishmind", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/29702891-bookishmind", "userReview": "2.25I finally finished this book for school and it actually wasn't the worst book I've ever had to read for school lol"}, {"userName": "Sarah", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/51254693-sarah", "userReview": "\"Jetzt ist es schwer, aber es vergisst sich alles oder gewinnt wieder ein freundliches Gesicht. Und eines Tages bist du wieder glücklich und vielleicht ich auch.\"\"Glaubst du's? Und wenn nicht? was dann?\"\"Dann lebt man ohne Glück.\"Hachja <3"}, {"userName": "Larou", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/7821634-larou", "userReview": "Theodor Fontane is generally considered to be the pinnacle of the realist novel in Germany, something like the German equivalent of Balzac and Dickens. There is one marked difference between his novels and that of his French and English counterparts, though – Fontane’s novels lack any trace of the sensational novel and of melodrama that run so strongly through the work of the other two. There never is much in the way of plot, and even if characters die through suicide or in duels, there is never really any sense of drama to it – even tragic events appear business as usual, pieces of miscellaneous news on the last page of the morning paper whose perusal hardly raises an eyebrow. Depending on the reader’s bias, the resulting novels have been called true to life, poetic, or plain boring, but for the most part, Fontane is considered on of the most important German language writers of the late 19th century.Irrungen, Wirrungen fits quite well into this (the common English translation of this title as “Trials and Tribulations” is quite far off the mark, by the way, ”Delusions, Confusions” is much closer to the German original, while “Entanglements” follows the spirit even as it strays from the letter). The novel, one of Fontane’s earlier ones, does not have an antagonist, does not even really have any conflict – it is about a pair of lovers separated by class, petit bourgeois Lene and aristocratic Botho who spend some time together but then go on to marry someone more appropriate to their social status. In the end, everyone just agrees to do the reasonable thing, and while they might bear some regrets both of the novel’s protagonists see societal conventions as something that cannot be circumvented or rebelled against but only submitted to. Even the reader is left behind wondering if this outcome isn’t the best for everyone concerned after all.I used to intensely dislike Fontane; after struggling through two of his novels (struggling to stay awake, mostly), I filed him under “terminally boring” and gave up on him. It was somewhat to my surprise, then, that I not only felt the sudden urge to re-read something by Fontane but also found myself actually enjoying it – I suppose this is an indication that I’m getting old.The plot of Irrungen, Wirrungen, such as it is, is almost reminiscent of Henry James, with class barriers playing the part of the gap between the Old and the New World, but the authorial temperaments of Fontane and James could hardly be more different. Where James constructs a hyper-subtle, extremely close third person point of view, Fontane’s narrator is omniscient and his tone genial and conversational – the German word “gemütlich” nails it quite precisely, evoking some kindly old grandfather figure sitting by the fireplace wrapped in a blanket and with his feet up telling stories from his life and times. But as it turns out, that congeniality is not really to be trusted – it masks just how relentless and without hope of escape a grip social conventions have on the novel’s protagonists. As one of the novel’s minor figures, Frau Dörr, puts it (in an entirely different context but the image seems clearly intended as an emblem for Prussian society in the late 19th century), “It’s a swamp that just pretends to be a meadow.”"}, {"userName": "Czarny Pies", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/29160274-czarny-pies", "userReview": "“Trials and Tribulations” is about achieving happiness in late nineteenth century Prussia by following society’s rules. Young men can sow their wild oats with women of inferior social station but when the time comes in their lives to enter into respectable marriages they must promptly end any inappropriate liaison. Young women from lower social classes should respect the rules that govern the lives of any lovers they might have from higher social classes and not make a fuss when they are inevitably dropped.When our hero Baron Botha realizes that his financial difficulties have left him with no other alternative but to enter into an advantageous marriage, he rapidly terminates his affair with Lena a seamstress: He says to Lena: “Order is a great thing and sometimes it is worth everything. And now I must ask myself, has my life been ‘orderly’? No. Order means marriage. … Yes my dear Lena, you too believe in work and orderly living, and you will understand and not make it hard for me.”Totally nonplussed, Lena our heroine assures him that she will not any fuss saying: “I am not like the country girl who ran and threw herself into the well because her sweetheart has abandoned her.” Botha is of course immensely relieved. He does later reflect that he might have fled to the new world with Lena and started afresh. However, doing so would have required more effort than our hero would have been willing to make: “I cannot leave the service (i.e. my military career) at twenty-seven years of age to become a cowboy in Texas or a waiter on a Mississippi steamer.”Lena fortunately finds a nice young man from the appropriate social class who is anxious to marry her even after she informs him of her fling with the Baron. The Baron is similarly fortunate as his wife chooses to gently smile at his earlier dalliances. I find it difficult to admire any of the characters in this well-crafted novel but I must acknowledge that it probably describes very accurately the reality of a certain era."}, {"userName": "Sara", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/45382102-sara", "userReview": "my teachers version of the electric chair"}, {"userName": "Barbara", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/2619724-barbara", "userReview": "Beautifully written story, set in Berlin in the late 1800s, about a poor seamstress and a young baron who fall in love. Lene, the seamstress, supports herself and her mother while the baron's fortune is on the brink of collapse. The economic and social circles they both inhabit doom this relationship; Lene knows it and deals with it, but Botho, the baron adapts less readily. It's a well done look at the effect of societal classes and expectations on one's destiny and happiness.I think it's just shy of 4 stars."}, {"userName": "Stanley Levine", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/28337063-stanley-levine", "userReview": "I found it plodding the first time through (2015-6), but on second reading (October 2017) it proved to be very pleasant and rewarding, probing the psychology and intimate emotions of a set of well-intentioned young people involved in what is both a social conflict and a love(?)-triangle, and providing insights on nineteenth century German society particularly the noble-military caste and the simple people -- it's focus is on the two main characters, Botho von Rienaeker, a young cavalryman scion of an impoverished branch of an old military/noble family and Lene Niempsche, his lover and beloved [spoiler warning, stop here] -- as well as the less fully developed but well delineated Kaethe Sellentin, from a well-to-do family, described as his \"Kusine und [financial] Retter\" whom he ends up marrying out of economic necessity and social/familial pressure. Lene embodies all of Botho's ideals of nature, truth, simplicity while Kaethe represents the opposite: artifice, superficiality, elegance. But Botho abandons his ideals in favor of order and social acceptance. He has second thoughts, but in the end burns his carefully preserved letters from Lene - Kaethe catches him but instead of being furious with retrospective jealousy, as he had feared, she understands her victory and participates gleefully in the 'auto da fe'. The next day, she happens on a wedding announcement in the newspaper: Lene has married the older, eccentric Gideon Franke. Kaethe, as befits both her class and personality, reacts not to the matter itself (unsuspecting of its pertinence to her) but to the superficial: she laughs at the ridiculous (\"komisch\") names of the newly-weds, Gideon and Niempsche. Botho's reaction to this news is left to the reader's speculation."}, {"userName": "Dafne", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/23194057-dafne", "userReview": "Abbandonato il mestiere di farmacista, Theodor Fontane - che fin da giovane aveva coltivato la passione della scrittura - si dedicò alla carriera di giornalista e di recensore teatrale. Autore tedesco d’origine francese, conservatore e allo stesso tempo impietoso critico della Prussia imperiale di fine ottocento, della borghesia dei nuovi ricchi, dell’arrivismo e dell’opportunismo, si affaccia alla carriera letteraria esordendo all’età di sessant’anni con L’adultera, primo di una serie di romanzi che avranno come protagoniste (anche nel titolo) donne, tratteggiate e giudicate con grande umanità, sensibilità, affetto e profondità.Irrungen Wirrungen è una delle prime opere di Fontane e uscì sulla rivista Vossische Zeitung nel 1887, e sin dall’inizio incontrò un dissenso da parte della critica e del pubblico.Il titolo originale non ha equivalenti nella nostra lingua, e benché sia stato pubblicato diverse volte in Italia, ogni volta è stato tradotto con titoli diversi.Il libro, ambientato a Berlino tra il 1875 e il 1878, racconta la storia d’amore tra la stiratrice Lena Nimptsch (appartenente alla classe borghese) e il barone Botho von Rienäcker, ufficiale dell’esercito prussiano. I due si conoscono il lunedì di Pasqua durante un giro in barca nel parco della città, gita in cui la giovane Lena rimane quasi vittima di un incidente e il barone Botho interviene per salvarla. Tra i due nasce un’amicizia che, durante il corso delle settimane successive, ben presto si trasforma in amore. I due intrattengono una relazione pura e allo stesso tempo appassionata. Botho frequenta la casa della giovane, una piccola casetta vicino allo zoo della città, e simpatizza con la madre adottiva di Lena, la signora Nimptsch e la famiglia Dörr, vicini di casa di madre e figlia.Sin dall’inizio, Lena sa in cuor suo che la relazione con il barone non potrà andare avanti a causa della differente classe sociale cui i due appartengono; un giorno, infatti, Botho riceve la lettera di uno zio, in quei giorni di passaggio a Berlino, che lo vuole incontrare. Durante l’incontro, lo zio gli ricorda il precedente impegno di sposare la giovane e ricca cugina Kätherina von Sellenthin, il cui immenso patrimonio darà la possibilità alla famiglia di Botho di poter ripagare un prestito che altrimenti sarebbe impossibile da rimborsare a causa della precaria situazione finanziaria familiare.Prima di potere decidere il suo futuro, Botho propone una gita fuori città a Lena, durante la quale si paleserà l’impossibilità di continuare la loro relazione e i due amanti dovranno rassegnarsi, malgrado non lo vogliano, a vivere l’uno lontano dall’altra.Ogni volta che leggo un libro di Fontane il suo stile mi piace sempre di più. È stato bello leggere un suo romanzo dopo un bel po’ di tempo dall’ultima volta; penso proprio che non lascerò passare troppo tempo prima di rituffarmi tra le pagine di un suo libro. Theodor Fontane è un autore poco conosciuto in Italia, ma secondo il mio modesto parere meriterebbe una riscoperta.Errore e passione (questo il titolo in italiano di quest’edizione) è un breve romanzo, in cui non accade nulla di particolare, dove non ci sono colpi di scena o azione, sviluppi drammatici di grande intensità o descrizioni minuziosissime dei personaggi, ma vi è una bellissimo affresco della società berlinese e tedesca degli ultimi decenni del XIX secolo.Il libro ha al centro della narrazione la vicenda sentimentale di due giovani, nata per caso e vissuta nella consapevolezza della sua fine forzata, perché le convenzioni sociali renderanno impossibile la sua prosecuzione. La società tedesca sotto il re Guglielmo I, infatti, impedisce qualsiasi unione tra due persone appartenenti a classi differenti, senza gettarli nel disprezzo e nel rifiuto della collettività. L’autore, grazie ad una grande e acuta capacità d’osservazione, quasi microscopica, ritrae la società dell’epoca con sottile ironia, disapprovando l’ipocrisia e l’attaccamento a valori e a codici ormai trapassati, senza perdonare nulla né alla piccola borghesia né alla nobiltà.Si dice che Fontane (considerato uno degli autori tedeschi più importanti del XIX secolo) faccia dialogare i suoi personaggi, e malgrado abbia letto solo due opere, posso affermare che ciò è vero; ad esempio, anche in questo romanzo i dialoghi si svolgono in circoli ristretti nel corso dei quali i vari personaggi rivelano pensieri, atteggiamenti, interessi che ci permettono di conoscere a fondo le loro vicende e i loro caratteri. Fontane usa sapientemente diversi registri di linguaggio per dare quel ritratto dei personaggi che altrimenti non sono descritti fisicamente; infatti, conosciamo la protagonista Lena come una ragazza buona, sincera e un po’ ingenua, coraggiosa e anticonformista, grazie a suoi pensieri e alle conversazioni nella vita quotidiana; Botho, invece, si presenta come un ragazzo gentile ma un po’ spavaldo e, alla fine anche codardo. Nota di merito va ai discorsi logorroici ed autoritari che caratterizzano la signora Dörr, vicina di casa, matura e “vissuta”, della famiglia Nimptsch, che spesso fa da accompagnatrice alla giovane coppia durante le loro passeggiate nei dintorni.Bellissime, accattivanti ed evocative, quasi come un quadro o una vecchia fotografia, le descrizioni del paesaggio berlinese, sia interno sia esterno alla città. Un romanzo, Errore e passione, narrato molto bene e dal ritmo tranquillo, in cui spicca la grande penna di Fontane, la sua gran cultura e preparazione, il suo sguardo ironico e acuto nel raccontare una storia apparentemente semplice; in cui sono presenti implicazioni religiose, sociali e simboliche (basti pensare alla scelta dei nomi dei personaggi, presi con leggere alterazioni, da personaggi storici o letterari, oppure con significati sottintesi ed ironici), o citazioni di frasi e situazioni tratte da opere d’altri autori. Un’opera che strappa qualche sorriso ma, allo stesso tempo, fa riflettere su quanto le convenzioni sociali possano distruggere le vite e gli amori delle persone.Tutti i godimenti sono in fin dei conti immaginazioni, e chi ha più fantasia gode di più. Solo l’irreale costituisce il valore ed è, per così dire, l’unica cosa irreale."}, {"userName": "Eric", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/106263-eric", "userReview": "Unbelievably great. A doomed romance across class lines, a tale of cold decisions, of loss and regret, told simply & compellingly without any of the histrionics or maudlin conventions usually associated with such an enterprise. An early effort from Fontane, whose prose cuts right to the heart: perfectly balanced, clean, crisp, surgical. (Much credit due translator Peter James Bowman). The flavor of Berlin as a city in transition, both physically & spiritually, near the end of the 19th century is in the air & in the background, adding an extra element of authenticity to the landscape the characters wander thru, as well as a disquieting sense of foreboding. Fontane brings us into the worlds of both the working class and the moneyed military with equanimity & avoids any anxiety, bias, confrontation or sensationalism. Nevertheless, the story is a devastating one that presages the coming century in its clinical treatment of psychological issues, its realism & irony. Incredible & unforgettable."}, {"userName": "wennausbuechernliebewird", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/69079382-wennausbuechernliebewird", "userReview": "An Reclam Hefte gehe ich immer mit gemischten Gefühlen heran. Doch bei diesem Buch war meine Sorge unbegründet. Romane liebe ich ja und selbst dieser altertümlichere Roman hat mich überzeugen können. Trotzdem finde ich ihn etwas langweilig, aber die Story ist mega schön. Es hat mir richtig gut gefallen, selbst der Schreibstil war wunderschön, auch wenn man nicht alles unbedingt auf anhieb verstand (dafür gibt es ja den Lektürenschlüssel;))Ich hätte nur im Verlauf des Buches mehr von Lene gehört, nach der Trennung von Botho, wobei dies im großen und ganzen auch ok war.Ich kann auch die Entscheidung von Seiten Lene verstehen.Also mein Fazit lautet, die BESTE Schullektüre, die ich bis dato gelesen habe"}, {"userName": "Sophie", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/63092968-sophie", "userReview": "Ich kannte schon mehrere andere Romane von Fontane, aber auch Irrungen, Wirrungen hat mir unglaublich gut gefallen. Die Beziehung zwischen Botho und Lene fand ich sehr schön dargestellt, auch der Charakter von Lene hat mir gefallen - ich habe sie nicht als typisches Frauenbild aus dieser Zeit empfunden, sondern relativ stark und selbstbewusst. Die Romantikerin in mir hätte sich natürlich ein anderes Ende für die beiden gewünscht, aber dennoch gehört der Roman jetzt zu einem meiner absoluten Lieblinge!"}, {"userName": "Nyx", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/5838044-nyx", "userReview": "Dafür, dass ich nichts erwartet habe, hat es mir wirklich gut gefallen, daher hätte ich lieber noch ein halbes Sternchen mehr rangesetzt. Es zeigt ein nettes Bild der Zeit (Bonus: in Berlin), wie weit das mit der romantischen Liebe dann doch war und das am Ende jeder einen Strich dort zieht, wie Stand und Ehe beginnt. Es ließt sich super in kleinen Häppchen weg. Ein netter kleiner Klassiker für zwischendurch, wenn man keine Lust auf melodramatische Liebesgeschichten hat."}, {"userName": "Moehrchen", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/51253291-moehrchen", "userReview": "Since this is a realistic novel, I am sad to think that it was common for aristocratic young men to have a liaison or two with young women of the lower middle class. I was waiting for something dramatic to happen, but it did not. Wondering, why Fontane named the novel as he did, because I cannot find the connection."}, {"userName": "Alia Ahmed", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/61953577-alia-ahmed", "userReview": "the story is not the greatest, however his critique, his unique attention to details and all the foreshadowings and symbolics found in the book make up for it. Fontante is a master of critique and was way ahead of his time on that one."}, {"userName": "Buch_leben", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/76250043-buch-leben", "userReview": "Was soll ich sagen...eine Schullektüre die zu tode analysiert wurde...nicht gut"}, {"userName": "Arynee", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/70490625-arynee", "userReview": "\"Wie poetisch und doch realistisch, traurig. Wirklich tragisch beschrieben...\"\"das Leben hat halt nicht immer ein Happy End.\""}, {"userName": "Spracherwerb", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/51713507-spracherwerb", "userReview": "This was probably the only book that was compulsory to read in school and that I actually enjoyed. I still think about characters sometimes, and I was really moved back then."}, {"userName": "Annika", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/32458148-annika", "userReview": "Hmm, wieder so ein typischer Schulroman, durch den ich mich eher quälen musste als alles andere. Mich nervt es einfach, dass wir in der Schule immer nur Liebesromane durchnehmen, aber nie Bücher über andere Themen.Dennoch gebe ich Fontanes Werk drei Sterne, da es mir schon irgendwie gefallen hat. Klar war das Konzept alt, dennoch fand ich die Auflösung mal was anderes und auch die Bedeutungen hinter seinen ganzen Umschreibungen und Sätzen sind ziemlich faszinierend."}, {"userName": "Miriam - Dei libri sotto il braccio", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/56870432-miriam---dei-libri-sotto-il-braccio", "userReview": "Non conoscevo Theodor Fontane prima di adesso. \"Errore e passione\" è il primo romanzo di questo autore che leggo, ma date le premesse non credo che sarà l'ultimo.\"Errore e passione\" narra la storia dell'amore impossibile tra Botho e Lena: lui barone e soldato prussiano con problemi economico-finanziari; lei ingenua, sincera e normale esponente della piccola borghesia. Si conoscono per caso durante una gita in barca e si innamorano all'istante, intrattenendo una relazione semplice quanto appassionata. Lena, però, è consapevole che quella felicità è destinata a non avere seguito, infatti un giorno Botho riceve la visita di suo zio che gli ingiunge di affrettare le nozze con la cugina Kathe, che lo aiuteranno a migliorare la condizione finanziaria sua e anche della sua famiglia. Lena accetta senza rimorsi la scelta di Botho e anche lei finirà per sposare un uomo, Gedeone, più vicino alla sua condizione sociale di quanto non fosse il suo amato. Entrambi, però, saranno sempre innamorati l'uno dell'altra, nonostante le scelte che li hanno portati ad allontanarsi.Romanzo breve ma intenso, molto ben scritto e molto appassionante; le implicazioni religiose, sociali e simboliche (a partire dai nomi di ogni singolo personaggio) non fanno altro che aumentare il valore e la bellezza di tale opera."}, {"userName": "Hannah Read", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/22286804-hannah-read", "userReview": "'On Tangled Paths' by Theodor Fontane is a classic love story between Botho, an aristocratic cavalry officer and Lene, an orphaned seamstress. Due to their class-related circumstances, they find themselves against society in their wish to be together. I actually really liked this book. It is beautiful, and for an early novel is rather good. The story follows both Lene and Botho from the moment they meet until the end. Fontane is incredibly descriptive of his character's circumstances and emotions, and really paints a picture for the reader. Some of the book is quite hard to read, as Fontane has a habit of writing very long dialogues, but apart from that I found myself getting through it quite nicely.As this was a translated version, there was also an addition of footnotes, which were quite useful to me. I definitely found some of it hard to understand and so the footnotes put the background knowledge in for me. However, I am not from Germany and know nothing of their history, and so this was difficult for me; I am assuming the audience it was intended for originally would have understood this in much more detail, and so it wouldn't have been a problem.Although the story was short, I felt involved in the characters' lives, and found that the length actually really worked. I was hoping and hoping for an ending throughout and, although it wasn't necessarily the ending I had hoped for, I really did enjoy it, and it left me with this thought: 'If your brain and your heart are both heading towards different options, always go for your heart, because the lack of heart can never fully be replaced.'"}, {"userName": "Lara Mi", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/21924792-lara-mi", "userReview": "On Tangled Paths probably deserves a second chance. It was a mandatory read for a course I did not enjoy. I have vague memories of the plot and of not really liking it - but I couldn't explain why. Perhaps one day I will give it another try!"}, {"userName": "Karla Eaton", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/17926213-karla-eaton", "userReview": "Well, I am embarrassed to say, I don't get it. This is supposed to be Fontane's masterpiece. It left me cold. As a love story with the classic conflict of class difference, I see the point, but I disliked Botho so severely, I could not help but cheer when he leaves Lene because he felt obliged to his family to marry for money and expectations rather than love. I do not see what she saw in him. She is a delightful woman - honest, independent, loving, devoted, selfless. He is everything modern man should find repulsive in the moneyed class - lazy, pompous, self-obsessed, and arrogant. How could anyone of anytime be reading this thinking that Lene would be happy with him? I am off to do some lit crit reading on this to see another perspective. Many it is the translation, maybe the era - regardless, not high on my list."}, {"userName": "Lydia", "userReviewDate": "Oct 14, 2011", "userURL": "http://www.goodreads.com/user/show/4903231-lydia", "userReview": "Prekvapivo dobré! Naozaj pán Fontane je zatiaľ jediná svetlá výnimka medzi nudnými nemeckými autormi s ktorých dielami som mala tú česť sa zoznámiť.Trošku k dielu: hlavná hrdinka so silným charakterom, úprimná a dosť sebavedomá dievčina mi bola veľmi sympatická. Hlavný motív diela je láska medzi dvoma ľuďmi z rôznych spoločenských vrstiev - trošku otrepaný ale veľmi dobre spracovaný. príbeh je situovaný v Berlíne 19 storočia - krásne opisy, vecné, zachytávajúce atmosféru, nie príliš rozvláčne. Lenkin milý, barón Rienäcker, sa mi až tak nepáčil a nakoniec dostal, čo mu patrí za svoju zbabelosť."}, {"userName": "Iris", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/50989512-iris", "userReview": "I read this novel for my German class.I was surprised that I actually enjoyed it, eventhough some consider it as \"just another love story\".However, this shows how love was in that time, and how happy we can be to live in this time with all out freedom. There was on thing I didn't like though, and that was that both Botho and Lene didn't at least try to make their relationship work. I felt the story just lacked some action.However the scenery and emotions were all beautifully described!"}], "description": "Mit großer Nüchternheit beschreibt Fontane die Irrungen und Wirrungen einer Gesellschaft, die sich vom Gebot der Menschlichkeit entfernt hat und in der das unstandesgemäße Liebesverhältnis zwischen einem Adligen und einer kleinen Plättnerin scheitern muss. Allein in deren Gedächtnis dauert diese \"Herzensbindung\" an und erinnert beständig an die Notwendigkeit, der Menschlichkeit wieder die Geltung zu verschaffen, die sie im kurzen Glück Bothos und Lenes besaß.", "title": "Irrungen, Wirrungen", "url": "https://www.goodreads.com/book/show/1477414.Irrungen_Wirrungen", "average": 3.22, "cover": "https://images.gr-assets.com/books/1184013011l/1477414.jpg", "reviews": 57, "authors": [{"url": "https://www.goodreads.com/author/show/68613.Theodor_Fontane", "name": "Theodor Fontane"}], "type": ["Classics", "European Literature", "Fiction", "Academic"], "outlinks": ["http://www.goodreads.com/book/show/1477414.Irrungen_Wirrungen", "http://www.goodreads.com/book/show/9869437-irrungen-wirrungen", "http://www.goodreads.com/book/show/14622978-on-tangled-paths", "http://www.goodreads.com/book/show/9410555-on-tangled-paths", "http://www.goodreads.com/book/show/1969633.Irrungen_Wirrungen", "http://www.goodreads.com/book/show/2674946-irrungen-wirrungen", "http://www.goodreads.com/book/show/16078397-irrungen-wirrungen", "http://www.goodreads.com/book/show/1616478.Trials_and_Tribulations", "http://www.goodreads.com/book/show/17268360-amori-errori", "http://www.goodreads.com/book/show/36317693-errore-e-passione", "http://www.goodreads.com/book/show/12877814-benie-s-enie", "http://www.goodreads.com/book/show/442296.Effi_Briest", "http://www.goodreads.com/book/show/1532643.Frau_Jenny_Treibel", "http://www.goodreads.com/book/show/1493972.The_Stechlin", "http://www.goodreads.com/book/show/1740855.Unterm_Birnbaum", "http://www.goodreads.com/book/show/8642815-irretrievable", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}