{"ratings": 36907, "userreviews": [{"userName": "karen", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[Kellner, Dreckschmidt, and young Dailey. (hide spoiler)]"}, {"userName": "Nathan", "userReviewDate": "Sep 17, 2007", "userURL": "http://www.goodreads.com/user/show/368200-nathan", "userReview": "Ever want to read a nonfiction tragedy about a presumptive meteorologist? Exactly. Still, Isaac's Storm is an engaging cautionary tale, and one with a bit of relevance for America today. In fact the book is almost foreshadowing in that it was published just a couple of years before Hurricane Katrina. The writing in this book is not nearly as tuned as it is in The Devil in the White City, but Larson is still better at this than nine of ten nonfiction writers. Side note: when Katrina hit, several talking heads on CNN, FOX and MSNBC repeated the myth that there had never been a deadlier hurricane in the US. The next day, they apologized for a factual mistake, and started talking about Galveston, Texas and the events of this book. It's a good reminder that man really does repeat the same mistakes when he forgets having ever made them to begin with.NC"}, {"userName": "LeAnne", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "It's been 15 years since I read this chilling account of the event that annihilated more than 6,000 American souls in one fell swoop, but it still haunts me. As Galveston and Corpus Christie brace themselves for Hurricane Harvey, this fantastic book is fresh on my mind.Today, satellite imagery and long term storm forecasts are standard fare. We've all had televisions since our parents or even grandparents were kids. Before that, radios kept people in the know. This outstanding author waltzes us back 100 years to a time when gas lights reigned. We imagine hurricanes exploding onto coastal communities like massive days-long tsunamis with mountainous, unending surges over 25 feet high. Unprepared families were scrubbed away like leaf litter in a gutter while others in stronger structures could only gape in horror.Larsen explains in detail that there actually were meteorologists back in the day, but the basic and scant information they received left them deciding on their own whether to raise the flag for panic or to appease public concerns. Trains washed away with passengers still aboard, and the bloated dead were left unburied for weeks, months, stuck in the shambles of splintered buildings and shattered woodlands.This is the first Larsen book I ever read, and because of the quality of his research and the beauty in his writing, Ive purchased everything he has penned since. Don't miss out on this one!"}, {"userName": "Matt", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "When Hurricane Irene made landfall last month, I’ll admit to feeling a tiny bit of storm envy. Ensconced in landlocked Nebraska, I could only watch on CNN and MSNBC as the winds slashed and the rain pelted and the seas rose. Friends on the east coast littered my Facebook feed with updates about closures, storm preparations, and hurricane parties. It was the last of these that really made me jealous. I love situational drinking, and a hurricane drunk sounded like a great way to wile away the windswept hours. To be sure, I understand the actual dangers of hurricanes. I don’t need to be told how deadly they can be (seriously, don’t tell me, I remember Hurricane Katrina). However, as a mid-westerner in Tornado Alley, my envy goes beyond the opportunity to skip work and drink Boone’s Farm. In Nebraska, our natural disasters come with only minutes of warning; they drop from the sky and spend a few lethal seconds on earth, before disappearing into the nothing from which they came. As we know from Joplin, tornadoes are a terror. In contrast, a big, slow moving hurricane, which we can follow from birth as well as any human child, seems almost benign. Thanks to technology, there are updates every day of hurricane season, telling us about a tropical depression that might turn into a tropical storm; of tropical storms that just got named; and of named tropical storms that evolved into hurricanes. These monsters are deadly, but they signal their arrival well in advance, giving people plenty of chance to flee. Technology helps make us safe from hurricanes. Technology also lulls us into a false sense of security. Knowing every detail about the composition of oncoming storms (or thinking the same), leads people to make critical judgments about whether they can ride things out. This is not always for the good. A little bit of knowledge, in untrained hands, can be deadly. That, at least, is the point I took away from Erik Larson’s Isaac’s Storm, about the Galveston Hurricane of September 8, 1900. The storm, the deadliest in American history, killed upwards of 6,000 people. It destroyed a city on the make, and hastened a shift in Texas municipal power from Galveston to Houston (a shift helped, of course, by oil). It was an event that, according to scientists such as meteorologist Isaac Cline, could never happen to Galveston. Though built almost at sea level, the received wisdom at the turn of the century was that Galveston was safe. Meteorologists from the fledgling U.S. Weather Bureau calculated projected storm paths and concluded that hurricanes could not strike Galveston. Furthermore, there was a belief that the gradient of the beach would undercut the power of approaching waves. Accordingly, no seawall was built.Isaac’s Storm tells the story of Isaac Cline, the man at the center of this folly, and of the horrible consequences that entailed when people got too comfortable in their certainty. In 1900, Cline was part of the new breed at the Weather Bureau, a nascent, criticized governmental agency that had been wracked by scandal and corruption. He was an ambitious, well-educated man (he graduated medical school in his spare time), and was sent to Galveston to clean up the local Bureau office. Cline did this. During his time there, he also came to believe that Galveston was impervious to hurricanes. (The Bureau as a whole had a hurricane problem; due to bad press from faulty forecasts, meteorologists were warned to be skeptical about issuing hurricane warnings. As a result, Galveston was hammered by a storm that had passed unknown to Bureau men in Cuba). The subtitle of Larson’s book is A Man, a Time, and the Deadliest Hurricane in History. Generally, I’m wary of books with the phrase “a Time” in the title. Simply put, that’s often editorial code for “this book contains plenty of filler.” Now, I’m not philosophically opposed to filler; as with everything in line, it depends on quality. However, I’ve found that filler typically runs the gamut: sometimes it’s homemade stuffing; sometimes it’s Stove Top; and sometimes it’s sawdust. In Isaac’s Storm, there wouldn’t be a book without the filler. There’s not enough information on Isaac’s life for a full scale biography, and a storm by itself is not ample enough a subject for an entire book. Here, the filler is the best stuff. I didn't care much for Isaac’s part of the story. The events of his life are sketchy (many of his papers were destroyed in the hurricane) and Larson has to rely heavily on Isaac’s memoir, which self-servingly makes him the hero of his own story. On the other hand, the contextual aspects of the story – the 1900s in general, and Galveston in particular – are fascinating. The 1900s was a new era of hope, coming after the Gilded Age and the Panic of 1893. It was a time of industrialization and progress. There was electricity and automobiles; within three years the Wright Brothers would take off on a plane at Kitty Hawk. Less than a decade after Galveston, the keel for Titanic would be laid. Man truly believed he had conquered his environment. All this would end tragically in 1914, when Western Civilization collectively decided to commit suicide. Yet it’s fascinating to reenter that time, without the awful foreknowledge of how it’s going to end. (It’s also a bit refreshing to revisit a period of history marked by rationality and scientific belief. Compared to 1900, we’ve regressed in many ways. Today, science is a competing theory, and local school boards get to decide whether our species evolved, or were created by an old guy with a flowing robe and a long white beard). The attitude that marked the age, of course, also led to its great disasters. Galveston, much like Titanic, was guided to its fate by hubris. When it came to Galveston and its susceptibility to storms, many experts broke the first rule of punditry: always bet on disaster. If you’re right, everyone will call you a seer; if you’re wrong, no one will care, because you’re busy predicting another disaster. Larson writes in a crisp, straightforward, journalistic style. It is an approach that does not lend itself to deeper insights into humanity, and the most well-developed character in Isaac’s Storm is the hurricane. Still, it is a style that holds your attention. You can read this straight through without your mind wandering in the slightest. The highest praise I can give is that the sections on the history of meteorology and the composition of hurricanes were among the best in the book. Larson is able to make prosaic experiments and scientific concepts understandable. Rather than falling asleep at the first mention of physics, I actually felt I learned something. Larson also does a good job building tension. Throughout the book, he intercuts scenes from Isaac’s life to update you on the progress of the storm. Each time he checks back in, the storm has gotten closer and stronger, brushing past land masses and tossing about the ships at sea. After such a deliberate, finely-tuned buildup, the climax simply sputters. Quite frankly, the hurricane’s landfall is the least interesting part of the book. Larson does his best to make it visceral, with adjective filled sentences. The problem is that I didn't care about any of the people mentioned. They were just names, abstracted from humanity. My head knew they were people once, but my heart did not. As these names were swept away, one by one, I just couldn’t care. I’m not blaming Larson for this. He makes an attempt to humanize at least one family in Galveston. The problem, I suspect, is that there isn’t much of a historical record for him to comb. The consequence, though, is a description of a storm that quickly becomes numbing and worse, mundane. It’s a list of people I didn't know, getting pulled away by the sea. This is not to say that there aren’t things that stick in your brain. For instance, there was the horrifying fate of 90 some children at the orphanage. The nuns had tied them together, so that no one would get separated, and that’s how their bodies were found, a string of small corpses. And of course there are the usual stories of miraculous survivals, families reunited, and lucky pets. The book ends with a short, closing chapter, that follows Isaac (who lost his wife in the storm) through the rest of his career. Perhaps knowing that he’d failed the greatest task of his life (the one for which he’d trained many years), Isaac spent a great deal of time on self-serving writings in which he attempted to cast himself as a hero, roaming the beach and warning 6,000 people to leave (either the 6,000 people stayed and died, or they all had horrible memories, since there is no documented evidence that Isaac played the role of a maritime Paul Revere). Isaac’s last posting with the Weather Bureau was in New Orleans, which at the time still had its illusions. He was dead long before Katrina came roaring out of the Gulf. In this last section, Larson also notes that, despite technological advances, the unpredictability and fury of hurricanes mean they are still deadly. Since this book was written in 1999, there is a tendency to divine some sort of prophecy in Larson’s warning. I don’t see it that way. Every book about a disaster is going to warn that greater disaster is looming. All of life tends toward doom, and no one ever missed a house payment by predicting that hell will eventually break loose. I suppose the lasting image I’ll take from Isaac’s Storm isn’t the ferocity of the hurricane, but the hubristic certainty of Galveston before the flood. In my imagination, I can see it glittering on the beach, snug and smug and secure. It is a sunny day and kids are playing and laundry is snapping on the lines and mothers are cooking dinner and pot-bellied men in three-piece suits and starchy collars stand in clusters on street corners congratulating each other on their foresight. And just over the horizon is a hurricane. I know I’m supposed to look back at those times and shake my head at those silly humans who thought they understood nature and the universe so well. But I didn’t. Instead, I felt a stirring of nostalgia for an era in which people dreamed big. Today’s world is ruled by cynics, those people who love to say “we can’t,” and then set out to prove it. With so much negativity, the heart almost craves the fast-talking, twinkle-eyed, forked-tongue huckster, promising happiness, prosperity, and a sea that won’t ever rise."}, {"userName": "Rachel", "userReviewDate": "Sep 22, 2008", "userURL": "http://www.goodreads.com/user/show/446079-rachel", "userReview": "Erik Larson delivers every time. He has the rare ability to take historical events and weave together yarns that in the end feel like you're reading a page-turning novel. In \"Isaac's Storm\" Larson takes us to a thriving seaside city in Texas circa 1900, to a time when people felt they could 'control' nature. He paints the story of how the infamous hurricane that hit Galveston, Texas, on September 8th of that year devastated not just a whole community but also destroyed people's faith in man's ability to accurately predict the weather. \"Isacc's Storm\" blind-sided everyone -and what we learn is that there were in fact many dynamics at play that led to its terrible surprise - political, competitive, as well as scientific that ultimately failed the people of Galveston. There were amongst other things, no calls to evacuate. In fact, no one even knew that the oncoming storm was a hurricane, and in the end the death toll was over 8,000 - still to this day the highest death toll resultant of any of our country's natural disasters. Not only does Larson take us back to this time and place and through the storm where we literally feel like we're in the 'eye' of the hurricane with its victims and survivors, but also in the end, in hindsight, it's a lesson in how storms, real and figurative, can blow through and sideswipe the most cautious and unassuming of any of us.It's a reminder of how the unexpected is always upon us. P.s. The amount of detail and research and accuracy of depiction to this story in and of itself make it worth the read. Highly recommended!"}, {"userName": "'Aussie Rick'", "userReviewDate": "Jun 26, 2009", "userURL": "http://www.goodreads.com/user/show/2413336-aussie-rick", "userReview": "What a great story! This book just raced along full of facts and interesting detail about \"a man, a time, and the deadliest hurricane in history.\" I must admit that when this book was first released in Australia I wasn't overly interested. It didn't sound like something that would interest me in the slightest. How wrong can you be, after picking the book up for the third or fourth time and actually taking the time to see what the story was about I had to read it. The author, Erik Larson, presents a gripping and terrible account of the events leading up to the destruction on Galveston on the 8th of September 1900 by one of the deadliest hurricanes in America's history. Along the way the Larson provides details of man's efforts to predict and control the weather and the often-disastrous results when we got it wrong! The personal accounts offered in this book are often very touching and the human drama really gets you involved in the story. The narrative moves along like an action paced novel and you find yourself up in the early hours of the morning glued to the pages. I really didn't want this story to finish, it was a great account and the only fault I could find was a lack of photographs. On a number of occasions Larson refers to old black and white photographs that he had seen during his research for this book, it would have been nice to share these with his audience. Overall this is a great book and well worth the time to read."}, {"userName": "Chrissie", "userReviewDate": "May 06, 2010", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "SPOILER FREE!!!This is a book focused on the science of weather. If that subject does not intersts you, do not rad this book. You must be interested in this science. It is a book of non-fiction; don't expect a book that will relate a harrowing tale of the hurricane that destroyed Galveston in September 1900. You will get that too, but first you must build up to the storm and understand the politics dictating the actions of the Weather Bureau. The scientific facts are mixed with engaging portrayals of the people in the city and with the fascinating characteristics of all hurricanes. I did not find the scientific data dry, but if you are allergic to such I would warn you, this is not primarily a dramatic horror about a devastating hurricane. You get scientific facts and politics too. I have warned you. There is another central theme to this book, and it is related to the title - Isaac's Storm. This book is very much about how Isaac correctly and incorrectly predicted, advised others and was altered by the outcome of the storm. Where did he fail? What should he have done differently? Why did he make the choices he made? I am speaking of events both before and after the storm! He was under pressure. For this reason it is essential to understand what was happening in the life of the Weather Bureau in order to understand why perhaps Isaac made the errors he did and reacted as he did. This storm was very much Isaac's storm, he played a huge role in what happened. His life was changed both personally and professionally by this storm. *********************************************Through page 84: In the comments below this review there has arisen the question of whether Isaac sees himself as a hero or if it is the author that depicts him as a hero. I am paying attention to this question as I read the book. Numerous times I have noted that it is Isaac himself who is so very self-assured. I believe the author thinks differently. Look at this excerpt from page 79 about Isaac's view concerning a famous weather prophet, ProfessorAndrew Jackson DeVoe of Chattanooga, Tennessee:It was the kind of prophecy Isaac Cline loathed. He was a scientist. He believed he understood weather in ways others did not. He did not know there was such a thing as the jet stream., or that easterly waves marched from the coast of West Africa every summer, or that a massive flow within the Atlantic Ocean ferried heat around the globe. Nor had he heard of a phenomenon called El Nino. But for his time he knew everything. Or thought he did.I find that last sentence very telling of the author's point of view. In fact the entire chapter, entitled \"Galveston - An Absurd Delusion,\" points out the errors evident in Isaac's statements concerning the safety of Galveston! The author bases his views on written documents. It is quite clear that the author does not paint Isaac as a hero! ******************************I have just begun. The excitement builds right from the start. I like the scientific acuracy mixed with the people's oh so normal responses. So far adults and children look up:  Men on the ground saw blossoms of cotton with flat gray bottoms that marked the altitude where condensation had begun. Children saw camels, rabbits, and canon fire...Something powerful and ultimately deadly occurred wutrhin these clousd. As the water rose and cooled and condensed, it also released heat. In the sky over Africa 1900, trillions upon trillions of water molecules began breathing tiny fires . This heat propelled the air even higher into the atmosphere until the flatened to form Cumulonimbuscapillatus incus. Incus meaning \"anvil\", the name too of an anvil-shaped bone in the human ear. There were thunderheads. \"Convection.\" Higher up the strongest clouds penetrated the stratosphere. Soon an army of great thunderheads was marching west along the horizon, watched closely by the captains of British ships sailing down the African coast with troops for the Boer War. Seventy to eighty such waves drifted from West Africa into the Atlantic every summer, some dangerous, most not. The captains knew them less as weather, more as geography - something to watch to fill the long hours at sea. At dawn and dusk, the distant clouds warmed the sky with color. Rain smudged from their bottoms in fallstreaks. Frozen virga drifted from their glaciated tops. When the light was just right or a squall was near, the clouds formed an escarpment of black. Frigate birds sidelit by the sun drifted in the foreground and flecked the sky with diamond.  (pages 22-23)We, the readers, have been given the background so we understand what is hidden in the clouds up above. I like the writing because science, people's reactions, danger a nd beauty are all there in two successive paragraphs! The whole book so far is written in this maner. I find it very intersting to read this book NOW. Both then and now the temperatures in the USA have been exceedingly high day after day after day. It is hard to ignore this similarity. But I am no weatherman."}, {"userName": "Checkman", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/5117003-checkman", "userReview": "Popular history with just enough science thrown in to explain what happened without causing the reader to go cross-eyed. Fast moving and engrossing in the tradition of the best suspense/disaster fiction only the 1900 Galveston Hurricane was real. Somewhere between 6,000-8,0000 people lost their lives and the city of Galveston, Texas sustained a body blow that derailed it's ambitions of becoming one of the largest and wealthiest cities in the United States. It's now a moderate sized city that relies on tourism and the insurance industry (historical irony I believe) for it's economic well being. It was long ago passed up by it's business rival Houston. The 1900 hurricane played a large part in that and \"Issac's Storm\" details what happened on September 8. 1900. The book is gripping. Sucks you in and keeps you reading. I was pleasantly surprised that it was so engrossing (often I find this type of pop history to be a bit lacking) and kept turning the pages. I only put it down when I had to. Not a long read it feels like a very well done in-depth article for a monthly periodical. Now for a couple weak points. The book cried out for photos. Thankfully the Internet provides not only photos but even a couple short movies of the clean-up that were made by Edison's people. In addition there are individuals in the book that show up once or twice and then never returned to. In particular I kept waiting to come back to Rabbi Cohen and his family, but we never see them again after pages 155-158 (paperback edition)Once again ,thanks to the Internet, and several Texas based historical societies, I was able to learn what happened to the Cohen family (they all survived and prospered) as well as many others mentioned in passing. The book is short and thousands were effected and I understand that not everyone can be covered in-depth. The main focus in on Isaac Cline and his family, but to have the reader follow the Cohen family for three pages and then to never mention them again is something of a mistake. In my humble opinion.Well regardless of those quibbles \"Issac's Storm\" is very well written. Give it a try. I live in Idaho so hurricanes aren't really a problem, but it would make a nice read if you're at the beach during a garden-variety tropical storm. Just enough to make you stop and listen when a particularly powerful gust of wind rocks the walls."}, {"userName": "JanB ", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/260116-janb", "userReview": "As with all of Erik Larson's books, this one is well-researched and takes the facts and blends them with personal stories. Fans of the author will find much to enjoy."}, {"userName": "Jim", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/36199787-jim", "userReview": "3.5 *At the dawn of the twentieth century American's reveled in new discoveries, new technologies, mastery over everything. Isaac Cline, the chief meteorologist at the Galveston, Texas office of the U.S. Weather Bureau, was a man of science and believed no storm could do serious harm to the city of Galveston, a growing city destined for a great future. In September 1900 this cultural hubris proved deadly.In the summer of 1900 odd things were happening. A heat wave gripped large parts of the United States. The Bering Glacier began to shrink. A plague of crickets engulfed Waco. In Cuba local weathermen noticed and worried about the signs they spotted. They had pioneered hurricane science. America's Weather Bureau had an obsession with controlling hurricane forecasts. The word hurricane could not even be used without permission from the highest levels in the Weather Bureau. The Cuban's were natives. Aboriginals. They could not be believed. The Weather Bureau had science and technology. The Cuban's predicted a hurricane and that it was headed for Texas. The Weather Bureau predicted a storm that would head out to the Atlantic.In Galveston on the night of September 7, 1900 Isaac Cline notices the approaching storm and begins to feel uneasy. Still no one panics. Storms are nothing new to Galveston. Even as the storm hits the city children are playing in the rain. Adults sit on wicker chairs and watch the storm. Storms were a form of entertainment. Until it was too late. This was a tragic tale. The lost of life is unknown. It may have been at least 6,000 and it may have been as high as 10,000. Entire families. Woman, children, babies. Whether a person lived or died seems to be a matter of fate. Do you stay in your home? Do you try and evacuate? There was no right choice. After the storm passed the horrors continued. Large parts of the city were destroyed. Entire buildings and homes were gone. Thousands of corpses had to be dealt with.The human side of the story was fascinating. It was horrible and tragic but it is the real story. Often times, especially early in the story, the author spends a great deal of time explaining the science of weather, hurricanes, cyclones, wind, etc. This dragged my rating down from 4 stars to 3.5. To me when he got into the science it was somewhat tedious reading but the stories of the people were what made this story. And raised the question could it happen again? Do we depend too much on technology?"}, {"userName": "Lobstergirl", "userReviewDate": "Jan 15, 2009", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "It's probably more than a little shameful to admit it post-Katrina, but weather porn can be deeply satisfying. Hurricanes, cyclones, tornadoes, tsunamis, mudslides, styrofoam impaling oak trees, low pressure troughs, the Beaufort scale - don't you feel a little tingly already? When we combine weather porn with the romance of a good story, we get Sebastian Junger and The Perfect Storm: the perfect balance between good science and great storytelling, weaving characters, lives, rescue efforts, and the molecules of the air and the ocean into a seamless tale, juxtaposing the calm detachment of scientific description with the heart-pounding trauma of danger and death.I was hoping for more of the same with Isaac's Storm, but it was not to be. In 1900 the low-lying barrier island of Galveston, Texas was hit head-on by a massive hurricane -- in fact, by two almost simultaneous storm surges, one from the Gulf of Mexico and one from the bay behind Galveston -- that wiped out a good portion of the city and killed between 6,000 and 10,000 men, women and children, and hundreds of horses and cows and other animals. Erik Larson, the author, chooses to examine the disaster through the eyes of the local Weather Bureau head, Isaac Cline. From a weather porn standpoint, this was not a good choice. It's clear that Larson focuses on Isaac Cline so that he can examine the issues of hubris and human flaws: Isaac's own hubris in failing to predict the storm, and the hubris of the newly modern science of weather and climate prediction. (In fact, the Weather Bureau in Cuba did forecast the hurricane, but it continued on to the Florida coast, and Isaac was blinded by his overconfident pronouncements years earlier that a hurricane could not travel west across the Gulf from Florida.) But Isaac didn't leave very much personal material for the historical record (the main source is his 1945 memoir), and what archival material exists on him is exceedingly dry; thus we are subjected to pages and pages of tedious description of Isaac's early career in the Signal Corps at Fort Myer.Perhaps to compensate for the aridity of his source material, Larson waxes verbosely in little weather-related asides, as in this poem to the atmosphere of Cameroon:The air contained water: haze, steam, vapor; the stench of day-old kill and the greetings of men glad to awaken from the cool mystery of night...An invisible paisley of plumes and counterplumes formed above the earth, the pattern as ephemeral as the copper and bronze veils that appear when water enters whiskey.Larson tries very hard to play up the rivalry between Isaac and his younger brother Joseph, who also worked in the Galveston Weather Bureau, describing in detail their disagreements over the storm, their estrangement, the way Joseph never mentions Isaac by name in his autobiography. Since I didn't care about Isaac, I found this story line less than compelling too.Larson might have redeemed himself with vivid descriptions of the storm hitting Galveston -- which he does, to a degree. But his narrative becomes confusing since he is trying to follow so many separate families and individuals, as well as travel back and forth through time, from early evening to nightfall to morning. The water is knee-high at one time and location, waist high at another, neck high at another -- is the water ebbing and flowing, or are we travelling back in time, or is it that the water is higher in one person's house because it is low-lying? I didn't know, and eventually I didn't care. I could have read 700 more pages of The Perfect Storm, but Isaac's Storm at 280 seemed about 200 pages too bloated.The storytelling is also hindered by the absence of photographs. We know they exist, because Larson mentions them, but why weren't they included? Given the tedium of the narrative, they would have provided a welcome distraction.A final point of irritation is Larson's habit of filling in the gaps where the historical record is incomplete. Junger was faced with the problem of having to create a narrative where none existed, since there were no witnesses or survivors to the sinking of the Andrea Gail. He painted a vivid picture of what the men's last hours and moments must have been like, based on readings and measurements from the closest water buoys, and other scientific data. Larson, on the other hand, has all the important historical verification he needs but chooses to embellish the details anyway: Isaac must have gone to this bath house since it was near his house, and must have read books like these. Venomous snakes must have spiralled up into the trees as the floodwaters rose, because we know this happened in later hurricanes. One source cites one name for an orphanage survivor, another source cites another; Larson picks one arbitrarily. Isaac must have checked all the hospitals and morgues looking for his wife, based on the fact that this is what scores of other people were doing, even though what he actually did in the days immediately following the storm is a complete mystery. Isaac must have had happy, blissful dreams, only to awaken to gloom and grief, because Freud's 1900 Interpretation of Dreams states that every dream is a wish fulfillment, and \"what survivor of a tragedy has never dreamed that the outcome had been different?\"It's one thing to suggest that something may have happened in such a way because the preponderance of historical evidence suggests so, as long as you're merely suggesting. To assert something as fact that you don't know is anti-historical. It's not that different from fiction. Larson's modus operandi is to state something as if it were fact in the text, and then to explain in the endnotes that it's not really fact. For example, when Isaac finally finds his wife's body, Larson writes, \"Isaac kept [her wedding ring:], had it enlarged, and wore it himself. It was this ring that gleamed like a beacon from his photographic portrait. He wore it also on December 31, 1900, when Galveston prepared to enter the twentieth century.\" If you bother to read the endnotes, Larson confesses, \"Isaac nowhere states this. It is conjecture, purely, but I base it on...Isaac's essentially romantic character; his devotion to Cora; his deep knowledge of portraiture and the symbolic messages embedded within by their painters...\"In the end, I was left wondering how a story about so much water could be so dry."}, {"userName": "Paul Falk", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/65869572-paul-falk", "userReview": "The author had consumed mountains of research to produce this emotionally charged historical nonfictional account of the hurricane to end all hurricanes that consumed the city of Galveston, Texas. This had been and still remains today the most horrific loss of life due to a catastrophic event in the United States with an estimated death toll estimated at 8000. I had been dutifully reminded and ever more respectful that we are always at the mercy of Mother Nature.On September 8, 1900, Isaac Cline was Galveston's meteorologist on the day of the worst hurricane disaster to strike in American history. The telltale signs had been there. Yet he and other notable experts in the field such as his boss Willis Moore, Chief U.S. Weather Bureau ignored first warnings from hurricaneologists in Cuba that a tropical cyclone was likely headed in their direction - Galveston. Failure to act expeditiously was owed by the American counterparts. At that time, they had felt that the Cubans did not possess an adequate level of academic training in meteorology comparable with those in America. An air of smugness and arrogance was directed at the imposters to the South. This unfortunate circumstance turned out to be their own undoing. Instead, relying mostly on guesswork, they supported the notion that the hurricane was headed up the Eastern seaboard. That's where they \"usually\" went. No threat to the gulf City on the coast. Little did they know that the perfect storm was brewing and had been gathering up strength as it made a beeline in their direction. No mercy was shown as the sea had taken claim of the land and citizens of the doomed city with spitfire rain, record-breaking Gale winds and an unheard of rise in sea level.The aftermath had been a journey into hell. Bodies of people and animals were strewn everywhere. The land had been wiped clean where buildings and landmarks had once stood. The devastation was mind-boggling. Services designed to deal with a burdening death toll were overwhelmed. Attempts to bury the dead at sea failed as many of them had washed back onto the beach. Finally, as a last resort, many the bodies were stacked high and burned in large mounds. The hills of burning bodies were everywhere. The smell of Putrefaction was everywhere. Human ash settled everywhere. It was one of the darkest days in American history. It was the day that \" Galveston became Atlantis.\""}, {"userName": "Jeanette", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "This book details the 1900 Galveston Hurricane disaster. But it does so through the life biography of Issac Cline. He was instrumental for weather prediction and some aspects of governmental weather authority connections. Having had the Kindle read before, I finished this go around with the hardcover. I was a bit disappointed that it had some excellent charts and maps but absolutely no photographs.Larson does these non-fiction accounts well. This was not my favorite, but it sure puts you exactly within that time, place, cognition of what was happening, and all the associative materials about the then current belief system upon the strength, occasion, or worst possibilities for any TX coast hurricane having a devastating outcome. They were certainly wrong upon more than just the certainty of minute by minute changes in gulf/ocean levels. What really increased the star rating of this work, was the historic background (even to the days of Columbus's hurricane on his 4th voyage) and also the describing of the properties of \"swells\" predictions.So many individual family's stories and most highly tragic. Just 2 or 3 blocks apart in dwelling, but what different outcomes! Having to admit I love living close to water- give me an inland lovely lake any time. Not that it is always gentle- but water weight moving on the ocean's scale even within short time periods is human structure failure. Either sooner or later."}, {"userName": "Kristen", "userReviewDate": "Feb 25, 2012", "userURL": "http://www.goodreads.com/user/show/2447725-kristen", "userReview": "I became a fan of Erik Larson after reading Devil In The White City. As a bit of a history buff, I love the way he makes you feel as though you are really in whatever time period he is writing about. This book was especially interesting to me because I have been to Galveston and visited the hurricane museum. Since Erik Larson loves to give a lot of background details I had a hard time getting into the book (a problem I also had with Devil in the White City). But once the hurricane started to get close I got very excited and couldn't put it down. But I was surprised that when the hurricane actually hit I found it to be not so much exciting as it was extremely sad. Larson did such a good job of painting the picture of this hurricane that I was terrified and heartbroken for these poor citizens of Galveston. Of course Devil In The White City was sad as well (being that it centered around a murderer) but every other chapter was filled with the hope and excitement of the fair and the rise of Chicago. Isaac's Storm focused on the failure of the Weather Bureau, the deaths of 6,000 people, and a city that was completely destroyed. A fascinating historical account and definitely a worthwhile read."}, {"userName": "Becky", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/6316460-becky", "userReview": "I feel terrible when I say I like these sorts of books. Perhaps I should say I admire the book, the story that the author accomplished, and that I still feel heartbroken for the pain and suffering that the survivors of the disaster. They are all dead now, the hurricane killed 6,000 people more than a hundred years ago, but their suffering was real, families were blotted out entirely, people that would be great-grandchildren now, never existed because in disasters its just as much about luck as it is skills---- except for when it comes to preparedness. Its all about preparedness.Even now we call hurricanes and tornadoes and earthquakes Acts of God. It even says it in our insurance policies. They are catastrophic events that we pretend nothing can be done about. This simply isn't true. First of all, you have to BELIEVE that it can happen. You have to believe that your city can be hit by a hurricane, no where in the United States is safe from tornadoes (and just because you hear sirens frequently because you live in the alley doesn't mean you get to ignore them), so many people live along fault lines. The simple fact of that matter is that a disaster can be coming for you, and as Joan Didion says \"Life changes in the instant. In the ordinary instant.\" You need to be prepared and this isnt really nearly as hard as people think it is. We have an amazing asset in NOAA, we know when hurricanes and tornados are coming, we often know when there is mudslide potential from hazardous rains, avalanche prevention is maintained on many mountain slopes near populated places. Learn where and when to seek shelter. Have a box in whatever shelter you use in your house that contains, in the very least, a first aid kit, flashlights, a weather radio, backup batteries, bottled weather and a large, thick blanket that can protect you from blowing glass. I also recommend protein bars. If you know weather is coming pack a bag with changes of clothes, wear hard shoes, long pants, pack your medications and chargers. Have a plan with your immediate how/when/where to get a hold of each other if you become separated in disaster situations. Discuss with family members that best types of first aid treatment for various wounds, what to look for in different disaster- dont go to sleep when its cold, stay put so you can be found, move slowly, lay in a ditch for a tornado, move to higher ground for floods, how to test a door for heat if there is a fire in the building, etc. You'd be amazed at the simple LIFE SAVING tasks you can perform, and how huge of a difference they can make. And most importantly, if you feel that you are in danger, listen to your gut feeling. If you feel the weather is going to get bad, and everyone down to your local meteorologist says that the outlook is good. Do what your gut tells you. Whats the best that can happen is you are wrong, but you are safe. The worst is that you are right, others were unprepared and suffered, but you listened to your gut feeling and got to safety. IN all of the disaster stories that I have read this year there was a very strong pattern of people feeling that they were terribly unsafe, moving to where they felt safer, and saving their own lives. Women seem to worry the most, perhaps its a natural instinct to protect their children, but if the mothers in the Cascade Avalanche had continued to insist on the train being moved, 100 mays have been spared. In Isaac's hurricane if mother's had put their foot down and moved their families without their husbands permission, perhaps more would have been left alive at the end. Its truly hard to say, sometimes you can do everything right in the world, but there are something that you cannot hide from.Right soap box over. I volunteer for Red Cross Disaster Relief, so I just ask everyone to do their part to make my job easier. I want to help people, but I dont, because it means something terrible has happened. ANY WAYS.... on to the actual book review:Weather porn, and I loved it. Its not the greatest book for actually helping you understand the mechanics of the storm, but it did a pretty fantastic job of addressing the early history of the weather bureau... which at the time was more politic than it was science any ways. I somewhat hate historical guessing- when authors say for instance \"Isaac must have felt...\" sometimes I feel that its sloppy, but Larson always has a way of convincing me to forgive him because I'm so enraptured by his story telling. Larson deftly wrote about the terror, the horrible scene afterwards, the death pyres, without being the bit lurid.... but I still think that the scenes described will follow me into my sleep. My only real beef is that it was short, and I think that Larson would still have plenty of interest left in the reader to talk about the national affects this storm had on the weather bureau, both politically and scientifically. Isaac obviously learned from it, he argued that ties were the most danger, etc., but the reader isn't allowed to learn much after that fact. Perhaps Larson wanted to end where he did because it was poignant and heartrending. Tough to say. I would have loved to hear his assessment on the storm's impact on history. If anyone was looking for a disaster read I would definitly recommend this book, and place it alongside Under a Flaming Sky: The Great Hinckley Firestorm of 1894 for best in the category of natural disaster. It had a good narrative after the first 50 pages and a good flow of information. it was certainly more accessible than some of the other books, such as The Children's Blizzard or The Worst Hard Time: The Untold Story of Those Who Survived the Great American Dust Bowl both of which were great works of history in my opinion, but were a bit drier and heavy on the fact rather than the story.To read my review of my Natural Disaster Themed read which included 10 different disaster books click link: Here!"}, {"userName": "Dianne", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/20940446-dianne", "userReview": "The death and destruction described by survivors of the 1900 hurricane over the island city of Galveston is terrifying. More people perished in Galveston than in any previous U. S. disaster. Wind gusts of 200 miles an hour generating pressure of thirty tons slammed against the wall of the houses. The hurricane had travelled 800 miles and its flow was focused directly at the city of Galveston. Galveston became Atlantis. \"Mr. Youens' house rose like a huge steamboat, was swept back and suddenly disappeared.\" Dr. Young thought of the family inside. My feelings were indescribable as I saw them go.\" Isaac Cline was a meteorologist and a medical doctor. He took his work very seriously indeed. His boss Willis Moore would not permit unauthorized messages and therefore Isaac was kept from alerting headquarters in Washington of the coming storm's severity. \"The man in charge was one of that all too common category of men who feast on boot polish and see the failure of others as stepping stones toward their own success.\" Whenever an employee was commended by the press Moore would send the employee to a part of the world where their service would not be recognized or acknowledged. Eric Larson's research into the hurricane dubbed Isaac's Storm excels. This is a nonfiction book that deserves five stars."}, {"userName": "Mike", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/545336-mike", "userReview": "The first “intimation” of the true extent of the disaster, Benjamin recalled, “came when the body of a child floated into the station.”\nDoesn't that send a chill down your spine? The true story of the 1900 Galveston hurricane is told in the dramatic, gripping style I am coming to love. Erik Larsen's Isaac's Storm: A Man, a Time, and the Deadliest Hurricane in History is superb. His description of the storm's progression and finally hitting Galveston is riveting. Having gone through a hurricane before, Larsen has convinced me not to tempt Mother Nature again."}, {"userName": "Eric", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/11828590-eric", "userReview": "An interesting and often sad of several accounts of the great hurricane that ravaged Galveston, Texas in September 1900. This Katrina class or stronger hurricane hit this city with the people having no knowledge or warning of the intensity and power these types of storms can unleash.The book loosely follows Isaac Cline and his brother who were the weather observers working for the newly formed National Weather Bureau during this tragic event.The beginning of the book has a general history of severe weather recorded throughout time and the world. The incredible power of the weather on the planet is something gives me reason to be in awe of such power. Our current day technology and knowledge can help mitigate against such disasters but cannot completely insulate us from the impacts of nature. The book also go through a detailed account of Isaac's storm through the eyes of various recorded eyewitness accounts. As an amateur weather watcher, I found this book particularly interesting. A key question in the book is why that the people of Galveston had no idea a hurricane was headed their way? According to the book, there were three overreaching reasons: 1) ego, 2) lack of understanding about hurricanes and 3) not taking the weather signs seriously enough. In the first circumstance, Isaac's boss didn't think the reports from Cuba were reliable. When Isaac's storm passed over Cuba, it was strong and probably hurricane strength. But key U.S. weather officials choose to ignore the Cuban reports and even took steps to make sure no one else had access to the reports. The second, meteorology was a relatively new science at the time. Scientists had little hard data on the nature of hurricanes even Atlantic hurricanes. They knew hurricanes in the Atlantic are generally spawned in the tropical Atlantic ocean where the water is warm and warm winds blowing off northern Africa coast and hurricanes generally took a northwesterly direction toward the West Indies and the eastern U.S. seacoast. Then they take this boomerang hook in a northeastern direction back out into the Atlantic. No hurricane of strength could make it as far west as the Texas Gulf Coast. The third situation is that Galveston itself was no stranger to tropical storms. With highest point on Galveston Island less the ten feet above sea level it got flooded frequently. So the residents of the city built their houses on stilts so the flooding would occur beneath their house! Isaac's storm was different. Initially, it had all the signs of a typical tropical storm. People actually were actually out playing in the water! There was no reason to get particularly alarmed. As time went by though, the flooding and the wind intensified people thought it was soon going to blow over and be done. Even Isaac Cline, a trained professional, thought he could ride out the storm in his house.To be fair though, no one anticipated the storm that actually hit Galveston. Even among hurricanes, Isaac's storm was an anomaly. The eye of the hurricane made landfall west of Galveston keeping the city subjected to the winds of the hurricane wall with sustained winds of 125 to 150 miles per hour. Winds so strong reports of eyewitnesses said \"planed the ocean flat\" meaning even waves could not hold up in those kinds of winds. Reported flood waters rose as high as 75 feet in places. The real peril to human life was from debris whether it was airborne or in huge piles of being pushed around by the waves.Isaac's Storm is both fascinating and sad as it recounts this deadly natural disaster. For people who have an interest in this kind of subject matter, I think this book is a good choice. Also to note, about 25% of the book is taken up in end notes and references cited in the main body of the text."}, {"userName": "Lynn", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/15265939-lynn", "userReview": "This is an historical account of the devastating hurricane that destroyed Galveston, Texas on September 8, 1900. Over 6000 people were killed in what has been called the greatest natural disaster in American history. Much of the story is told from the POV of Isaac Cline, the resident meteorologist for the US Weather Bureau in Galveston. Working with what by modern standards would be relatively crude instruments, the Bureau tried, and failed to map and predict the path of the storm. Political considerations got in the way, personalities overruled common sense and people died. Erik Larson lays it all out in clear, eloquently written prose. In the beginning, the story gets a bit bogged down with the history of the Weather Bureau and some of the meteorological details of the storm. It's all understandable, but a bit dry. Once the storm takes the turn towards the Gulf of Mexico, hold onto your hat, it's going to be a bumpy ride! You can't put the book down. You have already started to care about these people and the city of Galveston, and you know what's going to happen. Larsen's descriptions of the storm while it is happening and it's attendant destruction is just devastating. The aftermath is a horror show. And it was all real. All of it. My only critique would be, like others have said, that he should have included photos, especially before and after. At one point he references some photos that he looked at in his research, so would it have killed him to include some? Fortunately, there is Google. The maps he did include were crude and barely useful. I read this while watching news accounts of Hurricanes Harvey and Irma. I am now officially on Hurricane overload. But this book is a definite recommend."}, {"userName": "Ashley", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/737133-ashley", "userReview": "It’s hard to rate a book 4 (“I really liked it”) stars when its contents are so disturbing. In this case, 4 stars means excellent research and a narrative that manages to be both totally gripping and devoid of sensationalism. It feels like this book was needed in order to finally do journalistic justice to the hurricane that leveled Galveston in September 1900—because goodness knows Isaac Cline’s own accounts, which increasingly exaggerated his heroism over time, did not. And the reports by his superior, Willis Moore, chief of the U.S. Weather Bureau, are even less encumbered by truth. It’s a heart-wrenching read, thanks to firsthand accounts that take the impersonal statistics and translate them into family members and loved ones lost. Most disturbing of all is the fact that the death toll could have been lower by hundreds, if not thousands. Larson builds a compelling case that it wasn’t the magnitude of the storm, but the hubris of men—in particular, the leaders of the Weather Bureau—that caused this to be the deadliest hurricane in U.S. history. Days after the hurricane, the Houston Post ran a furious editorial: “The practical inutility of the national weather bureau ... was never so conspicuously shown as on Friday and Saturday last when South Texas was left without any warning of the coming storm, or at least its severity. ... With the weather bureau saying that Saturday would be ‘fair; fresh, possibly brisk, northerly winds on the coast’ of East Texas, who would have looked for the most destructive hurricane of modern times on that coast on that date?”Almost no one, apparently."}, {"userName": "ALLEN", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/58158333-allen", "userReview": "Here's a tragedy that could not have been completely avoided, but due to man's folly became much worse than it should have been. The U.S. Weather Service in September of 1900 ignored most reports of a severe hurricane brewing in the Caribbean. Drawing on a great deal of denial and no small amount of racism, the Americans condemned Cuban forecasts (which were also understated, but not nearly so heinously) as \"emotional,\" avoiding almost as a matter of faith \"poetic\" terms like \"eye\" (of the storm) or even \"Hurricane.\" The storm hit Galveston, Texas, dead-on, wiping out a third of the structures of the city and an estimated 8,000 residents. While land-based telegraphy was advanced as to transmission of data, it bears remembering that radio-telegraphy still lay in the near future. As much as possible of the narrative is told through the eyes of Isaac Cline, chief of the Galveston weather bureau.As always, Erik Larson writes beautifully, at times brilliantly, and bases his non-fiction on vast and impeccable sources. This is a wonderful book to read (though Texans who lived through the similar Harvey in 2017 may want to wait a while before picking up ISAAC'S STORM). I do wish that visuals in this book had included more than a very basic map of the Gulf of Mexico and adjoining landmass, and a map of Galveston. I always find it frustrating when Larson describes the looks of people and buildings with such details and eloquence, yet no photos or drawings wind up in the book. Take-with: superior technology means nothing without superior methodology and information-gathering."}, {"userName": "Marialyce", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "After suffering the effects of hurricane Irene, I thought this would be a good book to really find out how devastating a hurricane could be. I so enjoyed reading of the way in which the weather bureau of 1900 and earlier was filled with corruption and a sense that what they thought was the only right thought. I guess not much politically has changed and yet with all out modern advances, we still have such a time getting the weather right.Isaac Cline, the meteorologist for the Galveston area put up with the bureaucracy of the governmental agency. Thinking that weather could be predicted was a new notion at the time but one that the agency thought was humanly possible. However, as often as not, nature can't be predicted and the worst storm ever bringing with it the worst natural disaster ever occurred on September 8, 1900. The storm, stating in Cuba crossed into Florida and then headed straight for Galveston., adding energy as it traveled and a hugh wall of water. The storm slammed into Galveston wiping out most structures and causing the death of at least 10,000 people. This storm is still the worst ever natural disaster experienced in the U.S.This was such an interesting book in which Larson was able to recreate the path of the storm and its aftermath. It was also a story of the loss of life caused by this killer hurricane. One can't trust the powers of nature for they can often turn and produce horrible results for people and their towns and cities."}, {"userName": "Diana Long", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/32989701-diana-long", "userReview": "Reading history can be bland and dry but not so when it's written by Erik Larson who adds that human touch to the story. Still listed as the worst natural disaster in U. S. History, the hurricane of 1900 that decimated Galveston, Texas and is estimated to have taken 6-12,000 lives is the main focus of the work. The author brought the story to life through extensive research and review of documents and first person accounts. Chosen as the protagonist of this event the author selected Isaac Cline the chief meteorologist at the Galveston, Texas office of the U. S. Weather Bureau who was the central figure in the disaster. Cline was confident in his reading of the weather signs and equipment and relied on information he received from the bureau's central office in Washington, D.C. But when it comes to man vs. nature, nature will win every time. The book gives us not only the story of Isaac Cline and this hurricane but also the government offices and the men in charge of distributing vital information. At the end of the book recording is an interview with the author. I found this extremely of interest that he was actually doing research on another story he wanted to write involving this hurricane, undoubtedly this book became the bigger event. The narrator Richard Davidson's performance was excellent. I highly recommend Erik Larson's books they are always thoroughly researched and well written."}, {"userName": "Pamela", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "“Galveston spun through space at nine hundred miles an hour. The trade winds blew. Great masses of air shifted without a sound. Somewhere, a butterfly opened its wings.” If you find meteorology, history, natural-catastrophes, and human interest stories fascinating, “Isaac’s Storm” makes for captivating reading. I found it extremely insightful and captivating. From various weather-phenomena facts to the inception of the Weather Bureau to the 1900 hurricane that nearly wiped Galveston Texas off the map, this book held my attention. “The water got so deep it flooded the firebox of the locomotive. A geyser of steam and smoke hissed into the cab, but the engineer already soaked and ‘windsore,’ pulled down his goggles and kept the train moving . . .”Larson gives an overview of the Weather Bureau’s inception within the Army’s Signal Corps. He tells of the Weather Bureau (precursor to the National Weather Service) having growing pains during the early years. Dishonesty, thievery, and flat out laziness weren’t uncommon among agents. And political grandstanding and debauchery were within the ranks. But a few are like Dr. Cline: reliable, hardworking, tidy, ever-learning, and family oriented. However, Cline has his flaws – that may or may not have contributed to loss of lives. “As the Schooner approached Galveston, the scent of death became overpowering. At one point Sterett looked over the side and saw a dead woman starring back, her face lit by the moon.”After all the pertinent background chapters, the book picks up speed. Exponentially! The focus turns to September 1900, Galveston, Texas - Isaac Cline’s assigned weather reporting station. His actions, and/or lack thereof leave much to debate. Through various eyewitness accounts the horrors of that fateful night are told. “Beams fractured. Glass broke. Lumber ricocheted among the walls of the hallway . . . the front of the house tore loose. The Boeckers stood in their bedroom holding each other close as the wind peeled the house away . . .”Powerful! A highly recommended exceptionally good read. “Time can never be recovered . . . and this should be written in flaming letters everywhere.” - Dr. Isaac Cline"}, {"userName": "Chris Gager", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/5295008-chris-gager", "userReview": "Picked this one from my non-fiction shelves the other day. I believe Mr. Larson is also the author of \"Devil in the White City,\" which I read and enjoyed a couple of years ago. I'm drawn to the subject because I experienced a few nasty hurricanes as a child in Massachusetts. The worst was Carol in 1955. We were on vacation in Menemsha on Martha's Vineyard when she came through behind an incoming tide. THAT was quite a day ... Then, another one came in a few days later. Not as bad, though - Hazel??? No! It was Edna ...Moving on as the storm moves closer to Galveston. I get the feeling at times that the author is doing a bit too much backstory. It seems a bit like padding. Not flagrant, but there(IMHO anyway).Finished last night with this interesting, scary and moving story. After reading this I can see that my experience with Hurricane Carol(Category 3) in 1954 was kind of low-key compared to the doozie that the unfortunate citizens of Galveston suffered through(Category 4). A cautionary tale about the hubris of human-kind as well.- 3.75* rounds up to 4*."}, {"userName": "Book Concierge", "userReviewDate": "Oct 20, 2008", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "5***** and a ❤What an extraordinary read - a page-turner about weather! But then, the hurricane that destroyed Galveston was the most deadly disaster to ever strike the United States (and still is). Larson brings the drama to life while conveying the calm of ignorance and the unbelievable loss afterwards. Very well researched. The personal stories really brought it to life. There is some detailed scientific data here, but the basic plot is gripping. I was lucky to hear Larson speak when he was on the book tour. He talked specifically about the scene when the water surges from ankle-deep to shoulder-deep in a moment, and he(Larson) thought - \"My children are all under 4 feet tall; they would have drowned.\" Larson personalized the story by giving this thought (and others) to Isaac himself. (I couldn't help but think of this book in 2008 with Hurricane Ike bearing down on Galveston, yet again.)"}, {"userName": "Phyllis", "userReviewDate": "Jan 30, 2008", "userURL": "http://www.goodreads.com/user/show/558618-phyllis", "userReview": "Such a great historical account of the Galveston, Tx Hurricane of early 1900s. It was great."}, {"userName": "Celia", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/30261451-celia", "userReview": "The book Isaac's Storm describes in gory detail The Great Galveston Hurricane of Sept 8, 1900. The death count from the storm is unknown but estimated to be between 6 and 12 thousand. The storm originated near West Africa on Sept 4, caused unsettled weather in the Caribbean and emerged in the Florida Straits on Sept 5. Owing to contradictory forecasts, the people of Galveston felt no alarm until the official hurricane warning of September 7. Storm surges of over 15 feet removed over 3600 homes from their moorings. Many people were swept away by the turbulent waters.Isaac is Isaac M Cline, who worked for the National Weather Service in Galveston. At the beginning of the 20th Century, the Weather Service had little to help it in determining storms. The barometer and telegrams from affected areas was about it. If the different weather services were not co-operating, disaster could and did ensue.The book describes Isaac's life and experiences from 1883 to his death in 1955. Based on the book, I don't know what to think of Isaac. He had an excellent work ethic. But his recollection of what he did to warn people of the storm is sketchy at best. He is described as a man with touches of pride/hubris. It is unclear to me if he could have done more to save lives.I listened to the book on Audio CD, an abridged version narrated by Edward Herrmann. I am happy that it was abridged, as the description of the storm, its effects and its aftermath was pretty upsetting.Learned a lot, though. Erik Larson has written about other historical events as well, most of which are on Audio CD. I recommend any book he has written.4 stars"}, {"userName": "Ms.pegasus", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/5015851-ms-pegasus", "userReview": "1900 was a time when passenger pigeons still darkened the sky, and bathing suits were made of mohair. The Spanish-American War had been waged the previous year. Galveston was a booming seaport riding high on a surge of (to the modern eye) precarious optimism. With these, and many more details, Larson immerses the reader in a zeitgeist ripe for natural catastrophe. There was a burgeoning faith in technology. The U.S. Weather Service, then part of the War Department, was like an adolescent, its expansive confidence masking both inexperience and insecurities. Larson draws on elements of history, science, and human interest to tell the story of the devastating hurricane that destroyed Galveston, Texas on September 8, 1900 and killed between 6000 and 8000 people. His story is riveting.He builds suspense through journal like entries marking the storm's progress from it's birth in the Atlantic Ocean to its first sighting as a typical tropical squall on August 27 to warnings of an unusual incipient cyclone from the Belen Observatory in Cuba on September 1. Although tropical storm and hurricane warnings were of vital importance to Cuba, and, since 1870, a detailed communication network had been set up on the island, the head of the U.S. Weather service, Willis Moore and his representative in Cuba, William Stockman, were both dismissive of the Cubans. Part of this was prejudice; their correspondence depicted the Cubans as panic-prone natives. Part of their attitude was due to insecurity. Moore was obsessed with centralized control. He did not want the Cubans issuing independent weather bulletins. He had a paranoid fear that the Cubans would steal U.S. Weather Service data and claim independent expertise. The U.S. Government owned all telegraph lines in Cuba. Moore was able to get the War Department to ban all cables about the weather from Cuba except for those issued by the U.S. Weather Service. As a result, the Belen Observatory's concerns went unheeded. And, of course, ego was a prominent factor.Forecasting relied largely on the discernment of patterns, not scientific hypothesis and testing. One misleading pattern was that tropical storms usually veered north northeast into the Atlantic. Exceptions were conveniently termed accidents of nature. Three days before the hurricane struck, the weather service was predicting that the storm would proceed up the Atlantic coast the next day. The Cubans at Belen had already anticipated that the path would instead lead to the Texas coast.A second misleading conception was that the long low coastal shelf of Galveston Island would mute the effects of tidal flooding. In 1876 Henry Blanford had studied the lethal storm surges in the Bay of Bengal and concluded that such a geographical configuration promoted the volume and height that defined these devastating tidal waves. Unfortunately, that theme was not reiterated until a month after the hurricane in the weather bureau's monthly publication. Bureaucracy was another contributing factor in the failure to anticipate the hurricane. Data was submitted to the central office in Washington D.C. Assessments were made centrally and bulletins issued each morning. Because of the top down communication flow, a Galveston weather service employee was advising as late as the morning of September 8 that the storm conditions were an “offspur” of the Florida storm reported earlier in the week.Larson's saga turns into a horror story as he focuses on individual families. Houses crumple, slate shingles fly through the air, families are divided and drowned. The horror continues into the aftermath as the first outsiders venture into the area to investigate the mysterious silencing of all communications coming out of Galveston. His documentation for these events are drawn from an extensive trove of archival material: Letters, diaries, memoirs, interviews, cables, and newspaper accounts. Larson is at his most lyrical when he delves into the elemental nature of the weather.  “It began, as all things must, with an awakening of molecules. The sun rose over the African highlands east of Cameroon and warmed grasslands, forests, lakes, and rivers, and the men and creatures that moved and breathed among them; it warmed their exhalations and caused these to rise upward as a great plume of carbon, oxygen, nitrogen, and hydrogen, the earth's soul....Winds converged. A big, hot easterly raced around a heat-induced low in the Sahara, where temperatures averaged 113 degrees Fahrenheit, heat scalded the air, and winds filled the sky with dust. This easterly blew toward the moist and far cooler bulge of West Africa. High over the lush lands north of the Gulf of Guinea, over Ouagadougou, Zungeru, and Yamoussoukro, this thermal stream encountered moist monsoon air blowing in from the sea from the southwest. The monsoon crossed the point where zero latitude and zero longitude meet, and entered the continent over Nigeria Where these winds collided, they produced a zone of instability. The air began to undulate.” (p.19-20) The dance of moisture and wind is mesmerizing. You will never think about the weather in the same way again!It is a sobering thought that even today, with all of our measurements and satellite tracking, there is much to be learned about hurricanes. Larson even invokes chaos theory as a reminder that prediction may not even be an attainable goal."}, {"userName": "Lena", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/35645863-lena", "userReview": "Larson's strength is amassing facts on interesting topics and turning them into story time. I am always entertained, I am always frustrated. The man cannot paint with words. I'm always having to reread, then google, to find out what the hell he's talking about. Two examples would be:- the bathhouses suspended above the sea. I've never seen a bathhouse except in movies of ancient times in Rome or 1800s England; all in stone. I would have liked to know what these places in Galveston looked like, how they operated, and their general place in society. - The train that gets on the boat to get to the other side of the tracks. What!? How big was this boat?!? How small was this train? Did the boat have tracks? Is this all the boat did?Maybe I'm quibbling but I prefer it when books take me places, like little holodecks.This book is about the history of the National Weather Service, Galveston, a devastating hurricane, and Isaac Cline. On all these points Larson succeeds in creating a page turning tale of hubris vs nature. I can tell you from a lifetime of living in Texas that the weather here is nuts and that forecasts are taken as seriously as tarot readings. As a personal example, all week they were screaming that Saturday was going to be epically cold; freezing freezing cold. Since that was the day of my half marathon I went out and bought specialty cold weather running gear - pricy gear.  You know what the temperature was at the start line? 76 degrees Fahrenheit. This book should have been a hundred pages longer. I wanted more but I enjoyed what I got. I'll give this three and half stars and round up to four because I know I'll be reading more Larson.Special thanks to my Squire Santa from Horror Aficionados, I could not wait until Christmas to unwrap this!"}], "description": "At the dawn of the twentieth century, a great confidence suffused America. Isaac Cline was one of the era's new men, a scientist who believed he knew all there was to know about the motion of clouds and the behavior of storms. The idea that a hurricane could damage the city of Galveston, Texas, where he was based, was to him preposterous, \"an absurd delusion.\" It was 1900, a year when America felt bigger and stronger than ever before. Nothing in nature could hobble the gleaming city of Galveston, then a magical place that seemed destined to become the New York of the Gulf.That August, a strange, prolonged heat wave gripped the nation and killed scores of people in New York and Chicago. Odd things seemed to happen everywhere: A plague of crickets engulfed Waco. The Bering Glacier began to shrink. Rain fell on Galveston with greater intensity than anyone could remember. Far away, in Africa, immense thunderstorms blossomed over the city of Dakar, and great currents of wind converged. A wave of atmospheric turbulence slipped from the coast of western Africa. Most such waves faded quickly. This one did not.In Cuba, America's overconfidence was made all too obvious by the Weather Bureau's obsession with controlling hurricane forecasts, even though Cuba's indigenous weathermen had pioneered hurricane science. As the bureau's forecasters assured the nation that all was calm in the Caribbean, Cuba's own weathermen fretted about ominous signs in the sky. A curious stillness gripped Antigua. Only a few unlucky sea captains discovered that the storm had achieved an intensity no man alive had ever experienced.In Galveston, reassured by Cline's belief that no hurricane could seriously damage the city, there was celebration. Children played in the rising water. Hundreds of people gathered at the beach to marvel at the fantastically tall waves and gorgeous pink sky, until the surf began ripping the city's beloved beachfront apart. Within the next few hours Galveston would endure a hurricane that to this day remains the nation's deadliest natural disaster. In Galveston alone at least 6,000 people, possibly as many as 10,000, would lose their lives, a number far greater than the combined death toll of the Johnstown Flood and 1906 San Francisco Earthquake.And Isaac Cline would experience his own unbearable loss.Meticulously researched and vividly written, Isaac's Storm is based on Cline's own letters, telegrams, and reports, the testimony of scores of survivors, and our latest understanding of the hows and whys of great storms. Ultimately, however, it is the story of what can happen when human arrogance meets nature's last great uncontrollable force. As such, Isaac's Storm carries a warning for our time.", "title": "Isaac's Storm: A Man, a Time, and the Deadliest Hurricane in History", "url": "http://www.goodreads.com/book/show/1468107.Isaac_s_Storm", "average": 4.05, "cover": "https://images.gr-assets.com/books/1320533075l/1468107.jpg", "reviews": 2979, "authors": [{"url": "https://www.goodreads.com/author/show/5869.Erik_Larson", "name": "Erik Larson"}], "type": ["History", "Nonfiction", "Science", "Biography", "North American Hi..."], "outlinks": ["http://www.goodreads.com/book/show/1468107.Isaac_s_Storm", "http://www.goodreads.com/book/show/239186.Isaac_s_Storm", "http://www.goodreads.com/book/show/12914504-isaac-s-storm", "http://www.goodreads.com/book/show/1468108.Isaac_s_Storm", "http://www.goodreads.com/book/show/27189633-isaac-s-storm", "http://www.goodreads.com/book/show/2169230.Isaac_s_Storm", "http://www.goodreads.com/book/show/21996.The_Devil_in_the_White_City", "http://www.goodreads.com/book/show/9938498-in-the-garden-of-beasts", "http://www.goodreads.com/book/show/22551730-dead-wake", "http://www.goodreads.com/book/show/40067.Thunderstruck", "http://www.goodreads.com/book/show/40069.Lethal_Passage"]}