{"ratings": 313, "userreviews": [{"userName": "may ➹ (semi hiatus)", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/68157476-may-semi-hiatus", "userReview": "3.5 starsAfter reading the first few chapters of this, I was really sure that it would end up to be your “average”, meh fantasy, with nothing horrible but nothing outstanding either. But I was surprised to find that it was actually even better than I thought!Let me be real here: This has a lot of flaws. It is definitely not a perfect book. But the thing is:IT WAS SO ENTERTAINING.At first it was slow and kind of boring, and I couldn’t really connect to the characters. But then something changed and I was so much more invested—for at least half of the book, I could feel my adrenaline pumping and I was ALWAYS on edge.Isle of Blood and Stone follows the story of a young man named Elias, whose friends discover maps that could have possible clues as to how two princes and his father disappeared from the kingdom of del Mar eighteen years ago.Elias is an interesting character. To be quite honest, he was kind of bland?? And forgettable??? I’d say that the side characters have more depth and personality to them, and HE’S the main character. Regardless, I still enjoyed reading from his perspective and seeing where the story would go. Speaking of the side characters: I LOVE THEM. Mercedes (Elias’s love interest) is portrayed as a strong character, and she’s really independent in a way that doesn’t rub on me wrong, like it often does with other “strong” YA heroines. Reyna, a young nine-year-old girl who is involved a lot in their story, is my favorite character out of the book; she’s so sweet and curious and stands strong in her beliefs!\nI also am VERY suspicious about the fact that this book… doesn’t seem diverse?? I don’t remember any sort of description that would’ve shown that there were people of color in the main cast—or in anyone they met at all tbh—and definitely not anything that pointed to people being queer, neurodivergent, disabled, or from any other minority group. Of course, it may be changed in the final publication / I may have missed something, but… that was suspicious.\nMy other biggest problem was that the story started out really slow and almost boring in the first 100 pages. And those were not fun 100 pages. But then suddenly, the stakes were raised and there was a whole new atmosphere?? I was genuinely excited and nervous to see where it would all go. Literally for the whole last half of the book, I was always on edge and could feel my heart pounding, just so ANXIOUS about what would happen next. (I mean it was also 2 in the morning and I was paranoid.) But it was just so engaging after those first 100 pages. And besides one that I guessed, there were so many reveals of different kinds that made it so much more mysterious and shocking.This book also involves a LOT of maps. Unfortunately for me, my ARC didn’t have a map so I was a little confused with all the place names at first, but I got the hang of it. I think that the worldbuliding was pretty well done! My biggest issue with fantasy novels is that there is just SO. MUCH. INFO DUMPING. about the world, and this book had just the right balance between too much info and too little.This story is, honestly? a “whodunit” kind of murder mystery, but mixed with fantasy elements and also BIG EMPHASIS on family and found family. And I thought that whole mix made for a really and really entertaining book, despite it falling a little short in character development and pacing!\nThank you to Houghton Mifflin Harcourt for the review copy in exchange for an honest review! This did not affect my opinions in any way."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "There were a lot of elements in this story I enjoyed and I'm interested enough to check out the next book! The setting was strong, I loved the maps, and the characters were all great. I'm not super enthusiastic about anything BUT I still liked it.I think this one will appeal to readers who get into stories that are more peaceful... it felt like a cup of tea that was going to take its time to steep. There wasn't a ton of adventure and nothing was particularly gripping, but that doesn't mean it was boring or slow! There was a sense of mystery and some decent character development. I do wish I would've connected more with the writing style, though. It felt like it was sort of holding me at a distance and I wanted to get into everything more. Thank you to the publisher for sending me an ARC."}, {"userName": "Katerina Kondrenko", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/36306002-katerina-kondrenko", "userReview": "8 out of 10 Finally! Finally a good YA fantasy with a hint of a romance, a lot of adventures, mysteries and a nice pacing. People, just wait. I think you would love it too."}, {"userName": "Carrie", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Isle of Blood and Stone by Makiia Lucier is the first book in the Isle of Blood and Stone duology. This series is a young adult historical fantasy with a touch of romance involved.The story starts with the royal navigator Lord Antoni out on and excursion with a group including two of the young princes. As everyone in the group is setting down to eat and rest Antoni is gathering supplies to show the boys how to make a compass. After the wine is passed around however everyone in the group begins getting sick and the sounds of someone approaching can be heard.Fast forward the story eighteen years where a young girl, Reyna, who is studying to be a map maker herself has come across maps that look like the work of Lord Antoni. The problem with this discovery is that it looks as if the maps were made after the horrific massacre eighteen years ago.Little Reyna takes her discovery to King Ulises who approaches his friend Elias who has just become a master mapmaker himself with the discovery. When a hidden clue is found Elias and Ulises’s cousin, Mercedes take on the quest to uncover the mystery of just what happened that day eighteen years before.Isle of Blood and Stone is a slow building story that felt very heavy on the historical and lighter on the fantasy side. It takes a reader back to the time of Kings, courts, politics, spies and intrigue. It becomes known that after the poisoning where everyone out that day was thought to have died that someone confessed to the crime which started a war with a neighboring kingdom but now the question comes up as to whether or not they were even involved.As it jumped the eighteen years it was a tad confusing to join in on new characters as it slowly established who everyone was and slowly came back to what had happened at the beginning of the story. It was a tad slow for my own taste as I’m always looking for more action but despite that I still enjoyed what the author created and will certainly be curious as to how it all turns out in the next book.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"userName": "Bitchin' Reads", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/7695806-bitchin-reads", "userReview": "[For the young woman he loves, Elias works to align his career with her ambitions so that neight he nor she is held back. Now THAT is the kind of balancing my boyfriend and I do in out lives, and I love seeing that same healthy and realistic expectation in my entertainment. They days of expecting one partner to give in totally to the needs or wants of the other are over--I am pro going Dutch in more aspects than just when out for a meal. (hide spoiler)]"}, {"userName": "Beatrice (beatriceinbookland)", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/41218661-beatrice-beatriceinbookland", "userReview": "*I received a copy from NetGalley in exchange for an honest review*\"How can I look at these maps, see this riddle, and do nothing? They are my brothers.\"DNF @32% The beginning was promising, it was intriguing and it made me want to keep reading to find out what happened to the brothers. But, as soon as I got to the now part, I was so confused that I found myself reading the same sentence more than once or twice.Why did I get so confused? Well, the author was trying to add some world building by just telling and not showing and the more I kept reading the more I was like where the hell are the protagonists right now?? There were just too many names and characters that the protagonists already know and that we're introduced to without a single explanation.At least the protagonist - Elias - isn't bad. He's a traveler and his scenes with his family were adorable, I loved his relationship with his stepfather and stepbrothers. Actually, I think that the scenes where he was interacting with his family were the only ones I enjoyed.So all in all, Isle of blood and stone isn't a bad book, it's just a bit boring and incredibly confusing and I don't want to waste time to read something I'm not enjoying."}, {"userName": "anna (readingpeaches)", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/8645302-anna-readingpeaches", "userReview": "book: how can i do nothing? they are my brothersme: SOLD™"}, {"userName": "Alaina Meserole", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "I absolutely loved this book! I am also really happy that buddy wasn't mad at me for being so slow for starting this book with her. Thank you so much Andrea for making me buddy read books with you! I love your little updates and how you make me laugh.. even if the book we are reading is terrible and making you mad. Luckily for us, this book was really good! I feel like we zoomed right through it.Isle of Blood and Stone was so freaking good! I loved it! Even though the pacing in the prologue kind of made me sleepy.. I feel like the rest of the book was a blur because I breezed right through it. Mercedes and Elias were adorable together. The entire time I was shipping them and I feel like I'm still missing something about their \"relationship\" even after finishing the book. I can't wait for the next one to come out next year because I desperately need these two to be a couple!Elias was completely likable. I honestly fell in love with him at the very beginning of the book. His friendship with Mercedes was everything to me. Even when there were hints that there was something more for them. Again, I need my ship to sail people!Elias and Mercedes would do anything for each other. Heck, Mercedes is such a bad ass character who is wicked with a bow and arrow. She saves his life plenty of times.. and I LOVED IT. Every single second these two were together, Sigh!Swoon worthy moments.Besides me shipping the heck out of these two, this book delivers a really good and interesting mystery. Who planned all of these \"deaths\" that happened years ago? Of course all of the suspects are people who are in higher positions of power since every had untimely deaths. Elias and Mercedes were practically babies when this all happened so they were completely innocent. For the mystery though, I had no idea who actually committed the crime. I was highly intrigued though and couldn't put the book down until everything was solved. There were a bunch of twists and turns that had my sitting on the edge of my seat, tapping my toes, waiting to figure out who it was.Overall, I definitely loved this book. I feel like I've mentioned that a lot in this review but oh well! I seriously recommend this to anyone who loves fantasy and mystery books."}, {"userName": "mith", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/7621359-mith", "userReview": "4.5!! To rate up or down? I don't know!But still—WHAT AN AMAZING BOOK. Gosh I love it. Review to come!!!"}, {"userName": "Shannon (It Starts At Midnight)", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/8652150-shannon-it-starts-at-midnight", "userReview": "You can find the full review and all the fancy and/or randomness that accompanies it at It Starts at Midnight I know I usually start with the positives of a book, but today, I am starting with the negative. The reason is, there really only was one negative: I really just didn't feel a ton about this book either way. Objectively, it was good and the plot was pretty interesting. But it didn't leave any kind of huge impression on me, and I feel like that's probably an important thing.But I did like some stuff! I enjoyed the characters, and thought that they were well-written. I loved the romance aspect of the story, too. The plot is a bit of a slower paced one, and isn't full of action, but is more the characters trying to figure out certain things about their world and their loved ones. I don't dislike that sort of plot, so it was fine with me, but something to be aware of. Bottom Line: I feel like I should have more to say, but I simply don't. It's one of \"those\" reviews, sorry to say. While nothing really stuck out as negative, neither did I have overwhelmingly positive feelings. It was a fine book, but not particularly memorable for me."}, {"userName": "Austine (NovelKnight)", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/37252203-austine-novelknight", "userReview": "This book was provided by the publisher. This does not affect my opinion of the book or the content of my review.I'm so disappointed with myself because despite Isle of Blood and Stone being a well-written, interesting YA fantasy. . . I don't feel anything for it. Did it excite me? Eh, not really. Did I hate it? No, it was a good book.This fantasy isn't a super action-packed adventure, taking a slower pace as the characters attempt to uncover a mystery that was left in the unknown for almost two decades. From a writing standpoint, I couldn't put my finger on it but it almost felt like a middle grade novel. Yet the main character, Elias, is 19, so the upper end of YA. The combination was interesting and I quite liked it, giving this book a different edge.The mystery takes over the bulk of the plot and becomes a bit of a Clue game with who committed the crime with the poison in the meadow. But I liked that the story didn't focus solely on the mystery. There's a lot about family, a theme strongly supported by Elias's own family, the kinship between the navigators, the strong bonds between him and his friends, and so on. I think this sends a great message and gave the story the added depth it needed since it did move at a slower pace.But Elias? He wasn't exactly memorable. He became less of a multi-faceted character and more of a name on the page. I found I gravitated toward the side characters such as Mercedes, Reyna, and even Commander Aimon. Mercedes is a highly independent young woman who works as a diplomat for her nation and I loved that she not only had a role of power but wasn't overly \"strong\" (where the author makes a point to remind you over and over that she's independent). Reyna is a nine-year-old wannabe navigator and all I could think was that I wanted to know her story because she's forced to overcome so much because she's a girl. Even at 9, she had something at stake. And Commander Aimon was a bit aloof but I could see something beyond that, and I wondered who he was before the time of the story.That said, I did like that the romance subplot was already partially established. Mercedes and Elias grew up together, they have history and early on you can tell there is love there of some kind. But coming in where the story did with their relationship also meant that I didn't have much time to really develop an interest in the two of them getting together (which affected some of the tenser moments in the book).But I'm getting nit-picky. Isle of Blood and Stone was a unique read I would recommend to YA readers of all ages. There's a bit of action, plenty of mystery, strong family vibes, and a well-written cast to fall in love with. The story, though I realize it's a part of a series, reads well as a standalone with a satisfying ending. Overall, I liked it. I don't feel strongly one way or the other about this book, but I'd recommend it!Find Me on: My Blog || Twitter || Instagram || Bloglovin'"}, {"userName": "Cindy ✩☽ Savage Queen ♔", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/3222333-cindy-savage-queen", "userReview": "The cover is a huge bore, but the synopsis sounds fantastic and I love me a good mystery adventure so let's hope this is a good one!"}, {"userName": "Sara (sarabara081)", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/5391613-sara-sarabara081", "userReview": "You can find more of my reviews at Forever 17 Books.I love anything with maps, exploring and adventure! It really brings me back to my childhood and everything I loved as a kid. The promise of those such things in the blurb for Isle of Blood and Stone grabbed my attention and I can honestly say I had a lot of fun reading this one!The story revolves around the events that happened 18 years ago when there was an attack on a party of people that included two young princes, the Royal Navigator Antoni, and so many others. Most everyone that day was poisoned and those who weren’t disappeared and were believed dead, murdered by another kingdom and then subsequently started a war. That is until maps are found made with a skill and likeness of a certain presumed dead navigator that could only have been made more recently than the previous tragic event. Determined to find answers, King Ulises, Elias, and Mercedes embark on a secret mission to find out what happened to the family they lost that day.As these three discovered clues hidden in the map, they find themselves on a adventure through spooky woods haunted with spirits, dangerous waters infested with sea serpents, and more! The more answers they uncovered the more they realized the real dangers lurked much closer than they could have expected. I loved uncovering all the little secrets and clues along the way and even though I tried to piece together everything myself, there was quite a bit that surprised me!I really enjoyed the characters and the relationships they had with each other. They were all so selfless and compassionate. I especially enjoyed Mercedes as a strong and smart heroine. There is a touch of romance that brews between her and Elias in that perfect slow burn I love. There is also the spunky Reyna, a 9 year old future mapmaker and explorer who doesn’t let being a girl stop her from her dreams, despite what others may say. She was my very own hidden gem of the story and probably my favorite of them all.All in all, I found myself completely swept away by this story! It’s not particularly fast paced or filled with action like I thought it might be but I found myself completely okay with that. It kept my attention with all of its mysteries to unravel and was never boring. I had a lot of fun reading this book and I think many others will also find a great adventure to partake in!"}, {"userName": "Fadwa (Word Wonders)", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/42662881-fadwa-word-wonders", "userReview": "Actual rating: 3.5 stars*I was sent a copy of this book by the publisher in exchange of an honest review*This book is so so enjoyable! The characters are lovable, the intrigue keeps you reading and the world and history are easy to grasp.My favourite characters were both Mercedes, one of the main characters, and Reyna, the little girl that's like an adoptive sister to all of them. Both fierce, brave ladies that are so easy to get attached to, they stand up for themselves, for their people and for what's right. The book starts off slow for almost the first 100ish pages, which I didn't mind much as I really enjoyed getting to know the characters, the relationship dynamics and the backstory for the main conflicts. I lived for the main trio's friendship and even the budding romance and i loved that i didn't overshadow any other part of the story, especially not the friendship. What I had an issue with is that the whole firdt two thirds of the book are building up to this climax and when we reached it, well, it was...anticlimactic, i didn't expect it to turn out that way but the pacing of it all was weird in a way where it didn't manage to surprise me as much as I would've liked.Full review to come soon!!"}, {"userName": "Danielle (Life of a Literary Nerd)", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/32803116-danielle-life-of-a-literary-nerd", "userReview": "“Adventurer, two princes lost but not gone. Follow the path of the ancient mariners, Tramontana to Ostro. Look not to what is there, but to what is not.” \n\nYeah, I didn’t love this as much as I wanted which really seems to be the story of my life lately. I just know this is going to be a completely forgettable read for me. For so much of this story I just didn’t care, and I feel like a lot of it was because I wasn’t invested in the world. I feel like I didn’t know enough about the setting or the characters. While I did enjoy the family and friendship moments with Elias, Mercedes, Ulises and some of the others, they weren’t enough to pull me in. It felt like someone was telling me a story without giving me all the background. I just didn’t get the motivations for the villain, or know enough about the worldbuilding or politics. I just didn’t care and was underwhelmed. I received a copy of the book from HMH via netgalley in exchange for an honest review."}, {"userName": "The Nerd Daily", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/68678485-the-nerd-daily", "userReview": "Originally posted on The Nerd Daily | Review by Holly AngusA story filled with betrayal, suspense and lies, Isle of Blood and Stone is a new release you cannot pass up. This new young adult fantasy novel is set on the island of del Mar, where 18 years ago two young princes destined for the throne and many royal servants were killed in the forest of Javelin. A neighbouring island, Mondrago, was blamed for the murders, their king killed and their homes turned to dust all for revenge. Even 18 years after, the divide between Mondragans and del Marian’s is still at an all-time high, revealing prejudice throughout the novel.Isle of Blood and Stone Makiia LucierIn present day, Ulises is the newly crowned king and has the entire kingdom on his shoulders. Ulises knows he is a ruler of chance, that this opportunity would not be his if his family did not die 18 years ago. Not only is he a young king trying to figure out how to rule a kingdom, he has to juggle the still feuding rivalry between Mondrago and del Mar.Then there’s Elias, a 19-year-old map maker, just returned from an adventure abroad. Elias’s father was one of the royal staff to be killed with Ulises’s brothers all those years ago.Ulises and his best friend Elias, find two mysterious maps that could possibly prove that what happened in Javelin could all be a lie. But if it’s a lie, what actually happened? Why isn’t anyone talking about it? And who wanted to cover up the murders in the first place? Ulises, Elias and their friend Mercedes set off on an adventure to find out the truth about their families’ demise.The setting gives off old Greek island vibes, making every reader wish they were alongside the characters exploring the isles and solving mysteries. However, it is not as fun as it seems with bandits, robbers and dangerous animals found within the borders, waiting for any opportunity to strike. Del Mar is an isle surrounded by other rivalry states and killer sea serpents, making the adventures of the main characters difficult to achieve without an abundance of danger surrounding them with every step.Each character has been raised on del Mar, knowing the violent history and every royal subject that roam the halls. However, given the two maps and the lies they have been told, no one in the castle can be trusted.The characters are courageous and don’t make any stupid decisions that land them in inevitable situations unlike the stereotypical YA tropes. Ulises is a mature character who loves his friends as if they are family, and depend on them because he has no one left, which makes him a selfless ruler who will stop at nothing to keep Elias and Mercedes safe. Elias is a map maker who explores the islands for a living, following in his late father’s footsteps. He is the Captain Jack Sparrow of YA, only dreamier and not as stupid! Mercedes never plays the damsel in distress role, she is a kick ass royal and doesn’t let either of the boys try to protect her, she can hold her own ground and does it gracefully and admirably. All three of these characters make this story incredibly enjoyable! The reader never knows who to trust and eventually starts questioning all the main characters’ intentions as well.I could not find one thing wrong with this book. It has fast paced writing that keeps the reader engaged at every turn, plot twists that the reader won’t see coming, and adventure that brings out your inner explorer. Makiia Lucier can do no wrong, this is one series to be on the lookout for.At the time of this article, there will be at least one more novel due to be released in 2019!"}, {"userName": "Andrea", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/5841469-andrea", "userReview": "I had my problems with this book, but I also really enjoyed it. I liked the characters and the plot/mystery pulled me in. AND THE MAPS!! I love maps!!!Elias was a pretty easy character to like, yeah he has a temper, but it wasn't horrible. I think the main thing that annoyed me about him was his need to \"protect\" Mercedes and Reyna. Especially Mercedes, who is basically a spy master! SHE DOESN'T NEED TO BE CODDLED ARGH. I love fantasy books so much, but it really frustrates me that a lot of them are so sexist and misogynistic! This book centered on a riddle left on a map, which was so cool. Also, Elias is a geographer so exploring and map making are like his thing. I liked that there was a lot of details about the Navigation school and map making itself. I could clearly imagine it and I loved every second where anyone talked about maps. Also, there are sea serpents!! Like so many different kinds, I need another book to tell me about all of the sea serpents by this island. I did guess some of the plot, but I was okay with that since it was still intriguing. I'm really looking forward to what will happen in book 2 since the mystery from book 1 was wrapped up."}, {"userName": "Chantal", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/42383176-chantal", "userReview": "*I received a copy from NetGalley in exchange for an honest review*I arrived at 22% but I could not finish it!As far as I arrived, the book was boring and practically nothing happened, what a pity."}, {"userName": "Aila", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/25674512-aila", "userReview": "3.5 starsIsle of Blood and Stone comes off to me as one of those quieter YA fantasies that are hidden gems. It’s not fast-paced, nor does it have tons of thrilling action. But the characterizations fuel the story as we follow on an 18-year old mystery that needs to be solved. Despite the sedate pace, I enjoyed the emphasis in the story on maps and following the political intrigue within St. John del Mar. There’s a marked focus on character relationships and heading into danger, as well as fantastical elements that add flavor to the story. I’d recommend Isle of Blood and Stone to fantasy readers who don’t mind less action in favor of characterization and solving mysteries. It’s for sure a deviation from the princes and princesses route that YA fantasies like to take.Review to come!"}, {"userName": "Jessica", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/3345952-jessica", "userReview": "Isle of Blood and Stone is the first book in a new duology by Makiia Lucifer, and the first Historical Fiction book that I've read this year. As a genre that I don't normally dip into, it should be noted that I'm still getting my bearings in books like this. It makes my reading of them take a little more effort than most other things, but I'm enjoying the ride. Which is why the fact that Isle of Blood and Stone is heavier on the history than on the fiction/fantasy side of things made this a bit of a rough read for me. I'm on the fence on this one, and I'll explain why below.The story drops the reader directly into a day in the life of one Lord Antoni, with little to no explanation of why. It took me a minute to figure out that he was an important mapmaker, and that he was somehow linked to the royal family. Once I'd finally settled in a bit, and the big reveal of the chapter happened, the book suddenly fast forwarded eighteen years. So, to say that I started this book with no footing is pretty accurate. It took me another four or five chapters after that to really settle in, and feel like I had my bearings enough to enjoy the story.What's great about this book though is that the characters are actually really intriguing, once you get to know them. Reyna, who was studying to be a mapmaker herself and unknowingly sets things in motion, made me pay attention. Once the discovery of the maps that may have been made by Lord Antoni, after his supposed death, came to light I was fully on board. By the time that Elias came fully into the picture, and the quest began in earnest, I was more than ready to follow along to the end.Unfortunately, this is a really slow building story. I mentioned above that it's heavy on the historical portion of things, and that's definitely an accurate assessment. Action is scarce, and descriptions abound. The reader is taken back to the times of court politics and intrigue, but not in the way that I'm used to in the fantasy books I generally read. It's very heavily described, rather than shown. While the mystery aspect of this was good, it took so long for things to establish, and then longer still for things to pick up, that I found myself wanting to skim forward. I was invested enough to want to know how things turned out though, so that's a good sign.Did I mention that I was on the fence? On the one hand, the ending ties back into the beginning and brings the characters and the plot full circle. All of my questions were finally answered, and I felt pretty satisfied. On the other hand, it took so long for me to actually settle myself into my surroundings at the beginning that it made things feel really slow. I see the potential here, and I liked the book enough to want to see what happens next. I only hope that the next portion of this story has a bit more action."}, {"userName": "The Blonde Bookworm", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/30381260-the-blonde-bookworm", "userReview": "What a fun read! I really enjoyed the setting and the characters in this novel. All of the maps were also a lot of fun and added an interesting mystery component. I really enjoyed the twists and turns that the characters faced, and I thought the setting for the novel was beautiful. I could perfectly picture the blue ocean and the jutting cliffs of the town! Isle of Blood and Stone was a fast paced read, but I kept feeling like every time I got sucked into the story, a little of the fire would burn out. It was like the author was holding the reader back a little bit. There would be a suspense build up and then a quick change to a slower pace. I feel like this description is a bit misleading because not once did I think the story was boring. It was definitely enjoyable, just more of a slow burn entertainment... if that makes sense! All in all, Isle of Blood and Stone was a great read and it was entertaining from start to finish. It was very different from most books I've read this year and I really liked its unique qualities. I would definitely recommend this novel to readers who enjoy YA fiction and I look forward to more novels from Lucier in the future. Thank you NetGalley and HMH books for sharing this novel in exchange for an honest review."}, {"userName": "Camillea", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/58613419-camillea", "userReview": "Makiia Lucier’s intoxicating prose drew me deep into the book, Isle of Blood and Stone. From its first pages Lucier was generous in detailing the world, from its architecture to the cuisine to various traditions making it feel as though I was walking through the streets of del Mar. I had collecting the snippets of details that made up the various islands.The author’s ability to pay attention to both her main characters and secondary characters was something I noticed immediately. I never felt like any of her secondary characters where strangers, albeit this was from the main characters’ perspective. None of the interactions were glossed over revealing as much about the plot as of the person.She stood among dust and abandoned feather, and watched him. Dark hair coiled over her ears like ram horns. A belt made of pearls looped around a slender waist. A silver circlet above her brow. Her eyes, the green of the sea before a storm.Isle of Blood and Stone has a vibe of a classic “whodunit” murder mystery with the atmosphere of a Grecian society. This, to me, was a unique format for a YA fantasy novel. Speaking of which, although marketed under the young adult genre, Isle of Blood and Stone conveys a maturity in the way its characters speak and their actions.In addition to that, I loved being introduced to the profession of mapmakers, geographers, and navigators. It was quite a swing from the usual YA make up of assassins, soldiers, royalty, and so on. I was pleasantly surprised by the amount of information the author provided – the little tidbits of information that showcased the importance of world of geography to a kingdom’s safety.“I’ve heard many confessions,” she said. “Enough to know that they are not all created equal.”The story is adventurous in a quiet sort of way – balancing both character development and its plot driven narrative. So, this is one aspect readers should consider before picking up this book. The first book ends on a satisfying note but with enough to hint at upcoming adventures.I received an ARC at no cost in exchange for an honest review. Follow me at Camillea Reads and on IG: @camilleareads for more bookish adventures."}, {"userName": "Katie (Melting Pages)", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/67324436-katie-melting-pages", "userReview": "This may have become one of my favorite reads of 2018! I loved the characters, although Elias was probably my least favorite and I can't really put my finger on why. I wasn't expecting this to have such a big mystery, but it was the perfect blend of a fantasy setting with a major mystery that needed to be solved. I absolutely could NOT put this book down and I had to know who it was that kidnapped the two young princes. I had my suspicions, but I didn't really know who it was until the big reveal! The only thing that I wish had been added was a more detailed version of the map that matched the one described in the book, since maps and mapmaking is such a huge part of this book."}, {"userName": "Lauren", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/1714237-lauren", "userReview": "[ and maybe a bit of a romance for him too! (hide spoiler)]"}, {"userName": "Megan", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/7611079-megan", "userReview": "I was sent this ARC from NetGalley and the publisher in exchange for an honest review.How can I look at these maps, see this riddle, and do nothing? They are my brothers. This book is WOW amazing. It looks like a fantasy, but it's actually a mystery/romance/court intrigue novel in disguise. If that doesn't grab your attention, think An Ember in the Ashes crossed with Eragon. I started reading this, unsure what to expect, and I was hooked. From beginning to end, you'll be guessing - what happened to the missing princes? Who drew the maps? Who was behind the tragedy that caused one kingdom to destroy another in retaliation? The story unfolds in agonizing suspense. My only complaint is that at times, the main character can be a little scatter-brained and careless...but. He is nineteen. Teenage brain is a thing."}, {"userName": "Ines", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/52962960-ines", "userReview": "3'75This book was so fun! I really really liked it. It was so interesting to read about mapmakers and explorers. The setting was beautiful, the characters were great (mostly Mercedes and Reyna) and there were some plot twits that surprised me. It was not perfect but I highly recommend it, it is a fast paced read."}, {"userName": "Amanda Ellis", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/1735979-amanda-ellis", "userReview": "4.5 StarsI was provided an ARC of this book from NetGalley in exchange for an honest review.This book was so refreshing. Someone in a review described this book and the pace like sipping a nice cup of tea – and I completely agree. The pace and the world was unfolded at a comfortable, pleasing pace – not too slow, and not too fast. The pacing, of course, builds towards the climax and ending of this novel in a way that is natural and not jarring. It was so nice to read a book that wasn’t so slow in an attempt to build the world, nor too fast in an attempt to be completely action filled.I loved all of the map making and wanderlust that was so prevalent in this novel. The setting felt like Assassin’s Creed II in Venice – old European style vendors and streets on this island nation. The world and the setting had charm, and while I could stand for a little more world building, I felt like we had enough to understand this story. I also found it interesting that the map featured in this novel (at least in the ARC) primarily showed the nation that are main characters reside in, and not any of the other nations mentioned – it helped build upon the mystery and intrigue about a “blank map” – an idea mentioned throughout the book.To read the rest of my review, please check out my blog post!https://amandasafterword.wordpress.co...To read my initial thoughts/review, please see below. Thanks!I really enjoyed this way more than I thought I would! Someone else mentioned that reading this felt like sipping tea by the fire because it was basically just really mellow - and I totally agree. It was fast paced but didn't feel like we were running the whole time, which was actually rather pleasant to read. It picked up near the climax, of course, but it was just engaging and not stressful. I thoroughly enjoyed this book. I am curious how the future books in this world will be, but this was just my cup of tea when I needed it. I will post a more complete review on my blog soon, but I wanted to write out this much right now since this book is pretty under-hyped!"}, {"userName": "Vicky Who Reads", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/57349823-vicky-who-reads", "userReview": "4.5 starsThis book is just what I needed.I know I've mentioned I've had a pretty ehh fantasy year so far and Ace of Shades was one of the first books to pull me out of that slump. But this is a book that's actually similar to all those books I've been trying (princes and mapmakers and all sorts of mystery) that is slaying!Besides just loving the writing style--it's simple yet descriptive and makes everything clear in third person--I found it to just be really enjoyable in general to read.The story has a very nice balance, in the different plots and in the characters. Elias is nice enough that you actually like him, but he does have some flaws and not too much of a tortured past--just enough of one to keep you intrigued. He is a little more heroic and less tortured, although it was refreshing than all those dominating males because he was courteous and nice and we need more of that.What I really loved about the character dynamics with Elias is how he had such a great relationship with is family. He and his stepfather interact in such a cute way and I love how Elias has managed to form this heathy stepfather bond and is actively concerned about his family's well-being without it being the entire motivator of the plot. Even throughout the whole story, he respects both his actual father (that is, if he finds him) and his step father, and this was something that just came off as really cool in a fantasy novel.I also really liked how Lucier showed how he was a nice person and didn't just tell it *cough*Everless*cough*. He's considerate and an enjoyable male main character that we honestly need more of in books narrated by MMCs.I enjoyed some of the historical part of this fantasy novel as Lucier references different places but also twists some things to let her add more diversity and potential with the story. There's definitely some twisting of history as there's a huge emphasis on the importance of maps, but I like the references to places like the Pyrenees.The whole thing was very entertaining to read and engrossing--I wanted to see what's going to happen next and I was invested in the story and the riddles and the maps and the world. Nothing is super slow or boring and there's all sorts of cool things like sea serpents and a whole ton of mystery. There's definitely a little conspiracy going on and although the issue isn't the most complicated plot ever, I definitely found it enjoyable. Where I took off the half star really rested in how I felt like if Lucier tried, she could have turned this into more books with more intrigue and issues and I actually think I would have wanted to read all of them (aka my problem was that I wish there were more books). But it's also always nice to see fantasy standalones which are kind of a breath of fresh air in this series clogged world.The only other thing I wanted to touch on was the transitions in the story. I'm pretty sure in the actual book (when I see a physical, I'll check inside to confirm) there are line breaks or something to indicate a shift in the third person POV, but in the DRC I read there weren't any and it immediately went to another point of view in the next paragraph and was very disconcerting. I'm pretty sure this was a formatting issue, but it's always good to check.Overall, I very much enjoyed this novel and found it to be a refreshing fantasy read! I'd definitely recommend to someone looking for something similar to popular fantasy novels topic-wise, but without some of the more aggravating points to it.Thank you so much to HMH Teen, Netgalley, and the Fantastic Flying Book Club for providing me with a digital review copy in exchange for an honest review!Blog | Instagram | Twitter"}, {"userName": "Katherine Moore", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/21365174-katherine-moore", "userReview": "**Note: My full BLOG TOUR post with give away info is here:http://kamoorephoto.booklikes.com/pos...When I read ‘Blood & Stone’ I felt like I was drawn onto an Mediterranean island and suddenly in the era of the great Leonardo da Vinci, when maps and exploration were paramount, and here, sea-dwelling creatures such as serpents are both feared as well as revered. There is such great imagery that is colorful and vivid; old-fashioned customs are used, such as leeches to suck out toxins from the blood (I love stuff like that), and tonics from plants are used to cure ills, and plant dyes are described in great detail, for that is how color is gained for pigment used for the paint on maps.And maps, and the study of cartography, are central to this novel, and may be foreign to so many in this day and age, when so many people may not even have ever handled an actual paper map. Lord Elias is the royal mapmaker and longtime friend of the newly crowned King Ulises, and he is a a natural explorer, adventurer, and he wants to solve the long-time mystery and disappearance of of Ulise's two brothers. Two maps hold the clues and together with Ulises and Mercedes (Ulise's beautiful cousin, and his eventual love interest; what would the story be without that?); the three of them embark on a precarious adventure to uncover secrets about what happened many years ago with the boys' disappearance.Although the story seemed a little slow to unfold, the characters gradually grew on me; after reading many main female characters in books recently, I really enjoyed reading a young male character; it's also a book with little violence, no use of bad language (suitable for younger readers), focus on story, with no obvious plot holes, and a new setting for a 'royal family' fantasy. I also very much enjoyed the look at the drawing up of maps and cartography, and the use of compasses; author Makiia Luciier evidently researched this extensively, and I have seen on her Twitter feed a great many interesting old maps! I'd love to have seen more about the connection to the sea and more of the sea serpents; the community on the sea derives its character from the creatures and nature of the sea, so we see that in the designs, food, and colors around the people.Overall, this is a lovely read, with a mystery that pulls you in, with main characters that are all likeable, in a beautiful setting at least I can see myself visiting (reminded me a bit of Cyprus?). If you prefer your YA fantasy without the blood and gore as in many books of late, this is the one for you. Luciier is natural storyteller and has conjured a beautiful novel on a magical Isle that you will want to visit.PS. Another beautiful book cover."}, {"userName": "Tara (Spinatale Reviews)", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/56348695-tara-spinatale-reviews", "userReview": "Rating: 3.5Isle of Blood and Stone  was different than I was expecting. It was an interesting mix between a cozy mystery and a fantasy. There’s not really a sense of danger or urgency until the ending, it’s more of a “let’s look into this old mystery”. I was expecting a grand adventure so it took me a bit to adjust to the pace.However, I did still enjoy reading Isle of Blood and Stone, the characters were entertaining and I found the world fascinating. I found it a bit difficult to connect with the story mostly because I thought the reasoning behind the mystery (including it's solution) could have been expanded a bit more. That being said, I still enjoyed reading this book. I also thought that the characters could have had a bit more depth to them. I wanted to understand their motivations a bit more, particularly Ulises. I liked them, I just didn't fall in love with them.As a side note, I’m getting a degree in public health so seeing a disease like leprosy included made me nerd out a little. I thought Lucier did an excellent job addressing the stigma and societal implications of the disease while also showing that those afflicted aren’t any different from the rest of us.Overall, Isle of Blood and Stone was a fun read! I’ll definitely be continuing with the series, I’m interested in to see where Makiia Lucier takes the story next. Anyway, I’d recommend reading this one on a cozy morning with a warm cup of tea and a blanket.*Disclaimer: I received this book for free from the publisher in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}], "description": "Ulises asked, \"How can I look at these maps, see this riddle, and do nothing? They are my brothers.\"Elias reached across the table and flicked aside two shells with a fingertip. The map curled into itself. \"It's bound to be a goose chase. You know that?\"\"Or a treasure hunt,\" Ulises countered, \"and you've always been good at those.\"Nineteen-year-old Elias is a royal explorer, a skilled mapmaker, and the new king of del Mar's oldest friend. Soon he will embark on the adventure of a lifetime, an expedition past the Strait of Cain and into uncharted waters. Nothing stands in his way...until a long-ago tragedy creeps back into the light, threatening all he holds dear.The people of St. John del Mar have never recovered from the loss of their boy princes, kidnapped eighteen years ago, both presumed dead. But when two maps surface, each bearing the same hidden riddle, troubling questions arise. What really happened to the young heirs? And why do the maps appear to be drawn by Lord Antoni, Elias's father, who vanished on that same fateful day? With the king's beautiful cousin by his side—whether he wants her there or not—Elias will race to solve the riddle of the princes. He will have to use his wits and guard his back. Because some truths are better left buried...and an unknown enemy stalks his every turn.", "title": "Isle of Blood and Stone\n      \n          (Isle of Blood and Stone #1)", "url": "http://www.goodreads.com/book/show/30339493-isle-of-blood-and-stone", "average": 3.93, "cover": "https://images.gr-assets.com/books/1512421047l/30339493.jpg", "reviews": 117, "authors": [{"url": "https://www.goodreads.com/author/show/7182579.Makiia_Lucier", "name": "Makiia Lucier"}], "type": ["Fantasy", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/30339493-isle-of-blood-and-stone", "http://www.goodreads.com/book/show/35711640-isle-of-blood-and-stone", "http://www.goodreads.com/book/show/35721243-isle-of-blood-and-stone", "http://www.goodreads.com/book/show/18222767-a-death-struck-year", "http://www.goodreads.com/book/show/36254449-untitled", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}