{"ratings": 379, "userreviews": [{"userName": "Jackie", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/1660443-jackie", "userReview": "I received this with I won another book on the Goodreads giveaway.I didn't know it was a 'Christian' book; I'd already started and the author knows how to write and gives a good hook right from the beginning so I went with it. Too bad I figured it out in under 30 pages. I had hoped I was wrong and the author gave me a false lead but no, it was as I thought. It wasn't too preachy early on but towards the end the author got his preach on full force and it became annoying. \"Yes, I know, you only said 50 times already\" was how I felt, bombarded over and over with the same thing. In the future when I book is listed as Christian on someone's shelves, I'll take their word for it and pass it up."}, {"userName": "Kit★", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/3574604-kit", "userReview": "This is really like 3.5 Stars. When I picked it up a couple years ago at Goodwill, I didn't know it was 'Christian Fiction', or I wouldn't have bought it most likely. But I was hooked by the back cover description, it sounded like it'd be a good scary story. Well, it didn't really fail in that. It was pretty well written, and had a few spooky moments, moments where I was wondering was the bad guy just a man, or something worse, a demon or something. All the faith stuff was most certainly front and present, but I kept reading anyways because I was hugely interested in where the story was going, how it was going to turn out. It wasn't really overly preachy or anything until closer to the end, when it got a little overwhelming. I mean, personally, I believe, but in my own way, and I'm not to keen on people bopping me over the head telling me what to think. But really it wasn't a bad story, and in fact, if you were into Christian Fiction, with suspense elements, this would be a great read. I liked it well enough to fly through it in one sitting today, so that says something I think. In places I could definitely see where the author was influenced by Stephen King, there are moments that are totally reminiscent of The Shining, as well as the boy Zach reminding me a lot of David from Desperation (complete with being choked unto death but miraculously surviving/coming back). The suspense kept me turning the pages, and while sure, some if it was not necessarily totally believable, it was still interesting. I only wish for maybe some more details. Like about the house, what was all the mysterious dark goings-on in there? Sure, the author showed me walls and floors painted all black and red, and a pentagram on the floor of one room, and a library full of dirty books from Playboys to super-kinky weird stuff, and 2 seconds of what may have been a snuff film, but I can't be sure as the main character turned away and didn't see it, only heard a woman screaming. Oh, and the room full of tools and surgical instruments, the 'torture room'. I would've liked more info there, like what happened in the house. Especially once it comes to light that Steph and her brother Paul had been there as children. So what happened to them there? And what was the deal with their parents? Were they evil people or what was going on there? I didn't get that. Too much stuff about her past and the house's past were hinted at and teased with, and then never explained. So I would've liked more background or something. But the action and the mystery here was good. And of course you gotta like that it had a good ending for the family, if not for the other characters involved. I liked this book pretty well. It's not going in the keeper box or anything, but it was a good, solid, entertaining read. And I just might try this author again some day, as I mostly liked his style. 3.5 Stars!"}, {"userName": "Matt Schiariti", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/12981352-matt-schiariti", "userReview": "This is my first book by Travis Thrasher. After devouring this book in just over a day, he's definetly going to be on my radar from now on.I like the type of horror or mystery that makes you think. Something that offers you hints as to what's going on or has happened, but doesn't have to rely on shock value or being overly graphic to get its point across. This book has that in spades.In summary, a family of missionaries, after returning from a very hard mission overseas that was wrought with failure and tradedy, look for some well deserved R and R as a means to collect themselves and reconnect as a family. The husband is stressed from working so hard for years and the wife is having sleep walking/nightmare issues of her own. Or ARE they actually nightmares?In seeking their furlough they're recommended a sprawling 40,000 square foot mansion/cabin built by a reclusive millionaire on a mountain in North Carolina that is now being used as a missionary retreat. Little did they know what secrets hide in the mansion's past and its dark corners.Things start to go bad even before they get there. The husband wonders if moving them miles away from family and home is the right thing for his family and the wife has strong feelings of dread over the very idea. It's when they get to the house that things REALLY go bad.Isolation is like a cross between The Shining, The Exorcist and the Amityville Horror. There's alot of spiritual conflict, good vs. evil in its most biblical sense.Thrasher hints at things discovered, nightmares realized, memories surfaced, rituals performed in the past, but doesn't dwell on them for the sake of dwelling on them. He flashes at an image or a memory and then moves on, relying more on the confusion and terror of the characters to drive the story than out and out shock moments which makes for a really engrossing and, quite honestly, addicting read. This is also why I rated it a four instead of five out of five.The one thing I REALLY wanted to know was about the wife's childhood and resurfaced memories. Not much is revealed about her nightmares or dark memories. That's the one thing that I wish Thrasher would have covered and explained more fully.Other than that, the book is FANTASTIC. A gripping novel that's very difficult to put down."}, {"userName": "Crystal", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/1844496-crystal", "userReview": "When I read the back cover copy for this book I knew it interested me. A family comes home from Papua New Guinea where something has happened. Since they have returned strange things have been going on with the wife, Stephanie. The missionary husband, Jim, has been really busy since returning and has kind of lost touch with Stephanie. Then the offer comes in to stay in a wonderful home in a secluded area of the Smoky Mountains of NC (my home state). Jim thinks this is the best thing that could happen. At this retreat he can reconnect with his wife and family and get to work on his projects too. Stephanie is not so sure this is what she wants, but as a dutiful wife she goes along with it.All seems fine when they see the majestic home. They are in awe of the number of rooms. The couple currently living there is a nice older couple who are a big help with the kids and comforting to both Jim and Stephanie too. Then things become unsettling. Strange things start happening. Because the lines of communication between Jim and Stephanie are already broken down, neither realizes what the other is going through and then it all goes crazy.This was a serious suspense book, I could hardly put it down. I would say it's got a feel of The Shining but it is so much more than that. I think The Shining feel comes from the large secluded house idea, but this isn't an old idea used over again. Mr. Thrasher takes the large secluded house idea and makes it new. I also liken it to the works of Frank Peretti, another Christian author because Mr. Thrasher can make the demonic seem more real to me. I realize it is there, but this doesn't seem all that over exaggerated like horror books. It seems real, the fear is real, the situations real and the outcome interesting. Again Mr. Thrasher stands on his own and I will definitly read more of his books in the future.If you start reading this make sure you lock your doors and leave plenty of time to read. Better yet, make sure you read it in the daylight. It's a haunting, suspenseful read that you will remember for some time to come."}, {"userName": "Ashley", "userReviewDate": "Jan 21, 2009", "userURL": "http://www.goodreads.com/user/show/1938842-ashley", "userReview": "WOW. This book sure does keep you interested. I couldn't put this book down. I finished it before a week was over. I never wanted to put the book down because I wanted to find out what happend on the next page! It definitely has its spooky parts! The author does a great job with describing things in the book. Great read!"}, {"userName": "C.", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/19404467-c", "userReview": "Was like a cleaner version of SK's 'The Shining'. I liked where it touched on the missionary losing his faith on the mission field, which so often happens, but is a hidden fact. That why churches have to constantly recruit new missionaries!Nice spookiness here."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Warning: Do NOT read this book into the late night hours, it will seriously creep you out and make you wonder what every single noise in your house is, and making it extremely difficult to sleep without thinking about what you have read. If you love being scared right to the end of a great suspense thriller with a wicked twist, then by all means pick this one up. It was a rough night last night after I read it just before bed. It is definitely a novel you won't be able to put down. From the first to the last page, the suspense only intensifies and you have to keep reading it to know how it will all turn out. I love that Travis Thrasher writes novels like this, because before becoming a solid believer in Jesus, these are the kinds of books I read. Not the slasher novels, but the ones dealing with the supernatural world, because somewhere in the back of your mind, you know that it is all possibly true and it could and has happened. This is why these novels and movies work so well to their target audience group. This one is about the Miller family who has recently returned from a missions trip in Papua New Guinea and has come away from that place forever change and a bit separated at the seams. James Miller and his wife Stephanie are feeling the strains of being married and coming back after what they dealt with regarding the supernatural evil in the village where they served. Is it possible that they simply didn't leave it all behind, or is there another more deeply buried reason from Stephanie's pasts that are causing her to have the most unreal nightmares of seeing things in her home that she swears is real, only to come to find out she's been sleepwalking. It is causing a division in the family even among the children that is bringing fear into their home. James learns about a lodge nestled away up in the Smokey Mountains that is being designed for us for missionary families returning from their trips as a way of getting back to the real world and the 45,000 square foot mansion is just waiting for them to be the first family to try it. The only other people staying there are the caregivers of the lodge an elderly couple by the name of the Petersons. The only restriction is that the north wing is locked as the original owners strive to move some of the personal belongings that remain in the lodge. Sounds like the perfect retreat right? Well you'll just have to join the family to see how it all works out in the end. I received Isolation by Travis Thrasher compliments of the author, himself, as he knows what a huge fan I am of his others series like Solitary and the Books of Marvella. I did not receive any monetary compensation for a favorable review, aside from a free copy of this novel and the opinions are strictly my own. Fans of Stephen King, Ted Dekker and Frank Peretti will absolutely have to pick this one up. It is definitely a 5 out of 5 in the way of suspense, horror and all the elements that readers love when they pick up a book like this. They want to be scared right to the end, and the part that I love about Travis Thrasher's writing style is he doles out pieces of suspense a small bit at a time, so you seriously don't know what is coming or what lies behind the locked doors and secret passages in the lodge known simply as Edge Hill."}, {"userName": "Sedge 李", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/211264-sedge", "userReview": "You got Christian inspirational fiction in my horror novel! That's the last time I read a book without careful detective work first, and then decide to keep with it because Hey, I liked Frailty, and that was Christian horror, right? Right. Turns out that was probably just horror with a Christian theme. This, on the other hand, was more like inspirational lit with a horror theme, which is to say, no lasting horror. SPOILER ALERT: Everything works out fine in the end. Nobody important dies who isn't brought back from the dead, other than the only brother of a main character, who got himself possessed for not having THE FAITH. These are acceptable losses. Insert overly-easy (anti)climax.Additionally, though I've been through my share of spiritual crises, even I didn't have the sympathy to say anything re. the main character, other than \"Jim. Shut up. God will return your calls when he feels like it. Stop whining and pay some attention to your wife.\"I'd have thought my love of weird houses and wintry isolation would have saved this one for me, but no."}, {"userName": "Cheryl", "userReviewDate": "Dec 26, 2008", "userURL": "http://www.goodreads.com/user/show/1176509-cheryl", "userReview": "A missionary family looks forward to a vacation in a magnificent lodge high in the North Carolina mountains. Life as a missionary is difficult under the best circumstances, but for the Millers it has begun to split their family apart. Haunted by the circumstances under which they left Papua New Guinea, things don't get much better when they arrive home, especially for wife and mom, Stephanie.Nightmares have begun to haunt her sleep. Dreams become confused with memory, which meld with reality and she begins to doubt her sanity. Her husband James, fears for her as well and the rest of his family. The isolated surroundings are just what they need to re-connect with each other. Stephanie looks forward to seeing her brother, Paul and his help with some of her frightening memories. But the lodge holds its own dark secrets and instead of a restful retreat, the Millers find themselves in the middle of a nightmare from which they can't escape. Isolation is a fast-paced read with a plot line that twists and turns throughout the book."}, {"userName": "Katyak79", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/5459937-katyak79", "userReview": "I really wanted to like this book, but I just couldn't. This is not the first time I have randomly picked up a book at the library because it sounded interesting, and been sorely disappointed to find out that it's Christian fiction. Nothing against the genre, but from my experience most of it just comes across way too preachy and that was definitely the case here. The author writes well and the story had a lot of potential, but give it a rest already! At one point, the word God was used eight times on one page. The author totally lost me though, when a key character that had been killed was resurrected. The story would have worked so much better if the author had used a lighter hand with the theology, and kept the story line somewhat believable. Skip this one, there's better books out there."}, {"userName": "Nick Zelenak", "userReviewDate": "Nov 10, 2010", "userURL": "http://www.goodreads.com/user/show/4320094-nick-zelenak", "userReview": "The book I read was called \"Isolation\", by Travis Thrasher. I think this book would be considered a mystery because it makes you think about the plot and how the characters interact throughout different mind jogging events. What I think the author is trying to say in this book is ( and i know this a religious factor) is believe in god because he will help you in your time of need. I don't think that this is a story for younger kids because it has too much grusome and horrific events in it. So the intended audience I think would be highschool kids and older. I also think that people would like this mystery novel because mysteries are always resolved in the end."}, {"userName": "Cara ", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/2300614-cara", "userReview": "I enjoy a good suspense fiction book. For you adrenaline thriller junkies who always have to be on the edge of your seat, this is a must-read. It delves into the supernatural and shows that even when hope is gone and the tiny thread of faith to which you desperately clung snaps, God is with you and will see you through your turbulation. Stephen King and Peretti fans will love this one. Good job, Travis!"}, {"userName": "Rebecca", "userReviewDate": "Oct 16, 2010", "userURL": "http://www.goodreads.com/user/show/1223850-rebecca", "userReview": "I received this book from Goodreads. It came in a box of books that were given to me when I signed up to win a copy of The Heretic's Daughter. I got almost 100 pages into it and just wasn't interested. The Christian element was laid on pretty thick and the writing was choppy because it was mostly dialogue and inner thoughts. I decided I didn't want to finish it."}, {"userName": "Connie", "userReviewDate": "Apr 25, 2009", "userURL": "http://www.goodreads.com/user/show/2159838-connie", "userReview": "This is one of the more disturbing books that I have read, however I must admit it was hard to put down. I think it was because I needed to see if anything good was going to come of the events that were taking place. I thought this would be more in the suspense catagory, but there was a little bit too much horror it for my liking."}, {"userName": "Debra", "userReviewDate": "Oct 24, 2008", "userURL": "http://www.goodreads.com/user/show/1652187-debra", "userReview": "This is a Christian suspense thriller. It is a great read, especially here at Halloween. Good versus evil is the plot. A burnt out missionary family takes a \"repreive\" in an isolated mansion in the mountains of North Carolina. They get more than they bargained for in the experience. For a little fright with a Christian view, this is a good choice!"}, {"userName": "Andrea Balmori", "userReviewDate": "Mar 05, 2011", "userURL": "http://www.goodreads.com/user/show/5083708-andrea-balmori", "userReview": "I am not the type of person that enjoys sitting in the edge of the chair because of the suspense that a movie or a book makes you feel..but this book was the exception, I have to confess that I bought it because of the cover, but I didn´t regret buying it. This book is awesome.. the twists in the book are perfect.. highly recommended."}, {"userName": "Laurie", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/3693617-laurie", "userReview": "This book was really scary but enjoyable. I should have read the author's note about his growing up reading Stephen King novels.I feel its comparable in Christian theme to Frank Peretti with the spiritual references - demons, possession, etc."}, {"userName": "Christie", "userReviewDate": "Feb 21, 2009", "userURL": "http://www.goodreads.com/user/show/321697-christie", "userReview": "I read over 100 pages, but I could not finish this book. Nothing wrong with the book itself--it was very interesting and well-written, the characters were engaging and the plot really drew me in, but it was just too scary for me. Definitely scarier than any Peretti book I've read."}, {"userName": "Jess", "userReviewDate": "Feb 07, 2009", "userURL": "http://www.goodreads.com/user/show/1143081-jess", "userReview": "This book had so much potential ... and fell flat. The suspense was entertaining for a while, but the ending was such a disappointment. Overall, I wouldn't recommend it."}, {"userName": "Robyn", "userReviewDate": "Mar 11, 2009", "userURL": "http://www.goodreads.com/user/show/1400439-robyn", "userReview": "This book is SCARY!! I love a really scary book but I can't handle it when James travels. So it's on hold."}, {"userName": "Karen", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/685023-karen", "userReview": "Interesting for the first 2/3 of the book; then it got off track as far as I am concerned. It didn't seem to know if it was a serial murderer book or a Christian inspirational book."}, {"userName": "Alyssa", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/31427441-alyssa", "userReview": "Wow. A complete understatement, but \"powerful story\" is all I can think of when describing this book. This is the first Travis Thrasher novel I've read, and though it was a little slow until about the middle/towards the end of the book, the wait is definitely worth it. Mr. Thrasher describes the missionary family like real true Christians and not the \"Hollywood\" picture movies try to paint. Even the strongest of us Christians have doubts and questions and the Millers' struggles are no different, especially after experiencing spiritual warfare overseas. Being a Christian myself with my own personal struggles, I connected with this story and felt my faith both faltering with Jim and Stephanie but more importantly strengthening by the end of the book. In what looked like would be a hopeless sad ending with only a few pages left, completely turned around before we could expect it. Just like what could be said with real life situations. (God takes what would be meant for evil and turns it into something good for those who love Him. Romans 8:28)Written like a classic horror movie, I admire Thrasher's writing style and would definitely list this book happily as a title to recommend to fellow readers everywhere."}, {"userName": "Elizabeth Sanders", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/79402154-elizabeth-sanders", "userReview": "I would give this book a rating of five out of five stars because this book was a wonderful read from cover to cover. This book was encapsulating within every moment. From paralyzing fear, to good thematic development, this book had it all. The family, a missionary family, is easy to relate to. This book shows the inside view into a normal missionary’s life, until you see some weird things start to happen. Hallucinations, dead bodies, the family knew something was terribly wrong. You also get an inside look into the life of a merciless killer, one who wants to prove he has more power than God, and can do things by his own hand. This killer and the missionary family meet, and it's within the same house in the middle of a snow storm. Will the family get out alive? Will the family settle their doubts and questions for God? This book gives you the answers to all your questions in a stunning way. This book is definitely a wonderful read to all who dare to open its cover. However, I shall warn you, don’t read this book at night if you plan on getting any sleep."}, {"userName": "Joshua", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/18525023-joshua", "userReview": "I haven't been a fan of any kind of \"Christian horror\" before. And I still don't think I am. Thrasher brings us fiction that's pumped full of true-to-life spiritual warfare; the kind that many of us don't see in life. The story is reminiscent of the case-studies we'd looked at in my Trauma and Recovery counseling course at DTS, particularly in relation to SRA (Satanic Ritual Abuse). The material is very disturbing, but the message is one of hope and faith in Jesus Christ. It makes for a difficult but educational read. It also reminded me of the true account of the South-American-Shaman-turned-Christian in the book \"Spirit of the Rainforest.\""}, {"userName": "Jessica Haynes", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/4897786-jessica-haynes", "userReview": "Even though this book carried a spiritual message and was largely about spiritual warfare (which I certainly believe in), it was a little too dark for my personal tastes."}, {"userName": "Nora St Laurent", "userReviewDate": "Sep 14, 2008", "userURL": "http://www.goodreads.com/user/show/1100689-nora-st-laurent", "userReview": "I read in an interview with Travis Thrasher, that he likes to write stories that are all character-driven - he says \"I like to write about main characters who are flawed. At the core, I want to write about real people who are searching, who are failing, and who are stuck in some drama which forces them to change.\" That is the main case here. The topic of this book is spiritual warfare - something that Frank Peretti first brought to our awareness in his books. Travis takes it up a few notches for sure; almost too graphic for my taste in some parts. I have a friend who was a missionary for many years, and when I visited her, she would tell me of the spiritual battles that were so visible in Africia and the other places she stayed. When there is a spiritual strong-hold by the enemy (in an area), very crazy things happen because the enemy has been given permission to operate there.Travis did research for this book and says some things were so graphic that they didn't make it into the book (I can't imagine what parts those were, because the few things he put in his book were graphics-overload for me). Travis says that the scariest things weren't graphic, but just the fact of being alone - isolated. Just because you are a Christian doesn't mean that you will always feel HIS presence, or know why He does the things He does, or hear God or understand His plan. His ways are definitely not our ways. It's easy for those who are on the front lines in ministry, who have see the dark side, to feel isolated and all alone. These are the things they can't teach you in a book. Travis says that when you let your guard down and don't rely on God, you're prone to attack. Not just physically, but emotionally and spiritually. The main character feels alone - isolated. He can't explain what he has gone through and if he shares what he feels, people might think he's crazy. The story is about the forces of good and evil in an all-out battle.Oh, to have that child-like faith! The missionary's only son believes. He has faith even when his parents are weaving in their faith and are disillusioned.This book is not for the faint of heart. If this were made into a movie, I would be putting my hands over my eyes to block out the graphic parts. It has a powerful message, but I would have liked less blood (I'm sure the missionarys in real life would have too!). This book makes you aware that the devil is alive and well, but God is too. We can be overcomers, but it takes work - nothing is easy. Travis Thrasher's next book is Ghost.Disclosure of Material Connection: I received a complimentary copy of this book from the publisher. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255 “Guides Concerning the Use of Endorsements and Testimonials in Advertising”Nora St.LaurentThe Book Club Network www.bookfun.orgThe Book Club Network blog www.psalm516.blogspot.com Book Fun Magazine www.bookfunmagazine.com"}, {"userName": "Christie", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/4914087-christie", "userReview": "Travis Thrasher’s novel Isolation is a sheep in wolf’s clothing. It pretends to be one thing, but it’s actually something very different indeed.Isolation tells the story of missionaries James and Stephanie Miller. They’ve recently returned home from Papua New Guinea with their two young children, Zach, 8 and Ashley, 5. Something traumatic happened in Papua New Guinea and Jim and Stephanie are feeling disillusioned and isolated – from each other and from their church.Jim wants to take some time to recharge his spiritual battery and so he moves his family to North Carolina, to an isolated lodge built by an eccentric millionaire. The house has secrets though and so, apparently, does Stephanie’s family history.Now, if this had been a book about how this couple and family overcome obstacles to find their way back to their faith, that might have been one thing. But this is supposed to be a ‘horror’ novel. Thrasher even thanks scare-master Stephen King in his acknowledgments. I’m not saying the book doesn’t have a certain creep-factor. It does. But I think that this book is more about God and putting your faith in him. Evil in this book is the work of the devil and the ability to fight against it comes from a higher power.I’m not religious. In my book club, I proudly wear the flag of heathen. Organized religion irritates me. Hopefully that will explain, in part, why I felt duped by Isolation. Whole sections of the novel felt preachy to me, like when we learn about how Stephanie’s character came to be Christian.\"The camp was run by Christians who were sincere and loving. They weren’t like the televangelists her parents mocked or the pious churchgoers in her neighbourhood who never even bothered to wave hello. They weren’t like the preachy kids at school who made others feel bad for not believing. These were simply loving, fun men and women who wanted to befriend the campers.\"Oh, so there are different kinds of Christians, then.Apparently, because the author takes great pains to describe Stephanie’s friend, Michelle’s “no-nonsense” qualities.\"Why aren’t there women elders in the church, and why can’t they serve Communion, and what’s the big deal about having a beer every now and then, and why can’t Christians get off their high horse sometimes?\"It’s stuff like this that made me feel as though Isolation‘s agenda was not actually to scare, but to instruct. Too bad because all the ingredients were there for a creepy little story…if only it hadn’t felt so much like a sermon."}, {"userName": "Kathy (Bermudaonion)", "userReviewDate": "Nov 10, 2008", "userURL": "http://www.goodreads.com/user/show/1454470-kathy-bermudaonion", "userReview": "Jim and Stephanie Miller are missionaries who have just returned with their children from a few years in Papau, New Guinea. They saw unimaginable horrors while they were there and have returned worn out and full of doubt. Stephanie is suffering from nightmares and sleepwalking and has woken up to find herself in some scary positions. Jim is busy with a writing project and is too distracted to pay his family much attention.When they’re offered a chance to get away for a few months in a mansion isolated in the mountains of North Carolina, Jim thinks it’s just what they need to clear their minds and bring their family closer together. They head off to North Carolina, against the advice of Jim’s parents.When they get to the mansion, they find they are sharing it with another missionary couple, but the house is so huge, it doesn’t really matter. From the beginning, both Jim and Stephanie feel uneasy in the mansion and they both feel the presence of evil, but they never express it to each other. They’re both determined to stick things out for the sake of the other.Things seem to be going okay until Stephanie’s brother visits and they have a huge snowstorm that knocks out power and isolates them from the nearest community. I don’t want to give away any more of the story, but that’s when things really begin to get creepy.Isolation by Travis Thrasher is not the type of book I usually read, but I enjoyed it anyway. I’m not a big fan of horror, because it keeps me awake at night, and while I found this book to be very creepy, it didn’t have that affect on me. It’s published by Faith Words, but I didn’t find the book to be preachy at all – as a matter of fact, the characters doubted their faith throughout most of the book. There is no sex or foul language in this book but there is violence.I was hooked on this book right from the start. The story line kept me interested throughout and there were a couple twists that I wasn’t expecting. I even suspected the wrong person at one time. One of the things that I enjoyed about this book is that you read some of the characters’ thoughts in first person even though it’s narrated in the third person. I was so engrossed in the book, I would find myself urging characters to “get out of there” or “go back”. They usually didn’t listen to me, though."}, {"userName": "Susan", "userReviewDate": "Sep 16, 2008", "userURL": "http://www.goodreads.com/user/show/933512-susan", "userReview": "I think I would categorize Isolation as one part Christian fiction, one part suspense/thriller, and one part horror. The story centers around a missionary family on furlough in the remote North Carolina wilderness. Jim Miller and his wife Stephanie have come to this lodge in North Carolina to find some peace, after suffering a serious crisis of faith during their last mission in Papua New Guinea. They each have begun to have serious doubts about their beliefs, and this leaves them open to spiritual attack. I don't want to give anything away here, so I'll just leave the synopsis at that.Now, I am not a fan of Christian fiction. This is the first book I've ever read that I would consider to be within that genre. When I signed up for the giveaway, if I had know that it was a book of Christian fiction, I probably would not have put my name in for it. That being said, I could not put this book down! It is easily the scariest piece of literature that I have read in a long time. In fact, I would have finished it in one day, had I had the courage to stay up by myself. But alas, hubby was ready for bed when I had just 60 pages to go, and I was already getting really jumpy, so I took the coward's way out and finished the book by the light of the next day.Travis Thrasher writes with every drop of suspense that you get in a Richard Laymon novel, but without the in-your-face gore and depravity. Don't get me wrong, terrible ritualistic acts were alluded to, and murder was committed, again and again, but the details of the carnage were left largely \"off screen\" in Isolation. It was every bit as terrifying as any horror novel I've ever read, but didn't manage to make me queasy while reading.Isolation is a strong character-driven novel, complete with multi-dimensional personalities, full of humanity. Despite the fact that it really wasn't what I thought it would be, it turned out to be everything I look for in a good book: frightening, suspenseful, mysterious, and a real page-turner, right up to the last word."}, {"userName": "Jenny", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/4630657-jenny", "userReview": "A missionary family finds themselves having to make a decision to move to a secluded home for the winter. The wife is uneasy about the move but she is having issues with nightmares and sleep walking so she figures it will be best to agree to the move. Once they get to the home, things start happening that disturb the family. The family has only their faith to lean on and they are beginning to question even their faith.This is a well written Christian thriller/horror. I picked this book up at a Christian bookstore when I visited my family. I had never read a Travis Thrasher book and I am glad I picked up this book. I loved the suspense throughout the book and I did not figure out who the \"bad guy\" was until the end of the book. Thrasher kept me on my toes throughout the story.What I loved the most about Thrasher's book was that the characters faced real conflicts about their faith. The way he wrote it was so realistic. So many books have conflicts about faith that are hard to relate to but Thrasher wrote a conflict that many Christians can relate to...having faith and questioning God. There were things that the characters said that I could relate to and I have said myself. It doesn't make me (or others like me) a bad Christian...it makes me real and I felt that Thrasher wrote the conflict in such a way that makes you not feel like a bad person for having the same kind of conflict in your life.I also like that Thrasher wrote about some intense things without being too graphic. The reader gets the idea of what the characters are seeing without giving extreme descriptions. I was impressed that I could \"feel\" the evil in the rooms without the graphic descriptions.This was a well written and intense story. I will definitely look into more Travis Thrasher books."}], "description": "With masterful storytelling, Travis Thrasher draws readers into a novel so gripping it cannot be put down. James Miller is a burned-out missionary whose time on the mission field in Papua New Guinea left him exhausted and disillusioned. His wife, Stephanie, feels like she's losing her mind. After moving to North Carolina, Stephanie begins seeing strange and frightening things: blood dripping down the walls, one of her children suffocating. Premonitions, she's sure, of what's to come. As the visions and haunting images intensify, Stephanie asks her brother to come for a much-needed visit--but he's hiding secrets of his own that will prove more destructive than Stephanie can imagine. Nine-year-old Zachary sees his family's move as an adventure, and as he explores the new house, he discovers every young boy's dream: secret passageways and hidden rooms. But what seems exciting at first quickly becomes altogether frightening. When a snowstorm traps the Millers, the supernatural dangers of their new home will test everything they thought they knew about each other, and about their faith.", "title": "Isolation", "url": "http://www.goodreads.com/book/show/3255639-isolation", "average": 3.63, "cover": "https://images.gr-assets.com/books/1344268332l/3255639.jpg", "reviews": 68, "authors": [{"url": "https://www.goodreads.com/author/show/62240.Travis_Thrasher", "name": "Travis Thrasher"}], "type": ["Christian Fiction", "Horror", "Thriller", "Christian", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3255639-isolation", "http://www.goodreads.com/book/show/7131154-isolation", "http://www.goodreads.com/book/show/7140387-solitary", "http://www.goodreads.com/book/show/13586518-home-run", "http://www.goodreads.com/book/show/8835902-gravestone", "http://www.goodreads.com/book/show/11828000-temptation", "http://www.goodreads.com/book/show/13207224-hurt"]}