{"ratings": 9609, "userreviews": [{"userName": "Michael Finocchiaro", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "A friend of mine that was recently in London told me that all the bookshops there had Roth's The Plot Against America and It Can't Happen Here by Sinclair Lewis. Alarmist? Perhaps, but as I already said in my review of The Plot Against America, maybe not.In It Can't Happen Here, rather than Lindbergh tromping FDR as in The Plot Against America, we have a populist Windrip who takes the Democratic nomination in 1936 by storm on a platform promising $5000 to each American citizen and naturally crushes the Republican opposition. Before becoming President (and subsequently dictator), Windrip wrote a populist book called Zero Hour which was your typical Drumpf-ian boisterous blather about the evils of everyone except himself and espousal of views about making America great again (but not in so many words.) Doremus Jessup is the protagonist, an ageing editor for the Vermont Daily Informer and as events unfold goes from \"It Can't Happen Here\" to \"Oh shit, it has already happened.\" Windrip issues a 15-point plan which has some parallels to Drumpf's platform and appoints equally unqualified people to his inner circle. Doremus' characterization of Windrip in Chapter 9 \"The Sentator was vulgar, almost illiterate, a public liar almost detected, and in his \"ideas\" almost idiotic, while his celebrated piety was that of a traveling salesman for church furniture, and yet his more celebrated humor the shy cynicism of a country store\" certainly fits Drumpf to an extent. Worse, Windrip \"in between tricks would coldly and almost contemptuously jab his crowds with figures and facts - figures and facts that were inescapable even when, as often happened, they were entirely wrong\" which is of course pure \"Drumpf on Twitter.\"Lewis' book is even more pessimistic than Roth's because America spins out into a mess of mass murders under the Gestopo-like Militia Men (M.M.) corps which are deployed nationwide and terrorise all sectors of the population preferably the educated, Jewish, and anyone even suspecting of whispering slander against the administration. It is a terrifying narrative and - again unlike Roth - does NOT have a happy ending. We were warned at least twice by our own writers (and also by Orwell and others outside of the US) of letting ignorant populism run away with American politics. I hope that the dire sequence of events under the fictional Windrip will not be echoed by the reality of Drumpf, but then sometimes fact is even stranger and more terrifying than fiction. I like how Doremus sums it up near the end: \"More and more, as I think about history, I am convinced that everything that it is worth while in the world has been accomplished by the free, inquiring critical spirit, and that the preservation of this spirit is more important than any social system whatsoever. But the men of ritual and barbarism are capable of shutting up the men of science and silencing them forever.\"A must read.Unfortunately, gets more real every passing day :/Incredible that ever passing day things continue to devolve into what Sinclair Lewis envisioned. Yesterday's hate filled publicity inciting gun owners to rise against liberals is not dissimilar from Windrip's use of the MM for fomenting racist attacks. Not to mention Drumpf's sexist tweets against Morning Joe. How many Doremuses will there be to #resist this current frontal assault on American democracy?Time continues to slip by and the world it continues to happen here, unfortunately."}, {"userName": "Lilo", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/19470614-lilo", "userReview": "October 8, 2015:I am just on page 84 of this book but I cannot wait to write a review. So I will write a preliminary review.Sinclair Lewis wrote this meanwhile classic satire in 1936. And I am afraid that fictious history might become true, 80 years after this book has been written.The satiric novel tells about an American presidential candidate who is very belligerent and bombastic. Irony of all irony: Even though he is clearly a fascist, he hitches a ride from the Democratic Party to come to power. Will keep you updated.I URGE YOU TO READ THIS BOOK.October 10, 2015I rarely have time to read anywhere else than in bed or in the bathroom. At neither locations I keep any writing material. So in order to be able to treat you to a few excerpts from this book, I had to sit down at a table to reread part of what I had already read and take some notes.I try to keep this review short, so I’ll confine myself to only a few passages. They all portray the presidential candidate protagonist, whom, for simplicity, I will only call “The Candidate”. I’ll leave it up to you to find similarities to any of the present presidential candidates.Here I go:At the nomination event, The Candidate eventually retires to his hotel room, leaving a letter to be read to the electorate. “Summarized, the letter explained that he was all against the banks but all for the bankers … … … ; that he had thoroughly tested (but unspecified) plans to make all wages very high and the prices of everything produced by these same highly paid workers very low; that he was 100 per cent for Labor but 100 per cent against all strikes; and that he was in favor of the United States so arming itself, so preparing to produce its own coffee, sugar, perfumes, tweed, and nickel instead of importing them, that it would defy the World …, and maybe, if that World was so impertinent as to defy America in turn [The Candidate] hinted, he might have to take it over and run it properly.”The other protagonist, owner of a small-town newspaper, whom I’ll call The Newspaper Man, describes The Candidate as follows:“Aside from his dramatic glory, The Candidate was a Professional Common Man.—Oh he was common enough. He had every prejudice and aspiration of every American Common Man. … … … But he was the Common Man twenty-times-magnified by his oratory, so that while the other Commoners could understand his every purpose, which was exactly the same as their own, they saw him towering among them, and they raised hands to him in worship.”And the Newspaper Man continues a few pages later: “The few who did fail [to adore and support The Candidate], most of them newspapermen, disliked the smell of him more than before they had met him. … … … Even they, by the unusual spiritedness and color of their attack upon him, kept his name alive in every column … … …”Will keep you updated.PLEASE READ THIS BOOK.October 12, 2015I am now getting towards the middle of the book; more precisely, I have read to page 156.As you might have guessed, The Candidate became The Nominee, and The Nominee became The President.My, oh, my! What can I say? The book is getting eery. As a matter of fact, I think Sinclair Lewis has plagiarized “Pfaffenhofen unterm Hakenkreuz” (“Pfaffenhofen under the swastika”), a non-fiction book, written by a local historian, telling how my hometown was nazified during the 1920s and 1930s. This was accomplished with rallies (some of which Hitler, in person, attended), promises, marches, songs, propaganda, and finally with hard-core brainwash; and as you might have heard of because it happened all over Germany, with harassing and threatening those citizens who resisted the brainwash and sending dissidents of every couleur to Dachau. Actually, not all of the latter were sent to Dachau; some were properly arrested and brought in front of the “Volksgericht” (People’s Court), where a defense attorney was unnecessary. And a few were found dead, said to be murdered by some bolshevik swines. Mind you, all this happened before I was born (in 1939). So I cannot really testify to it and have to take the local historian’s word for it. (This book, btw, is out of print, and there is unlikely to be a new edition because there are rumors that the author has received death threats.)Getting back to America: No, this can’t happen here. IT, definitely, CAN’T HAPPEN HERE. None of our present presidential candidates are evil. I have said this before, but I cannot say it often enough: NONE OF THEM ARE EVIL. Some are even very pious. Mind you, some are a bit power-craving (o.k., a few are a bit more than a bit power-craving). Some (and here I am definitely not naming names) are not the very brightest. One seems to be megalomaniac (might be treatable). This particular one is also very rude, vulgar, and scarily belligerent. I wouldn’t even rule out that one or another is a bit of a scoundrel, but none of them are evil. So IT CAN’T HAPPEN HERE.Yet an old German proverb says: “Man soll den Tag nicht vor dem Abend loben.” (“One should not praise the day before the evening.”) I am not yet finished reading this book. So let’s see how it will go from here.Oh, btw, I have trouble with all the names in this book. Being nuttin’ but an immigrant (listen, Mr. Trump, a LEGAL immigrant!), I am not very familiar with American politicians and other celebrities of days past. But I get by without identifying all of these characters. One of the things I really like about this book is that it enables me to widen my meager ESL vocabulary. So for instance, I just recently came across the word “gas bag”. I had known “wind bag”, but “gas bag” can be so much more fitting. Sinclair Lewis even uses the expression “the gassiest of all gassy gas bags”. This is such a beautiful and flowery expression. I don’t know how I have been able to live without this expression for almost 76 years.Talk to you again when I read further on.In the meantime: GO AND START READING THIS BOOK.October 17, 2015I am now on page 258. America has been turned into a bomb-tight police state, terrorizing and murdering its non-conformist citizens. And I tell you, this COULD HAVE HAPPENED in the 1930s because, all differences taken into account, Americans are NOT THAT MUCH DIFFERENT from Europeans and even Germans.Yet I am rather sure that IT CAN’T HAPPEN HERE now, in the early 21st century. But don’t relax yet. Worse things CAN HAPPEN now.So get off your couch and do something. Don’t let worse things happen.Will keep you posted.HOPE YOU HAVE ALREADY STARTED READING THIS BOOK. October 21, 2015I have now read to page 355.It’s not funny anymore. And I don’t mean the police state, as it goes without saying that this isn’t funny. I mean the book. It is turning into a horror story, and I don’t like horror stories. I never read horror fiction, and I get more than I ever want non-fiction horror from the news and from reading Holocaust memoirs, which I consider every decent person’s duty to read.So what is happening to this satire novel? I always thought that satire, while allowed to be acid, is supposed to be funny. Could it be that Sinclair Lewis’s wife, the journalist who visited Germany several times and even interviewed Hitler, got mad at her husband for writing too funny a book about such a serious matter as an abominable police state with concentration camps, torture, and state-approved murder? Could it be that she kicked him and coaxed him to describe in detail what oppressive, totalitarian regimes do to their non-conformist citizens (and occasionally even to their conformist citizens who fall out of grace for one reason or another)?I am confused. Let’s see where this book goes from here. I hope to be able to finish reading tonight.However, regardless of how much criticism of this book I might come up with and whether or not I’ll see myself compelled to snip off a star, GO AND READ THIS BOOK.October 21, 2015 — evening.I am now done with page 380; this means that I have finished reading this book.So what can I say? First of all, I would like to express my relief that the last 25 pages contain no more horror details. I don’t wish to include spoilers. So just let me say that a lot of things happened already in the previous pages—changes in government and the like. But now, guess what! The President of the United States has STARTED A WAR WITH MEXICO—no, not because of illegal immigrants, and not even because he wants to build a wall on the Mexican border and the Mexican government refuses to pay for it. (There wasn’t even any talk about Mexicans raping American women. Instead, there are songs about American soldiers having fun with Mexican girls.) No, it is something else. Oh gosh! I forget what this war is for, but it doesn’t really matter. The underlying cause is that the President of the United States and his Secretary of War (plus a few other government officials) consider the Mexicans inferior, and inferior people shouldn’t be allowed to own a country. As I said, I don’t quite remember the official reason.And now what? Well, I won’t give away the end. It is a bit inconclusive, and I am not too impressed with it. So don’t expect a happy end. Who expects a happy end anyway with a book like this one? Let me close with an uplifting thought: In the 1930s, there were no nuclear weapons. Thus, no one, not even Hitler, would be able to produce a total Armageddon. So don’t worry about the ending of this book. It can’t be all bad.Today, however, there are nuclear weapons, and a WWIII will, most likely, be the war to end all wars, except maybe for insect wars. (I hear that insects are more resistant to radiation than mammals.)Now, where was I? Allow me. I am a senior, and seniors occasionally lose their train of thought. I wanted to close with an uplifting thought. That’s right. O.k.! So let’s return to the title of the book. It says: “IT CAN’T HAPPEN HERE”. (I decided to leave the rating at 5 stars. The general message of this book makes up for the flaws.)P.S. February 9, 2016: After the primary results in New Hampshire, I am afraid, \"IT CAN HAPPEN HERE.\" Time to start doomsday prepping.P.P.S. November 9, 2016: \"IT HAS HAPPENED HERE.\""}, {"userName": "Lyn", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "It Can’t Happen Here is Sinclair Lewis’ political satire and propagandized account of the rise of an American fascist. Perhaps most compelling is the fact that Lewis wrote the book only a couple of years after Hitler’s rise to power (and 13 years before Orwell’s 1984). Lewis was an astute and keen observer of political power and was a canary in the coal mine for a world that would soon know much grief. Considering that Lewis published this in 1935, it is eerily uncanny the way his fictitious predictions about American despotism would four years later parallel the Nazi blitzkrieg. Also noteworthy is Lewis’ ability to create a uniquely American dictator, not a swastika brandishing Teuton or an Italian variety autocrat, but one who rises to power quoting folksy barbs and appealing to the New World everyman. Also, this is an endearing call to arms for people to stand up to tyranny, even in the early stages and to be wary of the societal symptoms of fascist beginnings. Finally, this is simply a good story told by a brilliant writer, this being published 5 years after he had received his Nobel Prize in literature and generally considered the best of his later work.Recommended."}, {"userName": "Rick", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/3163480-rick", "userReview": "I have always thought that if fascism ever came to America it would come clothed in red, white, and blue, with patriotic songs, and quotations from founding fathers. It would be nationalistic. It would extol military endeavors and elevate soldiers to the level of heroes. It would handle the race question in subtle yet effective ways. It would join forces with conservative Christian churches and begin to make life hard for anyone else. It would give free reign to the rich, the powerful, and the political supports they enjoy. It would ignore democratic ideals and replace them with a kind of Americanism that encourages love of country over love of people. Make no mistake, American fascism is possible with just the right rhetoric and influence.Sinclair Lewis' book, It Can't Happen Here, portrays just such an America. His distopia is set in the 1930s, depression years during which extreme solutions to economic problems were abundant. But if you think it can't happen here, and now, think again. They won't call it \"fascism\" of course, but we already have Americans who think this way."}, {"userName": "David Schaafsma", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "“The conspicuous fault of the Jeffersonian Party, like the personal fault of Senator Trowbridge, was that it represented integrity and reason, in a year when the electorate hungered for frisky emotions, for the peppery sensations associated, usually, not with monetary systems and taxation rates but with baptism by immersion in the creek, straight whisky, angelic orchestras heard soaring down from the full moon, fear of death when an automobile teeters above a canyon, thirst in a desert and quenching it with spring water—all the primitive sensations which they thought they found in the screaming of Buzz Windrip.\"--LewisI only just now finished listening to over 14 hours of this book, which I read for the first time, and found amazing--initially almost cartoonishly funny, and slowly, gradually scary, and then at times turning to horrific. It can happen here, Lewis said, in 1935, watching the rise of Hitler, as Brecht said also in The Resistible Rise Arturo Ui, and Orwell said in 1984, and so many others have written over the last several decades, including Roth's The Plot Against America. These stories exist because fascism is possible; some like Lewis in the thirties saw tendencies not only in Germany and Italy and Russia for the support of dictatorship, but in America, too, in movements they saw toward isolationism, xenophobia, anti-immigration, nationalism, and so on. Lewis tells the story of a journalist and his family fighting Windrip and largely losing the fight, though what he says against the politician makes so much sense to us. We can't believe such a buffoon as Windrip would get elected and then turn his own military and media and government on not only his detractors but some of the very people who elected him on the basis of false promises against them. I think Lewis had in mind Huey Long as a partial model for Windrip.I had read Lewis's Main Street and Elmer Gantry, which I loved for their social satire, his skewering of hypocrisy, but in this book, published after his much deserved Nobel Prize, I think this just might be his greatest work. As I said, it started out as social satire, where you smile and laugh a lot at his wit, and then it actually turns out to be very moving in places. Bravo. Highly recommended. It looks like a lot of people are reading anti-fascist books now, which is good. This is a good one to consider in that bunch."}, {"userName": "Susan", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "Written in 1935 this novel has had a sudden resurgence due to world events which somehow seem eerily similar. The story tells of the rise of the next President of the United Stated – Berzelius ‘Buzz’ Windrip, mostly through the eyes of small town journalist, Doremus Jessup (there are some very unusual names in this novel!), his family and local community. Obviously, this novel was written during the time of rising fascism in Europe and the author has cleverly taken those events and the complacency of people to believe that dictators cannot happen ‘here,’ wherever ‘here’ is. So, we have the bullying, bluff, pretend humble, opinionated Buzz Windrip (sound familiar) whose every outrageous, offensive comment is instantly forgiven by his adoring followers (again….) as he pushes and shoves his way to the top, with the help of a shadowy puppet master and a horde of thugs, named the ‘Minute Men.’Windrip is charismatic and power hungry; promising to restore the country to prosperity and greatness and assuring every ‘real’ citizen (real by his definition, obviously) a sum of money, from $3-$5000 a year. One of those hoping to benefit from these promises is Shad Ledre, who works for Doremus Jessup. Sly, lazy and vicious, he uses the new regime to rise to power and lord it over those who were nominally in charge before the changes. For soon there is a new balance of power and attacks on academics, the judiciary and the press.This is a really thought provoking novel about listening to false promises and accepting those attacks on freedom which are taken for granted, until they are no longer there. It has a lot to discuss and is a perfect read for book groups, particularly in the current political climate."}, {"userName": "Julie", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "It Can’t Happen Here by Sinclair Lewis is a 2014 Signet publication. I’ll give you three guesses as to why this book showed up on my TBR list, and two don’t count. Originally published way back in 1935, Sinclair Lewis’s novel seemed to transcend time and is a constant reminder what can happen if we are too complacent or too timid to make our voice heard. There is no need to go over the context of this timeless classic, as it has been analyzed many times over by people far more prolific than myself. I don’t think one must be hit over the head with a brick to see the parallels of this book and our current political atmosphere in the US, which is why there has been such a renewed interest in it recently. If you haven’t read the book, I hope you will consider doing so, and if you have read it, a second look at this stunning cautionary tale may be long overdue. It should be noted that the story is dated, and is meant to be satirical, but the core lesson is one that remains as valuable today as it was when it was first written. 4 stars"}, {"userName": "Jim", "userReviewDate": "Jan 12, 2008", "userURL": "http://www.goodreads.com/user/show/775366-jim", "userReview": "This extraordinary novel from 1935 predicts with uncanny accuracy the American political situation of 2016, and has authentic and frightening warnings. Sinclair Lewis satirizes with biting humor the potential for America to fall to populist demagogues with nothing to say but what people want to hear, and of the terrible consequences of the people's naïvete. A must read."}, {"userName": "Bam", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "This is a fitting fictional follow-up to the weighty nonfiction book The Origins of Totalitarianism which I've recently read. Written in 1935 in the midst of the Great Depression and the volatile political situation taking place around the world which facilitated the rise of demagogues like Adolph Hitler and Benito Mussolini, Sinclair Lewis asks the question: CAN IT HAPPEN HERE IN AMERICA? And the answer he provides in this book is YES, IT CAN!Set in Vermont beginning in the year 1936, the main character is Doremus Jessup, born in 1876, who is the owner/publisher of the local newspaper, The Informer. He warily watches as that year's presidential election unfolds. The most popular candidate is the folksy senator and consummate actor Berzelius (Buzz) Windrip who travels around the country with a group of marching men wearing old-fashioned, patriotic uniforms--he calls these his 'Minute Men.' At the beginning of his campaign, he issues a proclamation: The Fifteen Points of Victory for the Forgotten Men, which includes the takeover of the banks and workers unions, freedom for Christian religions only, declaring Communism and Socialism high treason, setting a cap on annual income, taking away the rights of Negroes to vote and women to work, and giving every family $5o00 a year. That last one is probably what gets him elected, as so many people had been out of work for several years. \"The Senator was vulgar, almost illiterate, a public liar easily detected, and in his 'ideas' almost idiotic.\"Immediately upon winning the election, he arms his Minute Men militia (his Gestapo) while enlisting more recruits, who help him swiftly take over the entire government--including Congress and the court system. Jessup has two choices--to either lay low or speak his mind about what is happening. When he decides to publish a scathing editorial about the government, he is arrested and taken to jail, where he is given 'a trial' before a judge appointed by the government. His son-in-law comes in to protest his treatment and is summarily taken out and shot. Jessup is allowed to go free on the condition that he allows his newspaper to be taken over by the Corpos, as they are known, and works with their representative to publish a government-friendly paper. Jessup puts up with this humiliation for awhile but then quits and joins a new underground movement which helps dissidents escape to Canada, and he secretly publishes a protest newspaper called Vermont Vigilance with like-minded friends--which could land him in a concentration camp or worse, if caught. Some 80 years later, this is still very much a book of warning about the dangers that threaten our democratic institutions if we are not ever vigilant. Although not great literature, it is filled with satire and irony and does put our current political situation into perspective. Hopefully, it can also inspire us as citizens to get more politically active and work for what we believe is right. Read it and be warned!"}, {"userName": "Jason Koivu", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "It can. It is.This book is the Nostradamus of our political past, present and potential future. Check out GoodReads' stats for It Can't Happen Here: https://www.goodreads.com/book/stats?...If you're viewing those stats in the future, when the graph no longer covers as far back as 11/8/2016, you will have missed the HUGE spike in activity on this site for this book. Prior to the momentous astounding absolutely fucking unbelievable election of 11/9/2016, interest in this book was hauling in pedestrian numbers, being shelved as to-be-read around 8 to 12 times a day on average. The day Trump was elected it shot up to 174 and has remained in the dozens, if not hundreds, ever since. Why? Because It Can't Happen Here, a book written in 1935, parallels almost precisely what is happening right now. At times it's eerily similar. Political tactics, attitudes, slogans, etc etc, so much of it mirrors what is being said and done here and now, on both sides of the left/right coin. You know all about it already, so why read the book, right? I mean, after all you're living it. Well, perhaps your eyes aren't as open as you think they are. In fact, that's a big part of the problem. So, open them up and read this book...before it gets burned."}, {"userName": "Maru Kun", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/6816078-maru-kun", "userReview": "UPDATE: Dorothy Thompson, Sinclair Lewis's wife at the time, wrote an article  Who Goes Nazi?, where she guesses which of her fellow Americans at a party would become Nazis if given the opportunity. Well worth a read and a parlour game well worth reviving.To give you the flavour, looks like Trump was at the party:\nI think young D over there is the only born Nazi in the room. Young D is the spoiled only son of a doting mother. He has never been crossed in his life. He spends his time at the game of seeing what he can get away with. He is constantly arrested for speeding and his mother pays the fines. He has been ruthless toward two wives and his mother pays the alimony. His life is spent in sensation-seeking and theatricality. He is utterly inconsiderate of everybody. He is very good-looking, in a vacuous, cavalier way, and inordinately vain. He would certainly fancy himself in a uniform that gave him a chance to swagger and lord it over others.\nThere is no better time to read this book than right now, except maybe for this time next year.The story in Sinclair Lewis’ “It Couldn’t Happen Here” is a familiar one: fascism comes to America through the ballot box and the path first trod by the Nazis is faithfully followed.These days we have learnt the lessons of history and look with suspicion at grandstanding debates and at political rallies filled with bright lights, loud music and low-level violence. But in this age these are no more than a diversion from the natural home of a new American fascism.Different from the fascism of the Nazis a modern American fascism would be born not in the democratic process but rather in the law. It would take its first steps far away from the noisy rallies and safe from the glare of public attention in the grey offices of corporate lobbyists and in the proceedings of dull committees. A modern American fascism would be a tyranny of the legal opinion, an oppression of the outsourcing contract, a dictatorship of the draft regulations.In dull back rooms mediocre lawyers would write legal opinions justifying torture and the majority of the public would support its use. Police would be given legal powers to seize property on spurious grounds and retain it for their own enjoyment (Canadian citizens would be warned by their state broadcaster not to travel with large amounts of money in the US). In drab state courtrooms judges would supplement their salaries by sending innocent children to jail. Prisons run for profit would be indistinguishable from concentration camps. Inmates would be sentenced to decades in jail for trivial crimes where they would be forced to work to supply goods for nominal wages.“It Couldn’t Happen Here” was extremely popular when it was first published, so deserves recognition for the public debate it created in its time. It would need a thorough re-write before it could fulfil the same role in our more complex and subtle but no less dangerous age."}, {"userName": "Mike", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/7272380-mike", "userReview": "The first thing you might want to be clear about when you pick up this novel is that Sinclair Lewis is not Upton Sinclair. Not many people realize this. About a week after November 8 for example, when I dutifully brought It Can't Happen Here up to a clerk at Barnes & Noble, he remarked, \"so you're reading this one and not Oil!, eh?\" It wasn't until I got back to my car that I realized his mistake. Some may doubt my hypothesis, but I'm certain they are two different people. Well, almost certain. Upton Sinclair wrote The Jungle (which I read chapters of in high school US History class) and Oil! (which was turned into a great movie with Daniel Day-Lewis), and ran for governor of California in 1934, while Sinclair Lewis wrote this book, as well as, no doubt, many other novels that I'm probably not ever going to read. Surely no single person could accomplish all of these things. Adding to the confusion, it turns out that Lewis and Sinclair knew each other, and that Lewis gave Sinclair a (unflattering) guest appearance in this novel.Having gotten that out of the way, it would be fair to say that Lewis's novel has a number of defects. Don't take it from me, though. Here's a quote from the introduction- you know, the part of the book that is at the very least probably not supposed to discourage you from reading: Unfortunately, the writing displays the haste in which he wrote...many reviewers... complained about the novel's loose, melodramatic plot, flat and even corny characters, weak cliched dialogue, padded political discourse, awkward sentimentality, and heavy-handed satire and irony... I haven't been that motivated to start a book since the introduction to A Critique of Pure Reason hinted that readers of the text tended to experience frequent thoughts of suicide. As it turns out, I agree with all of the aforementioned criticisms. Even the last hundred pages or so of the novel, easily the best and darkest, are still marked by dizzying plot improvisation, scenes that seem more sketched than carefully worked on, dialogue filled with dashes, ellipses and exclamation points, mawkishness, and awkward sentimental humor. I don't doubt that people in forced labor camps are able to find humor in their situations, but the narrator's jaunty remarks about the family dog's not being able to understand English following a scene of torture, for example, contribute to a jarring, schizophrenic tone. The novel's Afterword clarifies that \"the haste in which he wrote\" was from May to September of 1935 (that is, he wrote the entire novel in 5 months), which may explain a few things, but the Afterword also suggests the reason you might want to read this book anyway. One reviewer, I learned, called it \"a vigorous antifascist tract\" if \"...not much of a novel.\" Another wrote, in a formulation I'm not convinced has an actual meaning (but I suppose I get it), presumably referencing two of Lewis's former novels, \"...it is his worst book since Elmer Gantry; I think it is also, and more truly, his best book since Arrowsmith.\" A Marxist magazine called it a \"...tremendously useful book.\" And so on. Point being that reviewers in general seem to have agreed that you read this book not for stylistic excellence but for its ideas; and people probably tend to read it more often at certain historical moments than others. I can't say I was surprised, for example, to find that Buzz Windrip ranks pretty highly in the index of Fictional Dictators Whom Donald Trump Most Resembles. Windrip, whom Lewis based at least in part on Huey Long (as well as Mussolini and Hitler), rises to power on a platform of economic populism (one of his campaign promises, for example, is taken from Long's plan to seize all personal annual income in excess of $500,000 for use by the federal government; it's made pretty clear, incidentally, that it's not so much that the working class who vote for Windrip- and eventually get screwed, of course- are passionate about fascism, but may be deluded about its true nature, and hey, the system hasn't been working, so they might as well give someone unconventional a try...it's the lasting economic effects of the Great Depression, however, that really seem to give Windrip his opening), xenophobia, and a non-specific mishmash of contradictory ideas and slogans; he has a hypnotic effect on crowds, holding mass rallies at which he whips them into orgiastic frenzies of nationalism (even if the people who go to the rallies never seem able to remember the details of what exactly he's said), and maintains a symbiotic relationship with a guarded, calculating, shadowy advisor who plans everything from the shadows- and who in turn needs Windrip's unconscious animal talent for demagoguery. Moreover, I think Lewis has intelligent things to say about the nature of fascism, and the difficulties in responding to it. One reason supporters of different political parties in Lewis's novel argue over minutiae instead of banding together to fight Windrip is that they lack the experience of fascism and treat it with more fairness and less caution than it warrants. Since they believe in fairness and making arguments in good faith, they believe that at some level everyone else does as well. But fascism is only a political position in the sense that someone coming up behind you in a bar and smashing a glass over your head is a form of argument. A willingness to extend a fundamental decency and benefit of the doubt to opponents, while an admirable quality, may be a handicap when it comes to dealing with fascism, and hints at why people like Marat, Lenin or Mao were often more brutal and autocratic than the governments they helped overthrow. Fascism doesn't breed softness; it changes people, and Lewis makes a point of demonstrating this through his characters. He captures some of the identifying features of fascism- sadism, yes, but it is also so cartoonish, so self-evidently absurd and stupid, that it can be difficult to take seriously- and therein lies part of its danger. The title of the book is not exactly subtle, and, just in case you didn't get it, Lewis scatters straw men throughout the early chapters to guffaw, in one case the exact words, \"...it can't happen here.\" The natural instinct is to not let yourself be the same kind of sucker, whistling past the graveyard. But while it may be happening here in the US (as well as, in various stages, in the Philippines, Turkey, Hungary, Russia, China...), and while Lewis's book is prescient, it's hard to imagine it happening here in quite the way the book describes; things seem even stranger and more complex these days, and the novel that imposes some sense of order on it all has perhaps not yet been written."}, {"userName": "ALLEN", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/58158333-allen", "userReview": "Sinclair Lewis's polemic novel, 1935's IT CAN'T HAPPEN HERE, foresaw a dystopian 1936 when a demagogic New England politician, Berzelius (\"Buzz\") Windrip, seized control of the United States of America and ineluctably imposed a fascist-style dictatorship on the nation. To compose this 350-page playout on the theme of \"Yes, it CAN happen here, and here's one way it could,\" Lewis put away the swift, raucous satirical style of his best-known and most commercially successful novels of the 1920s that had served him so well in BABBITT, ELMER GANTRY, ARROWSMITH and DODSWORTH -- in favor of a more traditional, yet as it turned out sometimes ponderous, character exposition and development. Inside this suddenly-timely 350-page book is a 250-page novel struggling to get out. This probably accounts for the boredom-verging-on-disillusionment that some readers have felt in the novel’s first third, and may wonder about its flashfire emergence from the grab-bag of Great Depression ephemera. It’s almost unheard-of for an 82-year-old work of fiction to trigger an extra printing based on consumer demand beyond the modest needs of American Studies students and Lewis completionists and that alone, as they say, is news -- it was ordinary Americans suddenly confronted with “Could it happen here? Really, could it?” So, how well does this book work as polemic? And to what extent can it be seen as an unwitting anticipation of 2016 campaign that brought Donald Trump to power? More than well enough to be notable, or so it seems to this observer at so many decades’ remove. \"Buzz\" Windrip was no city slicker, though: in this novel he bursts into national attention after obscure political beginnings in a politically insignificant backwater, which even casual Thirties readers immediately recognized as the story of Huey Long, transplanted by Lewis from redneck Northern Louisiana to the decaying mill country of inland New England. The methods Windrip used to secure the Presidency, the people who helped him, and the irresistible agglomeration of interest groups that brought him to victory, were deliberately ( but not exclusively) patterned after Twenties Italian Fascist and early-Thirties German NDSAP (Nazi-party). (Consider that such history is far from dust: the Nazis worked in such then-emergent, now “modern” techniques as targeting under-appreciated parts of the electorate to their eventual success.) Windrip and his \"Corpo\" regime understand the distinction between persuasion and conviction in the solicitation of votes, know how to wheedle and threaten as occasion demanded, showing only when necessary the iron fist of thuggery inside the all-American velvet (cotton?) glove of populism, until he and his gang take power and the country slides irresistibly into totalitarianism. As Lewis’s hero/mouthpiece, Jessup is astute at unpacking Windrip’s pithy, yet ultimately meaningless slogans, though even Lewis can’t really surpass the rhythmic vapidity of Huey Long’s “Every man a king, but no man wears a crown.” Yet Windrip's appeal was undeniable, not least from the fact that he promised, once in office, to guarantee each American household five thousand dollars per year ($90,000 in 2017 money). In poly-sci matters in this novel -- sheer well-informed background and logic and vote-counting -- Lewis was vivid and precise. Other, more “novelistic” concerns either didn’t work as well as in the Twenties or were jettisoned under the weighty necessity of making well-reasoned attacks against the apparent charm of a fascist-style takeover. The Dickensian fizz of George Babbitt's neighbor T. Cholmondeley Frink in the eponymous 1922 novel, who becomes \"Chum Frink,\" poet for pay to the masses, works well. In this book, Berzelius (\"Buzz\") Windrip is a passable moniker for an evil man, but how can we hold up \"Doremus Jessup,\" small-town, liberal humanist, newspaper editor, to \"Seth Buswell\" in PEYTON PLACE or even \"Gail Wynand\" in THE FOUNTAINHEAD? We can't. Clunky name or not, Jessup is a well-intentioned, well-educated and well-traveled member of the American middle class, New England (hence: fundamentally) small-town American, likeable to a fault -- Lewis’s better version of himself. His character is well enough established, though it took Lewis a while: it took much more time than the one-dimensional object for satire of a George F. Babbitt, say or an Elmer Gantry. Not only does Lewis go on too long in this exposition, his mouthpiece Jessup goes on too long when he talks politics. Jessup's speechifying in the parlor and editorializing in print grind the action of this novel to a halt, a constant threat in even the most well-meant “novel of ideas.” Contemporary reviewers noted the threat of fatigue possible under Jessup’s (and to a limited extent, others’) recurrent attacks of logorrhea. Yet I stress it isn’t the ideas or language in this book that are difficult to comprehend, only that our patience is tried by their frequency and severity. What Jessup has to say makes perfect sense; his fellow New Englanders usually don't have the time to listen. So, is IT CAN'T HAPPEN HERE at times a tiresome book? Yes, but only for a while. An overstated book? Maybe. But the reader’s perseverance will be rewarded as the first third ripens into the violent middle third and the tragically inevitable final third as America slips into totalitarianism. In actual history, Franklin Roosevelt smoothly steamrollered nice-guy GOP moderate Alf Landon in the 1936 election. Of course, we cannot really know for sure what is going to happen in our country's near future, but Lewis’s novel for all its early awkwardness makes for a compelling “alt-history” and is well worth the time to read and discuss. Resistance may not be futile, but comparisons are inevitable. **************"}, {"userName": "Kyriakos Sorokkou", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/5927877-kyriakos-sorokkou", "userReview": "Ο Σίνκλερ Λιούις ήταν ο πρώτος Αμερικανός συγγραφέας που κέρδισε το βραβείο Νόμπελ Λογοτεχνίας (1930) αλλά λίγο πριν την προεκλογική περίοδο του κυρίου Τραμπ, ήταν άγνωστος στους περισσότερους από εμάς.Με το εκλογή του κυρίου Τραμπ ως προέδρου των Ηνωμένων Πολιτειών οι πωλήσεις αυτού του βιβλίου εκτοξεύθηκαν στα ύψη.Πολλοί λένε ότι αυτό το βιβλίο προέβλεψε την προεδρία του κυρίου Τραμπ.Δεν γίνονται αυτά εδώ έλεγαν πολλοί, ανάμεσα τους κι εγώ.-Αποκλείεται να βγει πρόεδρος ένας τύπος που τον είδα να χτυπιέται με άλλους σε ρινγκ στο WWE. Και όμως βγήκε.Τα ίδια έλεγε και ο πρωταγωνιστής του βιβλίου Ντορέμους Τζέσαπ: ότι αποκλείεται να βγει πρόεδρος ένας λαϊκιστής, δημαγωγός, ρατσιστής, όπως ο Μπερζέλιους Γουίντριπ.Αλλά όμως βγήκε:Διαβάστε τη συνέχεια στο μπλογκ μου  ΒιβλιοΑλχημείες"}, {"userName": "Nancy Oakes", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "Given what's going on in American politics right now, this book wins my prize for most frightening read of 2016. Sorry if you don't like my use of the \"p\" word, but it is what it is.To put the novel in its historical perspective, I turn to an article in the New Yorker written by Alexander Nazaryan (October 19th of this year) that says\"Sinclair Lewis published the novel as Adolf Hitler was making Germany great again, violating the Treaty of Versailles by establishing the Wehrmacht. Benito Mussolini invaded Ethopia. Things at home weren't much better: a race riot in Harlem, dust storms in the Midwest. President Franklin Delano Roosevelt signed the Social Security Act, but the promise of the New Deal remained unfulfilled for many. The Times, that November, reported on a meeting of the New Jersey Bankers Association, whose president offered a blunt assessment of the national mood: 'America is tired of adventure and anxious,' the man of industry said. The people wanted 'safety and conservatism again.' \" I'm not going to go into any detail here, but the man at the center of American politics in this story is Berzelius (Buzz) Windrip, a seemingly down-home sort of populist candidate who ran against FDR and won, due to his appeal to potential voters who are in agreement with his rhetoric about financial security and anti-immigrant nativism. Once in office, he begins to usher in\" a fascistic regime of suppression, terror, and totalitarianism -- all draped up in red, white, and blue bunting.\" (ix)Standing against Windrip is (dare I say it?) the liberal media, here represented in the character of Doremus Jessup of Fort Beulah, Vermont. Jessup completely gets what's really going on and feels a deep need to channel his outrage into some sort of action. As things continue to get worse, as institutions designed to safeguard American democracy are shut down one by one, well, you get the drift.The novel reveals how it can happen here, but much more interesting to me was watching one character in particular, Shad Ledue, Jessup's very unhappy former handyman, \"the kind of vindictive peasant who sets fire to barns.\" Ledue is part of the working-class poor who feels he's not been given proper respect by his employer, so galvanized by Windrip's rhetoric, he throws in his lot with Windrip and the single political party the Corpos, and starts moving up the ladder of power with revenge against Jessup his number one priority. Considering the huge number of page tabs I stuck in this book, I obviously I found plenty to think about here, and I could easily talk about this novel for hours. But I won't. I read this book through a day and an entire night -- no way was I going to put this one down before I finished. The knots in my stomach got tighter and tighter -- quite frankly, I had a full-blown, serious case of paralyzing fear reading this book, and when the election came and went, well, it all came back to me again, making things even worse. Even now, nearly a month after I finished it, it still has that same power. It continues to stay active in the back of my head, making it a book worthy of every second of reading time I put into it. Not many novels can do that, quite frankly.Someone said to me some time before the election that if things went a certain way, reading this book would be \"moot,\" to which I say pish-posh, you're wrong. Lewis wrote this novel as satire, and according to the introduction to this novel, It Can't Happen Here \"gave shape\" to a number of \"anxieties\" people faced during the 1930s, so it's very much a novel reflective of its time. And as I replied to said person, good literature is never moot. If a book written some eighty years ago can weigh so heavily on the mind because of what's happening in America right now, well, that's one hell of a story, and by no means moot."}, {"userName": "Montzalee Wittmann", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "Describes our times and predicts a terrifying possibility...mix it with 1984 and it is right on target!"}, {"userName": "Susan Stuber", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/22227336-susan-stuber", "userReview": "I give this five stars, not because it is particularly well-written, but because it is such an important book that really everyone who is concerned about present current world affairs should read. Apparently, before sitting down to write the book, which he did in less than five months in 1935, Lewis did a lot of intense research on how facism rises and works once it is established. Parts of the book may seem tedious to today's reader, because his fictional political characters are almost all surrogates of then real politicians, the majority of whom we are no longer familiar with. The main characters are almost caricatures, but in fact when you look at our last election, the candidates do seem like caricatures, too. There is almost a surreal quality about, in particular, the president elect. What sends ice water through your veins with this book are the parallels you see if you simply substitute the Republican candidate's name with \"Trump\" and the Democatic's with \"Clinton.\" One might accuse Lewis of grossly exaggerating in this book. And yet, if you look at the historical outcome of facistic regimes, then you have to admit, he actually foresaw a lot that was to come.Lewis does a good job of explaining what facism is and how it can come from the left or the right. He also does a good job of illustrating the ideology of the then American Communist Party and why large swaths of the population became zealous supporters of the authoritarian cum facist leader. Today this book would probably be edited so that it would shrink by about a third; I did do quite a bit of speed-reading through certain parts that were repetitive or getting bogged down, but in general I would say it is a good read with a good story line. \"It Can't Happen Here\" was also made into a theater production. It was set to be made into a movie, but was stopped at the last minute because the producers feared a backlash from countries or politicians who might be irritated by it."}, {"userName": "David Sarkies", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/5856247-david-sarkies", "userReview": "The Rise of an American Dictatorship7 April 2012\tI discovered this book after reading a collection of interviews by Howard Zinn where he described it as a warning about how the United States could become a fascist dictatorship. Zinn's argument was that the US is already heading down that road, though it has not quite reached that point at the time of the interviews. When comparing the United States as outlined in this book and what we perceive today I would also suggest that we have not yet arrived at that point and would also suggest that we may still have some time to go as well. In this review I will begin by discussing this book itself and then consider some comparisons with Ancient Rome.\tThis book was written in 1935, a crucial point in 20th century history. The Great Depression was ravishing the western world and millions were unemployed relying on food stamps and whatever job that they could get. One of the things that is mentioned over again is how stockbrokers and accountants have been relegated to jobs that involved digging ditches. In Germany the situation had become so dire that the population had become radicalised and Reichstag consisted of ultra-right Nazis and ultra-left communists. Hitler had allegedly created a panic by burning down the Reichstag and then used that panic to secure his position of power. Things quickly changed as elections were abolished and the storm troopers were put onto the streets to keep order. Germany had ceased to be a democracy and within a few months had become a dictatorship. By the time It Can't Happen Here had been published, book burnings were sweeping Germany, Hitler had purged all of his enemies and perceived enemies, and the Jews and other undesirables were being rounded up and imprisoned.\tSo, we jump over the Atlantic to the United States. 1936 would be an election year, and Lewis no doubt wanted this book released to coincide with the lead up to the election. This would not be the last time this happened as numerous books were being published in the leadup to the 2004 election in an effort to prevent Bush from being re-elected. Obviously that did not happen in 2004, but we should continue to hold that period in our mind as this will become important. The reason I say this is because this book was reprinted in 2005, ironically during a time when political polarisation was once again beginning to sweep the United States. However there is a difference between this book and many of the others. It reminded me of Upton Sinclair's The Jungle in that it is a political commentary using a prose story as a vehicle. Come 2004 and we do not see much literature like this but rather collections of non-fiction books that simply provide a list of case studies as to how Bush is a bad president who cares only for the interests of his corporate backers.\tLewis shows us how it is possible for the United States to become a dictatorship and how easily this could happen. Obviously the soil has to be right for such a system to grow, and that soil was more than evident in 1935. We were in the midst of one of the greatest economic downturns that the modern world had experienced, capitalism had effectively collapsed, and millions were out of work. In Germany they wanted a saviour and that saviour was Adolf Hitler. In the United States they wanted a saviour, and that saviour was Roosevelt, however Lewis seems to flag the proposition that Roosevelt, in his four years in office, had done little to relieve the suffering of the population. As such he creates a new politician, a Democrat, named Buzz Windthrip, who comes to prominence promising $5000.00 a year for everybody and to return the United States to its former glory. People are caught up in the hype, Roosevelt is sidelined, and Windthrip is elected president.\tWindthrip is modelled on Hitler, and the methods that he uses to seize control are more than possible. In one of the chapters Lewis outlines Windthrip's manifesto, and while reading it one questions how Windthrip could conceivably breach the constitution by putting the manifesto in place as one continues to read one can see how this is done. Like Germany, Windthrip establishes his own secret police, the Minute-Men. This name harkens back to the rebellion, where a fledging republican army was being created using the name Minute-Men. They were called as such because they could be armed and ready to fight in a minute. By creating the Minute-Men, Windthrip is conjuring up the revolution, and the changes and freedom that it brings.\tNow the United States constitution allows militias, though one should remember that it refers only to lawfully constituted militias. The MMs begin their life as a group of people who like to parade in uniform, however upon his election, Windthrip uses his executive powers to make the MMs a lawful militia. He then uses the militia to shut down congress and the supreme court. All who are considered hostile to his regime are arrested and shot, and those that are ambivalent are put in protective custody. By the time everybody wakes up they discover that the MMs have been elevated above the police and the army and that democracy has died.\tThe book shifts perspectives between what is happening at a federal level and the small town experiences of the newspaper editor named Doremus Jessup. Jessup is watching events unfold from the view of a liberal leaning newspaper editor. This is a bad situation to be in because one of the things that the regime seeks to control is information. A rogue newspaper editor is a dangerous person, so Jessup finds himself caught in a situation where if he were to continue he would get into a lot of trouble, and if he were to capitulate he would be denying himself. Also we see how the people of Fort Beulah react to the changes. A number get themselves moved into administrative positions, while other attempt to resist the changes. It is clear that the bullies are using this as an opportunity to promote themselves and their own fortune. We also note how they use fear and spying to maintain control. It is a method that is even used today to maintain control in some groups. The impression is given that if one were to 'dob' on somebody else then the dobber will receive a reward, and control is maintained. However the catch is that the 'dobber' is never truly rewarded, but rather given the impression that they are now in the leaders good books. As such it creates distrust amongst the group as nobody knows who is going to tattle on them.\tAnother theme that comes out is how in reality extreme left and right are not necessarily the opposite but rather the same. If you take Nazi Germany and Communist Russia for instance. While ideologically they were the opposite, in reality they were the same. Both were dictatorships, both maintained order through a system of secret police, and both kept the populations oppressed and marginalised. The difference is that in Russia the means of production were in the hands of the state while in Germany the means of production where in the hands of a small group of oligarchs who were in the pockets of the government. As such, there was no difference, and as such this is why people are looking back at that period. Lewis uses the term Corpoism, whereas nowdays we call it corporatism. It seems that modern business is run by a handful of oligarchs connected to the government. If a law upsets the oligarchs, the government will not be able to pass it. We have seen that today with the influence of the oil barons, the health insurers, and the fast food magnates, as well as the media enterprises. Even closer to home in Australia, we see this with the Mining Tax and with the Carbon Tax.\tOne of the best ways to attempt to understand the historical forces at play is to compare and contrast these events with past empires and powers. While there is a contrast between 1935 and 2004, there are better comparisons elsewhere, namely with Athens and Rome. With regards to the Bush regime and the Windthrup regime, we see differences with regards to the MMs. Bush did not have his own private army on the streets, and while he did attempt to establish a secret police in the form of the department of homeland security, he never went to the extent of rounding up dissidents. Well, there were arrests arising from the anti-Bush and anti-war protests, but there was no rounding up the anti-war establishment and confining them to concerntration camps. In the end, if it was not for September 11th, then the Bush Administration would have unlikely moved in the direction that he did. If the US is moving towards a corporate dictatorship, it is a slow move. All that really came out of it was endless rhetoric, ridicule of those who did not agree, and military intervention on foreign shores. In the end, the worst we got was 'if you are not for us, you are for the terrorists' though nobody was ever locked up for waving a placard on the streets of New York City stating 'no blood for oil'.\tAs for further back, let us consider Athens and Rome. The Athenian democracy probably lasted about two hundred to two hundred and fifty years before it collapsed. Even then, the period of the Thirty Tyrants lasted only a short time before democracy was restored, however this period was what I considered to be the end of the Classical Period, in that supporters of the Thirty Tyrants were rounded up and executed (Socrates being amongst them). This act in and of itself signalled the end of Athenian democracy, and the trigger that brought about its collapse was it's imperial ambitions. It wasn't even the Peloponesian War that brought about its end, Athens could have held out for much longer than it did, if not for the disastrous Sicilian Expedition. As I have indicated elsewhere, the events of the Peloponesian War are uncannily similar to the events of the modern era.\tThe second place we look at is Ancient Rome. The republic lasted much longer than Athens, about 450 years, before it finally collapsed to become a dictatorship. However it wasn't a sudden move, but a gradual shift as the government sought to bring in more and more checks and balances to attempt to restrain the power of any single person. However, with the checks and balances in place, nothing could be done. Rome had not had an easy time as a Republic, and as the government began to grind to a halt as the interests of the plebians and the patricians clashed, people would step up and attempt to bring Rome back on track. It is noticeable that both pre-imperial dictators (Sulla and Ceaser) both appealed to the populace against the patricians. It was the same with Augustus, who brought himself to power on the backs of the plebians. While one may suggest that compared with Rome, the United States still has a way to run, if we compare it with Athens, it has already entered the end game. Further, in comparing the United States with Rome, we uncannily find ourselves looking back to Germany of the 1930s, where the totalitarian government (as is the case in this book) rose to power on the backs of the people. In the end, it is not the corporate cronies that we should be wary of, but rather those who reach out to the people and convince the people that they are out to support their interests. One never realises that a populist government will transform into a dictatorship until it has already happened."}, {"userName": "Holly Wood", "userReviewDate": "Mar 09, 2009", "userURL": "http://www.goodreads.com/user/show/1937164-holly-wood", "userReview": "I had a professor tell me once that this is the distilled version of a middle-class academic's fears of what would happen during an American holocaust. More so than anything else, they fear the \"ignorance\" of the working class, bitter from being stepped on for so long they would quickly embrace anyone promising them any sort of redistribution. The lesson is never to fear the poverty that is the source of social problems, but to fear the symptoms.And you know what? I agree with him. No matter how you cut it, this book is pretty classist. However, moving away from that, the book itself is an interesting read. I enjoyed it for the exercise in creativity. You do read the book and wonder what it would be like if it hadn't been FDR and instead, in his place, someone who embraced fascism as a means to cure the Great Depression. I found myself more than once struck by how applicable some of the commentary was to modern times. Words written over 70 years ago might have easily been heard yesterday on Fox News. In many ways, those passages were actually pretty frightening, to be honest.I really recommend this book. It's thought-provoking and timely."}, {"userName": "Terri Jacobson", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/8370501-terri-jacobson", "userReview": "I listened to the audiobook read by Grover Gardener and produced by Blackstone Audio, Inc. This book was written in 1935 and has surged in popularity in America since the election of Donald Trump in 2016.Doremus Jessup, a newspaper editor, is concerned about the upcoming American election. Berzelius \"Buzz\" Windrip is running on a populist platform, and Doremus is concerned about his campaign. Windrip promises to restore America to glory and world power. He promises to save the people from crime, drugs, sex, welfare cheats and, of course, the liberal press. He defeats FDR and wins the presidency. Once elected, Windrip organizes a personal paramilitary organization--the \"Minute Men\"--who begin to terrorize the population. Soon there are book burnings and concentration camps, and a free press is a distant dream.How can you not see the relevance of this book at this time? Some of the quotations in the book apply directly to DJT:The public wanted a ringmaster and a revolutionist.People will think they're electing him to create more economic security. Then watch the terror! God knows, there's been enough indication that we CAN have tyranny in America.At the time of publication, it was felt that this story had a parallel in the life of Huey Long, a southern politician who was assassinated before the 1936 election.I'm giving this book 3.5 stars rounded up to 4. The timeliness and urgency of the story kept me interested. Towards the end of the book it slows a bit, but this is an absolutely excellent reading experience."}, {"userName": "Ted", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "My guess at Amazon sale positions say a couple years ago: ** #25,000 in Books > Literature & Fiction > United States > Classics #5,000 in Books > Literature & Fiction > Genre Fiction > Political #50,000 in Books > Literature & Fiction > Classics- - - - - - - - - -I guess my rating can stand in for a review at this distance in time since I read it. Anyway, we all understand that the book has achieved a new topicality.Currently (June 2 '17) on Amazon: #2 in Books > Literature & Fiction > United States > Classics #12 in Books > Literature & Fiction > Genre Fiction > Political (up 5 in last few days) #48 in Books > Literature & Fiction > Classics (up 18 in last few days)** Estimates based on numbers for William Faulkner's The Hamlet - comparable writers, books far less popular than their best - plus the assumption that the \"political genre\" rating would have been higher than the other two.= = = = = = = = = = = = = = = = = = =Previous review: Ender's Game sci-fiRandom review: Eaarth Making a Life on a Tough New PlanetNext review: What if? SERIOUS SCIENTIFIC ANSWERS to Absurd Hypothetical Questions"}, {"userName": "Jose Moa", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/47021487-jose-moa", "userReview": "This novel,with We,1984,Kallocain and Farenheith 451 set up the great totalitarian distopic novels.In this novel written in 1935 ( it really could happen if Huey Long were not killed,Berzelius Windrip can be considered the alter ego of Huey Long governor of Louisiana ) Sinclair Lewis make a excelent disection of the fascist totalitarian system with all its features of populism,censorship,racism,chauvinism,xenofobia,mesianism,,promises of make the country great again, search of interior and exterior enemies,burning of books and over all ignorance and brutality.In some ways a prophetic novel.A system suffered by millions people,jews and gipsies between them, in Germany,Italy,other countries and specially Spain where we suffered by 40 years (is normal that spaniards of some age are very sensitive with this subject ) that we hope never happen again.Of course the Soviet Union and others were, and some are, genocide ,criminal ,brutal totalitarian systems that play in other team.Is alarming that to day in powerful western democracies, in America and Europe , seem that we are walking another time in the wrong direction , with extreme right wing ,racist, chouvinist ,xenofobic,machist parties that promise make great countries again.It is a pity because as the famous quote says :\"people that dont know the histhory are damned to repeat it\".A great ,specially fitted and reccomended book in this uncertain times."}, {"userName": "Infada Spain", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/20031422-infada-spain", "userReview": "4.5 stars"}, {"userName": "Ε.Χ.Γ. ⚓", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/51299088", "userReview": "\"Για πολλούς ανθρώπους η μόνη τους επανάσταση εξαντλείται στην αναμονή.\" \"Σ' το λέω, κανείς δεν έχει τόσους φίλους όσους ο επαναστάτης. Ούτε και τόσους εχθρούς!\""}, {"userName": "Jason Pettus", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com:]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted illegally.)\"Whenever you hear a prominent American called a 'Fascist,' you can usually make up your mind that the man is simply a LOYAL CITIZEN WHO STANDS FOR AMERICANISM.\" --William Randolph Hearst, October 1935, one month after the release of It Can't Happen HereAlthough it's easily my favorite of all the things I do here, there are nonetheless some frustrations that come with writing the CCLaP 100 essay series concerning literary classics: for example, since I choose only books I myself have never read before, the series is missing an awful lot of major touchstones in literary history; and since I only cover a maximum of one title by any given author, this forces me to abandon a whole plethora of other books I think I would've enjoyed reading as well. Take for example early Modernist Sinclair Lewis, who before opening CCLaP I was barely familiar with at all, but am rapidly growing to admire more and more, the more I learn about him; and although my official selection of his for the CCLaP 100 is the masterpiece Babbitt (which I'll be reading later this year), while researching him I also came across a 1935 book of his called It Can't Happen Here that I found simply impossible to pass up.The book is essentially a speculative novel, taking the real events and popular figures of the 1930s to show just how easy it would've been for a fascist takeover of the United States to happen back then, right in the same period where the same thing had already happened in Germany, Italy, Japan, Spain, Scandinavia, and other places; and although the book has been largely forgotten by now, it actually served as a comeback vehicle of sorts for Lewis at the time of its publication, after having a whole string of hits during the Roaring Twenties but rapidly falling out of favor with the onset of the Great Depression. See, for those who don't know, you can think of Lewis as perhaps the Jonathan Franzen or Tom Perrotta of Early Modernism: possessed with a skepticism towards humanity that knew no bounds, he originally became famous for a series of funny yet scathing novels about the naked hypocrisy of the bland middle class, sleepy midwestern suburbs, and conservative religious groups. (In fact, Lewis is widely considered to have written the very first satire of televangelists ever penned, 1927's Elmer Gantry, which has profoundly influenced every televangelism satire that has come since, although of course such people were technically radio stars in Lewis' day.)At the time, such books were eagerly eaten up not just by bitter intellectuals but also the very self-loathing middle-classers he was making fun of, which again like Franzen or Perrotta made him a hit not only academically but among the beach-and-airport crowd; in fact, he famously won the Pulitzer Prize in those years (for 1925's Arrowsmith) just to infamously turn it down, using the occasion to express his open contempt for everything the Pulitzers stood for, and later in life became the very first American to ever win the Nobel Prize for literature. But the audience for witty yet ultimately gentle parodies of the middle class profoundly dried up after the Great Depression hit -- not just because the middle class virtually disappeared, but because they were posthumously blamed for much of the things that had led to the Great Depression in the first place -- with the audience for contemporary novels turning more and more in the 1930s to such progressive social realists as Nelson Algren and Richard Wright. But of course, Lewis never stopped being bitter and angry through those years, and never stopped writing either; and like many political moderates at the time, he too watched with growing horror as these middle-classers he once made gentle fun of started turning more and more to such dangerous ideologues as politician Huey Long (the Sarah Palin of the 1930s) and media star Father Coughlin (the '30s Glenn Beck), and as more and more business tycoons like Henry Ford and celebrities like Charles Lindbergh started opening singing the praises of Adolph Hitler and Benito Mussolini, who had of course already successfully taken over their own countries by then, and were manipulating the media into making it seem like everything was going just peachy.It's easy to forget now, but during the nadir of the Great Depression, when unemployment was at its highest and it hadn't nearly been proven yet that Roosevelt's New Deal was actually going to work, the empty promises and hateful blame-shifting of fascism actually looked like a pretty good idea to a growing amount of Americans -- as the old justification goes, after all, \"Hitler may be a mean guy, but at least he's building the highways!\" -- even while those who were against fascism were walking around in those days self-righteously declaring that such a thing could never happen in such an enlightened, sophisticated democracy as the United States. This book, then, was Lewis' angry response to both those groups, using extrapolation of all the real issues at the time to show that, yes, a fascist takeover of the US actually could happen, and by the way, the reality would be so much worse than any of you rah-rah Jew haters could possibly, possibly imagine.And indeed, one of the reasons this book was so anticipated at the time and later became such a big hit was precisely because of its laser-precise look at all the current issues dominating the headlines during the early 1930s, making it just as important as a historical document as it is simply a novel; I mean, sheesh, just in the first third of the manuscript alone, Lewis makes specific references to Oswald Villard, Norman Thomas, Admiral Byrd, Hiram Powers, Thaddeus Stevens, Brigham Young, Chester Arthur, Billy Sunday, Aimee McPherson, Mother Eddy, Al Smith, Tom Heflin, Tom Dixon, William Jennings Bryan, Herbert Hoover, Senator Vandenberg, Ogden Mills, Hugh Johnson, Frank Knox, Senator Borah, Walt Trowbridge, George Norris, Jim Farley, William Rollins, John Strachey, Stuart Chase, Al Smith, Carter Glass, William McAdoo, Cordell Hull, Bruce Barton, Edgar Guest, Arthur Brisbane, Elizabeth Dilling, Walter Pitkin, William Dudley Pelley, S. Parkes Cadman, Edward Bernays, Upton Sinclair, Charles Beard, John Dewey, General Balbo, Ernest Hanfstangl, Ramsay MacDonald, Jimmy Walker, Olin Johnston, Mayor La Guardia, Eugene Debs, Steve Perefixe, Neil Carothers, Dowie and Voliva, Jeb Stuart, Nathaniel Lyon, Pat Cleburne, James McPherson, Jane Addams, Mother Bloor and Carrie Nation, many of whom were barely famous even when this book first came out, and of course had already landed in the dustbin of history even by the time World War Two rolled around.And yes, as you can imagine if you're a regular reader here, there are all kinds of ways to directly compare the events of this book with the real events of the Bush administration in the years following 9/11, making it an impressively prescient look at what happened in the US when a quasi-fascist (okay, fascism-friendly) group actually did take over the federal government for a time. See for example the establishment of a new uber-department of the US military in this novel, one that reports not to Congress but directly to the President (think Homeland Security, made by Bush into a White House Cabinet department instead of a new wing of the military); the psychotic powermonger who serves as the vicious puppetmaster behind a genial, populist President (think Karl Rove); the outlawing of criticism against the army (\"SUPPORT THE TROOPS, F-GGOT! SUPPORT THE TROOPS, F-GGOT!\"); the worship of rural life and the demonization of urban living (\"Country First,\" \"Real America\"); the elevating of a barely educated blue-collar thug to a position of national importance, because of a freak celebrity status bestowed by a bored media (\"Joe the Plumber\"); the slow rise of open racism and sexism as legitimate forms of entertainment (where do I even start?); the growing belief that corporate executives are the best-qualified people to lead our country, and the eventual complex intermingling of the private boardroom with the White House Cabinet (again, where do I even start?); the scapegoating of an entire section of the population, one already distrusted by most middle-class Caucasians, as a way to deflect attention from the massive corruption of their chosen officials (\"Arabs! Terrorists! BOO!\"); the overly quick passing of profoundly paradigm-changing legislation, long before its merits can actually be debated (think Patriot Act); the open mocking of intellectuals and academes in order to deflate their power; a faux-folksy autobiography-cum-manifesto from a major politician, full of empty promises delivered in homespun \"common man\" language (think Sarah Palin's Going Rogue); the hypocritical claim that censorship is the best way to honor the original intents of the Founding Fathers; a media-driven ad-hoc \"populist grassroots movement\" not officially associated with a political party, but used bilaterally by politicians anyway to justify the worst of their draconian wishes (the teabaggers in a nutshell); an ineffectual opponent who comes off as elite and impotent at the exact wrong moment in history to do so (think John Kerry); the belief that we must \"show\" to the rest of the world that we're \"real men\" and \"can't be pushed around,\" no matter how much damage it causes to international relations (the attitude that virtually defined the Bush administration for eight years); and even a trumped-up war against Mexico when things start going badly for the people in charge, and who need a nation-unifying enemy to divert attention from inner-party conflict (think post-Bush Arizona, \"The Wall,\" ad nauseum). Each and every one of the things just mentioned is found in Lewis' book; and that's astounding, given that it was written almost 75 years before September 11th and the rise of Bushism, and even more astounding when you consider that Lewis told his own story through the filter of a charming faux-Democrat coming to power, not a bumbling faux-Republican.Now, of course, that also brings us to this book's greatest criticism, a pretty fair one in my opinion now that I've read it myself -- that once we actually come to the Presidential win of this charming Huey-Long-type faux-Democrat about halfway through, the book quickly becomes the 1930s equivalent of the cheesy action movie Red Dawn, with for example the construction of public concentration camps, the dissolving of Congress, and the morphing of the former 48 continental state boundaries into nine \"administrative districts\" all happening before even the first year of this new President's term is finished. (And in fact, speaking of cheesy genre actioners, the original '80s version of the sci-fi series V was itself a modified adaptation of this very book, after a straight adaptation of it by showrunner Kenneth Johnson [originally titled Storm Warnings:] was deemed \"too talky\" by the network.) And that quite obviously leads us to why It Can't Happen Here is now largely forgotten, and is generally considered by Lewis fans to be one of his minor works, despite it being a fairly massive hit when it first came out (even adapted by the WPA into a highly successful stage play, which at one point during the Great Depression was being performed at 35 different theatres across the nation simultaneously); because once again, just like Franzen or Perrotta, Lewis' early novels are admired so much precisely for the nuanced subtlety he manytimes brings to his points, while here he essentially rants like an angry teenager for nearly 400 pages. But then again, maybe this just proves what a polarizing subject fascism is, and that it's simply impossible to respond to the issue in any kind of nuanced way; and in that regard, just think of how many crappy books and movies have now been made about 9/11 and the Bush years, projects that were made with good intentions but might as well be re-titled George Clooney Screams For Two Hours About What a Monster Dick Cheney Is.In any case, it's for sure a fascinating book, one that for obvious reasons deserves to be much better known these days by the general population than it currently is; and in fact, like I said, the more I learn just about Lewis in general, the more I believe that we're in store soon for a major cultural reassessment of his oeuvre (especially as we approach the 100th anniversaries of many of his most famous titles), a writer who is more and more these days starting to appear eerily ahead of his times, and who still has a lot to tell us about what motivates all those endless SUV-driving, yellow-ribbon-wearing, Joel-Osteen-following soccer moms out there in the \"flyover states.\" Although it should be approached with tolerance and a forgiving mindset, I recommend reading It Can't Happen Here if you get the chance, and see for yourself just how universal the fear of uppity hypocrites has actually been over the course of history."}, {"userName": "Kenneth Grossman", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/43952276-kenneth-grossman", "userReview": "It Can't Happen Here (1935) is a prescient commentary on American society in the mid-1930s by Sinclair Lewis (1885-1951), a Noble Prize for Literature ​laureate (1930). It Can't Happen Here is the story of a fictional ​fascist government's rise in mid-1930s USA, an ​insecure society deep in ​socio-economic ​turmoil​. ​This thoughtful novel is very rich and requires the reader to be attentive. I highly recommend it, especially for somewhat politically-minded readers. If you are just looking for a good read to curl up with at night, another book might be preferable.In Europe, the Great War (1914-1918) swept away the great empires -- Germany, Austria-Hungary, Russia, the Ottoman -- and severely debilitated others (Britain and France). The twin tsunamis of social unrest and nationalism created new countries and restructured old ones. In the two decades after the end of World War I, various socialist and Communist movements arose on the Left alongside fascist and Nazi movements on the Right, all of which competed with one another and with liberal democracy for ascendancy in their respective countries. In Russia​ and Italy​, Stalin and ​Mussolini gained control by ​the mid-​192​0s. In Germany, the liberal Weimar Republic succumbed to Hitler and Nazism in the 1930s. The specter of rising ​totalitarianism -- suppression of basic individual rights, severely controlled social and economic institutions,​ racism and ​antisemitism​, and mass killings​ -- ​and unsettled socio-economics​ prodded intellectuals, scientists, business and ordinary people ​to emigrate from Europe and ​especially Germany. ​This emigration included some great minds such as Albert Einstein; many came to America. My parents arrived in the United States in May 1939, a few short months before the outbreak of World War II. All my extended European family -- some 70 people -- died during World War II. The entire branch was severed.​​Events in Europe were carefully observed from across the Atlantic Ocean, for the same forces that were restructuring Europe were also operating in the United States. In America, the prosperity of the 1920s gave way in 1929 to the stock market crash and economic collapse. Its importance cannot be overstated. Black Friday reverberated throughout America; distraught people literally leaped out the window to their death. The effects of the 1929 stock market crash are still a subject of strident academic discourse and a yardstick of current economic woes. Companies collapsed. Times became bad for all of America. ​In a tumultuous America, many workingmen and salaried workers earned a pittance and were the lucky ones; others​​ lost their jobs​. Unions tried to organize and companies tried to undo them; communist and socialist ideologies competed for the hearts and minds of the masses. Right-wing movements promised panaceas by strong leaders, and religious movements reached out to galvanize parishioners with their own brand of utopia. In America, therefore, it is not surprising that ​some thoughtful ​people reasonably wondered about the political future of the United States; smug proponents of liberal democracy were quick to assert that \"it can't happen here.\"​ The onset of World War II postponed the resolution of this issue. Suffice it to say that in the early 1950s, the rise to prominence of Senator George McCarthy -- and what came to be known as the McCarthy Era with its attendant Communist witch hunts -- exhibited the maladies that Sinclair Lewis had presaged twenty years earlier regarding the possibility of fascist government in the USA.It Can't Happen Here ​occurs mainly in rural Vermont, where we meet the protagonist, Doremus Jessup, the sixty-some, highly principled but innocuous editor-owner of the local Fort Beulah, Vermont newspaper. Early on we also meet his immediate social circle:​ his nondescript and uninspired wife Emma ​​(whose pet name for her husband is 'doormouse'); his spirited youngest daughter Cecilia and her boyfriend; his upwardly-mobile son Philip; his olde​st daughter Mary and Mary's husband and their son. We also meet some of his friends, chiefly his old flame Lorinda Pike, his former schoolmate Frank Tasbrough, now the local industrialist, and others. There are also two household workers -- the gardener Ledue and the loyal family cook. All these persons and others contribute to the story. It is one of the great artistic achievements of Sinclair Lewis that he successfully develops a large cast of characters in an average-length novel, giving them depth and color, so that their familiar personalities naturally merge into and augment the plot that Lewis unfolds. In addition, Lewis uses real-life personalities in his story to impart credibility. Both President Franklin Roosevelt and his New Deal, as well as the author, Upton Sinclair, are recruited by Lewis.Now rural Vermont, ​although distant geographically and in mentality from the seats of American power, is no vacuum. Social and economic dissatisfaction and unrest are also seething in Fort Beulah, Vermont. ​I​n 1936, ​the fictitious ​Berzilius \"Buzz\" Windrip, the Republican candidate for President​,​ faces off for the American Presidency against the Democratic ​Party ​candidate and incumbent President Franklin D Roosevelt, ​now ​an independent candidate​,​ who ​has ​los​t the Democratic nomination in this fictional story. Rabble-rousing Windrip ​ wins the Presidency with an unrealistic platform that includes an economically nonviable large annual income guarantee for all citizens, false and contradictory promises to unions and capitalists, successful recruitment of popular religious leaders, and intimidating the opposition by raising a personal army called Minute Men (blue-uniformed in a patriotic throw-back to Union uniforms in the American Civil War and reminiscent of the Nazi Brown Shirts and Fascist Black Shirts).Now Windrip may be President, but he still is not fully in control. After his election, he cajoles and intimidates Congress into passing laws giving him 'temporary' emergency powers, and he also neutralizes the Supreme Court. In the regular army, veteran generals are replaced with officers loyal to the new order. Unshackled by 'checks and balances', he now introduces a new corporatist system known as the Corpo, which fundamentally reorganizes American society. At home in Vermont, Doremus' gardener, the primitive and uneducated Shad Ledue (one wonders if Sinclair thought of 'shady' when he dubbed him Shad), rises to prominence as head of the local Minute Men army. Doremus becomes subservient to his whims and has to stand aside as his daughter is actively pursued by his former gardener, intent on seduction.But all is not calm in the new order​ ​​​​ -- the lust for power and personal rivalry is rampant​. There are coups and high-echelon leaders are summarily replaced or murdered. Across the country, there is growing unrest, and the corpo state army​ is compelled to battle newly-formed, anti-corpo revolutionary units. The corpo government considers instigating a patriotic war against Mexico to deflect the social unrest. In Vermont, Doremus, adhering unwaveringly to his democratic-liberal principles, rejects offers to adapt to the new order and ensure his own safety ​and that of his family. Doremus' wife and son Philip are more pliable and adapt easily to the new order. In contrast, Doremus becomes an underground anti-corpo publicist and sees friends and family imprisoned and killed. Finally, he himself is imprisoned under terrible conditions but with outside help escapes across the border to Canada. In Canada, he links up with other emigres in the New Underground opposition to the corpo government​. By this time, however, Doremus has discovered new energies within himself and an avowed purpose. He is no longer the senescent, sedentary editor of a local paper. Revitalized, he crosses back into the United States determined to take significant and dangerous action against the corpo government.​I find it astounding that this book was published in 1935, which would mean that it had begun to percolate in Sinclair Lewis' mind much before that. Lewis understood the currents reverberating through America and constructed a very plausible scenario for the rise of fascist government in the United States. ​The lessons that we draw from this book are that even ​though our liberal and democratic American society seems strong and vibrant, we must ​be ever vigilant and ​continuously nurture the institutions, values and democratic processes on which our country is established. We must continue to ​resist encroachments by those who would willfully distort our hard-earned democracy for their own pernicious ends. And, most of all, we must insist that our duly elected leaders tell us the truth and refrain from manipulating the means of power to their own purposes."}, {"userName": "Faith", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/17430801-faith", "userReview": "Written and set in the 1930s, this was brilliant satire, terrifying in its accuracy. A dictator is elected by gullible people based on promises of upholding good old American values, liberty, strength, protecting US interests and giving everyone (excluding negroes of course) $5000. During his campaign he would \"...coldly and almost contemptuously jab his audience with figures and facts, figures and facts that were inescapable even when, as often happened, they were entirely incorrect.\"After the despot's election, his cabinet is filled with rich cronies. The government sets up work camps and jails newspaper reporters and anyone else deemed a threat to the regime. However, the $5000 never materializes. There is a plot to start a war with Mexico to distract the masses and provide medals for the soldiers supporting the regime. I was hoping that the author, who was so prescient in predicting the problem, also had a solution. Unfortunately, getting rid of a dictator is not that easy. I'm also afraid that this book could provide handy hints for those seeking to consolidate their power (assuming that they read).I would have found this book much more amusing if I had read it a few years ago."}, {"userName": "J.G. Keely", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "Lewis' greatest strength as a writer is his sense of social satire, bolstered by his humanist treatment of characters. He sees people as ultimately flawed, always in danger of succumbing to their fears, insecurities, and egos. However, this is no reason to condemn man or his works. Humanists do not expect people to overcome their flaws, like idealists, nor to descend into apologetic guilt in hopes of redemption.The hope for humanists is that we may come to recognize our flaws, and then to limit their effects. The danger in this is treating it with self-righteousness, since basing self-worth on a recognition of one's flaws rather defeats the point. Coming to terms with our faults is not a superlative act, but merely a definition of how we live our lives.Thus, the work of the satirist is to make clear and obvious the faults that we humans share. It is often delightful to read satire: the author takes something hidden in our society, something unspoken and taken for granted, and pulls it from the darkness, so that it appears as if by magic, now undeniable and unable to slink back into hiding (at least until we stop looking).Magicians and comedians may pull this same trick again and again, and it will always delight us to realize that there is no such thing as 'ordinary', there are only unquestioned assumptions. It takes an active and a creative mind to archive the effect of revealing the normal to be strange, and this is what we call 'wit'.Lewis has wit, and he is able to uncover the things we take for granted, to startle us or make us laugh with little, innocuous things. In 'Elmer Gantry', he takes on a very grand assumption--religion--and its related hangers-on, and deals blind faith a deadly blow. In 'Elmer Gantry', there is no need to ask about god, since all the faith sent his way is intercepted by righteous men before it has a chance at anything holier.In 'It Can't Happen Here', Lewis provides commentary on another favorite target of satirists: politics. In particular, he aims at the rise of totalitarian tyrants who are granted power by the frightened masses. He was inspired by the rise of Hitler and Mussolini in Europe, and even though his book was written before World War II, it still reflects the fears such regime changes inspired in America's liberal republic.The most evident of these fears, as presented by Lewis, is the idea that the unwashed American masses might enthrone their own warlike tyrant. His grand political critique is an early example of the literary movement to critique and explore the methods of totalitarianism, from which sprung Koestler's 'Darkness at Noon' and the dystopian politics of '1984', 'Fahrenheit 451', and 'Brave New World'.Unfortunately, Lewis is not content with poking holes, as he was in 'Elmer Gantry', but also falls to the temptation of presenting some his own ideals, his own solutions to the problems of totalitarianism. His condemnation of the uneducated and the self-serving tempts him to become occasionally righteous about his own intelligence.The protagonist sometimes acts as a fairly transparent author surrogate, especially in the philosophical unfolding of the denouement. Other times he allows him to be small, flawed, and narrow-minded, but the lows are more infrequent than the highs. The satire becomes incomplete because there are places Lewis himself cannot or will not extend it.Since Lewis fails to see the place that totalitarianism has for Academia, for intellectualism, he also fails to present the rise of totalitarianism as entirely credible. As Machiavelli observed, a people who are unused to being ruled openly by a prince will chafe at that rulership. For them to progress into a political state with which they are unfamiliar requires a dramatic social and economic shift.Though America had experienced a comparatively drastic low in the Great Depression, it was never as serious nor as pervasive as the effects of the global economy in Europe. It was this level of poverty and desperation which allowed a few men to gather up power, because the majority of people were too concerned with getting food to properly resist.Lewis could have posited a more severe extension of the Depression to account for the American political shift, or an event grand enough to create a culture of fear by which the dictator could grab power, as Hitler did after the burning of the Reichstag, or Crassus in the Third Servile War.Perhaps it was Lewis' intent to present a more gradual and insidious shift in America, but if so he quickly abandons this for a more extreme depiction. To show both becomes merely hyperbole, and hyperbole without sarcasm is disingenuous. It conflicts with his ostensible purpose of presenting an otherwise realistic progression of events.The wavering of his satire, whether in character or facts, weakens it as a whole, and though the purpose and vision of the work have borne fruit in others of the genre, from Orwell to Heller, Lewis' seminal and enjoyable totalitarian critique falls short of the less biased satire of 'Elmer Gantry'."}, {"userName": "C.P.", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/1437757-c-p", "userReview": "A charismatic Democratic candidate whose speeches are more memorable than the content... hmmm.... Hints of populism to get the support of the most naive voters -- who think the candidate will give them all they need -- with no intention of following through... hmmmm... Bailing out the big companies in order to control them and the economy... hmmm... Personality cults.... hmmm...The idea is eerily prescient, though it took two parties and two Presidents in real life. I know that I will be labeled a \"Republican\" or a \"conservative\" (the currently rankest epithets) for saying that Barack Obama is a closer match to Berzelius Windrip than George W. Bush, but it is just the honest truth. Also, I am a free-market populist of my own ideology, which I call \"Popular Capitalism\", so the labels are wrong. It is part of Lewis' genius that he recognizes that type of mislabeling as an integral part of the fascist toolbox.However, the writing is uneven. It is poetic in parts but the imagery doesn't tie with the rest of the work. The chronology is loose towards the end for no particular reason, leading some readers to think that Lewis forgot who was killed when. The ending, though ultimately realistic, trails off as if Lewis got tired of writing.I don't think, however, that the main character, Doremus Jessup, being unsympathetic was a flaw of the book. The whole point is to show that a Fascist dictatorship can happen here, so if Jessup was sympathetic enough to us, he would have been sympathetic enough to his fellow citizens to be a \"hero\" and would have garnered enough support to stop or overthrow the regime. There are no sympathetic characters in the book, so it can happen here.My overall impression is that Lewis rushed to get this book out before the 1936 Presidential campaign. He probably saw the voter as getting complacent after Huey Long's assassination in thinking \"it can't happen here.\" Though I would differ with Lewis in his assessment of Long, colored as it was by virulently anti-Long and anti-populist propaganda of the time, he is certainly correct in pointing out that there were threats to liberty which did not bear the scapegoated name of \"Huey Long\". The importance of this message and of getting it out in 1935, in time for the 1936 elections was greater for Lewis than producing a literary masterpiece."}, {"userName": "Anna Iakovidou", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/45965130-anna-iakovidou", "userReview": "Το 1935, τα φασιστικά στρατεύματα του Μουσολίνι εισβάλλουν στην Αιθιοπία, η ναζιστική Γερμανία παραβιάζει τη Συνθήκη των Βερσαλλιών, στην Ελλάδα το φιλοβασιλικό κίνημα του Κονδύλη καταλαμβάνει την εξουσία, η Ισπανία βρίσκεται στα πρόθυρα του εμφύλιου πολέμου, και στην Αμερική ο Λίουις Σινκλαίρ, ήδη βραβευμένος με το πρώτο βραβείο Νόμπελ, εκδίδει το έργο του «Δεν γίνονται αυτά εδώ».Ο αναγνώστης παρακολουθεί την πορεία του ώριμου δημοσιογράφου Ντορέμους Τζέσαπ, ο οποίος καλείται να αναθεωρήσει τις μέχρι τότε κατασταλαγμένες του απόψεις. Αποφασισμένος για τη στάση που θα κρατήσει στις επικείμενες εκλογές, βρίσκεται στο επίκεντρο των εξελίξεων και αναλύει τα καθέκαστα, περνώντας από το αρχικό στάδιο της εσωτερικής πάλης και στη συνέχεια αναζητώντας άλλοτε τη συγκατάβαση και άλλοτε την διαφορετική προσέγγιση των ανθρώπων του περιβάλλοντός του. Την αφορμή γι’αυτή την κατάσταση δίνει η υποψηφιότητα του γερουσιαστή Μπαζ Γουίντριπ στις επικείμενες εκλογές για την προεδρία. Το πρόγραμμα του δημαγωγού γερουσιαστή ξεδιπλώνεται σε συνέχειες μέσα από τις επικεφαλίδες των κεφαλαίων του βιβλίου, ραδιοφωνικές εκπομπές και συζητήσεις τρίτων. Η εξ αποστάσεως γνωριμία με τον γερουσιαστή και η κοινοποίηση του προγράμματος μέσω έμμεσων πηγών συμβάλλει στην δημιουργία μιας ομιχλώδους ατμόσφαιρας που φτάνει στο σημείο να προκαλέσει ίλιγγο στον πρωταγωνιστή όταν παρακολουθεί ο ίδιος μία ομιλία του γερουσιαστή κατά την προεκλογική του καμπάνια. Συνεπαρμένος από τον χειμαρρώδη λόγο και παρασυρόμενος από τη δυναμική που του ασκεί η μαζική ψυχολογία του κοινού επανέρχεται σχεδόν άρρωστος και τρομαγμένος στην πραγματικότητα μαγεμένος ωστόσο από την εμπειρία.Όταν τελικά η εξουσία περνάει στα χέρια του Μπαζ Γουίντριπ τα ακραία γεγονότα υποδαυλίζουν την απόφαση Ντορέμους Τζέσαπ να δραστηριοποιηθεί στην αντίσταση και να ανακαλύψει βήμα-βήμα τις πραγματικές του προσωπικές αξίες. Αντιλαμβανόμενος πλέον την πραγματικότητα δεν διστάζει στιγμή να αμφισβητήσει τις παλαιότερες δοξασίες του και να αψηφώντας τον κίνδυνο που απειλεί τον ίδιο και την οικογένειά του εναντιώνεται στην εξουσία.Με τη διορατικότητα του ο συγγραφέας, καίτοι ζει στην άλλη άκρη του Ατλαντικού, παρακολουθεί τα γεγονότα που εκτυλίσσονται στην ευρωπαϊκή πλευρά και τα αντιλαμβάνεται σχεδόν στην απολυτότητά τους. Προβλέπει την κοινωνική απομόνωση και την βία που θα επιβάλλουν τα φασιστικά καθεστώτα, την έπαρση των εξουσιαστών και την υποταγή των εξουσιαζόμενων. Μέσα από την δημιουργία πολυπρόσωπων χαρακτήρων καταφέρνει να συμπεριλάβει σχεδόν όλες τις κοινωνικές, πολιτικές, θρησκευτικές και οικονομικές ομάδες που επηρεάζονται από το πολιτικό κλίμα ψυχογραφώντας εξελικτικά τις αντιδράσεις τους.Η λιτή γραμμή εξιστόρησης λειτουργεί επικουρικά στην κατανόηση ενός τόσο πολύπλοκου μηχανισμού. Ένα βιβλίο που δυστυχώς παραμένει επίκαιρο στις μέρες μας, φανερώνει με απλό τρόπο τις κρυφές πτυχές των ολοκληρωτικών καθεστώτων, εξιστορεί την εξέλιξή τους και οδηγεί τον αναγνώστη στον απλό προβληματισμό…μήπως τελικά γίνονται αυτά εδώ;http://www.alterthess.gr/content/vivl..."}], "description": "The only one of Sinclair Lewis's later novels to match the power of Main Street, Babbitt, and Arrowsmith, It Can't Happen Here is a cautionary tale about the fragility of democracy, an alarming, eerily timeless look at how fascism could take hold in America. Written during the Great Depression when America was largely oblivious to Hitler's aggression, it juxtaposes sharp political satire with the chillingly realistic rise of a President who becomes a dictator to save the nation from welfare cheats, rampant promiscuity, crime, and a liberal press. Now finally back in print, It Can't Happen Here remains uniquely important, a shockingly prescient novel that's as fresh and contemporary as today's news.", "title": "It Can't Happen Here", "url": "http://www.goodreads.com/book/show/11371.It_Can_t_Happen_Here", "average": 3.77, "cover": "https://images.gr-assets.com/books/1388361997l/11371.jpg", "reviews": 1725, "authors": [{"url": "https://www.goodreads.com/author/show/7330.Sinclair_Lewis", "name": "Sinclair Lewis"}, {"url": "https://www.goodreads.com/author/show/14239512.Michael_R_Meyer", "name": "Michael R.  Meyer"}], "type": ["Fiction", "Classics", "Politics", "Science Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/11371.It_Can_t_Happen_Here", "http://www.goodreads.com/book/show/7959105-it-can-t-happen-here", "http://www.goodreads.com/book/show/33954079-it-can-t-happen-here", "http://www.goodreads.com/book/show/18079524-it-can-t-happen-here", "http://www.goodreads.com/book/show/33546357-it-can-t-happen-here", "http://www.goodreads.com/book/show/638478.It_Can_t_Happen_Here", "http://www.goodreads.com/book/show/32933574", "http://www.goodreads.com/book/show/1307529.It_Can_t_Happen_Here", "http://www.goodreads.com/book/show/11376.Main_Street", "http://www.goodreads.com/book/show/169718.Babbitt", "http://www.goodreads.com/book/show/11389.Arrowsmith", "http://www.goodreads.com/book/show/11378.Elmer_Gantry", "http://www.goodreads.com/book/show/415419.Dodsworth"]}