{"ratings": 7879, "userreviews": [{"userName": "Cecily", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "[ a woman they love, year after year, forsaking all others, without their love being fully aware of their devotion or sacrifice (hide spoiler)]"}, {"userName": "Dolors", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "Jayber Crow is an octogenarian barber who sits under the poplars that hedge in his cabin and stares at the reflections on the river water that is always running somewhere, with time floating in swirls of memories of a life fully lived and now suddenly gone, its light extinguished from within. And yet, this very same river erodes the hills and pastures that have crowned Jayber’s home since the beginning of times as if to remind him that everything changes so that the essential remains the same.I know what you are thinking. What can the chronicle of community life in rural Kentucky, the unfulfilled desires of a loner trying to make sense of his declining faith or the musings of a conservationist have to do with you, a modern reader? How can they add anything new? I am sure you have had your share of going over old times and that you are familiar with many authors that have addressed similar subjects.I won’t lie to you, this book is about all that, but it is also much more.In fact, this book is a lot of things. Not because Berry is ambitious in his vast scope, but because he remains faithful to his vision of the world. This book is the beginning and the end, a moral voice and a confession, a ferocious criticism to technical progress or materialism that devaluates the human.It is the definite love story that will make you weep as you’ve never done before, a hymn to friendship, a tribute to the land that breathes out the wisdom of past generations.It is a spiritual journey towards the culmination of a life, insignificant for its achievements, but all-abiding for its ability to detect and spread beauty even after its fleeting time has ticked out.It turns out that Jayber, our old barber, is a philosopher after all, and that his self-effacing first-person narration becomes an intimate meditation on the mysteries of existence and the retelling of his lifelong quest to overcome fear and anger and replace them with enduring love. He becomes a monk married to his ideals that takes the vote of chastity to balance out the unfairness that befalls on the wife he won’t ever have and transforms his barber shop into an unconventional church where the Coulters, the Penns, the Feltners, the Keiths and the Chantams congregate to have a haircut and to be listened to like nowhere else in town. Barbers are known to be good listeners and Jayber was born to be both.Wendell Berry’s prose is a clear-sighted reflection of the reality his characters struggle against, sailing the turbulent waters of the quotidian. The reader gets to see them appear and recede in the dark hole of WWI and WWII, defeated by illness or consumed by their own delusions, but in spite of this constant flow of lives parading through the years, there is a strong sense of timelessness that is closely related to the physical space they inhabit. It’s precisely in the perpetuity of the natural world, in the idea of a place that anchors aimless spirits where Jayber’s heartache finds a comforting quietude, a solace that quenches his chronic loneliness.Heaven is right here. Beneath the shade of double-trunked white oaks and the song of twittering birds. In silent conversation among good friends. In the dark soil that yields crops and swaying wheat. In that so much awaited smile that covers us with light. In the boat that goes with the tide to cross this river, where you will see Jayber wishing, waiting for you, sitting patiently on the other side."}, {"userName": "Diane Barnes", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "Oh, Jayber! You told me your story and now I am drained, and devastated, and full of the joy of having known you. You, sir, are that rarest of things: A good man. A man who did his job, helped his neighbors, loved and laughed when he could, and, all along tried to do no harm.Let me tell the rest of you about Jayber. Orphaned twice by the age of 10, sent to an orphanage where he got an education and learned to love books, he was told he needed to \"make something of himself\", so decided he heard the call and went to a seminary on a scholarship. There he quickly decided there were more questions than answers, so he made his way back to the community of Port William, Kentucky, where his life had begun. There he became a barber, the only one in town.From 1937, for the next 50 years, Port William became his family. He was an ineligible bachelor who never made enough money to support a family of his own, because he stopped trying to make something of himself in order to be happy. For 50 years, Jayber took care of his community in the small ways that made a difference. He cut their hair, and dug their graves, and cleaned their church. He listened to their stories, and kept their secrets, along with a few secrets of his own.Now, if this sounds like a book that lacks action and drama, think again. Ordinary lives are the stuff of history, and contain enough sorrow and pain and excitement and disappointment for a hundred Shakespeares to write about. Jayber tells us about his little corner of the world, and makes its history and its people come alive.This novel is a love story, a tragedy, a cautionary tale, and a history of sorts. It's also one of the most joyful books I've ever read. Life is a wonderful thing, if we can appreciate what we have and take care of it.Be good, to yourself and to others, do no harm, stop trying to make something of yourself, and be happy. It's really not that hard."}, {"userName": "Candi", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"As I did not know then but know now, the surface of the river is like a living soul, which is easy to disturb, is often disturbed, but, growing calm, shows what it was, is, and will be.\"This book was an absolute joy to read and Jayber Crow one of the most wise and gentle souls I have thus far encountered in a piece of literature. I read this while on a much-needed family vacation, which incidentally also happened to be my twenty year anniversary to one of the most honorable men I have had the pleasure of meeting in the real world! Somehow the opportunity to read this book came at the perfect time for me. Anniversaries, birthdays, and holidays mark times when we often find ourselves reflecting on our own lives, the choices we have made, the different paths we have followed. Jayber helped me along with my own reflection, and I feel a better and more peaceful person for it. Jayber was born in Goforth, Kentucky where he lived for a short time before being orphaned twice over, if you will. While memories of his loved ones at an early age \"grow misty and fade away under the burden of questions\", what does remain and seems constant, despite its shifting currents, is the river. \"I felt, a long time before I knew, that the river had shaped the land. The whole country leaned toward the river. All the streams flowed to it. It flowed by, and yet it stayed. It brought things and carried them away. I did not know where it flowed from or to, but I knew that it flowed a great distance through the opening it had made. The current told me that.\" Jayber will often return to the river, both literally and figuratively, for the remainder of his life. After receiving a calling to the clerical life, Jayber enrolls as a pre-ministerial student at Pigeonville College where he soon loses not his faith, but rather his direction once he fails to find answers to a multitude of questions. Jayber once again travels an unidentified path until he eventually winds up in Port William, Kentucky, not far from his place of birth. It is here that he establishes himself as the town barber in 1937, a position he holds for the rest of his life. Like Jayber, I found myself settling into this town and befriending its people. We now arrive at the heart of the novel, the pulse of the persons that share their lives with Jayber. I felt as if I too sat up in that barber chair, observing those that entered the shop and even those that passed by. I was charmed to meet many of these wonderful characters. Most of them lived a quiet, unassuming life - working their farms, attending to their small businesses, caring for their families. Jayber continues along his course of contemplation, asking himself introspective and often unanswerable questions. If you are like me, then Jayber will induce you to do the same. The institution of marriage, structured religion, the senselessness of war, the practice of agribusiness, the gift of nature, death, and grief are all food for thought. This is also a story about pure and unrequited love. Mostly it is about the varying branches of our lives and the choices we make. As Jayber traverses his life, much like the river flows through the land, he learns from his mistakes and triumphs. He reaches an awareness that will bring comfort to his spirit. \"But now it looks to me as though I was following a path that was laid out for me, unbroken, and maybe even as straight as possible, from one end to the other, and I have this feeling, which never leaves me anymore, that I have been led.\"This novel is simply beautiful. Wendell Berry writes with a lyrical prose that infuses Jayber’s words with honesty and heartfelt wisdom. It is thoughtful and calming, never whimsical, never preachy. It is a balm for your soul. I know I can rest easy with the paths I have followed thus far. A book for the favorites list for sure. I can't finish without sharing a couple of bookish quotes that I loved:\"I hungered and thirsted to hear somebody talk about books who knew more about them than I did.\"\"I’d had the idea, once, that if I could get the chance before I died I would read all the good books there were. Now I began to see that I wasn’t apt to make it. This disappointed me, for I really wanted to read them all.\""}, {"userName": "Sue", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Wonderful book that seemed to increase in wonder as I read. Berry's ability to create characters of such \"person-hood\" amazed me. His creations, beginning with Jayber Crow, seem real, gifted with actual traits (good and not so) as would be found among living, breathing folk. Their experiences seem to reflect American life of this time and place....but I think even more than this place. For me, Berry has captured some elemental realities of American life. Though I have not ever lived in a small place like Port William, I could relate to some of the changes in Jayber's world from memories of the changes in my suburban life as a child and teen in the 1950s and 1960s.And he writes of these changes, in people, places, nature, and the world at large, so beautifully. His language simply evokes the emotions, the scenic wonder, Jayber's awe of nature and life.But I wouldn't want anyone to think this is a story with no humor. This is Jayber's view of his life from his childhood in the 1920s through to the 1980s and he experienced so much along the broad spectrum of emotions.In one final part of the review, I want to leave with a couple of examples of Berry's descriptive prose. This is what pulled me in to discover the wonders of Jayber himself.The surface of that quieted river, as I thought in those old days at Squires Landing, as I think now, is like a window looking into another world that is like this one except that it is quiet. Its quietness makes it seem perfect. The ripples are like the slats of a blind or a shutter through which we see imperfectly what is perfect. Though that other world can be seen only momentarily, it looks everlasting. As the ripples become more agitated, the window darkens and the other world is hidden. As I did not know then but know now, the surface of the river is like a living soul, which is easy to disturb, is often disturbed, but, growing calm, shows what  it was, is, and will be. (p 20)And musings of a different sort:Hate succeeds. The world gives plentiful scope and  means to hatred, which always finds its justifications and fulfills itself perfectly in time by destruction of the things of time. That is why war is complete and spares nothing,  balks at nothing, justifies itself by all that is sacred, and seeks victory by everything that is profane. Hell itself, the war the war that is always among us, is the creature of time, unending time, unrelieved by any light or hope. But love, sooner or later, forces us out of time. It does not  accept that limit. Of all that we feel and do, all the virtues  and all the sins, love alone crowds us at last over the edge of the world. For love...is not explainable or even justifiable. It is itself the justifier.We do not make it. If it did not happen to us, we could not imagine it.... It is in the world but not altogether of it. It is of eternity. It takes us there when it most holds us here. (p 249)And finally, as Jayber sums his life up:This is not an exactly true account of my life. The The necessity of telling it has caused me to divide it into  strands... Some of the funniest things have happened on some of the saddest days. Sometimes I have been happy in the midst of sorrow, or sorrowful in the midst of happiness... This is, as I said and believe, a book about Heaven, but I must say too that it has been a close call...... (p 354)I do highly recommend this book to everyone and, lest you fear that this talk of Heaven and Hell means a book full of \"sermonizing\", never fear. Wendell Berry is too smart and much too great a writer for that!"}, {"userName": "Fionnuala", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "Other reviews have commented on the fictional part of this book, i.e. the life story of Jayber Crow so I will not mention it. Instead I will focus on how this book worked for me.When I had finished it, I wondered about where I would shelve it (not something I often think of, and a tribute to how much I had valued reading it) and I immediately realised it belonged with a group of authors that I have come to love, a group who share a theme, the theme of 'place', with such as MacLeod, McGahern, Laxness. If I had to formulate what 'place' means to me, I think I would conclude that it is close to being my version of faith, and 'geography' is probably my version of religion (I mention faith and religion because they are woven into Jayber Crow's conception of things). To me, geography has always been first and foremost about the physical landscape, this earth we inhabit, and the lives and histories of the animals and people who shape that landscape. There is geography in every page of this book, geography that you can see and feel, that you can walk all over in every weather. There are people in this book whose histories you live and breath, in health and in sickness; even in death, these people remain tremendously alive in your memory. That is the power of Berry's writing, that he has recorded the lives of a community and that his record will survive long after the landscape it inspired has been transformed. The changing landscape is one of his pet themes and he has been criticised for being a fanatical preserver of the environment to the exclusion of change. I don't feel he is against change, just against change which destroys for no good reason. Like Hardy in his Wessex novels, Berry examines how progress impinges on land use and on the livelihoods of the people.  All of them knew that neither farming nor the place would continue long as they were. The dignity of continuity had been taken away. Both past and future were disappearing from them, the past because nobody would remember it, the future because nobody could imagine it. What they know was passing from the world. Before long it would not be known. They were the last of their kind.Berry goes further than Hardy, by showing how land use changes the landscape irreversibly. I did not feel that he was preaching a doctrine here as some have claimed. The environment issues, along with the spirituality issues he touches on, are just part of the history and geography of the place, as impossible to ignore as the flood line of the Kentucky river. I think he works on the principle that it is only by thoroughly examining the physical world for meaning that we can access meaningful abstract thought. I see him as a philosopher of the physical world as much as a storyteller.You may have no interest in geography or the environment, or in the small details of people's lives in rural Kentucky during the twentieth century, and so you may think that Berry's book holds little for you. Stay a moment while I focus on the writing.  The book is written as if the narrator, Jayber Crow is speaking directly to the reader, rather than writing anything down. In fact there is hardly a mention of pen and paper. Instead, there are wonderful intonations and echoes of the local way of speaking in the voice you hear in your head as you read. The language is not elaborate but it is nevertheless truly impressive what complex ideas emerge from Berry’s simple but beautiful phrasing: Every shakeable thing has got to be shaken. In a sense, nothing that was ever lost in Port William ever has been replaced. In another sense, nothing is ever lost, and we are compacted together forever, even by our failures, our regrets, and our longings.Do read it."}, {"userName": "PattyMacDotComma", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4.5★“Where, I have asked myself, is this reflection? It is not on the top of the water, for if there is a little current the river can slide frictionlessly and freely beneath the reflection and the reflection does not move.”There’s a saying that you never step in the same river twice. So it seems reasonable for Jayber Crow to ask the question. Where IS the reflection?Most of his life he wonders what purpose he serves by being alive in the world. Every once in a while he has a sudden epiphany or inspiration or urge and changes direction without warning, seeming to feel it was preordained and meant to be that he should take a next step.His life began by the river at Port William, where he was orphaned and had to move, first to another family and then to school. Thinking he felt a calling for the Church, he studied at college but there was too much he couldn’t reconcile.“But these preachers I’m talking about all thought that the soul could do no wrong, but always had its face washed and its pants on and was in agony over having to associate with the flesh and the world. And yet these same people believed in the resurrection of the body.”He wondered what kind of a preacher he’d make, feeling as he did about the Bible.“. . . when I preached, I thought, I would just not mention the parts that gave me trouble—“That didn’t seem feasible, so he took off rather suddenly from college and wandered away to find himself. He’d learned a bit of hair cutting at school and luckily happened upon a barber looking for an off-sider, so he settled – for a bit. But once again, he got itchy feet and took off, feeling the pull of Port William and the river. He arrived at the height of a flood and luckily again happened upon a fellow with a boat, who ferried him across the river and told him they needed a barber in town and he knew the perfect building.For years his barbershop was a pivotal stop on the male social calendar, some men calling by daily to read the paper and yarn, while some had a shave and a haircut. He heard all the gossip, but it was almost as if it didn't matter what they said in front of him. He felt he was living on the edge of things, never quite included, like a bystander in his own life, but it never seemed to occur to him that possibly everyone feels like this at one time or another. He’s a bit like the kid who thinks everyone knows how to do everything except me. Why am I so dumb? Why am I left out? But he had fun, too, buying a car, flirting at dances in the bigger town nearby, worrying more about the flesh and less about the soul.“I was well acquainted with the unforbidden, but now that I was accumulating a little money I invested some in the forbidden. Wherever I could locate the forbidden—and with our clientele, it wasn’t hard—I went and tried it. Wherever the sirens sang, I went ashore. Wherever I heard the suck of whirlpools and the waters gnashing on the rocks, I rowed hard to get there. It’s a little bit of a wonder that I didn’t get cast up from the depths in several pieces, or at least contract a foul disease.”He reckons what saved him was his love of books and miserly nature. “I was a cut-rate prodigal.”That’s only the barest of bones of what is a rich,deliciously philosophical treatise on life and the nature of man. He despairs of the loss of the small, self-sufficient family farm with a team of mules and a hardworking family.“We went steadily from one thing to another, from can see to can’t see, and then on by lamplight . . .”He is no fan of the would-be corporate farmer who clears all the trees, fills sheds full of machinery and grows single crops, all on borrowed money. The soil grows hard and sour and the almighty dollar rules. It’s a familiar theme of The Good Old Days. He even has the retired folk moving to smaller holdings where they can still house the mules and raise chickens and vegetables, but he doesn’t really clarify where the food and goods come from for those without land.It’s a romance, but for one who has lived on the land, I know that everybody can’t farm their own few acres with mules and expect to feed the world. Even in Jayber’s early years, more was needed – there were already a lot of hungry people. I got tired of the preachiness, I must admit.He opened his barbershop in the late 30s, before WW2, the calamity that sent so many young men and women to their doom. “Nothing could reduce the strangeness and dreadfulness of that phrase, ‘gone across the waters.’”By this time he’d taken on a second job as church janitor and gravedigger. No longer a religious man, he still enjoyed the company of churchgoers on a Sunday morning and the company of the quiet departed in the graveyard.“I saw that, for me, this country would always be populated with presences and absences, presences of absences, the living and the dead.”This book is such a collection of quotable quotes, aphorisms, epigrams, anecdotes, and memorable phrases, that it needs leisurely reading to let you mull it over and soak up the atmosphere. I didn’t like the political tone here and there, but I enjoyed the narrative and the wonderful descriptions:“His chin stuck out, when he wanted it to, as though he used it for pushing open doors.”A building: “The whole thing was slung a little askew like an old dog half-minded to lie down, and it was badly in need of paint.”Ultimately, it’s a life that begins and ends with the river.“I stop and look at it. I think of its parallel, never-meeting banks, which yet never part. I think of it lying there in its long hollow, at the foot of all the landscape, a single opening from its springs in the mountains all the way to its mouth. It is a beautiful thought, one of the most beautiful of all thoughts. I think it not in my brain only but in my heart and in all the lengths of my bones.”It's on my Old Folks shelf along with other favourites like A Man Called Ove and Britt-Marie Was Here. I enjoy seeing how people have lived their lives and what they've learned or taught others."}, {"userName": "Margitte", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "I must admit, after thoroughly pondering this philosophical novel, that I did not agree with some of the author's idealistic solutions to the world's problems, in particular the naive approach to agriculture and the economy. I will accept that it was not the author's own viewpoint, which I doubt, but that of our dearly beloved Jayber Crown's. However, the novel is a tour de force for lyrical prose and the philosophy behind heaven and hell.Phew, the impact of Jayber Crow's unrequitted love for Mattie Chatham ripped my guts out. I felt this deep sadness, almost sorrow, for this kind and gentle man's sincerity and loyalty to a woman he could never afford. And I wanted to cry for the trees lying helplessly uprooted in The Nest. The full circle journey we took with Jayber Crow through his life as twice-orphaned little boy, then resident of an orphanage, then divinity school, odd jobs and then back to Port William in Kentucky as the town's only barber, left me yearning for more contact with this lonely man who made friends with his neighbors in his barber shop which became the town's living room, where everyone shred their private thoughts and concerns. But Jayber also became friends with his readers. I did not want this friendship to end. He was born at the river, then took away, and returned in his old age to the vein of water which determined the outcome of all life on earth. The river brought life, hope, enlightenment, and knowledge without words, but also confirmed the irreversible passage of time, and a sense of loss and oblivion. It flows by its own rules and divide by its own laws. The river was Jayber's soulmate. It kept Jayber moving forward at his own pace and time, and allow him to live by his own rules and decide his own destiny, which he hoped was heaven for all mankind. What a great novel. I was thinking afterwards that the reader got emotionally so invested in this story, that we wanted to hang onto his trousers like little children, begging him not to go. Jayber did not only understood his town, he also claimed his reader's souls and climbed into our minds, knocking on the doors of our own need for goodness and love. How can we let go of someone who understood us this well? Who knew where we hid our vulnerabilities and lonely thoughts. No wonder we were left hanging when the end came and we wanted to cry for our loss. An honorable man. A decent soul. A caring earth angel to those who did not even know it.I'm so deeply touched by this book, that words allude me completely.I had this same overwhelming urge to meet a character in a book with Ove, in A Man Called Ove by Frederik Backman, Ebenezer in  The Book of Ebenezer Le Page by G.B.Edwards,andLarry Ott  in Crooked Letter, Crooked Letter by Tom Franklin. Another three loners who had to navigate their journey through their lives by their own sense of remaining true to themselves and what they believe in.A slow read, but a necessary one.PS. Jayber Crow's emotional connection with the river reminded me of this quote:From my village I see as much of the universe as you can see from earth, So my village is as big as any other land For I am the size of what I see, Not the size of my height. —Fernando Pessoa as Alberto Caeiro, The Keeper of Sheep"}, {"userName": "Gloria", "userReviewDate": "Aug 04, 2010", "userURL": "http://www.goodreads.com/user/show/2124093-gloria", "userReview": "Read through #3.Perhaps it's just one of those stories which only intensifies and becomes greater with each reading...All I know is that with every reading, the end of this book makes me feel like I need to take a step back from everything-- and really assess the world around me with clearer eyes.And work toward mercy.______________________________________________One year later, after my first read through, I am amending my original 4 star rating to 5-- even though it deserves 6 or 7. Beautiful, haunting, soul-stirring and will not leave me in peace.______________________I'm embarrassed that it took me so long to get through this book. I could chalk it up to busyness and school and all the other things that wrap up my time, but I've devoured lesser books amid those activities.And I think therein lies the key. This book was amazing. The prose so beautiful that I couldn't have any distractions around me to diminish it. And, I'm realizing, I pored over this book more slowly because I simply didn't WANT to finish reading it. I wanted to keep hearing more of Jayber Crow's story and life.I loved how it laid out his life in distinct sections-- from childhood, young adulthood, to being older. While his character evolved in some ways, the core of him was visible all the way through.I also appreciated the moments in it where the humor actually made me laugh aloud.It's one of those stories where you earnestly wished the characters were real ... because you'd will yourself to live where they are ... and I'd probably fall in love with the shy, somewhat reclusive Jayber Crow."}, {"userName": "Connie", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "It was such a pleasure to read Wendell Berry's lyrical prose about a quiet, observant man living through the 20th Century. Jayber Crow was orphaned twice as a young boy, first when his parents died and then when his adoptive aunt and uncle passed away. He was sent to an orphanage, spent time at a divinity school until he questioned his faith, and worked some small jobs. But the river that flowed near his rural childhood home called to him, and he made his way back to Port William, Kentucky.Jayber became the barber in Port William, and later added a few part-time jobs as a grave digger and church janitor. The barbershop was a wonderful atmosphere to introduce the residents of Port William to Jayber. \"It's a fact that knowledge comes to barbers, just as stray cats come to milking barns. If you are a barber and you stay in one place long enough, eventually you will know the outlines of a lot of stories, and you will see how the bits and pieces of knowledge fit in.\" (94)He became part of the small Kentucky town, and had a vision of a gathered community. \"What I saw now was the community imperfect and irresolute but held together by the frayed and always fraying, incomplete and yet ever-holding bonds of the various sorts of affection. There had maybe never been anybody who had not been loved by somebody, who had been loved by somebody else, and so on and on.\" (205)As the 20th Century marched on, Jayber chronicled wars, births and deaths, strong friendships, and a secret unrequited love for a married woman. He saw traditional farming methods being replaced by larger agribusinesses that took on substantial loans. Jayber saw Port William change as the interstate cut through farms. \"It divided neighbor from neighbor. It made distant what had been close, and close what had been distant.\" (281)As an older man, Jayber moved to a small home by the river. Wendell Berry, who is also a poet, shows us Jayber's wisdom, his reverence for nature, the change of seasons, and his desire for self-sufficiency. I hated to turn the last page and see this beautiful book come to an end."}, {"userName": "Sara", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Before I can tell you how much I loved this book, I must tell you that my father, like Jayber Crow, was a barber in a time when the barber shop was a social place and not a styling salon. I loved this very male place, where I could very rarely slip myself into a corner and listen to old men talk about the weather and the crops and gossip about one another in a friendly and civil way. My father was also a self-taught fiddler and music would often pour from the back room of the shop well into the night. I thought of this place as a crossroads of our community. There was no one that my father did not know and know well.With this in mind, I was thrilled to meet Jayber Crow, a bachelor barber in Port William, Kentucky, who serves his community with so much more than a haircut and a shave. Wendell Berry opens this man’s life and heart to us and through his interactions with the community in Port William, the lives of his neighbors and friends. The story unfolds, with vignettes sprinkled throughout detailing the events that make up the everyday lives of the entire community. But, most importantly, we meet Jayber, whose boyhood is laced with both tragedy and rescue, and whose bachelorhood is really as peopled with love and attachment as a life can be.Wendell Berry has a marvelously descriptive and captivating style. It sometimes felt to me as if I were sitting in that barber shop and listening in on the conversation, or on the bank of the river pole in hand, the story unfolded in such a charming and folksy manner. But this book is anything but surface material, there is depth galore and major issues tackled in profound ways.\tPrayer is like lying awake at night, afraid, with your head under the cover, hearing only the beating of your own heart. It is like a bird that has blundered down the flue and is caught indoors and flutters at the windowpanes. It is like standing a long time on a cold day, knocking at a shut door.\tBut sometimes a prayer comes that you have not thought to pray, yet suddenly there it is and you pray it. Sometimes you just trustfully and easily pass into the other world of sleep. Sometimes the bird finds that what looks like an opening is an opening, and it flies away. Sometimes the shut door opens and you go through it into the same world you were in before, in which you belong as you did not before.I could quote dozens of passages that address such issues and do them with a candor and feeling that is seldom encountered. I can see myself re-reading this book someday and finding hidden nuggets of truth and wisdom buried deep beneath the story line that were missed the first time around. As is often so, I owe a debt of gratitude to \nThe Southern Literary Trail \ngroup for introducing me to this remarkable author. I know this will not be the last book I read by Mr. Berry. I wish I had discovered him earlier...but, as Jayber would agree, I am sure, it is better to meet a good man late than to never meet him at all."}, {"userName": "Esteban del Mal", "userReviewDate": "Apr 14, 2011", "userURL": "http://www.goodreads.com/user/show/2251009-esteban-del-mal", "userReview": "Pet peeves:1.) Cars with dealer license plate frames. You bought the car, is it necessary to advertise where you bought it from? For free? This is America, you dumbass. Have some self-respect.2.) Company vehicles that have an overhead dome light that has some sort of short in it that causes it to light-up whenever I go over railroad tracks, potholes, or spare change in the road at a speed of greater than 3 MPH and consequently makes me feel like the centerpiece in some hackneyed corporate motivational workshop complete with strobe lights.3.) Novels written in the first-person that supposedly take place in the American South during the Great Depression that present a narrator that never made it past the eighth grade but somehow manages to sound like Truman Capote and John Waters had a baby and left it in the care of Mr. and Mrs. Thurston Howell. As cool as it may sound, it doesn't work.This novel is unconvincing. As unconvincing as the bucolic America it conjures. It's sentimental pap and I couldn’t finish it. Couldn't really even begin it.Bucolic America is a commodity. It's a shiny bauble that you don't need but which has been foisted upon you by a culture that thinks better of itself than it deserves. Here's the good news: that culture is scrapping the bottom of the barrel if it's promoting the particular sentimentality this rustic boob is best acquainted with. Lately, I've been inclined to think of Goodreads as some sort of psychological experiment; that all the personalities I interact with on here are really fronts for one or two graduate students somewhere. Graduate students who alternately fuck with and flatter me in some morbidly-algorithmic-impregnable manner such that I jump through my assigned hoops just so. This is a ridiculous notion, of course. But it is an easy explanation. And people, of which I am one, like easy explanations. America is an easy explanation.As you may have deduced, I drive a lot. For work, that easiest of explanations. I drive through and around a part of the country that many would absent-mindedly, if assuredly, consider bucolic. Once, late at night, I was driving down a quiet byway and nearly ran over a young man. He was sitting, cross-legged, square in the middle of the road. He looked placidly anesthetized. I missed hitting him by mere inches. His expression never changed as I, heart racing, palms sweaty, mouth cursing, eyes frozen wide, swerved around him in a mass of metal propelled at a speed that would have obliterated the human body. I didn't stop."}, {"userName": "Kj", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/298072-kj", "userReview": "An easy five star rating for this one- half way through I already knew it had become one of my favorite books.Not driven by plot, in fact not \"driven\" in any sense, this is a story that walks you gently and honestly through many parts of a life. It's hard to put words to a reading experience such as this one that takes you deep into the heart of what it means to live, to be alive. Despite its fiction narrative, \"Jayber Crow\" feels far closer to a guided mediation on youth and age, Progress vs. nature, community vs. materialism. About every five pages, a passage would knock me over with its distillation of truth and beauty from that which is most obvious and taken for granted. Over and over, I read things that made me say \"I have always thought/felt that, and no one has ever put language to it.\" I've never used \"integrity\" to describe a book, but that is what this book showed me, and in a way that feels livable and desirable. Wendell Berry's heart for the things that run deeper than the passing of years, leads me, more than anything I have yet to encounter, towards an understanding of where our American culture sold its soul in exchange for borrowed fantasies of what qualifies as a life. And at the same time, this is one of the most hope-giving narratives I've ever had the blessing to sit with night after night.Oh read it. Read it. I don't know what else to say."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "5★Less is more.If the terms environmental activist, organic farming, or sustainable development have a place in your personal beliefs or you’re a fan of Thoreau, Muir, or Gandhi, you will no doubt appreciate or love Wendell Berry and this book. If not, chances are you will really like it anyway. Fair to say he uses this story as a platform to espouse his beliefs, many of which I also embrace, but beyond that it’s an exceptionally and beautifully told tale about a man and the life, or more pertinently, the lack of one he chooses to live. If you want a taste of what you’ll find in the pages just read through some of the shared quotes on the books GR home page and you will know if you want to share Jayber's life journey and let it come to rest in your heart.https://www.goodreads.com/work/quotes..."}, {"userName": "``Laurie Henderson", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/18430919-laurie-henderson", "userReview": "In the beginning Jayber Crow was a happy child living with his parents in northern Kentucky where life was still pretty primitive. No electricity or indoor plumbing and they grew all their own food. Jayber's parents had died of the flu after WW1 so his childless Aunt and Uncle brought him home to live giving him everything a child could possible need.The lyrical descriptions of the countryside and Jayber's childhood reminded me of the book The Yearling where young Jody ran wild in rural Florida with his pet deer, Flag. Both Jayber and Jody are well loved and happy children but both children soon had a brutal ending to their idyllic and magical childhood.Spoilers Below Beware!Jayber Crow's elderly parents would both die while he was still a child and he was taken to an orphanage to live his teenage years.Young Jody's magical childhood ends when his father is permanently crippled and preteen Jody had to take on all the responsibilities that his father was no longer able to fulfill.The Yearling thankfully ended at that point with the reader now aware that Jody would be poor and miserable for the rest of his life. Marjorie Kinnan Rawlings would not write another 300 pages going into cruel detail of Jody's difficult new life. The author of Jayber Crow, Wendell Berry, did decide to write another 300 pages detailing how Jayber's soul was crushed in the orphanage. Jayber returns to his original home town as the town barber where he still had a few childhood friends. But Jayber will live his life on the sidelines, listening to the talk in the barber shop of events in his customer's lives while his life remains unfulfilled.Maybe I just didn't have the stomach for this tale of unrelenting woe as related by the rather garrulous Jayber Crow. The author did bring the beautiful, rural Kentucky alive for this reader and I wouldn't mind taking a vacation to Kentucky now to see it for myself."}, {"userName": "Michael", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "A moving and uplifting portrait of heaven. That’s how Jayber Crow sees it as he reflects on his life as an ordinary man living his life as a barber in close connection to his community in rural Kentucky, Port William. Or maybe I should say an extraordinary man in an ordinary community. What makes Crow special is that he believes in love, even to the point of trying his best to love his enemies. On my part, I found it easy to love him and hated for my time harvesting his wisdom and sensibilities to end. To me he is an unforgettable character and the book a timeless vision of a rural way of life I cherish from my own upbringing.Like Berry himself, Crow had some early time with a farming community in north central Kentucky that set a baseline of Eden in his heart, which drew his return after some wanderings in the world. Crow is orphaned at a young age and is raised until the age of 11 by an aunt and uncle. But they die, and he ends up in a distant orphanage. From there he has a stint on scholarship at a divinity school. But he eventually realizes he really doesn’t believe in prayer: “if Jesus’ prayer in the garden wasn’t granted, what is there for us to pray, except ‘thy will be done’, which there is no use in praying because it will be done anyhow?” After an aimless period of menial jobs, he finds himself at one point magnetically pulled back to his true home, Port Royal, a young man in his early twenties in 1937.He feels the sense of home immediately in the acceptance he receives and in the help given him to set up a barber shop. Most of the men pass through his establishment, where all their hopes and concerns and all the news and rumors are shared. He sees his barber shop as effectively the living room of the town. it’s a fact that knowledge comes to barbers, just as stray cats come to milking barns. He experiences the company of women when they bring their children it, as well as through his extra work as a janitor at a Protestant church. He experiences the gravity of life’s travails through his other work as a gravedigger. Otherwise not much happens. He partakes of friendships from all walks of life, thrives on the seasons of gardening, fishing, and hiking the woods or along the river, and experiences the pervasive impacts on the community of the Depression, World War 2, and the boom times afterward. I appreciated the rhythm of his days when he retires to live in a cabin on the Kentucky River. An unrequited love for a married woman, Mattie, dwells sad and wonderful in his mind throughout much of the book.It is in his reflections on the life he observes that makes his relatively uneventful journey a compelling quest of the spirit and lesson of hope for sustaining values threatened by the inevitable changes wrought by modernism. I have to forgive him for trying to tell his conclusions rather that showing them through the narrative. Having just read some of his essays on the destructiveness of modern agribusiness and forestry on sustainable local economies, I see how many of the characters in this book serve as means to illustrate his ideas. It does bring the issues to life in personal terms, but the spelling out of Berry’s philosophy through Crow breaks some of my engagement in the story. Here are some illustrations of Crow’s attractive blend of pragmatic and spiritual outlook on life.On one’s possession by love:So it is that the life force may take possession of a man—so that in the end he may be possessed by something greater, no longer at all belonging to himself.On grief and its tapping of eternity:The grief had something in it of generosity, some nearness to joy. In a strange way it added to me what I had lost. I saw that, for me, the country would always be populated with presences and absences, presences of absences, the living and the dead. The world as it is would always be a reminder of the world that was, and of the world as it is to come. His critique of agribusiness in a nutshell:The new way of farming was a way of dependence, not on land and creatures and nature but on machines and fuel and chemicals of all sorts, bought things, and on the sellers of bought things—which finally made it a dependence on credit. A distillation of his view of community as imperfect, transitory, but somehow timeless:It was a community always disappointed in itself, disappointing its members, always trying to contain its divisions and gentle its meanness, always failing and yet always preserving a sort of will toward goodwill. I knew that, in the midst of all the ignorance and error, this was a membership; it was the membership of Port William and no other place on earth. My vision gathered the community as it never has been and never will be gathered in this world of time, for the community must always be marred by members who are indifferent to it or against it. And yet I saw them all as somehow perfected, beyond time, by one another’s love, compassion, and forgiveness, as it is said we may be perfected by grace.And so there we all were on a little wave of time lifting up to eternity, and none of us ever in time would know what to make of it. How could we? It is a mystery, for we are eternal beings living in time. Did I ever think that anybody would understand it? Yes. Once. I thought once that I would finally understand it.I am grateful for being turned to the book by Steve's wonderful review: Review of Jayber Crow. It's great I can look forward to other books by Berry about this fictional but real community of Port Royal."}, {"userName": "Melki", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "I'd had the idea, once, that if I could get the chance before I died I would read all the good books there were. Now I began to see that I wasn't apt to make it. This disappointed me, for I really wanted to read them all.\nIt says a lot that I started this book on September 23rd, and didn't finish it until November 12th. I meant to read a chapter each day, I really did, but I didn't exactly wake up each morning saying, gee . . . I wonder what madcap adventure ole Jayber's up to today?'Cause he really didn't get up to much. He stood in place in his little barber shop with no running water, cut other men's hair, and watched the world go by. And, it went by without him. The big problem is Jayber himself. Crow seems to be a minor character in his own life; an audience member, rather than an actor. Sometimes, this can work, IF a blank slate of a character meets and interacts with lots of quirky characters. But, there is no quirk factor in this book. Jayber's friends and neighbors are as bland and uninteresting as he is.There is no doubt this is a beautifully written book, but there were many times I felt like quitting. In the end, I'm glad I didn't. Part III was wonderful, though sad, and melancholic, as Jayber witnesses the inevitable decline of his beloved small town.\nIt had about come to the point where nobody wanted to live in Port William who wasn't already in the habit of living there, or who could afford to live anyplace else.\nMost people seem to have liked this one way more than I did, so I'm chalking it up to both wrong book at the wrong time, and a little bit of too many other titles on the stack calling my name. Berry sure can write some pretty words, though.\nI am a man who has hoped, in time, that his life, when poured out at the end, would say, \"Good-good-good-good-good!\" like a gallon jug of the prime local spirit. I am a man of losses, regrets, and griefs. I am a man full of love. I am a man of faith."}, {"userName": "Camie", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/7399266-camie", "userReview": "Jayber Crow is an orphan twice over who ends up in an orphanage at age ten. Though later he finds the means to get back to his hometown Port William and become the local barber (whose shop is a social hub), he ultimately chooses a more solitary peaceful life living in a borrowed cabin by the river. A fine story of small community life, the beauty of nature, unrequited love, and a life well lived. The best acclaim for one book is wanting to continue reading the author's work. Luckily there are eight other books in the Port William series. Read for OTSouthern Literary Trail -August -5 Stars"}, {"userName": "Chrissie", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "What do I think of this book? I absolutely hated parts and other parts totally blew me over, the words were so perfect. The author IS an acclaimed poet. I was never indifferent to this book. Either I was furious or astounded by the quality of the writing. Should I give it one star for all the times I felt like dumping it immediately? I cannot give it two or three stars because they are lukewarm ratings. I was never lukewarm to this book. Yes, I liked it a lot, four stars it is. I will explain what I liked and what I absolutely hated.When Wendell Berry describes nature - a river, a forest, a foggy morning – it is not just beautiful, it is completely accurate. A river is something you hear and see. You feel its presence, and all this is conveyed in his words. Me, I adore walking in the woods or along a beach so I felt very attached to Berry’s words. Humor. There is lots of humor. Tongue in cheek humor and that is my favorite. Great dialogs too.I look at the story as a whole and I feel the message the author wants to convey is perfectly demonstrated by the events, by what happens, particularly its ending. This is a book about a barber (Jayber Crow) in Port William, Kentucky. He tells us about his life living through the events of the 1900s. He speaks of not only his life but all the people of the town, since being the barber he comes to know everyone. This is not a book of historical fiction; you do not read this to learn about either of the wars or the Vietnam War or the Depression, all of which he lives through. He never went to war since his heart disqualified him. He was orphaned twice, but I will not explain that. Read the book instead. He was first educated to become a priest, but he realized it wasn’t his calling. He did have faith. He philosophizes and thinks and questions. All of the things he lived through shape his personality. Berry creates a character that is believable. The author has a pet peeve and he speaks through Jayber. Agriculture has become big business and this is just not good in the long run! Natural resources are being wasted. Small town life, based on sharing and trade where everyone knows each other is always better than big business. Small scale is always better than large scale production. But it is here that I got so annoyed with the book. I agree with the author’s/barber’s point of view. I am not opposed to the message, but it is repeated and said over and over and over to the point where I just wanted him to zip his mouth. Enough! I get it. I agree. I am not an idiot. I don’t need a lecture. Will you shut up! Do you understand how annoyed I got?!There. If you can stand a little too much philosophizing and preaching and religious talk, which I could not quite swallow, you will also be given a good story that holds together, where the characters feel real, with lines that will make you smile or laugh or chuckle and most everyone will agree with the message imparted. The author is a poet ……except in those parts when he is proselytizing through Jayber. P.S. Paul Michael narrated the audiobook I listened to. I liked his southern dialect. I liked the speed, which is rather slow, but I did want him to hurry up when Jayber went on and on and on with his proselytizing soliloquies. The women all sounded the same, and that annoyed me because their personalities were different!"}, {"userName": "Laura", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "I totally fell in love with Jayber, Wendell Berry and the place. Berry makes it feel so easy. Touches you from the very beginning and never lets up, but in a very soothing way. This is going on my favorites, it's that good."}, {"userName": "Jeanette", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Great read. Others have said it better, but Wendell Berry is a talented writer and this is an excellent book. Very few authors can set this cultured, neatly mannered tone holding a core of good intent by the narrator- for so long and in such context of depth to issues and places that clearly don't always hold the manners and nuance of the telling ability. Yet it is often in a near dialect rhythm / connotation etc. Jayber himself is memorable. Completely! Barbers and beauty parlor stylists- most hold quite a window everywhere rural OR urban. Almost but not quite like a bartender to a \"known\" and regular customer (think Cheers & how accurately Sam knew the folks). But a barber for that many years with such personal contact with males of Port William? Wisdom and depth. And yet the sadness of loneliness, missing the soul mate or any mate. Or just not fitting. But most of all accommodation to what is. And joy and appreciation for what is good. It does come across in all those words. But there were certain \"causes\" of local ilk and method that became mentioned over and over, and I don't care for that kind of repetition in a story this universal. The story of a certain exact place told by a good man.Ironically I just this last month read two books placed in nearly the same exact location in Kentucky- this being one, and the other one The Sport of Kings. And they could NOT have had a more different opinion and connection and identity to the land. Berry loves the home place and thinks of the earth there as not just one of the commodities. And it comes through in his excellent natural world placements."}, {"userName": "Diane Barnes", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "Goodreads apparently chewed up my review, which was glowing, as I loved this one. Ģrrrr!"}, {"userName": "Tsung", "userReviewDate": "Sep 05, 2015", "userURL": "http://www.goodreads.com/user/show/4992851-tsung", "userReview": "[ It was very sad that Troy’s final affront to Mattie was the selling off and destruction of the Nest Egg, which was Mattie and Jayber’s nature haven and the last vestige of Mattie’s family’s legacy. (hide spoiler)]"}, {"userName": "Laysee", "userReviewDate": "Sep 21, 2015", "userURL": "http://www.goodreads.com/user/show/4863523-laysee", "userReview": "Jayber Crow is a beautifully written novel that has heart, soul, and spirit. I appreciated it most for the still center that was bound up in its narrator, Jayber Crow, a man given to solitude. The novel had a quiet appeal like the river that flowed through the fictional town of Port William in Kentucky where the story was set. It traced the life story of Jayber Crow and his relationship with the people in Port William. It was easy to be drawn into young Jayber’s storm-tossed life but it soon became obvious that Wendell Berry had deep thoughts to share about freedom, independence, love, faith, faithfulness, loneliness, grace and forgiveness. The novel also celebrated the beauty, comfort and solace that abounded in nature and it offered many opportunities for lovely detours into the woods. When a book serves up a protagonist I can respect, food for thought, the call of the wild, it is immensely satisfying to me.Jayber Crow was orphaned at age 4, briefly adopted by a loving paternal grand aunt (Aunt Cordie) and her husband (Uncle Othy) until their death, before he ended up in The Good Shepherd Orphanage at age 10. The chapter on The Good Shepherd was gently heartbreaking. I felt for the young Jayber feeling homesick, lonely and displaced. But I was also impressed by his ability to find pleasure and strength in little touches of beauty that surrounded him or to find congenial company in a good book in the orphanage library. Like in other novels (Anthony Doerr’s “All The Light We Could Not See”, Jeanette Winterson’s “Why Be Happy When You Can Be Normal”), the library opened up a world of knowledge and the power of words for the powerless individual. The adult Jayber signed up for literature courses at the university. His love for reading endeared him to me as did his love for solitude and quietness.It is interesting to contemplate Jayber’s calling or vocation. Fresh out of high school, he felt he was called to be a preacher. However, he struggled with theological questions for which he had no answers. Old Grit, his professor, told him \"You have been given questions to which you cannot be given answers. You will have to live them out - perhaps a little at a time.\" And Jayber did and in a way that caught him by surprise. At age 22, Jayber became the barber of Port William. The barbershop was a gathering place for the men of the town. Behind the barber's chair, Jayber had access to privileged communication, in his case as an unofficial counselor of sorts. \"Talk..draws to a barber as water draws to low ground.\" He became an astute observer of life and despite his aloofness and preference to be a bystander, Jayber became more closely knit to the town folks than he ever thought possible or wanted to. His friendship with a small circle of men (such as Athey Keith, Burley Coulter) was precious. Jayber struck me as a young man with an ancient soul. He had a leaning toward aloneness, owing perhaps to his early life experiences. He was constantly given to unrelenting feelings of loss and memories of old times past. His grief had a complexity that was peculiar and hard to fathom: \"This grief had something in it of generosity, some nearness to joy. In a strange way it added to me what I had lost.\" In the same way, Jayber had a strange, unspoken love for that one special woman (Mattie Chatham) that I found perplexing. He was a man inclined toward inaction. The Christmas party at which he realized he was in love with Mattie read almost like a conversion experience of the “I felt my heart strangely warmed” variant. But his response was typical of his normal responses to everything else: \"I had been utterly changed, and had not stirred.\" \"There was nothing to do but submit to the trial of it.\" The submission took the form of a quiet vow of marriage to Mattie who never had any inkling of his feelings for her. In later years, the unplanned times he and Mattie met by the river to which they had separately gone to seek comfort and solace were, he thought, “a hope seen from afar, that must be with patience waited for.” The Bible has a word for this – faith. How does a person love so deeply and faithfully when he loves so hopelessly? It is sad but beautiful.My favorite part of this novel is Part III, which expressed issues surrounding love that were powerful and profound. They begged re-reading, which was what I did after the last page was turned. One of the loveliest chapters in Part III described Jayber's new life in a new house by the river. I could picture it and wish I lived there. It was written in an unpretentious manner that elicited gladness and a desire to linger a little longer over the repose nature afforded. I believe Jayber Crow is not a book for everyone. The events unfolded in Jayber Crow’s realm of thought and contemplation. It is a book to be read slowly perhaps by the banks of a calming river."}, {"userName": "Sylvester", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/2289972-sylvester", "userReview": "I only know of Wendell Berry through Goodreads. I thought\"Jayber Crow\" might be something I'd like - and it was, although I really dislike most of the reviews of it. (Someone out there is teaching Wendell Berry classes, apparently, and making him tedious in the process.) For me, this book was about the river. Very strongly a book about place and an individual life as a reaction to or an element of it. Really, Jayber Crow's life is exactly like the river.\"I can't look back on my life from where I am now and feel that I have been very much in charge of my life...I feel that I have lived on the edge even of my own life. I have made plans enough, but I have never lived by plan. Any more than if I had been a bystander watching me live my life, I don't feel that I ever have been quite sure of what was going on. Nearly everything that has happened to me has happened by surprise. All the important things have happened by surprise. And whatever has been happening has already happened before I have had time to expect it. The world doesn't stop because you are in love or in mourning or need time to think. And so when I have thought I was in my story or in charge of it, I really have only been on the edge of it, carried along.\"Carried along. I love that. I can relate.Nothing much happens in this book. It begins with the river and winds back and forth, meanders, rises and falls - it reflects. It seemed a lot like a poem to me. There are the little day-to-day stories of the town people, and full of character and interest, and then there are the few who stand out in a big way - Burley Coulter and Athey Keith - I wish there were a few more like those two in the world! Wonderful!I see that I am becoming incoherent, as usual when I try to review a book I haven't finished thinking about. Enough then. Read it yourself if it sounds like your kind of thing."}, {"userName": "Tina", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/14260681-tina", "userReview": "A gem of a book. A balm to the soul and a lesson on the failings of man and the beauty of life at the same time. I know I will want to read Jayber Crow more than once."}, {"userName": "Mmars", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/2243098-mmars", "userReview": "Occasionally a book comes along that you savor and don’t mind spending a looong time reading. Jayber Crow tells his contemplative life story at a slow pace. Early on in my reading, the image and voice of Mr. Rogers popped into my head. Not to say they are anything alike! I absolutely loved Jayber’s way of telling. How he sets up the day or event he wants to talk about, how he goes through his thoughts and philosophies relating to the experience, how he describes the terrain of a place, how he describes the actions of others as he saw them and as how what he tells fits their personalities. My own fondest memories of a rural childhood were stirred up by this book. That of the farming community. The fathers of the children growing up on farms nearby (about a 5-6 mile radius) had grown up with my father, had been and were my father’s friends. And undoubtedly, for some, this went back another generation. In summer, these were the kids I played softball and took swimming lessons with. The ones whose parents’ conversations lingered well past dark while we played shadow tag and caught fireflies. My Port William community.But I have another affection for this book. Jayber has his own way of looking at expressing things. Early in the book he says how lucky his was. That after losing his parents at the age of three, and his only other relatives/and caregivers by the age of ten. But he was lucky in many ways. His decisions were not always wise or thought through. But things always worked out well for him. And he is no saint! Jayber (and Berry) is a wonderful observer and storyteller and the stories of the community take up their own chapters. Personally, I enjoyed these. This is now the third of the Port William community books I’ve read and I’ve been enjoying learning about the characters. The book isn’t perfect and it certainly won’t appeal to any reader who reads for plot. But for those who enjoy to take their reading slow, there’s a lot to savor."}, {"userName": "Stephen", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/7240015-stephen", "userReview": "\"Telling a story is like reaching into a granary full of wheat and drawing out a handful. There is always more to tell than can be told.\"Jayber Crow is many things. It is one of the most agonizingly beautiful and moving novels I have ever read. It's a lyrical testament to the power of love, the richness of community, and the pleasures of a life lived close to the rhythms of nature. And it's also the story of a man named Jonah, called Jayber, who once thought he had the call to preach, but left the seminary to practice barbering to live out the questions that the seminary had no answers for. It is the story of a man twice orphaned, who went on a journey, a pilgrimage, and found himself. It is a work of art.I should acknowledge from the start that I am biased to like -- to adore -- this book, for the author's narrative voice is the kind I like best; gentle, wise, and slyly witful. I was unable to simply read the book; it had to be read aloud. Slowly. Multiple times. The text is swollen with sentences that, like fruit hanging from a tree, demand to be plucked and savoured; they have body, being something beyond ordinary words. Jayber Crow isn't an action drama with a clearly defined Conflict, Rising Action, Climax, and Conclusion; it's a coming of age story, in which the gracefully maturing subjects are both Jayber and his adopted home of Port William. Jayber is a child of the Great Depression, and arrives in town shortly before the outbreak of World War 2. That war and those that follow will hurt his fair city, but the pain of them brings his characters to life all the more. It is a deeply reflective novel, in which Jayber will begin to wax poetic about one topic or another -- the decline of ecologically-savvy family farms and the advent of debt-based agribusiness, or the damage automobiles do to one's sense of place -- for a spell before returning to telling the story of Port William as it attempts to survive the 20th century like a little skiff tossed in a turbulent ocean.If I could only ever read one novel for the rest of my life, Jayber Crow would be it. The idea that it has only been in existence for thirteen years is staggering. It seems ageless. I think the only words that do Jayber Crow justice are the words of the author himself.================================For a long time then I seemed to live by a slender thread of faith, spun out from within me. From this single thread I spun strands that joined me to all the good things of the world. And then I spun more threads that joined all the strands together, making a life. And when it was complete, or nearly so, it was shapely and beautiful in the light of day. It endured through the nights, but sometimes it only barely did. It would be tattered and set awry by things that fell or blew or fled or flew. Many of the strands would be broken. Those I would spin and weave again in the morning. p. 330=================================One Saturday evening, while Troy was waiting his turn in the chair, [he said] \"They ought to round up every one of them [war protesters] and put them right in front of the communists, and then whoever killed who, it would all be to the good.\" There was a little pause after that. Nobody wanted to try and top it. I thought of Athey's reply to Hiram Hench.It was hard to do, but I quit cutting hair and looked at Troy. I said \"'Love your enemies, bless them that curse you, do good to them that hate you.'\"Troy jerked his head up and widened his eyes at me. \"Where did you get that crap?\"I said, \"Jesus Christ.\"And Troy said, \"Oh\".It would have been a great moment in the history of Christianity, except that I did not love Troy.=================================================="}, {"userName": "Jill Courser", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/50868816-jill-courser", "userReview": "There is so much wisdom in this book - probably enough to last me the rest of my life. I know this will be a book I will return to many times, because there is absolutely no way I could take in everything on the first read. I have long been a fan of Wendell Berry for his insight into agriculture and rural life, but this was my first novel of his. Jayber Crow is now at the top of my list of favorite books...so profound that I'm not even quite sure what to say about it. The story reminded me so much of stories my grandma told me about her childhood and brought back so many precious memories with her. If there was a way to give more than 5 stars, I would. Port William will be a place I revisit many times, I am sure."}, {"userName": "Erick Petersen", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2064787-erick-petersen", "userReview": "I Read this last year and I must have forgotten to add it to my goodreads. I probably would have given this book five stars at the time I finished it, however, my opinion of the book has since waned. I think a lot of it has to do with reading some of his essays and excerpts. Am I the only one who gets the impression that this is one grumpy dude who lives in KY? Every time I read something by him I hear this recurring subtext that says: \"If you are not a pure zero-emissions farmer living off the land then you are a worthless human being - if any part of your lifestyle requires the burning of coal then kill yourself now for the good of mankind.\" Don't get me wrong, the man can certainly write beautiful prose and there are a lot of great moments in the book. But he can use a manual typewriter all he wants (during daylight hours only so as not to burn coal!) but when he sends his manuscript to his publisher what does he think will happen then? How about the burning of coal and fossil fuels to print thousands of copies and sell them in bookstores. I'm willing to guess the process of getting one of his books in my hands burns enough fuel to make Al Gore's corporate airplane jealous.I think this book propagates a certain dualistic Christian worldview that I am increasingly becoming disillusioned with. We can scream all we want about people using tractors when they could be using horses, but isn't that a bit like attacking the symptoms of the illness instead of the illness itself? The answer isn't to stop burning coal, the answer is to seek repentance for sins. Greed and avarice are the bigger problems as far as the environment is concerned. For more on where I'm coming from here I suggest Ben Merkle's great article on eco-guilt in Credenda Agenda. And don't even get me started on the bit about being secretly married to someone.All in all not a bad book and I might read more Wendell Berry in the future...that is if we have a future left after all the tractor using types have had their way with planet earth. BTW, I purchased carbon credits to offset the use of non-renewable energy while typing this on a computer."}], "description": "For thirty-nine years Wendell Berry has brought us stories from the fictional town of Port William, Kentucky. The latest, Jayber Crow, is the story of a man's love for his community and his abiding and unrequited love for Mattie Chatham, \"a good woman who had too early made one bad mistake\". Sent to an orphanage at the age of ten, Jayber grows up knowing of loneliness and want, and learns how to be a watchful observer of human goodness and frailty. With the flood of 1937 he returns to his native Port William to become the town's barber. Slowly, patiently, the observer becomes participant.\"This is a book about Heaven\", writes Jayber, \"but I must say too that it has been a close call. For I have wondered sometimes if it would not finally turn out to be a book about Hell -- where we fail to love one another, where we hate and destroy one another for reasons abundantly provided or for righteousness' sake or for pleasure, where we destroy the things we need the most, where we see no hope and have no faith...where we must lose everything to know what we have had\".Sounding themes of love and loss, despair and deepest joy, Berry's clear-sighted artistry in depicting the Port William membership will not soon be forgotten.", "title": "Jayber Crow", "url": "http://www.goodreads.com/book/show/1051801.Jayber_Crow", "average": 4.34, "cover": "https://images.gr-assets.com/books/1387739482l/1051801.jpg", "reviews": 1205, "authors": [{"url": "https://www.goodreads.com/author/show/8567.Wendell_Berry", "name": "Wendell Berry"}], "type": ["Fiction", "Historical", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/1051801.Jayber_Crow", "http://www.goodreads.com/book/show/57460.Jayber_Crow", "http://www.goodreads.com/book/show/9284904-jayber-crow", "http://www.goodreads.com/book/show/8817200-jayber-crow", "http://www.goodreads.com/book/show/146198.Hannah_Coulter", "http://www.goodreads.com/book/show/146191.The_Unsettling_of_America", "http://www.goodreads.com/book/show/227274.The_Memory_of_Old_Jack", "http://www.goodreads.com/book/show/146150.Sex_Economy_Freedom_and_Community", "http://www.goodreads.com/book/show/76729.The_Collected_Poems_1957_1982"]}