{"ratings": 1111, "userreviews": [{"userName": "Edward Lorn", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "Once upon a time, there was an old magician. We’ll call him Not Quite Gandalf. Not Quite Gandalf quite enjoyed scatological metaphors and similes, and what kids in his day called Funny Books. Not Quite Gandalf, not quite comfortable in his own skin, decided one day that his legacy should not be Funny Books. So he decided to collect all of his unused ideas into one fuck-all-big tome and call it Jerusalem.(Man, I see an Internet Rage Machine out there right now. Their face is beet red and there’s smoke blasting from their ears. They’re looking for the comment box, but Goodreads is telling them that they cannot comment because they are not friends with the fat fuck who just called graphic novels “Funny Books”. I’m kidding, Internet Rage Machine, calm your man-boobs.)The point of the opening paragraph is to illustrate Alan Moore’s mindset. (See what I did there? Illustrate? Because he writes Funny Books? I’m clever. That’s called wordplay. I’ll throw in a shitty metaphor later, see if you catch it. It’ll be fun. Like one of those spot-the-difference games.) With the publication of Jerusalem, we see the actions of a wizard in the later stages of life, desperately begging to be taken seriously. “I wrote a massive fucking book, me. I’m a proper bloke now.” Internet Rage Machine: “Your parody of the Queen’s English is offensive!”Me: “Oh, sugar, you ain’t seen nothin’ yet.”The main issue I have with this kitten-squisher of a novel is that it’s not a novel. It was marketed as a novel. The goddamn cover calls it a novel. Even Not Quite Gandalf calls this motherfucker a novel. But it is not only a novel. A terrific three-hundred-page novel resides inside this clusterfuck, though. If Not Quite Gandalf had accepted the services of an editor (wonderful people, editors), we might have received a better all around experience. What we do receive is a novel bookended by two loosely (and, gotdammet, I mean LOOSELY) connected short story collections. Imagine you have a bowl of salt. Dash a bit of black pepper into your bowl of salt. You still with me? Coolio. Now focus on the bits of pepper. There’s probably a hundred or so miniscule flakes of black pepper on the surface. What I need you to do now is to pick up the bowl of salt and give it a shake. Right. Good. Now dig through all that salt and FIND MY MOTHERFUCKING PEPPER, ASSHOLE! When you read the synopsis for this panda-ass of a novel, you’ll see that someone thought it’d be cute to say it’s a book about EVERYTHING. Well, they’re not being cute. And therein lies the problem, ya dig?Every chapter, except one written in verse and another that’s just shorter than all the rest for no real apparent reason, is 30-65 pages of brick after brick of text. If Not Quite Gandalf had edited these chapters down to the pertinent details of the world he was creating, I wouldn’t have anything to bitch about. But you’re going to read about EVERYTHING. Not Quite Gandalf seems to think that EVERYTHING is interesting. But it’s not. There’s a reason why most humans suffer from Cognitive Blindness. Cognitive Blindness is what makes Hidden Object Games so appealing to us highly evolved apes; our brains are programmed not to give a fuck about EVERYTHING, so we only focus on what we deem important. Not Quite Gandalf does not seem to have that problem. He thinks you give a fuck about EVERYTHING. I, sadly, do not. I do give a fuck about a cohesive storyline, which is in here… somewhere. Because this book does make sense. There is a good story in here. You just have to dig through the salt to find the goddamn pepper. The lackadaisical editing and perpetual pontification present in this fecally-minded, masturbatory miasma of intellect and madness creates a colostomy bag of calories that goes straight to one’s ass cheeks like a White Russian with wee-colored margarine in, to smooth and soothe your tender palate, as the author’s warm, room-temperature load slides down your gullet and you retch and pass a burnt umber and ochre coal of waste into your knickers, in which resides a ratty resident known as Tom the Diamond, a shit-encrusted man-troll hellbent on fathoming the words this fat fuck wrote on the internet in a weaseling attempt to corrupt the good name of an overhyped author struggling to be taken seriously outside of the world of Funny Books.Did you have fun reading that last passage? Good. Read this fucking book, ya muppet. Because that is what you’re going to get. Page after page of rambling as Not Quite Gandalf force-fucks his thesaurus into a family way. Ten years of anal coitus with a Word Find is the only possible meaning behind this bloated and belligerent belly-laugh of a book. See, Not Quite Gandalf, you’re not the only one who can write like that. Doesn’t make you any more or less special. Any literate cocksucker can string together nouns and verbs into a Yorkshire pudding of madfuck meanderings. This book is an accomplishment in the same way that watching a man bash his beanbag in a drawer repeatedly for ten years would be an accomplishment. “He didn’t give out after the first slam? Ya don’t fuckin’ say! He’s still going? Fuck off! Wait… he really is STILL going??? I gotta see this!!!” And that’s why I finished this book. I know how fucking crazy Not Quite Gandalf is. I expected page after page of nuttiness, but I thought this would be entertaining moreso than not. Being inside the mind of a man off his meds should’ve been a blast from beginning to end. But Not Quite Gandalf has some whole crackers left in the sleeve, and these injections of sanity are not fun to read at all. I know more about British history than I ever needed to know. I know about how you folks across the pond went from the barter system to gold to coins and paper money. I know a bit of Sierra Leone history. I know the ins and outs of Northampton because Not Quite Gandalf describes it in every fucking chapter. Think you know your way around? Took the tour, didja? Well, too shitting bad, ya dense pudding, you’re coming along for the next 34 tours, because fuck you, that’s why.Jerusalem is not completely terrible. I loved quite a bit about the second book. Imagine Neil Gaiman’s NEVERWHERE and King’s IT mashed together. Sound like fun? For the most part, it is. The Nene Hag was amazingly well-concieved, as were any of the snooker scenes. Unfortunately, once you’re done with Book Two, you still have Book Three to contend with, and there’s not a motherfucking ounce of those last 400 pages that I enjoyed. Why? Well, this next bit is a spoiler, and no, I’m not hiding it with a spoiler tag because… well, you’ll just have to fucking see, won’t you.The last chapter of the book is a rendering in words of the cover. That’s right. Not Quite Gandalf spends fifty of the last sixty-page chapter going over the cover art of the book. The last ten pages are cool, but they left me with a sore feeling in my asshole, as if I’d just been to prison—a virginal sense of “That’s it? That’s what all the fuss was about?In summation: Not Quite Gandalf, I hope you’re remembered how you want to be remembered. Me? I’m gonna remember you for this.Final Judgment: Thank fuck this was a gift from the publisher.Author’s Note: By request, this review, without this final postscript, from opening line to the final judgement, is, according to my version of Word 2013, 1,280 words long. You’re welcome."}, {"userName": "Bradley", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "It took me ten days to read. 60 hours for an audiobook. Nearly 1300 pages.Still, it took me ten days to read this. I'm shocked. I'm also quite amazed at the brilliance of this book.I'm thinking of also getting a bound copy of this book to open up at random whenever I want my mind blown and just stick my finger in it and osmose the hell out of it. It's that kind of dense, crazy book.The only book that comes close to it is Infinite Jest, and I like Jerusalem a hell of a lot more. It has an enormous sharp cast of misfits, crazies, poets, junkies, whores, and dead kids... but wait! It also has the builders of reality, demons, nagas, and a little corner of Northampton called the Burroughs that is the nexus of all freaking reality and all the dead can travel up the street to the future or back down the street to the past and have a blast.Seriously, the first load of the novel had me wondering if I was just reading a literary fiction like Infinite Jest with a ton of outcasts and thankfully interesting normals as they screwed, did drugs, or whatnot. All the while, I learned more and more and more about this little 'burb, it's history... sooooo much history... and then we started getting characters out of our modern setting in full glorious detail and imagining. The history is starting to get applied, practically. But still, I'm not totally impressed. After all, I came at this knowing that Moore can blow my mind as with the later volumes of Swamp Thing and V for Vendetta and Watchmen. I wanted SF or Fantasy or both.And then a funny thing happened deep into the text.A little kid choked on a cough drop for 11 freaking chapters.WTF? Right? Realize something here: this is an author who grew up on all the greats of literature, and I see a ton of James Joyce right here. In fact, James Joyce shows up here. So does Samuel Beckett, Thomas Beckett, Cromwell, and even William Blake! :) Tons of poets and writers who are dead, along with this little kid, show up and travel all space and time. Mostly it's just the Dead Dead Gang, a group of 7 year olds who pit themselves against eternal demons and save the newly-dead kid from a deal with a really big-deal devil, take him under their wing, and travel up and down the streets of afterlife Burroughs where we REALLY get a taste of all that history that Moore has been giving us.Pretty awesomely, in fact. :) And then the \"normal\" characters keep poking their heads in on us in strange and unusual ways as we see below the fabric of reality and see in the fourth dimension and get the idea that \"crazy\" on our side is really just \"saint\" on the other. Things get really strange in a big way. And even crack whores can be \"Innocent\" and \"pivotal\" in the salvation of the universe. :) Which hangs on a billard game being waged by the Builders, the angels and demons in this very *differently* imagined afterlife/4th dimensional landscape that's in so many ways so much better than Christopher Priest's The Inverted World and a hell of a lot more interesting and vivid, too. After all, we get to go 3 billion years in the future with a beautiful dead baby on a man's back to see the death of stars, too. :)But the really big question that gets raised in this tome is the nature of predestination. Is everything set in stone? It's one hell of a clunker of a theme, and we get everything from crack whores to tons of poets to dead children to angels and demons asking this same question. And if the crux of the universe is this run-down barrow of a shithole and the second coming of christ is a 3-year-old who reaches brain-death before miraculously coming back to lead a normal life, we have to ask ourselves a lot of deep questions that's not strictly religious in nature.And the language? Oh my god. Alan Moore writes a huge tract of poetry here. Think pre-dictionary middle-English poetry firmly ensconced in modern day sex scenes, science, and art, written floridly and gorgeously even when we're talking about flying sperm. It's not for the faint of heart, but it is certainly cray-cray and ambitious and we as readers can't take ANYTHING for granted. Are these characters simply well-drawn vehicles for an enormous showdown between the builders of the universe? Or is this also a subtle and not-so-subtle satire on literature, too? Both, I think.I know one thing for sure. It's an amazing feat of literature. It's not easy and it's not meant to be, either, but it flows and everything is drawn to amazing limits and it's DEFINITELY NOT NORMAL. You want a challenge? You want ENORMOUS traditional literature, poetry, religious thinking, epic space/time travels, ghosts, historical persons, gritty neo-realism, and a major discourse on WHAT IS ART? Look no further. :)Let's say we could write a book on this book. Or perhaps, someday, there will be whole courses on this massive tome like there is for James Joyce's Ulysses. You can plumb these depths for years and still find hidden gems. I'm certain of it. One read is definitely not enough. And if you publish your dissertation on his novel and get your PHD on his coattails, then congratulations! :)I can totally understand if it daunts most people. I'm also intimidated. And I actually KNOW most of the artists and *some* of the history. And yet, I remain DAUNTED, too. :)But it's so worth it. :)"}, {"userName": "Warwick", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "The town of Mansoul, in Bunyan's The Holy WarWhen Alan Moore was asked why he had made his book so gigantically long, he gave the magisterial reply, ‘So that only the strongest might review me.’ Faced with the prospect of nearly a million words about Northampton – a chav-haunted and rather neglected old market town like dozens of others in the UK – reserves of strength certainly seem called for. And the book's longueurs are especially frustrating in this case because it quickly becomes clear that they're getting in the way of that rare thing – a really tight thousand-page novel. As it is, despite the book's many delights, not all of its slower passages can really be justified.The meganovel is divided into three novel-sized books, so let's look at these one by one. The first consists of several day-in-the-life narratives of various people wandering through Northampton at different points in its history, from the first century AD to now. It's during this section, before the novel's themes or its structure have become apparent, that patience will most be required. Moore has an unfortunate tendency to narrate every tiny action in meticulous detail; I tried, but it's hard not to see this as an artefact of a comics writer being overwhelmed by the possibilities of working only in text. Whatever the cause, the effect is to give many passages the claustrophobic feel of a film shot all in extreme close-up:Mick nodded, fumbling in his jacket for the brand new pack of fags he'd picked up half an hour back on the way down Barrack Road. He peeled the cuticle of cellophane that held the packet's plastic wrap in place down to its quick, shucked off the wrapper's top and tugged the foil away that hid the tight-pressed and cork-Busbied ranks beneath, the crinkled see-through wrapping and unwanted silver paper crushed to an amalgam and shoved carelessly into Mick's trouser pocket. Taking one himself he aimed the flip-top package at the grateful teenager in offer and lit up for both of them using his punch-drunk Zippo with the stutter in its flame. As they both blew writhing, translucent Gila monsters made of blue-brown vapour up into the Boroughs air the boy relaxed a little, letting Mick resume his pep-talk.This pause in conversation should be half a sentence, a line at most, and it's the sort of paragraph that any editor would put a red line through on a first pass. But Moore's complete rejection of any editing advice is staring up at you from every page, and in a good light, if you squint a bit, it's possible to see these moments of outrageous overwriting as part of the book's charm. (At other times, the repetitions and unnecessary detail may have you pulling your hair out.)What does impress during these early chapters is the fantastic variety in voices that we are offered – an American freedman in the nineteenth century, a homeless kid, Charlie Chaplin on an early tour, and of course Moore himself, appearing here in drag as ‘Alma Warren’ but otherwise unmistakable. These sections are narrated in third-person but adopting the voice and tone of the central character, and Moore is a surprisingly convincing mimic – here he is channelling a mixed-race teenage prostitute:It was like, three, four months ago when Keith was seeing to it that she got more work. There'd been, what, two or three nights, five nights at the very most when she'd brought punters round the flat. Not even late, only like two o'clock or that, and fucking Wayne and Linda Roberts on their fucking doorstep every fucking time and banging on at her about the noise, giving it this about their fucking baby, all this with her punters looking on and listening while she got called every cunt under the sun and is it any wonder she'd had a go back? Five fucking times. Six times at most, and then they'd had them put the ASBO on her.(This from a chapter called ‘ASBOs of Desire’, in one of many running, punning references to Blake's hymn.) He jumps from this wonderful and completely unexploitative appropriation to the voice of an eighth-century Saxon priest returning from pilgrimage to the Holy Land:On his return, from the white cliffs he'd walked the Roman road or bumped along on carts where he should be so fortunate. He'd seen a row of hanging-trees like fishing poles set out beside a river, heavy with their catch. He'd seen a great red horse of straw on fire across a murky field, and an agreeable amount of naked teats when herlots mocked him from an inn near London. At another inn a dragon was exhibited, caught in a mud-hole where it sulked, a kind of armoured snake that had been flattened, having dreadful teeth and eyes but legs no longer than a footstool's. He had seen a narrow river dammed by skeletons. He'd seen a parliament of rooks a hundred strong fall on and kill one of their number in amongst the nodding barley rows, and had been shown a yew that had the face of Jesus in its bark.By now we are three or four hundred pages in and there is still no real plot in sight, but not many books will give you such a range of voices and viewpoints to live through. Things start to change, though, in Book Two, which in real terms covers about six minutes in the subjective world of a three-year-old boy choking to death on a Tune. In this section, Alan Moore lays out his grand theory of metaphysics, and we realise that the entirety of the first book was just a kind of series of footnotes to the real narrative he's proposing.Taking his cue from Einstein, Moore argues that if time is a fourth dimension, then the past has just as much solid reality as the present, only shifted into a direction along which we cannot travel. This ‘eternalism’ is something he's been talking about since at least Watchmen (where Dr Manhattan discusses it), and it also plays a large part in Vonnegut's Slaughterhouse 5. In such a block universe (which scientifically speaking is quite defensible, I believe), death is ‘no more than a geometric term’, ‘an illusion of perspective that afflicts the third dimension’. Free will is also an illusion, and everything we do or feel has been inevitable since the Big Bang.The primal detonation is still going on, is here, is now, is everyone, is this. We are all bang, and all the thoughts and doings of our lives are but ballistics. There are neither sins nor virtues, only the contingencies of shrapnel.In Jerusalem, we travel to the metadimensional world that overlays our own – or at least, that overlays the Spring Boroughs area of Northampton which is Moore's primary concern. Here, the dead mix with the angels (rebranded in Moore's cosmology as ‘angles’), peering down into the individual slices of time which, frozen as though in amber, or blending together, make up our own experience of the world.Looking west down the raised highway, Michael saw Northampton Castle being built by Normans and their labourers, while being pulled down in accordance with the will of Charles the Second fifteen hundred years thereafter. A few centuries of grass and ruins coexisted with the bubbling growth and fluctuations of the railway station. 1920s porters, speeded up into a silent comedy, pushed luggage-laden trolleys through a Saxon hunting party. Women in ridiculously tiny skirts superimposed themselves unwittingly on Roundhead puritans, briefly becoming composites with fishnet tights and pikestaffs. Horses' heads grew from the roofs of cars and all the while the castle was constructed and demolished, rising, falling, rising, falling, like a great grey lung of history that breathed crusades, saints, revolutions and electric trains.It is a refreshingly working-class view of the afterlife (referred to in one verse chapter as a ‘higher mathematic space / Of proletarian eternity’), where the main supernatural beings are called Builders, rolling their sleeves up and supporting reality with good honest manual labour, or playing for people's lives with a cosmic version of snooker called trilliards. These Builders/angles speak a rather fascinating compound language, whose brief utterances ‘unroll…inside the listener's head into a long speech full of thunderous and ringing phrases’, so that for instance the exclamation ‘Iyeexieesst’ is said to mean:Yes! Yes! Yes, it is I! Yes, I exist! Yes, it is here in this place of excess that with a cross the centre shall be marked. Yes, it is here where is the exit of your journey, where both ye and I are come together. Yes, yes, yes, unto the very limits of existence, yes!Asmodeus, Alan Moore (1994). This was painted after a drug-induced encounter with the famous demon Asmoday, who plays a key role in the book as the anagrammatical ‘Sam O'Day’The Builders' experience of the world is sublimely described by Moore in one of the book's most beautiful and mind-expanding chapters.Of course we dance on pins and level cities. We deliver up the Jews from Egypt, unto Buchenwald. We flutter tender in the first kiss, flap in agony above the last row in a draughty kitchen. We know what fellatio tastes like and how childbirth feels. We climb upon each other's backs in shower cubicles to flee the fumes. We are in the serene molecular indifference of the Zyklon and the dull heart of the man who turns the wheel to open up the ducts. We are forever standing on those bank steps in Hiroshima as the reality surrounding us collapses into an atomic hell. That moment when you reach your orgasm together and it is the sweetest, the most perfect instant that you ever live through, we are both of you. We keep slaves, and we write Amazing Grace.This is from Book Three, where the natural and the supernatural come together, and where Moore produces his most experimental and exhilarating writing. This includes, famously, a chapter about Lucia Anna Joyce (who was confined in a Northampton asylum) written in the style of Finnegans Wake. As a Wake fan, I expected to find this trite and annoying, but I didn't, I thought it was great. The language is well motivated by the fragile mental state of Lucia (‘the flamous rider's cross-i, dot-t doubter’) and full of thoughtful polysemantic puns, and the chapter ends with LAJ sixty-nining Dusty Springfield, which is really not where you expect a book to take you.Among the other delights of Book Three is a wonderful chapter told from the point of view of obscure character actor Robert Goodman, who, apparently in the throes of a minor breakdown, is imagining himself to be some hardboiled noir detective.‘It's what you'd call a first-draft face, after the angry and frustrated crumpling…cresting the dirty suds and breakers of another dead-end town, a burned-out world as fallen as his arches.’The crucial thing about Jerusalem, and the aspect that made me personally feel increasingly moved and excited by it, is that the flights of metaphysical fancy are always firmly anchored to the worm's-eye realities of daily life in Northampton's Boroughs district. This historical centre is now a fairly grim collection of ‘stack-a-prole’ council estates, ‘nappy-flagged back yards’, FOR SALE signs, boarded-up windows and bookies shops, ‘up in the top two per cent of UK deprivation. Simply living here takes ten years off your life.’ Moore's book positively throbs with sympathy and protectiveness for the people here, and anger at the public officials who have seen the poor as ‘problems of cost and mathematics that could be resolved by tower-block proposals or by columns in a balance-book’.The NEWLIFE building – ‘like two great big fingers raised in a titanic V-sign to the Buroughs.’As Alma Warren, Moore allows himself to vent his fury over this stuff, and the passion is searing:Her point is that despite the very real continuing abuses born of anti-Semitism, born of racism and sexism and homophobia, there are MPs and leaders who are female, Jewish, black or gay. There are none who are poor. There never have been, and there never will be. Every decade since society's inception has been witness to a holocaust of paupers, so enormous and perpetual that it has become wallpaper, unnoticed, unreported. The mass graves at Dachau and Auschwitz are, rightly, remembered and repeatedly deplored, but what about the one in Bunhill Fields that William Blake and his beloved Catherine were shovelled into? What about the one under the car park in Chalk Lane, across the road from Doddridge Church? What about the countless generations that have lived poor and have in one way or other died of that condition, uncommemorated and anonymous? Where are their fucking monuments and special ringed dates on the calendar?Northampton town centre looks like many another run-down English city, and in fact one of the great things about Jerusalem is the way it makes you realise that a similar epic could be written about the neglected history and inhabitants of Gainsborough, Hastings, Luton, Hull. I am pleased that Alan Moore is angry about it. Northampton was one of those areas that was gradually being reinvested in thanks to the EU's Structural and Investment Fund, which pumped €598 million into the East Midlands for the 2014-2020 period. Northampton voted 59 percent for Brexit. (Moore has said that ‘I hadn’t realised how surrounded by idiots I was,’ although, as an anarchist, he did not vote himself.)Spring Boroughs, Northampton, by insert_user_name on FlickrIt's this area, neglected, apparently unimportant, that Moore positions at the heart of his Brobdingnagian legendarium, his Midlands Misrulysses, and all his wordplay and explorations of language, history and atomic physics are there to provide a monumental apotheosis for Northampton. I found that very moving.Jerusalem in some ways feels like it's not come out of the Western literary tradition at all – it's like looking at some huge nativist canvas whose solecisms and errors are not errors, but the features of a parallel tradition with different priorities and sensibilities. That may sound unduly generous, but that's what happens with a book this size – it starts to reprogram you. Alan Moore has done something insane, and glorious: he's taken a tiny working-class district of Northampton, and convinced you that it can be made the centre of the universe – the heart of England's green and pleasant land, and also, at the same time, the very essence of its dark Satanic mills.ENVOISay, maiden; wilt thou go with meIn this strange death of life to be,To live in death and be the same,Without this life or home or name,At once to be and not to be—That was and is not – yet to seeThings pass like shadows, and the skyAbove, below, around us lie? from John Clare, ‘An Invite, to Eternity’"}, {"userName": "Althea Ann", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "Yes, it took me a whole four months to read this book, which may be some sort of record for me!Starting 'Jerusalem,' I wasn't sure what to expect. I'm familiar with Moore's graphic work, but excellent graphic novels do not necessarily translate into excellent thousand-plus-page works of prose. I was quite pleased to discover, then, that Moore is truly an adept and accomplished writer, with a huge breadth and depth of styles.In some quarters, 'Jerusalem' is being hailed as Moore's masterwork. It's an exploration of both the present and past (not to mention the possible future) of his hometown of Northampton, England. Moore posits an afterlife where dimensions are different, and the dead can travel through time just as we can travel from one physical place to another. This gives him a huge scope to work with, as his narratives career wildly from small and seemingly-inconsequential details to the most world-shaking and momentous of events. If one could say there's a main character here, it may me that of a small boy who, choking, finds himself in this afterlife. Hooking up with some other 'kids,' the \"Dead Dead Gang,\" they gallivant around on a wild tour. But that's hardly the only aspect of the book. It's incredibly ambitious, and is clearly the work of many years.It's also clearly nearly wholly unedited. While it is, as I said, an arguably masterful work of prose, I'd really hesitate to call it a novel. Although the various parts of the books are united by theme, and there are many characters that we keep looping back to, there really are quite a few wholly separate works here, that feel sort of jammed-together. I felt like many of them were possibly not even written 'for' this book, but that at some point everything in the pantry got thrown into the pot and then it was all called stew. Some people are certainly going to love this. Just as certainly, some people are going to give up. It's long, and although the bulk of it is eminently readable, there are parts that are challenging. I admit that I skimmed through large parts of the segment from the perspective of a woman in an insane asylum, where every phrase has a double meaning, and more words than not are newly-minted. At first, I found that section brilliant and clever - but after 30 pages of it, my appreciation began to wane. (I read every word of all of the rest of it, though!)The book as a whole is definitely a must for anyone from Northampton! I am not, but I still found the historical aspects fascinating and illuminating.Many thanks to the publisher, Liveright, who gave me one of the very first copies of this book in existence! It's much appreciated. As always, my opinions are solely my own."}, {"userName": "Leo Robertson", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/7619789-leo-robertson", "userReview": "FUCK—this got more traction than I expected so Mr Moore, if you discover this, please don't read it: this is not how I'd explain my reaction to this book to you. I write reviews for readers only. I love seeing writers make big, ambitious flamboyant things, so please keep fighting the good fight :) Unfortunately this one wasn't for me. That's all.(You think this is an unnecessary safeguard? Once two writers responded to my reviews of their books on the same day. I'm not taking any chances.) Reading matter below for people who are not Alan MooreI put book two, which is 800 pages long, in my bag because I was like 'Leo, man, you gotta get back to this one' and then I was like 'Fuck you Leo, why, why should I read this? Because it cost me £40?' It cost me £40!! Oh God, don't tell anyone. What a waste of money. But I promise you that's the only reason I was considering persevering.I'm not reading this and I will miss out on NOTHING.Anthony Burgess said in his Paris Review interview that he thought Joyce had held onto Ulysses too long and there were breaks in style between its earlier and latter passages and I agree that there's a time limit to getting books written. City on Fire, Ancient Evenings, 2666, The Tunnel, Marcel Proust's Tyler Perry Presents A Madea Brief History of My Favourite Flowers PS I'm Totally Not Gay (not The Man Without Qualities: that's precious) whatever: overly gestated works don't work and this is a prime example. A fondness grows over time for passages that aren't doing the book any favours, but you'll fight to keep them in. You lose sight of that initial emotional core that got you writing the thing in the first place. You end up doing things I don't consider the writer's job at all.There is, I think, a maximum quality of writing. It's the balance between astute observation and simple enough language or something like that and when writers try to go where no writer has gone before, sometimes they just start listing everything in the room when the emotional thing was happening or dedicating whole passages to descriptions of weather that weren't even where the emotional thing was happening and you're like, 'Yeah, I've never seen a writer go into that much detail about that inconsequential thing, but only because it was inconsequential.' You know, that listing broken shit in middle class houses style that wins awards. The OCD attention-to-detail I've seen work only in David Foster Wallace's Oblivion and nowhere else. People say Knausgard but meh. So it's like, if a character walks from one place in Northampton to some other place, cut it out, don't start telling me what the streets look like and the name of every statue on every fucking corner the character turned. That's the opposite of genius. People these days, I swear, they write novels like theirs is the first novel in existence, their characters musing over the same shit characters have mused over for like centuries. The balls of it!Write a negative review because you might just save a life: I read a review that had the same negative things to say about this after the book was done as I did after book one, so... Like, when I read Stephen King's It I thought there was an interesting 300pg book trapped within it but unfortunately I forgot all of it and if there's a book trapped in your book it's not like readers can carve it out in retrospect: it can't really be found, only sensed, and it's too diluted for memory. From my experience.I used to be one of these glutton-for-punishment permatomers but there comes a time in your life when you just have to accept who you are and what your taste is and I really don't care that someone has parodied Finnegans Wake (timely af) or whatever, I don't. I don't have to see that. Part of it's written in a Beckett play style? I haven't even read more than like three of those and I've tried watching performances on YouTube but they're too damn slow.Reading any literature of any externally evaluated \"quality\" is a waste if you don't enjoy it, and if you don't enjoy it, 9/10 the writer has failed you (the tenth time you're just being a lazy POS: it happens.)Update after Book 1If you were wavering on whether or not to read this one, don't. It follows the soulless maximalism of its contemporaries: City on Fire, The Goldfinch, Purity... Guys, what's going on? This isn't writing. It's not even typing. It's more like listing!Two things have happened: of the narratives of maybe ten or so main characters introduced so far–-all of whose names and time periods I've forgotten, so if you were thinking, 'Oh, but in a book this long, it's typical for the reader and author to have to put the work in even for the first 300 pages,' Okay I'll buy that, but I didn't latch onto anything memorable--two met angels. That's right: 350 well-packed pages and two things happened and they were the SAME THING. The rest of the time characters just wander aimlessly through Northampton while Moore rambles their backstories without proper stimulus to do so, mentions what street they're on, etc. Sorry but this isn't exactly a book on the history of Northampton, although it would love to be. ('Hey Leo wanna read this book on the history of Northampton when I'm done with it?' 'Lol m8 why would I do that? You're good.') It's not a geography lesson either. I now know the difference between place and sense of place. Between a map and a built world. I'm sure Moore pictures perfectly every corner of every namechecked street, but I don't (it's most akin to namedropping celebrities without a prompt), and I don't need to either, because it has no relevance to anything: it's just hollow showboatery, which is no fun.But listen: I bought this thing in Norway. It was embarrassingly expensive, so yes, I'm \"invested\", but not in the sense I'd like to be.Like, couldn't he have written 10 books in 10 years and let us pick the best 3 or whatever? Why do this?Save yourselves."}, {"userName": "Nathan \"N.R.\" Gaddis", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/7607437-nathan-n-r-gaddis", "userReview": "Well then. A paucity of stars if it concerns the level of my 'enjoyment'. More than a paucity of stars for the object, that is, for those of whom we can say, At least people are reading this kind of book. I mean, it's a good einsteigs novel into that realm of the big fat brainy erudite digressive mess of a fictional artifact. And that's not altogether a bad thing. Kind of like The Selected Works of T.S. Spivet for YA, should maybe Jerusalem for the comic book and fantasy set. So for form/structure it makes the grade. For content and prose, not so much. Let's take a (brief) look.And really I think that's all there's really to admire about it. Moore takes on the meganovel, the maximalist challenge and it really does look like one. It looks like one. Everything of course is circulating around the borough of Northampton but too the narrative pov circulates among the cast of characters, their own wanderings allowing us to glimpse encounters between two and episodes among several from varied perspectives. This is kind of nice. But of course there's an overlayered samey-ness to it all, the samey prose and the same wandering through streets and streets and other synonyms of streets, the whole map thing reiterated ; you can literally retrace each character's steps through their Northampton wanderings (literally) ;; and the only misc back-of-the-book thing we are offered is a Northampton map which (I usually read every page of a novel including copyright) I proudly say I nary but glanced at. It's a literalistic failure it is. And so every character is doing the exact same wandering as every other character and they are all pretty much rendered in the same literalistic prose. There is of course some variation in voice and tone from one character to another, but overall you get Moore (of course, but more below). And so the real formalistic performance gets held back until the Third (of three) Part in which each chapter is rendered in some different form--the famous Lucia chapter rendered in (a kind of) Finneganese, a Private Dick chapter rendered all in cliches, a play (featuring an unidentifiable Samuel Beckett), a song/poem, and things of like measure. It's the good stuff. But it comes too late. By this time you've read 2/3 of the novel with nothing to keep you going but the rumor that the Lucia chapter will blow your socks off.So then. The content. I really could not have cared less for the content. This is of course famously 'subjective'. But I'm not that interested in Northampton nor in working class nostalgia (kind of) and Moore's philosophical-metaphysical axe is just irritatingly a non-starter. As to Northampton, the borough functions as the protagonist of the novel but for this reader it came to little more than geographical cruft. Every street, every square, every building, every dog turd (that one's actually a nice touch!) is painstakingly and precisely identified to the point that you could use the novel itself as a map for your own (tourist) wanderings around Northampton. But I'm not interested in doing that. I'm sure if you literally mapped out every step of every character around every corner of every street you might get some new insight into the novel ; or maybe just be having fun with it. But it's unfortunate for one's main character to be built entirely of cruft (when this is clearly not the intention). And as to Moore's famous Eternalism, which he nearly always daftly puts into the mouth of some character who is appropriately stoned, is either Freshman tosh or Medieval dross. Basically it comes down to the claim that the dimension of our experience known as time is actually just a fourth dimension of space. Time is reduced to spatiality. And Moore enacts this literal spatialization of time in the novel, the long and hair=pullingly stupid vision of his heaven that takes up all of Part Two. What's wrong with this view? [the result of this view is of course that there is no free will and all our actions are pre=determined, which you might find objectionable, but it merely follows from the initial step of spatializing time]. Well, first, it's reductionistic, assumes that space is more primordial than time. And the step involved in reducing time to space makes appeal to some putative 'higher' consciousness whose experience reveals the 'truth' (that time is really space). This is dumb and I'm not interested in spelling it out any further. But second, and most interesting for the novel reader, is that it is performatively contradicted. Every piece of information we are provided with as our characters experience this heaven of spatialized time is provided temporally because the characters experience this no-time heaven temporally. Not only does the spatialization of time result in determinism, it eliminates experience (unless somehow you can conceive of a non-temporal experience which Moore clearly cannot ; but it'd be meaningless anyway). And of course since modern theoretical physics (Moore makes some appeal to science to back up his view) is an experience, something humans have accomplished in their temporal existence, the foundation upon which this putative Eternalism is built upon, well, it falls (trust me). This is the advantage of the phenomenological tradition--it takes our experience (life world) seriously and does not engage in fantasies of 'higher' consciousness. [this has not been a rigorous philosophical take=down of Moore's Eternalism. His mere mentioning the name Ouspensky twice is enough to take him no more seriously on this point than A*n R*and on anything]I know it's not sophisticated to describe a philosophical position as 'dumb' ; just take it as me reporting from the field of my experience of reading this novel. [the performative contradiction is on every page, so right there that it's author sees it no more readily than his own glasses on his nose]And so for the prose. Let's be positive first. There is something of the big and the fat to it ; not much, but he does get some windey sentences in there and of course we have to give him some credit for the performances in Part Three. But for the most part what you get is every noun its adjective and every verb its adverb. Which results then in a very picture-centric prose. Everything is picture picture picture. As if he should've chosen a more visual medium for this project. There ends up being an uncanny rhythm to this adj-noun/adv-verb overdose, but it's just so pictoral. And fittingly of course. Not just because Moore is a comic book guy, but his thinking itself is a picture thinking. Picture prose. In Hegel, the stage just before philosophy (which is thinking the concept, thinking conceptually) comes religion which is characterized as 'picture thinking'. Which is how Moore relates to his Eternalism appropriately enough. The thing to note here is that for Hegel both philosophy and religion have the same content, take the same object as their object (although the object is changed accordingly). Moore takes his Eternalism religiously in this sense (just like Tom Robbins takes his Easternism religiously) ; were he to take it philosophically (conceptually) we would see more movement of thought, some distance from the position rather than an immediate embrace of it, something more like what we get regarding paranoia in Gravity's Rainbow (is Pynchon really a paranoid? it's undecidable). In other words, unlike the prose in, say, Women and Men where we can see the full movement of thinking, in Moore we merely have a picture grasped in words. Further illustrative of my claim here is what happens repeatedly in the Part Two (up in 'heaven)--a character (usually the three year old protag) encounters some totally unfamiliar and baffling object ; the object is first described in all its bizarreness and then immediately the object and its function etc is explained, thoroughly and without ambiguity, to the three year old (yes, a three year old, but Moore technically slips out of that noose on this point). Describe explain, describe explain, repeat.Okay so let's wrap this painful exercise up. The structure/form of the novel is promising. The content, both Northampton and Eternalism, is of no interest to me. The prose is a picture prose. I was expecting much more. And it could be salvaged for my interest and enjoyment, but to do so would require more than the proverbial editor. It would involve a revisioning (taking a greater distance from his beloved heaven=position) and rewriting. But so what if it's not a novel I got off on? Is it a novel for you? If you're here reading this because you are familiar with my reading habits and proclivities and predispositions then I'd say, Don't bother ; there are better Beach and Lite Reads. If you are here because Alan Moore, I'd say, Please, don't mind me! You might really dig it. And but I'd just add, if you do dig it, drop me a line ; there are a lot (a lot) more of these mega maximalist visionary novels out there in the ether you've never heard of and many/most of them are even better (Against the Day just to give you one title).________The Kirkus review ::https://www.kirkusreviews.com/book-re...\"Mind-meld James Michener, Charles Dickens, and Stephen King....[which is a common enough way to id a heck of a lot of todays' lit=fic? should we call it \"an enTartation review\"? ....all the way to the headscratcher] ....Magisterial: an epic that outdoes Danielewski, Vollmann, Stephenson, and other worldbuilders in vision and depth.\"Nowhere close to as inventive as Danielewski, not close to the precise thinking of Vollmann, and much more irritating than Stephenson. I mean, god bless you Mr Moore, but in the year of Bottom's Dream, I just can't see myself quite there yet. And speaking of Jerusalem, anyone reading Clarel: A Poem and Pilgrimage in the Holy Land?"}, {"userName": "Bhaskar Maji", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/12260774-bhaskar-maji", "userReview": "This is the summit of Mount Alan Moore.A compilation of a fierce imagination and extraordinary ideas that Moore spent all his life exploring in comics, this comes across as his seminal work. The novel may not be utterly engaging to some readers, but is fascinating once you let your brain strap on the things that the author wants to tell you and let him take you on a ride. A re-imagined take on life and death and the beyond, the mundane and the absurd, a funny, tragic, finely-wrought, and a terrifyingly energetic work of fiction that delivers as much (heck, more) than the official blurb promises.For the readers still afraid to tackle the hefty page-count, a character in the book has some advice, “’E ent gunner urcha. Goo on in un say ’ello or else ’e’ll think we’re rude.” This is a once in a generation experience, folks. This is our Ulysses, this is our Infinite Jest."}, {"userName": "Campbell", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/7199941-campbell", "userReview": "Update, February 2018: finished, for the second time. Even better this time around, which I thought not possible. Simply breathtaking.I honestly don’t know where to start with this. Astonishing. I should probably start by saying it is astonishing. It stands head and shoulders (and, not to belabour the point too much, upper body) above all other fantasy recently-published, certainly in this still-fledgling century.You will read many people saying that it needs editing.They’re wrong.Its richness, its depth, its sheer raw power would suffer from such an unnecessary diminution of its narrative brilliance. Yes, it’s flawed and, yes, it can be repetitive at times but you don’t hammer a nail into a piece of wood with a couple of gentle taps. You need strength. You need perseverance. You need time. Similar characteristics will also stand you in good stead as you read this. But, believe me, it’s worth it. Here are some of my favourite excerpts:“Every decade since society’s inception has been witness to a holocaust of paupers, so enormous and perpetual that it has become wallpaper, unnoticed, unreported. The mass graves at Dachau and at Auschwitz are, rightly, remembered and repeatedly deplored, but what about the one in Bunhill Fields that William Blake and his beloved Catherine were shovelled into? What about the one under the car park in Chalk Lane, across the road from Doddridge Church? What of the countless generations that have lived poor and have in one way or other died of that condition, uncommemorated and anonymous? Where are their fucking monuments and special ringed dates on the calendar? Where are their Spielberg films? Part of the problem is, no doubt, that poverty lacks a dramatic arc. From rags to rags to rags to rags to dust has never been an Oscar-winning formula.”“..it’s the metaphors that do all the most serious damage: Jews as rats, or car-thieves as hyenas. Asian countries as a line of dominoes that communist ideas could topple. Workers thinking of themselves as cogs in a machine, creationists imagining existence as a Swiss watch mechanism, and then presupposing a white-haired and twinkle-eyed old clockmaker behind it all.”“…presumably back in the days before his face had caught fire and been put out with a shovel.”“She’d realised in that instant that the world about her was not necessarily the way she saw it, that amazing things might constantly be happening under everybody’s noses, things that people’s mundane expectations stopped them from perceiving’”“Hes hid bawed, he stires drowninter the revlerctif dapths. Has pulchrimage huss ladim tye the slow o’ dis pon wheary squarts neow, mimireysed be heson liffleyness, I’s vixed apain the lurge ent fainly-chessult cranium thut glaces beckwise ett ham fom the mimmored sourface, whonce he carenot lack a way, traipped thoer boye hison Vinitee un Fayrniss.”“At age thirteen, David’s idea of heaven was somewhere that comics were acclaimed and readily available, perhaps with dozens of big budget movies featuring his favourite obscure costumed characters. Now that he’s in his fifties and his paradise is all around him he finds it depressing. Concepts and ideas meant for the children of some forty years ago: is that the best that the twenty-first century has got to offer? When all this extraordinary stuff is happening everywhere, are Stan Lee’s post-war fantasies of white neurotic middle-class American empowerment really the most adequate response?”“There is a building like a kettledrum as big as a gas-holder, made from tree-bark greatly magnified and covered in a vast swathe of fluorescent snakeskin, with the once-Victorian canopy above partly restored by cable-thick lianas past which white diagrammatic clouds uncrumple on the graded grenadine wash of sky.”Anyway, that’s that. Finished. For now.Edit, October 2017: Getting the itch to re-read this now.Edit: This is the book \"Lincoln in the Bardo\" wishes it was."}, {"userName": "Paul", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/8019667-paul", "userReview": "[image error]"}, {"userName": "Bill", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "When I first heard about this book, I wasn't inclined to read it. Not because of its length, but because I read that many chapters took place where a child was choking on a cough drop. This sounded ludicrous to me as well as boring. But then I was in a book store and saw it, and had to buy it, for $47!And I am glad I did, as it's an amazing book. It has a little bit of everything. There is a Finnegan's Wake like chapter, a chapter like a play, a chapter of poetry and yes, many chapters where a three year old is choking on a cough drop. But don't let that put you off, as these are actually the best chapters in the book in my opinion, with all kinds of action going on, as the author gives his take on what happens to you after you die.The novel is set in Northhampton, where the author was born and still lives, and there is quite a lot of very interesting history of the are in the book as well."}, {"userName": "Amanda", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "I definitely don't have the reviewer skills to properly review a book like this. So I'm just going to say that it was a terrific experience to read/listen to it. If you are thinking of tackling this one go for it! it's totally worth it. I did a combination of reading and listening and this worked really well. Simon Vance does a great job on the audio but there were many occasions when I wanted to go back and reread sections so having a paper copy was helpful for that."}, {"userName": "Nigeyb", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/10301421-nigeyb", "userReview": "I'd give it six stars if I could Alan Moore, the reluctant graphic artist (always “comics” to the great man), is more accurately an artist, magician, film maker, illustrator, musician, poet, performer, essayist, journalist, commentator, and all round fascinating human being.I had only read 'Watchmen', until now, despite habitually seeking out Moore vids on YouTube and going to listen to him in person whenever he’s in town.I’d give 'Jerusalem' six stars if I could, which is not to say that this review is an unequivocal recommendation. I wonder how many readers will have the patience and sensibility to stick with this meandering, sprawling behemoth? Those that do are richly rewarded. The imagination and scope is breathtaking. The quality of the writing is incredibly diverse but uniformly wonderful. It has rocketed into my list of all time favourite books and I will read it again one fine day. I say read it, as I actually listened to the audiobook, all 60 hours of it, superbly narrated by Simon Vance, although I was glad to have a physical copy too which I referred to at the end of each chapter. Ostensibly an epic, multi-generational saga of various generations of ordinary working class people, it is also about “everything”: esp Alan Moore’s family, Northampton, Lambeth, time, existence, the afterlife, eternalism, and the multi-faceted universe we live in and, er, everything. Really.I read a lot of books and, as I’m now in my mid-50s, I have read thousands in my five and a bit decades here on planet Earth, and this is undoubtedly one of the most memorable and compelling reading experiences of my life. The whole history of humanity is here, yep right up to extinction, and it needs more than three dimensions to contain its scope. Famously is has hundreds of pages covering an infant choking on a Tune (a British throat lozenge). You want a range of different voices and perspectives? You get that, and then some. Chapters written as plays, verse, hardboiled noir, from different centuries, from various historical notables, from different dimensions, from tramps, from fiends, from angels, prostitutes, drug addicts, victims, exploiters, and so on and on it dizzyingly goes. If this review gives you the impression that 'Jerusalem' might be inaccessible or difficult then please be reassured it’s incredibly easy to read (the odd section aside, but even those bits all make sense with just a bit of effort), and ultimately it is all so very worth it. Despite the comparisons Joyce's 'Ulysses' this ain't. Imagine a carefully constructed, wonderful four dimensional puzzle packed with all manner of fascinating observations and insights.It’s funny, beautiful, profound, ribald, energetic and absorbing. In short, a masterpiece.6/5"}, {"userName": "Mark Parsons", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/36709214-mark-parsons", "userReview": "This book is astonishing, earthy, celestial, wise, funny, bawdy, erotic, rude, violent (at times), brilliant, endlessly inventive and transformative. It is a modern classic. It places Moore in the company of the ages."}, {"userName": "Jonfaith", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "The child had woken before she could ask whether this meant that pigeons were all human ghosts, forms that dead people had gone into and become, or whether they somehow existed simultaneously in Heaven, where dead people go, and up amongst the rafters of the derelict barn in the neighbour’s yard at the same time.My friend Roger - who is reading this with me- related that sometimes one needs to go to encyclopedic ends to marshal the argument as to why some never leaves their home town. I countered that we here in Indiana lack a thousand years of human history. His point reigns regardless. Alan Moore explores his hometown Northampton over 1260 pages with a host of perspectives and a free play with temporality which was fascinating and yet left slightly unexplored. That was my chief issue with Jerusalem, so many ideas which were rather inviting and yet overlooked in favor of others. Two siblings Alma and Michael, artist and everyman respectively, dominate the narrative. It is this tandem approach - experience and expression which yields a direction to a world where the space-time continuum is an anthropomorphic characterization -- past-present-future are extant, simultaneous and sublime. This time business is a projection.Jerusalem is a brick of a novel, one which throws great arcs. Poverty is an issue employed as is Race. The midriff of the novel is dominated by a near death experience and the consequent insertion of a character into a shadowed dimension inhabited by the departed. These ghosts gather, a troupe of youngsters as the Dead Dead Gang which chronicle their own exploration and adventures in a series of children's books. Very Chums of Chance. The novels breaks out of its own form with a chapter on Lucia Joyce, one cast into a most Wakean argot. This is a wonder. Such music to admire, the triumph is reflected in a later piece where John Bunyan, John Clare, Samuel Beckett and Thomas Becket gather to eavesdrop on a family drama. It is a gimmick but an effective one. Something similar would be adequate for the novel as a whole."}, {"userName": "Krista", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "Warry, seriously, everywhere's Jerusalem, everywhere trampled or run down. If Einstein's right, then space and time are all one thing and it's, I dunno, a big glass football, an American one like a Rugby ball, with the big bang at one end and the big crunch or whatever at the other. And the moments in between, the moments making up our lives, they're there forever. Nothing's moving. Nothing's changing, like a reel of film with all the frames fixed in their place and motionless till the projector beam of our awareness plays across them, and then Charlie Chaplin doffs his bowler hat and gets the girl. And when our films, our lives, when they come to an end I don't see that there's anywhere for consciousness to go but back to the beginning. Everybody is on endless replay. Every moment is forever, and if that's true every miserable wretch is one of the immortals. Every clearance area is the eternal golden city.\nIf that opening quote feels long, imagine the nearly thirteen hundred pages of smallish type – some sections nearly inscrutable, as in a forty-nine page Joyceian pastiche Willoware tutshe es teaterring upendy blink o' sirenter, shadeysides detert wordpie inlaitylike avshe diredent attopt tefinedoubt wattirs neme motbe beforshe luts hom stickies grirt she-lully oppor – that it takes to slog through to this rather mundane thesis. Along the way, there were dazzling moments in which I truly delighted, but more often, I was frustrated by the size and weight of the thing, and every repetition and every unnecessary word had me mentally excising this wordpie into something more manageable. (Note: I was unsurprised to learn that the audiobook of this is sixty hours long, and although I wasn't really keeping track, I know this took me more than forty eyeball-straining hours to read.) I am too mulish to abandon a book unfinished (and especially one that ranked high on some year-end best of 2016 lists), but I am not better off for having finished Jerusalem; I am left dissatisfied and frustrated and full of humbug. Bah.Jerusalem is divided into three books (and I will admit that it might have improved my experience if I had been reading the edition that is actually divided into three physical volumes instead of the elbow-straining brick that I struggled with), and my favourite by far was the first: all action is centered on the Burroughs neighbourhood of Northampton (from where the author, Alan Moore, hails); a downscale half-mile square that sits at the very center of England. As each chapter of this first book relates a story from a different era of the Burroughs' long history – going back as far as the nine century and featuring a monk on a heavenly quest – I was charmed by the weight of history; as a Canadian, it's mindbending to think of growing up in a permanent settlement that has been in place for millennia. Despite being annoyed by every character naming every street and landmark they passed on their interminable peregrinations, I thought I was getting the point of the book; the layers of human history that build a fourth dimension of time into settings. The action of the first book ends with Mick Warren describing to his sister Alma – an avant-garde artist, and essentially Alan Moore in horrifying drag – about the dream/near-death experience he had as a three-year old when he was choking on a cough drop, the details of which had suddenly come back to him. The second book is a straightforward, linear narrative of Mick's encounter with the afterlife (full of ghosts, demons, and heavenly angles [not a typo]). The third book picks up a year after the first and primarily concerns an exhibition of the paintings that Alma has made of Mick's experience, and ends with Mick attending the show and closely examining all thirty-five works of art, each of which is named the same as each of the thirty-five chapters in the book, and each of which is a visual summary of the chapter for which its named. This circle-jerkular ouroboros-wankery just got plain boring as I was finally nearing the end of this too-long book and was forced to relive and reinterpret every single chapter that had felt too long in the first place.As for the writing, Moore stretched every noun out with a simile or a string of adjectives, every idea is laden with metaphor, and sometimes I found the bonkersness of it totally engaging:\nReading cosmos from left to right, from bang to crunch, from germ to worm to glinting cyborg and beyond, the woven tapestry unpicks itself, reorganises into new designs. The marbling of cloud changes its colour. Leaning closer like impassive doctors, mottled planet-meat is visible, exposed, a skin of circumstance pinned back in plump and larded folds. The worms grow backbones and the newts sprout feathers. Bus routes alter and post offices are closed. Perfectly ripe, the scab lifts from the knee intact, reveals a waxy pinkness underneath.\nAnd then sometimes his style ground me down, and especially when I was mentally estimating how much shorter this book could have been if Moore had just gotten to the point. In the second book – featuring the Dead Dead Gang of ghost children who help Mick in his afterworld journey – John can't be mentioned without also calling him “tall and handsome” every time; Phyllis, the gang leader, wears a string of dead rabbits around her neck that is noted nearly every time she's mentioned; I get it. I was most annoyed by this in a chapter about an eighteen month old who travels to the end of time in “the Upstairs” on her grandfather's shoulders, and Moore goes to annoying literary contortions to avoid referring to them as simply May and Snowy. The following is from one (page-length) paragraph about their journey:\nRunning pink caterpillar fingers through the locks of her gerontic charger as though grooming him for nits, the sombre cherub muses...the infant and her bronco ancestor trot...the deceased toddler approaches...the unnerving pediatric sybil turns with wonderment to her intrigued grandparent...the gaunt patriarch sees...the baby remounts her famously deranged and silver-crested relative and they continue with their world's end picaresque. \nBah. On another note, I will grant that Alan Moore is a giant in the comic book world, but this felt unnecessarily snide:\nAt age thirteen, David's idea of heaven was somewhere that comics were acclaimed and readily available, perhaps with dozens of big budget movies featuring his favourite obscure costumed characters. Now that he's in his fifties and his paradise is all around him he finds it depressing. Concepts and ideas meant for the children of some forty years ago: is that the best that the twenty-first century has got to offer? When all this extraordinary stuff is happening everywhere, are Stan Lee's post-war fantasies of white neurotic middle-class American empowerment really the most adequate response?\nAnd on another note, I appreciate that Moore wanted to pack in everything about the history of the Burroughs and Northampton, but I couldn't get excited about the insertion of the history lessons about Oliver Cromwell and Phillip Dodderidge and their connections to the area. Even worse, I hated the economics lessons that were meant to teach me about the evils of capitalism from the origins of minting English coins and the birth of the Industrial Revolution (both centered in Northampton) to the collapse of Enron. And I get that this book is partly a love-letter to the Burroughs and that Moore is trying to preserve in amber the last of the old neighbourhood before it's revitalised right out of existence, and I get that there's something metaphorically interesting about its position at the very heart of England, but its decline, even after all that's written here, feels like little more than a local issue for council meetings.\nThe Burroughs is the middle bit of England's structure. It's the knot what 'olds the cloth together, if yer like. And back when everybody sort of understood that, understood it in their 'earts, then even when the times wiz bad, they still got that structure, that cloth, like a safety-net they could fall back on. But there come a time – I reckon it was back araynd the First World War meself – when all that started changin'. People started to forget abayt the things that 'ad been so important to 'em fifty years before. There weren't so certain abayt God, or King, or country, and they started pulling dayn the Burroughs, lettin' it fall into disrepair. Can yer see what I'm gettin' at? It wiz the centre of the land, of England's structure, and they let it come to bits.\nSo, in the big picture, Jerusalem illustrates the view that existence is like a glass football, our actions are predetermined, and we are doomed to relive them over and over again. In the closeup, this plays out over millennia in the history of people and places, and inevitably, there will be winners and losers. And what's Moore's role? \nSooner or later all the people and the places that we loved are finished, and the only way to keep them safe is art. That's what art's for. It rescues everything from time.\nBah. Thirteen hundred repetitive and circular pages to get me there – despite some real gems in the dross – wasn't worth the effort. Three stars would feel like the polite minimum to give to the passion project of a literary giant, but I just didn't like Jerusalem; two thoroughly subjective stars it will be."}, {"userName": "Oriana", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/30800-oriana", "userReview": "It is not strictly true that I want to read this book; in fact I really don't. Although Watchmen is one of the greatest graphic novels probably ever, I have not forgiven Alan for From Hell, or any number of his other shitty shits, or the fact that he's totally bats. Really I'm only adding this because I want to share its blurb from the Millions' Great Second Half of 2016 Book Preview:For anyone who fears that Moore is becoming one of his own obsessed, isolated characters — lately more known for withdrawing from public life and disavowing comic books than his actual work — Jerusalem is unlikely to reassure. The novel is a 1,280-page mythology in which, in its publisher’s words, “a different kind of human time is happening, a soiled simultaneity that does not differentiate between the petrol-colored puddles and the fractured dreams of those who navigate them.” Also: it features “an infant choking on a cough drop for eleven chapters.” Something for everyone!lolololol nooooope."}, {"userName": "Martin", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/1478807-martin", "userReview": "This book is a -ing masterpiece. Picture yourself inside of a pocket watch, looking at first this cog, then that pinwheel.Or listening to one of the great big band songs, say Koko by Duke Ellington,only one instrument at a time. Then look at or listen to them in their totality, and behold the marvel that all of those disparate parts have become. This book is filled with moments that make you look at everyday events in your life with a different eye, noticing the unique and the sacred in the everyday and mundane.Jerusalem is my favorite novel of 2016."}, {"userName": "Andrew Barnes", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/9064336-andrew-barnes", "userReview": "Jerusalem shouldn't work. On paper it has potential disaster of historic proportions written all over it. Sure, if there was an equivalent of Mount Rushmore for comics Alan Moore would be on it, but for only your second novel to check in at 1,400+ pages and transcend three dimensions and humanity's entire lifespan, that's beyond ambitious and bordering on reckless. It has hundreds of pages taking place while an infant chokes on a throat lozenge. It has chapters told from perspectives of a distinct cast of characters with voices to match for each chapter including some written as plays, poetry, love letter to Raymond Chandler, or in ridiculously-thick-to-the-point-of-it-being-impossible-to-understand accent. The novel is set outside of time with biblical leanings, fiends and angels playing major roles. Simply put, Jerusalem, while certifiably deranged, is also a singular vision from a singular and timeless talent. Moore proves to be unparalleled at writing about the most disenfranchised members of society (the prostitutes, the homeless, the mentally ill) with sincere empathy. Moore isn't afraid to look at the ugliness humanity inflicts on both one another and our environment without blinking (sometimes, for instance when writing from the perspective of a rapist, this can lead to some discomforting segments). A central character in the latter portion of the novel describes looking for the \"limit of my being,\" and it feels as if Moore is doing the same thing by penning Jerusalem. Without reservation, it is clear that Moore found that limit and went past it, leaving readers whom aren't dissuaded by the lengthy time commitment something special.-------------------------------------I received an ebook ARC from NetGalley and W. W. Norton & Company in exchange for some honest and thoughtful feedback, so thanks to them!"}, {"userName": "Leighkaren", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/4251341-leighkaren", "userReview": "I have under 200 pages to go befoe finishing this book and I've been composing my review for several days. It's really difficult for me to not talk about it using sweeping, effusive words, so I'll start with those: this was one of the most incredible, compelling, original, awesome, imaginative and thought-provoking books I have ever read in my life, and I've read A LOT of books. The decade that it took Moore to write this homage to his hometown of Northampton shows in every word. He's crammed in an amazingly original idea of the afterlife that I mull over in the hours that I'm not reading the book. His depictions of \"The Upstairs,\" \"The Burroughs\" and \"The Builders,\" call upon many disciplines. There are quantum physics, philosophy, theology, mathematics, history, and engineering in every chapter. There are also salutes to various authors such as William Blake, Samuel Becket, John Clare, and several more. Since starting to read it I have had some incredibly vivid and odd dreams and I think Jerusalem is totally responsible for this. Moore accomplishes much in this book. The structure is consistent throughout and the character development rivals that of those in George R.R. Martin's series \"Song of Ice and Fire.\" It's tight and controlled and each character is unique in every way. Each one speaks in a different voice, with different accents and thought processes. One chapter is a complete homage to James Joyce and it's incredible. I fear the most difficult thing for me will be finding others with which to discuss this almost indescribable story. It requires a substantial amount of commitment on the reader's part, and takes a bit of time to get into. There's a certain rhythm that you need to get used to in the beginning but once you do you can just get lost in the story. Some chapters are a bit slow but shouldn't be skipped or glossed over, though it may be tempting.I'm going to really miss this book but Moore has given me so much to contemplate regarding so many things. Thank God for Wikipedia! I often had to do some research so I could get a better grasp of some of the things that came up. His concepts may not be agreeable to everyone and there were certain elements of his ideas of the Afterlife that I had issues with but it's all extremely intriguing to mull over. Moore loves his Northampton and I could probably find my way through it in the dark; every street and road appears in the book, with a map to assist in navigation; however I only needed it for a while. By about page 500 I had the lay of the land memorized.I'm sure in time there will be a college or university that will decide to make this required reading for humanities classes. I almost wish I was back at university so I could write some kind of paper on it. There are tons of potential doctoral theses to be mined from Jerusalem. Moore's book requires dedication, commitment and a love of all things mystical. I hope all future readers enjoy it as much as I have."}, {"userName": "Mona", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/7020601-mona", "userReview": "Phew..it's taken me nearly 2 months to get through this, but it was entirely worth it. I haven't written a review for quite a while (too busy) but this book cries out for one. I'll really try to fit in a full length review. He's a brilliant writer."}, {"userName": "Connor", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/8341803-connor", "userReview": "At 370 pages in, I'm calling it. I can't read another overwrought description of a person doing something mundane. I can't read about angels somehow being involved in spitting, fucking, and shitting.I can't read like a million descriptions of what street in some fuckoff city people are on.I surrender. Don't waste your time on this meme."}, {"userName": "Max Nemtsov", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/471361-max-nemtsov", "userReview": "Любые попытки описать этот роман неизбежно окажутся полны спойлеров, но я попробую. Наверняка это лучший роман нынешнего века so far — 4-мерный иероглиф огромной любви к родному городу, книга о времени, старении, памяти, смерти, огромная пространственная открытка, где на старый дагерротип накладывается новый цифровой снимок. Визуальные эффекты в романе часто таковы и есть. Поразительной художественной силой памяти (или силой художественной памяти) Мур детально воссоздает то место, которое любит (и где всю жизнь живет), ощутимо, до хруста под пальцами, звона в ушах и запаха в ноздрях. Много бы я отдал за то, чтобы о _моем_ родном городе кто-то так написал (сам-то вряд ли, чего нет, того нет): потому что и сам во всякое возвращение туда ищу его свой, _тот_, поначалу не нахожу, но потом он постепенно все же проступает, с каждым разом его становится все меньше, он стирается и проваливается под новыми слоями. Так что и я, как мне кажется, хорошо понимаю Алана Мура.Ибо ничем, кроме искусства, ушедшего не восстановить, как он нам прямо говорит в романе, этот бой со временем выиграть невозможно, но никто не запрещает пытаться создавать вновь и вновь эти машины времени, проводить эти магические ритуалы. Полностью отдавая себе отчет, что лишь в них наше прошлое и будет жить, нигде и никак иначе. В одном месте в тексте у Мура всплывает мимоходом: так черно-белую фотографию того, что я помню, будут рассматривать лет через сто. И персонажу становится жутко от того, насколько обесценена человеческая жизнь, если натуральная среда, в которой человек жил, так легко разрушается и забывается. А восстановить прошлое невозможно, потому что если даже воссоздать «все, как было», — от этого станет только хуже, потому что эти каменные отпескоструенные и отфотошопленные руины уже не населить _той_ жизнью. Вроде и банально все, а вот поди ж ты.Немного наружной рекламы. В текст Мур напихал всего, что усложняет жизнь переводчику. Я не преувеличиваю — ВСЕГО, в диапазоне и ассортименте, так что «вот кого мне поистине жаль», будущего переводчика этого тома на русский, хехе. Вместе с тем, роман совершенно переводим, с массой подарков, и сделать из него вполне можно шедевр. Сделают или нет — другой вопрос. Пресловутая «финнеганова» глава, конечно, требует к себе подходов: как источник ее вдохновения, она требует ночного чтения вслух, после чего становится совершенно прозрачна, если вам интересно, что там внутри (а там есть что интересного, так что пропускать не рекомендую). Она не так синкретична, как у Джойса, конечно, но упрекать за это автора глупо — у него задача так не стояла.Ну и последнее, циническое, замечание. Лучшим и единственным эпиграфом к роману будут, конечно, строчки из Шиша Брянского:Не смотрите никогда на потолок —Лучше встаньте тихонько в уголок…И так далее. Это и есть вам единственный спойлер."}, {"userName": "Viv JM", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/4243437-viv-jm", "userReview": "I've finished! I've finished!! I've bloody well finished!!! More coherent review to follow. Probably.UPDATE:Hmm...not sure I can coherently review this book at all. It's quite something! I loved how much Moore's love for Northampton came across. I could have done without some of the more experimental parts. There were moments of laugh out loud humour. There were some extraordinarily well described scenes. There were ghosts having sex. There was papier-mache with chewed up Rizla papers. And, best of all, was the Dead Dead Gang. I am glad I read this alongside buddies because the 1280 (close-print) pages or 61 hours of audio might have defeated me otherwise. It definitely helped to have fellow readers for cheering each other on! I would recommend the audio - it's narrated by the super-wonderful Simon Vance and especially helped with some of the weirder parts - but I wouldn't have liked to be without the paper book for reference. A bit of an investment of time and money, therefore, and maybe not for the faint-hearted or easily offended, but I'm glad I read it (as well as being relieved it's over, for now!)"}, {"userName": "Alex Sarll", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/5866774-alex-sarll", "userReview": "Advance word said Alan Moore’s second novel was going to be a million words long, and set entirely in one Northampton district, the Boroughs. Neither half of this is strictly true; there are sections outside Northampton, even as far as London, and if Moore’s cosmology can claim Lambeth as somehow part of the Boroughs, it surely can’t carry off quite the same trick with St Paul's. But, it's close enough. Still, if he'd really wanted to fuck with people he should have said, quite honestly, that it was the best part of 1,200 pages concerning the cosmic ramifications of a small boy from an unregarded area of 1950s Northampton choking on a cough sweet. A small boy who happens to be the brother of a cult artist - yes, Alan Moore himself, here going by the name Alma Warren. She’s an artist rather than a writer, and the beard has been swapped for lipstick, but is very obviously the same person in all other respects, and as Moore has himself admitted, not an entirely plausible female character. But then, as he equally fairly caveated, Alan Moore isn’t a particularly plausible male character either.And the million words? No, a mere 600,000. Which is to say, longer than Ulysses and Gravity's Rainbow combined; the change left over would be sufficient for a Narnia book, and one way to understand Jerusalem would be to consider it as a combination of all three. Still, its size has an impact all its own, and you can tell that Moore is at least a little annoyed Jerusalem is not in fact longer than the whole Bible (all Steve Jones' fault, apparently. As in the science writer, though given Moore it could equally have been the Sex Pistol). But again, think of it as a new Testament with the myths of sin and redemption grounded among the beggars, sinners and tax-collectors of a new age and you’ll not go far wrong; for saying it was written by a wizard who worships a serpent, it’s a surprisingly christian text, albeit perhaps not in the way passers by assume when they see you carrying a mammoth tome called Jerusalem. It’s a solid, craftsman’s reinterpretation, earthy even as it’s cosmic, where angels are always called ‘angles’ or ‘builders' - and the novel feels built, a structure whose every beam interlocks so perfectly with every other that it could never have been otherwise, thus embodying the vision of the world it expounds.So how does such a small incident fill all those pages? By ricocheting out, centuries into the past and even further into the future, and bouncing off the lives and afterlives of all manner of Boroughs folk, from the lowliest beggar to fiends and archangels. There are layers upon layers here, events intertwining across the decades, and up and down the layers of reality. In some respects I think this may be pretty much the book The Levels which Lawrence Norfolk failed to write, and which ever since I first heard about it I’ve regretted our world does not possess. Well, I need grieve no longer, because not only has Moore done it but I think he’s done it as well as it can be done. He knows that to encompass the full spectrum of human experience requires a novel that’s as happy being fantasy, horror, comedy, Olaf Stapledon-style SF, kids’ adventure story, tragedy, noir pastiche, verse or a weirdly close parallel to Pixar's Inside Out as anything recognisably litfic. Sometimes, as in Ulysses, you even need a whole chapter which is actively annoying (there the ringtone trill of the Sirens; here, the self-justificatory internal monologue of a bent ex-councillor). And if the result is verging on the unmanageable…well, so be it, because isn't life? Within Jerusalem, Alma is working on a series of paintings bearing the same titles and themes as the novel’s chapters, and in some ways that exhibition might be a better way to encounter this matter. There’s another work of provincial English visionary literature, Piers Plowman, which I always compare to a great cathedral – it’s amazing, it’s majestic, but who the Hell wants to look at every stone of a cathedral? So of course you don't read the whole thing. And I suspect the same may come to apply here. If certain chapters of Jerusalem came to be read more often than others down the years, I wouldn’t be the least bit surprised. Though looking at other reviews, it’s interesting how there’s no clear consensus on the best or worst bits. Some found the middle section following the Dead Dead Gang unbearable, whereas I'd say that this posthumous romp with the afterlife’s own amalgam of every Outlaws, Famous Five et al the easiest and most immediately rewarding going of the whole affair. Others considered the opening section’s stories of various Boroughs residents fractured and dull. Interestingly, only a broadsheet critic seemed willing to suggest the already notorious Lucia Joyce chapter was a sham, perhaps feeling that his venue inoculated him against accusations of philistinism (in which case, more fool him). But let the record state that yes, that chapter is a bastard, albeit a justified bastard which perfectly summarises itself and thus the whole project: “”a letterchewer in’ formerspeech so danse datenot evern daelight o’ meanhim cannyskip is’t dadfull graphity. Noteben literself contravail eover daddyvent hereye’son”.And yes, without a run-up, that passage is basically incomprehensible. But Moore knows this. Without whitewashing the working classes, there's a fierce pride in them here which is rare in modern fiction, at least divorced from sheer thuggishness. But also a rueful awareness that many of the people celebrated here are precisely those least likely to slog through the monument Moore has erected to them. And it is a monument; not the first recent work from Moore where one axis could be summarised as an old man moaning that 'It were all fields around here when I were a lad' (compare LoEG: Century). But that's inextricable from the project: a man closer to the end of life than its beginning constructing a solid block of a book in which, like the solid blocks of time envisioned therein, all those lost relatives and scenes and sweets are preserved for eternity. And after all, if this is a problem it's a problem that's been in Western literature from its foundations: what's the Divine Comedy if not one writer turning his considerable gifts to a baroque rendition of the afterlife as it seems fair to him personally? And thus far at least, there's a lot less bloodshed which can be blamed on Moore's metaphysics.There are other little annoyances, though. Inevitably; a work of this size may be grand, even great, but I don’t think it’s possible for it to be perfect. Sometimes, the degree to which pretty much every character can flawlessly reel off details of local history gets a bit silly (cf Netflix's recent Luke Cage, where what worked brilliantly from Cage and Cottonmouth felt a bit daft once Goon #3 started getting in on the act; yes, absolutely there are people in poor neighbourhoods who know this stuff, but not *all* of them). Most of the polemic is managed such that it doesn’t tip over into Pat Mills territory; there’s one bravura chapter in which the global rise and imminent fall of money as a concept is paralleled with the life of one heroic, shambolic local leading the fight against the local manifestations of the corruption lucre bred. But that does lapse at times, especially in the Cromwell chapter (and as so often when I say this, that doesn’t even mean I disagree with the agenda, just the presentation). Too many editing mistakes creep in towards the end – something I’ve often noticed in recent books, but a particular shame here even as it’s particularly understandable, after hundreds upon hundreds of pages with nary a misplaced apostrophe. Not just typos, either, but a surprising slip when Sheridan is described as a novelist, itself tied into one frustrating cheat regarding the birth of genre fiction. This last is a particular shame given what a great job Moore mostly does in convincingly tying the birth and death of pretty much everything else, from free market capitalism to the gothic revivals, to his one small patch of English earth.Of course, part of the beauty of Alan Moore is that for all his fierce principles and justified self-regard, he’s also a master of that (fading, alas) British virtue of not taking oneself entirely seriously. Alma is by no means a wholly flattering self-portrait, and the book closes with the exhibition of her Jerusalem analogue, seen through the eyes of her baffled, bullied brother. It’s a lightly self-mocking reprise of the whole novel, laced with wry half-admissions of failure: “you don’t think that there’s some element missing? As if I was using all the obvious effort as a camouflage to hide the fact that I’m not saying very much”. But that only makes the bold (if by that point unsurprising) conclusion all the more compelling: whatever its failings, only art can save the world, if not perhaps in the sense you might think.And ultimately, that’s the thing. It’s a book about predestination, and eternal recurrence. Which are concepts Moore seems on balance to find consoling, while also being aware that from another perspective they’re bloody terrifying. The angel's-eye chapter, and the finale of the novel's second section (with its competing carnivals of despair and joy), are two of the most truly staggering passages in the whole fabulous work, but also among those where this is most to the fore. And of them, the former at least also accepts the monstrousness of the whole set-up. 'Justice above the street’ is a seductive motto, but the way it plays out can be uncomfortably close to Spinoza, or even Leibniz' facile published work - everything for the best in this best of all possible worlds (which may not mean all that much if it was the only possible world all along). There's a hint to why the poor might have a better afterlife than the well-off, but to some extent those who have do better, forever, than those who have not. The only reward for being good is that you get to live with that always, but then people too limited even to torment themselves with their many sins – which is to say, the real monsters – will get to happily slaughter their way through eternity too. We do see one glimpse of how Hell might exist in this set-up, but it seems a matter of luck as much as anything else, with forgiveness perhaps too cheap for some other fairly grave offenders. And then, of course, if there’s no free will, what can sin and justice even mean? It’s a question prodded at but never really answered. Still, who said the universe was fair, or would become so just because you add metaphysics?"}, {"userName": "Linda", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/440212-linda", "userReview": "Yeehaw, I'm done!! Wow, what a journey that was. I admit that I'm terrible at writing reviews, so even attempting to write a review about this magnificent work is going to be like me bringing a few pop rocks to a professionally staged going all out never-ending fireworks display and synced music to go with. In other words - pathetic. ha ha. So...all I'll say is that this book easily won its spot within my favorites before I was even halfway through. Yes, this book is long, but I enjoyed almost every minute of it. And someday, someday, I will revisit it. Or, perhaps before then, just pick favorite chapters and reread those. But, there were a lot of favorite chapters. :)I mostly listened to the audiobook, which was fantastically narrated by Simon Vance, and that really made the book enjoyable to another level, I think. I also referred to the paper copy, though, and some chapters actually benefited from seeing the words in print. So yeah. That's my review. I loved it. I'll leave the actual description of the book up to other more competent reviewers."}, {"userName": "Liviu", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "somewhat interesting especially as writing goes but not interesting enough to spend the time on this humongous book; if it were situated in a place of more interest to me, I may have at least tried it"}, {"userName": "Bjorn", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/19667916-bjorn", "userReview": "Alan Moore's new novel - only his second \"real\" novel, if you discount things like Watchmen, V For Vendetta, From Hell and all those things that are Just Comic Books - is 1266 pages long, in three volumes, and took him ten years to write. It spans from the ice age to the end of the world. It has dozens, maybe hundreds, of POV characters, fictional or real, living or dead. It switches styles with almost every chapter and jumps from highbrow literary games to furious politics, from kitchen-sink realism to pure fantasy, and more than once all of those at the same time.Alan Moore's new novel takes place over two days - 26 and 27 May 2006 - in what remains of Northampton's old working-class quarters after the demolitions in the sixties, a community reduced to hopelessness, where a man is going to an exhibit of paintings his sisters based on something he may have dreamed as a kid, while a young crack whore in one of the other houses is about to finally lose her grip on life once and for all. They're the POV characters.Yes, in some of its many, many dimensions, Jerusalem is a simple story, a love letter to Moore's home town and a raised middle finger to everything it's put up with since the Romans, but he takes the scenic route there. James Joyce once said that if Dublin were destroyed, you could recreate it based on the detail in Ulysses. Moore took that to heart, except he's not happy with just capturing Northampton on that one day; cities are living creatures, and people, buildings and ideas that disappeared ages ago still leave traces. So he has to tell the story in four dimensions, time and space, reality and dreams. He has to pull in angels (sorry, angles - four dimensions, remember?) and devils, fires and invasions, New Labour and theodicy, creativity and madness, moral responsibility in a world without free will (\"Did you miss it?\"), death and immortality until he's included EVERYTHING. And all these stories that he weaves together, like a giant snooker game where every ricochet changes the whole game and every ball is worth just as many points. This long line of characters from all ages and situations, who at first have nothing in common but the fact that they happen to live (or not, as the case may be) in The Boroughs, the oldest part of the old Saxon capital, which nobody (at least according to Moore) gives two shits about as long as they don't bother the people outside. Her point is that despite the very real continuing abuses born of anti-Semitism, born of racism and sexism and homophobia, there are MPs and leaders who are female, Jewish, black or gay. There are none who are poor. There never have been, and there never will be. Every decade since society’s inception has been witness to a holocaust of paupers, so enormous and perpetual that it has become wallpaper, unnoticed, unreported.And man, he does it so well. He pulls in real people from Oliver Cromwell to Charlie Chaplin to his own friends and family and mix them up with his own ideas. He writes in paraphrases, palimpsests, tesseracts. He spins on his heels from slapstick to essays. He commandeers other books and surfs on the backs of Milton, Blake, Clare, Carroll, Joyce, Beckett and forces them to go where he wants them to. He switches POV and time period in almost every chapter, and yet every chapter somehow builds on the previous one, takes up its ideas and gives them another twist. He challenges his readers with half-chapter infodumps and trilingual puns, but he never forgets to reward them for it. The most extreme case being \"Round the Bend\", the chapter told from the POV of James Joyce's schizophrenic daughter Lucia, living out her life trapped both in a mental hospital and in her beloved father's genius, communicating in Finnegasque:Mighnd knot awer canseeusness hedself, uniffable ter sceeintestic scrupiny, beau a fairnuminon o’ far timersions datas foundedself contrained wittin a merdel blody end um werlt doutwit a’peer ta hove baret’ree?Lucia penders willshe skirps alonge. Perhopes fearsum afuss, owr foursomality is consciantly outtempting to expierce itsolve inalys farfoold glarey, esperever luccinfer thort beond, thort quarner iff ourrizen dattiset wrytangles wideehighther fhree. Theos ophus howcan nevagaet disctern succinctfully wellbe estymdust bairds ound purwits, waile daiz aveers huer nit sloadroept undare taclin un meanoeuthert’ing illbe consigndered luciatics ar slimpery faals. A’curse, dorados eywool bay parcived as buth pohetic an dewrenched.That whole chapter is an incredible feat, with a language that tells at least two or three stories at the same time while still developing and furthering the story at large, even if those 50 pages take me a whole week to get through. And he compensates by turning all of book 2 into basically one long YA fantasy story about a gang of kids (albeit undead kids with centuries of experience) travelling through time hunting a secret, and if he'd published those chapters on their own he'd have made Neil Gaiman weep blood.And yet no part of this stands stronger on its own than together, because it's all parts of a whole. It all matters, which turns the book into its own metaphor. Sure, I'm not going to deny that there are the occasional longeurs in all those pages, and sure, his use of sexual violence for character development is a bit... comic book-y, and sure, it's hard to shake the feeling that more than one or two characters here are basically Moore himself. But fuck all that, because Jerusalem is such a magnificently total novel. There's ridiculous amounts of detail, but he uses it all - if someone sees a dog turd on page 300 you can be sure someone will have dogshit on their shoes 800 pages later, and that it'll matter. There many styles, but he can handle them. There are many characters, but they all get their space. It's a book borne by holy wrath but is so playful, so imaginative, so full of ideas and humanity that even after almost 1,300 pages I'm still pretty sure it still has stories to tell."}, {"userName": "Graham", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/3921215-graham", "userReview": "I say this as someone who was initiated into comics by V for Vendetta. Who loves Watchmen and From Hell to death. Who still really wants to read Lost Girls someday when he isn't living with the prying eyes of others.Fuck you, Alan Moore.Fuck you for putting a bunch of quite enjoyable and suitably intriguing material upfront—material that, while certainly not up to the standards of your best comics, is of more than enough quality for me to read 1,200 pages of it without complaint—and then just taking a massive shit all over it with a solid 500 pages of self-indulgent, tedious bullshit that buries all its clever ideas beneath a slurry of tired jokes that get old after the first few of the several hundred times they're used, a gang of some of the most annoying child characters I've ever read, and just sheer repetitious monotony that possesses next to no narrative drive and expects the reader to be interested in what's being talked about and rehashed ad nauseum solely because the author is.Fuck you because then, after these miserable five hundred pages of weak-tea metaphysical slapstick have been slogged through (no, slogged is the wrong word—keelhauled through might be better), your book finally gets interesting again. The writing style takes a turn for the experimental, the lectures on things like coinage and religion start becoming interesting, and the viewpoint characters aren't a bunch of toddlers who make me want to tear my hair out. But none of that matters, because it's too late. Any goodwill I felt for the book has been utterly burned out by the sheer volume of twaddle you forced me to endure for almost half of its length. I'm no longer capable of enjoying what remains, because my brain has been blasted out of that realm by the sheer relentless disgust it felt for the book's middle section.If you had just cut those middle five hundred pages down to two, maybe even three hundred, I could have lived with them. I would not have loved your book, but I would have liked it, particularly its opening and closing acts. As is, I'm pissed off at you. I'm not getting rid of the book—first of all because it's a $20 investment and after throwing away another chunk of money on a ticket to Blair Witch I can't afford another wasted investment, second because I do want to take another crack at the final 400 pages once my hangover has worn off. But I dearly want to.Your comics are still the best. And you yourself are fairly awesome. But seriously, Alan. Fuck you for this one and for the week it took me to read.(In other news, this marks the final book of my 160-volume 2016 Goodreads challenge. So, yay, I guess?)"}, {"userName": "Joyce", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/1650596-joyce", "userReview": "Almost 61 hours later, I have finished Jerusalem. It wasn't one of those books that I listened to straight through--too overwhelming for that. And I could never have read the book--too much dialect and occasional imaginary language, too dense, too much. But Vance's narration makes it totally understandable (well, that may be an overstatement. I'm not sure anything but a much bigger brain would make this totally understandable) and even enjoyable. There's no point in trying to give a plot description as there's way too much going on. And I have no idea what genre to call this. Literary perhaps for the pure pleasure in language and style, as well as the playfulness with both those. Historical in a way, as it is centered on the history of Northampton, England. Fantasy? SF? Speculative fiction? It meanders through worlds of living and dead, real people and fictional, mad and sane. It's impossible to say this is fast-paced, as it's so densely written, but it's compelling, and it moves relentlessly, quickly sometimes and at other times at a more leisurely speed; the characters are unforgettable, vivid, flawed and intriguing, historical personages appear in expansive dialog with fictional so we get Northampton folks Oliver Cromwell, Samuel Beckett, Thomas Becket, James Joyce's daughter Lucia, among others; the story line is idea- and character-centered, imaginative (that's an understatement!), and the story line loops in and out and back on itself with recurring characters and images all interconnected in past and current times among the dead and living; Northampton provides the frame as do the ideas of William Blake and Albert Einstein--space, time, life, and death; waves of words--gorgeous language--in myriad styles flow over listeners, language and style are complex with multiple points of view and story lines, not to mention playful and intelligent prose; and the tone is also playful, disturbing, earnest, mystical. What a book! Made even better by a remarkable performance."}, {"userName": "Gerard Villegas", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/34487436-gerard-villegas", "userReview": "The moment we got this ARC at work I was squealing like a boyband fangirl especially since I love Alan Moore's graphic novels like Watchmen and V is for Vendetta. I mean the man is known for being a tremendous influence in changing the comic book industry genre by introducing more thought provoking concepts and ideas. In his up and coming ambitious 1000 page literary novel (yes it's that thick), Moore once again taps into philosophies and ideologies that delve into the political, social, and economic arena while exploring high level thinking that go along more into the lines of existentialism, religious, spirituality, and metaphysical while combining elements of sci-fi fantasy and magical realism. Unfortunately, the book is way too cerebral for me and I got 200 pages in before giving up entirely. Sorry, I'm not that smart when it comes to this kind of work so I'm not this book's target audience. However, I will recommend it to those who prefer a challenge and like to think outside of box for a change. I'll stick to his graphic work. Thank you very much."}], "description": "New York Times BestsellerFierce in its imagining and stupefying in its scope, Jerusalem is the tale of everything, told from a vanished gutter.In the epic novel Jerusalem, Alan Moore channels both the ecstatic visions of William Blake and the theoretical physics of Albert Einstein through the hardscrabble streets and alleys of his hometown of Northampton, UK. In the half a square mile of decay and demolition that was England’s Saxon capital, eternity is loitering between the firetrap housing projects. Embedded in the grubby amber of the district’s narrative among its saints, kings, prostitutes, and derelicts, a different kind of human time is happening, a soiled simultaneity that does not differentiate between the petrol-colored puddles and the fractured dreams of those who navigate them.Employing, a kaleidoscope of literary forms and styles that ranges from brutal social realism to extravagant children’s fantasy, from the modern stage drama to the extremes of science fiction, Jerusalem’s dizzyingly rich cast of characters includes the living, the dead, the celestial, and the infernal in an intricately woven tapestry that presents a vision of an absolute and timeless human reality in all of its exquisite, comical, and heartbreaking splendor.In these pages lurk demons from the second-century Book of Tobit and angels with golden blood who reduce fate to a snooker tournament. Vagrants, prostitutes, and ghosts rub shoulders with Oliver Cromwell, Samuel Beckett, James Joyce’s tragic daughter Lucia, and Buffalo Bill, among many others. There is a conversation in the thunderstruck dome of St. Paul’s Cathedral, childbirth on the cobblestones of Lambeth Walk, an estranged couple sitting all night on the cold steps of a Gothic church front, and an infant choking on a cough drop for eleven chapters. An art exhibition is in preparation, and above the world a naked old man and a beautiful dead baby race along the Attics of the Breath toward the heat death of the universe.An opulent mythology for those without a pot to piss in, through the labyrinthine streets and pages of Jerusalem tread ghosts that sing of wealth, poverty, and our threadbare millennium. They discuss English as a visionary language from John Bunyan to James Joyce, hold forth on the illusion of mortality post-Einstein, and insist upon the meanest slum as Blake’s eternal holy city.", "title": "Jerusalem\n      \n          (Jerusalem #1-3)", "url": "http://www.goodreads.com/book/show/13069874-jerusalem", "average": 3.98, "cover": "https://images.gr-assets.com/books/1469206373l/13069874.jpg", "reviews": 333, "authors": [{"url": "https://www.goodreads.com/author/show/3961.Alan_Moore", "name": "Alan Moore"}], "type": ["Fiction", "Fantasy", "Historical", "Literature", "Sequential Art"], "outlinks": ["http://www.goodreads.com/book/show/13069874-jerusalem", "http://www.goodreads.com/book/show/28789736-jerusalem", "http://www.goodreads.com/book/show/31839616-jerusalem", "http://www.goodreads.com/book/show/29355345-jerusalem", "http://www.goodreads.com/book/show/30747473-jerusalem", "http://www.goodreads.com/book/show/32586913-jerusalem", "http://www.goodreads.com/book/show/472331.Watchmen", "http://www.goodreads.com/book/show/5805.V_for_Vendetta", "http://www.goodreads.com/book/show/96358.Batman", "http://www.goodreads.com/book/show/297627.The_League_of_Extraordinary_Gentlemen_Vol_1", "http://www.goodreads.com/book/show/23529.From_Hell", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}