{"ratings": 1610, "userreviews": [{"userName": "Brook", "userReviewDate": "Aug 11, 2009", "userURL": "http://www.goodreads.com/user/show/584270-brook", "userReview": "What an amazing story about the Yukon and one man's blind stubborness to reach it without crossing over American territory. Well written. I could hardly put it down."}, {"userName": "Rohan Murray", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/72501795-rohan-murray", "userReview": "Journey - James MichenerA thoroughly enjoyable adventure story by James Michener ... that doesn't take 3 months to read! (In fact, only 3 days) The story starts a little slowly but once the men are off on their trek, it really picks up. So convincing was the tale and so ridiculous was the obsessiveness and near suicidal determination of the main character that based on the saying that \"truth is often stranger than fiction\" I actually did a bit of research to see if this might have been based on a true story (it of course isn't but feels very much like it could have been). The novel left me with many questions that I would love the author to have answered during the course of the story, particularly during their winters in the cabin- \"what exactly did they eat every day?\", \"how did they / did they wash?\", \"how did they collect water\" but having these questions and pondering the answers long after I had finished the book is not so much frustrating but usually the sign of a good novel. A little bit of an anti climatic ending but overall, a really good read."}, {"userName": "Joanna Mieso", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/2154640-joanna-mieso", "userReview": "I've always enjoyed Michener's works, especially Hawaii and Ice Palace, so I was expecting another saga spanning over a few generations in \"Journey\". I was a little disappointed to discover the time elapsed in this work was just over 2 years and it was focused on one episode in the characters' lives.Lord Luton and four companions set forth from England to mine gold in the Klondike - thus, the journey referred to in the title.The linear timeline does move along smoothly, and maybe I read too fast, but it seemed to me that on one page we are in October 1897 and then three paragraphs later it is March 1898. hmmm. have to go back and re-read that one.************HERE FOLLOW SPOILERS************************************************************I've read various non-fiction adventure accounts such as Race to the Pole (Peary expedition), Into Thin Air (Everest expedition), so I was very familiar with heart-breaking scenes of deadly cold, illness, hunger, etc. and Journey contains plenty of like descriptions.What was so shocking to me was that the expedition's leader, Lord Luton, chose to ignore advice from experienced scouts and Indians regarding the route to reach their destination (Dawson, site of the gold fields). He is a stereotypical English nobleman with the stuff upper lip, superciliousness and sense of nobless oblige that dictate his way is the only way.Those miners who'd been to the Klondike and back recommended overland passage via three different rivers, whereas Lord Luton stubbornly insisted on a route crossing over the Rocky Mountains and thereby avoiding entering US territory; Lord Luton's reasoning was that as Englishmen, his group must at all costs be loyal to the Crown by traveling through Canada.Luton is extremely intelligent and a keen adventurer who had led expeditions in Africa and India. He planned this trip with the help of maps and pamphlets which described all the golds and riches to be found in the Klondike. No sooner does he arrive in Edmonton, Canada when he discovers the pamphlets are semi-fictionalized accounts by two men who'd never seen the gold fields. Luton has the sense to re-organize his strategy and at first all goes well. While in Edmonton the team meets others who are in search of their fortunes, among them, a woman with her husband and his family. They are from North Dakota but originally from Estonia. They discuss with Luton how they will travel and of course Luton outlines his plan with which they respectfully disagree - both parties eventually depart Edmonton for their great adventure.Luton has calculated that the team will traverse x number of miles until they will need to make camp for the winter- they will then spend the winter in a cabin they'd build themselves, exercise, read fine literature to each other, and in short, keep themselves healthy and fit in both mind and body. Food and supplies are plentiful and all team members are careful to follow all of Luton's instructions.Prior to setting up camp they are astonished to come upon the North Dakota woman who is now alone - her family perished in the river and Luton tells her she must go back to Edmonton. The team will transport her downriver to the first steamer back. During the night Luton has thoughts of tossing the woman overboard so that they can continue their journey and not have to backtrack to the steamer. They do, however, escort the woman until they reach the first steamship heading for Edmonton.When spring arrives and the expedition sets off to continue their journey via the passage which so many had discouraged, various troubles commence, beginning with the drowning death of Lord Luton's nephew, Philip.Philip perished after falling overboard into dangerous rapids; he sank to the bottom within minutes wearing the rubber boots which he'd been strongly advised not to wear. The boots filled immediately with water, the weight of which sent him to his death. Luton now is more than ever pressured to reach Dawson before the winter sets in - due to the passage they're following, winter comes sooner than the previous year and they are forced to camp for yet another winter.Here is where the hardships, illness and death rear their ugly heads - Luton has the team build another cabin, but their supplies have dwindled. He had insisted on traveling light so as not to be burdened with heavy weight. Of the three remaining team members, one contracts scurvy and grows weaker and sicker daily. One day he tells Luton he will go out to exercise - instead, he limps off into sub-zero temperatures, stripping his clothes off as he heads into the fields where he suspends himself from the nearest tree. Luton later discovers that he has committed suicide by freezing to death.Another expedition member dies of scurvy and now it is up to Luton and the only remaining man, his man-servant O'Fogarty who will continue on this journey. Several chapters detail worsening conditions, illness, battling mosquitos, the elements and worse.The two men finally reach Dawson with the help of an Indian tribe - again they are astonished to see the North Dakota woman who is now thriving running a restaurant with her new husband.Luton asks her how long it took her to reach Dawson - it has been well over a year since they left her to go back to Edmonton. She replies that she did return to Edmonton where she met her second husband. They came to Dawson and succeeded finding gold which they used to start a restaurant. Luton is incredulous as he realizes she talks so easily of reachign Dawson - when he asks her how long it took her to get from Edmonton to Dawson, she replies it was approximately 10 weeks.Luton is thoroughly shook up and horrified - it took over 100 weeks for his team to reach that same destination, all due to Luton's stubborness and insistence at traveling a different and more difficult route.For the first time in this novel, Luton breaks down weeping, realizing he has been responsible for the death of three men due to his actions.The final irony is that before setting off for the gold fields, Lord Luton receives a mail packet informing him of his elder brother's death, so that Lord Luton is now the Marquess of Deal and must set forth immediately to England to claim his castle and rightful title. He is preparing to leave for England without even visiting the gold fields and is somewhat astonished that O'Fogarty prefers to remain in the Yukon as a free man and begin a new life.There's somewhat of an epilogue which describes Luton as a valued advisor to Lloyd George during the Great War, but there is no mention of a wife or family - sad ending for a promising man."}, {"userName": "Mark Hiser", "userReviewDate": "Jun 12, 2011", "userURL": "http://www.goodreads.com/user/show/5616469-mark-hiser", "userReview": "Lord Luton and his companions determine to reach the gold fields of the Yukon by only crossing Canadian territory. Such is Luton's dislike of America that he ignores knowledge, common sense and advice as he attempts to lead his team.Michener did not quite pull off his attempt to explore the values of an English aristocrat so I just kept thinking that Luton was \"stupid.\"Michener is not a \"great\" novelist, but usually I enoy his books. This on, however, never really engaged me"}, {"userName": "Jeanne Daly", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/11015825-jeanne-daly", "userReview": "I've enjoyed many of Michener's books over the years but this one is the least engaging of any that I'veread so far... It almost feels like he wrote it as an afterthought and didn't enjoy writing it as much as his other novels. Never the less it's interesting to read about this time period of the discovery of gold and what people might have gone through to find it. In my opinion this is not one of Michener's best but still a great novel."}, {"userName": "Marlene", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/326329-marlene", "userReview": "After reading Mexico, I decided that Michener was not for me; however, this one was handed down to me with the comment that it was better than Mexico. So, I read it. As seems to be his style, he wanders off and writes a lot of stuff that really does nothing for the story, in my view. As with Mexico, I found sections that I enjoyed, but then skimmed through a lot in order to find another. I know that Michener is a popular author, but not my cup of tea. Hopefully I have learned."}, {"userName": "Tony", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/6880940-tony", "userReview": "I enjoyed it except for 2 unanswered questions.1.Someone in the party purchased a bottle of ascorbic acid before leaving for Dawson. So why were they digging for roots to cure scurvy?2. It was asked of Irina how she got to Edmonton and she \"avoided the question\". I thought there would be something interesting revealed later about how she got there but that was the end of it."}, {"userName": "Jerome Peterson", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/3000545-jerome-peterson", "userReview": "Incredible read filled with suspenseful adventure."}, {"userName": "Betty", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/725144-betty", "userReview": "A very interesting read!"}, {"userName": "Sean", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/1537884-sean", "userReview": "Journey is a rare short novel from James Michenere, telling the story of an English Lord who travels with four other men in 1897 to the site of the Alaska goldrush in Dawson. What makes the man quirky and the trip very dangerous is that he insists on taking a route that keeps him entirely within Canada until the last possible leg of the journey. His distaste of all things American causes him to avoid a sensible route and instead insist on crossing a high mountain range. The result is a journey that required staying in the wilderness for two winters and the deaths of three of the five men. As usual, Michener's writing style is such that you're convinced that these are real historical people. What's more, you catch yourself wondering how Michener got a hold of the men's exact conversations and deeds. But as usual, the characters in this story are not based on real men, but just incredibly well fleshed out.I only realized while reading the appendix that this story was originally part of the novel \"Alaska\", but cut out as part of the attempt to cut \"Alaska\" down to something under 1,000 pages. Michener was attached enough to the characters in the \"Journey\" story, however, that he released the story as a separate short novel.If you're a fan of Michener, \"Journey\" is not to be missed."}, {"userName": "Barry", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/1551258-barry", "userReview": "In typical Mr. Michener fashion, this is a well-told story that is engaging and interesting. Because of the research he does, his stories are in-depth and an interesting way to learn about history. This book is no exception. The only reason I knocked a star off of my rating is for an anticlimactic ending. The story ends on a rather unsatisfying note, and then Mr. Michener tacks on some poetry with a weak explanation for its inclusion. A couple of poems at the end would have been fine, but 10 or 15 pages is excessive.A final afterword by Mr. Michener is a chapter-length description about the research, writing, and motivation behind this book. It is interesting to see the inner workings of a book taking shape and getting published, but it felt out of place and like a cheap tack-on to add pages (as did the excerpt from his next book to be published). Journey would have concluded far better had Mr. Michener stopped before the poetry and had the publishers settled for a sub-300 page offering. Despite the ending, the story is good and worth reading for the plot and character development alone. Add in the healthy dose of history learned and this is a fine book - one that would have been better without all the extras, but fine nevertheless."}, {"userName": "Catherine", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/25538960-catherine", "userReview": "It read exactly as what it was ... a single story pulled out from the longer novel Alaska and filled out into a novela. Don't get attached to the male characters, because most of them are expendable, and only female character is odd and hard to identify with. I was unclear why the male characters were so taken with her, unless it was because of her long blond hair. I found the suicidal monomania of the English protagonist, who insists on taking the worst possible way to the Alaskan Gold Rush, unbelievable, especially in light of many the warnings he receives, although in real life no doubt such idiots did exist. However after finishing the story, I was not surprised to see in an afterward that the character was really just an excuse for Michener to write the story he wanted to write, which was about the journey along the Mackenzie River in Canada. So, although I'm normally a Michener fan, I was slightly disappointed in this one, because I felt the story did not justify the, ahem, journey."}, {"userName": "Susan", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/29698492-susan", "userReview": "This book, overall was a good read. I mark it somewhere between two and three stars but rounded up because I generally did like it. I was hoping that the story would be deeper than it was but Michener generally kept skimming the surface rather than delving too much into the emotions and drama of the story. For me, one of the other main drawbacks was that Michener wrote the Canadian landscape as someone who has read about it but not really experienced it. The story could ultimately have been set anywhere with a cold climate; aside from place names there was nothing really Canadian about it. Ah well, I suppose that is to be expected from an American (rather than Canadian) author, eh?That said, the story was a good read that I knocked off in a day or two, and which kept me well occupied on my transit commutes."}, {"userName": "William Howle", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/25859194-william-howle", "userReview": "Having read most of Michener's books, I came across this novel in an used book shop. It is short and is the story of a chauvinist Englishman who despises any thing not English. He considers anyone not English to border on being a semi barbarian. He embarks on journey across Canada to Dawson in the Klondike region. His decisions lead three other Englishmen to their death. The only other survivor is an Irish servant. The Lord Luton never assumes responsibility for his bad decisions. I wonder if this book is based on an actual journey or is only his experience with the English upper class."}, {"userName": "Jim White", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/71240236-jim-white", "userReview": "As a Canadian and Michener fan I was very excited about one of his epics (although this is a slim one) set in Canada, and in fact much of it in my home province. Unfortunately sorely disappointed that this book did not live up to hopes. Reads as if it is simply a vehicle for orphan research and plot lines from another novel (likely \"Alaska\") - read several years ago. Perhaps it will be redeemed in a re-read..."}, {"userName": "Scott Lord", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/13052913-scott-lord", "userReview": "The first time I ever read a Michener novel in one dayFlight delays helped, but this is a short novel about the Canadian gold rush in the late 19th century. It started as a chapter in “Alaska” but was pulled out and became it’s own story. The afterward where Michener writes about how and why he separated is fascinating. I’ve read at least 1/2 dozen of his books and enjoyed everyone"}, {"userName": "Brad Neal", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/62060135-brad-neal", "userReview": "A good Michener but not his best. Still enjoyable!Living in Montana I found his perception of -60 degree winters unrealistically benign.Likewise, the role of scurvy was over-played because simple solutions, that should have been readily perceived and implemented, we're not employed.Still, I very much enjoy all of his writing!"}, {"userName": "Marta Weber", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/4483791-marta-weber", "userReview": "After discovering that Journey was an original portion of Alaska, I am looking forward to reading Alaska and feeling the story become more whole in the telling. This wasn’t a bad story and I do like his writing style, it just felt incomplete."}, {"userName": "Joe", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/756362-joe", "userReview": "This was an enjoyable and easy to read book, but was much shorter than it could have been. The condensed story missed a lot of the character and plot development that normally occurs in his novels."}, {"userName": "Joe Spoto", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/45522910-joe-spoto", "userReview": "This is the first book by Michener that I have read. I have read other books on the topic of the gold rush and this one definitely had a different approach. It was an easy read and kept my attention"}, {"userName": "Morgan", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/51749264-morgan", "userReview": "Not up to Michener's usual snuff - characters didn't suck you in and make you want to keep reading like in the rest of his books."}, {"userName": "Allison", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/10932378-allison", "userReview": "Glad I read it because historic angle. Not the character development and overall depth as other Michener novels; much shorter."}, {"userName": "Michele Bond", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/3535781-michele-bond", "userReview": "a good story."}, {"userName": "Bill", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/8708436-bill", "userReview": "A classic tale of prejudice, hubris, and a grand sense of adventure leading an entitled Brit to folly. And yet, still strikingly beautiful."}, {"userName": "gramatzki", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/61911687-gramatzki", "userReview": "Another great story by Michener.Very real and well researched story about the ordeal men are willing to go through for the sake of becoming rich."}, {"userName": "SheriC (PM)", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/3899677-sheric-pm", "userReview": "Just not very interesting. Got a third of the way through the book before anything started happening."}, {"userName": "Federico Kereki", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/18844274-federico-kereki", "userReview": "Originally a part of ALASKA, this is a quite shorter novel, centered in a trip across Canada, from the eastern coast, to the Klondike gold fields -- but quite interesting, anyway!"}, {"userName": "Don Devine", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/31767246-don-devine", "userReview": "I was intrigued by this book when I first opened it. I was very curious as to why it was so short, my copy having 244 pages in all. Very untypical of Michener! But as I read the story, I was delighted to find that while it was not typical Michener it certainly was not Atypical! Overall, this story is fantastically done. Humorous and sad and somewhat frustrating, especially when considering the lead character. The story didn't \"dig into\" details or matters about the area or the characters as much as his other works. But as I discovered later, this indeed was part, at one time, a greater work. Anyway without giving anything more away, this is a great story and if you love Michener as much as I do, you will love this book.But why was it short? Well I found out the answer to all those questions in the books final chapter \"Reflections\" where Michener gave great insight into the creation of this book as well as his \"Alaska\" project. The only critical remark I would make to this story would the books actual final chapter \"Requiem\" which I felt was kind of drawn out and really unnecessary.Beyond that, great book! Now I go to read \"Alaska\"and I think it would indeed be recommended that one reads this book before reading \"Alaska.\""}, {"userName": "Nancy Hartill", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/13962470-nancy-hartill", "userReview": "This interesting story is about 5 men in 1897 who begin from England to cross the Atlantic to Canada, take the train to Edmonton and find a way to the Klondike/Dawson City without crossing into U.S. territory. The real adventure begins when they contract for a boat and head north on a series of rivers downstream towards the Mackenzie and have to choose from about 3 choices, which tributary to head off towards their goal. Meeting a sophisticated woman explorer in Edmonton becomes an interesting interlude for the party. Poor decisions on their choice of direction becomes more than a challenge for the party. This was a short book by comparison for Michener, but interesting, having traveled by car thru British Columbia to Alaska, crossing some of these rivers and coming from the Alaska side down to Dawson City twice. The river system north of the Peace River was definitely a learning experience for me."}, {"userName": "Forrest", "userReviewDate": "Sep 28, 2010", "userURL": "http://www.goodreads.com/user/show/1937907-forrest", "userReview": "Wow, what a great read! Michener sets the stage with five strong characters: Lord Luton, Lord Luton's friend - Harry Carpenter, Luton's nephew - Philip Henslow, Philip's friend - Trevor Blythe, and an Irish blue collar worker - Tim Folgarty. Lord Luton and his friend are older, Philip and his friend are fresh out of college and Folgarty is middle-aged. In 1897 they set out to cross the Atlantic to Montreal, Canada, and then to make their way across Canada to the Klondike Gold Rush in Alaska. Lord Luton's absolute stubbornness not to step foot on American soil in their journey to the gold fields leads to the group's demise. Michener captures the frenzied period of the gold rush days - especially in Edmonton. This is a good book that touches on various aspects of leadership. Michener is able to bring to life the real hardships and needed discipline to spend two years in wilderness in north-west Canada."}], "description": "\"The best novel of James Michener's career.\" Milwaukee JournalGold fever swept the world in 1897. The chance for untold riches sent thousands of dreamers on a perilous trek toward their fortunes, failures, or deaths. Follow four English aristocrats and their Irish servant as they misguidedly haul their dreams across cruel Canadian terrain toward the Klondike gold fields.", "title": "Journey", "url": "http://www.goodreads.com/book/show/29471.Journey", "average": 3.77, "cover": "https://images.gr-assets.com/books/1388459643l/29471.jpg", "reviews": 124, "authors": [{"url": "https://www.goodreads.com/author/show/7995.James_A_Michener", "name": "James A. Michener"}], "type": ["Historical", "Fiction", "Cultural", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/29471.Journey", "http://www.goodreads.com/book/show/316884.Journey", "http://www.goodreads.com/book/show/37805153-journey", "http://www.goodreads.com/book/show/21485836-journey", "http://www.goodreads.com/book/show/25614285-journey", "http://www.goodreads.com/book/show/12658.Hawaii", "http://www.goodreads.com/book/show/12657.The_Source", "http://www.goodreads.com/book/show/133430.Centennial", "http://www.goodreads.com/book/show/12661.Chesapeake", "http://www.goodreads.com/book/show/12663.The_Covenant", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}