{"ratings": 923, "userreviews": [{"userName": "Betsy", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "Windows. Mirrors. Mirrors. Windows. Windowy mirrors. Mirrory windows. Windows. Mirrors. Sliding doors! Mirrors. Windows.In the world of 21st century children’s literature, diversity should be the name of the game. We want books for our children that reflect the worlds they know and the worlds they have yet to greet. We want them to see themselves in their books (mirrors), see others unlike themselves (windows), and have a way to get from one place to another (sliding doors). To accomplish this, all you have to do is publish a whole bunch of books about kids of different races, religions, abilities, persuasions, you name it. Great strides have been made over the last few years in the general consciousness of the publishing industry (the publishers, the librarians, the teachers, and even the parents) even as teeny tiny, itty bitty, itsy bitsy tiptoes have been made in terms of what actually is getting published. Much of the credit for spearheading efforts to bring to light more and more books for all children can be given to the We Need Diverse Books movement. That said, our children’s rooms are still filled with monumental gaps. Contemporary Jewish characters are rare. Muslim characters rarer still. And don’t even TALK to me about the state of kids in wheelchairs these days. Interestingly enough, the area where diversity has increased the most is in early chapter books. Whether it’s Anna Hibiscus,  Lola Levine, Alvin Ho, or any of the other new and interesting characters out there, there is comfort to be found in those books that transition children from easy readers to full-blown novels. Into this world comes Juana Medina and her semi-autobiographical series Juana & Lucas. Short chapters meet universal headaches (with details only available in Bogota, Colombia) ultimately combining to bring us a gal who will strike you as both remarkably familiar and bracingly original.You might think that Juana has it pretty good, and for the most part you’d be right. She lives in Bogota, Colombia “the city that’s closest to my heart” with her Mami. She has a good furry best friend (her dog, Lucas) and a good not-so-furry best friend (Juli). And hey, it’s the first day of school! Cool, right? Only nothing goes the way Juana planned. The whole unfortunate day is capped off when one of her teachers informs the class that they will be learning “the English” this year. Could anything be more unfair? Yet as Juana searches for sympathy amongst her friends and relatives, she realizes that everyone seems to think that learning English is a good thing. Are they crazy? It isn’t until an opportunity comes up to visit somewhere fantastic, far away, and English speaking that she finally takes what everyone has told her to heart. In a big way.I love, first and foremost, the fact that the emotional crux of this book is fixated on Juana’s detestation of learning “the English”. Now already I’ve heard some commenters online complain that Juana’s problem isn’t something that English-speaking children will identify with. Bull. Any child that has ever learned to read will know where Juana is coming from. What English speaker would fail to sympathize when she asks, “Why are read and read written the same way but sound different? How can I know when people are talking about eyes or ice when they sound about the same? And what about left hand and left the room? So many words, so little sense”? Some kids reading this book may have experience learning another language too. For them, Juana’s complaints will ring true and clear. That’s a key aspect of her personality. She’s sympathetic, even when she’s whining.For all that we’ve seen books like Juana’s, Lola Levine,  Zapato Power,  Pedro, First Grade Hero, and a handful of others, interestingly this increase in Latino early chapter book is relatively recent. For a long time it was Zapato Power or nothing. The change is great, but it’s significant to note that all the books I’ve mentioned here are set in the United States. American books set in South American countries where the kids just live their daily lives and don’t have to deal with civil wars or invasions or coyotes or drug runners are difficult to find. What makes Juana and Lucas so unique is that it’s about a child living her life, having the kinds of problems that Ramona or Ruby Lu or Dyamonde Daniel could relate to. And like Anna Hibiscus or The Great Cake Mystery I love books for younger children that go through daily life in other present day countries. Windows indeed.Early chapter books are interesting because publishers see them as far more series-driven than their writers might. An author can crank out title after title after title to feed the needs of their young readers, always assuming the demand is there, and they can do it easier with books under 100 pages than above. Juana could fit the bill in this regard. Her personality is likable, for starters. She’s not rude like Junie B. Jones or willfully headstrong in the same way as Ramona, but she does screw up. She does complain wildly. There are aspects of her personality you can identify with right from the start. I’d be pleased to see more of her in the future, and young readers will undoubtedly feel the same way. Plus, she has one particular feature that puts her heads and tails above a lot of the competition: She’s in color.Created in ink and watercolor, Medina illustrates as well as writes her books. This art actually puts the book in a coveted place few titles can brag. You might ask if there’s a middle point between easy books and, say, Magic Tree House titles. I’d say this book was it. Containing a multitude of full-color pictures and spreads, it offers kids the comfort of picture books with the sensibility and sophistication of chapter book literature. And since she’s already got the art in place, why not work in some snazzy typography as well? Medina will often integrate individual words into the art. They swoop and soar around the characters, increasing and decreasing in size, according to their wont. Periodically a character will be pulled out and surrounded by fun little descriptor tidbits about their personage in a tiny font. Other times sentences move to imitate what their words say, like when Juana discusses how Escanilberto can kick the ball, “hard enough to send it across the field.” That sentence moves from his foot to a point just above his opponent’s head, the ball just out of reach. I like to think this radical wordplay plays into the early reader’s enjoyment of the book. It’s a lot more fun to read a chapter book when you have no idea what the words are going to pull on you next.The writing is good, though the conclusion struck me as a bit rushed. Admittedly the solution to Juana’s problems is tied up pretty quickly. She won’t learn, she won’t learn, she won’t learn. She gets to have a prize? She studies and studies and studies. So rather than have her come to an understanding of English’s use on her own, an outside force (in this case, the promise of seeing Astroman) is the true impetus to her change. Sure, at the very end of the book she suddenly hits on the importance of learning other languages and visiting other places around the globe but it’s a bit after the fact. Not a big problem in the book, of course, but it would have been cool to have Juana come to this realization without outside influences.As nutty as it sounds, Juana and Lucas is a bit short on the “Lucas” side of that equation. Juana’s the true star of the show here, relegating man’s best friend to the sidelines. Fortunately, I have faith in this series. I have faith that it will return for future sequels and that when those sequels arrive they’ll have a storyline for Lucas to carry on his own. With Juana nearby, of course. After all, she belongs to the pantheon of strong female early chapter characters out there, ready to teach kids about life in contemporary Colombia even as she navigates her own trials and successes. And it’s funny. Did I mention it’s funny? You probably got that from context, but it bears saying. “Juana and Lucas” is the kind of book I’d like to see a lot more of. Let’s hope Ms. Medina is ready to spearhead a small revolution of early chapter book international diversity of her very own.For ages 6-9"}, {"userName": "Mitticus", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/4765800-mitticus", "userReview": "+Digital copy gently provided by Netgalley in exchange for a honest review+I wanted to read something fluffy after my last book, so I grab this. A children book. Cute drawings, btw.Juana lives in Bogota, Colombia, goes to school, has a dog (Lucas), and talks about her dailies activities , plus likes and dislikes as every child. I'm not really sure, but the story seems directed to bilingual children, there are spanish words in some points (kind of spanglish), and that confused me a bit. Then the ejem big conflict in the book is because she didn't understand why she has to learn The English., and the people around her 'enlightened' her, or maybe 'enticed' her would be more apt. The pdf copy I get has some words not really visible, or maybe a different base color should allow to read it?\nAnd I found an error:\nMrs. Juana, the word in that case is \n\"pensar\"\n and not \"pensando\"."}, {"userName": "Agnė", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/22440207-agn", "userReview": "Juana and Lucas is a sweet, lighthearted, and generously illustrated transitional chapter book with a Colombian heroine, set in contemporary Colombia.I love the fact that the English text is sprinkled with Spanish words, which are not translated anywhere in the book and thus the readers who do not know any Spanish have to figure out what the Spanish words mean based on the context. While Juana is struggling to learn English, the English-speaking readers are learning some Spanish!Also, Juana Medina's colorful illustrations and the book's design are great:However, the story itself is rather uneventful. Also, even though the title of the book suggests that the story is about Juana and her dog, Lucas, Lucas is only one of the supporting characters, while Juana is the sole star of the book."}, {"userName": "Mehsi", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/6720768-mehsi", "userReview": "I received this book from Netgalley in exchange of an honest review.Yay! A character, who is a kid, who loves Brussels sprouts! That is really a first in a long time since I saw a kid whose favourite food is this. Normally in books with kids it is all about how they hate it, how they are disgusted by it.So when I saw this little girl loved Brussels sprouts… well what could possibly go wrong then. And then came the part where she said she loved reading books. A girl who loves books and Brussels sprouts? Wow. That is truly a first I have seen this combination in a book.I loved how she introduced us to her city, and also told us various fun things about the city. Like the language (Spanish), about the weather and more.The introduction about her dog Lucas was done really fun (with a drawing of her dog and then all kinds of lines pointing at him, telling us what kind of skills he has, what kind of dog he is). And she did the same for her best friend and several other characters that were important to the story. It is a shame that my tablet broke up the pages, but I am sure in a paper-format this kind of thing looks really nice.The book is about Juana having to learn English, and how much trouble she is having with it. She also doesn’t get why she should learn English, which gave me a chuckle, though I could understand her. So she pops by various characters to see what their view is on English and why she should learn it. Finally she finds one reason, and what that reason is? Well, you will have to read this book to find out. I do have to say that I loved that reason. It is a fun one, and it motivated Juana enormously.There was one thing I didn’t entirely like. The Spanish words that were thrown in at random intervals. While I do know some words in Spanish, I don’t know a lot. Some words were just simple and I could easily figure out what they meant, but some of them meant I had to grab my Spanish dictionary (yes, I have one, because a few years back I tried to learn Spanish, and I still want to go back to learning it again).Also in my copy (pdf) the letters at times turned half invisible which made it really hard to read.I really loved the illustrations in this one.All in all? I would recommend this series, and I will be sure to buy the book when it comes out in paperback. Of course I will also keep an eye on the rest of the series (when it comes out) as well.Review first posted at https://twirlingbookprincess.com/"}, {"userName": "Margie", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/5281649-margie", "userReview": "Navigating through life, even if you tend to be an optimist, is much better when shared with a friend. If this friend should happen to be a dog, you could not ask for a better companion and confidant. A dog's affection never wavers plus they probably understand every single thing you say. They are the best secret keepers. They dispense advice with a look, a nudge or a tail wag.If you happen to be beginning another year of school, a dog can get you through any difficulties you encounter. Juana & Lucas (Candlewick Press, September 27, 2016) written and illustrated by Juana Medina provides readers with an up-close and personal view on growing up in Bogota, Colombia through the eyes of a lovable, lively little girl. She gives new meaning to the word energetic.My full recommendation: http://librariansquest.blogspot.com/2..."}, {"userName": "Molly", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/336496-molly", "userReview": "Oh my goodness, this is just adorable! I read it for my Children's Lit class, and honestly it's not something I would have picked up on my own because it's just a little too young for jr high students (which is a shame, because it reminds me of \"Barrio Boy\" and \"Names/Nombres\", both of which we teach during the memoir unit, which could use some updating!). Anyway, it's about an adorable, pigtailed Columbian 4th grade girl who has to learn English. And she hates it, because let's be honest, English is a ridiculous language. There's a great line in Barrio Boy about the \"awful idiocies\" of the English language (that I often reference when teaching grammar) and Medina just nails so many of those. The illustrations are also adorable, and the general enthusiasm and likability of this character just leaps off the page. I also love that Medina includes so much Spanish vocabulary throughout the novel, and doesn't bother to translate any of it. If you're paying attention to context or the illustrations, it's all pretty clear, so it doesn't need to be translated. And in the end, yes, Juana learns English, but she also realizes that she wants to travel, which means she will need to learn more languages too. I like that the message is about learning and having a global perspective, rather than just, \"isn't life so much better now that you can talk American?!\" Also, the dog is adorable, but to be honest I'm not 100% sure why he's part of the title. I thought it might be a girl and her dog on grand adventures, but he's not super important to the story. Weird."}, {"userName": "Cecelia", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/67555-cecelia", "userReview": "It’s Inauguration Day here in Washington, DC. I have the day off of work because I live a couple of streets away from Arlington National Cemetery and my office is on Pennsylvania Avenue. It’s still a Friday, but the library is closed and I don’t want to turn on the TV. I do want to do something constructive – something that will make a difference and build up my spirits. So, I’m reviewing a book by a local author – by a Spanish-speaking immigrant, even. I want to share with you a book that is adorable, smart, different, and immensely readable. Let’s talk about Juana Medina’s Juana & Lucas.Juana is a rambunctious girl who lives in Bogotá, Colombia with her mother and her dog Lucas. Juana loves many things – her abuelos (grandparents), art, her best friend at school, her city (and of course her Mami and Lucas!)… but she does not love learning English. It’s difficult, it’s boring, and she wonders what the point is. When her grandfather tells her that the family will visit Florida, everything changes. Juana MUST learn English!Juana & Lucas is an illustrated chapter book with a lot of heart. Juana has the same sort of thoughts and worries and dreams as any kid – she’s relatable, and she’s smart and fun. While Juana is hilariously lamenting how boring English is, she drops many little tidbits about life in Colombia, and the reader learns a bit of Spanish too – all Spanish words are italicized and understandable in the context of the story. Juana’s happy, functioning family (in a unique environment) is also important, as oftentimes parents in children’s lit are absent, dead, or worse.Author Juana Medina both wrote and illustrated the text, and her art is a colorful mix of black lines and watercolor. The effect is cheery and vibrant, and the simplicity of the figures and outlines is likely to inspire her grade-school readers to imitate and carry on telling Juana’s future adventures. My favorite page spreads were the ones where Juana identifies every item by name.In all, Juana & Lucas is a vibrant, fun early picture book for any kid or kid-at-heart.Recommended for: early readers, reluctant readers, fans of comics and art, and… anyone, really!"}, {"userName": "Julie Seifert", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/3024274-julie-seifert", "userReview": "LOVE"}, {"userName": "Sarah Johnson", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/1002270-sarah-johnson", "userReview": "Good as a read aloud for kindergarten and 1st grade."}, {"userName": "Turrean", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/5348205-turrean", "userReview": "Perfect for my kiddos learning Spanish! They'll absolute sympathize with what Juana is going through."}, {"userName": "Alex Fisher", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/76315492-alex-fisher", "userReview": "This is a nice picture book about a little girl who has to learn how to speak English. It teaches kids that even though learning another language may not always be fun but if it is the main language, it is worth learning so that you can travel and meet a lot of different people."}, {"userName": "Dawn Keys", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/69590792-dawn-keys", "userReview": "Juana and Lucas is a contemporary realistic fiction work written by Juana Medina for young readers ages 5-8. I was excited to add this to my library collection because we don’t have a lot of early chapter books that depict characters from South America. This book also received the Pura Belpre Award.The protagonist in this story is a Juana, a young girl that is not a fan of school and learning English. She loves her family, her dog, and her favorite class at school is recess, so she can play futbol. The story deals with the struggles she goes through with understanding why she should learn English. Eventually, she is influenced by her Grandfather and finds out she can go to Spaceland in the U.S. if she learns English, so she becomes motivated.Juana Medina is an author and an illustrator, so this book is filled with lots of beautiful pictures. It isn’t set up like a traditional chapter book. It infuses the words with the illustrations. I think that makes it interesting for children. The author also includes many Spanish words through out the text. The words are easy enough to figure out through the context of the story. I think this would appeal to bilingual students. The main character is also relatable to those students who are learning English as another language. I gave this 4 stars instead of 5 because I would have liked to see a little more plot development. Overall I enjoyed the book and I liked Juana as a character. I look forward to seeing how the series will develop."}, {"userName": "Terrance Franklin", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/64461858-terrance-franklin", "userReview": "This book was truly a delight to read. \"Juana and Lucas\" follows the story of Juana Medina (the author) and her \"furry amigo\" Lucas (her dog). Juana is beginning to learn English in school but, she's having problems. Her story persists with Juana and Lucas as they go through her daily life; playing soccer (Futbol), going to school, playing with family and learning how important learning English can be. Each page, is filled with a parts of Juana's experiences and that resonated with me personally, and she has a way with words that allow readers to truly empathize with what she's saying. The author uses various forms of typography to help illustrate her feelings for example, increasing the font when she feels REALLY strongly about something. Juana is very much like other kids I know: she has fun, loves her family, gets bored and gets irritated and she expresses this in a certain way in the story. In several pages she uses \"Idea webs\", centering certain people like her Mami and Abuelo telling us, the readers, how she feels about them. This was very interesting,as I had never seen something like this done in a book before and it really helped me feel how important they were in her life. I also loved how the author mixed Spanish words into the text when Juana spoke it made her words feel natural and made Juana's character very genuine. Overall Juana and Lucas was a fantastic book that very much earns its high praise, very enjoyable read!"}, {"userName": "Lucía Díaz", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/64438361-luc-a-d-az", "userReview": "\"...my life is pretty fantastic and English will do nothing but ruin it” (p. 32). When Juana, a school girl from Bogotá, faces the challenge of the having to learn \"the English\" she is absolutely opposed. The book has quite a bit of text but the colorful drawings and the way the letters are placed make it a fun read. One thing I particularly like about this book is that it has a Latina protagonist. Although the book is primarily an English narration by Juana, some Spanish is incorporated into the book, for example, when Juana sits next to her friend Juli on the bus she says: “Sitting with Juli is always good because we have mucho to talk about” (p.g 11). This is a fun way to introduce kids to Spanish and broaden their cultural horizons. I also find that the book is quite relatable for kids in the process of learning English. Growing up in Puerto Rico and having to learn English at a young age was as frustrating for me as it was for Juana. I believe that reading this book would have helped my learning process, it would have encouraged me to know that other kids go through the same struggles. Not only that but it would have made an excellent reading exercise. I’m giving the book 4 stars because the ending was a bit rushed for my taste. I also found the title a bit misleading as there was hardly any Lucas in the book. Despite that, I would still recommend it if you want your child or students to get a look into another culture and I especially recommend reading it to children that are learning English as it will provide relatable content."}, {"userName": "Amy", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/2487858-amy", "userReview": "A note that the cover is misleading -- this isn't exactly a book about a girl and her dog. I love books that showcase multicultural and multilingual diversity, but this book about a girl overcoming her struggles to learn English is difficult to place. I enjoyed the heavy doses of Spanish applied throughout, making this a truly bilingual book, but I am not sure who would enjoy this story. It's a little too wordy to be like a Madeleine, it's a little too immature to be a Ramona. I do have some students who have extremely limited English proficiency and enjoy reading picture books in English, but the English here is too complex for them. Too bad! They would love a story like this.Clever use of infographic-like images and captions to talk about Juana's favorite things.... I'll give this book away to a bilingual family for my students to read to younger siblings and ask them what they make of this series."}, {"userName": "Abby Johnson", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/53329-abby-johnson", "userReview": "Meet Juana. She lives in Bogota, Columbia, loves hanging out with her dog Lucas, and HATES learning English. This year at school, her class starts learning English and Juana could hate nothing more - it's too complicated, the sounds tickle her tongue, and she doesn't see the POINT. Can anything change Juana's mind about learning English? Though this story is undoubtedly valuable for opening a window to show a child's life in Colombia and for depicting a South American child who is not poor or war-torn, there's not much tension to the story and not a whole lot happens. The book is illustrated cheerfully and Juana presents her life with lots of energy and humor, using illustrated spreads to introduce the reader to her dog, her mother, her abuelo, etc. Spanish words are sprinkled liberally throughout the text of the book, so this would be a fun one to read with kids who are learning Spanish or with kids who will see themselves reflected in the pages of Juana's story."}, {"userName": "Annette", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/1927559-annette", "userReview": "JUANA AND LUCAS by Juana Medina is a new series featuring a young girl and her dog growing up in Colombia.In her first humorous adventure, Juana shares her likes and dislikes. For instance, she isn’t excited about learning English. However when she learns about the value of language learning, she changes her mind.Librarian will find that the short, easy-to-read chapters and comic-style illustrations will appeal to young readers. The international setting provides a unique perspective.To learn more about the author, go to http://www.juanamedina.com/.Published by Candlewick on September 28, 2016. ARC courtesy of the publisher."}, {"userName": "Maureen Timerman", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "Juana and Lucas could take place anywhere, but Juana, Who-an-nah, is the story of a little girl in Bogota Columbia, and instead of learning Spanish she is struggling with English. The book states that it is geared for 5 to 8 years old, but it could be a little older too, there are so many similarities between the cultures that you forget it doesn’t take place in the United States.Juana has a little dog, Lucas, who takes part in some of her adventures, and she sure is an active little one. A side note your child will be learning some Spanish without even realizing it.A sweet read with a bit of education thrown in and learning that although some things are different, and lot is alike."}, {"userName": "Kristin", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/10381638-kristin", "userReview": "At first, I was liking the diversity of this story about a Colombian girl. Several words were in Spanish and italicized and I thought it could be great for children learning Spanish. But as the story went on, there wasn't any action and the teachers seemed unnecessarily mean. The protagonist, Juana, was sort of forced to learn English or she wouldn't be taken on a trip to Spaceland. It just didn't work for me. I thought by the title that it would be about a girl and her dog, but Lucas wasn't in the story much. However, the illustrations and author's craft were excellent!"}, {"userName": "Sarah Sammis", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "Juana and Lucas by Juana Medina is an early reader inspired by the author's childhood in Bogotá. She begins by outlining the things she likes and doesn't like and what her life at home and school is like. Then she settles into how she had to learn English in school and how difficult and frustrating it was and how stupid a class it seemed at the time.http://pussreboots.com/blog/2018/comm..."}, {"userName": "Niki Marion", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/26191060-niki-marion", "userReview": "Only getting three stars because we *desperately* need more Latina EARLY chapter books written by Latinas. Otherwise, I have some pretty major problems with the book's design, title, and ending that I'll elaborate on later."}, {"userName": "Danielle", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/6868711-danielle", "userReview": "One of the many things I like about this book—the format that uses introductions, the illustrations, the voice!—is the way Juana is learning English while the reader, reading a book in English, is subtly learning the Spanish words weaved in. Clever and effective."}, {"userName": "Erica", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/6447688-erica", "userReview": "Juana is a great narrator, and Medina's illustrations show her vivacious, dramatic, energetic, warm, intelligent self, bouncing all over Bogotá, Columbia, explaining everything to the reader. Readers in the age range of 5 to 9 might relate well to her, and the format of this book, 7w x 9.25h, with color spot-illustrations on every page, is just right for that age reader. (We call it \"moving up\" in my library.) I appreciate her varied interests, and those of her older family members - her mom, aunt, grandmother, & grandfather each have interesting careers in arts, practical work, & science. I also appreciate that the characters are a mix of skin tones, with Juana herself a light-brown, with brown pigtails. What is not just right for this age group is the sprinkling of Spanish words in a text that is 97% English, especially not when the main character lives in a Spanish-speaking country, and the conflict that comes up, about 1/3 into the story, is all about learning English. At that point, any reader would wonder how she was already speaking perfect English, with sprinkles of Spanish words, if she didn't yet know any English. In fact, on page 3, Juana, as the first-person narrator, says, \"My favorite food...is Brussels sprouts. In Bogotá, Brussels sprouts are called repollitas.\" This leads us to believe that she is already bilingual. So, the crisis is a surprise - why is learning English a trauma for her when she already seemed to be fully bilingual? In real life, bilingual people often use whichever word comes to mind first, so sprinkling their English with Spanish or vice-versa is common. But Juana is supposed to be monolingually Spanish until Chapter 9, page 64, when she truly puts her mind to learning English. It would have made more sense for the English-learning to start a bit earlier in the story arc than page 28, and to use occasional Spanish words with more overt attention. For example, as she started learning, she could have used both English and Spanish words for select things that are likely to come up in a language-learning process. In that case, the reader would do a sort of mental \"switch\" in that she would be seen as speaking one language (Spanish, that we read as English) and learning another (English, that we read as Spanish). The color illustrations would lend themselves well to visual labels, like the ones she makes for the Herrera brothers' store. Instead, Medina shows Juana doing the fully-bilingual thing of using seemingly random Spanish words in an otherwise completely English first-person narration. These random Spanish vocabulary words will pose a difficulty for many \"moving up\" readers who are not yet fully fluent in reading, and for adults reading aloud who might butcher the pronunciation to the point of misleading the listener. For example, \"...the morning is especialmente beautiful...\" \"...we have mucho to talk about...\"...my lunch box tragedia...\" are all examples of when the translated word is one that might be emphasized for drama, but not the one that carries the most significance. The book may be perfect for readers like Medina herself, who speak and read fluently in English, and were raised speaking (and perhaps reading & writing) fluently in Spanish. If so, when Juana complains about having to learn English, they may relate to Juana's sentiment that learning a second language is just annoying, and nobody should take for granted its value without some argument. They may also have that delicious superior feeling that comes from understanding something that others struggle with. I think Medina could have provided that delicious feeling while still having the language set-up make sense, and while also including all the other readers who haven't had the chance to learn more than one language, but who could choose to do so if a book effectively showed the advantage. Unfortunately, Juana's motivation to learn turns out to be a chimera, as Astroman doesn't respond to her when she gets to Spaceland in Florida. When that happens, all the bilingual readers (the best readers of this book) will feel disappointed at her having worked hard for a goal that turned out to be quite different in the end - not pointless, but not nearly as exciting as the plan."}, {"userName": "Barbara", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "This winner of the Pura Belpre Award for Author will provide some inspiration and amusement for many young readers who are already fluently bilingual or trying to learn another language. As readers will realize from the opening pages, Juana is a passionate young girl who has many loves, a love which she expresses enthusiastically. She loves her home city of Bogota, Columbia, her dog Lucas, Astroman, and reading. Although she enjoys school, math is not much fun for her, and school gets harder when her teacher introduces a new subject. It might surprise some readers when Juana's teacher decides that her class will learn English. She and her classmates struggle with it, of course, because of its inconsistencies with multiple meanings for some words and words that sound alike but are spelled differently or mean something different. Each of the mentors in her life provides good reasons for learning English, but her grandfather gives the best one of all. He has planned a trip to Spaceland where she might meet Astroman. Now highly motivated, Juana throws herself into her lessons and even works on her English at home. The funny twist at the end in which Juana chats enthusiastically with everyone she meets at the theme park but gets no verbal response from Astroman will make readers smile. While some might think the experience will put her off learning languages, instead, having caught the travel bug, Juana decides that she wants to learn even more languages so she can talk to others around the world. The use of abundant white space to surround the ink and watercolor illustrations lends the book a fresh appearance that is appealing. I liked the sprinkling of Spanish throughout the story and the pages in which one character or object would appear surrounded by simple comments. Fans of Clementine and Judy Moody are likely to enjoy this book. It could certainly provide reassurances for many young readers trying to tackle a new language."}, {"userName": "Liz Exo", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/20633348-liz-exo", "userReview": "Juana & Lucas is a young reader chapter book (grades 1-3) which features Juana (\"pronounced who-a-nah,\" as she so self-assuredly tells the reader on page one) and her journey to go see her favorite character, Astroman, in person at a amusement park in Florida. Juana's story chronicles her daily life in Bogotá, Colombia where she goes to school, shops, plays, and does homework, all in Spanish. Her problem arises when her teacher announces suddenly that they will begin to learn...\"the English!\" Juana's life is turned upside down as she tries to navigate this new, confusing language. In the end, she finds personal motivation to learn English, and it starts with \"Astro\" and ends with \"man.\"This chapter book has great character development. Juana loves to explain why she loves things (i.e. her dog, her aunt, her mami) complete with diagrams and witty captions. Another unique touch is the Spanish words that are inserted throughout the book! Most of the Spanish words are cognates or very contexualized that even a young reader without any Spanish knowledge would be able to figure out their meaning. This adds a fun element to Juana's storytelling. This feature could even be used to teach how to use context clues to determine the meaning of unknown words!"}, {"userName": "Monica Simpson", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/70653835-monica-simpson", "userReview": "Juana loves her dog and brussel sprouts. Juana hates her school uniform.Juana loves her Mami and her abuelos. Juana hates that she has to learn \"the English\".Set in Bogota', Colombia, Juana and Lucas takes us on the simple but entertaining adventure of a young girl who has a best friend, a crabby school bus driver, a caring support community, and one really huge frustration (in addition to all of the everyday frustrations). The illustrations and even the font of this story really help us to understand more about Juana and what she feels in any given situation. Her child-like honesty is spot on and humorous: \"When a grown-up says something is going to be a ton of fun, it mans that there will be NO FUN AT ALL. Not even a single bit of fun. Nada de fun.\" What lessons might Juana learn as she has to do the not-fun-at-all thing anyway?The Spanish words that appear regularly through the story are never defined for the reader, but the meanings are not difficult to infer in the confines of the tale. Juana's contagious personality will easily draw in young readers as well as those having the story read to them. There are lots of chances to role play if you're reading this to children."}, {"userName": "Kristina", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/70548560-kristina", "userReview": "Summary:Juana is a sweet, spunky, expressive girl from Bogotá, Colombia. She loves brussel sprouts, her Abuelo, Astroman, and playing fútbol. But...she HATES learning \"the English\" because the words tickle her tongue. How will she react when she discovers that Abuelo is taking her on a trip to Spaceland in Florida? Evaluation:Winner of the 2017 Pura Belpré Award, Juana and Lucas, is a realistic fiction chapter book for readers grades 1-3. Even though Juana is a young Latina girl, this book will appeal to a wide variety of readers because of its wit, charm, and humor. Every child can see something of themselves in Juana. I like how the author uses font size to show when Juan is really emotive, as well as captions and word webs to show Juana's thinking. I thoroughly enjoyed reading the book, however, I feel it lacked in some character development, and the ending of the book was a bit to abrupt for my taste.Teacher Recommendation:For a teacher with some Spanish language skills this would be a great read aloud. I think this book would also work as a guided reading book for English Language Learners as well. This book would also make a great mentor text for writer's workshop when teaching about voice."}, {"userName": "RLL220_Karen Segura", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/79899722-rll220-karen-segura", "userReview": "Juana & Lucas by Juana Medina is a story about Juana a little girl from Bogota Colombia, who loves to play soccer and has a best friend named Lucas, her dog. Little Juana who usually gets caught up with trouble is struggling in school because they are learning English. She thinks it’s pointless to learn English because she thinks she isn’t going to need it. However, after talking to her grandpa who went to medical school in Chicago, told her she needed to learn it if she wanted to meet Astroman. Overall, she seems to overcome the challenge of learning English. This book can be read by children in the 3rd or 4th grade because it’s a small chapter book. The illustrations have a lot of earthy colors along with watercolors. This book can be used to assign a book to read for children and have them answer questions of Juana’s character and through their social emotional, by having them explore how they would feel if they were in the same position. They can also write their own story relating to Juana & Lucas. Overall, I liked the book because of how the author played around with the words and sentences as if it was a drawing."}, {"userName": "Teresa", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/64543095-teresa", "userReview": "Juana & Lucas written and illustrated by Juana MedinaCopyright: 2016Genre: Novel, Realistic FictionLiterature Requirement: A book that has been awarded a Pura Belpre author award*Spoiler Alert* I really enjoyed Juana & Lucas. I feel like the main character Juana is relateable to any child. I really liked all of the illustrations that the author did. I felt like the illustrations added character to the whole book series and helped the reader understand some of the Spanish words used in a different context. I would give this book four out of five stars because I felt the author didn’t really used the meaning for the Spanish words in English. I struggled a couple of times trying to understand the meaning of the different words in Spanish. I liked how the author seemed to use to write as if she was a child. I think this book would be great for students who are struggling readers or are Spanish speaking ELL students. The illustrations cal help the reader understand what the author is writing about."}, {"userName": "Hannah Klein", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/71563374-hannah-klein", "userReview": "Winner of the 2017 Pura Belpré Author Award, Juana and Lucas is a very relatable story of a young girl, named Juana, that grew up in another country and is having to learn another language, English. things she loves to do and even provides information about Bogota, Columbia. However, she does not like learning English. But when her grandmother tells her about a trip that she is going to go on and that she will need the English, she sees that it may not be silly after all. This is a story that many new students from different countries can relate to. The change of a new place and the struggle to learn a language that does not make sense can be very hard for students. This book will help students feel connected with others going through similar struggles. It is written in chapters with great pictures and creative font design throughout the pages. It is full of great descriptive words and even includes Spanish words described through context throughout the story. I would recommend this book for grades 2-4."}], "description": "Fans of Judy Moody and Clarice Bean will love Juana, the spunky young Colombian girl who stars in this playful, abundantly illustrated new series.Juana loves many things — drawing, eating Brussels sprouts, living in Bogotá, Colombia, and especially her dog, Lucas, the best amigo ever. She does not love wearing her itchy school uniform, solving math problems, or going to dance class. And she especially does not love learning the English. Why is it so important to learn a language that makes so little sense? But when Juana’s abuelos tell her about a special trip they are planning—one that Juana will need to speak English to go on—Juana begins to wonder whether learning the English might be a good use of her time after all. Hilarious, energetic, and utterly relatable, Juana will win over los corazones — the hearts — of readers everywhere in her first adventure, presented by namesake Juana Medina.", "title": "Juana and Lucas\n      \n          (Juana and Lucas #1)", "url": "http://www.goodreads.com/book/show/28686882-juana-and-lucas", "average": 3.97, "cover": "https://images.gr-assets.com/books/1457467280l/28686882.jpg", "reviews": 281, "authors": [{"url": "https://www.goodreads.com/author/show/8319333.Juana_Medina", "name": "Juana Medina"}], "type": ["Realistic Fiction", "Childrens", "Childrens", "Cultural", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28686882-juana-and-lucas", "http://www.goodreads.com/book/show/27164276-1-big-salad", "http://www.goodreads.com/book/show/30201884-abc-pasta", "http://www.goodreads.com/book/show/40163289-1-big-salad", "http://www.goodreads.com/book/show/22522295-smick", "http://www.goodreads.com/book/show/36495841-lena-s-shoes-are-nervous"]}