{"ratings": 2988, "userreviews": [{"userName": "Jamie", "userReviewDate": "Apr 15, 2008", "userURL": "http://www.goodreads.com/user/show/770960-jamie", "userReview": "I thought this book was going to be like many of my grandmother's old books: a cheesy romance novel from the first half of the last century. They're always amusing books because the\"romance\" part is so mild compared to today's books, and the proper behavior of \"ladies\" is so hilarious by our standards (a lot of nastiness couched in polite language).But while this book had the romance thing going on, it also was quite a history lesson! I spent all day finishing the 2nd half without putting it down, too. I SO wanted Garnet to marry her romantic interest, and for Florinda to run off with hers. I loved the characters, I loved the scenery. I loved that the women were strong, not stopped by convention, adventurous ... I'm not sure exactly when this book was written (my old copy has no date!) but it seemed that a lot of the themes were probably pretty scandalous at the time. In any case, I really loved this book more than I expected to, and would recommend it to anyone, especially if you liked Isabelle Allende's book \"Daughter of Fortune.\" Also, if you watched \"Deadwood\" at all, you'd probably recognize a few characters."}, {"userName": "Naomi Sarah", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/40096835-naomi-sarah", "userReview": "[ I thought Oliver and Garnett's romance was more adorable than John and Garnet's romance. ALTHOUGH I LIKED BOTH. I was really really sad when dear Oliver died, and a bit disappointed that the characters didn't seem to be that sad. HE IS DEAD. Come onnn.  (hide spoiler)]"}, {"userName": "Tweety", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/21428432-tweety", "userReview": "As pretty much everyone can see from my billions of updates on Jubilee Trail I hands down loved it. The story was so simply put over that you never felt like the author was trying to impress you with her knowledge of the times. But I felt like I was there every minute of the way with Garnet. In New York Garnet felt like she was a doll wrapped in tissue paper and set in the closet for safety, but the closeness stifled her. When she met Oliver, he represented everything she didn't have, adventure, excitement and freedom from social rules. He was her ticket to satisfying her curiosity, and she was his ticket to seeing the world through a different lense. Within a short time they were married, for better or for worse.I really don't think anyone could read this book and not like Garnet; she was sweet at the same time as having the strength to do what needed to be done, no matter how hard it was. I felt all her emotions, the strangeness of a new county, the hot, dusty Jubilee Trail that seemed to have no end and the first time Garnet truly felt fear. Maybe she was slightly naive, but she made out ok, and she let herself bend to the wind instead of breaking under it's pressure. It helped that Garnet had mysterious Florinda, who's rough upbringing prepared her for life early on, and it helped that The Handsome Brute was so jolly and of course she had Oliver and his right hand John. Florinda and John were two peas in a pod, both scoffed at what Garnet knew to be important and true, because they didn't understand it. But they understood things Garnet didn't. So they evened each other out, and saw in Oliver what Garnet couldn't see at first. However, I think The Handsome Brute, is the one who helped everyone. His balanced good nature and understating of people made him, Imo, the hero of the book, if not in the romantic sense of the word. There was a bit of mystery shrouding some characters, and it all unfolded as gracefully as a spider weaving it's web, just a tread at a time. And so often it was one of many threads, making it go unnoticed by others in the tale. It was exactly what I was in the mood for, and it hit the spot from page one till the end. PG/PG-13 Some PG-13 elements put over in a PG way if that makes any sense. Ds and Hs are fairly regular, one B and characters are said to say a string of swears, without us having to hear them. One character is a prostitute, but that is more her past, (now she is just a barmaid and we don't go into her work) and a fair bit of the book is in a bar. Burlesque dancing is mentioned, but we don't get any colorful images of it, thank goodness. There are several murders, I'm not telling you if I was pleased to see that some people were no longer walking about. Otherwise it's not objectionable.  I'd say 14/15 years old and up."}, {"userName": "Kate Quinn", "userReviewDate": "May 07, 2009", "userURL": "http://www.goodreads.com/user/show/2232084-kate-quinn", "userReview": "One of the first adult historical fiction books I ever read, and a book that still fascinates me. Gwen Bristow is not a well-known writer of historical fiction, but she deserves to be: her characters are interesting and flawed, her settings are meticulously researched, and her writing style is as clear as a pane of glass. Jubilee Trail is the best of her books, centered around the two-tiered society of California as it was just before the Gold Rush, where proud Spanish rancheros existed side by side with Yankee traders and Mexican citizens. Our guide on this journey is Garnet, an adventurous New York society girl who marries Oliver, a handsome trader who takes her on a headlong journey to California rather than a dull life in polite society. Garnet gets more than she bargains for: lifelong friends and bitter enemies, motherhood and widowhood, poverty and luxury. No one she meets on the trail is quite who they seem, including her husband, and the eventual hero of the book will surprise you. Garnet's best friend Florinda, a beautiful showgirl fleeing murder charges and perhaps something even more sinister, steals the show on every page she appears. And how nice to read a historical fiction book that doesn't end with a marriage, as is traditional, but rather begins with one."}, {"userName": "Joselle173", "userReviewDate": "Feb 09, 2008", "userURL": "http://www.goodreads.com/user/show/271753-joselle173", "userReview": "Are you serious? This is horrible, horrible, horrible! This book pretty much lost me when they helped their friend escape from the hotel in New Orleans. Let me suspend any intelligence I might have and just believe that their plan might have worked. And on the trail to what was it - Arizona?? No Indian attacks along the way? No problems dealing with, hmmmm, womanly issues on the trail? She doesn't get pregnant? It was UNrealistic every step of the incredibly long way. I gave up before GARNET ever arrived to CA. Maybe it got better after that, but it didn't start off too promising and was not worth my time."}, {"userName": "QNPoohBear", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/22177907-qnpoohbear", "userReview": "[Do you think he was in love with Florinda? I think she fell in love with him and was too afraid of getting hurt and that's what her tears were about in the end. I half expected her to follow him to St. Petersburg. (hide spoiler)]"}, {"userName": "Michele", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/1451470-michele", "userReview": "Talk about destiny! I had just read a book by Sandra Dallas and Nancy Turner so to pick up \"Jubilee Trail\" and see that both of these ladies had written a foreword, just seemed meant to be. What a story. I felt like it was a fantastic history lesson. Florinda and Garnet were two of the most interesting characters I've met up with in a long time. I loved Florinda and found her complex, lacking and wonderful all at the same time. 291: She understood why John loved the earth. The rocks and mountains did not fail you because they could not; even the desert was cruel by its own honest laws. The desert did not promise you roses and waterfalls and then give you rocks and sand. Only people did this.John reminded her of the desert: he offered nothing, but then suddenly he was like a rock guarding a spring. And the water was so much more preicous than all the rivers of home, because when you found it you needed it so.338 You developed that kind of courage because you had to. It was not a matter of noble ideas. It was a matter of self defense.Next time my bishop asks me to give a talk in church, I'm going to steal one of Florinda's lines and say, \"Hell on toast, I'd love to,\" and see how it goes over. :)"}, {"userName": "Emily", "userReviewDate": "Sep 24, 2008", "userURL": "http://www.goodreads.com/user/show/972022-emily", "userReview": "I totally loved the language in this book. “Hell for breakfast!” was used all the time instead of “dang it!” Maybe back in the 1840s the words ‘dang it’ hadn’t been invented. I wish we still used ‘hell for breakfast’. But, I must go on with my review. Oh hell for breakfast! Another thing I liked about this book: no one else in Weber County wants to read it so I was able to renew it about 32 times. That was handy. This book was first published in 1950, so I think most of the people who have heard of this book are dead now. Hell for breakfast. So the main character’s name is Garnet. She madly in love with a dude who is going to take a mule train from the east coast to California. Bad stuff ensues (hell for breakfast). She has a baby. She works in a saloon. Other stuff happens. Blah blah blah. There ya go. That’s pretty much it. I have no idea how that took up 564 pages. Even as I read the book I was thinking to myself, “Hell for breakfast, I have read 50 pages and nothing pretty much has happened.” But for some reason it wasn’t agonizing that nothing happened. I just look back and think, “Huh, I really can’t figure out what filled all those pages.” So, if you are in the mood for an epic novel that vaguely (and probably inaccurately) chronicles early southern California, READ THIS BOOK! If you are in the mood for a short story and this is the only book you can find, well, hell for breakfast!"}, {"userName": "Misfit", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "This is the story of just out of finishing school Garnet, who meets and falls in love with Oliver Hale while he's visiting New York from California. Garnet has an adventurous spirit that Oliver indulges and they're off to California via the Jubilee Trail. Along the way they meet up with Florinda, the \"bad\" woman with a heart of gold and Garnet and Florinda become great friends, and support each other during the good and bad times as they cross the country and come to California before it is governed by the US. The author does a very nice job of setting the scenery and the conditions along the trail -- you almost feel the dust in your mouth and on your skin and hair. I loved the way she used John's love of nature so that you can visualize everything from the snow topped mountains, to the red rocks of the southwest, to the wide open ranges, and the flora and fauna of California. All in all a jolly good yarn, I had a hard time putting this down until the very end at the discovery of gold at Sutter's Mill. Highly recommended for any lover of historical fiction, and as this was written 50+ years ago, the love scenes (if you can call them that) are very chaste and well suited for a younger reader."}, {"userName": "Diane Lynn", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/9796451-diane-lynn", "userReview": "Fantastic!"}, {"userName": "Janice", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/1136840-janice", "userReview": "By Amberly:Jubilee Trail is a great story, the writing itself is not especially incredible but the story is incredible. I should mention it felt a little cheesy to me at first - very prim and proper and some other quality I'm not sure how to describe. Once I got a little ways into the book and was used to the writing style it didn't feel cheesy anymore. I did not have a lot of time to read when I started this book. As I moved further through the story I found it harder and harder to put it down. I was reading little snippets during my son's basketball games every time they called a timeout and at the quarter and half. Any time I could squeeze in some reading I did until yesterday when I just blazed through the last 200 pages. I finished the book hoping she wrote a second novel with the same characters. She certainly could have as the story had a good ending that did not leave you hanging but, the characters were still young and off to face another adventure. If you liked These Is My Words and Follow the River you will like this book."}, {"userName": "Rebecca Huston", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/4091267-rebecca-huston", "userReview": "This turned out to be quite an adventure, and very much an improvement on most of the historical fiction/romance being churned out to day about the American West. The characters are not dull at all, the descriptions vivid, and the history great fun to read without being boring. Those looking for the over-the-top sex should look elsewhere; this book doesn't need such cheap tricks to keep it moving. Very much recommended.For the longer review, please go here:http://www.epinions.com/review/Gwen_B..."}, {"userName": "Mela", "userReviewDate": "Oct 01, 2016", "userURL": "http://www.goodreads.com/user/show/41757430-mela", "userReview": "Gwen Bristow was and is one of the best authors of historical fiction. She knew how do it and he did it marvelous. One may think you take some interesting historical background and some more or less original fictional story and you end up with a good historical fiction. No. It isn't definitely enough. Every great writer of this genre has own style, own recipe. And of course Bristow had also.Her books (I have read three her novels) are rich with historical facts but in the way that you don't feel overwhelmed. Thanks to her I know so much about USA history. After each one of the books I had read I searched for more information. I wanted to know more.She showed us a fascinating world. But that world was also wild, hard, sometimes even cruel but that world offered many opportunities for those who dared.She created also great characters. I don't like them all but they all are perfect examples of people who lived then. Through them she described many other women and men.I think, that what she did the best are male characters (especially those who are in closer relationship with a main heroine in some point of the story). In my opinion her male characters are much better created than female characters.All these remarks refer also to Jubilee Trail of course. Reading this book I was completly immersed in those times and with the story. I was a few times totally surprised what had happend. I was thrilled, angry, sad. And these male characters. They are so perfect in their imperfection. Each of them had his own place in the story and in the life of heroine.I love when a book makes own mark in my heart / soul which stays with me for a long time.\"Life let you have what you wanted. But life was like a storekeeper who put up a sign saying “Buy now, pay later,” and tempted you into buying so much that you were in debt for years\"For more details see reviews of Naomi Sarah, Tweety and rQNPoohBea. By the by, QNPoohBear has right, that The story is full of racial and ethnic stereotypes and prejudices that were common in the 1840s. It was hard to read it sometimes."}, {"userName": "Amberly", "userReviewDate": "Feb 18, 2011", "userURL": "http://www.goodreads.com/user/show/3118659-amberly", "userReview": "After I read These Is My Words (and the two books that followed) I went looking for more books by Nancy E. Turner. One busy day while ordering some books from amazon I typed in Nancy's name and this book pulled up so I stuck it in the cart and placed my order. When the order arrived I was very surprised to see this book, whose forewards are written by Nancy E. Turner and Sandra Dallas, was authored by someone I was unfamiliar with. So onto the shelf it went for someday when I didn't have a book in front of me that I HAD to read right then. Well, someday came and I pulled this book out. The forewards hooked me. Ms. Turner said, \"Jubilee Trail is a classic Western, a lush romance, an action adventure, and a survivor story, told with 1950s sensibilities.\" I had to know what she meant by that. I'm not a big fan of westerns or romance novels but it turns out I am a big fan of this book. And the 1950's sensibilities? Oh they are there and I loved it. Bonus - the book is really clean.Jubilee Trail is a great story, the writing itself is not especially incredible but the story is incredible. I should mention it felt a little cheesy to me at first - very prim and proper and some other quality I'm not sure how to describe. Once I got a little ways into the book and was used to the writing style it didn't feel cheesy anymore. I did not have a lot of time to read when I started this book. As I moved further through the story I found it harder and harder to put it down. I was reading little snippets during my son's basketball games every time they called a timeout and at the quarter and half. Any time I could squeeze in some reading I did until yesterday when I just blazed through the last 200 pages. I finished the book hoping she wrote a second novel with the same characters. She certainly could have as the story had a good ending that did not leave you hanging but, the characters were still young and off to face another adventure. If you liked These Is My Words and Follow the River you will like this book."}, {"userName": "Jessica", "userReviewDate": "Aug 24, 2010", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "My friends and I all passed this book around in high school, and a few years ago I was lucky enough to find a copy at a library book sale (prior to this 2006 edition). This is a great book about the settlement of California, from the eyes of a young woman raised in New York society. Longing for adventure, Garnet marries a man she barely knows, wooed by his stories of magical California, a land that isn't even on the map yet. But the path to California is hard, and Garnet encounters many unpleasant surprises, in the way of bandits, hostile natives, even more hostile in-laws, and a husband who is nothing like the charming man who courted her. The characters are richly drawn, from Garnet to Florinda, the dance hall girl she befriends, plus a host of Chinese immigrants, a giant Russian, and the cattle ranchers and prospectors who are trying to make their fortune in the territory. I can remember whole conversations, entire scenes and chapters, this book is so clearly and poignantly written.And I rather fancy wearing a corset, sprigged calico gown, and a Colt pistol in a leather holster . . ."}, {"userName": "Tasha", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/3589603-tasha", "userReview": "This is not a book to grab you and not let go but one that sort of seeps into your consciousness and sort of settles in. It didn't always feel like a 4 star read but as it came together at the end I knew it was a good read. It definitely gives you the feeling of what it was like at that time with the sparseness of California, the roughness of living on the trail and the political flavor of the times. But it's more than that, it's about friendship and brave souls. I think Gwen Bristow set this one up for the next book so I'm pretty sure I will check out Calico Palace one of these days.Edit: I see that Calico Palace continues where Jubilee Trail leaves off in history but not in characters. I am sad to see these characters go, I was thinking I would meet them again in this next one."}, {"userName": "Meg", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/1396439-meg", "userReview": "I had such a fun time reading Jubilee Trail and found myself savoring every word. It was written in the 1950's and it is quite obvious from the writing style, but I found that it added to the charm. It just \"felt\" old fashioned to it's core. The character's were beautifully written with so many layers, and I found myself in love with so many of them. Or hating them passionately...depending. There were so many individual and deeply personal stories interwoven in this book that will stay with me for a lifetime. Garnet and Florinda become unlikely friends traveling the trail to California, pretty much before there was much of a trail. They grow and evolve and entrance you in their world in the meantime. There were so many twists and turns, I never knew what would happen next. I LOVED this book, but those who know me have claimed I like prairie books, ha!*Another highlight for me was the way the author portrayed Mormon's as likeable, hardworking, loyal, spritual, obedient, helpful, happy, chivalrous individuals. I have also found this to be true :)"}, {"userName": "Debbie", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/1565482-debbie", "userReview": "It took me 3 1/2 months to read this, but what a journey. Loved, loved, loved this book!!!!!"}, {"userName": "Debbi", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/2282383-debbi", "userReview": "Takes place in the first half of the 19th century. A high society New york girl, Garnet, is bored with everything about her life including the young men she is introduced to as possible husbands. Then one day she meets Oliver, a trader from a place she'd never heard of called California, and she's smitten. So the book is about her adventures on the trail to California and those she has once she gets there. It was rather slow going at first but I've read this author before and like her so I stayed with it and was glad I did as the story got better and better. Good facts about California history. One thing I really enjoyed was hearing about people going over the trail to California by the southern route. By that I mean they go to Independence, Missouri then south to what is now Santa Fe, New Mexico, and then go on to Los Angeles which was only a village at that time. I've read a lot about the Oregon trail but never about this one."}, {"userName": "Melinda", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/969650-melinda", "userReview": "“What a little girl she had been when she married Oliver! She had been so full of zest and curiosity, so eager to follow all those shining promises that did not exist anywhere except in her own head. She had thought freedom meant simply the chance to have her own way, with no need to take the consequences of having had it. Well, she knew better now. Life was not a lot of golden adventures that cost you nothing. (p. 337)” I wanted a hearty book to capture me and take me on an adventure during some days I had scheduled off. I browsed some titles on Amazon and settled on this book without knowing very much about it. I supposed it had been suggested due to the forward written by Nancy E. Turner. However, the edition I purchased was old and did include one. I truly loved this read. It was just what I had hoped it would be! I am so used to reading books from modern authors who end a book abruptly so they can entice you to read their next installment. I can't say I blame them, but I can't help but feel irritated waiting a year for the author to tell me what happens next! While there were plenty of acceptable stopping points that Gwen Bristow could have used to end her book, I found delicious satisfaction in having plenty more pages to turn; she never lost my interest. Like a child craving another scoop of ice cream, I felt gluttonous as I devoured each chapter. I had to set mini deals with myself \"okay, so I am going to finish this chapter, and then I will vacuum and dust before starting the next.\" Talk about motivation to get the house clean... but I admit, sometimes I cheated and read on. I hadn't finished reading Jubilee Trail when I had to return to work, and was frustrated that after my 12 hour shifts I couldn't manage to keep my eyes open (traitorous body/mind, how dare you need rest!). The last 50 pages of the book taunted me. For once in a while, I actually felt I was reading a REAL NOVEL. I loved reading about the stoic westward travelers. I grew up in California, memory's shadow tickled me with nostalgia- seeing the names of towns and trying to recall events learned in history class. It was not some sloppy love novel with graphic scenes to target my hormones, but was rich with characters who were faulted and yet good, and my heart ached with understanding.I did finish the book late after work one night and am now content! Maybe I will see if the library has the movie (maybe)."}, {"userName": "Laura", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/811853-laura", "userReview": "I LOVE Gwen Bristow's novels! This book I especially loved because it takes place at the time when California became a state; so the history is really interesting. The characters are unpredictable and flawed but very endearing. Bristow has succeeded in writing a masterful tale about perseverance and hard work and love and redemption. Perseverance - Garnet has just completed a grueling trek to California and has this thought at the end of the trail: p 228\"Standing there, she put her head down on the saddle of her gaunt little mare and began to laugh and to cry all at once, and she thought of Columbus when he saw the first green branch floating in the sea. She thought she knew now what heroes were like. They were not calm brave generals on white steeds. They were rude filthy sweating men who kept going till they got where they wanted to go.\"Independent love, p 503:\"I need you. I don't need you for the sake of beef and beans -- I can earn those for myself. . . But I need you.\"\"No you don't. That's why I'm so happy at the thought of having you. Anything you give me will be absolutely free, because you want to give it, not because you want something back. You've got independence of spirit. You won't have to be told a dozen times a day that you're wanted and appreciated.\"Hard Work, p 543:The Spanish conquistadores. They came looking for gold. . .Those Spanish lords were great gentlemen. They would never have humbled their spirits with work. A gentleman who had worked could never hold up his head again. The only right and proper way for them to get gold was to murder the people who had already worked for it and to steal what they had. They rode up here. But they couldn't find the golden cities. They couldn't find anything to steal. So they went home and said this was a worthless country nobody would want. And all the time, everything they believed was true. There was gold enough here to fit their most fantastic dreams. Here it was, more gold than those thieving killers had ever seen in one place in their lives, and they never found it. But the first men who ever in the history of the world went up there to do a plain ordinary job of work, they found it.\""}, {"userName": "Melissa T", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/887190-melissa-t", "userReview": "I dearly loved this book. I loved traveling across the Jubilee Trail (and farther) with these characters, and was so sorry to see the book end! I felt like it was unpredictable, and although I was surprised by the turn of events, I really liked it as I went along. Somehow it seemed more true to life than many \"romances\". I loved the friendship between these two women, despite their entirely different upbringings. I also really enjoyed the writing style--when I read it I could tell is wasn't written recently, but obviously wasn't written at the time it took place. It's definitely one I will read again and give as gifts. I already gifted it to a friend in the last two days! :) A few of thought-provoking quotes: \"A good frontiersman is one who knows about the dangers, and is ready for them, but doesn't worry about them.\"\"If you're as smart as I think you are, You'll carry that gun but you won't lose any sleep over thinking about why you're carrying it.\" \"She thought she knew now what heroes were like. They were not calm brave generals on white steeds. They were rude filthy sweating men who kept going till they got where they wanted to go.\"\"You developed that kind of courage because you had to. It was not a matter of noble ideas. It was a matter of self defense.\"\"How few men there were whose friends could speak of them with such unquestioning certainty. \"And the clincher at the end that made me cry, but won't give anything away with the plot:\"We always hate the school room where we learn hard lessons. But then we love it, because that the school that taught us all we know, and gave us all the strength we have.\""}, {"userName": "Terri", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/143428-terri", "userReview": "Gwen Bristow knows has to write about women. She gets us. Garnet and Florinda aren't anything like each other and yet they are true friends who stand by and help one another through whatever comes. They don't completely understand each other, but they value the differences they see in one another. As life gives them hard times, they both face it with grit and determination. My favorite quote from the book comes from Garnet, \"She had thought freedom meant simply the chance to have her own way, with no need to take the consequences of having had it. Well, she knew better now. Life was not a lot of golden adventures that cost you nothing.\" I read this book once quite awhile ago and liked it, but now I read it with new eyes and I see much more. Life isn't all rainbows and fairies, but it can be very, very good and sometimes it is good because (not just despite) the trials because you become something better than you were before.Bristow is also very good at writing historical fiction that really brings to life the era. It is fascinating to learn about times and places from the past especially when a good story is involved! She was obviously a very well liked and well read author in her time (this book was even made into a movie) and I think the books deserve to still be read."}, {"userName": "LemonLinda", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/1541888-lemonlinda", "userReview": "This book was published in 1950 but it is truly a timeless piece of Western historical fiction. Garnet, a New York socialite meets and marries a western trader/ranchero and travels with him on the Santa Fe Trail to California. It is a tough go, but she meets all challenges head first as she is a true pioneer at heart, always trying to make the best of her circumstances. She meets a showgirl on their stopover in New Orleans and fate intervenes so that they travel the trail together and in the interim become fast friends. Once in California other issues arise and Garnet has to find her own way and navigate her own path protecting her loved ones, making fast and furious, if somewhat unlikely friends and growing into a strong and determined young woman unwilling to settle for less than her highest dreams call for. This is a good story with such likeable characters, but it is also a chronicle of life in California when it was still a part of Mexico and in pre-gold rush days. The history is all intertwined as California is annexed into the US and Los Angeles and San Francisco are rough and ready new settlements with a mix of Californios, Yankees, Mexicans and small remnants of several Native American tribes. Really enjoyed this one."}, {"userName": "Abigail", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/7022064-abigail", "userReview": "My dear friend lent me this book. I have to confess that the first ninety pages felt slow to me, but I am sssooooo happy that I kept reading. The story builds and then slows a little and then out of nowhere it punches you in the face with a plot twist that you never expected. Once I became emotionally invested in the characters - who, in completely different ways are rich, complex, and therefore, endearing - I couldn't stop reading. Even when I really needed to. I can't say just how much I enjoyed how each character's \"tale of woe\" is revealed. And then you love them all even more. I wept, I chuckled, I put the book down in disbelief, excitement, or mortification repeatedly. And to top it all, I came away from this story, truly wishing these characters really existed. ...well, NOT Charles. Horrid, nasty piece of work.And if John Ives could read this, he'd cringe as he read these words: I loved this book and am so grateful to my friend, Sarah for lending it to me. It was quite a ride."}, {"userName": "Zora", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/8291584-zora", "userReview": "I really liked this 1950 novel about a proper New York girl longing for adventure mid-19th Century, getting married, and taking a trek with her new husband along a wagon trail to the nation of California--which wasn't even on the globes out east yet--where further adventures await her. In style, it's of its era, and I mean that as a complement. (Would that the average popular novel today were written this well, or as well as Mary Stewart's Gothics. But the \"middlebrow\" novel disappeared in about 1980, and I certainly miss it.) In the depiction of female characters, it's years ahead of its time. (It's mostly shelved a romance here, but it's really a story of a female friendship more than a romance.) Some lovely descriptions and surprising human insights. Had females chosen the canon, no doubt some of the mid-century novelists would have been booted off the list to be replaced by this book and Edna Ferber books."}, {"userName": "Readitnweep", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/3576329-readitnweep", "userReview": "This is not the edition I read - I have an old copy from the 1950s.I didn't enjoy this book as much as I had Bristow's Celia Garth, which I could not put down, but I did enjoy it.This historical story set in the 1840s is well paced and packed with events and characters - with some historical figures. It is not graphic in text, though, so don't look for a lot of historical accuracy, in terms of the graphic nature of living in the west at the time, but it does include wonderful description and some historical details.The plot is fairly predictable, though there were a couple avenues I expected the author to take, regarding Garnet's relationship with other characters that she did not take - much to my pleasant surprise. It is important to keep in mind this is a romance - and a well written one. I'd recommend this book as an enjoyable read, but I'd recommend Celia Garth first."}, {"userName": "Kristin", "userReviewDate": "Nov 01, 2009", "userURL": "http://www.goodreads.com/user/show/2897303-kristin", "userReview": "This is a great historical fiction novel. While I have read better, this book accomplishes everything the author sets out to do. It's really a coming-of-age story, as Garnet slowly realizes that her husband is not perfect, that even \"soiled doves\" can be good people, and that her true soul mate just might be a man who doesn't believe in love.While I really enjoyed this book, it definitely has its weaknesses. Bristow wrote Jubilee Trail in the 50s, and at times it seems a bit dated in terms of phrasing and childish plot.Overall, this is the quintessential westward expansion novel, and I enjoyed reading it very much. I wish there had been a bit more resolution at the end, especially for some of the beloved secondary characters. On a side note, I've been wanting to see the film adaptation, but every time it comes on TCM, I seem to miss it!"}, {"userName": "Adrianna", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/865009-adrianna", "userReview": "I LOVED this book. It was extremely detailed, which made for long reading, but I don't think I would have wanted it pared down at all. The lengthy telling provided fascinating insights to pioneer life on the Jubilee Trail and emotionally connected the reader to the characters in a very vivid way. I felt all of Garnet's emotions as my own- my heart ached with her, I felt disappointment, grief, fear, her wonder at the beauteous landscapes, her yearning, and her jubilation and thrill.The unlikely friendship that forms between Garnet and Florinda is beautiful in its unconditional acceptance and devotion. And the support group that Garnet musters in the remote wilds of the American continent is heartwarming.This is often an emotionally-wrenching novel, but extremely satisfying in its own beautiful and inspiring way."}, {"userName": "Peggy ", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/2796355-peggy", "userReview": "This was first published in 1950. When I was about 12 or 13 in the early 60's I read Mom's hardback. I was thrilled to get this for Kindle on sale a while back but did not like the modernized cover so even though I read it on Kindle I used the hardback edition cover from 1950 as the one I read. Much more realistic!This was one of my favorite books as a young teen and I enjoyed it just as much this time around. Gwen Bristow wrote what would be considered today as clean historical fiction with most of the romance behind doors. But she really did her research and wrote very memorable characters. The only reason that I didn't give it 5 stars is because of her portrayal of Native Americans."}], "description": "The history of California in the mid-19th century comes alive in this captivating historical novel. Garnet Cameron, a fashionable young lady of New York, is leading a neat, proper life, full of elegant parties and polite young men, yet the prospect of actually marrying any of them appalls her. Yearning for adventure, she instead marries Oliver Hale, a wild trader who is about to cross the mountains and deserts to an unheard-of land called California. During Garnet and Oliver's honeymoon in New Orleans, she meets a dance-hall performer on the lam who calls herself Florinda Grove and is also traveling to California. Along the Jubilee Trail, Garnet and Florinda meet kinds of men never known to them before, and together they make their painstaking way over the harsh trail to Los Angeles, learning how to live without compromise and discover both true friendship and true love.", "title": "Jubilee Trail", "url": "https://www.goodreads.com/book/show/74725.Jubilee_Trail", "average": 4.1, "cover": "https://images.gr-assets.com/books/1388256044l/74725.jpg", "reviews": 340, "authors": [{"url": "https://www.goodreads.com/author/show/42378.Gwen_Bristow", "name": "Gwen Bristow"}, {"url": "https://www.goodreads.com/author/show/74078.Sandra_Dallas", "name": "Sandra Dallas"}, {"url": "https://www.goodreads.com/author/show/29184.Nancy_E_Turner", "name": "Nancy E. Turner"}], "type": ["Historical", "Fiction", "Historical", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/74725.Jubilee_Trail", "http://www.goodreads.com/book/show/1788928.Jubilee_Trail", "http://www.goodreads.com/book/show/321459.Celia_Garth", "http://www.goodreads.com/book/show/40363153-calico-palace", "http://www.goodreads.com/book/show/732275.Deep_Summer", "http://www.goodreads.com/book/show/1643617.The_Handsome_Road", "http://www.goodreads.com/book/show/25523095-plantation-trilogy", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}