{"ratings": 0, "userreviews": [], "description": "Mitch Burk wants to change his future before it’s too late.  Beth Justin wants to hold on to her past before it slips away.  Mitch Burk wants to disappear. Known as Simon Grey—Hollywood heartthrob—Mitch decides to walk away from the celebrity lifestyle that is slowly killing him. Needing some peace and quiet and a place where he can regroup, Mitch hitches an Airstream trailer to an old Suburban and just drives. Unfortunately, he ends up in the middle of Kansas with a busted windshield, a rebellious teenager, and on the wrong side of Beth Justin—the owner of the Diamond-J ranch. Knowing he’s an unwanted guest, Mitch plans to move on as soon as his truck is repaired. However, the longer he stays on the Diamond-J, the more he comes to appreciate the high plains of Kansas and the quiet faith of a certain blue-eyed ranch owner. Beth Justin has not had an easy life. A teen pregnancy, a broken heart, and the death of her parents has left Beth with a fragile faith, a defiant son, and the Diamond-J ranch. When Mitch Burk shows up unexpectedly, Beth had no idea who he is—only that he’s a nuisance and a real pain in her side. Begrudgingly, she allows him to stay on the Diamond-J while his truck is repaired. Beth soon comes to appreciate Mitch’s help not only around the ranch, but with her son as he navigates the trappings of adolescence. When Beth’s appreciation for Mitch turns in to attraction, she hides her feelings, convinced he’ll only end up breaking her heart.", "title": "Just an Act: A Novel", "url": "http://www.goodreads.com/book/show/34114444-just-an-act", "average": 0.0, "cover": "https://images.gr-assets.com/books/1486227399l/34114444.jpg", "reviews": 0, "authors": [{"url": "https://www.goodreads.com/author/show/166949.Tamara_Tilley", "name": "Tamara Tilley"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/34114444-just-an-act", "http://www.goodreads.com/book/show/2310871.Abandoned_Identity", "http://www.goodreads.com/book/show/287990.Full_Disclosure", "http://www.goodreads.com/book/show/4916563-criminal-obsession", "http://www.goodreads.com/book/show/23956051-badge-of-respect", "http://www.goodreads.com/book/show/29764212-one-saturday"]}