{"ratings": 135330, "userreviews": [{"userName": "Eddie Watkins", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/1131783-eddie-watkins", "userReview": "I never thought much about Patti Smith. The images I saw of her never attracted me, and what I knew of her Rimbaud fixation turned me off. I always had a problem with the Beat and Punk appropriation of Rimbaud as more a figure of rebellion than a sophisticated poet. For me poetry is a phenomenon of the page, not an outfit you wear down the street. I also never got into Punk Rock. Going to college in the fall of 1983 I had probably only heard of The Sex Pistols, though I had never listened to them. Then when I got to college I was immersed in it, without my choosing to be. I loved some of it but just never pursued it as an interest or as a lifestyle, it was just the soundtrack to my experiences. At the time I was more into focused listening of Prince (and King Crimson and The Talking Heads) than Black Flag and The Dead Kennedys. And somehow, even during college, I managed to never listen to Horses... until a couple years ago. But what a great album! and I would say about it what I would say about other Punk I've gotten into since - such as Television and The Minutemen - that it is nothing other than simply great Rock & Roll. So I grew curious about Patti Smith and then this book came out and I snatched it up. It's a sweet and gritty account of her growing into maturity and how it coincided with her relationship with Robert Mapplethorpe. There's a wise naturalness in how she grew into the woman we now know. There was ambition, but only on her own terms, and there was no striving to be part of a scene outside of herself (& Robert), though she ended up in one fascinating scene after another as the grimy and vibrant New York art/bohemian landscape tumultuously morphed into the previously unknown seemingly by the hour in the late 1960's and early 1970's. She portrays these scenes as the outsider she always felt she was, yet they're portrayed head-on, not through a scrim of self-consciousness or psychic distance: she was in the thick of it, even acting as a nurturing figure to many, yet she was also strangely apart from it. Throughout there's a focus on her intimate relationships and how their effects radiated out into the situations she was involved in, which gives the feeling of a real groundedness regardless of how crazy things were. But whoever she was with - Jim Carroll, Sam Shepard, a guy from Blue Oyster Cult - Mapplethorpe sill permeated her consciousness. In many ways they were alike, but in even more important ways they were very different, and part of the fascination of this book is pondering the duality they set up - Robert alienated from his family and erasing his past to find the future while Patti was always firmly bedded in her past and in her family, Robert's wild drug use and Patti's basically straight life, Patti's Victorian sloppiness and Robert's decadent minimalism, and of course the sexual complications. This book is not only entertaining but lovely and wise too."}, {"userName": "B0nnie", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7355135-b0nnie", "userReview": "♪Stayin’ up for days in the Chelsea Hotel...♫\n\nJust Kids makes me feel so damn left out. If only I had been able to show up at the Chelsea in the early 1970s. I coulda been a contender, I could have lived for art. Oh yes, I would have been very naïve just like Patti had been at first. I totally get that. I don’t think I could have been as brave tho'. Art is a harsh mistress. Suddenly [Robert] looked up and said, “Patti, did art get us?”I looked away, not really wanting to think about it. “I don’t know, Robert. I don’t know.”Perhaps it did, but no one could regret that. Only a fool would regret being had by art; or a saint. Robert beckoned me to help him stand, and he faltered. “Patti,” he said, “I’m dying. It’s so painful.”He looked at me, his look of love and reproach. My love for him could not save him. His love for life could not save him.What I loved about this memoir is how it communicates (in a rough, rambley sort of way) what it was like to be there. In that milieu. It almost seems irrelevant that they all became famous."}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "Looking For You (I Was)I can see why some reviews detect white-washing or sugar-coating in \"Just Kids\", but I wanted desperately to believe the story Patti Smith was telling about her relationship with Robert Mapplethorpe.Glitter in Their EyesPatti admits to her naivete, but I don't think she was trying to hide stuff from her kids or anything.Nor do I think she closed off her emotions about her past.Ultimately, the book is a love story, only the love extended over a long period, and sometimes it was requited, sometimes not.Just KiddingLots of things got in the way, sexuality for starters, drugs for main course, other partners for dessert.But the book is about a love that they shared, and a youth that they both retained the whole of their lives, no matter what happened on the inside or the outside and no matter how poor or successful they were.The name of the book asserts her belief that all that time they really were \"just kids\", those two kids that the tourists photographed soon after they first met.About Another BoyAlthough Patti reveals a lot about Robert, I think ultimately the book is her final expression of love for him.I think it's important that she express her sugary side anyway, rather than \"hide your love away\".The book might be relatively sugar-coated for our image of Patti Smith, but her sugar isn't as sickly sweet as most sleb love stories. Memento Mori (Postscript)One of the reasons I empathise with this book so much is my passion for Robert Mapplethorpe's photography (not to mention Patti's music, lyrics and poetry).In March - April, 1986, I was on the Board of the Institute of Modern Art in Brisbane, at the time we helped to bring an exhibition of Robert's photos to Australia.It was a time of great political and moral conservatism in Queensland.The Board included artists and academics who feared the loss of their jobs, if they were involved in the exhibition of photography that might later be found to be obscene under our criminal laws.Many Board Meetings in the lead up to the exhibition debated whether we should not proceed with the exhibition or remove particular images (including \"Man in Polyester Suit\").I made some tentative preparations to deal with a potential criminal action against the Board Members, including getting expert evidence on Robert's artistic status.In the end, we decided to proceed with the exhibition in an uncensored form. All images were displayed in the form submitted by the artist and the curator.The exhibition was highly popular and no complaints were made to the Police.No criminal prosecution occurred.The important lesson is that we could have self-censored and lost our own freedom.Instead, we asserted and preserved our freedom in the face of fear.For me, Robert and Patti represent, not just the existence of freedom in the abstract, but the assertion of freedom in reality.They more than earned the right to their love.\"Your ancestors salute you.\""}, {"userName": "Nicholas", "userReviewDate": "Dec 21, 2010", "userURL": "http://www.goodreads.com/user/show/646385-nicholas", "userReview": "There are some moments of real poignancy here and some very deft turns of phrase, but I was also just bored stiff for most of it. Clearly Smith has led a really interesting life, but she's just not a great writer. The great bulk of the book was a long series of \"Then this happened. Then that happened. Then Robert did this. Then I did that.\" And while there is a lot of reflection about art, there is very little on the subject of her relationship with Mapplethorpe, supposedly the purpose of writing the book. How and why did she stick with him -- as a lover -- through his gay hustling? What did she feel about this? She is by turns squeamish about his homosexuality and also fully accepting of everything he does. There's nothing inherently wrong with either reaction but I'd like to hear a little more about them. Bottom line: had this not been Patti Smith writing about Robert Mapplethorpe, and had I not been in a book group where we were discussing the book, I wouldn't have kept reading past the 50th page."}, {"userName": "karen", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "fulfilling book riot's 2018 read harder challenge task #12: a celebrity memoirextry points given to me, by me, for choosing a book that i have owned for more than a year. super-extry points for selfishly using the opportunity to interview nancy pearl for my own personal readers' advisory needs, to suggest a celebrity memoir that wasn't gonna waste my time. thanks, nancy pearl!review to come!review is now!my tepid reaction to this book is in no way the fault of nancy pearl, who gave me exactly what i’d asked for:any type of celebrity; any gender, age, race, or currency, and my only criteria is that it be more substance than flash, and that it not follow the narrative-arc-cliché of “early success ruined by overindulgence in perks of success leading to downfall, followed by peace and self-reflective wisdom.” Good stories, decent writing, humor a plus.i just didn’t respond to it the way i’d expected/hoped. on the one hand, patti smith writes a highly detailed account of what it was like to be young and poor and artistically ambitious in the creative powderkeg of new york city in the late 60’s-70’s.on the other hand, patti smith writes a highly detailed account of what it was like to be young and poor and artistically ambitious in the creative powderkeg of new york city in the late 60’s-70’s.the details killed it for me. there’s so much here that feels like an itinerary - what they wore and where they walked and all the trinkets they collected, photographed, then lost along the way, and it’s a focus on props at the expense of any emotional appeal - what should be an intensely moving elegy for youth, for new york, for power-twin/bestie/lover mapplethorpe, is instead frustratingly detached and the reader is kept at arm’s length with details about ribbons, huaraches, hats, haircuts, portfolios, and grilled cheeses. it is, as nadine astutely points out, both listy and emotionally distant.smith mentions more than once her “flexible imagination,” so the improbable “i remember every moment of every day, many of which had tremendous import/foreshadowing/symbolism” slant is somewhat mitigated by poetic license, but it’s equally true that pattiandrobert’s days had a disproportionately high level of import, just from the circles they were lucky enough to break into across the entire spectrum of the arts - music, literature, theater, painting, photography, every one of them bristling with mentors generous with their time, advice, introductions to still more luminaries, raw materials for their artistic pursuits, and other gifts that pile up into those listy details; a sweater from jackie curtis, a tattoo from vali, a guitar from sam shepard, Crosses of braided hair, tarnished charms, and haiku valentines made with bits of ribbon and leather and on and on &etc.and the things that most interested me were often floated without introduction or context; surfacing and withdrawing - her buying and selling of used books, her reviewing records - just mentioned as “things i did” without any of the details so very cluttered elsewhere. one does not just casually mention finding a twenty-six volume set of the complete henry james in perfect condition and reselling it in a mere two sentences.and how does she get to go to paris three times when she can’t even afford to eat some days, and she and robert are splitting sandwiches? true, her parisian hotels were rundown and lice-ridden, but given the choice between lice and finery, i’m pretty sure patti would have chosen to slum it after a quick WWRD* consultation in order to achieve maximum artistic authenticity through squalor. but yeah, the details around that bit of financial magic is something i would love to know. for a friend.it’s an okay read - it wasn’t a drag or anything, but i never felt like i was being encouraged to enter into the story, and at a distance, you don't feel the fire. it’s a couple of sweetly pretentious kids dreaming about art and being so, so earnest and self-conscious about looking the part, surrounded by the trappings of capital-a art. but it has its moments:One evening in late November Robert came home a bit shaken. There were some etchings for sale at Brentano’s. Among them was a print pulled from an original plate from America: A Prophecy, watermarked with Blake’s monogram. He had taken it from its portfolio, sliding it down his pants leg. Robert was not one to steal; he hadn’t the nervous system for theft. He did it on impulse because of our mutual love of Blake. But toward the end of the day he lost courage. He imagined they were on to him and ducked into the bathroom, slid it out of his trousers, shredded it, and flushed it down the toilet.I noticed his hands were shaking as he told me. It had been raining and droplets trickled down from his thick curls. He had on a white shirt, damp and sodden against his skin. Like Jean Genet, Robert was a terrible thief. Genet was caught and imprisoned for stealing rare volumes of Proust and rolls of silk from a shirt maker. Aesthetic thieves. I imagined his sense of horror and triumph as bits of Blake swirled into the sewers of New York City.We looked down at our hands, each holding on to the other. We took a deep breath, accepting our complicity, not in theft, but in the destruction of a work of art.“At least they’ll never get it,” he said.“Who are they?” I asked.“Anyone who isn’t us,” he answered.there's a great deal of struggle, but there's just as much coincidence, timing, and right place right time at play. here's some understatement: for ya:I had no concept of what life at the Chelsea Hotel would be like when we checked in, but I soon realized it was a tremendous stroke of luck to wind up there.i'll say.i do like her description of the “shabby elegance” of the chelsea; everyone who has ever even walked by the place has written about it, but hers is memorable: The Chelsea was like a doll’s house in the Twilight Zone, with a hundred rooms, each a small universe. I wandered the halls seeking its spirits, dead or alive. My adventures were mildly mischievous, tapping open a door slightly ajar and getting a glimpse of Virgil Thomson’s grand piano, or loitering before the nameplate of Arthur C. Clarke, hoping he might suddenly emerge. Occasionally I would bump into Gert Schiff, the German scholar, armed with volumes on Picasso, or Viva in Eau Sauvage. Everyone had something to offer and nobody appeared to have much money. Even the successful seemed to have just enough to live like extravagant bums.three stars - fine but not the riveting tearjerking rock and roll experience everyone built it up to be. and even though no one asked me, i hate deckle edges on paperbacks. *what would rimbaud do?"}, {"userName": "William1", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "I admire this woman. She writes a deft, deeply felt prose. She has a peerless memory. She remembers gestures, apparel worn thirty years ago, favorite objects, facial expressions, stretches of dialog. She can reanimate for us moments of deep emotional complexity. This was clearly a labor of love. The character study of Robert Mapplethorpe is disturbing, shattering. We watch Smith living with him as a veil is lifted from her awareness, as her empathy broadens and she carries the reader along with her. This is memoir as maelstrom, cataclysmic in its effect. There's more than sufficient foreshadowing. We know that Robert will die. Yet one still finds oneself grabbing futilely for the gunwales, whirling ever faster, ever downward and inward.The book reminds me of Jean Stein and George Plimpton's Edie: American Girl in it's New York setting. But Stein and Plimpton's book consists of transcripts of recorded conversations worked up into semi-confessional monologues. It's compelling, but it doesn't touch the nimble pairing of image and incident we find in Just Kids, nor does it have the latter's exquisite verbal compression. Like Edie, this book details an era of New York's art and cultural scene, but with a vividness I've never come across before. This intensity radiates from The Hotel Chelsea where Mapplethorpe and Smith occupied a room. The middle third of the book gets a little lost in name dropping. I suppose that's inevitable. There's less insight into Mapplethorpe, whom the author is growing away from. The sixties greats parade by: Jimi Hendrix, Janis Joplin, Jim Morrison, et al. Then the artists and then the poets and so on. The narrative dissipates under this welter of names. Smith dates poet and rocker, Jim Carroll (\"People Who Died\"). She dates playwright Sam Shepherd (True West, etc.) One begins to lose track. Who's Matthew with the 45s again? We watch Smith's astonishing evolution from visual artist to poet to rock and roller. If someone were to write this story as fiction, it would probably be criticized as unrealistic.The theme, one of them, is the artist being true to his or herself and doing the work. Fascinating is the level at which which both Mapplethorpe and Smith learn their art. They are huge talents but they have entered a talented artistic circle that beggars description. When Shepherd has to leave Smith to return to his wife, they pen a valedictory play which is later staged at the American Place Theater in midtown. Mapplethorpe falls in love with photography when curator John McKendry brings him into the Met vaults and shows him rarely exhibited works by Stieglitz, Strand and Eakins. Until then he was hesitant to do his own photography, though Smith had repeatedly encouraged him to; he worked in photo collages with images from male magazines. Smith in her turn is cajoled into poetry by Gregory Corso and into song writing by Bobby Neuwirth. Who can claim such mentors and so many of them? Most artists' develop in far less encouraging settings. Smith and Mapplethorpe have been incredibly blessed. Toward the end the author reaches for a kind of ecstatic prose flight that seldom works. Fortunately the attempts at woolgathering are few. We are soon returned to earth by way of Mapplethorpe's suffering. I was especially pleased to learn that in his last 15 years or so, he had found a partner, Sam Wagstaff, who supported him in all he did. Wagstaff was both patron and lover, and rich as Croesus. Mapplethorpe no longer had to hustle sex on 42nd Street to make the rent. Wagstaff bought him a studio on Bond Street, walking distance from his own flat. Smith herself no longer needed to work at Scribners bookstore either. She recorded Horses which made her an international star. So when the end comes at least it is unmarked by the poverty and obscurity of Smith and Mapplethorpe's earlier years. Smith, living in Detroit by then with her husband, Fred Sonic Smith, drives to New York to see both men—Sam is sick, too—during their final illnesses. Her last encounter with Robert, before he's wheeled off, was for this reader Sophoclean in its tragic impact. The love these two shared, the exquisite trust! Suddenly, it's gone. A void prevails.By no means perfect, this is still an astonishing, emotionally affecting book. As with all great writing, its effect is greater than the sum of its parts. Please read it."}, {"userName": "Cheri", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "4.5 Stars”It was the summer Coltrane died. The summer of “Crystal Ship.” Flower children raised their empty arms and China exploded the H-bomb. Jimi Hendrix set his guitar in flames in Monterey. AM radio played “Ode to Billie Joe.” There were riots in Newark, Milwaukee, and Detroit. It was the summer of Elvira Madigan, the summer of love. And in this shifting, inhospitable atmosphere, a chance encounter change the course of my life.”It was that summer when Patti Smith met Robert Mapplethorpe. Just Kids is a love story of these two young people who, against all odds, meet, fall in love, and cling to that love long after they’ve chosen other partners, other ways of life, and love. It’s a love story of the city where they fell in love, and perhaps even a bit of a love story to the art and poetry and music that was created in the course of their love story. They combined their meager possessions, but money was problematic, they barely made enough money for food – and frequently went without. Extras were out of reach. Books they had already owned were their prized possessions, as was their music limited to those albums they’d brought into this relationship. And still, they were able to enjoy some concerts just by virtue of being in the right place at the right time, or knowing the right person. ”Yet you could feel a vibration in the air, a sense of hastening. It had started with the moon, inaccessible poem that it was. Now men had walked upon it, rubber treads on a pearl of the gods.”There are a very few years that they were not in touch, Smith’s focused on her music career, her marriage to Fred “Sonic” Smith, and Mapplethorpe focused on his art, his partner. Time passes, children come along, and when Smith is expecting a second child, they re-establish communication. ”We were as Hansel and Gretel and we ventured out into the black forest of the world. There were temptations and witches and demons we never dreamed of and there was splendor we only partially imagined. No one could speak for these two young people nor tell with any truth of their days and nights together. Only Robert and I could tell it. Our story, as he called it. And having gone, he left the task for me to tell it to you.”I knew very little about Patti Smith, I knew who she was, is, and that I’ve heard some of her songs, knew she was a musician… beyond that, nothing. So, when this book first came out, and my brother sent me a signed copy of this, along with a few other books, and I vaguely recall seeing it and wondering why he sent it to me. And then, years later, also sent me a signed copy of M Train. I was beginning to feel a little guilty.I loved this. There’s a bit of that raw energy and the grittiness of living in their early days together, the descriptions of the city, especially at night. The Romeo and Julietness of it all. Beautiful prose. Their story reminded me of one of my favourite poems, Edna St. Vincent Millay’s ”Sonnet XXX – Love Is Not All””Love is not all: it is not meat nor drinkNor slumber nor a roof against the rain; Nor yet a floating spar to men that sink And rise and sink and rise and sink again; Love can not fill the thickened lung with breath, Nor clean the blood, nor set the fractured bone; Yet many a man is making friends with death Even as I speak, for lack of love alone. It well may be that in a difficult hour, Pinned down by pain and moaning for release, Or nagged by want past resolution’s power, I might be driven to sell your love for peace, Or trade the memory of this night for food. It well may be. I do not think I would.”"}, {"userName": "Patrick Brown", "userReviewDate": "Dec 21, 2010", "userURL": "http://www.goodreads.com/user/show/175283-patrick-brown", "userReview": "This book is remarkably easy to parody. Here, I'll try:\"I was crossing Tompkins Square Park when I ran into a young man wearing a gabardine vest. He smiled at me and called me \"Sister.\" It was a young George Carlin. Robert hated him because he frequently had flakes of rye bread in his beard, but I loved how he could make me laugh with his impressions of Mick Jagger. On this morning, though, we wept together at the news that Paul McCartney would have to sell his house in Cannes. It was a sort of paradise for us, even though we'd never been. George gave me a feather to put in my hair, and I took it home and pressed it between two pieces of crepe de chine, where it left a ghostly impression. Robert insisted on using it in a construction, and finally I relented, though I knew I'd never get it back. It was a sacrifice to art, the sort of thing Rimbaud would've done.\"I think this parodic potential arises from the book's total and complete lack of irony. This is the most earnest, sincere book I've read in a long time, and that's what makes it so heartbreaking. Smith begins the book with an abundance of naivete, and in many ways, she never loses the idealism with which she begins her career. Written in a lyrical, elegiac tone, this is, at its heart, a book about the bond two artists develop. There's a remarkable amount of honest in the pages, and Smith's and Mapplethorpe's friendship is unique. They were lovers, collaborators, confidants, rivals...Their lives were the stuff of legend, and this book is a valiant effort to put that legend on the page.If you've ever held the romantic \"starving artist\" cliche in esteem, this is the book for you. Smith spends paragraphs talking about how hungry she was when she first moved to New York, and she isn't using the word as a euphemism for ambition -- she really needed to eat. Upon her return from a season in Paris, Mapplethorpe greets her in a feverish state, suffering from abscessed wisdom teeth and gonorrhea. And yet! They lived the lives of artists, staying up into the wee hours creating, writing, singing. They knew everyone. Harry Smith, Allen Ginsburg, Sam Shepard, Jim Carroll, Todd Rundgren, Jimi Hendrix, Janis Joplin -- they all passed through Smith's life, and they all make memorable appearances in the book. It's a name-dropper's paradise, and yet, I didn't come away from the book feeling as though Smith was boasting or exaggerating her own life. I'm sure she's omitted some unfortunate moments on her rise to the top, but she seems honest about her own shortcomings (She freely admits that she acted like a jerk after her first big poetry reading, for instance). I knew nothing of Robert Mapplethorpe beyond his work and the controversy it had caused in the late 80s (I was too young to understand much of what he was trying to say, though I could understand the controversy just fine). The portrait Smith paints of Mapplethorpe is one of a passionate, wildly creative artist, and also of a man driven by his ambition to become famous. Her friendship with him was clearly the defining moment of her life, and reading about it was a pleasure. I often felt lost in this book, and I suspect that that's the only way to read it -- to just plow through it. I don't think I share all of Smith's ideas about art, but I respect her passion and her talent as a writer. Her prose is clear and direct and eminently readable. And maybe best of all, wherever I took this book, people would comment on it. \"I just finished it. It's heartbreaking.\" Or \"I wish I had her passion.\" I love when I read a book that inspires that kind of connection between people. It makes me feel, even if only for a moment, that I live in the kind of world that Patti Smith lives in."}, {"userName": "Will Byrnes", "userReviewDate": "Nov 25, 2010", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Hi Ho, the artistic life. I had very divergent feelings about Just Kids, Patti Smith's National-Book-Award-winning memoir about her friendship with Robert Mapplethorpe. There were times that I felt moved by the beauty of her writing, and others in which I found her to be nothing more than another spoiled, entitled kid who got where she got to, talented or not, because of connections. It is not that Smith arrived in NYC with a list of names and numbers. But she did have the good fortune to encounter a knight in shining armor who had a prodigous artistic drive and the good looks to attract a series of male gateways to the New York arts scene. There is no doubt about the deep connection Smith formed with Robert Mapplethorpe, famed photographer to-be. They were not only lovers, but bffs. And that continued long after they stopped sharing a bed. Smith takes us on a journey through the gritty and some not-so-gritty portions of the New York arts scene, offering glimpses of the many, many people she and Mapplethorpe met. It is a veritable who's who, including bits and pieces on Jimi Hendrix, Janis Joplin, Sam Shepherd, Andy Warhol, Wiliam Burroughs, and a cast of hundreds. I never got the impression that Smith was name-dropping. She was as amazed as any aspiring artist might be at finding herself among so many notables. One downside to this is that so many shining lights speed by like houses at night as seen from a train. I would have liked it had she gone into a little (or a lot) more detail on more of these luminaries. She certainly does reinforce the image of the Chelsea Hotel as a cauldron of creativity in its day. The story of her arrival in New York, meeting Mapplethorpe and struggling to get by is worth the price of admission, a real look at what it means to be a starving artist. And that is not just a glib turn-of-phrase, as Patti, at times, made use of the five-finger discount in order to eat. It is also fun to read about how she and Robert trolled discount stores for materials they would use to make jewelry or incorporate into other artistic projects. Despite the minimal physical mileage traversed here, Just Kids is a bit of a road story. Instead of crossing continents, she and Mapplethorpe cross from obscurity to fame, from outsiders to insiders, from fellow travellers (in a very non-political sense) to lovers to soulmatesI was surprised at a few things. Ok, look at almost any photo of Patti Smith and tell me with a straight face that she doesn't make you think of the Calvin Klein ideal of physical appearance. Yet, when she appeared in a play as a person with drug issues she was completely uncomfortable pretending to shoot up. Even her director was shocked at her lack of hard drug experience. A little weed here and there does not give one that lovely Ginger Baker look. A diet sprinkled with stolen food contributed for sure, but nature sculpted that body, not dark substances. I was also surprised--having come to the book with no familiarity with Smith beyond her recording of “Because the Night”--about the diversity of her artistry, running from drawing to poetry, to playwrighting, to acting, and so on. I have read better memoirs, and I do not think this should have won the National Book Award. But there is no missing the real feeling she communicates, the love she and Mapplethorpe had for each other. Her writing is good, sometimes better than good, and you will not be disappointed. But for many, the lifestyles presented here might be discomfiting, the willingness to engage in hustling, thievery, and very open relationships make the artistic world Smith and Mapplethorpe inhabited a decidedly acquired taste."}, {"userName": "PorshaJo", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "I loved this book. I did not want it to end. To be honest, I did not know much about Patti Smith other than her music. When the book initially came out, I heard so many wonderful things about it. I thought I should give it a shot. But frankly, I was a bit tired of the 'musician' bio books as some were just so dreadful. I was so wrong to think that and hold off on this book.I decided to go with the audio. I was immediately enthralled with it. The audio is narrated by Smith and she does an incredible job. Who else to 'read' the story of her life other than the one wrote it and lived it.Just Kids tells the story of Patti growing up and following her desires to go to NYC and grow and become an artist. She tells of the wonderful life-long friendship that she had with the photographer, Robert Mapplethorpe. I had no idea how talented Patti Smith is - she's a poet, artist, writer, musician, singer, actress. She has been in photos, acted in plays, wrote lots of songs, wrote books on poetry and non-fiction. She came into contact with so many different types of artists that helped her grow - various notable musicians, poets, artists. There were a lot of famous people mentioned but these are the people that were in NYC during this time when it was on the cusp of art and artists coming alive. She talks of her time spent in the Chelsea Hotel in NYC which, at the time, was a haven for artistic folks. But out of all those mentioned, it was Mapplethorpe who pushed her and helped her find her artistic abilities and find out who she was/is. It's amazing that these two found one another and pushed each other. It's a beautiful story.I saw Patti Smith speak recently and she said that Mapplethorpe, before he died, asked her to tell their story. Just Kids is that story and a story that took her 20 years to write. I know why this book won the National Book Award and why it's #4 on the 100 best music books of all time. It reads like poetry. Link to this list of 100 best music books: http://www.billboard.com/articles/new...I'm so glad I read this. A true highlight for me, my favorite of 2016, and one I plan to read again."}, {"userName": "Elizabeth Fleming", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/4194300-elizabeth-fleming", "userReview": "I found this book incredibly boring. It started off ok, but after a bit her writing style began to get on my nerves (examples: using the word \"for\" instead of \"because,\" as in \"I went to the diner, for I was hungry\" and \"I hadn't any money\" instead of \"I didn't have any money\" and \"I lay upon the mattress\" instead of the simpler, just fine, \"I lay on,\" ugh. Pretentious). Then she goes on and on and ON about Rimbaud. Enough about Rimbaud already. Seriously. I'm not kidding. And Baudelaire. Shut up. Yawn. Her sentences were choppy and repetitive--I could basically sum it up as: \"I met a boy named Robert. We loved each other. We hadn't any money. One day I bought a raincoat from a thrift store. I went to France and visited Rimbaud's grave and wore my raincoat for it was raining. Robert was a genius and we lay upon a mattress. One time I met Jimi Hendrix. Then he died. Then I wore my raincoat out in New York and I bumped into Ginsberg. He bought me a sandwich for I was hungry and hadn't any money. The end.\""}, {"userName": "Janet", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/1421407-janet", "userReview": "This book will be added to \"The Art Spirit\" as an essential volume on my writer's \"behind the desk\" bookshelf, the story of two baby artists and how they grew. There's an oddly innocent tone to this all--for instance, the sexual relationship between the two of them is never really discussed, only accepted--when Patti gets the clap, we understand it's from him, but this is not a kiss and tell memoir. It's an opportunity to walk a mile in Patti Smith's head, in a less coded and more factual way than in her music or poetry, but no less poetic for having been a lived life.  Patti Smith has always been my idea of an artist--that an artist is different from an intellectual. The artist's way of being in the world is not about mincing and dicing experience, but about allowing oneself to resonate with events, to be played by the texture of life, and seeing what one is naturally drawn to, and how that stimulates an artistic reaction. Her way and his way. I like the unselfconsciousness of this writing--in an odd way, unself-examining, a paradox in a memoir. I have read the Patricia Morrisroe bio of Mapplethorpe--admittedly for the Patti Smith/Mapplethorpe material--and it's a revelation to read Patti's take on that time versus the reportage of people who had known them at the time. I love the layering of experience that way, as anyone who's read my work will know--the difference between the lived life and the way it looks from the outside. If it were someone else, I would even question the simplicity of the tale-tellling, the innocence portrayed, say, if it were Dylan or other more manipulative figures--but having listened to Patti Smith for 25 years, I believe this awkward innocent visionary quality. This is what we need, what I need, in our pathetic, overfacebooked, overstudied 2010s. More living, more art, more innocence, more faith, more poetry, more friendship, more acceptance.***********************************"}, {"userName": "Maxwell", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "I'm not sure how to do this book proper justice in a review. Just Kids is a book that enthralled me, surprised me, and ultimately, a book that I have fallen in love with. Not only is it one of the best books I've read this year, it is one of the best books I have ever read.Knowing very little about Patti Smith or Robert Mapplethorpe going into reading this, I figured I would enjoy it but not quite appreciate it as much as someone who is a big fan of either. And while that might be true, I still came out of this book with the utmost appreciation for both and for those people living, breathing, and being artists today. Because, this book is about art.It's about art that you love so much that you make sacrifices like sleeping on doorsteps or eating anchovy sandwiches. It's about art that consumes you, that frustrates you, that makes you feel alive.Patti Smith is an artist through and through. And I am completely inspired by her story and her companionship with Robert. Hearing about their lives in 1960's and 70's New York City was incredible, meeting the likes of Jimi Hendrix, Janice Joplin, William Burroughs, and so many more incredibly talented artists, poets, musicians, writers, etc. For a short time I was transported into the mind of an artist, into the time of her creative birth, and came out of it with an experience that I won't soon forget. I am sure that I will read this book again in the future and each time take away something more. 5/5 stars"}, {"userName": "Warwick", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "its dark no im wrong its dawn i have my shades on—‘Sleepless 66’Patti Smith writes to us out of the great and endless narcotic American night in a language inherited from the Beats and refined across a lifetime of lines scribbled on journals and diner napkins and hotel matchbooks, carving out her version of the truth. Despite all her awed talk of Mallarmé and Baudelaire, she is much more in sync with her compatriots like Paul Bowles and Hunter S. Thompson, and when she walks through a New York crowd she sees, like Pynchon or a grungy Walt Whitman, ‘Boys on shore leave, prostitutes, runaways, abused tourists, and assorted victims of alien abduction’.Her writing is deadpan and matter-of-fact; reading this book is like talking to some hoarse, hungover stranger in the kitchen after an all-weekend party, someone in an oversized T-shirt chain-drinking coffees, exhausted but full of mysteries to relate. She never overdoes it, but the easy colloquiality of her tone disguises a faultless understanding of where the focus of her memoir should lie – when to skip through several years within a paragraph, and when to lavish pages on a single mesmeric afternoon.The time and place she is dealing with have passed into legend, and fortunately she is not averse to the pleasures of namedropping:At the table to my left, Janis Joplin was holding court with her band. To my far right were Grace Slick and the Jefferson Airplane, along with members of Country Joe and the Fish. At the last table facing the door was Jimi Hendrix, his head lowered, eating with his hat on, across from a blonde.Just another day at the Chelsea Hotel, circa 1969…. It must be tempting to overplay your involvement in things if you were around then, but Smith is all cool circumspection; ‘I was there for these moments,’ she allows, ‘but so young and preoccupied with my own thoughts that I hardly recognized them as moments.’ Instead, all her attention was given over to the one man who seemed to have dominated her emotional life and her artistic development, Robert Mapplethorpe.I didn't know Mapplethorpe's work very well, associating him mainly with the all the controversial 1980s black nudes, and it was strange encountering him through Patti Smith – he seems so unlike his image that for a while I was convinced I'd confused the name with someone else. Her descriptions of their often-grim early days together are among her most evocative passages, and show off her direct sense of atmosphere to good effect.It was a terrible place, dark and neglected, with dusty windows that overlooked the noisy street. […] I sat there watching him sweat and shiver on an iron bed. The springs of the ancient mattress poked through the stained sheet. The place reeked of piss and exterminator fluid, the wallpaper peeling like dead skin in summer. There was no running water in the corroded sink, only occasional rusted droplets plopping through the night.Despite his illness, he wanted to make love, and perhaps our union was some comfort, for it drew out his sweat…I have to admit, I felt a little churlish about her obsession with him at the beginning of the book, having chiefly wanted a memoir of Patti Smith and not of Robert Mapplethorpe. But that feels very ungracious as the book goes on and she convinces you of his importance to her. What exactly drew them to each other is never made completely clear; a mixture of desire and support and artistic inspiration, but one that caused them both a lot of pain as Mapplethorpe started to explore his interest in men and in New York's S&M scene. Smith describes the two of them, in one of her many astute references to French literature, as being ‘irrevocably entwined, like Paul and Elisabeth, the sister and brother in Cocteau's Les Enfants Terribles’.I was charmed by the sartorial nature of Smith's memory. Almost every scene is introduced by way of a run-down of what she was wearing at the time, and the details of her outfit are often much more vivid than any of the conversations; this is not reeled off in a label-conscious fashionista way, it's just clearly the way she sees the world. ‘I don't remember what I read,’ she says of one of the early poetry readings that would lead to her rock career, ‘but I remember what Robert wore….’ Sometimes whole anecdotes are built on this clothing recall: when at a party the designer Fernando Sánchez questions her choice of white sneakers with black jacket, black tie, black silk shirt, and ‘heavily pegged black satin pants’, she tells him she's in costume as a tennis player in mourning. And when she auditions guitarist Tom Verlaine, she almost treats it more as a test of wardrobe than of musical compatibility:Divining how to appeal to Tom's sensibilities, I dressed in a manner that I thought a boy from Delaware would understand: black ballet flats, pink shantung capris, my kelly green silk raincoat, and a violet parasol…Oh for a photograph. Patti Smith is – there's no getting away from the word – incredibly cool. While at the Chelsea Hotel, she talks about her fascination with all the legendary former guests, and writes about scurrying from floor to floor, ‘longing for discourse with a gone procession of smoking caterpillars’. It's hard to imagine that kids won't be longing for the same thing with her years after she's gone, and this raw and touching memoir of late-60s, early-70s New York is, if nothing else, a beautiful gift to them."}, {"userName": "Iris P", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "Just Kids★★★ 3 Stars I am frankly pretty surprised that this popular memoir didn't quite click with me. Just Kids should've been a perfect match and yet somehow I could never completely connect with the world and the lives of the people it chronicles.Don't get me wrong, Smith's wordsmith is gorgeous and she is a wonderful storyteller. Her account of how she and her lover/collaborator/friend Robert Mapplethorpe, met and ended up right at the center of New York's influential art and music scene during the 60's and 70's is nothing short of remarkable.Just Kids reads like an emotional elegy to Robert Mapplethorpe and a love letter to both him and the city of New York, which was at the time the indisputable mecca of the rock and punk movements. Smith is sort of an oral curator as she recounts numerous encounters with an impressive group of artists, the city's rich cultural legacy and how she and Mapplethorpe became deeply ingrained in it. But throughout most of the narrative I had the sense that Smith seems to define herself and her claim to fame, in direct proportion to her proximity to other well-known artists. She and Mapplethorpe are never more than two or three degrees separated from the likes of Hendrix, Joplin, Warhol or Dylan. And she makes sure to remind us, over and over again.Her relationship with Mapplethorpe was complex and, at least from the outside, difficult to characterize. But it's obvious that in spite of his sexuality and his very conflicted attitude about it, they seemed to have found in each other a true soul mate. The final chapters, in which she describes Mapplethorpe's last months before dying of complications from HIV/AIDS, are very moving and felt to me like the most authentic part of their story. Maybe this memoir would've had a bigger impact on me had this been the musical soundtrack of my youth. My impression is that I lack both the cultural context and perhaps the creative sensibility to fully appreciate the contributions made by these artists. Nevertheless, this was an interesting read as I learned quite a lot about a fascinating and influential artistic period. Finally, I suspect that it'd be difficult to replicate the cultural and social atmosphere that allowed Smith and Mapplethorpe to blossom as such iconic figures. It's hard to imagine today's most prominent artists casually rubbing elbows like they did at the Chelsea Hotel back then. I think that's mostly a reflection of a more idealistic and innocent time in America.I read and simultaneously listened to the audio book, which I have to say is beautifully narrated by the author."}, {"userName": "Esil", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "Last year, I read Gloria Steinem's My Life on the Road. I didn't know much about Steinem, but her book made me see her in a whole new light -- not an icon, but a lovely dedicated generous person. I had a similar experience listening to the audio of Patti Smith's Just Kids. I didn't know much about her, but certainly wasn't expecting to be so charmed by her. The memoir focuses on her early adult years. She moved to New York, developed a complicated relationship with Robert Mapplethorpe and tried to figure out her place in the world. Rather than making herself sound heroic or tragic or dishing out tawdry gossip, she talks with great openness and generosity about her life, her family and her friends. Much of what she describes is mundane, but she recounts it with so much appreciation for small moments in her life that it's hard not to fall in step with her lovely sensibility. In many ways, I didn't find it easy to connect with the way she lived -- pretty gritty at times -- or her relationship with Mapplethorpe -- but I loved seeing it all though Smith's eyes. It helps that Smith writes really well -- occasionally veering into prose closer to poetry -- stark, simple and expressive. It all made me feel like slowing down -- appreciating what's there -- my family, friends and surroundings.A note on the audio: Smith narrates her own story. She has a slow droning voice. It really grew on me. You're going to love it or hate it. I gather the physical book has many photos."}, {"userName": "Nikoleta", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Γέμισα τρείς σελίδες τετραδίου μέχρι να αποφασίσω τι ταιριάζει ακριβώς να γράψω για το «Πάτι και Ρόμπερτ» και ο λόγος που δυσκολεύτηκα είναι το πόσο με εξέπληξε. Δεν είχα ιδέα για το ποια είναι η Πάτι Σμιθ, δεν είχα ιδέα για το έργο της, δεν είχα ιδέα για το πόσο ρομαντική, ευαίσθητη, λυρική είναι η ψυχή της και η τέχνη της.Αυτό ακριβώς είναι και αυτό το βιβλίο, όμορφο. Η Πάτι μας μιλάει για τον ερχομό της και την παραμονή της στην Νέα Υόρκη του 69’ παρομοιάζοντας την με την είσοδο της Αλίκης στην χώρα τον θαυμάτων, και όντως αυτό ήταν.Μιλάει για μια εποχή που ο πνευματικός και καλλιτεχνικός κόσμος νόμιζε ότι μπορεί να αλλάξει τον πλανήτη, να κάνει επανάσταση με μια νότα, μια λέξη, ένα ρεφρέν και μια φωτογραφία.Ανάμεσα σε αυτούς του γοητευτικούς δον κιχώτες διεισδύει και η Πάτι, με μόνο της εφόδιο, όχι την τέχνη της , διότι το παράξενο και όμορφο είναι ότι δεν έχει ιδέα ποιο είναι το ταλέντο της. Θέλει απλώς να εκφραστεί, να δημιουργήσει και να κάνει αυτό που πρέπει, αυτό που είναι ανώτερο ακόμα κ από την ίδια, να κάνει αυτό που έχει πραγματική σημασία, και έτσι ψάχνει να βρει τα δικά της όπλα για να δημιουργήσει. Και έτσι βρισκόμαστε σε έναν άλλον κόσμο, οπού οι περιγραφές της Σμιθ έρχονται ολοζώντανες μπροστά μας. Διότι όσο ψάχνει, στην ιστορία παρελαύνουν ο Τζιμι Χέντριξ, η Τζανις Τζόπλιν, τραβεστί, καταραμένοι ποιητές, ξέφρενα πάρτι και παραισθησιογόνα. Ο αναγνώστης όντως έχει πέσει στην τρύπα του λευκού κούνελου! Δεν νομίζω ότι θα μπορούσε να μας μιλήσει κάποιος ποιο ειλικρινά, μαγικά ρομαντικά για τον κόσμο του, είναι ένας κόσμος ο οποίος η Πάτι λατρεύει.Αυτή την πορεία την παρακολουθούμε πάντα σε συνάρτηση με τον πολυαγαπημένο της Ρόμπερτ. Άνηκαν ο ένας στον άλλον. Όταν το κέντρο είναι ο Ρόμπερτ, η Πάτι κάνει κύκλους γύρω του και εναλλάξ. Αυτοί οι δύο είναι ένας διαβήτης.Η Πάτι έγραψε αυτό το βιβλίο στην μνήμη του Ρόμπερτ Μέιπλθορπ, αλλά εδώ ο Ρόμπερτ συμβολίζει πολλά παραπάνω. Ο Ρόμπερτ, είναι ο Ρεμπώ και ο Μπλέηκ. Ο Ρόμπερτ είναι η ίδια η τέχνη, είναι το Μπρούκλυν και μετά γίνεται το ξενοδοχείο Chelsea, είναι η Νέα Υόρκη του 60’ και του 70’ που δεν θα γυρίσει πίσω ξανά. Αυτό το βιβλίο είναι ένας χαιρετισμός στον Ρόμπερτ Μέιπλθορπ και σε όλα όσα αυτός συμβολίζει.Μου άρεσε πολύ!«Παρ’ όλα αυτά, μπορούσες να νιώσεις τις δονήσεις στην ατμόσφαιρα, υπήρχε μια εντύπωση επιτάχυνσης. Είχε αρχίσει με το φεγγάρι, που μέχρι τότε ήταν ένα απρόσιτο ποίημα. Οι άνθρωποι είχαν πατήσει επάνω του, λαστιχένια πέλματα είχαν βεβηλώσει το μαργαριτάρι των θεών.»σ. 133.«Ο Ρόμπερτ πέθαινε δημιουργώντας σιωπή. Εγώ, που μου ήταν γραφτό να ζήσω, αφουγκραζόμουν προσεκτικά μια σιωπή που θα μου έπαιρνε μία ζωή να εκφράσω.»σ. 335."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Smith writes with a poet's clear imagery and an economy of words all too rare in the memoir genre. Before Robert Mapplethorpe died, Patti Smith promised him that she would one day write the story of their years in New York City. Now, twenty years after his death, she has made good on that promise. This is the story of a beautiful, complex, demanding and ever-evolving friendship between two young, hopeful, actively unconventional creatives. They alternated in the role of muse to each other as they felt their way through the New York City art/poetry/theater/music scene of the late 1960s and early 1970s. They were struggling to find their special niches and become accepted as artists. In this process they were often also struggling for simple survival. They frequently went hungry and had no place to sleep, all the while bolstering each other's resolve and refusing to give up their dreams.I never really knew anything about Robert Mapplethorpe aside from a big flap in the 80s about how his work was offensive. Smith writes about him with such tenderness and honesty that I couldn't help weeping when she described his death as a result of AIDS. We should all be so lucky as to have a friend like Patti Smith---a friend who could remember for us our youthful, most hopeful, most vulnerable selves and memorialize us so genuinely."}, {"userName": "Melanie", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/7574349-melanie", "userReview": "\"What should we aspire to as we go on our road? When I was in my early 20s, I was lucky to have William Burroughs as a friend and mentor. When I was with him and I asked him this question: “what should I aspire to?” and he thought, and he said: “my dear, a gold American Express would be good.” but after that he said very thoughtfully, “build your name.” and I said, “William, my name is Smith.” and he said, “well, you’ll have to build a little harder.” but what William meant when he told me to build my name, build a good name, because a name is not to get famous. He wasn’t talking about celebrity. He was talking about let your name radiate yourself. Magnify who you are. Your good deeds. Your coat of honor. And as you go through life your name will serve you.We might ask ourselves, what tools do we have? What can we count on? You can count on yourself. Believe me, your self is your best ally. You know who you are. Even when sometimes it becomes a little blurry and you make mistakes or [inaudible], just go deeper. You know who you are. You know the right thing to do. And when you make a mistake, it’s alright. As the song goes, pick yourself up, brush yourself off, and start all over again.\"Patti Smith Keynote Speech at Pratt Commencement 2010One of the most luminous tales of love and grit that I have ever read, set in the mythical and ever-shifting New York City of the 60's and 70's. Watch two young beings become who they are, two small rocks formed by icy water, grain by grain, layer by layer, sustained by an otherwordly faith in their own future.As I devoured this book (I couldn't put it down for three days), I couldn't help but think of this description of Jay Gatsby, which is at the heart of the American Character:“If personality is an unbroken series of successful gestures, then there was something gorgeous about him, some heightened sensitivity to the promise of life, as if he were related to one of those intricate machines that register earthquakes ten thousand miles away. This responsiveness had nothing to do with that flabby impressionability which is dignified under the name of the 'creative temperament'--it was an extraordinary gift for hope, a romantic readiness such as I have never found in any other person and which it is not likely I shall ever find again.\"This is exactly what is being expressed here on every single page: a heightened sensitivity to the promise of life. A romantic readiness such as we rarely get to experience today. A quintessential American love story."}, {"userName": "Madeline", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"Why can't I write something that would awake the dead? That pursuit is what burns most deeply. I got over the loss of his desk and chair, but never the desire to produce a string of words more precious than the emeralds of Cortes. Yet I have a lock of his hair, a handful of his ashes, a box of his letters, a goatskin tambourine. And in that folds of faded violet tissue a necklace, two violet plaques etched in Arabic, strung with black and silver threads, given to me by the boy who loved Michelangelo.\"(watch this and then read)Reading this was an interesting experience for me. Lately I've had a weird but insatiable urge to read memoirs by 1970's musicians. Why? Not really sure - maybe I just need to re-watch Almost Famous. But for whatever reason, I had a particular literary itch to scratch, and only Patti Smith's memoir would do.I had heard Gloria before reading this book, and I knew that Patti Smith was a musician. I had never heard of her lifetime friend and partner Robert Mapplethorpe, and most of the artists who get name-dropped in this book flew right over my head. For this reason, this memoir might as well have been pure fiction to me, since I had almost no frame of reference for anyone except the biggest names. But I think that, ultimately, this worked in my favor: instead of spending every other page thinking, \"oh my god, she totally knew [famous person] before they were famous!\" I was just focusing on the story. And it's quite a story. People who go into this book expecting to learn about Smtih's songwriting/performance career will be disappointed; her retelling of how she became a famous musician is basically \"someone suggested that I try putting my poems to music and people seemed to really like it, so that's cool I guess.\" There's not much about her actual writing process, even. She talks a lot about Rimbaud, and tries very hard to write like him. Occasionally you find yourself rolling your eyes at her prose, but for the most part, her writing is quite lovely. This is, first and last, the story of a lifelong friendship. This is the story of people who sacrificed everything - home, family, comfort, security - in order to become artists. What makes it lovely is that you get the sense that becoming famous - at least, famous in the sense that most people would recognize - never even crossed Smith's mind. She wanted, purely and simply, to devote her life to art. She was poor and homeless and miserable, but she was happy. A true starving-artist story, occasionally overwrought, but always compelling. Patti Smith is cooler than everyone you will ever meet."}, {"userName": "Duane", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "As he was dying Robert Mapplethorpe ask Patti Smith to write their story; \"You have to he said, no one but you can write it\". After reading this book I can understand why he said that. No biographer, other than Patti, could know, let alone describe, the level of trust and dependence they shared; and their singular kind of love that, even after reading this, is hard for the reader to fully understand.What capable hands he left that project in, I'm not sure he even realized it, I'm not sure Patti did at that point in her life. But write it she did, and what a magnificent result. I'm in awe of the talent and genius of this woman. She is in the Rock and Roll Hall of Fame for her music; she has received France's highest honor for her contribution to the arts for her drawings and photographs; but her greatest talent may be as a writer for the award winning books she has written, now a winner of the National Book Award for this memoir, Just Kids.2010 National Book Award winner for non-fiction."}, {"userName": "Darwin8u", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"Nothing is finished until you see it.\"  - Robert Mapplethorpe, quoted in 'Just Kids'\"Who can know the heart of youth but youth itself?\"  - Patti Smith, 'Just Kids'A memoir of images, people, and hopes 'Just Kids' explores the funky relationship of Patti Smith and Robert Mapplethorpe as they began their unique relationship and struggled to emerge as artists. The power of this memoir is the way Patti Smith works the words to create a canvas broad enough to catch both Mapplethorpe and Patti Smith as they grow and flower. I fell in love with Patti Smith and her music in college twenty+ years ago and loved her raw power and openness. Through her I discovered Mapplethorpe and although I never quite got excited by his more iconic S&M photos, I loved his flowers and his boldness. I knew their myth, but this book gave a greater glimpse into their relationship and the galaxy of their friends. I never knew about her relationship with Sam Smith, Allen Lanier, etc., or her friendship with many of the Chelsea Hotel crowd, beat poets, etc. The book is a great exploration of friendship, love and art. It is also a great tribute to the role of mentors, art benefactors, work, hope, and no small amount of luck in the creation of great art."}, {"userName": "emily", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/104806-emily", "userReview": "I didn't just hate this book. I cherished my hatred for this book. Luxuriated in it. Drank deeply of my hatred.I didn't just find the writing clunky, I found it odd, troubled by an overfamiliar relationship with the passive voice (lots of things \"could be seen\"), verbs (no one ever god damn says anything; they discourse, spiel, spin, regale, blah blah blah), and prepositions (why say \"on\" when you can add a syllable to get \"upon\"? why use the mundane \"because\" when you can replace it with \"for\" and sound like a Victorian lady novelist?). You know in the beginning of the movie \"Labyrinth,\" when Jennifer Connelly is reading out loud from that book about the Goblin King? It sounds like that.I didn't just find Patti Smith kind of strange and off-putting in the way she explains that other people who were not as cool as she may have. I found her (or her portrayal of herself, which is not the same thing) actively frustrating. I'm not sure if she intended, as a writer, for her and Mapplethorpe's pursuit of fame to sound so damn groupie-ish. Lots of tracking down someone who is famous and following him around."}, {"userName": "Velvetink", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/454255-velvetink", "userReview": "Did anyone think Patti was \"whitewashing\" her past in this? \"longing. that desire. that tapeworm.a wordI hadn't learned\".... (Seventh Heaven- \"Longing\")I really longed to LOVE \"Just Kids\", to go the whole hog with 5 stars. I had waited long enough to get hold of a copy & eventually when my library got it in some jerk kept it overdue 3 whole months and I was checking with them every 2nd day like a teenager. \"Is it back yet\". I wore out my welcome buying up discarded books and lurking near the door hoping to nab the overdue offender in their tracks. LOL. Now I'm confused, discombobulated..who is Patti Smith..where is the Patti Smith I thought I knew.. I've ended up only just liking it with 3 stars & my heart has sunk. Another idol demasked or re-masked again. It makes me feel little mean hearted since Patti was my adolescent heroine. Although truth be told on reflection I didn't know zip about her private past, only shadowy images of her with Robert Mapplethorpe. Mainly I knew her voice and her records, those I played over and over. Her poems in my original 1972 copy of \"Seventh Heaven\" was something sacred to me, some holy grail of truth if I could only decode the essence of, I could be like she, or something...such is the stuff of puberty or perhaps I had blinkers on then most likely.Maybe I have a wrong take on this but I feel she's sugar coated her early life with Mapplethorpe. I can't believe she was so naive. In the thick of all the action in NY, at Max's & the Warhol crew. Friends all around doing drugs and she being 23-4 didn't know anything about drugs. Oh come on. At that time I was 14-15 and knew more about the street than she purports to have known. My upbringing not that different or richer or poorer than hers. But she bangs on about how poor her and Robert were in the 70's in the book and I can't really come to grips with her take on things. She's all the \"SERIOUS ARTIST\" and in the world but not of it.?? WTF. Totally dispels any illusions she was all \"sex drugs and rock and roll\". I feel like she's writing this view of herself...\"the goody two shoes naff poet\", for some other person.....her family or children perhaps. Maybe.....The early chapters alternate between her childhood and Roberts. The mid-secton is where I have trouble(as described above). She goes into fairly explicit details about Roberts homosexual adventures and loves, his art/porn and creativity issues and final relationship and death from AIDS. She talks about her trip to Paris and Baudrillard's grave, and she was distanced like I've never felt her distanced in her music or poems. Is that Baudrillard's Simulacra? Something's slightly skewed here because I just didn't feel her passion in \"Just Kids\" - EXCEPT when she was talking about Mapplethorpe's art and death - I didn't get a sense of connection when she talked about her marriage either, it's censored and distanced also.. I think in truth it's not about her it's about Robert. The book is littered with wonderful images of Robert and of her (taken by him). It's more his obituary. It's sad. Sadder than I can say."}, {"userName": "R.K. Gold", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/40737518-r-k-gold", "userReview": "oh go on, they're just kidsI'm still trying to collect my thoughts about this book. I know it made me feel something, I know I have every intention of re-reading it, and I know many anecdotes from it will come up in casual conversation with my friends when I try to convince them to read it. Still, I am not sure what the emotions are I feel when I think about it. There's obviously a feeling of loss and grief; not just for Robert Mapplethorpe and Sam Wagstaff, but also for all the other artists, players, hustlers, and socialites in their circle who had tragic ends. They were all walking the same cusp, brushing shoulders with some of the most influential musicians and artists of the sixties and seventies. So many people in this circle must've thought they were on their way to achieving their creative dreams, only to be mentioned later on in the novel to have taken their own life, died of an accidental overdose, or other unfortunate circumstances. There was also hope, and optimism, and a feeling that anything is possible. There was certainly some magic, both light and dark, that people flirted with, and in some cases became lost. Personally, I felt the magic was strongest at the Chelsea hotel. There was humor, like Patti's first interaction with Allen Ginsberg, when he mistook her for a very pretty boy.And there were plenty of respects paid to the generations of the artists who laid the foundation for the next breakthrough.One thought that kept coming back to me throughout this whole memoir, were just how much the times had changed. She spoke of living in NYC as an artist selling books and scraping by. She spoke of how far fifty cents could get her and even at her worst she and Robert knew they would find a way. It's sort of crazy to think that if she and Mapplethorpe were born today, or were in their twenties today, they could not have taken that journey to NYC (or it would've been more complicated). It almost felt like the spirits of the city back then were encouraging them to succeed and based on my very limited knowledge of NYC I don't know how well this journey could be replicated today.I loved this book, and I look forward to further digesting it in the coming days."}, {"userName": "Calista", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "I didn't know Patti Smith. I had seen some photos of Robert Mapplethorpes before. I didn't know they had this relationship. Patti Smith is a fantastic story teller. What a moment of providence when Robert walked up to her counter at the book store and bought that necklace. Also, when he ran into her after her bad date - this relationship was fate, a thing meant to happen. Two artist meeting in the night and forming a bond that both of them were supported by.I LOVE this book. Patti's voice is so sure and guides the reader through sex, drugs, rock n roll and poetry and ARt. They lived a life of art, their lives were artful. The struggled and explored. This whole 60s/70s era in New York City fascinates me. I'm so glad I gave this book a read. It has spoken to the artist in myself.Aids took so many wonderful people. That is the saddest part is all the lost potential of that disease. Thank you Patti for sharing your life! It has touched mine."}, {"userName": "christa", "userReviewDate": "Feb 18, 2011", "userURL": "http://www.goodreads.com/user/show/40816-christa", "userReview": "I'll say this for Patti Smith: Homegirl certainly knows how to write lifestyle porn. Somewhere between the Chelsea Hotel and the insertion of a millionaire benefactor I closed her love letter to Robert Mapplethorpe, \"Just Kids,\" bonked myself in the head and said \"Knock it off.\" I needed to stop being dazzled and wooed and to start seeing through clear eyes or I'd wake up in a bus stop in Detroit clutching a one-way ticket to 1971.People do that. Chuck it all, grab a blanket, commit 100 percent to making things. Music. Pictures. Words. More than just teacher-school dropout Patti Smith and Robert Mapplethrope, a skinny kid on the lam from the Catholic church. Every day, maybe even right this second, a kid is climbing off a bus at some junction in New York City, schlepping a dirty military backpack filled with notebooks filled with poetry filled with nature imagery, A copy of Bob Dylan's \"Chronicles\" in his back pocket. He's got two weeks worth of dinero in a two-toned teal velcro wallet and a breathlessness about doing \"whatever it takes washing dishes cleaning toilets as long as I can write.\" He might, like Patti Smith, sleep in a doorway or two. He might, like Patti, find a street angel who will teach him about day-old bread and primo napping places in Central Park. He might get a job at a book store; move into an extended stay hotel full of eccentrics; become a regular at corner bar. He might meet someone who is first his lover, then friend, muse and soul mate. He'll observe and jot and wait for a Warhol-ian figure to notice him, all while experimenting with couplets, then, perhaps free verse, then, perhaps starvation. Published in a zine. A promise for publication on a friend of a friend's website. And after all those PB&Js, after he maybe even finds a word that rhymes with orange, maybe we'll hear about him. We probably won't. Maybe he'll write a book about his soul mate and win a National Book Award.This is in progress right now and right now and even right now. The mere fact that we get to read this portrait of the 1970s art scene from this particular perspective is that they both, Patti Smith and Robert Mapplethorpe, busted through the wall of obscurity. And the reason that this story is thrilling and exciting and tender and tugs at the soul and inspires wanderlust is because you know what was on the other side of that wall: Fame. Tragedy. So what's the difference between Patti Smith and Robert Mapplethorpe and [insert unknown artist's name here]. Is it still possible to be short on cash for a sandwich and have the equivalent of Allen Ginsberg foot the rest of the bill in a madcap case of gender confusion? I can't figure that out. Is it timing? Is it tenacity? Is it talent? You can't just say talent: After reading Belinda Carlisle's memoir last year I realized that underneath the mounds of cocaine and the lipstick was a woman who couldn't play an instrument, didn't write songs, and really didn't know much about singing, who went on to front one of the iconic bands of the 1980s. How did she get there: She hung out at the right clubs on the right West Hollywood street corners and was standing next to the right people when someone decided to start a girl group.All I know is that reading \"Just Kids\" made me want to shed 15 years and ditch out for the big city with a dream journal and a change of socks. That's easy to say, so freshly seduced. This is one of those books that made me think I was born too late."}, {"userName": "Erik", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/3213510-erik", "userReview": "It is difficult for me to think of an artist who illuminates pure positive affect in the way that Patti Smith does. For someone who always had a special place in his heart for Patti's \"Horses\" record, I can safely say there are moments where her music and her words have taken my mind and my heart to places I would have never imagined. For me, the record has a similar effect to Allen Ginsberg's, \"Howl,\" and Walt Whitman's, \"Song of Myself.\" The passion, the energy, the blood-racing anticipation between her vocal crescendos... It is absolutely on fire. However, I have found that \"Horses\" is a rather polarizing record. People who are into rock and roll either like it or hate it. I love it. My brain chemistry gets perfectly locked into Patti's grooves, and I'm happy to know that I can revisit this amazing album throughout my life anytime I feel the need.When \"Just Kids\" came out, I realized that it had been quite some time since I had last thought of Patti Smith. My reading habits have changed a lot throughout the years, and I'm generally not a fan of biographies. However, I knew I would enjoy this one. I was simply waiting for the right time to read it. One of the many things that fascinates me about Patti Smith is that she was simply a naive and innocent child full of so much wonderful curiosity, a perpetual outsider who had no misgivings over the fact that life would be an uphill battle. Unlike many artists whose early lives were subject to torment and desperation, Patti came from a humble and loving home. Patti was not abused by her family, (she actually spoke very tenderly of her parents and siblings), nor did she express any excessive disdain towards those she encountered during her early struggles, (not even towards her factory coworkers who dehumanized her; thus providing the impetus for her song, \"Piss Factory,\" nor the prying and judgmental eyes during her teenage pregnancy.) And even though she arrived in New York homeless and hungry and would generally fare no better until the latter end of the '70s, Patti's enthusiasm and diligence completely outshined her hardships.Patti was in love with life. She was intoxicated with the freedom that came with being a young artist in a city of the world; finding inspiration and friendship during the unlikeliest moments, and holding onto these moments until they became the core of her being. One of the things I adore most about Patti Smith is her ability to live simultaneously inside her own head, completely losing herself within a sanctimonious inner world of books, dead poets, and philosophers, while also living very much in the moment. All of her encounters with '60s rockers like Jimi Hendrix, Janis Joplin, and Grace Slick, along with her introductions to future celebrity artists, like Jim Carroll, Sam Shepard, and Tom Verlaine among many others, excited her, energized her, and gave her a great sense of fortune. She never took any of these encounters for granted and she continues to keep these people close to her heart to this day. Patti also never denied nor shied away from the influence of those who came before her, (particularly Jim Morrison and Arthur Rimbaud). I particularly enjoyed the passage in the book where she visited both of these young men's graves in Paris.The only thing I haven't mentioned yet is Patti's friendship to Robert Mapplethorpe. What a sweet, sweet thing. Their bond was beyond friendship, beyond physical love. These two were soulmates in the classic sense. Robert and Patti completed one another, challenged one another, and guided one another throughout every course in their lives. Even her descriptions of their simplest outings and everyday musings came across as life-changing journeys. She pulls this off without being overly dramatic or grandiose because the love these two had for one another was complete, endless, and beautiful, and it was perfectly captured in this book.I was a little surprised that Patti didn't delve more into the lives of her bandmates, her children, or her husband, the late, great Fred \"Sonic\" Smith. But then again, as she firmly stated, this was she and Robert's story, and she promised him that one day she would write it and share it with the world. That's precisely what she has done, and I'm very thankful for her doing so. This book was a glorious experience for me."}, {"userName": "MJ Nicholls", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "There is a whiff of earnestness about Patti Smith but now we’ve got that out the way, shut up and listen to Horses, Easter, Gone Again and Trampin’ back-to-back for a whole month. If your nerve-endings and spatial awareness aren’t merrily bamboozled with light and love, you are not fit for human habitation. For Patti is a creature unto herself.Just Kids radiates pure, unfiltered love for her friend Robert Mapplethorpe, and its simple prose tells a powerful tale of two driven artists seeking release into a wild and beautiful world. For all those stargazing liberal arts majors interning in publishing houses, get out there, get thee to a garret and get thee to a used copy of A Season in Hell and learn how to live.That is an order, divined upon thee by the almighty Gods of heartbreaking original life-shaking capital-A art. You must learn. Brave the winds. The only thing to fear is the unpure image."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This book has remained unread on my shelves at home since it won the National Book Award for non-fiction in 2010. I meant to read it, but when one of my book clubs picked it, I finally had the push I needed. \"In my low periods, I wondered what was the point of creating art. .. I craved honesty, yet found dishonesty in myself.\"I knew vaguely of Patti Smith because of her music, and went into this thinking that she would be writing about it. It's in there slightly, but this is really the story of her relationship with photographer Robert Mapplethorpe, which if you believe her narrative, she met on her very first day in New York.Do I sound a bit skeptical? I guess ever since feeling like Three Cups of Tea: One Man's Mission to Promote Peace ... One School at a Time was a bunch of shenanigans because of too many spectacular events and otherworldly coincidences (and was proven right), I have a healthy dose of the critical eye when it comes to memoirs where the person writing encounters everyone. It's convenient that most of the people she mentions died before this was published. Janis Joplin, Jim Morrison, Bob Dylan, William S. Burroughs, Andy Warhol (okay she admits she knew the people who knew him mostly), etc., etc. So the stories are amazing and strange in the way that all these people are normal humans living at the poverty level within this larger movement. And maybe that is the crux of most major artistic moments in time - right place, right time. And if it's all true (and nobody has ever said it isn't), Patti Smith really hit the jackpot.Much of the happenstance occurs around her, but just as much of it happens to her. She seems to fall into art shows and stage productions, even performing music. It's like the people around her are pulling her out because they sense something she doesn't. Or she's being humble. It was hard to tell.Patti writes with great idealism about this time. I'm not sure if she's trying to capture her naivete at the time or if she still lives in that mode, but the beginning and ending of the book, since it starts and ends with Robert's death, gives a rather large punch in the face to the era. AIDS really moved in and destroyed the people who had been creating and interacting so freely in the previous two decades. It was a stark contrast to the open and endless feeling of the time period most of the book focuses on.I enjoyed reading it, even with my spidey sense tingling a little. Getting to know this part of the New York world in the 60s and 70s was very interesting, as I feel like I've read works coming out of it but not much about it itself. But that's the backdrop; this is a story of creative soulmates who are sometimes friends, sometimes lovers, but always in each others lives, pushing them to be greater."}], "description": "In Just Kids, Patti Smith’s first book of prose, the legendary American artist offers a never-before-seen glimpse of her remarkable relationship with photographer Robert Mapplethorpe in the epochal days of New York City and the Chelsea Hotel in the late sixties and seventies. An honest and moving story of youth and friendship, Smith brings the same unique, lyrical quality to Just Kids as she has to the rest of her formidable body of work—from her influential 1975 album Horses to her visual art and poetry.", "title": "Just Kids", "url": "http://www.goodreads.com/book/show/7995195-just-kids", "average": 4.13, "cover": "https://images.gr-assets.com/books/1348842477l/7995195.jpg", "reviews": 9015, "authors": [{"url": "https://www.goodreads.com/author/show/196092.Patti_Smith", "name": "Patti Smith"}], "type": ["Nonfiction", "Autobiography", "Music", "Biography", "Art"], "outlinks": ["http://www.goodreads.com/book/show/7995195-just-kids", "http://www.goodreads.com/book/show/341879.Just_Kids", "http://www.goodreads.com/book/show/3792190-just-kids", "http://www.goodreads.com/book/show/7741657-just-kids", "http://www.goodreads.com/book/show/32315914-just-kids", "http://www.goodreads.com/book/show/17701587", "http://www.goodreads.com/book/show/24728470-m-train", "http://www.goodreads.com/book/show/34607044-devotion", "http://www.goodreads.com/book/show/788586.Woolgathering", "http://www.goodreads.com/book/show/351904.Early_Work_1970_1979", "http://www.goodreads.com/book/show/341884.The_Coral_Sea", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}