{"ratings": 1240, "userreviews": [{"userName": "Natasha", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/5600312-natasha", "userReview": "Honestly, if you call yourself a Malaysian then you better read this. You are not a true patriot if you haven't read this.And if you're not a Malaysian, if you read this, you will a have a rather nice glimpse into Malaysia's past where time seemed to stand still and kids being kids just play all day, inventing things to do, blending in with the nature rather than just stare at the computer..oh dear.Personally, being from a younger generation we need to be reminded of such things so that we will be more grateful for the comforts we have today."}, {"userName": "Becca", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/1165572-becca", "userReview": "I loved this story from the first page. It kept me engaged through the use of various amounts of words on each page, the graphics, the cultural knowledge imparted, the way Lat made me instantly connect with the boy, Mat. The smiles of the people were a little alarming and I wish there had been just a teensy bit more about learning the Koran, but maybe more of that comes with the next book, which I will undoubtedly read."}, {"userName": "Cheryl", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/3498889-cheryl", "userReview": "Rating my own opinion... I don't get much out of this style of artwork. But I did love learning about a boy growing up in a kampung in rural Malaysia near a tin mine.My library shelved it as YA but I have no idea why. The most intense bit was the circumcision - at age 10! Call it Juvenilie, or call it 'all ages.' It took me 26 minutes to read (including trying to make out details in pictures)."}, {"userName": "Dolly", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/1019021-dolly", "userReview": "This is an entertaining and eminently enlightening tale about a young boy growing up on a rubber plantation in rural Malaysia in the 1950s. I really enjoyed reading the illustrated story and I feel like the drawings conveyed just as much of the tale as the words do. Overall, it's a humorous book, but much more than that, it offers a window to catch a glimpse of life in a part of the world I have never seen before (probably never will). It also shows the universal concepts of familial affection, the ability for young children to get up to no good, and the food coma a student feels in the afternoon classes following lunch. I'm not sure if our local library carries any more of the books in this series, but I will certainly keep looking for them.interesting quotes:\"Well...that was also the day I discovered how angry Mum could get.I was so afraid of what Mum would do to me that I was running like a barking deer! She lost me near Pak Alang's house when the man, who knew me by sight, showed sympathy for me...But of course I got the thrashing later anyway.\" (pp. 22-23)\"One thing I discovered about an afternoon class was you tend to get sleepy...\" (p. 48)\"At the end of each month we'd pay the teacher for his service. Tuan Syed accepted any form of payment. Some of us would give him $1, some gave 50 cents, others gave him a plate of rice or sugar. Or we could be like these three brothers here (the children of Meor Yusoff), who gave teacher firewood they picked on their way to class.Even that was all right.\" (p. 50)"}, {"userName": "Juliza", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/5974829-juliza", "userReview": "(4 stars)This is the second comic book in my collection by this renowned cartoonist. Beforehand, I’m already a fan of the animation series; Kampung Boy. But I think this book and the television version is a little bit different. Or is it from another book?By the way, Mat Som got me really hooked up with Datuk Lat’s drawing, characters, humour and also beautiful messages in his work. And,Kampung Boy is not any less wonderful. Not at all. :) And yes, now I understand why this book became one of the references for foreigner to learn about Malaysian life. Our multiracial country has a wide variety of custom and tradition but somehow I feel we all can relate to this book. At least I can and I came from the other side of Malaysia (Borneo), not in Lembah Kinta and I certainly never been to rubber plantation before or even growing up in the same era as Mat. That’s how beautiful this book is and no wonder it feels so dear to the heart of every Malaysian. ;)"}, {"userName": "Stacy Slater", "userReviewDate": "Nov 04, 2009", "userURL": "http://www.goodreads.com/user/show/2755119-stacy-slater", "userReview": "What a charming book! From his birth to his journey to boarding school, this kampung (village) boy enjoys his life. Nothing special happens in this graphic depiction of life in a Malaysian village in the 1960s, but the normal boy pursuits (fishing, hanging out with friends, getting in trouble with mom), are portrayed with great affection and humor. The village, however, is changing with the times, and as the boy leaves for boarding school, he and the reader are left wondering if there will be a village for him to return to. Lat, the author, is noted as one of the most popular cartoonists in Southeast Asia, and it's easy to see why. His simple line drawings are wonderfully expressive and his backgrounds brim with the everyday details of life that make the kampung come alive. Students in fourth grade and above will enjoy Kampung Boy and will eagerly await the U.S. publication of the next in the series."}, {"userName": "Yulianto Qin", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/187116-yulianto-qin", "userReview": "Lat adalah salah satu komikus favorit saya. Gaya gambarnya yang sederhana sekilas seperti buatan anak-anak membuatnya memiliki karakter yg khas. komik kampung boy ini merupakan 'slice of life story' yang menggambarkan kehidupan sehari-hari si komikus semasa kecil di kampungnya. Petualangan mencari ikan di sungai, menjaga durian di kebun, sunatan, sampai tingkah nakalnya menjadi pendulang timah liar diceritakan dengan jenaka dalam gambar-gambar yang sederhana tetapi memukau. Membaca kampung boy membawa saya kembali ke masa kecil di kampung juga. kesederhanaan polah tingkah tokoh Lat kecil membuat komik ini cocok untuk semua umur. Tak ada plot yang menegangkan (hanya sedikit keriuhan ketika lat kecil dihajar bapaknya karena menjadi pendulang timah liar) maupun cerita yang genggap gempita tetapi kita tetap bisa menikmati alur cerita yg sederhana ini. lat sungguh mumpuni dalam merangkai gambar dan kata yang sederhana menjadi cerita yang meluluhkan hati pembaca segala usia."}, {"userName": "Mia Kay", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/70328419-mia-kay", "userReview": "guys, lets get back to our malay root. This book has everything. it tells from the author perspective on living as a kampung boy, and the culture with our old tradition, it makes you wanna live in that era. For me, I always wanna feel like living in the 60s. it really does captivate that time and i love it."}, {"userName": "Hana", "userReviewDate": "Apr 22, 2014", "userURL": "http://www.goodreads.com/user/show/12664679-hana", "userReview": "The Kampung Boy tells the story of a young boy, Lat, and his childhood in a kampung (village). A graphic novel, it illustrates the boy's life in pictures and words. Aside from being the protagonist, Lat is also the narrator. The story opens with his birth in a kampung in Perak, Malaysia, and the traditional rituals surrounding the event: the recitation of blessings, the singing of religious songs, and the observance of ceremonies. As Mat grows older, he explores the house, gradually shifting the story's focus to the comic activities of his family outside their abode. The book is full of experiences the Kampung boy goes through such as reading the Quran and learning to fit in with his new friends and even his new little brother. The company will offer a large sum of money for the family's properties if they discover tin on it. Other villagers are hoping for similar deals with the company. They plan to buy houses in Ipoh if their hopes are realised. The day for Lat to depart the village has arrived and he is excited, but as he is about to depart, sadness washes over him. He acknowledges the emotions as his love of the village and hopes that the place where he was born will remain unchanged when he returns.Overall, I loved this book cause I was ale to relate to it because I am Malaysian. My grandma is from Perak and she lived in the Kampung all her life. I was able to understand phrases and jokes that other readers may not understand. This book is very famous in Malaysia because of its detailed illustrations andThe book made Lat an international figure and a highly regarded cartoonist in Malaysia. It won several awards when released as Kampung Boy in the United States as well. I loved the simple but interesting plot, and the illustrations were in black and white. He was able to create drawings that weren't in color interesting full of shapes. You were able to grow up with the Kampung Boy and experience things like living in the village."}, {"userName": "Dani Shuping", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/5031502-dani-shuping", "userReview": "Lat takes us on a journey of his childhood growing up in the Kitna Valley in Perak in the 1950’s. Lat is master storyteller as he takes us down the wandering path of his memories showing us the ceremonies that were still practiced--such as asking the local teacher to take on students, the feeling of swimming in a river as the cool water washes over you, and the warmth and somewhat craziness of family--like the dad that takes off his shirt to scratch his back on the pole when he gets home from work, caring for siblings, and the discussions of future. But the modern world is gradually approaching with tin dredges and trains and automobiles. And Lat is about to head off to school in another town away from his family.This book is done in a sketchbook style, with written descriptions of the events and illustrations accompanying them. The deceptively simple illustrations are compelling and catch that slice of life that seem to be missing in many modern comics. He doesn’t hesitate to illustrate what life was really like growing up for him, even if it means depicting his own backside as he and his friends strip down to take a swim in the river. Most importantly even though Lat illustrates how things are different in his world, there is much that is similar to our own way of life. The time spent with family and friends, the time spent at school..the more things seem to be different the more there is that is the same.I highly recommend this book and it's sequel (Town Boy) to anyone and everyone, but particularly to the younger generation. Not just as a chance to illustrate the differences between cultures, but a chance to illustrate the similarities between them."}, {"userName": "Danya Itani", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/28163723-danya-itani", "userReview": "Kampung boy is a novel about a baby who is born in the Kampung village of Malaysia. The book begins by the birth of the baby and begins explaining the celebrations and rituals that they do. It explains how they dress the baby and how they take care of him. Then since the family is Muslim they explain the traditions they have. Not only does the book have a sense on religion but education and daily life as well. As soon as the little boy grew up his father put him in a religion school, there he met other boys and became friends. Him and his friends would go fishing and do adventurous things like swimming in the river. This book is very entertaining even if you're not a comic person you should go for it. It wasn't a hard book but it was surely fun to read. Because the comic is in Malaysia and is based on a Muslim family I felt that I could somewhat relate to it since I live in an Islamic country, and I have been to Malaysia myself and have many Malaysian friends. In conclusion is comic exceeded my expectations and everyone can learn something from this book, weather its something about Malaysia, Islam, or family, since the little boy lives in the love of his family."}, {"userName": "Aisyah  (´｡• ᵕ •｡`) ♡", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/13615508-aisyah", "userReview": "Aww.. si comel MatBuku ni menceritakan kisah hidup Mat di kampung sewaktu dia kecil pada zaman 50-an. Kenangan a bila balik kampung raya kat Negeri Sembilan mesti baca komik ni. Kisah dia yg sweet, kelakar dan semestinya authentic pasti menarik hati sesiapa yg membacanya. A akui bahawa karya Lat ni memang special, cara dia melukis membawa personaliti kepada karakter-karakter dalam buku ni, dan Lat berjaya menggambarkan kehidupan seorang kampung boy dengan tulus dan realistik dah memang dari pengalaman dia sendiri..hehe. Tambahan pula, karya ni memang merupakan komik klasik yg dibaca oleh hampir semua org di Malaysia at least masa time smartphone dan tablet ni xwujud lagi dan kanak-kanak semua boleh tahan lasak ;)So make sure to pick up a copy of this, even if you have read it before. I'm sure it'd put a smile on your face like it did for me all these years Told ya :)"}, {"userName": "Kathy", "userReviewDate": "Jul 20, 2010", "userURL": "http://www.goodreads.com/user/show/3935438-kathy", "userReview": "Lat. (2006). Kampung boy. New York: First Second. Fiction. In this book, which was first published in Malaysia in 1979, Lat shares the story of his childhood in his small village, or kampung, during the 1950s. From his birth and adventures as a young boy, to his education in the village, making friends, and his eventual leaving of the kampung for boarding school, Lat sweetly, and authentically brings his kampung to life. There is an authentic portrayal of his rites of passage, such as his hair shaving ceremony soon after birth, to his Muslim upbringing as he begins lessons in the Koran at age six. Authenticity is furthered as Lat states that he is able to see a rubber plantation from his window, and often hears the roaring sound of a tin dredge. At the end of the story, when he must leave for school, readers are left with the feeling that there are more books to come that reveal what happens next to this loveable young man.Lessons: This is a good book for students exploring other cultures. It is also a nice read for seniors, who are leaving home for the first time, to demonstrate that the anxious feelings they may have are universal."}, {"userName": "Heidi", "userReviewDate": "Oct 14, 2009", "userURL": "http://www.goodreads.com/user/show/1071252-heidi", "userReview": "If nothing else (and I actually have got a lot out of this challenge) 50books_poc has got me reading graphic novels and comics. Kampung Boy is completely charming. I wish it wasn’t pretty much the only piece of Lat’s work so far published in Australia (although apparently they’re planning to release some more in the future). It’s a beautifully rendered graphic novel of (essentially) Lat’s childhood in a village – a kampung – in Malaysia. His and his family’s religious observance is matter-of-fact, and his childhood mischief is endearing. (Like that of most children.)The book takes Lat to what seems to be an “end of childhood” moment: his departure from the Kampung to go to a boarding school in Town. (Town Boy is the next volume, and I’m really looking forward to finding it.)Lat is one of the best-known cartoonists/serial artists in Malaysia, which is why I think it’s unfortunate that he’s only just getting published in Australia. Kampung Boy is, above all, exuberant and endearing; and well worth the read."}, {"userName": "Tamara✨", "userReviewDate": "Nov 09, 2009", "userURL": "http://www.goodreads.com/user/show/2925473-tamara", "userReview": "[This was written originally for an 'article' I submitted to rookiemag.com, but it was not used.] Growing up in Singapore, everyone knew about Mat, the kampung boy. The word ‘kampung’ in Malaysian means village. Kampung Boy is not really an extraordinary story by any means; it’s really just a memoir of Mat and his life in a rural village in Malaysia in the 50s. How he goes fishing, gets in trouble with his mum, helping his dad run errands and going to Sunday school. Meanwhile the traditional way of life of the village is gradually disappearing with farm holders and rubber plantations being replaced with tin mines and factory jobs. Eventually Mat leaves for boarding school, and when he does he has the same worry that all of us do when we leave home: Will you still be here when I come back? It’s an interesting view on a world that is almost all but gone and even more interesting if you’ve never been to South-East Asia. https://hercommonplaceblog.wordpress...."}, {"userName": "Raina", "userReviewDate": "Aug 13, 2009", "userURL": "http://www.goodreads.com/user/show/1640308-raina", "userReview": "The story of a boy growing up in a Southeast Asian village. Chronicles the rituals and adventures of small town life, including baby's first shaving, circumcision, etc. Felt like an autobiography, so I'm curious about the author's history. Also didn't stand up to me as a graphic novel - the words did most of the telling, with illustrations and a few references to the pictures. A couple of details are only communicated through the pictures (a young crush), but they are not crucial to the story. Interesting as a slice of a very different life than my own, but I missed detailed depictions of facial expressions and fleshed out characterization too much to continue reading the series."}, {"userName": "Rebecca", "userReviewDate": "Apr 16, 2007", "userURL": "http://www.goodreads.com/user/show/41583-rebecca", "userReview": "This was an energetic, sweet little graphic novel memoir about growing up in a kampung (village) in Malaysia in the 1950s. I enjoyed it for the ugly, expressive characters, the wonderfully-drawn natural settings (watch your backs, Bill Watterson, Jeff Smith, and Craig Thompson), and the window into a time, place, and lifestyle that are already beginning to vanish as of the end of the book. I hope there are follow-ups so I can find out what happens to Mat at boarding school. I've liked everything I've read from First Second books. This would be a good title to recommmend to those who liked American Born Chinese. Only takes 20 minutes to read - check it out!"}, {"userName": "Francesca Forrest", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/2265896-francesca-forrest", "userReview": "Loved this for the details of village life in Malaysia the 1950s--things you can't get elsewhere, you can get in this graphic novel. Pictures of how a kitchen is set up, or a hammock rigged up so that Lat can rock his baby sister--or, later, a picture of him pulling his little brother along on a palm leaf frond. His dad shows him a weaver bird nest and says that weaver birds put fireflies in them to light up the insides. I checked this out online, and it's a widespread belief--people say this in India, too--but I guess it's something ornithologist have never actually seen, not for real. But anyway, little stories like that, I love. I liked everything about this book."}, {"userName": "Laura", "userReviewDate": "Aug 05, 2010", "userURL": "http://www.goodreads.com/user/show/398928-laura", "userReview": "LOVED it! Semi-autobiographical story about a young Muslim boy growing up in rural Malaysia. The drawings are really energetic and detailed cartoons, and the story is simple in the best possible way. Loved loved loved it."}, {"userName": "Vanessa", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/8804606-vanessa", "userReview": "Gorgeous!"}, {"userName": "Kim", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/33882747-kim", "userReview": "a beautiful story of both narrative and style."}, {"userName": "K", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/2804984-k", "userReview": "This was the first book I ever read from Malaysia. It's the perfect one to start with because it seems to be widely beloved by Malaysian people. It's easy to see why. 'Kampung Boy' describes village life for a young Muslim boy growing up on a rubber plantation, near a tin mine, in the 1950s. While that setting is exotic and fun to experience via the author's illustrations, the little boy and his antics are sweet, adorable, and universal. The whole book took only 30 minutes to read. There's a sequel which I will seek out called 'Town Boy,' probably about him experiencing the 'big city' when he goes off to school. Apparently, the author just finished a memoir too, which was published last year."}, {"userName": "Danielle", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/16669631-danielle", "userReview": "While I enjoyed this overall, it really didn't connect with me emotionally until the very end. It's a breezy read, though at times I was confused over whether it was supposed to be a memoir or fiction. This was cute, and I feel like southeast Asia doesn't get a ton of representation, so I was really happy to get that from Kampung Boy. Even though most of the book passed quickly for me, I would be interested in reading the sequel at some point."}, {"userName": "bjneary", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/62411-bjneary", "userReview": "I read this realistic fiction novel in verse as part of the November chat for #yearoya focusing on books written between 2002 and 2007. Lat's life growing up in Malayasia was so interesting, his fishing, adventures with friends, and his family dynamics made this an interesting look at a life in 1950 that was disappearing even then."}, {"userName": "Child960801", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/4817364-child960801", "userReview": "This is almost more of a picture book than a comic, but the illustrations are definitely more comic in feel and there are sequences of sequential art. The story of a young Muslim boy growing up somewhere in South East Asia."}, {"userName": "Eoin", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/132186-eoin", "userReview": "A swift and subtle look at a particular and universal childhood. The details from 1950's rural Malaysia are a world away from Western city life, but the themes and experiences remain familiar. A deft, sly touch in the art and pacing makes this the classic it is known it be."}, {"userName": "Catherine", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/2839842-catherine", "userReview": "The author relates his childhood in Malaysia from birth until leaving for boarding school, illustrated in a black-and-white cartoon style. The story is a sweet, but not syrupy, one of a happy boyhood."}, {"userName": "Fiq Daud", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/68779743-fiq-daud", "userReview": "Kenangan menggamit jiwa , saya rindu kampung mak ayah yg dah hilang ditelan hutan batu.dalam rumah kayu nenek ,ada foto pakngah dan paklang masa kenduri berkhatan dengan tokmudim"}, {"userName": "Laura", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/3550041-laura", "userReview": "This is a cute comic book of a little boy's life in SE Asia and illustrates his family, school, and neighborhood life."}, {"userName": "Megan Mann", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/5260140-megan-mann", "userReview": "this was a really nice story about growing up and moving on, but still wanting home to come back to. I thought it was super interesting and sweet."}], "description": "Kampung Boy is a favorite of millions of readers in Southeast Asia. With masterful economy worthy of Charles Schultz, Lat recounts the life of Mat, a Muslim boy growing up in rural Malaysia in the 1950s: his adventures and mischief-making, fishing trips, religious study, and work on his family's rubber plantation. Meanwhile, the traditional way of life in his village (or kampung) is steadily disappearing, with tin mines and factory jobs gradually replacing family farms and rubber small-holders. When Mat himself leaves for boarding school, he can only hope that his familiar kampung will still be there when he returns. Kampung Boy is hilarious and affectionate, with brilliant, super-expressive artwork that opens a window into a world that has now nearly vanished.", "title": "Kampung Boy\n      \n          (Kampung Boy #1)", "url": "http://www.goodreads.com/book/show/635606.Kampung_Boy", "average": 3.94, "cover": "https://images.gr-assets.com/books/1316727896l/635606.jpg", "reviews": 184, "authors": [{"url": "https://www.goodreads.com/author/show/342982.LAT_Mohammad_Nor_Khalid_", "name": "LAT (Mohammad Nor Khalid)"}], "type": ["Sequential Art", "Young Adult", "Sequential Art"], "outlinks": ["http://www.goodreads.com/book/show/635606.Kampung_Boy", "http://www.goodreads.com/book/show/21696742-kampung-boy", "http://www.goodreads.com/book/show/14740894-kampung-boy", "http://www.goodreads.com/book/show/19569462-kampung-boy", "http://www.goodreads.com/book/show/7078938-kampung-boy", "http://www.goodreads.com/book/show/1019723.Town_Boy", "http://www.goodreads.com/book/show/1595434.Mat_Som", "http://www.goodreads.com/book/show/635607.Kampung_Boy", "http://www.goodreads.com/book/show/1653712.Keluarga_Si_Mamat", "http://www.goodreads.com/book/show/814057.Lat_and_Gang", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}