{"ratings": 1038, "userreviews": [{"userName": "Lori", "userReviewDate": "Jun 04, 2010", "userURL": "http://www.goodreads.com/user/show/369169-lori", "userReview": "ARC from publisher/authorThis book surprised me. It sat there, all harmless looking, in it's brown and red and black design, with it's runaway drop of oil very nicely mirroring the Empire State building, creating an inky rorschach-like design.Now, I am certainly not above googling words when I struggle to spell them - and rorschach was one I definitely needed assistance with, so try to imagine the tiny little 'vibration' that coursed through me when I saw that rorschach was defined as \" a psychological test in which subjects' perceptions of inkblots are recorded and then analyzed using psychological interpretation, complex scientifically derived algorithms, or both.\"You don't get it yet, do you? Ok, let me explain. See, I knew what rorschach meant - I mean, I might not know how to spell it, but give me some credit here, you know! However, the word \"algorithms\", as it appears in the definition, hit me like a brick in the face. How absolutely fitting!!Teddy Wayne's main character, a NYC banking transplant from Qatar, creates a program that can predict the future rise and fall of the price of the oil ... using algorithms. Sweet! Right?!(Internal conversation with self: Wait, why is everyone staring at me like that? Ok, alright, I know. Calm down Lori, you're acting silly. Deep breaths. People are looking at you like you have just taken a swan dive off the deep end. They aren't going to understand completely unless they have read the book. So I have to find a way to get them to read it, right? To make them see? Don't I owe this to them? No. You don't. Yes. I do. I owe it to them. I must make them see! )If you are anything like me, you may walk right past this novel, never thinking twice about. A book about financial banking, starring a grammatically correct computer wiz who slaves over a program that can search the internet for key words like \"terrorism; terrorist; bomb; war\" and use them to accurately predict the price of oil in order to assist his company increase their net value - yawn - right?WRONG. Oh so very very wrong.This book is so much more than computer programing and oil prices. It's really about humanity, and taking chances, and making a fool out of yourself, and struggling to fit in, and standing up for what you believe in when it would be so much easier to just back down and give in.It really is amazing.Teddy Wayne, first time novelist, is a naturally humorous guy. He has been contributing to McSweeny's for many years, though I just recently discovered it, and his hilariousness shines through so naturally in Kapitoil.When we met at the Book Blogger Convention Reception in NYC back in May, he made a potentially awkward situation so wonderfully memorable as we joked about they way the internet, and its instantaneous access to everyone and everything, took what used to be viewed as a bad or socially unacceptable behavior (\"following people\") and turned it into a worldwide phenomenon that is now 100% acceptable, and sometimes even expected. \"Will you follow me?\" \"Why won't he follow me?\" \"I have 300 followers\".That conversation can translate into anything we say or do. The meaning of english words change and evolve as we tweak and adjust their use in our day to day lives. Which confuses the heck out Karim Issar - The shining star of Wayne's novel.He transfers from his position in Qatar to it's NYC branch, entering America in all it's ungrammatical glory in 1999. While this pre-9/11 story outlines the differences in religious, social, and work ethic habits of two very different cultures, it also brings to light the hilariously horrible ways we natives use and abuse the english language.Karim carries a voice recorder in his pocket in an attempt to enhance his understanding of english. Idioms confuse him. Incorrect application of grammar irks him. He has a very strange, stiff way of speaking, of which he is painfully aware, and so he documents new words and sayings and begins to use them liberally when speaking to coworkers and friends in an attempt to fit in. Of course, the more he tries to apply them, the more uncomfortable and humorous his interactions become.This novel really tickled my funny bone, and at times even hit home a bit harder than I anticipated. Working for a large company who believes very strongly in workplace diversity, I interact with associates who speak english as a second language on a daily basis. So some of Karim's frustrations and assumptions were familiar to me.Run, don't walk, to your nearest bookstore. Adopt a copy of Kapitoil now. Bring Karim and his kooky english into your home and into your life. You won't regret it. It may just become your Next Best Book too."}, {"userName": "Abby", "userReviewDate": "Apr 15, 2010", "userURL": "http://www.goodreads.com/user/show/2047758-abby", "userReview": "My friend Teddy wrote this book! And it's definitely a surreal experience to read a book written by a friend (this was my first time doing so), but probably the best compliment I can give is that I kept forgetting that Teddy was the author, because I was so caught up in the story itself. I read the book in one day, and I found myself thinking like the narrator even after I was done reading. The book seems fairly light when you read it, but it left a haunting feeling that stayed with me for a couple days. And I'm not the only fan-- Teddy's been getting rave reviews in The Huffington Post, Vanity Fair, and The Boston Globe!"}, {"userName": "Shawn Sorensen", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/1055942-shawn-sorensen", "userReview": "Kapitoil works best as a refreshingly non-sensationalistic look at American capitalism. This is a likeable book with a likeable main character, Karim, who is equal parts objective and open to the people he encounters in his brief fews months as a young financial genius working for a New York securities firm desperate for a profit boost. Karim invents a computer program that accurately predicts oil futures and makes his company, Schrub Equities, a ton of new cash. In a sad twist, the program is based on how violence and turmoil affect world oil prices and how to invest accordingly to rises and falls in stock prices. It would have been easy for Teddy Wayne to turn Karim into a cold-hearted monster, but he saves that for another character. The book follows the basic plot arc of The Reluctant Fundamentalist (another solid title) yet with a protagonist that reminded me of Data from Star Trek Next Generation. Which is where the book falters a bit. Karim isn't an android who will never fully understand humans. He is human, old enough to enjoy relationships and sex without instead describing them with the enthusiasm of a dusty textbook. His sparse first-person narrative keeps the book hopping along but leaves out a little emotional context and more opportunities for humor. Yet the book wins in the end with the very human, very compassionate decisions he makes, decisions that are surprising but logical at last thought. The prose here is understated - what this reader filled in made it a rewarding reading experience overall. I became interested in Kapitoil after seeing the author at a signing at Portland State University, where he was nervous, gracious and full of factoids. A lot like his main character - someone easy to pull for."}, {"userName": "Ensiform", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/3843117-ensiform", "userReview": "Karim Issar, a computer programmer from Qatar, joins the New York office of the conglomerate he works for, Schrub Equities, to fix the Y2K bug in their systems. Painfully aware of his uncertainties about many American idioms and cultural gaps, Karim tries to expand a social network in the city, despite Asperger’s-like tendencies to analyze everything in terms of efficiencies rather than emotions. On his own time, he develops a program called Kapitoil that very successfully tracks oil prices based on global unrest; this shoots him to the top at Schrub and leaves him time to develop a burgeoning relationship with a fellow programmer, Rebecca.This is a fine comic novel, full of sly wit. Karim’s fresh, often skewed yet perspicacious take on subjects ranging from clubbing to ironic humor to romantic relationships (“I was pretending not to pay attention to her, because people act according to supply-and-demand equilibrium like prices do”) to the lyrics of Leonard Cohen are amusing and poignant in equal measure. He’s quite sympathetic, so I was riveted as his potential paths beckoned, from potential “master of the universe” money-conscious urban d-bag to compassionate inventor and agent of change. That said, the book isn’t without flaws; Karim’s constant misuse of language (“vibrate” for “shake,” “enhanced” for “got better,” “delete” for “go away,” no matter what the context), gets stale and diminishes the book’s verisimilitude, as Karim is a very intelligent person and could quickly work out the subtleties of meaning based on circumstance. And although there’s nothing that rang false to me about Karim’s Qatari background, I heard more “college white boy” in his speech (as amusing as it was) than Arab. Indeed, Karim loses his Arab nature fairly quickly, falling into drinking, tolerance for gays, and sex early on without compunction, and it struck me that there’s little truly integral to the book about his being an Arab. With very minor tweaks, he could have been a genius programmer with Asperger’s from Iowa with a strict religious background and a shut-in father, and it wouldn’t have changed much. So I do question if Wayne achieved what he meant in making this a “pre-9/11” story about an Arab in New York. But overall it was a fun novel with fresh, appealing, assured prose."}, {"userName": "jess", "userReviewDate": "Mar 08, 2011", "userURL": "http://www.goodreads.com/user/show/670054-jess", "userReview": "This is the story of Karim Issar, who comes to the US from Qatar in 1999 to work as a computer programmer for a financial company in NYC. Karim was hired to help with the Y2K problem (heh, remember that?), but he invents a program that uses algorithms based on current events to predict fluctuations in oil commodities -- and invest/sell accordingly to make tons of money. This book was easy and fun to read, and I enjoyed reading it. But at the end I had this feeling like \"my god, was this written by a straight white American dude or WHAT?\" I don't know for sure that Teddy Wayne is actually a straight white American dude, I'm just saying that was my perception. It's an enjoyable read, but not profound or deep like I think it was supposed to be. I think some of the ways that the author tries to explore \"otherness\" are cloying, condescending and outrageous. The \"exploration\" of \"alienation\" through the \"idiosyncratic narrator\" would have been more interesting/effective if it hadn't been entirely based on the racial, language and religious alienation of someone from Qatar in a pretty xenophobic society. Sometimes people just don't get that, though.Maybe I have more thoughts on this, but I'm rushed. I liked what Sarah Manguso wrote about Kapitoil in the Morning News Tournament of Books here."}, {"userName": "Elaine", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/2352900-elaine", "userReview": "Holding aside my discomfort with the ventroliquism at the center of the novel (I can't help feeling it's \"OK\" to do things with Arabs that we wouldn't do with others -- e.g., how would we feel about a NYC white prep school/Harvard grad writing a comic novel about an immigrant from Asia who talked like Charlie Chan, or a poor black kid from the South who speaks in dialect), I also didn't care for the plot. The story's arc is heavily telegraphed from the very beginning, and watching the western businessmen turn out to be as diabolical as we expect they will be and the hero and his multi-culti outerborough friends as noble as we expect they will be wasn't that interesting. Also, the novel's verbal comic tics (bottlenecked, enhanced,vibrating, careless, stimulating etc.) are funny at the beginning but improbable and annoying by the end. Any self-taught genius (for such is our hero Karim) who studies idiom so carefully would quickly fix those problems. It's like Wayne came up with a list of ten words he thought it would be funny to have Kareem misuse and then he lazily peppers the book with them as frequently as possible, rather than thinking of new jokes or new situations."}, {"userName": "Maya Lang", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/930401-maya-lang", "userReview": "It's hard to read _Kapitoil_ without falling for Karim, the understated, memorable narrator who wins you over in his particular way. I found myself thinking about all things \"Karim-esque.\" This, of course, is a testament to the novel's success, that your own world feels slightly different as a result of a character you encounter. Karim's voice is executed perfectly, in a way that sheds light on contemporary America. New York in 1999 is captured through various lenses (technology, the economy, etc.), so that you feel a mirror has been held up to society at a particular (and fascinating) moment in time. This glimpse of ourselves is all the more poignant because it comes from someone on the outside looking in. Yet, thankfully, Karim isn't depicted in a predictable way; the sense of cultural clash is done with a light hand, and the question of what it means to be Muslim in America (for that matter, to be \"other\" in America) is handled deftly."}, {"userName": "Kyle", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/3680330-kyle", "userReview": "I picked this up because a blogger whose taste in books I respect recommended it. Karim may not be my new favorite character in recent reading, but I'm glad to have read his struggle.Karim's voice is unique and interesting, as an outsider to America and life, but an insider on programming and business. He knows his strengths and weaknesses to a fault, and we follow his story during a period of a few months at the end of 1999, when he is revolutionizing the oil futures market by writing a program that predicts prices based on bad news. He is intelligent and moreover torn between his past and a more compromised future.Wayne nails this character really well (which probably stems from his time spent editing foreign resumes), and there's a part of me that really loves decoding his sentences to find the meaning hidden in what shared meaning Karim gives our language. Some of the funnier parts of the book came from mixed definitions and connotations, and the phrases that Karim needs to have explained. Thankfully, Karim has done his studying before moving to America, so we're not left with \"Perfect Strangers,\" but it leaves me perplexed about some of the words and phrases that he just does not know or seem to get the hang of. I get why he doesn't get rid of some of his language because no one would bother to correct him or give him strange looks. Keeping \"stimulated\" for \"excited,\" however, just grated on me as one word that someone would probably fix pretty quickly, given usage and connotation. I can't imagine that Karim isn't assiduous enough to figure some of these things out, even if it adds to the humor overall. I feel like this is something that an editor should've refined.In fact, my biggest problems with the book are more about how it was edited and produced, moreso than the actual content and writing. I know this is his first novel, but the back cover reads like some of the resumes Wayne must've edited, with references to his schooling rather than, say, who he is as a person. Shouldn't I want to read his book because the concept and ideas hook me in and not because of who trained him? I think that was supposed to be fixed through the extended author interview and \"favorite books\" list in the appendix, but really? If I want to find out more about an author, I'm fully capable of searching the Internet. The \"Troubleshooting Guide\" in the back is tacked on and not even a joke representative of the rest of the book. Wayne is clearly a funny, intelligent guy from the writing between these griefs, and I have no idea why his editors allowed his novel to come off looking and sounding as though it belongs on the YA lit shelf.Also in desperate need to be eliminated are the many, many pop culture references. More than once, Karim comes in contact with media, as we are so frequently inundated with in America, but rather than just encountering them, I feel like Wayne piggybacks on some concepts and even does some post-modern metacriticism through Karim on some of the Steinbeck referenced. The music referenced gets some similar treatment, though not in the same vein. Karim does grow and change because of these encounters, but if the character isn't really strong enough to stand on its own without reminding us of other, more memorable characters, there's a problem there. Nothing should make me remember The Grapes of Wrath and put your book down to read that again. I feel like an editor should have at least noted that in the margins.All that said, Wayne is quick-witted and knows how to turn a phrase. He has a ridiculous amount of control of a sentence, and I'm hoping to see that evolve into a more refined work in his next novel. I'm glad Karim was such an interesting compromising character, someone who did end up growing and changing, becoming more human as he both rejected and embraced his past. Some phrases from the last few entries will stick with me for a while, and his voice definitely will. Wayne kept his story light while discussing some moderately heavy ideas, an interesting route that kept the whole thing from feeling too melodramatic, and, well, first-novel-ish. I'll be glad to see where he goes from here, and hopefully we won't need a resume to convince us to read his next book."}, {"userName": "Lianna", "userReviewDate": "Apr 01, 2010", "userURL": "http://www.goodreads.com/user/show/850181-lianna", "userReview": "Great book. Karim is an entertaining character whether he is buying a juicer or talking about computer programming. The plot lines about Kapitoil, life in Qatar, Mr. Schrub and the auxiliary characters are all very engaging but what kept me reading was Karim's evolving relationship with Rebecca. Kapitoil doesn't read like a first novel at all. I hope to see more from Teddy Wayne.----------------From the Giveaway description - \"Sometimes you do not truly observe something until you study it in reverse,\" writes Karim Issar upon arrival to New York City from Qatar in 1999. Fluent in numbers, logic, and business jargon yet often baffled by human connection, the young financial wizard soon creates a computer program named Kapitoil that predicts oil futures and reaps record profits for his company. At first an introspective loner adrift in New York's social scenes, he anchors himself to his legendary boss Derek Schrub and Rebecca, a sensitive, disillusioned colleague who may understand him better than he does himself. Her influence, and his father's disapproval of Karim's Americanization, cause him to question the moral implications of Kapitoil, moving him toward a decision that will determine his future, his firm's, and to whom—and where—his loyalties lie."}, {"userName": "spencer", "userReviewDate": "May 03, 2010", "userURL": "http://www.goodreads.com/user/show/24530-spencer", "userReview": "Outstanding debut. A simple stranger in a strange land story about Karim, an Islamic computer programmer from Qatar who is brought to New York by a financial firm to work on the Y2K bug. Through the wonders of literature he writes a computer program in a couple of weeks which continuously scans the Internet to make predictions about the oil futures market (one wonders if Wayne forgets what the Internet was like in 1999, as we are never told whether Karim still uses dial-up, or wether he prefers Hotbot over AltaVista). His program is noticed by the higher-ups at his firm, and he is quickly thrust into the upper echelons of Wall St. society. One of the real treasures of the book is how Wayne uses a time, a place, and a person to create a thrum of 9/11. Karim is one of the most likable characters I have come across: open-minded and respectful, with hardly a bad bone in his body, yet you can't help thinking as you read his asides whether someone placed into his shoes with a nastier view of the world might react. Lastly, this book flies -- if Wayne had included a dead body, this book could be mistaken for a thriller."}, {"userName": "Mishehu", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/18370648-mishehu", "userReview": "Hmmmm. Just finished this one. And its PS set of interviews w author etc., which PS gave an appreciable bump to my estimation of the book. In general, I thought it a fine read though not a great one. Booklist praises this novel as \"assured\". I'd agree. It's very assured and withal engaging. But assuredness, while arguably a necessary condition for novelistic quality, is -- I'd say -- not a sufficient one. There is much to admire in this novel, and I'd definitely read other books by its author. But this one left little impression in the end. Perhaps it's because the cover art and title primed me to expect a Gary Shteyngartian novel: edgy, absurd, edifying. I can't fault its author for failing to be a different author -- indeed I credit him for having, at so young an age, crafted so distinctive a writerly voice. But my expectations, embarking on this novel, lay elsewhere. And I confess they were a bit disappointed."}, {"userName": "Emily", "userReviewDate": "Mar 04, 2011", "userURL": "http://www.goodreads.com/user/show/166366-emily", "userReview": "Well here's another instance of a book I would have NEVER picked up on my own, but which in fact I quite liked. From the back cover synopsis I gleaned stuff about computers, money, oil, a middle eastern immigrant, so a bit out of my comfort zone. But this story isn't really about any of those things, well it is, but more fish out of water than anything. Because of his unsteady grasp of English the main character talks like an autistic person which provides for some hilarious moments but also some great critiques on American society. It was def a bit of a man-read too, and something I totally would recommend to my ficticious literary obsessed boyfriend!"}, {"userName": "Michael Yoon", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/2167620-michael-yoon", "userReview": "I spotted this book today at the library, having never heard of it, and decided on a whim to read the first page or two. Eight hours later - with a few interruptions for some work, some chores, dinner, bathing the kids, and putting them to sleep - I finished it, and I'm sorry that it's over. I can't remember the last time that happened."}, {"userName": "Kevin Adams", "userReviewDate": "Jun 22, 2010", "userURL": "http://www.goodreads.com/user/show/2355520-kevin-adams", "userReview": "A wonderful read and a brief glimpse into the mind and world of Karim Issar who comes to America for a job at Schrub Industries working on the Y2k computer issues. The novel is told in diary form in a perfectly told pre-9/11. What works is Wayne's spot on dialog and a interesting point of view on American culture. One of the year's best."}, {"userName": "Diana", "userReviewDate": "Mar 30, 2010", "userURL": "http://www.goodreads.com/user/show/1085672-diana", "userReview": "This is definitely my new favorite novel. I can't stop talking about it. If you liked The Curious Incident of the Dog in the Night-Time, or if you just like a unique first-person narrative, or a page-turner, or one of those novels that's packed with lines that light up the page, read this. It's amazing."}, {"userName": "Paul", "userReviewDate": "Jul 13, 2010", "userURL": "http://www.goodreads.com/user/show/3170113-paul", "userReview": "Charming story of self discovery. Narrated in an interesting fashion, with just enough twists to keep things interesting. Truly a \"Pre-9/11\" novel about New York, definitely worth reading, if you're looking for something more contemporary."}, {"userName": "Thing Two", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/3722823-thing-two", "userReview": "This book was great fun to read. I couldn't put it down. It's a mix of techy-thriller and love story in the form of a diary, about a man who's going to own the world before he's 30."}, {"userName": "Claire", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/1114474-claire", "userReview": "http://www.tkreviews.org/#/kapitoil/4...You might recognize Teddy Wayne’s name as a frequent contributor to the humor section of McSweeney’s Internet Tendency (and the author of two of my favorite short pieces from the site: “Feedback from James Joyce’s Submission of Ulysses to His Creative-Writing Workshop” and “Parallels Between My Living Through Two Years of Middle School and Two Terms of the Bush Presidency.”) According to the note in the back of his slightly-more-serious but just-as-wonderful debut novel Kapitoil (HarperCollins, $13.99), Wayne also moonlighted as a graduate-school application essay editor for international students applying to American business schools. After three years of inspiration from smoothing out mangled English syntax sprinkled with business jargon and technical terms, Wayne’s new novel’s main character emerged: a highly talented, earnest, and socially awkward young computer programmer from Qatar named Karim Issar, who navigates the cultural differences, corporate competition and difficulties of learning a second language in pre-9/11 New York. A cross between Netherland by Joseph O’Neill and A Concise Chinese-English Dictionary for Lovers by Xiaolu Guo, Kapitoil gives us both the immigrant experience in New York amidst the soullessness of Wall Street and the hilarious blunders and linguistic misunderstandings that are bound to happen when learning a new language. In Kapitoil’s opening scene, Karim is on a plane that descends over the New York skyline. We feel an unsettling déjà vu as buildings come into view, until we learn the World Trade Towers are still standing, the year is 1999, and Karim has been hired by Schrub Industries to work on preventing Y2K glitches. After working at Schrub for just a short time, Karim develops a program that will predict oil futures with algorithms based on news cycles, and his program, Kapitoil, quickly draws the attention of Schrub executives. While it is thrilling to see him get outrageous raises and a fancy office, we also see the sleazy and decadent social life of some of his Wall Street coworkers and the desperation of the executives who hope Kapitoil will help their troubled bottom line.Wayne’s choice to set his novel in pre-9/11 New York allows us to see how Karim can live in Manhattan without causing suspicion because of his Arab background. In this respect, it is refreshing to read about a time before the events of 9/11 and the atrocious decisions of the Bush Administration changed American attitudes toward Muslims. If my two previously mentioned favorite pieces of Wayne’s from McSweeney’s tell us anything about Kapitoil, they betray the author’s utter contempt for the Bush era, and the Ulysses piece reflects his experiences in writing workshops (Wayne graduated from the MFA program at Washington University in St. Louis, where he has also taught fiction and creative nonfiction). Attention to words, language, and humor is a major element of his character and plot in Kapitoil. The book is written in a diary format, and Karim carries a voice recorder in his pocket to diligently record words and phrases he doesn’t understand in order to look them up and define them end of each diary entry. For example, he notes “you was robbed = usage of incorrect second person to indicate unsound transaction” or “pre-game = drink alcohol in the apartment before external parties to reduce panicked feelings.” Kapitoil succeeds because we root for Karim and are charmed by his sincerity. Even with his careful attention to verb tense and his grammatical sharpness, he still says Karim-esque (defined in his journal as “representitive of Karim”) phrases like “I am stimulated” instead of “I am excited” or “muteness” for “silence.” The subtle humor in Kapitoil differs from the McSweeney’s writing, as Wayne says he wanted to “write a realist novel whose comedy derived from its humanity.” We are never laughing at Karim, we are completely on his side, and if anything, the best jokes make fun of the idiosyncrasies of the English language. Karim attempts learning English in the same way he approaches the world: with the analytic perfection of a brilliant computer programmer. As his plane prepares for landing he does a quick equation to determine the gas required to power the aircraft. When he plays racquetball he determines how many tennis balls could fit on the court. When confronted with a problem, he likes to break the situation down into points like a mathematical proof. As anyone who has tried to learn a foreign lauguage knows, cultural humor is often lost in translation, so Karim’s response is to diligently work on his jokes because it was recommended in a business manual. Because he approaches life so systematically and analytically, it is not surprising that at first, Karim doesn’t like Jackson Pollock’s paintings at the MoMA. But then he reads a quotation from Pollock—“I don’t use the accident—’cause I deny the accident.” Karim concludes, “possibly Pollock’s paintings have more value, because has a philosophy similar to mine, which is that life is ultimately predictable.” This concept is what guides his creation of Kapitoil, and Karim is reminded of Pollock when he examines the patterns in a mosque, the organization in a wine cellar, or when he is programming. But by the end, Karim’s naïve belief that everything can be predicted—whether by algorithms or chance—falls apart. His sister is in an accident and falls ill, co-workers are not completely trustworthy, and the seemingly kind and loyal actions of his boss turn sickeningly sinister. The message is that a Kapitoil formula cannot be applied to real life situations, just as logarathims on autopilot cannot make huge profits without consequences. Rebecca, Karim’s sensitive, disheartened coworker and romantic interest is a crucial guide to this conclusion. She and Karim listen to Bob Dylan, the Beatles, and Leonard Cohen and when he is troubled by the illogical phrase \"warehouse eyes\" in a John Lennon song, Rebecca replies, \"sometimes it's just about the sound.\" Always the optimist, Karim briefly hopes he can save their relationship with diligence and logic, but his sentiment is half hearted: “Rebecca and I were both intelligent problem solvers, and even though emotions and relationships were in many ways more complex than programs and mathematics equations, I had developed my skill set significantly in these area in the last few months. Possibly it could work.” While Karim learns that the complexities of life do not neatly fit into a computer program, he also learns from his mistakes: “It is like debugging a program: Sometimes you do not truly observe something until you study it in reverse.”For all my tidy conclusions, I enjoyed reading Kapitoil because Karim is not reduced to cliché or a caricture. He has a soul, a moral compass, and resists corruption. One of the lessons I personally took away from Kapitoil is that New York can change you—for better (as in Karim’s case because he realizes his true loyalities lie with his family) or for worse (Mr. Shraub’s obsession with capital gain turn him and his son into monsters). As Karim says, \"I remembered what Mr. Schrub said about how every day there are shifts so small you do not identify them, and finally you become a different person without even recognizing it.\"I’d like to think I’m more Karim-esque."}, {"userName": "Byrne", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/43993760-byrne", "userReview": "Writers are supposed to write what they know. Millions of people spend all day fiddling with numbers on screens, and yet the Great American White Collar Novel remains unwritten. Kapitoil is a good effort, though. Karim, the protagonist, is easy to get among with—there is usually a rule in fiction that anyone who lives in New York needs to be a colossal jerk or a tragic victim thereof. His narrator’s voice is distinctive without getting annoying, and it’s pitch-perfect Professional English-as-a-Second-Language. There were a couple things that detracted from the experience: - There’s a Chekhov’s Gun that doesn’t actually go off. (It’s not really a spoiler to say ‘note the detail in the first ten pages that’s obviously going to come up in the last ten pages.’)- While some of the nerd-isms were perfect (C++ and JavaScript are two of the most different languages that visually look alike), some of them failed—a true nerd would never misuse the law of supply and demand to imply that artificial scarcity shifted the demand curve. - The central plot conflict didn’t make sense to me just based on how employment contracts work. Still, I liked it. As one of those millions of people who spends all day manipulating numbers on screens, it feels good to be understood. This must be how doctors felt about The House of God."}, {"userName": "Lorenzo Berardi", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/183865-lorenzo-berardi", "userReview": "It's hard to find a single drop of oil in \"Kapitoil\", but this doesn't mean you shouldn't read this novel.Yes, I'm talking to you bankers, speculators, brokers, financial advisers, oligarchs, sheiks, Russian PMs and Iranian presidents, spin doctors, politicians, entrepreneurs, capitalists and anti-capitalists, environmentalists, exploited and exploiters of this world.I repeat: this book doesn't definitely smell of crude oil. No oil drums involved. No Brent Crude classification diagrams. No gas wells around. No black petroleum stains as bookmarks.I'm sorry Vladimir and Mahmoud.Al? Haven't you heard me? There's nothing for you here. And yet, Teddy Wayne's first novel is a pretty good one.Let's take the protagonist, Karim from Qatar (please pronounce it Cutter). Wayne made him an amazing character with a distinctive personality and a wonderful vocabulary, a geek with a heart, a wizard with a soul.Whereas contemporary authors like Mohsin Hamid or even Jonathan Safran Foer (yes!) had a similar extended use of monologue for their main characters, but ended up with a boring and unrealistic result, Wayne learned the lesson in a better way. Karim never annoys me. And I am able to understand his behavior, his peculiar logic, the way his moral probity and curiosity are both being challenged by New York City in A.D 1999.Do you remember all that fear for something called the Millennium Bug?That's it. Teddy Wayne did and does and he decided to backdate a novel which he could have easily tried to set up on 2010-2011 ten years earlier when NYC was unbroken: I found it an interesting choice. The cast of American characters surrounding Karim - a Qatariman in New York as Sting would put it - is chosen very well and highlights the story in a perfect and poignant way. Less appropriated are the two characters left behind in Doha, Karim's father and sister but Mr Wayne mostly keeps them hanging at the telephone. Surprisingly enough, I would label \"Kapitoil\" as a \"romantic novel\" if any label may be needed.Because at the end of the day it's Karim sentimental involvement for a workmate (how obvious! You would say. Well. perhaps. But it works) the main plot here.Yes, of course, there is a sharp criticism to the lack of morality of a certain top financial world caught before 9/11 and well before the crack of Lehman bros and all that came after. And there is also some math every now and then, but not the dry jargon you would expect in the mouth of a banker and a self-taught software engineer.Quoting Karim, he is very much \"the cream of the cream\" of a novel written with a clever and well-trained hand. Not a book to worship or one of the most brilliant novels of the last years, but quite certainly a smart, compelling and entertaining reading. And - ok, Al! I will tell them - this novel doesn't pollute the environment like all hydrocarbons do. Well done, Wayne! Don't walk away from this path."}, {"userName": "Greg Zimmerman", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/41665-greg-zimmerman", "userReview": "You might expect a character like Karim Issar, who corrects others' grammar, who doesn't get humor, whose language is sprinkled with techno-financial business geek speak, and who lays out his decision-making processes in painstaking, ultra-logical detail, to not be the most likable fellow you've ever read. But you'd be wrong — Karim is actually a wonderfully sympathetic, interesting character. And his story is equally sympathetic, interesting, and fun.Karim's story begins in the fall of 1999 with a cross-Atlantic flight, during which he makes up math problems to amuse himself. Karim is coming to American to work on the Y2K problem in the New York office of the investment company he'd worked for in Doha, Qatar. After a co-worker steals credit for a profitable program he develops, he's more cautious with his next endeavor: The Kapitoil program, which accurately predicts oil futures and makes his struggling company a crapload of cash.Meanwhile, Karim also explores the nightlife of New York, heading out to clubs, museums and parties with his clownish co-workers. Through an often painful (but fun to read) trial-and-error process, he slowly learns American etiquette on everything from one-night stands to interoffice crushes. Soon, circumstances force Karim into a tough choice regarding Kapitoil, and his traditional Qatari values collide with the possibility to make a ton of money for himself — but at a pretty hefty moral cost.It's a straightforward narrative, but Karim's voice and Wayne's writing are anything but. Karim's voice, as Wayne explains in the podcast above, is the result of Wayne's desire to write a novel with an idiosyncratic voice guiding the narrative as well as his want to use language to be disruptive— but in a good way, because Karim's false starts with language and violations of American etiquette make you cringe and laugh at the same time. And as Karim begins learning the ways of New York, the novel begins to move from a laugh-at-Karim, to now laughing-with-Karim dynamic. He slowly begins to \"get it\" and as his moral dilemma arrives, you're confident he's now equipped with the tools to make the right decision. But will he? If you're a fan hip, urban fiction, you'll dig this. If you enjoyed the way Jonathan Safran Foer wrote his character Alex in Everything is Illuminated — stilted, just-a-bit-off-English — you'll really enjoy Karim specifically but also the novel on the whole. It's a quick read and definitely one worth checking out, especially if you're someone (like me) who enjoys \"getting in on the ground floor\" of talented new novelists, like Mr. Wayne. But this isn't just some obscure novel from a writer you'll never hear from again — Teddy Wayne writes frequently for the New York Times (and many other pubs) and Kapitoil was blurbed by Jonathan Franzen and given a coveted \"starred review\" by both Publisher's Weekly and Booklist."}, {"userName": "Katie Parker", "userReviewDate": "Aug 15, 2011", "userURL": "http://www.goodreads.com/user/show/1731180-katie-parker", "userReview": "The year is 1999, and Karim Issar has just arrived in New York City from his native Qatar. He’s a “cream of the cream” programmer contracted to work on Schrub Equities’ Y2K project through the end of the year. (Side note: My mom was on the Y2K team for Seafirst Bank. I regrettably dressed as a Y2K bug for Halloween that year. I was 14.) Pretty soon, he starts devising programs that he thinks will be useful to the company, the culmination of which is Kapitoil. After realizing that current events have an effect on oil prices, he writes a program that downloads news articles of the day from the Internet and scans them for words like “terrorism” and “attack,” but also more subtle words like “bitter” and “weary,” which most people don’t consider. It then predicts whether the oil price will go up or down, allowing the company to capitalize on the change. After showing the program to his boss, he finds himself slingshot up near the top of the corporate ladder. Soon he’s dressing in expensive suits, being driven by a chauffeur, and spending time with the company’s CEO, Derek Schrub himself. But how long will it last, and at what cost?The characterization of Karim throughout the book was really well-done. The story is told through a series of diary entries, which are very “Karim-esque” (a term coined by one of his co-workers, meaning there are grammatical errors common for Karim, since he is foreign). Each entry ends with American slang or words and their meanings that he learned during the course of the entry, such as “Jackass = stupid person; Dan” and “shit-shower-shave = consecutive actions a man performs before a nightclub.” Though I don’t think it’s out-right disclosed, it’s safe to say that Karim has some form of autism. He mentions avoiding eye contact when he was younger, and he is very technical and factual in his writing and speech. He actually reminds me a lot of Alex, the Ukrainian translator in Jonathan Safran Foer’s Everything is Illuminated, who isn’t autistic, but has the a similarly stilted voice.I loved Karim’s interactions with his co-worker Rebecca, who was a good foil to his dry, straight-forward personality. The evolution of their relationship, from professional to romantic, was interesting to see unfold. She was understanding and patient with him when few others were (or would be), and I enjoyed seeing what they taught each other about their worlds.I was going to give this book four stars, but then I couldn’t think of a single bad thing about it, so I bumped it up to five. Highly recommended, especially for those who like Jonathan Safran Foer’s writing."}, {"userName": "Nick", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/901034-nick", "userReview": "(some spoilers)This book was recommended to me by a friend (thanks abby!) who is friends with the author. She described it as 'the pre-9/11 novel, capturing the angst and anxiety of Y2K global computer failings and the financial bubble burst'. And I don't disagree with her there, but the way I'd describe it... 'come for a y2k snapshot, stay for the human to human connection of two disparate people from two disparate backgrounds'. Yea, won't see that as a tagline...anywhere.Wayne's had his share of praise for development of the protagonist Karim Issar, a talented Qatr-born computer programmer/financial stock predictor/employee of a giant global investor/other professional job titles that I don't fully grasp. Basically, he writes computer programs using complex algorithms to predict oil futures and stock market data. Wayne has said he did not want to write a 9/11 novel and while I can appreciate that, there are some aspects of this novel that would have benefitted from further development. For example, Karim's uncomfortable assimilation from a life in Qatr to a New York stock trader's jet set lifestyle is illustrated with conversations with his father, still in Qatr, a traditionalist Muslim. They speak of bombings and U.S. interference of the region. I think if this was explored a little further, it would have better 'shown' a growing sense of distrust of the American people. These conversations and this aspect of the story seemed almost an afterthought, not wanting to delve too deeply into a controversial subject, not really knowing how to treat it. And I see where Wayne may have wanted to hold back there, but I found myself wanting more.Karim made a really interesting protagonist, his plight and so forth. But while Wayne went to great lengths to hilight the 'Karim-esque', sometimes Karim's perfect speech and grammar and grasp on complex mathematics made the Karim-esque seemed robotic-esque. His diction especially. But again, there's a challenge there to give a character who studies perfect English to better assimilate finding himself in a sea of business jargon and slang.The best aspect for me is the story of Rebecca, a New York typical 20 something experiencing ennui and self-doubt. Takes Zoloft, has a bad relationship with her father. I don't want to say 'first world problems' but very much different from Karim. Their romantic connection develops quite naturally and Wayne does well to bring them together in a sort of clumsy way you'd expect of two people with their respective backgrounds. This was my favorite part; how two people with nothing in common clumsily found their way into each others arms."}, {"userName": "lisa", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/2843706-lisa", "userReview": "this has got to be one of the most unique character pieces i’ve ever read! Karim’s idiosyncratic, techno-savvy character and his story will have you laughing out loud in Wayne’s excellent debut novel.\"Business manuals explain how valuable it is to have a sense of humor, so I am studying how others produce jokes, such as making a statement that is clearly the reverse of what you truly mean and using a tone of voice that indicates the reversal.\"in the months leading up to the turn of the century, we follow our number crunching protagonist Karim Assar, a brilliant programmer from Qatar, as he relocates to New York City to help Schrub Equities through the Y2K transition. while there, he develops a program that will predict oil futures, which he aptly names “Kapitoil”, and he finds himself in the predicament of owning the rights to a program that could make a few people very, very rich. as the big boss starts pressuring him to sell the program and Karim continues to navigate through his own social awkwardness, we are taken on the capitalist education and social exploration that becomes Karim’s life.the book is written through a series of Karim’s journal entries and always managed to make me laugh. the end of each entry has a list of new vocabulary words that he learned that day and was anything from slang to business terminology, but always entertaining and enlightening. Karim’s attempts to be social were always hilarious and his tendency to analyze everything made for both highly structured and entertaining reading that served as a brilliant satire on American capitalism.one other thing that this book does extremely well is to balance the American lifestyle with the Muslim religion. Karim is a faithful Muslim, living in New York City, which obviously carries a lot of weight these days, and though his moral compass is not perfect, he serves to act as the balance between two colliding worlds.this is one of those books that just thrums with a dry, witty energy that begs to be read and though it isn’t perfect, it is well worth the read. my only complaint was that Karim’s character made everyone else in the book seem rather two dimensional, particularly his boss and coworkers. but, really, altogether, this book was just too much fun to complain. highly recommended!"}, {"userName": "Jim Leffert", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/2735643-jim-leffert", "userReview": "A bright young man from Doha, Qatar, Karim Issar, comes to New York City in the period before 9/11 to do computer work for Schrub Equities, a prominent Wall Street firm. This entertaining, charming, and affecting novel presents Karim’s journal entries, in which he mangles the English language for a while (although he’s a diligent learner) and shares his discoveries as he attempts to navigate the work and social milieu and decipher the idioms of daily conversation. At the same time, Karim stays in touch with his beloved sister, Zahira, whom he feels responsible to guide and encourage. Karim, whose mother died of cancer, is alienated from his father and is concerned that his father, because of his patriarchal attitudes, will block Zahira’s aspirations to develop to her true potential. Karim’s humble job in the Schrub hierarchy is to reprogram computers to avoid the Y2K problem. In his spare time Karim develops a computer program, which he dubs Kapitoil, that predicts fluctuations in the price of oil. What will happen with this program, which is a potential bonanza for Schrub Equities, is the crux of the plot. Kapitoil, this author’s first novel, makes entertaining use of that age-old literary device, the stranger (from another land or planet) who tries to puzzle out strange customs and idioms that we take for granted. Karim is both similar to and different from H*Y*M*A*N K*A*P*L*A*N, to cite one prior example of this genre—similar in his approach to American vernacular but different in that with his sophistication and intelligence, he can challenge and question American society as much as it challenges and enthuses him. Romance and a moral dilemma involving the Kapitoil program enrich the story."}, {"userName": "Bookreaderljh", "userReviewDate": "Nov 26, 2013", "userURL": "http://www.goodreads.com/user/show/1632972-bookreaderljh", "userReview": "Throughout the first part of this book, I wasn't too thrilled with it. But the farther along in the story I went, the more I liked the book and - especially - the more I liked Karim, the narrator and main character. The book grew on me similarly to how Karim describes liking modern art - the whole doesn't look that spectacular but as you pay more attention to the details, more of the meaning evolves. Karim is a banker/computer geek from Qatar who is in the US on an internship with a large brokerage type company. He comes up with a computer program that very successful predicts oil futures based on the current news cycle. For him (at first) - this program is a chance for prestige, money and a chance to advance with this US company. And it does bring him all of those things. But it also exposes him to the dark underside of win at all costs, cutthroat competition as his boss tries to use him to keep control of this golden egg. Karim, though, is a good person - devoted to family and expanding his mind - and it is the story of how he may lose his innocence but never his ideals. At first - when each chapter ended with Karim's listing of new vocabulary words to enhance his English - it seemed like a gimmick. But as the book progresses, Karim's subtle humor takes over quite often and I found myself looking forward to his new definitions. His friendships with Rebecca and Barron are warmhearted but to get there, Karim makes his share of mistakes in a vain attempt to fit in. The ending may have been foregone from the beginning but by that time I wanted him to succeed on a deeper level - and he does."}, {"userName": "Brian", "userReviewDate": "Apr 08, 2010", "userURL": "http://www.goodreads.com/user/show/1778081-brian", "userReview": "I won this book as a first read from this site. Must admit, it feels pretty cool to get a book that isn't final and is still in the editing process.Overall, I found this book to be pretty funny and overall a great read. I work in the oil industry, and was hoping for a bit more expansion on the whole KapitOil platform that the main character Karim creates, but I can't really hold that against the author - most people would find that stuff incredibly boring.Kapitoil is less about oil and more about a young guy from Qatar, having no experience at all with the USA or its customs, trying to make his way in big business in NYC. I felt the author did a great job putting readers in the shoes of Karim as he kind of stumbled along figuring out how to fit in. After reading some of the other reviews, I realize I may be the only person who feels this way, but at some points I did think the author may have gone a bit too far with Karim's social awkwardness? I haven't experienced anything like Karim is going through, but at some points it felt like he may have been bordering on being autistic (some situations reminded me of how the main character in The Curious Incident of the Dog in the Nighttime handled things) or having a social disorder rather than just being unfamiliar with the customs of a foreign country. That aside, overall this is a pretty great book. Definitely recommend reading. It's a very quick read and thoroughly entertaining."}, {"userName": "Alex Yard", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/15957351-alex-yard", "userReview": "This book knocked me out of my chair. It was excellent, it was magical, it was real, it was heartbreaking. It really took me by surprise. It felt like a combination of Life of Pi, The Curious Incident of the Dog in the Night Time, and \"Girls\" (HBO). And yet far from being derivative it really shines and sings on its own merit. It almost sort of felt like a play. It lent itself well to reading it in 10-20 minute installments.Life of Pi, because the narration style is so well intentioned, earnest, innocent, and the main character seems to draw a balancing peace from his beliefs, even as he struggles to make sense of the world.Curious Incident because of the narrator's unique perspective on visuals, social interactions and processing human feelings.Girls because it's right in the thick of NYC, youngish folks living the so called dream, trying to make sense of it all, navigating the fast moving corporate world, the night life, the streets, the subways.No spoilers here, but the ending really sort of snuck up on me and felt so totally right and yet was super heartbreaking and it sort of stunned me when it happened and then when I contemplated it the next morning while making breakfast I said \"Wait, hold on now\" and I truly processed it and then later that day at work I was at my desk and I thought about it more and thought about how it shared similarities/sentiments with recent events in my own life and I started to cry."}, {"userName": "Patrick", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/969931-patrick", "userReview": "This was a very good book about a muslim computer wiz who is brought from Qatar to America by a financial company to get its computers ready for the switch from 1999 to 2000. Just being reminded of how that was supposed to be a huge catastrophe for all the computers of the world was an interesting background for the story. Its interesting how what can be hyped up as a potential major calamity can be almost completely forgotten 10 years later. However, the book does not delve too deeply into this aspect. Instead, it is made up of the main character's journal entries that deal with his emotional state. The main character, Karim, designs a computer program that predicts oil futures and makes his company a lot of money. This opens many doors for Karim and allows him to see many different aspects of American culture. Basically the book revolves around Karim Issar, a devout muslim, and how he deals with American culture. Karim is caught between his islamic roots, and the glitzy world of Wall St in 1999. It is a very interesting view into the America of that time. The book, although written in the past year, takes place before 9/11. Its interesting to see the difference in how islam is treated by other characters in the novel. Unlike today, in no way is Karim ever demonized. However, it is quaintly funny how little the americans in the book know about islam. Karim is a very entertaining character with the insightful views of a true outsider about american culture."}, {"userName": "Joe Krudys", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/5443661-joe-krudys", "userReview": "I read this book because of the 2010 recommendation from Jonathan Franzen in the Daily Beast, which I actually just stumbled across recently.I really enjoyed this book for its story, but even more so because of the characters that I felt Teddy Wayne developed so well. Karim was extremely likable and I felt really invested in his navigation of a foreign territory, being America in general, and more closely its corporate practices in the financial industry. I also enjoyed watching Rebecca navigate her own foreign territory, namely her relationship with Karim.I appreciated the underlying theme that in life, things can change you in small, imperceptible ways, and if you let them continue to change you in these ways over a long period of time, you may end up one day realizing you have become a completely different person than you once were, corrupted, and unlikable to both yourself and others. It's how we deal with the small moments as they happen, head on, to hopefully preserve our dignity and sense of self.Finally, I was also pleased with the end of the book. I have a problem with a certain type of ending to books, and this one was not a disappointment. When I spend considerable time wondering what the future holds for what I have to remember to keep telling myself are fictional characters, I know that the author hooked me effectively."}], "description": "“Sometimes you do not truly observe something until you study it in reverse,” writes Karim Issar upon arrival to New York City from Qatar in 1999. Fluent in numbers, logic, and business jargon yet often baffled by human connection, the young financial wizard soon creates a computer program named Kapitoil that predicts oil futures and reaps record profits for his company.At first an introspective loner adrift in New York’s social scenes, he anchors himself to his legendary boss Derek Schrub and Rebecca, a sensitive, disillusioned colleague who may understand him better than he does himself. Her influence, and his father’s disapproval of Karim’s Americanization, cause him to question the moral implications of Kapitoil, moving him toward a decision that will determine his future, his firm’s, and to whom—and where—his loyalties lie.", "title": "Kapitoil", "url": "https://www.goodreads.com/book/show/6579192-kapitoil", "average": 3.77, "cover": "https://images.gr-assets.com/books/1269005343l/6579192.jpg", "reviews": 194, "authors": [{"url": "https://www.goodreads.com/author/show/2973252.Teddy_Wayne", "name": "Teddy Wayne"}], "type": ["Fiction", "Contemporary", "Novels", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/6579192-kapitoil", "http://www.goodreads.com/book/show/8795202-kapitoil", "http://www.goodreads.com/book/show/15803175-the-love-song-of-jonny-valentine", "http://www.goodreads.com/book/show/27276325-loner", "http://www.goodreads.com/book/show/21070079-gradesaver-tm-classicnotes-jane-eyre", "http://www.goodreads.com/book/show/17728612-simon-schuster-2013-fiction-sampler", "http://www.goodreads.com/book/show/34840272-gradesaver-tm-classicnotes"]}