{"ratings": 253, "userreviews": [{"userName": "David Brenner", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/4367280-david-brenner", "userReview": "Given modern culture's leanings towards \"political correctness\" and the constant discourse between the \"freedom of speech\" and the \"right to offend,\" I found myself searching for a book that explores this topic. These essays held my interest from the title's Inquisition allusion to the closing words. Jonathan Rauch defends free thought by dissecting numerous case studies on the attack of free speech. He frames his argument as a defense of liberal science and dives into this defense through the context of epistemology, a topic I was not very familiar with before reading this book. I found myself highlighting quotes and passages every 5-10 pages or so and the book answered many of the questions/internal debates I had on the topic. However, I am still conflicted when it comes to the interaction of free speech and economic decisions. I agree with most every argument in favor of liberal science's defense of thought, but I feel the \"vote with your pocketbook\" idea is at odds with the argument to never punish someone for their ideas. This conflict is not explored within the book, at least to my satisfaction. Still, it is an excellently written book and worth a read if the topic interests you."}, {"userName": "Sandra", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/7133444-sandra", "userReview": "This is a gem of a book. It is the most thorough and well argued stance in favor of free speech I have so far encountered. Originally published in 1993, it is still completely relevant, probably, as they say, more than ever. It is very easy to lose oneself in the daily tweety outrages that have been reaching ridiculous proportions lately. Jonathan Rauch's book managed to put both my thinking about the world, and my half baked intuitions about what is right and what is absolutely essential, in order, and infuse them with rationality and calmness and even kindness. This is not to say that I managed to separate myself from the pessimistic side - at best, my belief is that it will get (much) worse before it gets better, and if."}, {"userName": "Peter", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/9912047-peter", "userReview": "This book was strong - I would recommend it to anyone, and despite being written 25 years ago (the book was originally penned in 1993), the book felt critically relevant. Ostensively about free speech, the book is probably more appropriately viewed through an epistemic lens, with Rauch viewing epistemology as deeply intertwined with politics. His crisp language cuts deeply at the core of questions that remain relevant to this day: does the identity of a speaker tarnish the validity of that speech? How do we maintain our right to fight against ideas we find repugnant without suppression and censorship? Who has the right to bless speech, and with it, the ideas that we find acceptable in polite society?Overall, the book was well worth the read. Quick and to the point, it was a solid primer on epistemology and made me think a lot about how I adjudicate truth in my own life. The crux of this book is highlighted in the quote below, and we would do well to think hard about where we fall on the spectrum:\"What should be society’s principle for raising and settling differences of opinion? In other words, what is the right way, or at least the best way, to make decisions as to who is right (thus having knowledge) and who is wrong (thus having mere opinion)?To the central question of how to sort true beliefs from the “lunatic” ones, here are five answers, five decision-making principles—not the only principles by any means, but the most important contenders right now:- The Fundamentalist Principle: Those who know the truth should decide who is right.- The Simple Egalitarian Principle: All sincere persons’ beliefs have equal claims to respect.- The Radical Egalitarian Principle: Like the simple egalitarian principle, but the beliefs of persons in historically oppressed classes or groups get special consideration.- The Humanitarian Principle: Any of the above, but with the condition that the first priority be to cause no hurt.- The Liberal Principle: Checking of each by each through public criticism is the only legitimate way to decide who is right.The argument of this book is that the last principle is the only one which is acceptable, but that it is now losing ground to the others, and that this development is extremely dangerous. Impelled by the notions that science is oppression and criticism is violence, the central regulation of debate and inquiry is returning to respectability — this time in a humanitarian disguise."}, {"userName": "Wendi", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/974110-wendi", "userReview": "By page 4 I was already enthralled: \"A very dangerous principle is now being established as a social right: Thou shall not hurt others with words. This principle is a menace -and not just to civil liberties. At bottom it threatens liberal inquiry -that is, science itself....in English we have a word for the empanelment of tribunals--public or private, but in any case prestigious and powerful--to identify and penalize false and socially dangerous opinions...The word has been out of general use for many years. It is 'inquisition'\".I want to mark up, highlight, make signage of so many quotes from this book!And then it nosedives into obscure, philosophy. I tried, I really tried but real situations and direct writing does not resume until the very last chapter and by then I was mentally exhausted. Disappointed."}, {"userName": "Max Nova", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/6169728-max-nova", "userReview": "Jonathan Rauch forcefully defends freedom of speech and liberal science in his short and crisp \"Kindly Inquisitors: The New Attacks on Free Thought\". Originally published in 1993, the book is even more relevant today than it was back then, resulting in an expanded edition in 2013. With brisk and efficient clarity, Rauch exposes the authoritarian intellectual underpinnings of the nominally liberal thought police that hold sway over America's universities. He goes further and argues that these initiatives - although carried out with the best of intentions - pose a grave danger to the very foundations of the liberal system. Ultimately, he says, \"The answer to the question “Why tolerate hateful or misguided opinions?” has been the same ever since Plato unveiled his ghastly utopia: because the alternative is worse.\"The book's tone is captured nicely by one of Rauch's incendiary passages:If you are inclined to equate verbal offense with physical violence, think again about the logic of your position. If hurtful opinions are violence, then painful criticism is violence. In other words, on the humanitarian premise, science itself is a form of violence. What do you do about violence? You establish policing authorities — public or private — to stop it and to punish the perpetrators. You set up authorities empowered to weed out hurtful ideas and speech. In other words: an inquisition... It is bad enough to have to remind people that there is no right not to be offended, and that criticism is not the same as violence. It is deeply embarrassing to have to deliver this reminder to people at the center of American intellectual life.The core of Rauch's argument is that \"Epistemology — one’s view of who can have knowledge and when — is politics.\" That line could very well be the tagline for my 2017 reading theme on the integrity of Western science. This book gifted me a clear statement of how all of the philosophy of science reading I've been doing relates to larger political questions. Rauch has an explicitly Popperian view on the philosophy of science: \"you may claim that a statement is established as knowledge only if it can be debunked, in principle, and only insofar as it withstands attempts to debunk it.\" For Rauch, skepticism and empricism are the pillars of the liberal system. I'm a bit concerned about how his overall argument holds up in the face of the holes that the modern philospher Godfrey-Smith pokes in Popper's theories, but to be fair, none of the critiques of free speech that I've ever heard have contested Popperian epistemology!The book is full of little gems like those above - sentences that crystallize ideas that have been amorphously floating around in my brain all year. Rauch writes beautifully, tracing the genealogy of liberal thought and synthesizing millenia of Western history to make the case for why we must prevent restrictions on free speech and free thought. He recoils in horror from Plato's intellectually authoritarian regime. He rejoices in the skepticism of Montaigne. He whips us through a tour of major Enlightenment philosophers and ends with our good friend Sir Karl Popper.Rauch then extends our intellectual journey up to the controversy over Salman Rushdie's \"The Satanic Verses\". Rushdie's searingly controversial novel earned him a big target on his back - in the form of a fatwa issued by Ayatollah Khomeini in Iran. For Rauch, this represented a defining moment in Western intellectual history:It showed how readily Westerners could be backed away from a fundamental principle of intellectual liberalism, namely that there is nothing whatever wrong with offending — hurting people’s feelings — in pursuit of truth. That principle seemed to have been displaced by a belief in the right not to be offended, which was quickly gaining currency in America.Rauch covers an astonishing amount of ground in this book and I felt like I highlighted about half the book as I tore through it. His principled, clearly argued position on free speech was just the antidote I needed for the philosophical morass I got sucked into during undergrad. I'll close with another one of my favorite quotes - some practical advice for free-speech campaigners in the hostile territory of the modern academic postmodern left:The standard answer to people who say they are offended should be: “Is there any casualty other than your feelings? Are you or others being threatened with violence or vandalism? No? Then it’s a shame your feelings are hurt, but that’s too bad. You’ll live.” If one is going to enjoy the benefits of living in a liberal society without being shamelessly hypocritical, one must try to be thick-skinned, since the way we make knowledge is by rubbing against one another.Full review and highlights at https://books.max-nova.com/kindly-inquisitors"}, {"userName": "Sabin", "userReviewDate": "Nov 19, 2016", "userURL": "http://www.goodreads.com/user/show/16080726-sabin", "userReview": "1993: \"[...] homosexuals, like all minorities, stand to lose far more than they win from measures regulating knowledge or debate. Today, true, the regulators may take gay people's side. But the wheel will turn, and the majority will reassert itself, and, when the inquisitorial machinery is turned against them, homosexuals will rue the day they helped set it up.\"2016: \"Make America great again!\"Jonathan Rauch's essay in defence of liberalism in all its forms, free thought, free speech, democracy and capitalism feels now, sadly, like a timely warning which has gone unnoticed while it had the political power of a warning. Now it can be read as a justification of the status quo. The repressed, be they minorities or the majority, reassert themselves and turn on those who they see as their inquisitors.The attack directed against censorship and the limitation of free speech is powerful, very sharp and single-mindedly focused on this single aspect. He does not take into consideration the difference between verbally abusing a person and dismantling that person's ideas or beliefs with arguments. However, he does make a distinction, in the afterword, between verbal attacks on abstract thing, which he sais are grouped by Karl Popper in World Three, and other types of attacks, on feelings and persons.This book makes a compelling argument of favour of liberalism, and a reminder of the dangers which lurk behind any intention of limiting it. No conflict of ideas is won by suppressing one side or another, but only by convincing arguments and proofs."}, {"userName": "Manuel Crespo-Rodríguez", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/7955749-manuel-crespo-rodr-guez", "userReview": "Written over 25 years ago, this book becomes relevant in today's political and social climate. In some ways the book turned out prophetic. What some people started seeing after the 2014. Gamergate controversy, this author saw coming long ago. Although we were conscious of people of faith getting offended by facts or opinions (namely those thing concerning blasphemy, like drawing cartoons that get islamists triggered), today we see the liberal side of politics and society canibilizing itself with ideological misguidedness of controling speech.This work, oldish as it may seem, is relevant to keep in check today's thought police. Doubleplusgood!"}, {"userName": "Jason Ross", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/11909941-jason-ross", "userReview": "Jonathan Rauch responds to a series of modern threats to free speech, including the fatwa against Salman Rushdie (not to mention more recent threats and executions against critics of Islam or Muhammad), laws in Europe punishing \"deniers\" of the Holocaust, and campus speech codes prohibiting words or statements that may cause offense to select groups. His title is partly inapt. For one, the reference to the Inquisition correctly points to the quasi-religious fanaticism of these various zealots, but there is nothing at all kindly about these fanatics who regularly resort to threats - even overt acts - of force and violence. More, his argument is less focused on these inquisitors than on defining and defending the revolutionary system of \"liberal science\" that these inquisitors are bent on undermining and destroying. In defining this modern liberal social system, Rauch (undoubtedly unawares) inverts the Straussian narrative of a declension from the philosophic virtue of the ancients to the low and base world of the moderns. Rauch's arch-enemy and archetypal foe is Plato, whom Rauch identifies as the original totalitarian, a would-be philosopher King who endorsed force and fraud as foundations for his utopian system. Giving Socrates his due as a model of (proto-liberal) intellectual humility, Rauch appreciates the temptations of the Platonic utopian ideal, but presents that utopian vision as being built on the false presumption that there is a Truth that the human mind can access. As Rauch puts it, \"Diversity, of belief, thought, opinion, experience, is a fact, like it or not.\" Whereas a Plato - and various fundamentalists and totalitarians since - sought to remove diversity of thought, along with the social strife which accompanies diversity, Rauch sees the liberal social system as grounded in the acceptance of a multiplicity and diversity of perspectives as an inescapable feature of human society. Departing from Plato, and tracing through the modern skepticism of Descartes, Montaigne, and Hume, Rauch identifies a connecting thread that he defines as the principle of \"public criticism\". This means that no one gets the final say on any matter, and no one has personal authority. Put differently, this principle accepts the skeptic's despondency at knowing the inability of knowing, and asserts that henceforth anything worthy of being called knowledge must be tested publicly. Rauch rightly sees this principle as radical (and democratic) in nature. He unpacks the revolutionary character of this principle in the (again) inaptly named chapter \"The Politics of Liberal Science\". This chapter addresses the theme of \"'order without authority' [which] might be taken as the motto both of political liberalism and of science.\" And though he points to Locke's political project - including the principles of consent, constitutionalism, and toleration - he leaves that political project aside, contending that \"the most intimate connection between members of the liberal constellation is also the least appreciated: the connection between democracy and science.\" He points also to markets here but does not develop the connection, content to argue that in addition to modern institutions of political liberalism and capitalism, both of which operate on the principles of public criticism, there is also the institution of liberal science, which is not simply our way of producing academic research but is our way of producing useful social knowledge. He presents liberal science as a \"game\" or an activity bounded by the rules of public criticism. Though he does discuss scientific activity in the academic world his interest is more in terms of political culture. Against \"fundamentalist\" and \"humanitarian\" challenges - the former of which (to put words in his mouth) asserts an objective Truth, and the latter of which asserts the inviolable Truth of subjectivity - Rauch argues, \"The genius of liberal science lies not in doing away with dogma and prejudice; it lies in /channeling/ dogma and prejudice - making them socially productive.\" Continuing, Rauch argues \"Biases and prejudices make us human and give us sparkle to our minds. What is to be condemned is not bias but /unchecked/ bias. The point of liberal science is not to be unprejudiced (which is impossible); the point is to recognize that your own bias might be wrong and submit it to public checking by people who believe differently.\"Against fundamentalists, Rauch rejects the notion that the liberal mode of knowing must grant equal time to every belief. Not simply is that impossible, it rejects the principle of public criticism, which may allow personal beliefs (conscience) to exist unmolested but which expects claims of knowledge to pass through stringent critique and examination. Against humanitarians - those who assert the inviolability of individual feelings against human prejudices and biases - Rauch says, in effect, toughen up. Words may indeed wound, but they do not wound like bullets do. Humanitarian critics of the liberal intellectual system must acknowledge the advantages that system brings, and reject the temptation to deny the biases of others - or impose their own prejudices - by force. That way leads to totalitarianism. Rauch's book is both energizing and frustrating. It offers a zealous defense of an intellectual position that rejects zealotry. At the same time, it feels as if it were written in a polemicist's haste and not with the length or precision that the topic deserves. In particular, it doesn't disentangle some of the differences between the liberal intellectual system and the liberal economic and political systems, especially with regard to the types of expertise that are necessary to enter academic scientific fields as compared to the negligible barriers to entry into democratic citizenship and into the marketplace. It also overlooks any particularly American or Madisonian contributions to this intellectual system. Rauch wants to go beyond constitutionalism to epistemology, but he overlooks opportunities to present a uniquely democratic and American response to the problem of who can rule and who can possess authoritative knowledge. But this is an important book, which deserves to be read by a broad audience."}, {"userName": "Noah Graham", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/57539558-noah-graham", "userReview": "I can't see the books market. Intelligent people who like free speech would already be aware of all the ideas it brings up. Stupid people who like free search prefer YouTube videos with cartoons images to large amounts of text. People who hate free speech will be offended by the book.  But I guess similar objections could be brought to bare on most books about political or cultural issues with \"free speech \"changed to X."}, {"userName": "Cynthia Frazer", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/5922824-cynthia-frazer", "userReview": "Most enlightening thing I can remember reading, EVER. It realigned my thinking several times."}, {"userName": "Noah Milstein", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/19092613-noah-milstein", "userReview": "A modern On Liberty. An absolute must read for all who love liberty."}, {"userName": "Thorkell Ottarsson", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/72372247-thorkell-ottarsson", "userReview": "Amazing book. Even more relevant today, more than 20 years since it was written."}, {"userName": "Matt", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/11440935-matt", "userReview": "The right to not be offended does not and cannot exist in a free society. That is the main premise of this book. False, offensive and hateful speech should not be silenced, but refuted."}, {"userName": "Patricia Kitto", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/17350732-patricia-kitto", "userReview": "While this book raised some interesting and thought provoking points, it was exceptionally repetitive and relied too much on anecdotal evidence. It would have been a fabulous \"long read\" essay."}, {"userName": "Sean", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/297798-sean", "userReview": "This a sharp, concise, and well-argued book. The author's contention is that efforts to create a public debate environment, where no one is offended and all views are given equal respect, are well-intentioned but very misguided. He argues convincingly that such efforts, which increasingly take the form of speech codes and various laws in Western civilization, serve only to stifle debate and prevent certain ideas from receiving rigorous scrutiny.Here is a particularly potent passage that nicely captures the essence of the book:Somehow the idea has grown up that \"liberal\" means \"nice\", that the liberal intellectual system fosters sensitivity, toleration, self-esteem, the rejection of prejudice and bias. That impression is misguided. The truth is that liberal science demands discipline as well as license, and to those who reject or flout its rules, it can be cruel. It excludes and restricts as well as tolerates. It thrives on prejudice no less than on cool detachment. It does not give a damn about your feelings and happily tramples them in the name of finding truth. It allows and--here we should be honest--sometimes encourages offense. Self-esteem, sensitivity, respect for others' beliefs, renunciation of prejudice are all good as far as they go. But as primary social goals they are incompatible with the peaceful and productive advancement of human knowledge. To advance knowledge, we must all sometimes suffer. Worse than that, we must inflict suffering on others.In this regard, the author has much in common with John Stuart Mill. The only weakness of the book is that the author could have conducted a more detailed documentation of how efforts to stifle speech are manifesting themselves in the U.S. and provide an assessment of whether these efforts have gotten worse, since he first published the book back in 1993."}, {"userName": "Sharad Pandian", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/28777221-sharad-pandian", "userReview": "It's a 200 pages of fairly dull arguments that present a binary choice: either you support the system of \"liberal science,\" marked by equal standing and a critical stance, or you oppose it. While Rauch's use of history makes it a good read, the actual analysis and argument tend to rely on hand-wavy generalizations and buzzwords. For instance, he points out that to be a good liberal is to admit to fallibilism, the stance that we can always be wrong. But he doesn't quite address the tension this creates: If I believe something and am a liberal, how can I hold that something is true? How serious should I take the idea that I could be wrong? Without delving into the specifics about this, the account seems to provide more buzzwords than substance.The book isn't without its moments of insight, especially when Rauch draws on his own experience of being gay and Jewish to talk about related issues (like hate speech and holocaust denial), but apart from these the book comes off largely as but sterile."}, {"userName": "Martin", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/5717592-martin", "userReview": "A very smart friend told me to read this book. When very smart friends do that, I listen. I was rewarded for my obeisance. The book actually contained revelations to scores of questions I had on the broad topic and several of its particulars. The 2nd chapter was the most eye-opening for me of all: a philosophical treatise on how we know what is correct and right and what is incorrect and wrong. It whetted my appetite for more philosophy and to revisit the philosophy books that I put down when I was younger, to wait for some personal maturity before I could retackle them. I can't give it the full 5 stars though, because even though I find his overall opinion to be absolutely correct, it is nevertheless appropriate to practice some tact with what emanates from our mouths. I don't feel it should be a free-for-all. There is discretion in life."}, {"userName": "James Mersol", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/30737781-james-mersol", "userReview": "I've read a lot of books talking about modern threats to free speech, especially on college campuses, but what makes Rauch's book special is that it's timeless. He cites some specific examples - the fatwa on Salman Rushdie following The Satanic Verses, the debate between creationism and evolution - but these serve a larger purpose. Namely, he seeks to prove that liberal science is the best way to advance knowledge. We may seek to ban certain viewpoints based on fundamentalist or egalitarian claims, but in the end, Rauch argues, nobody has a special claim to truth. He's good at pointing out that some of these threats seem harmless at first, but he's even better at explaining why these threats hurt what we want much more than they could ever help. Buy this book, read it, and think about it. I would make it required reading for colleges nationwide if I could."}, {"userName": "Eduardo", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/4645281-eduardo", "userReview": "The highest tribute I can pay to this book is that it is still stuck in my craw days after finishing. I can't get it to resolve, meaning that I embrace Rauch's ideas and philosophy but I can't create the discussions required in my mind. I have no trouble with Rauch's rules of \"no final say\" and \"no special authority\", which I think are excellent. But I must think too poorly either of my fellow humans or of myself because I don't know if I can convince others to abide by those rules when it comes to personally significant matters. This, then, is the ultimate challenge of the book, to hold onto those rules more tightly than one's beliefs. May we be willing to accept that challenge."}, {"userName": "Robert", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/28296553-robert", "userReview": "This is the best book I have read on the necessity of freedom of expression. It is not a \"law\" book, but instead is a lucid explanation of why we must protect even hateful, silly, or seemingly worthless speech if we are to have a system that provides the best test of truth. Some expression contributes to the marketplace of ideas by serving primarily as a bad example. This book is a must read for anyone who cares about this issue."}, {"userName": "Daniel DeLappe", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/2148726-daniel-delappe", "userReview": "Anyone who gives one shit about the First Amendment needs to read this book. It is being battered by both sides. The best example is the group of people at Harvard that were offended that a professor had to point out to them the 14th Amendment. They were basically offended that their ignorance was pointed out. They had been accepted to Harvard for shits sake. Wake up and smarten up. Read a good history on the author. Very fascinating life"}, {"userName": "Scott", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/8850856-scott", "userReview": "Extraordinary. Possibly one of the best books I've ever read, and certainly the best argument I've ever read. Ferociously argued and cogently written. This does not deserve the relative obscurity it has fallen into. If any piece of writing on the nature and point of science deserves to be required reading for those entering higher education, it is this one."}, {"userName": "Mitch", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/1732517-mitch", "userReview": "Excellent argument on the dangers of prohibiting offense during the creation of knowledge and investigation of truth."}, {"userName": "Jimmy", "userReviewDate": "Jan 15, 2010", "userURL": "http://www.goodreads.com/user/show/3152421-jimmy", "userReview": "Great book on thinking"}, {"userName": "Karl", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/2959023-karl", "userReview": "A very worthwhile read on free discourse and the ideologies that attack it (I actually read it a few times, back-to-back)."}, {"userName": "BasementBoi BasementBoi", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/11165252-basementboi-basementboi", "userReview": "Excellent book."}, {"userName": "Eugene Spagnuolo", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/46458565-eugene-spagnuolo", "userReview": "One of those books that change how you see the world."}, {"userName": "Lennyag", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/8927974-lennyag", "userReview": "Changed and corrected my views of free speech forever!"}, {"userName": "Harvey", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/1785987-harvey", "userReview": "This book should be required reading for every high school student. If I was a book highlighter I would have gone through several."}, {"userName": "Justin Clark", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/36916134-justin-clark", "userReview": "An excellent defense of free speech and a free society. A must read after the Charlie Hebdo attacks."}], "description": "Tracing attacks on free speech from Plato's Republic to America's campuses and newsrooms, Jonathan Rauch provides an engaging and provocative attack on those who would limit free thought by restricting free speech. Rauch explores how the system for producing knowledge works in a liberal society, and why it has now become the object of a powerful ideological attack. Moving beyond the First Amendment, he defends the morality, rather than the legality, of an intellectual regime that relies on unfettered and often hurtful criticism. Kindly Inquisitors is a refreshing and vibrant essay, casting a provocative light on the raging debates over political correctness and multiculturalism.\"Fiercely argued. . . . What sets his study apart is his attempt to situate recent developments in a long-range historical perspective and to defend the system of free intellectual inquiry as a socially productive method of channeling prejudice.\"—Michiko Kakutani, New York Times\"Like no other, this book restates the core of our freedom and demonstrates how great, and disregarded, the peril to that freedom has become.\"—Joseph Coates, Chicago Tribune\"The philosophical defense of free speech and free thought that seems to have been forgotten. . . . A powerful argument.\"—Diane Ravitch, Wall Street Journal", "title": "Kindly Inquisitors: The New Attacks on Free Thought", "url": "http://www.goodreads.com/book/show/703086.Kindly_Inquisitors", "average": 4.41, "cover": "https://images.gr-assets.com/books/1328872571l/703086.jpg", "reviews": 33, "authors": [{"url": "https://www.goodreads.com/author/show/375205.Jonathan_Rauch", "name": "Jonathan  Rauch"}], "type": ["Philosophy", "Politics", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/703086.Kindly_Inquisitors", "http://www.goodreads.com/book/show/1114019.Kindly_Inquisitors", "http://www.goodreads.com/book/show/18527022-kindly-inquisitors", "http://www.goodreads.com/book/show/18877713-kindly-inquisitors", "http://www.goodreads.com/book/show/32847164-kindly-inquisitors", "http://www.goodreads.com/book/show/25460177-political-realism", "http://www.goodreads.com/book/show/17906607-denial", "http://www.goodreads.com/book/show/754738.Gay_Marriage", "http://www.goodreads.com/book/show/754742.Government_s_End", "http://www.goodreads.com/book/show/34964837-the-happiness-curve", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}