{"ratings": 90, "userreviews": [{"userName": "Jennifer  Davis", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/5688787-jennifer-davis", "userReview": "*Adult Read* This is Kylee's version of what events took place the day the Zombie Apocalypse started. This installment of the series is great. Kylee is a kick butt diva that comes up with some real zingers even though she is out to get eaten. Zombie's on the plane is not the worst thing that can happen in a day, right? Zombies and Kylee's wardrobe don't stand a chance. I totally recommend this to anyone that likes kicking zombie butt and laughing your butt off. Originally posted on The Mystical World of Book Reviews."}, {"userName": "Jennifer Treviño", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/9866355-jennifer-trevi-o", "userReview": "Get 'em GURL!!!Even after the zombies begin attacking I'm still laughing!?! Yep...you are in for a roller coaster ride here folks!This is a terrific book that I could read again & again! Kylee's version of this tale had me cracking up just as much (if not more) than Jade's version. If I were ever in a common situation I would NEED Kylee to keep me sane! ;•} I can't wait to read about the rest of their adventure!"}, {"userName": "Justine", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/4818199-justine", "userReview": "I received this book free from the author in exchange for an honest review.WOW! This book was the SHIT!!! I definitely was laughing my ass off. Hey K.B. was a certain character based on you by chance? LOL. I mean cotton candy vodka was not a dead giveaway or anything :) best part of the whole story was when Kylee went flying over the airplane seat haha. Oh and a certain famous signing teen who may have possibably had \"beaver fever\" HAHAHAHAHA!!! Although I did find Kylee to be the more reserved charcter, Jade was more brave. Jade also had the whole survival/ killing zombies down pact, almost like she may practice in her basement when she isn't writing? But anywho, enough rambling, everyone NEEDS to read this short story. IT IS EPIC!!! I can't wait to dig my teeth into Jade, no pun intended ;)"}, {"userName": "Sara Nelson", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/16889683-sara-nelson", "userReview": "I recieved this ARC copy by the author for an honest review. Thank you K.B. Miller for this chance to read the amazing book!I loved every part of this story...Kylee is so funny to read and go along with!! She has a strong personality and is very girly, but don't get me wrong she can hold her own when need be... Jade on the other hand is more down to earth and would like to be left alone. They make the perfect best of friends. I have a new found love for high heels :) But feel sorry for Kylee at the same time, when will she catch a break? I know she is strong and can handle it. I have read Jade's version by Jennifer Malone Wright also and I must say I am impressed by both authors. This is a must read BUT please remeber this is an ADULT READ."}, {"userName": "Chuya", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/7491995-chuya", "userReview": "I was honored to receive an ecopy of this story for an honest review. \"*Adult Read* This is Kylee's version of the events that took place the day the Zombie Apocalypse started. Once Upon A Zombie Apocalypse is starting out great! Can u say GIRL POWER?! The story was very funny and realistic. Action and saving lives from the beginning. I enjoyed it very much. Kylee is such a smart ass and had me rolling. Literally lol'ing. Too bad her wardrobe can't take a beating. She held her own tho and I'm glad. I can't wait to read Jade's version and I sure hope Kylee finds some \"good\" coffee soon. :-)"}, {"userName": "Anne (Angel Anne Reviews) Nelson ", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/6895344-anne-angel-anne-reviews-nelson", "userReview": "***Mature audience ONLY. This series includes graphic language and violence.*******This book is NOT intended for a young adult audience**** I received my copy from the author herself for my fair and unbiased review.Firstly I need to tell you that I had the gut splitting chance to have read “Jade’s” version first, laughing so hard in the middle of the night as I was reading it… waking my dogs up several times, and my grandson once. Receiving that doggie indignant look from them. You know the look when only their heads lift up and you get the sleepy evil eye look… yup I got that one.OUAZA has started off with a bang, with Kylee and Jade are warding off zombies at the beginning of the apocalypse while they are on a flight back home from a convention.Kylee is one heck of a kick butt survivalist as she goes on attack literally in mid air, and boy does she doe it with “Style” (her wardrobe)Hilarious, witty action fighting zombies and all of this is by two women. Be prepared for your sides to be hurting as you roar laughing, but also saying “moodiness she just did not say that”!You really need to read this short story, although I wouldn’t recommend this for younger readers due to language and violence.Well done KB Miller for this remarkable entertaining read. I look forward to the next installment.Recommend: 18 and up (strong language and violence)Rating: 5/5 angel starsAngel Anne Reviews"}, {"userName": "Jenny Bynum Black Words-White Pages", "userReviewDate": "Mar 27, 2013", "userURL": "http://www.goodreads.com/user/show/6425711-jenny-bynum-black-words-white-pages", "userReview": "10+*s. I absolutely LOVED this story. It's full of humor, excitement, adventure, two author's and a little girl!!! This book totally ROCKS and the characters are unforgettable and a total riot. The way this author describes her main character, really got me thinking that the character is actually the author herself. I really loved the idea of using Oceans of Red in the book too. This is an all out MUST read book that will capture your mind, heart, and soul and suck you into this author's awesome world of trying to survive in a zombie apocalypse. Thank you, K.B. Miller, for an amazing kick ass story that put a smile on my face or made me chuckle."}, {"userName": "Lynn Worton", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/7917492-lynn-worton", "userReview": "I received a copy of this book from the author in return for an honest review.This is a fantastic read! I loved it!Kylee Mahafferty is a character who is very business orientated. She is comfortable with the pressure and stress of rushing from book conventions to book signings, and back to conventions. However, the stress of fighting off zombies may just break her!I liked her sarcastic and witty thoughts as she observed the world going to hell around her. She is an incredibly brave woman, and she can run in high heels! I can't even walk in them without tripping over something, even imaginary things! She has my respect for that talent!This is a fantastic zombie novella! I'm not a huge reader of zombie novels, but this story is an extremely entertaining read! The story starts out innocently enough, but little did I realise what I was in for! This is one heck of a ride! I read this in one sitting, as the book was extremely hard to put down! The action was quite intense, and there are some scenes that could be disturbing for some readers. I am now looking forward to reading more of these novellas, as I am dying (no pun intended!) to find out what happens next! I'm also looking forward to reading Jade's point of view of the same timeline, which has been written by Jennifer Malone Wright.This series is a collaboration between two great authors, K.B. Miller and Jennifer Malone Wright. Their writing styles are slightly different, but I have a feeling that they compliment each other beautifully. I love K.B. Miller's writing style, as the story flows effortlessly off the page. I was a bit unsure as to whether she could write horror stories, as she had previously only written YA romances, but my fears were unfounded. I am a huge fan of her work, and will read any other books she writes in the future.Due to the violence in some of the scenes, I do not recommend this book for younger readers. However, I highly recommend this book if you love horror, or if you are looking for a change in genre. - Lynn Worton"}, {"userName": "Jackie", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/2195441-jackie", "userReview": "2nd POV for same story, Jade's POV was first and now it is Kylee's turn. I have to admit this pair beat Thelma and Louise hands down for entertaining female characters!"}, {"userName": "sydney", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/16703279-sydney", "userReview": "I LOVE ZOMBIE BOOKS AND MOVIES the walking dead especially"}, {"userName": "Merisha28", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/7672849-merisha28", "userReview": "Once Upon A Zombie Apocalpse (Kylee) by KB MillerPrint Length: 46 pagesSold by: Amazon Digital Services, Inc. I just adore the cover I love all the bright colors during the dark time as mentioned on the title.I received this book in exchange for a honest unbiased review.My REVIEW~~~This book is fore mature audience. This book cracked me up. I adored Kylee and my favorite scene was the fence. I can't wait to read the next book in this series. It highly reminds me of the show Walking Dead although this has much much more humor. The book is wonderfully written and does contain curse words. This is a highly entertaining read that is short novella which is a very fast paced read with lots of action. I love this authors writing and look forward to reading many many more fun and awesome reads. The characters are wonderful. They interact well and their personalities lend to the feel of the story. I just love Kylee's humor through this whole horrible ordeal. It made me laugh so much at her \"Zombie-Choo's\".Amazon Description~Chemical Warfare has turned most of the world’s population into flesh eating Zombies. These are the accounts of two survivors.Kylee and Jade are on their way from one author convention to another. After saying goodbye to all their friends, they never dreamed the plane would land with them fighting for their lives.Kylee Mahafferty lived a life of luxury, jet setting to big cities around the globe, high dollar shopping sprees, and downing copious amounts of her favorite fu-fu-non-fat lattes'. But, that life's suddenly been replaced by one with a simple objective, survival. Kylee's best friend, Jade is the only thing holding together the slippery tendrils of her unraveling mind.With their first mission being to find their families, will the girls manage to save their families while trying to save each other?"}, {"userName": "Wanda", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/11071449-wanda", "userReview": "I have to say I am not a zombie fan but this book wasn't your traditional zombie story.... It was less about the gore and more about the funny situations one might find themselves in a zombie apocalypse. The relationship between Kylee and Jade is fun and easy. There is lots of funny scenes and \"colorful\" wording. My favorite part was the \"Beaver Fever\". The story is very action packed and flows rather quickly. I was hesitant to read this book at first but I am glad I did..."}, {"userName": "Jessica", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/2556248-jessica", "userReview": "Review coming soon"}, {"userName": "Sherry", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/11604055-sherry", "userReview": "I swear I was laughing almost all the way thru this. KB did a great job of telling her view of the zombies from Jennifers. Loved this and can't wait to see what other mischief Kylee and Jade get into"}, {"userName": "Denise", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/5253622-denise", "userReview": "This novella is the same story seen in Once Upon A Zombie Apocalypse - Jade, as recorded from Kylee's perspective and is great fun. It has moments of laugh out loud funny and moments of horror for those of up with the \"what if\" mentality regarding a zombie apocalypse and being caught without a change of clothes or decent shoes. The world building is fantastic and you have to love the characters, who frankly I wish were my besties. I will admit to having read Jade's story first and I think I liked it a little more. There were a few technical issues with this installment and perhaps a quick reedit is in order. It is a very short read and I really wish there was more, but it is my understanding the series will continue on with more installments to come. As mentioned there are two installments of this same story, each written from one of the main protagonists' point of view and this was Kylee's perspective. I eagerly await the next book in the series and can only hope it will be a little longer with a little more attention to the minor editing issue to feed that need I have for more. I would recommend this book for mature audiences due to graphic violence and language as is stated in the synopsis / description. I purchased this book from Amazon."}, {"userName": "Mehsi", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/6720768-mehsi", "userReview": "This was an absolutely fabulous, and fun zombie novella. I loved every part of it and flew through it. I did think the graphic language warning and violence warning was a bit overkill. I have seen quite a bit more cussing and violence in some YA novels. But oh well. :PI definitely loved that this one took place mostly in a plane. Yes, I have read quite a few zombie books but never have I had one that took place in a plane. On the airport, yes, but an actual real flying in the air and oh boy you don't want zombies there plane? No. So I was definitely delighted, and creeped out. Would our girls survive this, because when stuff goes to hell, stuff goes to hell real fast and real horrifying. It was definitely a bit standard, it starts of with peace and quiet, just a few hints here and there that something might be up, that something will go down. People coughing, people half-vomiting, people acting a bit weird, not getting a connection to loved ones. But I really love it when that builds up to a good zombie. :PIt was a bit sad that the blurb already spoils how the zombies came to be. That wasn't mentioned until the last few pages of the story.The two MCs, or well, I do call them that though Kylee is the one we follow on this crazy ride. I loved both of them to bits. They were just so kick-ass. Nothing like how some people are during the zombie apocalypse, with these 2 we might just stand a chance. Unlike most people who would just try to restrain a zombie even when it is clearly not going to stop eating and munching, Jade just tackles zombies left and right, and even Kylee is getting into it quickly. They really saved a lot of people that day, though I do wonder how many will survive in the end. :(Cheri was a nice addition to the story, and I can't wait to see how she will survive. She got 2 kick-ass ladies helping her out, so I am sure she will be able to survive.I will check out Jade's story in a bit, and then see if I can find the second book. I am quite sad that I can't find anything further than book 2. I did find a cover reveal for the third book, but that is over 3 years ago. Such a shame if this series never got any further than book 2.I am glad I decided to go for this book, the blurb definitely pulled me in, the cover just said NOPE to me (sorry if that is harsh but I love a good book cover and often get turned away if a cover is just meh/bleh/urgh). I would recommend this book to everyone. It is short, quick, but full of zombie action, kick-ass characters, and much more.Review first posted at https://twirlingbookprincess.com"}, {"userName": "Diana Blick", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/3287532-diana-blick", "userReview": "FunThis one was as much fun as Jade's perspective. Too bad you collaborated on what river one sees from Louisville Kentucky. Last time I looked, Louisville sat on the Ohio, not the Mississippi. I doubt that it moved. Big mistake that lost a star--I mean Wikipedia's free. Otherwise the book was great, very funny."}, {"userName": "Cheree", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/12551039-cheree", "userReview": "Laugh out Loud funny!!! I am not a fan of zombie books, but this was surely a treat. With a nice blend of kick ass zombie moments, funny adult humor, and real life anguish. Each character has their own traits that are a perfect duo that balance each other out on their venture back home to their families. *Now I read both Jade and Kylee's stories, and personally I feel that there was no real need for both. There were only slight changes in each story that I feel could have all been placed in the same book and still had the same affect. You get a little more insight to each characters feelings over what is happening, but the story line is the same as the other. It when reading the 2nd story, I just wanted to skip around till I found something different that I had not seen in the previous book, as I am not a fan of re-reading because I already know what happened and it just spoils it for me.* Just my opinion, and my only reason for rating it a 4 instead of a 5."}, {"userName": "Markus W", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/17203306-markus-w", "userReview": "[\"Shit, I hoped we were on the tarmac\"  (hide spoiler)]"}, {"userName": "Tanya Johnson", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/17382369-tanya-johnson", "userReview": "Jade and Kylee are authors who are on a book signing trip. Things go terribly wrong while they are on the flight home.....a couple passengers turn into zombies and the two girls step up to take care of the situation. Once landed, Jade takes control and finds herself with an addition to her family and the only thing the girls can think of doing is finding their families.I absolutely loved this book. I am a huge fan of Walking Dead (who isn't right?) so I knew reading this one would be fun. I absolutely loved Kylee and her sense of humor which makes the dynamic between the two girls awesome. Then you have Kylee's fashion mishaps which left you laughing which helped the girls facing a bad situation with a good sense of humorI am looking forward to the next part of this series to see where the girls end up next."}, {"userName": "Kim Eyler", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/22531907-kim-eyler", "userReview": "I loved KB Miller's side of this story. Her writing style is hilarious for this book and just flows so well. The girls are so bad A@@ and I love it. They handle every situation as they they just know what they are doing. I can't wait to hear what happens in their journey from here on out. I hope both girls are able to reunite with their family and find out that everyone has fared well in staying away from the Zombies. The story about how the Zombies came about was a neat addition to the story and something you could almost believe, which made it creepier. I really enjoyed this story."}, {"userName": "Cindy", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/5807520-cindy", "userReview": "Awesomeness at it's finest!!!! Loved this story so much! I noticed something in the Kylee story as I did in the Jade between the 2 main characters, and the authors that write them...but no spoilers here.I did not read them in order and really don't think you have to, they are (for me) a stand alone. I laughed my ass off all the while disturbing the hubby as he slept. Looking so forward to the next one in this set. I do recommend OUAZA to my family and friends."}, {"userName": "Sarah", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/12619142-sarah", "userReview": "I won this book in a giveaway a while back. Wish I had it read it sooner. It is laugh out loud zombie butt kicking time. I want Kylee and Jade with me should I ever find myself in a zombie apocalypse situation."}, {"userName": "Pamela", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/11106330-pamela", "userReview": "awesome Zombie Apocalypse book to read.. it is a short story, but worth the read"}, {"userName": "Amelia", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/10715206-amelia", "userReview": "Brilliant. Absolutely hilarious."}, {"userName": "Kayla Eklund", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/5696962-kayla-eklund", "userReview": "This was very similar to the other OUAZA. Therefore, it should come as no surprise that I loved it."}, {"userName": "Diane T.", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/3957112-diane-t", "userReview": "Not bad. It had interesting female characters but no surprises. Standard fair."}, {"userName": "Heidi", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/18297739-heidi", "userReview": "ok sometimes you just need a short funny story to get you out of your book funk. Well this has it all. its fast paced full of Gore and lots of whitty one liners."}], "description": "***Mature audience ONLY. This series includes graphic language and violence.*******This book is NOT intended for a young adult audience**** KyleeChemical Warfare has turned most of the world’s population into flesh eating Zombies. These are the accounts of two survivors.Kylee and Jade are on their way from one author convention to another. After saying goodbye to all their friends, they never dreamed the plane would land with them fighting for their lives.Kylee Mahafferty lived a life of luxury, jet setting to big cities around the globe, high dollar shopping sprees, and downing copious amounts of her favorite fu-fu-non-fat lattes'. But, that life's suddenly been replaced by one with a simple objective, survival. Kylee's best friend, Jade is the only thing holding together the slippery tendrils of her unraveling mind.With their first mission being to find their families, will the girls manage to save their families while trying to save each other?***Once Upon A Zombie Apocalypse or (OUAZA) as the fans call it, is a short story episodic saga written by K.B. Miller and Jennifer Malone Wright. The first episode is from both Jade and Kylee's perspective and is two separate novella's. The same story, but from two different characters. It is done this way with the first episode only, so that you can meet our girls and really get to know and love them like we do.Each following episode is written solely by one of the authors and available through their links.Novella 1. KB. Miller and Jennifer Malone WrightNovella 2. Jennifer Malone WrightNovella 3. K.B. MillerNovella 4. Jennifer Malone WrightNovella 5. K.B Millerand so on...", "title": "Kylee\n      \n          (Once Upon a Zombie Apocalypse #1 POV 1)", "url": "http://www.goodreads.com/book/show/17337395-kylee", "average": 4.23, "cover": "https://images.gr-assets.com/books/1360169451l/17337395.jpg", "reviews": 28, "authors": [{"url": "https://www.goodreads.com/author/show/5029571.K_B_Miller", "name": "K.B. Miller"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/17337395-kylee", "http://www.goodreads.com/book/show/19321604-kylee", "http://www.goodreads.com/book/show/13558634-haunted-moon", "http://www.goodreads.com/book/show/11995849-compulsion", "http://www.goodreads.com/book/show/13603671-harvest-moon", "http://www.goodreads.com/book/show/18170973-blood-moon", "http://www.goodreads.com/book/show/18104826-uh-oh-we-turned-our-brother-into-a-zombie"]}