{"ratings": 24549, "userreviews": [{"userName": "Ahmad Sharabiani", "userReviewDate": "Apr 26, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "441.\tLabyrinths, Jorge Luis BorgesLabyrinths (1962) is a collection of short stories and essays by Jorge Luis Borges. It includes \"Tlön, Uqbar, Orbis Tertius\", \"The Garden of Forking Paths\", and \"The Library of Babel\", three of Borges' most famous stories. Many of the stories are from the collections Ficciones (1944) and El Aleph (1949). هزارتوهای بورخس - خورخه لوئیس بورخس (کتاب زمان) ادبیات؛ تاریخ نخستین خوانش: سال 2006 میلادیعنوان: هزارتوهای بورخس؛ نویسنده: خورخه لوئیس بورخس؛ مترجم: احمد میرعلایی؛ تهران، کتاب زمان، 1356، در 259 ص؛ چاپ دیگر: سوئد، افسانه، 1369؛ چاپ دیگر: تهران، کتاب زمان، 1380، در 296 ص؛ شابک: 9646380166؛ چاپ دیگر با حروفچینی متفاوت: 1381؛ در 296 ص، شابک: ایکس - 964638028؛ موضوع: داستانهای کوتاه و نوشته ها و شعر شاعران آرژانتینی - امریکای لاتین - سده 20 منقل از بورخس: حکمت وداع: «کم کم تفاوتِ ظریفِ میان نگه‌ داشتن یک دست، و زنجیرکردن یک روح را یاد خواهی گرفت، این که عشق تکیه کردن نیست، و رفاقت اطمینان خاطر، و یاد می‌گیری که بوسه‌ ها قرارداد نیستند، و هدیه‌ ها، عهد و پیمان معنی نمی‌دهند، و شکست‌هایت را خواهی پذیرفت، و سرت را بالا خواهی گرفت، با چشمان باز، با ظرافتی زنانه، و نه اندوهی کودکانه، و یاد می‌گیری که همه راه‌هایت را هم ‌امروز بسازی، که خاک فردا برای خیال‌ها مطمئن نیست، و آینده امکانی برای سقوط به میانه ی نزاع در خود دارد. کم‌ کم یاد می‌گیری، که حتی نور خورشید می‌سوزاند، اگر زیاد آفتاب بگیری. پس باغ خود را می‌کاری، و روحت را زینت می‌دهی، به جای اینکه منتظر کسی باشی تا برایت گل بیاورد، و یاد می‌گیری که می‌توانی تحمل کنی، که محکم هستی، که خیلی می‌ارزی، و می‌آموزی و می‌آموزی، با هر خداحافظی، یاد می‌گیری». پایان نقل از: خورخه لوییس بورخسبه برهان ناآشنائیم به فرهنگی که، «بورخس» از آن مینالد، و ساز خویش نیز هماره خوش مینوازد، استعاره های ایشان را کمتر درمییابم، برای همین است شاید، با اینکه از خوانش و خواندن چندباره اش، لذتها برده ام، نمیدانم چرا؟ میخواهم بازهم کتاب را بخوانم. شاید بفهمم چه میگوید. روانشاد «گلشیری 1316 - 1379 هجری خورشیدی» که آخرین افزوده را بر کتاب بنوشته است، از خود میپرسند: «راستی نکند که بورخس، محصول رویای پدر کور خود باشد»؟ شاید هم به شیوه ی بورخس، بشود گفت: «آن که در باره ی بورخس مینویسد، بیشتر در مورد خود، یا آثار خود مینویسد». پس بگذارید دیدگاهم را بنگارم در باره ی متن بنوشتارهای خورخه: چه احساس زیبائی، وابستگی هماره هماورد آزادی ست. عشق در برابر رهایی ست. اما گویا تنها گنجشککان اینگونه اند، هم را دوست میدارند، ولی طرف را هرگزی بندی نمیکنند. برهانش اینکه آنگاه که از چیزی خوشت آمد، دلت میخواهد از آن تو باشد. دیگر او آزاد نیست. وقتی آزاد نیست، برایتان ارزشی ندارد، کس، برای به دست آوردنش با شما نمیجنگد. معادن را برای یافتنش نمیکاود. دریاها را در جستجوی او درنمینوردد. از برای صیدش، به عمق آبهای شور و شیرین و گرم و سرد سرک نمیکشد. مرواریدی که در موزه ای به تماشای دیگران گذاشته شده، هرگزی ارزش واقعی خود را نمینمایاند. اما آنگاه که درون صدف خویش است، و در قعر دریا تنها، آزاد است و از آن خود ست، و مالکی ندارد، چندین غواص، برایش نفس در سینه حبس میکنند، جانها بهای اوست. کلام «خورخه»، اوج شناخت حق دیگری ست. باید، سدی نبست، حتی به رود خشک نیز. وگرنه دیگر چشمه های زلال، جاری، نیلگون، و فیروزه ای نخواهد ماند و بود. آسمان را گویا از ایشان گرفته باشید، دیگر درخت بید، موی خود را با تماشا در آب جاری شانه نمیکند. از پا خواهد افتاد، و برکه ای خواهد شد، تا سمور آبی، شاید در آن به گشت و گذار بپردازد، و لانه بنا کند. واژه ی دوست، شاید از «دو تا است» تلخیص شده باشد، یعنی دو متفاوت، و وابسته در بعضی علائق به هم، البته به دلخواه هردو. آیا ما نیز چنینیم؟ «خورخه» بسیار ظریف اندیشیده، و دیده است. عشق را همراهی دیده. اگر هدیه ای هم باشد، باید بدون مناسبت و دلخواه هدیه دهنده و گیرنده، باشد. البته که بدون انتظار پرسش و پاسخ. نه آن بندی که ناخواسته شاید به پای دیگری میبندیم، با آن هدیه گوئیا. باید باغ خود را بکاریم، و روحمان را زینت همان باغ خویش کنیم، تا گردشگران، چون خرده های آهن به سوی آهن ربا، به سوی زیبائی چنین روحی گرد آیند. ا. شربیانی – تهرانApr 26, 2008"}, {"userName": "Lisa", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "\"You who read me, are You sure of understanding my language?\" Borges would have been the first to point out that an answer in the affirmative to his own question would be a likely sign that the reader indeed had understood nothing of any importance. So I won't make any claims. I did however experience something approaching perfect reading pleasure, - fully aware that perfection is unlikely to be approved by Borges - being too static, unchangeable, and definitive. Halfway through the essay collection, I became acutely conscious of knowing the stories already, but I was not able to recall whether I had read them before, or just heard about them in other essay collections. It left me in the dreamlike, surreal state of mind that Borges enjoys evoking - blurring the lines between reality and literature, proving over and over again that storytelling is the origin of humankind as a thinking species.Are we real? Or are we just part of a giant narrative, told in infinite volumes of books in a labyrinthine library which contains us, the universe and all our imagination, including our deities?Moving from one fictional character to the next (Don Quixote, Hamlet, Dante in his fictional self) and questioning our right to claim more authenticity than these immortal characters, Borges involves his own identity as a person and as a writer in the narrative process, and makes a distinction between what Borges - the person - and Borges - the writer of mythical dimensions - represents, without being sure where one identity ends and the other begins: \"I do not know which of us has written this page.\"Why are readers confused when they realise that characters in books turn into readers of the same book, like Don Quixote in the second part of the Cervantes' masterpiece? - Borges claims it disturbs our sense of reality. We might be part of a story ourselves, a story about a character reading about reading, and reflecting on how to establish an objective identity.If our universe is a great labyrinthine library containing all the stories of the world, then time and space are meaningless measurements of life. We can be in different stories at the same time, and change pattern, plot and character in case we are not happy with the thread we are following at the moment:\"Next time I kill you\", replied Scharlach, \"I promise you that labyrinth, consisting of a single line which is invisible and unceasing.\"Why did I like this collection so much? Why did it give me such a deep, deep sense of satisfaction, despite being obscure, incoherent, and slightly surreal?I think the answer is that to me, the world is a library, and Borges gave me the narrative to prove that my reading and dreaming self is just as real as the self that is busy with everyday chores. I have always felt at home in books in a way that I rarely feel at home in the world. Within Borges' labyrinth, I found my true home address. Moving from Dante and Kafka over Shakespeare to Cervantes feels natural and logical to me, and I gather that I am among old friends. I identify strongly with the idea of seeing the world as an infinite number of story fragments, all available to be reinterpreted by me, the reader. I am part of the story as well, changing the narrative with my existence in time, just like Borges himself:\"Time is the substance I am made of. Time is a river which sweeps me along, but I am the river; it is a tiger which destroys me, but I am the tiger; it is a fire which consumes me, but I am the fire. The world, unfortunately, is real; I, unfortunately, am Borges.\"I was Borges too, for a short time, while I read his words. And it swept me away!"}, {"userName": "Glenn Russell", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/23385697-glenn-russell", "userReview": "The stories, essays and parables in this Borges collection, with all their esoteric references to multiple histories, cultures and literatures, are no more likely to appeal to a casual reader then a textbook on cognitive psychology. To extract literary gold from highly intricate, complex works like The Garden of Forking Paths, Emma Zunz, The Library of Babel or The Zahir requires careful multiple readings as well as a willingness to occasionally investigate terms and references, for example here are several from The Zahir: The Book of Rites, Isaac Laquendem, The Nibelungen, the novel Confessions of a Thug, The Book of Things Unknown.And, speaking of The Zahir, if I were to move from referring to the tale itself to the ideas which lie behind it, how would my review read? What does it mean for a narrator to dissolve the universe into a single coin? Why does Borges describe, right at the outset, how at different times in the past the Zahir, a coin he was handed in a bar, morphed into a tiger, a blind man, a small compass, a vein in the marble of a pillar, the bottom of a well? How does one compress all time into this one sentence I am now writing? And what of the philosophical and cultural context in which Borges wrote this tale? Could a first-person short-story like The Zahir have been written in Ancient China? Medieval Persia? Colonial America? These are questions that lie outside the framework of this Borges tale. Or do they?Philosophical musing on the reality of the Zahir propels Borges (and us as readers) to multiple worlds: of a woman who seeks to makes every one of her actions correct to the point where she desires the absolute in the momentary; the dark light of the Gnostics; a dream where he, Borges the narrarator, becomes a pile of coins guarded by a gryphon. Then, after Borges’ fascination with the Zahir slides into obsession, driving him to seek out a psychiatrist, he writes, “Time, which softens memories, only makes the memory of the Zahir sharper. First I could see the face of it, then the reverse; now I can see both sides at once. It is not as though the Zahir were made of glass, since one side is not superimposed upon the other; rather it is as though the vision were spherical and the Zahir flutters in the center.”Such refection bring to mind Hesse’s The Glass Bead Game, where the beads are, in fact, made of glass and can represent, in turn, cosmic topology, a fugue of celestial spheres, variations on relational placement as in the colors and lines of a Mondrian or circles with plasticity in Vasarely; only the Zahir has about it more unity then plurality, and thus one Möbius strip, one musical note, one painting, one print. Toward the very end we read: “Others will dream that I am mad, while I dream of the Zahir. When every person on earth thinks, day and night of the Zahir, which will be dream and which reality, the earth or the Zahir?”Regarding the essays, Partial Magic in the Quixote opens us to a least a dozen unique angles in our approach to this Spanish classic; Kafka and His Precursors explores the connection of writers like Kierkegaard and Browning along with Zeno’s paradox to the famous author of The Metamorphosis; The Mirror of Enigmas delves into conundrums such as the symbolic significance of Sacred Scriptures and various forms of metaphysical writings as reflected on by, among others, Philo of Alexandria. Seven more essays will bend and stretch you mind in ways you never thought possible.In the parable, Borges and I, the author conducts a dialogue with himself as well as, take your pick - author, public persona, alter ego, younger self, older self, second self – and is uncertain as he concludes his parable who exactly is the author of the lines he has just written. Everything and Nothing is a parable featuring Shakespeare with a multiple identity crisis; another parable, The Witness, has the narrator brooding over memory and death and yet in another parable, Inferno 1,32, we encounter a leopard, Dante, and God in what could be viewed as a dreamscape.Reading Labyrinths years ago, I was inspired to write this micro-fiction as a tribute to Jorge Luis Borges:LIFE STORYThe bold letters on the cover read: Harold Blackman – Life Story. The book looks quite ordinary. One is required to make a special inspection to see a queer spring-like device along the spine. Harold Blackman opens the book before him. The title page is completely blank as are all the pages. He runs gnarled fingers, tips calloused and slightly trembling, lightly over this ghost of a title page and reflects on the long agonizing nights when he tried to pen the fire of his youth and the spume of his manhood without success. What he saw when the ink dried always left him feeling flat, unsettled. Closing his eyes, he repeats an incantation learned from a half-crazed Argentine, then opens them slowly, very slowly. Harold Blackman, weary adventurer, is now standing on the writing table, shrunken to the size of the book. Lying down on the title page, the back of his legs, buttocks and backbone relax to the paper’s slight give. He released a catch on the spine, the leather cover snapping shut with the vengeance of a mousetrap. But for a muffled groan all is silence. Over time, the blood seeps through the pages, forming, words, sentences, paragraphs."}, {"userName": "karen", "userReviewDate": "Jun 23, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "why haven't i read borges before?? no one knows. and he was always pushed upon me - \"how can you like marquez if you haven't read borges??\" \"you like donoso - you should read borges.\" \"machado is good, but you should read borges.\" so - fine - i did. and i am utterly underwhelmed. so there. i am learning during my \"summer of classix\" that most of the books i have for some reason or another overlooked were probably overlooked for a reason. i naturally gravitate towards what i like - and i seem to have a filter that prevents me from picking up too many books i don't. when i force it, this happens. and i liked some of the stories. but borges isn't for everyone (although scrolling down my \"friends who have read\" list, it looks as though all my friends gave it five stars.) and i'm not accusing you bitches of inflating your ratings, but i have the sense with borges that some people are guilted into liking him. or pretending that they like him more than they do because he's borges. but i won't be. because i am not ashamed of my intellectual shortcomings. i embrace them. i am incapable of abstract thought. fact. as hard as i try, that whole achilles/tortoise thing? does not compute. so all of this hexagon spiraling into hexagon on top of hexagon... i feel like i am back in college (where every single person i ever knew had a copy of this book. and was a stoner.)but this is classic stoner thinking-chains. reflections, labyrinths, it's perfect for that kind of mindset. \"dooood, imagine we were in a hexagon right now??\" and i know this makes sense to some people with philosophical and theological mindbents, but for me its almost pain. there were about 6 stories i liked, but the first few almost made me weep with trying to find the value in them. sorry, borges. we were never meant to be.mmmmkay - it seems that there are those who think it would be valuable \"in a book review\" to list the stories i did like. so: the shape of the sword, theme of the traitor and the hero, death and the compass, the secret miracle, three versions of judas, story of the warrior and the captive, emma zunz, the house of asterion, and the waiting. more than i thought i liked, but still - a sad minority."}, {"userName": "Samadrita", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "A university professor had once expounded on the supposed conflict between history and literature, the former bemoaning the irrelevance of the latter when it comes to tracing the contours of reality while the latter countering this accusation by deploying the well-known defense of 'there's no one way of looking at the truth'. Indeed. Why restrict ourselves to just the one way and the one reality? Why overlook the truth of infinite permutations and combinations of each eventuality and each one of them, in turn, forking off into myriad possibilities ad infinitum? Why seek neat compartmentalization of two disparate disciplines and prevent their intermingling to create new streams of thought? Why believe mathematics and literature to be so fundamentally apart that there can be no blending together of both without the results being distorted beyond intelligibility? The very fact that the known limits of what's considered intelligible are being breached every moment, has its roots in the reluctance of labyrinthine minds like Borges' to follow linear pathways. Mysticism, mathematics, arcana, philosophy, and literary criticism. A perfect blurring of the boundaries between fact and fiction leading to the creation of an entirely new entity which challenges the normative narrative form. And a moment of perfect lucidity arising out of a churning of all these elements. Where our imaginations come to a staggering halt, Borges' begins. I do not wish to squeeze out every last drop of meaning from these complex interpolations of a known truth into discrete bits of hitherto unknown logical conclusions by googling every reference I did not get. Instead I delight in Borges' perfectly synchronized demolition of all and any conventions associated with writing with an authorial preeminence, I gaze enthralled at the vision of clarity being birthed out of pure chaos. \n\"In a birdless dawn the magician saw the concentric blaze close round the walls. For a moment, he thought of taking refuge in the river, but then he knew that death was coming to crown his old age and absolve him of labors. He walked into the shreds of flame. But they did not bite into his flesh, they caressed him and engulfed him without heat or combustion. With relief, with humiliation, with terror, he understood that he too was a mere appearance, dreamt by another.\"\nI let my mind latch onto his even if for a little while and let it guide me into realms where only the divinity of thought reigns supreme in its many manifestations. And, for now, that is enough.__P.S.:-It's good to know where DFW acquired his irksome yet awe-inspiring footnoting habit from."}, {"userName": "Rakhi Dalal", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/3655942-rakhi-dalal", "userReview": "On his religious views, Borges declared himself as an agnostic, clarifying: \"Being an agnostic means all things are possible, even God, even the Holy Trinity. This world is so strange that anything may happen, or may not happen\"*It feels kind of strange to quote this after my initial brush with “The God Delusion” by Richard Dawkins where he refutes an agnostic stance vis-à-vis an atheist one. But I find myself adhering here with Borges. Why to rob an already incomprehensible world of its myriad probabilities?Perhaps it is not relevant to quote this here with regard to “Labyrinths” which is a distinct work in itself and can be taken as “fantastical literature” encompassing the unimagined. However there also appear to be an underline theme running discreetly for most of the stories in this collection.Attracted by metaphysics, but accepting no system as true, Borges makes out of all of them a game for the mind. He discovers two tendencies in himself: \"one to esteem religious and philosophical ideas for their aesthetic value, and even for what is magical or marvelous in their content. That is perhaps the indication of an essential skepticism. The other is to suppose in advance that the quantity of fables or metaphors of which man's imagination is capable is limited, but that this small number of inventions can be everything to everyone.\"These lines from the preface to the work by André Maurois elaborates Borges’ agnostic stand and present to us a glimpse into the author’s mind which seemingly wants to exhaust all the possibilities available to him by using them in different combinations to come to the point that anything is possible. Working with the concept of time and space, myths and dreams Borges continuously constructs labyrinthine worlds whose contemplation is left to the imagination of the reader. He seems to be postulating that man (also mind, the world or Universe) exists as an infinite entity whose centre is everywhere (an individual), whose circumference is nowhere (existing in infinite series of time). There are numerous references in the work which propose this.According to André Maurois, Borges sets out to hunt the following metaphor, regarding infinity, through the centuries:Pascal wrote: \"Nature is an infinite sphere whose center is everywhere, whose circumference is nowhere.\" And so from an enchanted mind, inspired by the possibility of fiction as reality and vice-versa, is created an array of dreamlike worlds for the readers where readers continuously keep drifting from the boundaries of one to another dazed by the magical images appearing infinitely. No one is anyone, one single immortal man is all men. Like Cornelius Agrippa, I am god, I am hero, I am philosopher, I am demon and I am world, which is a tedious way of saying that I do not exist.------------------------------------------------------* Source: Wikipedia"}, {"userName": "Foad", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "دو بورخسفكر كنم بايد بورخس رو دو بخش كرد. يك بورخس، بورخس \"گاچو\"هاست: گاوچران هاى امريكاى لاتين، و داستان هاى افسانه اى كه مردم راجع به بى رحمى و چاقوكشى و مردانگى و بى باكى اون ها ساختن. چیزی شبيه به لوطى هاى خودمون. هر چند اين بورخس هم از عناصر جادويى توى داستان هاى گاوچران ها استفاده مى كنه (مثل اين كه روح چاقوكش هاى بزرگ در دشنه هاشون حلول مى كنه و بعد از مرگشون همچنان از طريق دشنه ها به خونريزى ادامه ميدن) اما اين عناصر محدودن، و داستان ها حول محور گاوچران ها و دوئل هاشون و دشمنی ها و عشق های افسانه ای شون مى چرخن و از فضاى امريكاى لاتين بيرون نميرن.داستان هاى نصف اول كتاب، اغلب توى اين فضا هستن. و به خاطر تكرارى شدن سوژه هاشون ممكنه حوصله رو سر ببرن. من مدت ها قبل كه اين كتاب رو خوندم، به خاطر همين عدم جذّابيت و تكرارى شدن سوژه ها، كتاب رو نيمه كاره رها كردم، و حالا توى ريويوها ديدم كه بعضى از دوستان ديگه هم همين طور كتاب رو نصفه رها كردن.بورخس گاوچران ها دوست داشتنى هست، ولى اگه كار داستان نويسى ش رو به همين محدود مى كرد، فكر كنم هيچ وقت آوازه ش از كشورهاى لاتين فراتر نمى رفت.بورخس هزارتوهابورخس دوم، بورخس \"هزارتو\"هاست: داستان هایی غریب از شرق، جادوگری، عرفان، منطق الطیر عطار، هندوستان، عارفان قرون وسطا، کیمیاگری، و بیشتر از همه هزارتوها. دیگه کمتر اثری از آمریکای لاتین توی داستان ها هست، و داستان ها بیشتر و بیشتر رنگ و بوی اسطوره های بی زمان و بی مکان می گیرن. و جالب این که این بورخس دوم همزمان با شروع نابینایی بورخس، به دنیا اومد. انگار هر چی چشم ظاهریش به روی اینجا و اکنون بسته تر می شد، چشم درونیش به لامکان و لازمان بازتر می شد.این که چرا بورخسِ گاچوها، به بورخسِ هزارتوها تبدیل می شه، ریشه ش در کودکی بورخسه، که در کتابخونۀ قدیمی و بزرگ پدرش سپری شد. بورخس در مصاحبۀ آخر کتاب تعریف می کنه که چطور ساعت های متمادی در این کتابخونه می مونده و کتاب های قدیمی رو می خونده، از جمله هزار و یک شب که تخیل کودکانه ش رو سحر کرده بود. بورخس می گه: حالا که فکر می کنم من هنوز روحم توی همون کتابخونه باقی مونده و همچنان دست از خوندن کتاب های اون کتابخونه نکشیدم.اولین داستانی که بورخس رو از دنیای گاچوها درآورد و به دنیای هزارتوها وارد کرد، داستان \"تقرّب به درگاه المعتصم\" بود. بورخس این داستان رو در ۱۹۳۵ وقتی سی و شش ساله بود نوشت. تمام داستان در حقیقت \"ریویو\"ی یک رمان هندیه، که وجود خارجی نداره. هر چند لحن مقاله-مانند داستان، رفرنس ها و بحث های محققانۀ بورخس راجع به چاپ های مختلف رمان، باعث میشه خواننده فکر کنه که در حال خوندن یه مقاله است راجع به یه رمان واقعی.هم انتخاب سوژه (جادو، عرفان و شرق) و هم سبک (داستان-مقاله) بعدها، مخصوصاً بعد از نابینایی، به شکل اصلی داستان های بورخس تبدیل شد، و بورخس رو از یه نویسندۀ محلّی که آرژانتینی ها و شاید حداکثر مردم آمریکای جنوبی می تونستن با داستان هاش ارتباط برقرار کنن، به یه نویسندۀ بدون مرز تبدیل کرد که هر کسی که دغدغۀ ابدیت داشته باشه، می تونه توی داستان های رؤیامانندش غرق بشه، یا به عبارتی که خود بورخس بیشتر می پسنده: توی هزارتوهاش گم بشه."}, {"userName": "Jr Bacdayan", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/16587936-jr-bacdayan", "userReview": "‘Tlön is surely a labyrinth, but it is a labyrinth devised by men, a labyrinth destined to be deciphered by men.’ Labyrinths is a collection of short stories, essays, and other literary works. It is my first experience with Borges, but it shall not be the last. Borges writes but he does more than that. He’s a chimaera, part philosopher, part academic, part historian, and part bibliognost. His vast accumulated knowledge penetrates his work to create meta fiction that feels truly authentic, thus one has constantly remind oneself that Borges pens works of fiction and not treatises. He bends thought, axioms, and orthodoxy in his readers. He asks that you submit to his mind. As a reward he elicits a delicious reverberation from his work and the beauty and wisdom of his stories that might appear vastly spread in theme and scope create a cohesive chef-d'oeuvre. It spotlights the mind, a labyrinth, of those before us, those that have been, might have been, those that have etched their names in the annals of history. They create the maze of thought that Borges, like Ariadne leading Theseus out of the Minotaur’s labyrinth, leads us through. After a taste of a small portion of his body of work, I have realized something vastly significant that I have missed. Fiction relies as much on the accumulation of knowledge as it is an art form, that words are not only chosen and arranged, that you don’t merely tell a story. But you create a world out of all the information you’ve learned, all the systems you’ve mastered, and all the theories you’ve dissected, all the things you’ve read. Maybe a writer is not like a divine creator who creates something out of nothing, but rather a modest chef who crafts something from the ingredients he has available to him. These ingredients we get from our experiences, our studies, our reading. Not only of fiction, but of philosophy, of different disciplines, of the ancients and of the myths. People say that the best chefs are the gastronomists. Might I presume to say the same thing for writers, that the best writers are those most widely read. And Jorge Luis Borges is as well read a writer as any other. He references both trendy works and works which no one reads anymore. He creates haunting phantasms full of familiarity and novelty, unmatched works unique in sentiment. He echoes the Cabbalists, the Greeks, the European philosophers, even Twain, yet his voice is unassumingly original. In the works of others he finds his reflection staring back at him. His pen is both an enigma and a revelation. ‘Thus my life is a flight and I lose everything and everything belongs to oblivion, or to him. I do not know which of us has written this page.’ I have walked the winding path inside the mind of Borges, and the walls of his words enchant me. If to be lost in his labyrinth is to be engulfed in silent brilliance, then I pray never to find my way again."}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "[Mystical, intricate, luminous, dreamlike, a treasure trove of knowledge which could trap you in wikipedia searches for the whole of a grad school program, this collection gives and gives and then gives some more. To attempt to really break it down based solely on a first pass, no matter how thoughtfully and slowly you attempted to absorb it, would be selling short Borges's expansive imagination, the breadth of his knowledge of the Humanities, and his remarkable skills as a wordsmith and miner of the subconscious, of hypnotic states and fantasy worlds, religious ecstasy and terror, and human struggle and redemption (for starters). This collection is one to be revisited multiple times, as their will always be another layer buried underneath each previous read's unearthed gems. Though each short story, essay, and parable is deceptively short, and in fact the entire collection itself is rather on the slim side, don't expect to just plow right through it in a day or two. Well, unless for some strange reason you just really want to read something without actually reading it. These pieces will make you think, they will make you dream, they will make your head spin, you will read and reread and often stop to just simmer for awhile, and on and on I could ramble...in fact, I can't think of a more perfect title than Labyrinths. They are. (In the best way.) (hide spoiler)]"}, {"userName": "Miss Ravi", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/21314656-miss-ravi", "userReview": "بورخس یک جادوگر تمام‌عیار است. این را من نمی‌گویم. همین که کتاب را شروع کنید، او را می‌بینید که با لباس جادوگری و چوب‌دستی‌اش پشت داستان‌ها ایستاده و دارد جادو می‌کند. من مطمئنم که بورخس هم از طرفداران واقعی هزارویک شب است. او بعضی داستان‌ها را از روی دست شهرزاد نوشته و می‌شود او را از نوادگان شهرزاد دانست. شاید برای من همین کافی باشد که به کتابی که هزارویک شب جد و نیای آن حساب می‌شود پنج ستاره بدهم اما هزارتوهای بورخس چیزی بیش از این است. جهان داستان‌هایش اساطیری، مرموز، باستانی، رمزآمیز و آمیخته با جادوست. این‌که کلمه‌ی جادو را زیاد تکرار می‌کنم همه‌اش به خاطر دنیایی است که تازه از آن آمده‌ام و هنوز تا گردوغبار جادویی داستان‌ها را از خودم بتکانم ورد زبانم همین لغت است. بعضی از شخصیت‌ها انگار اسم اعظم و یا رمز کائنات همین لحظه سر زبان‌شان بوده اما لحظه‌ای بعد آن را فراموش کرده‌اند، بعضی‌هایشان قصه‌هایی از سفر در زمان را دارند و طوری از این اتفاق صحبت می‌کنند که هر آدم معمولی از خاطره‌ی مسافرتش. هر چند که فراموشی هم مضمونی گره خورده به این هزارتوهاست، ما یکبار تا ته دنیا رفته‌ایم انگار، همه‌ی چیزهای نامکشوف را کشف کرده‌ایم، همه‌ی علوم را دانسته‌ایم، راز خلقت را دریافته‌ایم، معمای هستی را هم حل کرده‌ایم اما کمی بعد همه‌چیز از یادمان رفته چون ما فراموشکاریم و دنیا بر مدار فراموشی ما می‌گردد."}, {"userName": "Aubrey", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "Reading. No, thought. No, reality. Or, fiction? Fiction. But also time, and faith, and metonymy. How close is the instantaneous you to the you in context with time, space, and the integration over the infinite?What? What.The what is the period of time wherein I grew fed up with the knowing and began to contemplate the thinking, unknown and yet rather persistent seeing as it continues to niggle at me. Knowing helps, of course, in the foundations of common thought from which propagates communication, an inherently faulty condition in an endless number of ways which we will not delve into now but would have you keep it in mind. The hypothesis, thesis, maxim and crux of touching upon the streaming moment, the schizophrenic past, the hallucinatory future, and everything in between.You read a story, and you enjoy it. You read a story, and you hate it. You read a story, and think, well, it wasn't a complete waste of time. Now, that last part, that was interesting. For you've just delineated a breaking up of time as corresponding to certain parts of a piece of work, and a differential behavior over time just begs for a formula for explicatory purposes. Wouldn't you say?Or not. You're not here for math, or maths, or numbers and their rote maneuverings. You're here for ethos, pathos, and logos, on a determined length of instants inside a mind completely reliant on rather inexplicit senses, sailing upon a calibrated fortification of personal/historical/sociocultural context spreading its tendrils into a reality that, for whatever reason, exists. You enter this minute form of visual and linguistic maneuvers with the hope (There are some unfortunates who enter with assurance and/or expectations. Poor souls.) that your time will not be 'wasted'. The variable enters the formula and comes out a solution.Context? Context. Jorge Luis Borges, for a fortuitous and perhaps godly (Till another word comes along that is as ripe with contextual glory and more suitable for my atheist tendencies, this will have to suffice.) reason, favored a honing of literature over development of mathematica. For an even better reason, he danced along the boundary between the two, and was not troubled in the slightest when the tenuous strands dividing the two sagged and snapped beneath his fearless weight, as there were always other webs upon which to stand and stretch and view from line to point, from word to number, from thought to full bloom with the aid of paper and pen. Always another labyrinth to enter and decorate with riotous abandon and the benefit of his own supreme erudition, with the foresight of penning down the experience so as to not have a single tale of Theseus and the Minotaur, but many. Countless. You tread the labyrinth, as do I, and the measure of our game is how badly each of us wants to get out, and what assumptions we make concerning the proper way of escaping.\nIt may be that universal history is the history of the different intonations given a handful of metaphors.\nHere is the mystery/conspiracy/faith of the world and its sidelong lapses of recognition between fellow souls of humanity, saved now and again by the flow of common themes whose limited number is not a matter to fear, but to enjoy. Here is immortality in the flight of thought and the falling of form, for what is the assurance of death if not an instigation of the limited soul towards a mark in the infinite? Here is a question of theology going hand in hand with the philosophy, and how the two often differ only in the matter of a single variable, accorded by either side with the relative values of everything and nothing. Here is the West, and the East, and Man, and all those time-stamped frames of thought riddling Borges' brain, who as such stands accused but can be excused only by the fact that at least he had the gumption to realize that there were other worlds and frames of (Postmodernism, the particle of you as a function of the wave of you as an answer and a question for, what? Reality, perhaps.) thought that he would never live to see. Or, he would never live to see, in that moment of personal reflection. Just as I will never live to see the reception of this review. Future I will, obviously. But not I.\nWords, displaced and mutilated words, words of others, were the poor pittance left him by the hours and the centuries.\nTell me, Borges, why do I read?\nAnd why wander in these labyrinths? Once more, for aesthetic reasons; because this present infinity, these \"vertiginous symmetries,\" have their tragic beauty. The form is more important than the content.-André Maurois, 'Preface'\nTell me, Borges, why do I write?\nThere is no pleasure more complex than that of thought and we surrendered ourselves to it.\nThere we go."}, {"userName": "Sidharth Vardhan", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/58296635-sidharth-vardhan", "userReview": "Doctor Who visits Argentina\nThe TARDIS appears in a wheat Farm. Doctor Who and his hot assistant come out of it. \"But what are doing in Argentina?\" Doctor replies\"I lost my Sonic screwdriver was lost in labyrinths of time.\" and becomes quit as if the explanation is enough. Impatient she tries again, \"So, how do you know it is to be found in Argentina of 70s?\" \"I don't where my screwdriver is. I can't find a thing in labyrinths of time, it is labyrinths of time for goodness sake. Only one person is genius enough to be able to find his way through them.\" \"Who?\" \"What do you mean by 'Who'? I said labrynths!\""}, {"userName": "Leonard", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/4940476-leonard", "userReview": "Jorge Luis Borges, one of the most imaginative writers I have come across, could have been a mathematician, a physicist, a philosopher or a theologian. I can see his influence on Umberto Eco in the manipulation of text and the blending between fiction and reality. To read Borges’s Labyrinth is immerse myself in a magical world where the concept of infinity manifests in space and time, where the boundary between dream and reality fades, where the past and the future converge into an instant, where levels of texts superimpose on one another, where fiction imitates nonfiction and life is a drama on stage. To read Borges is to become children again, listening to stories of magic and wonder, of unfathomable worlds. In “Tlön, Uqbar, Orbis Tertius,” Borges creates a fictional world, where Berkeleyan idealism dominates its inhabitant’s thinking. “The world for them is not a concourse of objects in space; it is a heterogeneous series of independent acts.” Through the narrator Borges, we encounter a language without nouns, but with “personal verbs, modified by monosyllabic suffixes (or prefixes) with an adverbial value.” The author Borges has created an alternative world, where the language and the worldviews differ from our world and from it we learn of our biases and blind spots. And we can begin to imagine new worlds, new possibilities. We can create our own languages, as Tolkien has in his fiction, and as software engineers has BASIC, FORTRAN, PASCAL, and so forth. We see similar blending of fact and fiction in Umberto Eco’s The Prague Cemetery. In “The Garden of Forking Paths,” we encounter an infinitely long book where at every juncture of the story, all possibilities are written and the branches grow exponentially. “In all fictional works, each time a man is confronted with several alternatives, he chooses one and eliminates the others; in the fiction of Ts’ui Pen, he chooses—simultaneously—all of them. He creates, in this way, diverse futures, diverse times which themselves also proliferate and fork.” When I was younger, I have read stories where the reader can choose one of several actions—the decision tree—and turn to the appropriate page for that choice. The story continues from there until there is another choice. And the story would have several endings. After reading this story, I realize where the idea came from. Perhaps, Borges read about the many world interpretation of Heisenberg’s Uncertainty Principle, which states that before an observation, a system could be in various states—position, momentum, time, energy—according to a probability distribution and only when someone has observed the system—photons bouncing off the object—would it collapsed into a single state. In science fiction, such as Star Trek, we read about parallel universes but this may be the first story with such a concept. In “The Library of Babel,” Borges again plays around with the concept of infinity, but this time also with combinatorial and I can imagine Borges as a mathematician or computer scientist. A labyrinth of infinite number of rooms stores books that include all combinations of a 22-letter alphabet plus spaces and the comma and period. Since we know the number of characters in each book, we can calculate the number of possible books (not infinite). Of course, most of them are meaningless. Is this universe of repeated rooms each with five shelves and thirty-five books a mirror of our world? Interestingly, in Eco’s The Name of the Rose, the blind monk who oversees the library is named Jorge of Burgos.I have heard of the argument that Judas betrayed Jesus to force the latter to reveal his divinity and complete God’s work, but in “Three Versions of Judas,” the controversial theologian reinterprets the Biblical text and declares Judas the savior and God’s incarnation. “To save us, He could have chosen any of the destinies which make up the complex web of history; He could have been Alexander or Pythagoras or Rurik or Jesus; He chose the vilest destiny of all: He was Judas.” Borges’s fascination with text, whether historical documents or his own creation, dominates much of his stories and Eco certainly inherits that fascination. In “The Circular Ruins” where a man is only another’s dream figment and “The Theme of the Traitor and the Hero” where a man’s execution for betrayal is part of a drama, Borges again mixes fact with fiction to create worlds as ephemeral as mist. I recommend Labyrinth to anyone who wants to dream of magical worlds, who wants to reflect on reality and fiction, who wants to analyze the boundary between text and the interpreter, and who wants to contemplate on the nature of infinity."}, {"userName": "Ben Winch", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/5647943-ben-winch", "userReview": "For a few years in my early-20s I was obsessed with this book. Some of these stories I have read probably 10 times. The opening story ('Tlon, Uqbar, Orbius Tertius') is one of the most challenging, rewarding mind-f**ks in all literature. Borges's style is limited - this becomes clearer in his later work - but for me this collection is well-chosen. Rarely has so much innovation been crammed into so short a space - but innovation of the controlled kind. No displays of histrionics for this Argentine; his stories are well-wrought and concise. Every story or essay seems to focus on a paradox and explode it. Is it only me or does anyone else see a bit of Borges in Philip K. Dick? And why are the Borg (Star Trek: The Next Generation) called the Borg? I mean, the librarian in The Name of the Rose was called Jorge for a reason. What I'm saying is these days Borges's influence seems to be everywhere. Or is it just that he condensed so many of the key themes in literature down to such a fundamental state that now it seems as if he owns them?A pre-post modernist without whom I doubt Eco or Italo Calvino could have turned out as they did, Borges is everything that's good about those two younger Italians condensed down into something you can swallow. In the mind-bending short story stakes only Edgar Allan Poe comes close. Life-changing."}, {"userName": "Tara", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/70459127-tara", "userReview": "”This City is so horrible that its mere existence and perdurance, though in the midst of a secret desert, contaminates the past and the future and in some way even jeopardizes the stars. As long as it lasts, no one in the world can be strong or happy. I do not want to describe it; a chaos of heterogeneous words, the body of a tiger or a bull in which teeth, organs and heads monstrously pullulate in mutual conjunction and hatred can (perhaps) be approximate images.”\nIn Labyrinths, Borges meanders through some impressively intricate conceptual realms. His exquisitely crafted tales are richly layered with curious ideas from philosophy and mathematics, and that is a large part of why they are so entrancing. He playfully and skillfully arranges and rearranges thematic elements such as time, infinity, paradoxes, identity, mirrors, reality, Solipsism, dreams, the annihilation of opposites, and the infinite contained in the infinitesimal. Within these pages you’ll get lost in endless houses that repeat themselves endlessly, and discover “strange geometries” that’d surely have impressed the shit out of Lovecraft. The threads of these recurring themes are masterfully tangled, entwined, and interwoven throughout the various stories; beautiful patterns and textures emerge. Given Borges’ penchant for paradoxes and impossible geometries, it is hard not to be reminded of M. C. Escher. Below are a few of his pictures which suitably convey some of the surreal atmosphere you’ll find in the book:If you’re uncertain as to whether or not you should pick this up, I’d recommend trying The House of Asterion. At only 3 pages long, it manages to pack an incredible punch, and is fairly representative of Borges’ style. It is probably my favorite story. Others worth mentioning include The Garden of Forking Paths, Pierre Menard, Author of the Quixote, The Immortal, The Zahir, and Tlön, Uqbar, Orbis Tertius.Overall, this collection is full of truly captivating metaphysical mindfucks. Borges’ imaginings are eerie and dark, breathtakingly bizarre. You often experience the sensation that you’re eternally falling and yet entirely motionless at the same time. If any of this sounds agreeable to you, do yourself a favor and enter into Borges’ infinite, labyrinthine playground. It's fun to get lost sometimes.\n“…your ancestor did not believe in a uniform, absolute time. He believed in an infinite series of times, in a growing, dizzying net of divergent, convergent and parallel times. This network of times which approached one another, forked, broke off, or were unaware of one another for centuries, embraces all possibilities of time.”"}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، این کتاب 296 صفحه دارد و مجموعه ای از نوشته ها، روایتها، مصاحبه ها و اشعارِ «بورخس» است... بیشتر به تقدیر و ستایش از قهرمان هایِ جنگی و انقلابی در آرژانتین و زندگیِ و افکارِ آنها پرداخته است‎در ابتدایِ کتاب، مترجم «بورخس» را با «حافظ» مقایسه کرده است، که از دیدگاهِ من، اصلاً قابلِ مقایسه نیستند... در زیر تعدادی از نوشته هایِ این کتاب را برایِ شما بزرگواران به انتخاب، مینویسم---------------------------------------------------‎هزارتویِ پُرپیچ و خمی از گام ها‎که از روزهایِ من بافته شده است‎از روزِ تولدم تا کنون، مرا به این ساعتِ تباهی بسته است---------------------------------------------------‎پسربچه ای بودم که چیزی از مرگ نمیدانست، مرگ ناپذیر بودم‎و بعدها روزهایِ روز، اتاق هایِ بی آفتاب را به دنبالِ او کاویدم---------------------------------------------------‎شاید در مرگ، آن هنگام که خاک‎خاک است، ما برایِ همیشه‎این ریشۀ مرموز باشیم‎که بهشت یا دوزخِ بدن هایمان‎آرام یا وحشت بار‎جاودانه از آن خواهد رویید--------------------------------------------------‎در بینِ نوارهایِ شگفتِ خیزران‎راه راه هایِ بدنِ ببر را مینگرم و کالبدِ استخوانی را‎در زیرِ پوششِ پرشکوهِ پوستِ لرزان حس میکنم‎اقیانوس هایِ پرموج و زباله هایِ سیاره ها‎بیهوده ما را از یکدیگر جدا نگاه میدارند‎از اینجا در خانه ای دور دست، «آمریکایِ جنوبی» من تو را در رویا میبینم‎تو را دنبال میکنم، ای ببرِ کرانه هایِ گنگ‎اکنون که شامگاه، روحم را پُر میکند، در می یابم‎که ببرِ شعرِ من‎جانوری است در سایه ها، ببری از سَمبُل هاست‎و تکه پاره هایی که به تعفن از کتاب ها جمع آمده‎رشته ای از استعاره هایِ ماهرانه، که عاری از زندگی اند‎و نه ببرِ مقدر، جواهرِ مهلک‎که زیرِ خورشید یا ستارگان یا ماهِ افسونگر‎در بنگال یا سوماترا می خرامد‎و مأموریتِ روزانه اش را از عشق، کاهلی و مرگ به انجام میرساند--------------------------------------------------‎هوشنگِ گلشیری در پایانِ این کتاب نوشته: راستی نکند که «بورخس»، محصولِ رویایِ پدرِ کور خود باشد؟ و شاید هم بشود به شیوۀ «بورخس» گفت: آنکه در موردِ «بورخس» مینویسد، بیشتر در موردِ خودش، آثارِ خودش مینویسد... به راستی که سکۀ «بورخس» چنان فتنه میکند که گاه میترسم نکند کور شویم!، یا من میترسم--------------------------------------------------‎امیدوارم پسندیده باشید‎<پیروز باشید و ایرانی>"}, {"userName": "Arief Bakhtiar D.", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/17674849-arief-bakhtiar-d", "userReview": "LABIRIN BERNAMA BORGES\"Thinkin’ is a lonely business.\"―Martin HeideggerBORGES, seumur hidupnya, memiliki nasib baik untuk selalu berdekatan dengan buku dan literatur. Semenjak kecil ia sering menghabiskan waktu di perpustakaan ayahnya. Di sana lah, di antara ribuan buku berbahasa Inggris, fragmen paling penting buat Borges kecil—yang kelak mempengaruhi jalan hidupnya. Siapa sangka, di masa tuanya Borges diangkat menjadi direktur perpustakaan nasional.Barangkali bertolak dari pengalaman itu ia membuat cerita pendek di mana tokohnya gemar menelusuri literatur, sejarah, dan kultur dari dunia luas. Dalam buku Labyrinths, Borges mengarang plot yang membuat tokohnya menyusuri halaman-halaman ensiklopedia untuk mengetahui apa itu Uqbar dan Tlön (dalam Tlön, Uqbar, Orbis Tertius) dan, tanpa keraguan akan jadi membosankan, menampilkan 19 nomor literatur karya Menard pada satu cerita pendek (Pierre Menard, Author of the Quixote). Juga pada beberapa cerpen yang lain, Borges tampak sebagai pembaca tekun yang mencoba memahami labirin-labirin literatur perpustakaan. Gejala yang sering kita temui: Borges melakukan banyak penyebutan referensi. Gema dari ruang pikirannya seakan tak mau berhenti.Saya ingat satu kalimat dari Orhan Pamuk yang mungkin relevan untuk melihat Borges: \"The starting point of true literature is the man who shuts himself up in his room with his books.\"●●●André Maurois menyakini sumber-sumber bacaan Borges \"tak terhitung dan tak terduga\". Borges membaca apa yang orang jarang tertarik, seperti Kabalis atau filosofi zaman pertengahan (saya pernah mendengar orang berkata, hanya Umberto Eco yang mungkin menyamai antusiasme tersebut). Ia mengagumi keganjilan hubungan antara tidur dan mimpi, dan untuk itu mengutip cerita Qur'an 1400 tahun yang lalu tentang pemuda Kahfi (The Secret Miracle). Dari sumber-sumber nyata itu Borges mencampurkannya dalam detail dan sitasi yang membuat kita kadang berpikir fiksi Borges adalah potongan realitas. Tapi dunia cerita Borges tetaplah cuma imajiner. Dan dalam labirin imajiner itulah (bukan dunia yang penuh langkah-langkah kaki dan percakapan ramai), kita diajaknya ikut serta. Kita seperti tokoh dalam The Circular Ruins: seorang lelaki yang berusaha menciptakan manusia dalam mimpi, dan akhirnya menyadari, setelah tidak terbakar oleh api, bahwa ia sendiri ciptaan imajiner dari orang lain yang bermimpi―apa yang kelihatan nyata rupanya hanya bagian dari ilusi.Borges meringkus labirin-labirin imajiner itu dalam bentuk cerita pendek yang seperti esai: hampir seluruhnya narasi dan sarat misteri. Satu lagi: tidak banyak dialog antartokoh di dalamnya. Dengan itu Borges menciptakan dunia rekaan yang menurutnya masuk akal dan berusaha menawarkan makna, misalnya tentang eksistensi manusia, dalam bentuk yang mungkin tidak bisa diungkapkan melalui jalan lain. Dalam salah satu interviu dengan Denis Dutton, Borges mengaku menggunakan filosofi untuk cerita pendek sebagaimana Dante menggunakan teologi untuk puisi. Borges menyebut karangan-karangan itu \"fiksi filosofi\" ketimbang \"fiksi sains\". Bagi Borges, memasuki lorong-lorong ide, melontarkan kontradiksi, dan menguraikan drama kemungkinan-ketakmungkinan dalam cerita pendek adalah caranya untuk skeptis. Maka kita sering menemukan paradoks, serangkai ketakjelasan, ketika mencoba memahami cerita-ceritanya: tiap kali kita harus menerkanya seperti teka-teki dan membacanya berulang kali.●●●Salah satu ketegangan intelektual yang sempat menjadi perhatian Borges adalah, meski ia lahir di Buenos Aires, kita tak melihat yang khas Argentina dalam cerita-ceritanya. Di The Garden of Forking Paths ia membuat karakter Yu Tsun dan Ts'ui Pên―nama Tiongkok, sekaligus dengan mudahnya mengutip Seribu Satu Malam, Newton, dan Schopenhauer. Di Funes the Memorious ia membicarakan seorang Uruguay, menyamakannya dengan Zarathustra, dan menyebut baberapa kota dan negara dalam satu cerita: Monteviedo, San Franscisco, London, New York, Mesir. Di The Lottery in Babylon ia narator yang mengaku sebagai orang Babilonia―sebuah negeri dari dunia yang lama. Di The Shape of the Sword ia menulis mengenai orang Irlandia yang terlibat perang sipil dan melarikan diri ke Brazil. Saya mengira semua itu ada hubungannya dengan hidupnya yang sejak kecil berpindah-pindah dan terbiasa dikelilingi bahasa-bahasa yang mewakili peradaban besar dunia. Tentu ada yang lebih mendasar dari itu. Dalam esai The Argentine Writer and Tradition, Borges mengajukan proposal bahwa penulis-penulis Argentina, termasuk dirinya, kurang-lebih mengacu pada tradisi kultur Barat. Maka jika kita tak menemukan topografi atau botani Argentina dalam sebuah karangan, bagi Borges, hal itu tak seharusnya mengurangi nilai karangan tersebut. Pada cerita Theme of the Traitor and the Hero, misalnya, Borges lebih memilih berbicara tentang kemungkinan sebuah plot di mana seorang Irlandia bernama Ryan ingin mencari tahu kebenaran mengenai Fergus Killpatrick, satu tokoh yang dianggap hero. Di sana kita menemukan latar Irlandia dan kutipan nama-nama terkenal dalam tradisi Barat: Chesterton, Leibniz, Hugo, Hegel, Shakespeare. Meski punya dasar yang universal, saya menduga (bukan bermaksud memutuskan) fiksi filosofi Borges mudah untuk tak populer. Gaya bercerita Borges yang intelektual masih terlalu luks untuk, misalnya, kelas menengah ke bawah. Hanya orang-orang yang mencintai ilmu dan sastra yang saya kira akan konsisten membaca karangan Borges. Sebab cerita-ceritanya memang punya kecenderungan labirin yang ruwet: di tengah-tengahnya kita mungkin tersesat, dan tidak tahu bagaimana caranya untuk selamat. Sementara Borges tak ingin menjadi pengarang yang memberi terang. Ia telah menyatakan undur diri dari cerita―dalam satu interviu ia mengatakan: \"[W]e have no message at all. When I write, I write because a thing has to be done. I don't think a writer should meddle too much with his own work. He should let the work write itself.\"●●●Tentu saja dugaan saya tak harus dipercaya.Perspektif yang lebih optimis mengatakan bahwa cerita-ceritanya, seperti dikatakan James E. Irby, semacam sintesa antara penemuan dan pencerahan. Oleh karena itu Borges memukau. Borges, misalnya, memaparkan tafsiran sinologis Stephen Albert dalam usahanya untuk mengerti kalimat \"I leave to the various futures (not to all) my garden of forking paths\" dan mengklaim menemukan maksudnya. Atau bagaimana Borges mendalami pertentangan antara apa yang asli dan imitasi ketika seseorang punya ikhtiar menuliskan kembali kisah Quixote dari Cervantes. Pada kali lain, ia seorang detektif, Erik Lönnrot, yang berusaha menemukan titik cerah atas kasus pembunuhan yang berkaitan dengan kalimat misterius seperti ayat kitab suci.Saya sedikit banyak setuju dengan Irby: saya seorang pembaca yang mengamati titik-titik terang dari segala kerumitan yang ditemukan Borges, dan dengan rasa penasaran, seperti sang narator dalam Funes the Memorious, saya akan mengatakan: \"I don't know how many stars he could see in the sky\". Saya ingat Søren Kierkegaard yang mengatakan, kita “seharusnya tidak berpikir buruk tentang paradoks, karena paradoks adalah gairah pikiran. Seorang pemikir tanpa paradoks bak seorang pecinta tanpa gairah: seorang medioker”.Tapi ketimbang cerita-cerita pendek Borges, saya seorang pembaca yang lebih kena pesona oleh parabel-parabelnya. Mungkin karena parabelnya ringkas dan saya tak ingin terlihat selalu bodoh di hadapan kerumitan cerita Borges―saya diam-diam menandai hal itu sebagai sebuah kelegaan."}, {"userName": "Huda Yahya", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/7878381-huda-yahya", "userReview": "للتحميل المرايا والمتاهاتخورخي لويس بورخيس"}, {"userName": "Jonathan Terrington", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "[The Minotaur (hide spoiler)]"}, {"userName": "Henry Martin", "userReviewDate": "Jun 21, 2013", "userURL": "http://www.goodreads.com/user/show/14734360-henry-martin", "userReview": "My first Borges book, or shall I say, \"My first Borges experience!\"Labyrinths is broken down to three sections: Fictions, Essays, and Parables. It starts complicated enough with the first story, and despite the false appearance to grow simpler, it gets more complicated as the book progresses. These are not short stories; these are conundrums blending fact, fiction, reality, and dreams. I cannot begin to fathom the amount of research that went to his stories, as even today, with the World Wide Web it would have taken me years to find and understand the vast amount of 'data' he throws around as if nothing. Jorge Luis Borges was a genius, a mad genius. There were times when, while reading the book, I did not know whether to continue reading or whether to blow my head off. The only other book that made me feel this way was Anacalypsis by Sir Godfrey Higgins. Borges masterfully manipulates dream-like states and combines them with historical facts, mind-boggling revelations, and all this while looking at things from angles one would normally not consider. To be honest, I'm not even sure I understood this book completely (if that is even possible) but I already know I'll have to reread it. There were stories and essays that made me question my own sanity, my own understanding of the world. There were beautiful stories that I read twice (The Library of Babel; The Secret Miracle; The Immortal; Deutsches Requiem; The Zahir). And then there were pieces that just blew me away and left me puzzled (The wall and the Books; A New Refutation of Time, for example). In the end, I feel I have nothing new to say about this book that has not been said before. I'm left perplexed, yet strangely satisfied. I'm left wondering while my mind wanders, hungry for more yet unable to swallow one more morsel for fear of exploding. This will not be my favorite book of all time, it will not go down as the most memorable read of the year either...but...Borges, you shook my world in a profound, inexplicable way."}, {"userName": "Brian", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/1938805-brian", "userReview": "Mind-blowingly awesome. I only wish that for the first book that I read of Borges that it was either all short stories or all essays; I had difficulty making the transition from the last story to the first essay because the lyrical cadence of his writing style made his beautifully written essays seem almost fictive. The parables at the very end of the compilation were the cherries on top. Borges' love of all things Quixote makes me want to hunker down with that book and read, re-read, and re-re-read it until it has the mantric effect that it apparently had on him. Dostoevsky made me want to learn Russian to read him in his native language - Borges has the same effect on me w.r.t. Spanish. I'm reminded yet again how embarrassing it is to be an American monoglot."}, {"userName": "Mark Becher", "userReviewDate": "Sep 22, 2007", "userURL": "http://www.goodreads.com/user/show/314314-mark-becher", "userReview": "Borges typically gets lumped into the South American \"magical realism\" genre along with the likes of Gabriel Garcia Marquez (whom I've still yet to read; shame on me). But his style is very peculiar. The book is supposed to be a collection of short stories, or as Borges himself called them, ficciones. But few of them are what one would typically consider stories at all. They tend to be short fictional essays, book reviews, obituaries, articles, etc. (There's also a detective story and a couple of first hand narratives.) Borges reviews books that have never been written, eulogizes people who have never lived, and writes articles refuting scholars that don't exist. And why? The best I could tell was that he wanted to explore what the world would be like if modern philosophy were actually true. He toys with Bishop Berkeley's idea that the physical world need not necessarily exist. So long as the sense perceptions it supposedly creates affect our consciousness it's material existence is superfluous. He also plays with Hume's denial of the existence of personal identity. Need it necessarily be the case that this string of sense perceptions which I call myself has any actual unity? Need it necessarily constitute a \"person\" at all? What if it is nothing more than a random string of impressions? Also, Borges enjoys meddling with the sequence of time itself. If two events happened in exactly the same way, why could they not simply be the same event? Is it necessary to posit the idea of temporal sequence at all? Could not all moments be entirely unrelated to each other? If these thoughts sound bizarre, that's because they are. But the \"philosophers\" are out there thinking them and Borges fictional rendering of their implications is as interesting a presentation of these ideas as one is likely to run across.Another major theme of Borges thinking, and perhaps the most representative expression of his view of reality, centers on the notion of Labyrinths. For him, the mystery of reality can be best summarized by as a grand labyrinth. It is a puzzle which gives the appearance of reason/order to those trapped within its confines but which in truth is nothing more than an elaborate game. What does one accomplish upon reaching the center of a labyrinth? Is there indeed any purpose at all to the journey? And yet how can a man help but attempt it? Yet ultimately there is no meaning behind the movement; only the appearance of meaning; truly a torturous state for humans to find themselves in. But then again, that's where the modern quest has left us all at present. Final verdict: interesting but not amazing. Intensely cerebral fiction and so probably not to the taste of everyone; but short enough to make some dabbling in the work worthwhile."}, {"userName": "Erik Graff", "userReviewDate": "May 09, 2008", "userURL": "http://www.goodreads.com/user/show/974210-erik-graff", "userReview": "This is the first Borges book I ever read. Since then, of course, he's died and all of his short stories have been collected in English. Mike Miley, the person who spends more money on books than anyone I've ever known (and is very generous in sharing them), purchased that complete collection, bringing it up to the cottage in Michigan during his last visit. When I saw it amidst Michael's travel bags (a small one for clothes, a big one for books and papers) I immediately asked if I could have at it. Permission granted, I probably got through the whole thing--and it's long--in a couple of evenings and nights by the wood-burning stove. Thus, all of the Labyrinths stories have been read at least twice now.What I particularly like about Borges is his creative erudition. Not only is he good at mimicking the style, say, of a early sixteenth century Spanish bureaucrat, but he cleverly mingles the real with the fantastical in his often copious references, notes and asides. It makes one wonder who is to be credited for the technique which is also employed by the American authors James Branch Cabell and H.P. Lovecraft.P.S. Borges visited Loyola University shortly before his death in the eighties, speaking in its chapel--perhaps the only event I ever attended there."}, {"userName": "Elise", "userReviewDate": "Jan 23, 2008", "userURL": "http://www.goodreads.com/user/show/822477-elise", "userReview": "Why hasn't anyone smacked me over the head with a copy and said, \"Read this, dummy\"? I want to live in his brain."}, {"userName": "Parastoo Ashtian", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/22635681-parastoo-ashtian", "userReview": "من دیگر از کائنات چیزی درک نخواهم کرد. \"ظاهر\" را درک خواهم کرد. بنابر تعلیم ایده‌آلیست‌ها کلمات \"زندگی کردن\" و \"خواب دیدن\" سخت با هم مترادفند. از هزاران تصویر به یکی خواهیم پرداخت، و از رویایی در نهایت پیچیدگی به رویایی در کمال سادگی. دیگران به خواب خواهند دید که من دیوانه‌ام، من \"ظاهر\" را به خواب خواهم دید. هنگامی که همه مردمان زمین، شب و روز به \"ظاهر\" بیندیشند، چه چیزی رویا خواهد بود و چه چیزی واقعیت؟ زمین یا \"ظاهر\"؟از متن کتاب"}, {"userName": "Praveen", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/6203616-praveen", "userReview": "Labyrinths by Jorge Luis Borges, this book is divided in three parts; FICTION, ESSAYS and PARABLES. Basically all this three sections comprises of  STORIES OF IDEAS  with the blend fact and fiction. Jorge Luis Borges seeks neither truth nor likelihood; he seeks astonishment by using metaphysics as a branch of the literature of fantasy (Like he quoted in his \"Tlön, Uqbar, Orbis Tertius\"). He uses themes of philosophy, politics, economics, mathematics etc and raises “n” number of paradoxes which is beyond comprehension. From this collection of fiction, essays and parables I am just going to put forward my comments on few (because of my laziness).The Garden of Forking Paths (My favourite in this collection.):  This story follows the journey of a German spy during World War I who meets a Professor who is lost in the Labyrinths of unfinished book written by his great grandfather, which is completely contradicting. Like in the third chapter the hero dies and in the fourth he is alive.In this story Borges discuses about the “Dimensions of time” or “Infinite series of time”. The unfinished book (which not really unfinished) is structured with the all the possible outcomes of a single event(Chance Of Probabilities). This concept of Jorge Luis Borges is well portrayed in the movies like: Sliding Doors (English), Blind Chance (Polish), Run Lola Run (German), 12B (Tamil - Indian). Even all the new generation video games are designed with this concept. I don’t know whether any game designers thank Jorge Luis Borges for developing such a wonderful concept. “All the time co-exist.”  The Circular Ruins:  This is a version of Alice's Adventures in Wonderland by Jorge Luis Borges in his own way. Dreams, thoughts in our sleep; the narrator is stationed in a ruined of a burned shrine, his principle objective is to dream a man: he wanted to dream him with minute integrity and insert him into reality but night after night, the narrator dreams the man as asleep and eventually the narrator makes out life is nothing but a dream. Don’t assume the narrator himself is dreaming ...its Borges, we cannot assume.... he is a genius. The Library of Babel:  The whole universe is visualized in to a vast library with galleries hexagonal shapes and the books with the specified format, a library which doesn't just have a lot of books, it has every book that could be written with an alphabet of twenty-two letters (might be Hebrew alphabet), comma, period, and space, there are no two identical books For every person there is a book which describes their life and death. Every idea you could think of is written in books. The translation of every book into every language is also in the library. The Library is a sphere whose exact centre is any one of its hexagons and whose circumference is inaccessible.  Tlön, Uqbar, Orbis Tertius:  This short story about an encyclopaedia article on an unknown country called Uqbar, where state had declared that \"mirrors and copulation are abominable”, since they increase the number of men (George Berkeley’s idealism which denying the reality of the world. This is what the whole story is based on). Uqbar is speculated a brave new world as the work of a secret society of astronomers, biologist, engineers, metaphysicians, poets, chemists, algebraists, moralists etc. We cannot say this is as a short story it more or less like a discussion or a debate. Greater extend of this story discuss the language which progress with the details of its language, where there are no nouns in Tlön and towards the end of this story the narrator even mentions the chance of “Specious reasoning” which would have resulted in the creation of this unknown country. The Lottery in Babylon:  It took a lot of time for me to understand the Labyrinths of this story; this is about the lottery in the mystic city of Babylon which deals with the lottery of life and existence. The Secret Miracle :  The Wheel of time (Kalachakra) is explored in this story through a play writer who is in the final stage of completing his play. There is no end ...everything will be repeated. Funes the Memorious:  Tells the memories the narrator about Ireneo Funes, who lives in Uruguay with extraordinary skills for an example he can tell the accurate time without looking into clock but unfortunately he becomes bed ridden as he met with an accident while riding a horse, on bed he discusses lot of ideas on language, memories and mathematics and dies at the age of 19. The Shape of the Sword:  An Irish man who narrates the story on how he got a large scar on his face, the story flew back to the period of Irish War of Independence and the day which he spent with his new comrade who was a coward and scared of being hurt; stayed inside their Gen’s house showcasing his old injuries and gradually turns to be traitor by selling himself. Theme of the Traitor and the Hero:  Borges takes the narrative of detective story for this one; this is about a guy who is in the quest to find the face of the assassin of his great-grandfathers who was killed some hundred years ago. This narrative progress with the discussion of Shakespearean literature especially of Julius Caesar’s assassination conspiracy. (Above three short stories is not dealing with new concepts but Borges deals these with his bizarre narratives which makes these special.) In Essays And Parables Needless to say Borges becomes more affluent in essays and parables on this beloved themes “Time, Space, Identity.” The recurring elements of this book is all sections were Berkeleian idealism, which denies the reality of the world , Greek philosopher Zeno of Elea's paradoxes this two I was little in- accessible. Besides this Borges discuss lot about Miguel de Cervantes’s Don Quixote; in essay headed “Partial Magic in Quixote” he interrelates the plot structures of Don Quixote, The Ramayana and One Thousand and One Nights that was one of his master stroke. I started this book on a good time; because Borges makes his readers to commence an independent research of their own, with the paradoxes which he puts forward. This book contains only 288 pages but the themes convey different meaning from different dimensions and some were out of my grasp. It’s a book of  “Infinite Ideas” .Jorge Luis Borges becomes the end of all “IMAGINATIONS.”NOBODY CAN IMAGINE BEYOND THIS."}, {"userName": "David Sarkies", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/5856247-david-sarkies", "userReview": "One Man's Search for Divine Truth2 February 2018 – Phi Phi Island.\tThis is another of those book that a friend's Goodreads' review caught my interest, and imagine my surprise when I discovered it sitting on my shelf. Normally, once I have read the review, and marked the book as 'to read' I generally forget about them, namely because there are simply too many books on my too read list to be able to remember when I am browsing a bookshop. Okay, I could always whip out my phone and have a look at the list, but then comes the problem of buying a book that I already own. I haven't done that yet, but I do vaguely remember buying this book, namely because the title caught my attention, and whenever I walk into a bookshop I tend to always walk out with a book, or ten.\tThis isn't a novel per se but rather a collection of short stories, essays, and parables. However, these stories all seem to be interconnected in some way, and the major reoccurring theme is that of the labyrinth. Sure, many of us know of the story of Theseus, and when we think of a labyrinth we generally conjure up the image of a physical building with passages twisting and turning everywhere, and when you enter, actually finding anything is nothing short of impossible. However, this is a metaphysical text, and the labyrinth is in a way spiritual. You could say that the labyrinth Borges is exploring is the labyrinth of life, but in my mind this would be way too simplistic. Sure, life is a labyrinth in many cases, and even the smallest choices that we make can head in radically different directions – the butterfly effect if you will.\tYet, the labyrinth that I see here is actually a spiritual labyrinth, and it is a labyrinth that many of us enter and spend out entire lives navigating. You could say that there actually is no exit from this labyrinth, unless you consider death to be an exit. The simplistic way of looking at religion is simply believing that you have discovered the truth, and stick to it, but I don't think that this is necessarily the case. Many people find something that satisfies them and basically stick with it – a rather shallow view in my opinion (not that there is anything necessarily wrong with that, since intellectual snobbery really has no place in people's search for the divinity).\tBorges seems to travel through many phases and places in this book – sometimes he comes to Islam, sometimes to Judaism, a number of times to Christianity, or at least the Catholic sect (which is not surprising considering that he is Argentinean). The introduction suggested that a lot of the things that he writes is heretical, but sometimes heresy is simply challenging the status quo. This was the case with Martin Luther, who discovered that there was no soul, and no life, in the church, so set out on a quest to find a greater meaning in his faith, and a way to break the shackles of his guilt. Can we ever find the truth? Well, that is debatable. There are a lot of uncomfortable realities out there, many that we simply want to hide ourselves from because the truth simply hurts way too much.\tSo, this brings me to Don Quixote, a book that I have yet to read, but hopefully will get around to doing so this year. Just as Slavoj Zizek has a thing for Kung Fu Panda, Borges seems to always come back to Don Quioxte. Actually, I probably shouldn't write all that much about a book that I have yet to read, but there is very much a case of the battle between the imagination and the reality. Apparently Quioxte inhabits an imaginary world, and I suspect that Borges' point is that so do many of us. The imagination is a very powerful thing, and we have this tendency to hide from the world behind this veil of our imagination. This veil isn't a weak veil either, it is an incredibly strong and powerful veil, that if you try to tear it away then you are no doubt going to be met with violence.\tI guess this is the thing with Labyrinths – people sometimes simply just stay in the same place, content with what they know and understand, and others keep searching, either going further in, or drifting further and further away. Yet, in some of these stories, particularly the detective stories, there is a form of unveiling. Many of these stories are actually told in a stream of consciousness style, where the narrator (and there usually is a narrator), doesn't just tell the story, but shares the emotions with you. However, in many cases, there is a rather shock ending, particularly with the detective stories. In some cases, Borges even pushes the boundaries, such as the story of the Nazi justifying his actions as a Nazi. Interestingly, the conclusion is that though Germany had been defeated, Nazism, in reality, in one form or another, is here to stay.\tI'll finish off with the concept of the infinite book, something that he also explores throughout this text. The reason I suggest that is because this really isn't a book that you can simply read once, or even quickly. There is so much in this book that you really need to come back to it again, and again. However, this isn't necessarily an infinite book, a book that goes on forever, that is constantly being written. One suggestion is the Tales from the Arabian Nights, where half way through a narrator starts telling a story, and the story that is being told is the Tales of the Arabian Nights, meaning that we go back to the beginning and start all over again, ad-infinitum. Yet there is also the idea of the Koran, the book that is written, and exists, in heaven. Many of us see the Koran as a simple text, but to Islam it is much more that that – it is a spiritual text in that the text does not exist here on Earth, but in heaven, and what we have access to is only the worldly part of it. Yet, the concept of an infinite text is something that could be explored in further details at another time (though I wouldn't include those series that simply seem to go on forever and have no foreseeable end)."}, {"userName": "Inderjit Sanghera", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/900800-inderjit-sanghera", "userReview": "Borges miniature masterpieces reverberate with the vastness of his imagination, each short stories is a snapshot of both his endless erudition and vast imagination, as vast as the eternity which Jaromir is trapped in as he composes his masterpiece before the firing squad, as multifarious as the Judas who occupies the mind of Nile Runeberg and as mysterious as the enigmatic planet Tlon; just as Pierre Menard’s plagiarising of Don Quixote creates a richer version of the original as he suffuses his imagination with Cervantes’s, so Borges is able to suffuse the imagination with the phosphorescent beauty of his mind, iridising with the brightness of his words, all chosen with Flaubertian precision and accuracy; each story is a unique universe condensed in a few thousand words. Borges’s surreal and wonderful descriptions echo throughout his short stories, his prose is a poetic as that of the imaginary inhabitants of the imaginary planet Tlon; “There are objects of many terms; the sun and the water on a swimmer’s chest, the vague tremulous rose colour we see with our eyes closed, the sensation of being carried along by a river and also my sleep.”Indeed Borges’s stories are dream-like. They capture the limitless imaginative capacities of a dream; the freedom of a dreamer’s imagination, the vastness of the human mind is as vast as the universe in which we exist, in which all it takes is a mind to create whole new worlds and a pen and paper to suffuse these worlds with life. One feels like the paralysed Ireneo Funes who in the darkness of his room is able to recreate the world with an astonishing amount of detail, as the velvet darkness which envelopes him vibrates ceaselessly; “He was the solitary and lucid spectator of a multiform, instantaneous and almost intolerably precise world. Babylon, London and New York had overwhelmed with their ferocious splendour the imaginations of men; no one, in their populous towers or their urgent avenues, has felt the heat and pressure of reality as indefatigably as that which day and night converged upon the hapless Ireneo…Funes, lying his back on his cot in the shadows, could imagine every crevice and every moulding in the sharply defined houses around him…to think is to forget differences, to generalize, to make abstractions. In the teeming world of Funes, there were only details, almost immediate in their presence.”Borges’s world can be dizzying, as the reader seeks the navigate the labyrinths if his imagination, some passageways are macabre, such as ‘The Lottery in Babylon’, some mysterious as ‘The Circular Ruins’, yet all are magical, Borges in many ways resembles the character who wishes to bring forth another person via his dreams, Borges wishes to bring forth entire worlds via his fantasies, infinitesimal worlds which are the product of the ecstasy of the creative process;“He perceived the sounds and forms of the universe with a certain colourlessness: his absent son was being nurtured within the diminutions of his soul. His life’s purpose was complete; the man persisted in a kind of ecstasy.”Borges’s list of influences is as infinite as the Library of Babel; Kafka, Chesterton, Flaubert, folk tales, the Arabian Nights, Schopenhauer, medieval texts and the detective novel, all of these things coalesce within the synapses of Borges’s brain and send an electrical jolt down the readers spine, as they explore the world of Borges, the world of Chinese assassins and pathetic criminals, of unknown poets and lachrymose cripples, a world in which the reverberation of sunshine on the bars of a prisoner’s room is suffused with endless meaning-or perhaps, no meaning at all;“By way of a spiral staircase he arrived at the oriel. The early evening moon shone through the diamonds of the window; they were red, yellow and green.”“They arrived at their miserable destination: an alley’s end, with the rose coloured walls which somehow seemed to reflect the extravagant sunset.” “The end of his meditations was sudden, though it was foretold in certain signs. First (after a long drought) a faraway cloud on a hill, light and rapid as a bird, then, towards the south, the sky which had the rose colour of the leopard’s mouth; then the smoke which corroded the metallic nights; finally, the panicky flight of animals…In a birdless dawn, the magician saw the concentric blaze close round the walls…with relief, with humiliation, with terror he understood that he too was a mere appearance, dreamt by another.”"}, {"userName": "Josh", "userReviewDate": "Feb 22, 2008", "userURL": "http://www.goodreads.com/user/show/373817-josh", "userReview": "A labyrinth is a structure of indeterminate size made up of walls that twist and turn into the unknown, loop back around to familiar corridors and terminate in impassible cul-de-sacs. Unlike a maze – a game with an achievable goal – labyrinths are built with the intent of getting and keeping its occupants irrevocably lost.It’s kind of how I felt reading Jorge Luis Borges’ Labyrinths. That isn’t a bad thing, mind you. Borges’ storytelling is complex and dense, and some of the stories required a second skimming before I really felt like I understood them. But this “lost” feeling - of distractions by too many choices, of confusion then revelation - is inevitable in a collection of stories whose most frequently occurring theme is the idea of infinite time and space implying infinite variation.One thing that struck me as interesting is that many of Borges’ labyrinths (and as a previous poster has noted, no, he doesn’t exactly let you forget the title) are themselves books. There’s the encyclopedia of a fictional planet in Tlon, Uqbar, Orbis Tertis, an ancient Chinese novel in The Garden of Forking Paths, a verbatim rewrite of Cervantes in Pierre Menard, Author of the Quixote, a play in The Secret Miracle, a theological essay in Three Versions of Judas, a sort of historical reenactment of Julius Caesar in Theme of the Traitor and the Hero, the back-and-forth of competing philosophers in The Theologians, and more.The best example of both book-as-predestination and infinite variation themes, however, is The Library of Babel, about a library the size of the universe (or a universe whose only contents are a library). The library is a presumably infinite number of floors made of interlocking hexangular galleries, each occupied by one or more librarians and walls lined by every book conceivable – as well as some that are not. The narrative is told from the point of view of one such librarian and describes how books of every combination of letters and words possible means the biography of every individual that has ever existed or ever shall exist is shelved somewhere, how almost religious crusades have been mounted to find the one volume that describes the origination and purpose of the library itself, and how even if one comes across a book filled with seemingly garbled text, eventually another book can be found which describes that jumble of miscellany as a language, prompting the narrator to ask, “You who read me, are You sure of understanding my language?”"}, {"userName": "Sunny", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/5870882-sunny", "userReview": "Yes very impressive in places and in others unfortunately I just don’t got the grey muscle mass to understand some of his lyrical perfectionisms. This is a collection of short stories by Borges. He implies in places that life is too short so why write a 300,000 word tome when you can express the sentiment you wish to express in a few hundred words? There is one short story called the immortal which was worth reading the entire book for. That essay does what it says on the tin. What Borges does in that essay and probably throughout, similar to Nietzsche in a way, is to take you to these arid, dry, road less travelled like parts of your mind with thoughts that you may not have thought of before. He introduces you to ideas that just would not have crossed your mind in a million years and in that the book is, in key places, delectable. Here are some of his tastiest points:•\tThe idea of creating a book which takes a lifetime to get done but then is passed on to the next generation who refines it further still. I’m 300,000 words into a book of my own and am very tempted to pass it over to my 2 boys to refine after reading that. Lines that you read in books like people you randomly meet In life can be game changing in that perspective I think. •\tHistory is written by the winners – yes. History is written by men – yes. History is essentially a history of war – yes. But history is also a reflection of what we judge to have happened as individuals. You cannot divorce history from that lens. •\tEvery man should be capable of all ideas. (Unlike me :)•\tThinking is the art of forgetting differences, generalizing, creating abstract thoughts. •\tOnly animals can claim to have a concept of immortality because they alone are aloof of the concept of death. Sometimes people of the book profess immortality in another world or heaven to come but the reality with which we live our days on earth runs contrary to that assertion. We all know that one day we will die and yet we live as though we wont."}], "description": "The groundbreaking trans-genre work of Argentinian writer Jorge Luis Borges (1899-1986) has been insinuating itself into the structure, stance, and very breath of world literature for well over half a century. Multi-layered, self-referential, elusive, and allusive writing is now frequently labeled Borgesian. Umberto Eco's international bestseller, The Name of the Rose, is, on one level, an elaborate improvisation on Borges' fiction \"The Library,\" which American readers first encountered in the original 1962 New Directions publication of Labyrinths.This new edition of Labyrinths, the classic representative selection of Borges' writing edited by Donald A. Yates and James E. Irby (in translations by themselves and others), includes the text of the original edition (as augmented in 1964) as well as Irby's biographical and critical essay, a poignant tribute by André Maurois, and a chronology of the author's life. Borges enthusiast William Gibson has contributed a new introduction bringing Borges' influence and importance into the twenty-first century.", "title": "Labyrinths: Selected Stories & Other Writings", "url": "http://www.goodreads.com/book/show/336116.Labyrinths", "average": 4.46, "cover": "https://images.gr-assets.com/books/1348618104l/336116.jpg", "reviews": 1170, "authors": [{"url": "https://www.goodreads.com/author/show/500.Jorge_Luis_Borges", "name": "Jorge Luis Borges"}, {"url": "https://www.goodreads.com/author/show/986892.Donald_A_Yates", "name": "Donald A. Yates"}, {"url": "https://www.goodreads.com/author/show/10857.James_E_Irby", "name": "James E. Irby"}, {"url": "https://www.goodreads.com/author/show/3974558.Willian_Gibson", "name": "Willian Gibson"}], "type": ["Fiction", "Short Stories", "Classics", "Literature", "Magical Realism"], "outlinks": ["http://www.goodreads.com/book/show/336116.Labyrinths", "http://www.goodreads.com/book/show/1980539._", "http://www.goodreads.com/book/show/14981.Labyrinths", "http://www.goodreads.com/book/show/17717.Labyrinths", "http://www.goodreads.com/book/show/11777725-labyrinths", "http://www.goodreads.com/book/show/2762921-labyrinths", "http://www.goodreads.com/book/show/22432627-labyrinths", "http://www.goodreads.com/book/show/13451433", "http://www.goodreads.com/book/show/12283005-labyrinths", "http://www.goodreads.com/book/show/2941008-labyrinths", "http://www.goodreads.com/book/show/426504.Ficciones", "http://www.goodreads.com/book/show/5787.The_Aleph_and_Other_Stories", "http://www.goodreads.com/book/show/17961.Collected_Fictions", "http://www.goodreads.com/book/show/109237.Selected_Poems", "http://www.goodreads.com/book/show/16568.The_Book_of_Imaginary_Beings", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}