{"ratings": 50, "userreviews": [{"userName": "James Arnold", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/27982939-james-arnold", "userReview": "Just finished part two of the multi-part series about the French Revolution. Nobody goes through the drama of the day like Dumas. This chapter takes you through the specifics of the readiness and escape of the king and queen and ends in their capture. Within the popular characters are developed further and just when you think some are abandoned, bam Billot and De Charney meet on opposite sides for the first time, in a while, for a face off that really caught my attention. So much so that I had to jump into the third chapter of this saga and read 25 more pages. The reader will not be disappointed as the author takes you through each character and develops them and sets the course for their future intertwined in the story as it unfolds. I found it amazing as all this is going on the culture and proper etiquette of the day are so important that they might even be more responsible for the royal families capture than the actual revolution itself. It simply shows us how out of touch different classes of society are with one another, even today."}, {"userName": "Misfit", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "The Countess de Charny begins where [[ASIN:0548013675 Taking the Bastile]] leaves off after the attack on Versailles and the Royal family is \"escorted\" back to Paris by that same mob and are installed in residence at the Tuileries Palace, while the various factions of the National Assembly sort out the politics and fate of the Royal Family going forward. Gilbert returns as a royalist trying to keep Louis on the throne, albeit without absolute power, and the ever mysterious Count Cagliostro (formerly known as Balsamo) plots with the Freemasons to manipulate the revolution to a higher level. Also returning is the beauteous Andrée who shares a secret with Gilbert that promises to destroy the happiness she and de Charny are finally on the verge of finding (I did not see that one coming!!) and Marie Antoinette (who loves de Charny) is happy to use Andrée’s secret to keep the two lovers apart.Much of the book details known history as Louis attempts to take his family out of the country to safety, their ultimate capture and return to Paris, as Dumas weaves his fictional characters and their lives amongst those of Louis, his court and the battling factions of the National Assembly. From a secret meeting with the Freemasons as the Duc d'Orleans is sworn into membership and plots against the crown, to Dr. Guillotin’s tests on his \"humane\" invention on life size models (very creepy), to the angry mobs of Paris, to the battling parties of the National Assembly Dumas takes the reader on a fascinating journey leading up to the final horror of the revolution as The Terror begins in the sixth and last book in the series, [[ASIN:1417941391 The Countess De Charny And the Chevalier De Maison Rouge a Tale of the Reign of Terror]]. Some readers might find parts of this a bit slower paced as it's more a retelling of history and not too much action, but I loved every minute of it.Note -- there are several newer publications out there that may or may not be good translations. With one exception, The Queen's Necklace (a disappointing read due to bad translation), I've stuck to the early 1900's version published by a PF Collier and Sons. If you are interested in reading this series I recommend you stick with those. I had no problems getting copies of my via the library and they are available used online at a reasonable price."}, {"userName": "Liviu", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "recently watched the 15 episode series (in French) which dramatizes all 4 volumes of the Revolution cycle (Joseph Balsamo, Queen's necklace, Ange Pitou and this one); with an awesome cast the TV mini series focuses only on the personal aspect of the main characters (of course as the Queen is among them, there is some political stuff) and while the the 1770 part is a bit weaker (the personal stuff is faithful but that was only a part of the book) and the 1784 part is skimpy, the miniseries starts being impossible to stop watching from episode 7 or so when Gilbert comes home from America and the Revolution starts.Reminded me once again why that part (and the two books - Ange Pitou and La Comtesse de Charny which are in effect one large novel) is still among my all time favorites as i was keeping the books opened on one screen when watching the film on the other since the dialog is kept original and I am better at reading French than at listening to itThe book is still superb and the ending as bittersweet as it gets"}], "description": "Ceux de nos excellents lecteurs qui se sont en quelque sorte inféodés à nous ; ceux qui nous suivent partout où nous allons ; ceux pour lesquels il est curieux de ne jamais abandonner, même dans ses écarts, un homme qui, comme nous, a entrepris cette tâche curieuse de dérouler feuille à feuille chacune des pages de la monarchie, ont bien dû comprendre, en lisant le mot fin - au bas du dernier feuilleton d'Ange Pitou, dans la Presse, et même au bas de la dernière page du huitième volume de ce même ouvrage, dans l'édition dite de Cabinet de lecture - qu'il y avait là quelque monstrueuse erreur qui lui serait, un jour ou l'autre, expliquée par nous", "title": "La Comtesse de Charny / Le Chevalier de Maison-Rouge\n      \n          (The Marie Antoinette Romances #4 and 5)", "url": "http://www.goodreads.com/book/show/275502.La_Comtesse_de_Charny_Le_Chevalier_de_Maison_Rouge", "average": 4.06, "cover": "https://images.gr-assets.com/books/1355915160l/275502.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/4785.Alexandre_Dumas", "name": "Alexandre Dumas"}, {"url": "https://www.goodreads.com/author/show/66801.Claude_Schopp", "name": "Claude Schopp"}], "type": ["Historical"], "outlinks": ["http://www.goodreads.com/book/show/275502.La_Comtesse_de_Charny_Le_Chevalier_de_Maison_Rouge", "http://www.goodreads.com/book/show/1251894.The_Countess_De_Charney_and_The_Chevalier_De_Maison_Rouge_A_Tale_of_the_Reign_of_Terror", "http://www.goodreads.com/book/show/7126.The_Count_of_Monte_Cristo", "http://www.goodreads.com/book/show/7190.The_Three_Musketeers", "http://www.goodreads.com/book/show/54499.The_Man_in_the_Iron_Mask", "http://www.goodreads.com/book/show/388223.The_Prince_of_Thieves", "http://www.goodreads.com/book/show/7184.Twenty_Years_After"]}