{"ratings": 876, "userreviews": [{"userName": "JF", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/28759500-jf", "userReview": "(Je me suis lancé dans la lecture de 1er tome des Chroniques du Plateau car j'avais adoré le 2e \"Thérèse et Pierrette à l'école des Saints-Anges\", que j'avais eu à lire en cours de francais y'a à peu près 20 ans au cégep.)Je lui donne 3 étoiles sur 5 malgré mon désir au début de lui en donner qu'une seule et celui, à la fin, de lui en donner 5.J'ai failli laisser tomber le livre, que je trouvais plate à mort, jusqu'à la page 100 environ où j'ai trouvé qu'il commencait vraiment à se passer quelque chose. Ca commencait finalement à ressembler à une histoire.Par contre j'encouragerais pas personne à commencer le livre à la page 100 sous peine d'être tout fourré parmi les nombreux personnages dont le destin converge en avancant dans le livre.Est-ce que c'est vraiment parce que le premier tiers du livre était plate? Ou si c'est moi qui a pris du temps à rentrer dans l'histoire? Je sais pas trop mais une chose est sûre c'est que plus j'avancais et plus le plaisir de lire devenait évident. Ben content de pas m'être privé de ce plaisir là finalement :-)"}, {"userName": "Elisala", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/54932067-elisala", "userReview": "Chouette découverte. C'est drôle et sérieux et triste à la fois, un peu mystérieux, aussi, mais un mystère qui s'installe doucement. C'est plein de personnages (on s'y perd un peu parfois, je l'avoue) tous plus sympathiques et irritants les uns que les autres. Le tout enrobé dans un accent québécois irrésistible (mais un peu agaçant à force, je l'avoue). L'accent québécois rendu à l'écrit, c'est seulement pour les dialogues, c'est ça qui est drôle, la narration sinon est sans accent... (c'est un peu bizarre dit comme ça)Et puis surtout, toutes ces relations humaines, ces crasses, ces peurs, ces colères, c'est chouette, vraiment ; avec des réflexions sur les méfaits de trop de puritanisme et d'ignorance, tellement sérieuses au milieu des dialogues décontractés! Elles n'en prennent que plus de poids..."}, {"userName": "Micha Meinderts", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/2110759-micha-meinderts", "userReview": "I really enjoyed this novel, much to my surprise. In fact, I was sad I finished it and wanted to read more about the characters. I did think there were a few too many of them, some even had similar names so keeping track was a little hard, but I enjoyed the little view into people's lives that I wouldn't have had otherwise. It felt really authentic and I was surprised that it was written thirty years after it was set. For all the pregnancies for me it was obvious it was written by a man. The pregnancies were written from the outside in, by someone who had heard women speak about it but never really experienced it or anything. I haven't either, obviously, but it did make it harder to get into the head of some characters. I couldn't feel what they felt because the author only observed.The only other thing I felt was really annoying, even though I got used to it, was the complete lack of paragraphs. I have no idea what the hell was up with that, but it sucked big time."}, {"userName": "rob", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/4554029-rob", "userReview": "Well written but it felt like a finely developed background without a focal character or characters to ground the story in a sense of progress. I get that it was meant to be experimental and that each vignette is perhaps meant to stand alone as a glimpse into the working class lives of what could be any French Canadian town in Quebec. But with a focus character it might have made it easier to follow, much of the time I was struggling to remember how the characters were related to each other and by the book’s end I was still unsure which of the women the ‘fat woman’ actually was. I think he has a way with writing; it would be nice to read a work of his with a more traditional plot structure."}, {"userName": "Lauren", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/26550396-lauren", "userReview": "[he gets in the fight and is mortally wounded... I cried and could not pick the book up for a few days afterwards. (hide spoiler)]"}, {"userName": "Linda", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/2890071-linda", "userReview": "Set in a working class neighbourhood in Montreal, May 1942. It follows the lives of 7 Francophone women who are pregnant, with only \"the fat woman\" who is truly in love with her expected baby."}, {"userName": "Hannah", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/1939653-hannah", "userReview": "Duplessis stole the show for me."}, {"userName": "Anabelle", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/63229792-anabelle", "userReview": "2,5/5 étoiles Je commence à craindre que Michel Tremblay ne soit pas pour moi. J'ai lu \"Contes pour buveurs attardés\" pour l'école l'an dernier et j'avais eu de la difficulté à passer au travers. Ce fut encore le cas avec \"La grosse femme d'à coté est enceinte\". Ça m'a tout pris pour le terminer. Le problème ce n'est pas le style d'écriture; je l'adore. Souvent lorsque les gens de retranscrire l'accent québécois dans les livres, ça m'énerve, je trouve ça forcé et pas naturel. Cependant, lorsque Michel Tremblay le fait, c'est parfait. Ce qui aurait été forcé, c'est si les personnages avaient parlé dans un français \"international\". C'est probablement parce que même la narration portait des traces de vocabulaire québécois. C'était tellement réconfortant de voir ma façon de parler représentée fidèlement. C'était aussi intéressant de constater le quotidien des Québecois vivant à Montréal au début des années 40 ainsi que leur position vis-à-vis la deuxième guerre mondiale. Non, le problème c'est tout le reste, l'action et les personnages. C'était tellement ennuyant, il ne se passait rien et je ne ressentais aucun attachement envers les personnage. Bref, je suis vraiment triste que Michel Tremblay n'aie toujours pas réussi à ravir mon coeur parce que c'est un auteur québécois majeur. Je crois que je vais lui donner une autre chance."}, {"userName": "Frank", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/11996013-frank", "userReview": "The first novel in Michel Tremblay's sexology, Chroniques de Plateau Mont-Royal, is one of his best. It recounts a day in the life of an extended working class Montreal family during World War II as the matriarch, Victoire, leaves the apartment for her first walk in months (and possibly her last), her grandchildren spend a day in the park, two streetwalker neighbors flee some sailors one of them robbed, and an aging streetwalker related to one of the younger prostitutes decides to end it all. Through all this the unnamed fat woman (modeled on Tremblay's mother) tries to survive another day of confinement in the apartment during a difficult pregnancy. All of this is watched over by a ghostly family next door -- three spirits who could be the fates -- giving the novel an element of magical realism. It's an amazing juggling act that Tremblay will carry through five more novels, weaving a mosaic of life among working class French Canadians during the last years of the Duplessis era of oppression by church and state. If you wish to follow the family's history through the novels and related plays, you might want to read his play \"Past Imperfect\" first, another day in the family's life, years earlier, when Albertine, Victoire's daughter and an increasingly important part of the sexology, gives up all hope of happiness."}, {"userName": "Neil Mudde", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/2034390-neil-mudde", "userReview": "In the 60's I used to watch \"The Plouffe Family\" on the CBC it gave me a small sense of Quebec, at that time as a recent immigrant to Canada made me understand that Quebec was a unique, and different . culture.There is a 16th century Dutch Painter called Jan Steen, who painted portraits of Dutch families their living quarters in total disarray, I used to be fascinated by all the details of absolute \"no no's\" in the family in which I was raised, there is a bit of similarity by reading this book.Reading \"The Fat Woman next door is pregnant\" was a wonderful daytrip into a rather unusual household/area in Montreal in the 40's.Far too many characters to write about,they are all unique and show their own quirks. Fathers of large families did not have to go to war, would or flat feet for that matter. .Gabriel is the fat women's husband, the fat women is 40 years old and expecting, which is being frowned upon, was this done in order to avoid the draft no says Gabrielle because he loved her, and wants another child. (no idea if they have other children) Gabriel would hold forth in the local bar usually ending up coming home drunk. It was the opinion of many people that France had turned its back on the Quebecois, in fact spit in their face, so why fight for them. there is the descriptive bustrip when some the ladies are going downtown, having a great old time, however when they get to the section were the furniture stores are,some of them need to duck down so that the owners of these stores wont see them, since they are behind on their monthly furniture payments. Getting into the narrative, there are so many characters, some even with similar names that at times it is difficult to keep track of who is who. Mercedes and Beatriz are the \"chippies\" of the neighbourhood,after having worked in the garment industries like slaves realize it is easier money to turn tricks, at one point they( or one of them) bring home three drunken sailors,who after passing out they go through their pockets and roll them find $52.00 off course they are filled with fear that they may return, and for that reason are looking for a place to stay overnight so the sailors wont find themTi-Lou,a seperate book could be written about her,she had been introduced to Sarah Bernardt! and some of the other characters.Duplessis surely my favourite character in the book, an arrogant cat, who's owner Marie-Sylvia ( who does not wear shoes as these could never be seen behind the counter!) treats him like a baby, but only when he allows her to do so, in fact he does not like her at all, and only gets on her lap, and purrs when he knows there will be some special food in it for him, he loves Marcel, who sometimes goes into the parc and playes, one day Duplessis is off to the park but meets the dog Godbout, who attacks him and battles him close to death, until he manages to get home crawl under the porch were he is found by Marcel who takes him to one of the knitting ladies, one floor up.Edouard with brylcreemed hair is a dapper if not gay character, with his flamboyant manners, at one point a child calls him \"Tante Edqouard\" There is a segment were Victoire his mother who limps on one leg decides she has had enough of laying around and demands being taken for a walk around the neighbourhood, getting all dressed up much to the embarrasment of Edouard and the neighbourhood, at one point she takes him to the park regales him about the olden days how a boat was launched with all the dignitaries present, however at the boatlaunching it goes front first into the lake, sinks, so that the aft his sticking out of the water, and after a few minutes breaks in half, leaving the dignitaries red faced. She then proceeds by taking him to the spot were she and Edouards father made love on the ground when Edouard was conceived.We end up home with everyone present a wonderful soup has been prepared by Albertine, (Edouard's Sister,who dislikes the chippies, lo and behold Mercedes and Beatriz arrive and Albertine refuses to serve them, however Victoire insists they stay, and that she will ladle out the soup, the meal concluded Victoire's brother tells the story about hauling the moon out on a daily basis, at this point I am desperately looking to see what has happened to my beloved Duplessis, well he is on the lap of one of the knitters one floor up and even though blood crusted and smelly falls asleep, and I can only hope Duplessis gets well.It is a book, that I will need to re-read and focus in on some of the characters, but I feel like I have spent a few hours on rue Fabre, in Montreal, a wonderful rompy read."}, {"userName": "Kay Palkhivala", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/27191726-kay-palkhivala", "userReview": "The book is apparently one of a bunch, that together draw a portrait of a neighbourhood. It's probably not really fair to judge this one alone, but here goes. As a piece of sociology, it is certainly interesting, but I hope not accurate, as the neighbourhood is composed of people who are perpetually angry, mean, narrow minded and fearful. Nobody seems able to show kindness, empathy or compassion, until the end. The grandmother's idea of fun is to try to make her daughter enraged! The last third of the book, that takes place on a day in Lafontaine Park, almost reads like another novel entirely; people are actually nice to each other. Josaphat-le-Violon seems to be the only one who is fundamentally kind and considerate. His story about the moon is great, and he has a good effect on the others while he's in the house. There are some really creepy bits, such as Therese and the young park attendant, that make one fearful for the future of these characters. I wonder if Tremblay would have written the same way nowadays when we are more conscious of how dysfunction passes down the generations. He seems to regard the general neglect of children as perfectly normal. As a piece of literature, it isn't impressive. I don't think much of Sheila Fischman as a translator; unless Tremblay really writes in that flat, dry, jerky style. The \"skipping around\" is not really a problem as everything goes to make up the portrait. The characters are quite two-dimensional, the only thing that makes them more that cliches is their bad tempers! There is no plot, really, so one can't get confused about what happens when. The setting is familiar to us Montrealers, but apart from the street names, it's just sketched in. The only evocative writing is Josaphat's moon story. I think the book, and the rest of the set, are popular because there isn't much competition for stories about life in \"balconville\". But the story is not humorous, heartwarming, colourful or appealing. I don't want to spend more time with these people, what's to love?I did like the invisible immortal neighbours and their perpetual knitting. They have elements of the Greek three Fates. I wish their significance had been more developed, but maybe that happens in a later book. I also liked the bits told by the cat. Cute idea that the fat woman of the title has no other name. Do you suppose this means she isn't really \"one of us\" in that family?Also loved the swearing, French Canadian style, tabernac! And a wonderful diatribe on the Catholic Church, starting on page198. Well said!"}, {"userName": "Peachy", "userReviewDate": "Mar 04, 2009", "userURL": "http://www.goodreads.com/user/show/2095554-peachy", "userReview": "The budding of spring, a time for enlightenment and new beginnings, casts the mood for this beautiful and haunting tale told through magical realism, and reverent love for family, a place and a time. Michel Tremblay’s passion for his beginnings is shared with us through a day in the life of the residents of la rue Fabre in the heart of Montreal in the ‘40s, with the fat lady next door paying homage to his beloved mother. The mystical sisters, Rose, Violette and Mauve, have sat in their rocking chairs knitting booties for generations of the past, and persevere for seven babies soon to be, the magical triple clicking of their needles a necessity for continuum. Helplessly driven by a predetermined pattern, they are merely observers to the struggles of their tormented neighbours, as they sit with instruments in their hands and compassion in their hearts.The eccentric and opposing personalities Tremblay presents us with intermingle through the pages amidst their willful ignorance, blinding judgements, and suffocating shame. These transgressions, perpetuated by the shadow of a stifling religion, a begrudged war, combined with a lack of imagination, serve to disquiet them as they struggle to find their footing on the soft ground of the changing season. The Fat Women Next Door is Pregnant although brimming with delicious prose, did prove to be a difficult read at times. The compilation of 22 distinctly different, three-dimensional characters – a supercilious cat, a matriarchal witch, the she-wolf of Ottawa – and a writing style with no regard to paragraphs or a properly referenced dialogue, left my head swirling on more than one occasion. Seemingly each and every character begged to have their depth explored and their connection with the reader furthered, and as such, I think the story would have been better served as an elaborate, 800-page epic. Aside from this, I came away from the novel with the feeling that ‘family’ is the true essence of our being, as through all of the chaos and ridicule that can be found on these pages, the love that emits from this clan is a fortress of undeniable strength and authenticity. By the end of the story you’re sure to have a fondness in your heart for the fat woman next door. www.booksnakereviews.blogspot.com"}, {"userName": "Darren Clever", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/56174532-darren-clever", "userReview": "Un de mes livres préférés de M. Tremblay. Un récit magnifique de ce quartier ouvrier de Montréal."}, {"userName": "Mrsgaskell", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/4093272-mrsgaskell", "userReview": "The Fat Woman Next Door is Pregnant was one of the contenders for Canada Reads 2009. I decided to read it in the original French and am pleased I made the effort after reading an excerpt from the English translation. The flavor is not quite the same without the Quebecois slang. The action of the novel takes place in a Montreal neighbourhood on one day, May 2, 1942. The colourful cast of characters includes three generations of a working class family all crowded together in one household, grandmother Victoire, her three children: homosexual Edouard; Albertine, the mother of 11 year-old Therese and four-year old Marcel; Gabriel, his bedridden fat pregnant wife, and their sons Richard and Phillippe. Albertine’s husband is serving overseas in a war that many feel does not concern them. Gabriel on the other hand is accused of having impregnated his 42 year old wife to avoid military service. The neighbours include prostitutes Mercedes and Beatrice, restaurant keeper Marie-Sylvia and her cat Duplessis, and a good half dozen pregnant women. The neighbourhood abounds with life and gossip. Unseen and watching over Victoire’s family, there are also Florence and her three daughters, Rose, Violette, and Mauve, constantly knitting like the three Fates. Well-observed and well-written, this book makes you feel like you are there, among real people."}, {"userName": "Elisabeth", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/10329237-elisabeth", "userReview": "Parution en 1978Auteur prolifique québécois né en 1942.Première tome des Chroniques du Plateau Mont-Royal.Le roman se déroule sur une seule journée, le 2 mai 1942, dans un quartier de Montréal. Une famille entoure une femme enceinte, la femme de Gabriel, fils de Victoire et frère d'Albertine (mère de Marcel et Thérèse), et d'Édouard, vendeur de chaussures obèse. (Wikipédia)Plusieurs voisins les entourent : les prostituées Mercedes et Béatrice, et une marchande Marie-Sylvia dont le chat se nomme Duplessis.Plusieurs femmes sont enceintes: la femme de Gabriel, les trois sœurs Germaine, Rose, Gabrielle, les voisines Claire et Marie-Louise. L'auteur les suit durant cette première journée chaude de mai, en quête de leur passé et de leur avenir.Présence des trois Parques (Violette, Rose et Mauve) qui tricotent l'existence, de la naissance jusqu'à la mort. Roman à la limite du fantastique avec la présence surréelle des voisines fantômes.Références au milieu ouvrier montréalais du début du XXème siècle.4/5... La jonglerie entre les différents personnages est admirable. Quand le quotidien devient héroïque."}, {"userName": "Lauren Simmons", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/7486119-lauren-simmons", "userReview": "This book surprised me. It starts slow, confusingly, as you try to keep track of the many French Canadian names and the relationships. Having a working knowledge of Montreal geography, particularly the area around Parc Lafontaine certainly helped (and of course the book made me long for Montreal...). But, wow. What an interesting perspective on the war years in Quebec. I'm not too familiar with this time in the province's history, but as a woman whose sexuality owes at least some of its liberated-ness to the fact that I lived my early 20s in Montreal, it was enlightening to see a pre-sexual-revolution Quebec from through several rather repressed women's eyes. Tremblay is a master of dialogue, of course, but this book reveals also his ability to get inside the head of such a wide range of characters, from a barely-three-year-old boy to a thirteen-year-old-girl to a neighbourhood cat to... well, you'll see. A lot of unanswered questions at the end of this book as it's the first in a series, but I am just more motivated to read the rest."}, {"userName": "Mireille", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/3006017-mireille", "userReview": "Comme c'est étrange de lire ce roman dans l'ordre chronologique de l'histoire mais pas de l'écriture. On sent que l'écriture est moins polie que les romans de la Diaspora que je viens de terminer, mais l'histoire est toute aussi fraîche et les personnages savoureux. Quelle belle auberge espagnole que cette maison de la rue Fabre! J'ai eu énormément de plaisir à le lire. La scène finale était vraiment charmante.J'ai enlevé une étoile parce que j'ai été souvent distraite par des détails qui ne correspondaient pas aux romans \"précédents\" (notamment sur le passé de Ti-Lou, et sur Victoire et Josaphat). On aurait dit que Tremblay avait voulu enrichir les histoires de certains personnages mais qu'il avait oublié quelques détails qu'il mentionne ici. Enfin. Aussi, j'ai pas tripé sur le chat Duplessis. Sinon, un roman que je recommande à tous, et que selon moi tous les Québécois devraient lire!"}, {"userName": "Jennifer", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/2635637-jennifer", "userReview": "this is an interesting look at an odd group of neighbours in Montreal, during WWII. Tremblay is very astute - his poignant and powerful commentary on social, gender, religious and political issues has moments that hit quite deeply. the story offers POVs from several different characters and i enjoyed this (what a cast of eccentrics tremblay has created!), but i did lament not getting to know a couple of characters - who were standouts for me - a bit better. i felt the summaries at the end were a bit too rushed, puling certain lives into focus for us from beyond the end of the book. at certain points during the read, i felt a couple of characters were worthy of their own novels, rather than being a small part of this work. perhaps characters will further develop as the series goes on? as i have gone on about before when i have encountered her, Sheila Fischman is an awesome translator."}, {"userName": "Czarny Pies", "userReviewDate": "Sep 27, 2014", "userURL": "http://www.goodreads.com/user/show/29160274-czarny-pies", "userReview": "La grosse femme d'a cote est le premier volume d'un grand cycle de romans qui decrivent un quartier populaire de Montreal des annees quarante. Je suis ne durant les annees cinquante mais mes conversations avec mes cousins et des amis qui y vivaient a l'epoque ou les evenements des romans se passaient me convaincent que Tremblay decrivent tres bien le quartier ou il a passe sa jeunesse.Pourtant il faut comprendre que Tremblay etait au somment de son art en tant que dramaturge. Pour apprecier Tremblay a son meilleure je vous conseille de lire: Les belles soeurs, Hosanna, Je suis toujours la, ta Marie - Lou."}, {"userName": "Shannon", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/1715547-shannon", "userReview": "I think I would have liked this book more if it had been one that I read with my bookclub or in some circumstance where I can sit there and analyze it. As just a story and without any in-depth analysis I did not really like it. There were too many characters that you never really get to know well enough to really care for or about them. At times the story was confusing.I was also a bit perplexed by Terese and the boy watching the playground. It made it sound like Terese and the boys mother are responsible for making a future pedophile out of him but we are left hanging... I just wished that I got more out of each character or more out of fewer characters."}, {"userName": "الخنساء", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/2848640", "userReview": "لا بد من عودة بإذن الله--عدناشهادتي في الروائي مجروحة فأحب فيه سخريته اللاذعة واللذيذة للغاية رغم الترجمة التي تخفق في بعض المواضع لكن روعته لا تخفى رغم ذلك، الرواية تتحدث عن مجتمع كيبيك (مقاطعة فرنسية في كندا) في النصف الأول من القرن العشرين حيث المجتمع ريفي ومتعصب ومنغلق ومتخلف بالطبع، فترة ماقبل الثورة الهادئة في هذه المقاطعة وكيف يتعامل المجتمع مع بعضه وكيف ينظرون للآخرين وكيف ينظرون لأنفسهم وتعبيرهم عن رغباتهم وتطلعاتهم المكبوتة كذلكقرأتها في فترة مربكة وتملكتني رغم ذلك :)ممتنة لعجوز قابلته في آخر معرض كتاب في جدة في ٢٠٠٥م ربما واقترح عليّ هذا الروائي واخذته منه \"الصديقات الثلاث\" بامتعاض وتشكك وبودي لو اعرفه فأعود وأشكره كثيراً"}, {"userName": "Sheena", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/5172305-sheena", "userReview": "This was a pretty good novel. I liked that it felt very real, yet had an element of fantasy, what with the \"fates\" living next door. The story takes place over one day and different sections are told from the point of view of different characters, even a cat. I didn't like that the prose was not set up in paragraph format. Every section was one huge paragraph; even the dialogue ran into each other so sometimes I wasn't sure who was speaking. In places I couldn't tell if the dialogue was spoken out loud or if the character was just thinking. I get a little frustrated if I have to read over a section because I can't tell what's going on."}, {"userName": "C", "userReviewDate": "Dec 15, 2008", "userURL": "http://www.goodreads.com/user/show/21322-c", "userReview": "found this book confusing as there were many characters and it shifted swiftly from one group of people to another.The book's paragraph structure was also annoying and slowed the reading down. Dialogue, while within quotation marks, was not separated from one person to the next, so you'd be reading along and have to watch out for the end quote/open quotation marks so that you could tell who was speaking.While sometimes amusing, I found it tiring and found myself just reading through so I could finish it."}, {"userName": "Knitography", "userReviewDate": "Jun 17, 2010", "userURL": "http://www.goodreads.com/user/show/2493226-knitography", "userReview": "This is one of those books that is truly all about the characters, all of them incredibly well-drawn. They are funny, infuriating, complex, flawed, and wonderfully well realized. This book is a slice of life; it immerses you in the sights, sounds, smells and dramas of a group of people living in a particular place and time. At the end of it, you just know that if you were magically transported to la rue Fabre in 1942, that you'd recognize it and even feel at home. I look forward to reading the rest of the series!"}, {"userName": "Jeanette", "userReviewDate": "Nov 06, 2009", "userURL": "http://www.goodreads.com/user/show/2855304-jeanette", "userReview": "I found the first part of the book difficult to understand because Michel Tremblay does not use paragraphs or quotations marks in his writing. After I used a piece of paper to write down all of the characters and which families they belonged to, I enjoy reading the book. Michel Tremblay is a play-write and I would love to see the book produced as a play. The story takes place in one day on a street in Montreal and gives a snap shot of the people and their thinking of the time."}, {"userName": "Donna", "userReviewDate": "Jan 11, 2008", "userURL": "http://www.goodreads.com/user/show/760831-donna", "userReview": "I tried to read this while my dad was in the hospital, and just couldn't concentrate or focus on it. Too many characters, too many five-page-long paragraphs, yet I certainly sensed a glimmer of a wonderful story buried in there somewhere. My rating doesn't reflect on the book so much as my inability to absorb anything when I read it. Definitely needs a re-read to give an honest rating that would be fair to the book and the author."}, {"userName": "Bruce MacKay", "userReviewDate": "Apr 14, 2011", "userURL": "http://www.goodreads.com/user/show/5264050-bruce-mackay", "userReview": "tough to follow. i had great difficulty following, and enduring, the characters.when a novel, a book for pleasure, confounds me this much-- especially when i'm less-than-motivated by the plot-- i'm usually totally comfortable putting it away forever!in this case, it was too much work for too little pleasure/ literary reward!decent book, i'd say; but it absolutely never captured my imagination."}, {"userName": "Mary Burns", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/22424116-mary-burns", "userReview": "Such a genuine feel of street life, the crowded apartments, neighbours commenting on one another, unique characters, but also the sense that all this is happening within the larger frame of myth. While it is a particular \"coin\" de Montreal that Tremblay writes of, his themes are universal. Loved it."}, {"userName": "Marie-Hélène Gagné", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/16312756-marie-h-l-ne-gagn", "userReview": "J'ai mis 2 étoiles pour dire qu'il était OK. Sans plus. Je l'ai lu car il faut au moins essayer un Michel Tremblay quand on aime la lecture! De plus, l'histoire se passe à Montréal : ça me donnait l'envie de me promener dans les rues, de visiter le parc Lafontaine, le plateau Mont-Royal... Bref, c'est un livre qui représente si bien Montréal."}, {"userName": "Pascal", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/13047691-pascal", "userReview": "Excellent. Même si la structure du livre peut paraître un peu brute d'aspect, on se délecte vite de la description faite de cette famille, de cette rue populaire à Montreal. Les images et idées véhiculées sont intéressantes, les dialogues grandioses (même si on ne comprend pas tout en Québécois), et les situations burlesques. On a hate de lire la suite des Chroniques du Plateau Mont-Royal..."}], "description": "Au coeur du Plateau Mont-Royal, ce quartier populaire de Montréal qui prend des allures de véritable microcosme social, une femme de quarante-deux ans, enceinte de sept mois, devient le centre d'un monde réaliste et fantasmagorique. Dans la journée du samedi 2 mai 1942, alors que tourbillonnent émotions et drames de la vie privée, le romancier met en place, avec un grand bonheur d'écriture, les acteurs du premier tome des \"Chroniques du Plateau Mont-Royal\".", "title": "La Grosse Femme d'a côté est enceinte\n      \n          (Chroniques du Plateau Mont-Royal #1)", "url": "http://www.goodreads.com/book/show/31445040-la-grosse-femme-d-a-c-t-est-enceinte", "average": 3.67, "cover": "https://images.gr-assets.com/books/1471193406l/31445040.jpg", "reviews": 77, "authors": [{"url": "https://www.goodreads.com/author/show/264019.Michel_Tremblay", "name": "Michel Tremblay"}], "type": ["Cultural", "Fiction", "Cultural", "Literature", "Academic"], "outlinks": ["http://www.goodreads.com/book/show/31445040-la-grosse-femme-d-a-c-t-est-enceinte", "http://www.goodreads.com/book/show/17319309-la-grosse-femme-d-a-c-t-est-enceinte", "http://www.goodreads.com/book/show/1800332.The_Fat_Woman_Next_Door_Is_Pregnant", "http://www.goodreads.com/book/show/1507714.La_grosse_femme_d_c_t_est_enceinte", "http://www.goodreads.com/book/show/2415759.La_grosse_femme_d_c_t_est_enceinte", "http://www.goodreads.com/book/show/7991047", "http://www.goodreads.com/book/show/1800336.Les_Belles_Soeurs", "http://www.goodreads.com/book/show/1800361.Un_ange_cornu_avec_des_ailes_de_t_le", "http://www.goodreads.com/book/show/1177365._toi_pour_toujours_ta_Marie_Lou", "http://www.goodreads.com/book/show/1800383.Th_r_se_et_Pierrette_l_cole_des_Saints_Anges", "http://www.goodreads.com/book/show/1800338.Albertine_en_cinq_temps"]}