{"ratings": 1272, "userreviews": [{"userName": "Carina Carvalho", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/37217244-carina-carvalho", "userReview": "Tanto para dizer sobre este livro! A história decorre na Jamaica, uma terra maravilhosa que já tive o prazer de visitar. A escritora descreve a de forma esplêndida, areias brancas, mar maravilhoso e uma natureza fenomenal. Tive o prazer de ver o pôr do sol mais lindo que alguma vez pensei ser possível. Um bocado do paraíso na terra. A história desenrola se nos tempo da escravidão, e realmente o ser humano pode ser muito desumano independentemente da sua cor de pele. Nora tem uma história de vida impressionante! Agora fico á espera do segundo volume.... Ansiosamente"}, {"userName": "Sophia", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/5063928-sophia", "userReview": "A historical saga beginning in 1730's Georgian London and continuing on to the island of Jamaica following the lives of colonials and slaves alike was rather enticing to me. This was a ponderous book much in the general way of sagas, but the colorful and dynamic story was worth it.Island of a Thousand Springs is told in parts. Part one is of a very young and naive Nora Reed with her first love and under her wealthy merchant father's gentle care. She goes through first heartbreak, scandal and comes through it to move on with sugar plantation owner, Elias Fortnum to his island home.On Jamaica, Nora's life is a balance of dues and rewards for accepting Elias' hand. She is faced with the very real reality of slavery for the first time. And then she is faced with disillusionment, another chance at love, betrayal, hardship, and a new reality.The story is told mostly from Nora's perspective, but many others get quick narrative moments which helps to see motive behind actions. This saga is a well-written historical piece, but also offers the story of people from both slave, free, and master classes. Life, love, hardship and hope bring these people alive. I connected with several and loved how the author worked their story into the time of history well. I started out without much connection to Nora. She was so young and sheltered. She was in love with a man who lost his family title and lands due to his father's debts. Simon was aesthetic and a dreamer and too delicate for hard life. His family ran him into the ground demanding what he did not have to give (clothes, dowry, niceties) while he's in poverty dwelling in a leaking, freezing attic in the deplorable east in. Nora wasn't much better at first with her ideas of courtship and her refusal to understand that Simon could not just approach Mr. Reed with a marriage offer based solely on 'we love each other'. But then hardships came and she grew and had a core strength and dignity that had my respect and need to see her through the bad times.Each stage of the book could be defined by Nora's time with the different men in her life: Simon, Elias, Akiwasa, and Doug. They each wanted her for very different reasons and for the longest time she clung to her Simon and their dream. It's where she went inside her head when she needed an escape. She was not like the other planter's wives in that she was anti-slavery and came from merchant stock so she was hardier and more practical. I loved seeing her quietly come into her own on that plantation.Speaking of this historical time period, the terminology of this book reflects the thinking and way of talking back then. It makes a modern reader cringe with the 'N' words, the way a whole ethnic group was de-personalized even down to refusing them baptism if they wanted it or marriage because the preferred thinking was that the slaves had no souls and were not people. Ugh, it was hard to read. I had much to ponder as I read. A curious part was the stratus within the black community. The tribes represented on the plantations and in the free Maroon communities were as diverse from each other as from the whites. There weren't mass uprisings because some of those mixed together on the plantations were sworn enemies and would rather work the white man's fields than consort with their hated enemies from Africa. Many saw enslavement as just bad luck because back in Africa losing at tribal war or war with other groups on the continent resulted in being taken as slaves. The difference was that the slavery within Africa wasn't a de-personalization like this situation. There were all sorts of ways of thinking on the part of African slaves, Maroons, and whites that were discoveries for me.On a side note, I read this as a translated story. The author is German and the book was not written originally in English. The translator, Sharmila Cohen, did a fantastic job. If I didn't already know this was not written in English, I wouldn't have guessed that and kudos to her since there was a lot of tricky historical terminology specific to time, region, and ethnic group.So this is a huge historical saga about Nora and the plantation there on Jamaica. It's slow to get rolling, but this changes once she's in Jamaica. Those who enjoy the bigger stories with broad casts of characters where history and individual character stories are woven together should give this a try. I received this book from Net Galley in exchange for an honest review."}, {"userName": "Floripiquita", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/63637736-floripiquita", "userReview": "El protagonista masculino me ha encantado."}, {"userName": "María Valero (Mecomenloslibros)", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/51486503-mar-a-valero-mecomenloslibros", "userReview": "Me ha enganchado muchísimo, desde el principio. Y la historia me ha gustado bastante; sin embargo, aún hay algo que todavía no me llega a cerrar del todo..."}, {"userName": "Lois", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/5332000-lois", "userReview": "¡¡¡Gran inicio para la trilogía del Caribe!!!Siglo XVIII. El destino llevará a Nora Reed a las plantaciones coloniales de azúcar de la Isla de Jamaica. Allí descubrirá que el exotismo de ese lugar, contrasta gravemente con las dolorosas condiciones de vida de los esclavos que viven y trabajan esas tierras. Presa a su vez de un matrimonio sin amor, Nora luchará con valor por mejorar la situación de los esclavos; sin embargo, la rebelión de los cimarrones dará un giro de 180º a su vida.Puntuación: 5/5"}, {"userName": "Moradus Warden", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/24453361-moradus-warden", "userReview": "Muy buen libro! me gusto mucho! te atrapa en la historia y quieres seguir y seguir para ver que pasa! Espero la segunda parte!! Y aprendes sobre esa epoca!"}, {"userName": "Austra", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4288632-austra", "userReview": "Šis ir ne pirmais Sāras Larkas romantiski vēsturiskais romāns, kas nonācis manās ķepiņās. Tādēļ es jau zināju, ko gaidīt, un ko ne. Neesmu Jamaikas un vergturības vēstures speciālists, tāpēc nevaru diskutēt par grāmatā minēto faktu saistību ar realitāti. Dažas radušās šaubas autore pati izskaidroja pēcvārdā, par to viņai žetons.Visumā jauks un, protams, dramatisku pavērsienu pilns stāsts zem tveicīgajām Jamaikas debesīm. Par sliktajiem, labajiem un pilnīgi trakajiem. Par vergturiem, vergiem, cukurniedrēm un pūderētām parūkām. Un par mīlestību drusciņās arī. Bet vispār diezgan bagātīgs vēsturiskais fons, kas ir īpaši jauki. Lasījās ātri un ar interesi. Ja kiwi triloģijā man bija par daudz drāmas (nu cik var mocīt tos galvenos varoņus?), tad šeit bija nu tā ok, paciešami. Drusku gan besīja tie tiepīgie un apsēstie cilvēki, bet tādi jau viņi laikam arī dzīvē ir. Bet beigās visi (relatīvi) laimīgi. Lasīšu arī otro daļu par jaunās paaudzes priekiem un bēdām. Vairāk par 3 zvaigznēm gan kaut kā neprasās likt, jo tomēr gana daudz klišeju, bet savam žanram - labi."}, {"userName": "Ruth", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/39589941-ruth", "userReview": "Es entretenido, aunque también tiene algún que otro tópico y personaje estereotipado. Me ha costado empatizar con la protagonista (demasiado superficial, muy idealizada, poco \"humana\"...). En general, me ha gustado."}, {"userName": "Emma Crowley", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/3981397-emma-crowley", "userReview": "Nowadays lots of books are described as being sweeping sagas and I have to say having read Sarah Lark’s novel Island of a Thousand Springs this definitely fits that category. Sarah Lark’s writing is similar to the stunning novels written by Lesley Pearse. If you are a fan of Lesley’s (like I am) you will certainly love this wonderful, exciting novel. At over 500 pages long you will savour every page as you are taken on a voyage of discovery and transformation.We first meet Nora Reed in 1700’s London at a time when the merchant trade was reaching its height. Born into a life of privilege her father Thomas Reed has had plenty of success with his business and employs numerous men, one of whom Nora falls over head over heels for. Simon a desk clerk came from a wealthy background but his father had died leaving numerous debts which Simon is struggling to repay. Nora knows Simon does not meet the marriage standards her father desires for her but matters of the heart often rule over the head and they embark upon an affair. Sadly forced to live in the East End Simon contracts consumption and despite Nora’s best efforts at nursing him Simon passes away. Nora is exposed to the poverty and depravation the people of the East End are forced to endure and it is here her caring nature first comes to light. The stark contrast between the rich and poor at this time is demonstrated when Nora gives up everything to care for Simon as we read in great detail the daily grind and struggle these people are forced to cope with.Nora’s one true love has gone and after two years of grieving she meets Elias Fortnam a sugar cane planter from Jamaica. Yes he is older than her but the one wish Simon and Nora had had was to travel to Jamaica and live there in a hut by the sea. Nora agrees to be married, it is clear she is not marrying for love , it is more a business arrangement but in this way she fulfils her dream .Once we are transported to Jamaica the novel takes on a whole new meaning. There are endless fabulous, evocative descriptions that really made me feel I was there walking in Nora’s footsteps as she lived, breathed and experienced life on a sugar cane plantation and became aware of the harsh realities the slaves were forced to struggle with on a daily basis. This novel is clearly one of contrasts- in England we see the differences between rich and poor and in Jamaica we see the divide between blacks and whites. Nora truly comes into her own once she settles into life with Elias. She really understands that in order to feel some sort of happiness she must make it for herself and so she begins to care for some of the slaves who are injured while working. Nora goes against tradition and wants to learn how the house slaves work and she establishes tentative connections with them in order to build up their trust. Nora really has a caring, considerate nature , she is sympathetic to the plight of others less fortunate than herself. She seems to be a woman ahead of her time as she sees how things can work better through change. Nora transforms from a timid, shy young girl to a strong, determined mistress of a plantation who is eager to see changes enforced. Changes which will ultimately see the working conditions and the lives of the slaves improved.Just as Nora begins to settle into her new wondrous life Douglas Fortnam (her stepson) arrives back in Jamaica after studying abroad. This new arrival alongside a destructive hurricane is a huge turning point in the novel and the pace really picks up even more. I don’t want to divulge any more except to say the slaves do really do come to the forefront in the later half and we see exactly what they felt during this time. The action moves away from the plantation and this part of the novel was amazing and so interesting to read about. There are plenty of twists and turns as we race towards an epic conclusion.I didn’t want this book to end at all, I loved everything about it, there were no lulls or boring bits and I liked how each section was clearly marked where it was going to take place and the years involved. I think I may have just discovered a new favourite author to add to my list as the writing was just fantastic. This would make a superb film and maybe some day we may see this incredible novel on the big screen.After finishing this book I was delighted to discover that Sarah Lark had already written a different trilogy also in the saga vein. I will certainly have to check this out because if these books are anything like Island of a Thousand Springs I am in for a real treat."}, {"userName": "Catalina Manriquez", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/34684440-catalina-manriquez", "userReview": "You can learn about history and what happened with slaves and also have an amazing plot that'll surprise you."}, {"userName": "Paloma", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/5931265-paloma", "userReview": "La novela se lee bastante rápido, pues es muy entretenida y con bastante acción. La historia comienza en Inglaterra, en 1732, cuando Nora Reed, una joven muy adelantada a su época, desafía las convenciones y a su familia para cuidar al hombre que ama, y al que termina perdiendo por tuberculosis. Juntos habían soñado con las islas del Caribe, con un mundo distinto al del Londres lluvioso y de las convenciones sociales. Por medio de lecturas y de las conversaciones con ingleses que ya habían hecho fortuna en las colonias, Simon y Nora habían creído que sería posible llegar a ese nuevo mundo y ser felices. La muerte de Simon acaba con todo ello y Nora se vuelve una chica seria aunque diligente. El destino la lleva a conocer a un hombre que justo es un rico comerciante de caña de azúcar en Jamaica... y es así como se casa con Elias Fortman, más por ser práctica que por amor y llega a la isla de los sueños de su amor pasado, a Jamaica, a la isla de las mil fuentes... Ahí es cuando todo se empieza a complicar: Nora no ama a su esposo y pronto se da cuenta que la llevó a Jamaica para cubrir las apariencias -el tener una mujer que dirija la vida doméstica, que sea una muñeca inglesa. Y eso no le cuesta trabajo a Nora, que pronto comienza a hacerse notar entre los esclavos domésticos y los del campo y a su manera, proteger a los esclavos tan maltratados y humillados. El problema obviamente surge cuando el hijo de la primera esposa de Elías, Douglas, regresa a casa y la atracción entre ambos inicia. Al tiempo, se genera un triángulo amoroso entre Manuh y Akawaski, dos trabajadores de la casa y Nora, sin que ésta sea consciente y ahí es cuando, como se dice en México, \"la marrana torció el rabo\" -ataques de cimarrones, pérdida de la plantación, raptos. En fin, pronto Nora viva entre los negros libres, aprendiendo de las culturas africanas en sí pero también dándose cuenta que tantos malos tratos de los blancos han endurecido el corazón y el alma de los negros -esclavos y libres. Como mencioné, es una historia entretenida, pero la califiqué con tres estrellas porque, como en muchos de estos libros de sagas, a nivel literario no me parece nada espectacular. Se lee rápido, es claro, pero más allá de ellos es una novela bastante estándar. Asimismo, creo que algunos de los personajes me parecieron inverosímiles, en cierto sentido -por ejemplo, que el malo más malo al final decida o cambie de parecer, y no concluya su venganza; o por ejemplo, incluso la protagonista a veces peca de inocente, con todo y lo que ha vivido. No sé. Si bien no son personajes sosos, tampoco me parecieron complejos en su totalidad -buenos y malos, y al final los buenos siempre triunfan. Sin embargo, es una historia interesante y bien investigada para retratar la vida en las colonias inglesas a mediados del siglo XVIII. Creo que en definitiva le daré la oportunidad al siguiente volumen de esta trilogía."}, {"userName": "Zsofi", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/25372262-zsofi", "userReview": "No character development, slow, boring."}, {"userName": "Caro", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/30366554-caro", "userReview": "Popsugar 2017 reading challenge: 11. Un libro por un autor que use un seudónimo -  Nombre original: Gohl, Christiane Gohl El problema con este libro es que sí, me enganchó muchísimo las primeras 550 páginas pero el final me pareció terrible (de malo). Aunque en general me gustó bastante, varios personajes se me hicieron insufribles.Me aventaré a leer la segunda parte porque a fin de cuentas no me desagradó el libro, claro siempre y cuando mi madre tenga a bien prestármelo (por cierto, gracias por prestarme este XD )"}, {"userName": "Lydia", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/69146068-lydia", "userReview": "Okay um ehrlich zu sein lese ich lange nicht so viel wie ich sollte, deshalb habe ich was das Lesen angeht eventuell noch nicht so viele Erfahrungen sammeln können wie andere User hier...Aber: als ich dieses Buch schweren Herzens und mit den unterschiedlichsten Emotionen geladen wieder aus der Hand gelegt habe stand eines für mich fest: Ich will noch mehr solch gute Bücher lesen wie das von Sarah Lark! Angefangen von den traumhaft schönen Landschaftsbeschreibungen die den Leser gerade zu fesseln über die so gut konstruierten Charaktere bishin zu einer einmaligen Geschichte einer jungen Frau vor einem wahrlich interessanten geschichtlichen Hintergrund. Dieses Buch lädt buchstäblich zum Tagträumen ein und offenbart die Sehnsüchte die in einem Jeden tief verborgen schlummern.Tolles Buch!"}, {"userName": "Leonor Lopes", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/29474230-leonor-lopes", "userReview": "Neste livro, a autora retrata e narra na íntegra, o tema da escravatura vivida na altura. Consegue transportar o leitor para as plantações e fazer sentir sentimentos vividos pelos personagens, de dor, de indignidade, desrespeito. De igual modo, leva o leitor a reflectir sobre a importância da liberdade, coragem e respeito pelo ser humano. Porque no fundo, ‘há bondade e maldade, não negros e brancos’…Foi o meu primeiro contacto com esta autora. Adorei e recomendo.Depois deste livro, há valores que ficam mais sublinhados, sem dúvida!"}, {"userName": "Miranda Kellaway", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/10055989-miranda-kellaway", "userReview": "Sarah Lark forma, desde hace tiempo, parte de mi \"Olimpo de las diosas personal\". No hay libro suyo que coja y no lo disfrute y luego no me relama como si acabara de comerme un kilo de caramelos. Tanto su trilogía anterior como este prometedor inicio de una segunda saga, esta vez ambientada en Jamaica, son una delicia, aunque alguien por ahí los tilde de \"culebrón\", y todo porque contengan historias de amor. Sarah es una grande en las novelas landscape. Mi más sincera admiración y respeto."}, {"userName": "Eva", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/50428245-eva", "userReview": "En la línea de la Trilogía de La nube blanca. A pesar de ser una historia totalmente diferente, sí que se repiten algunos patrones, cosa que no me molesta, ya que la anterior trilogía me encantó.Tengo pendiente la segunda parte y aunque me apetece saber qué les pasará a los nuevos protagonistas, creo que espaciaré un poco su lectura para no saturarme"}, {"userName": "Nélia Rosa", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/44038608-n-lia-rosa", "userReview": "Mais uma estreia este ano. Gostei e fiquei curiosa em relação aos outros livros desta escritora."}, {"userName": "L", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/20068639-l", "userReview": "La daría tres estrellas y media. Me ha gustado bastante, pero En el país de la nube blanca me gustó mucho más."}, {"userName": "Helena", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/958164-helena", "userReview": "Dit had een goed boek kunnen zijn, ware het niet dat * Je al bij het lezen van de achterflap weet hoe het afloopt* Het geschreven is alsof het een kinderboek is * Het geen moment echt spannend wordt* Ik er echt niet elke twintig pagina's aan herinnerd hoef te worden dat de hoofdpersoon slank en mooi is* De hoofdpersoon er een 21e (of toch in elk geval 20e)-eeuwse denkwijze op nahoudt* Schokkende gebeurtenissen steevast aangekondigd werden met \"Maar toen gebeurde er iets dat...\"* Het veel te uitleggerig geschreven is* Er van tijd tot tijd onbegrijpelijke en m.i. overbodige zinnen in stonden als \"Ze hoopte dat Mansah op de baby zou passen, maar eerlijk gezegd kon ze goed voor de baby zorgen, en waarschijnlijk zou ze sowieso de hele nacht rustig en vredig doorslapen.\"enz.Het is misschien gewoon niet mijn soort boek. Te oppervlakkig, te voorspelbaar, te braaf, te zoet. Waarom ik het dan toch uitgelezen heb? In de stille hoop dat ik het bij het verkeerde eind had en het tóch slecht zou aflopen. Dan had ik het vast positiever beoordeeld. 2,5 ster voor het verhaal en een halve erbij voor de research."}, {"userName": "Crisanta", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/19989766-crisanta", "userReview": "He encontrado interesante saber un poco más sobre la historia de Jamaica, de la que desconocía muchas cosas. Además, la mezcla entre historia y romance de Sarah Lark siempre me ha gustado. Sus protagonistas femeninas siempre son fuertes y Nora sigue este patrón. Las descripciones además te transportan a la misma isla, lo que hace que el libro sea muy atractivo. Estoy ya empezando con la segunda parte."}, {"userName": "Jennifer", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/12353320-jennifer", "userReview": "Sarah Lark's books are the ideal holiday read: light, but very pleasant and with a well-researched historical foundation. The red line of Island of a Thousand Springs is similar to her \"Land of the long white cloud\" series: a well to do English young girl marries a man she barely knows and moves to the colonies (this time Jamaica), has an unhappy marriage but a forbidden love, set against a fascinating historical backdrop. Very enjoyable, and I'll be looking forward to the sequel!"}, {"userName": "Helen", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/184844-helen", "userReview": "This lady writes an excellent book and this is the fourth in a row. Jamaica In The 1700s complete with slavery, beauty, love and insurrections. My only complaint was that towards the ending it got totally dragged out with Akwasi on the run and his punishment was minor for the crimes he committed. A five star read that I rarely put down."}, {"userName": "Ieva", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/5932601-ieva", "userReview": "Larku pazīstu jau ilgus gadus, un arī šajā romānā ir pilnīgi nepārprotams viņas jau iestrādātais rokraksts. Jauna anglieti, eksotiska zeme, šajā gadījumā vergi, nevis iedzimtie, nepatīkams vīrs, īsta mīlestība jaunajā zemē... Ja nepārdozē (jo darbi patiešām ir līdzīgi viens otram), ļoti laba lasāmviela savam žanram."}, {"userName": "Sandra", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/52422190-sandra", "userReview": "Una historia conmovedora que te hace agradecer no haber nacido en esa época, la verdad.El personaje de Nora me ha encantado, muy fuerte y valiente.Hay que decir que esta historia podría ser autoconclusiva porqué no deja nada al aire, aún así, me leeré el segundo.Me quedo con la frase de:  no hay negros o blancos, hay bondad o maldad."}, {"userName": "Zulema Gonzalez", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/59848092-zulema-gonzalez", "userReview": "Le daría un 4.5 pero he decidido ponerle el 5 porque se me ha hecho mucho más ágil, ligero y ameno que otros libros a los que les he puesto un 4. Es una historia triste por lo general pero también bonita por momentos. Lo recomiendo."}, {"userName": "Martine", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/34176518-martine", "userReview": "Mooi geschreven, meeslepend verhaal en interessant gezien de historische achtergrond."}, {"userName": "Griselda Friss de kereki", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/18859710-griselda-friss-de-kereki", "userReview": "Muy interesante."}, {"userName": "Roxana Garcia", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/63187834-roxana-garcia", "userReview": "I love historical fiction and Sarah Lark is one of my favorite authors. I am looking forward to reading the next book in this series."}, {"userName": "Cindy Woods", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/32222190-cindy-woods", "userReview": "Written with truthI mistakenly read this book after reading the second one on this engrossing series. Both books can easily stand on their own as very well researched and written historical novels. The main theme of slavery in Jamaica in the 18th century is dealt with by aspects of slaves and masters including all the various opinions by all sides be they actively participants or observers. The saddest fact I come away with here is that the outward opinions and actions of the perpetrating white owners then are still harbored in 2017 by their descendants. This racial prejudice is well documented in this book...imbedded in the religious, economic and political structures of the 18th century here. The author interweaves the lives of the characters as lives are destroyed, dignity trampled, human kindness extremely rare and ignorance abounds, mostly by the whites. On top of this is the offhand and politically accepted idea that women, whether black or white, are less intelligent and not as worthy as men. My God! I would go insane living under such strictures as a white woman literally expected to do nothing but be a table centerpiece for her husband's home except as a bedmate when \"he\" feels the \"need.\" As a black woman/female child I have no words to properly express my disgust and anger over any woman used as property, raped, overworked, forced to procreate, tortured and divided from my loved ones and treated as such by whites and blacks alike. This is a great book for young people, as well.... sixteen and up. They should learn the true history of slavery and its impact on generations of ignorance as it has evolved. The one highlight, for me, was the incident with Mr Hollister and his wife's \"borrowed\".....it's hard to understand Doug's decision to allow that young woman to go to the Hollister, and actually encouraging her with his foreknowledge of life there. No excuse.....it's all on him as far as I see it. As for the relationships of Kate, she appears to be the only person who has the ability to truly see into the human heart. I would have loved to have seen her father's reaction to his first grandchild. This is a definite \"highly recommend\" read. I thoroughly ate it up! Hope there's a book III."}], "description": "Isla de Jamaica. Tras la muerte de su primer amor, Nora, la hija de un comerciante londinense, se une, a través de un matrimonio de conveniencia, a Elias, un viudo propietario de un plantación de azúcar. La vida en el Caribe, sin embargo, no es como Nora había soñado. A partir del asalto nocturno a la plantación, Nora se verá envuelta en los tumultos provocados por esclavos rebeldes relacionados con la Abuela Nanny, quien también fue esclava. Nora lo pierde todo, salvo la vida y la esperanza de encontrar de nuevo el amor y decidir libremente sobre su futuro.", "title": "La isla de las mil fuentes\n      \n          (Jamaika #1)", "url": "https://www.goodreads.com/book/show/17330069-la-isla-de-las-mil-fuentes", "average": 4.16, "cover": "https://images.gr-assets.com/books/1362954895l/17330069.jpg", "reviews": 89, "authors": [{"url": "https://www.goodreads.com/author/show/781400.Sarah_Lark", "name": "Sarah Lark"}], "type": ["Historical", "Romance", "Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17330069-la-isla-de-las-mil-fuentes", "http://www.goodreads.com/book/show/26831412-a-ilha-das-mil-fontes", "http://www.goodreads.com/book/show/23414270-island-of-a-thousand-springs", "http://www.goodreads.com/book/show/33023251-t-ksto-avotu-sala", "http://www.goodreads.com/book/show/23200201-island-of-a-thousand-springs", "http://www.goodreads.com/book/show/18981987-la-isla-de-las-mil-fuentes", "http://www.goodreads.com/book/show/13100096-die-insel-der-tausend-quellen", "http://www.goodreads.com/book/show/18779646-het-eiland-van-duizend-bronnen", "http://www.goodreads.com/book/show/16007131-in-the-land-of-the-long-white-cloud", "http://www.goodreads.com/book/show/20417101-call-of-the-kiwi", "http://www.goodreads.com/book/show/17687577-song-of-the-spirits", "http://www.goodreads.com/book/show/25828510-toward-the-sea-of-freedom", "http://www.goodreads.com/book/show/31848619-a-hope-at-the-end-of-the-world"]}