{"ratings": 23, "userreviews": [{"userName": "Drew", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/3679784-drew", "userReview": "Hmm. It's either a brilliant Candide-esque satire of the clueless wealthy idiots who got us into our current mess (maybe they didn't vote for Trump but they thought about it!, etc) or it's a tone-deaf straight white liberal male asking questions about how we got here. And if you finish a book and wonder which one it is... chances are the answer isn't going to be positive.Gary Shteyngart is the first of his cohort to bang out a proper Trump-responding novel - although this only tangentially connects to our 45th President, mainly taking place over the 6 or so months leading up to the 2016 election - and while the book displays everything you'd expect from a Shteyngart novel (humor, pathos, lovely sentences), it just feels misguided. Barry, the main character, is too dumb and too naive to truly be engaging and the supporting cast is almost universally reduced to a single if-not-stereotype-then-pretty-damn-close. And everything about Barry's journey reeks of the \"how did this happen\" series of questions that clueless liberals over the age of 40 have been asking for the last 18 months. I wish I could've loved this book more - and I'll bet that it'll get a great run of reviews in all the right places, not to mention commercial acclaim. But this was a misguided novel from start to finish and here's hoping it's the only one we have to deal with - because, so help me, once Franzen and Eugenides et al get into the game, we'll deserve everything coming to us."}, {"userName": "Katie", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/931709-katie", "userReview": "2 1/2 stars really, rounded up for some decent writing and an author I really love. I will preface this by saying I really enjoy Gary Shteyngart's writing. I have a special place in my heart for Super Sad True Love Story. I enjoyed the sad funniness of Little Failure, and was thrilled to meet him years ago. He is expert at writing the sad-sack, clueless, male doofus character, that ultimately becomes lovable along the way. Barry is not that character, though I think that was the intention. Barry Cohen is a multi-millionaire hedge fund guy, who has made some major financial mistakes. He is married to a beautiful Indian woman, is horrified by the autism diagnosis his toddler son just received, and is obsessed with expensive watches, expensive whiskey and his perceived status. He thinks he can mend his life if he abandons his wife and autistic son, throws away his wallet and cell phone, and embarks on a Greyhound trip to try to win back his college girlfriend. What could possibly go wrong?The difference between Lake Success and Super Sad True Love Story is that the sad-sack, clueless, male doofus character never becomes lovable. Barry embodies the worst of wealthy, white, American men and never redeems himself because his values never really shift much. The damage is done. I hated Barry from page one, and was waiting for the moment that I empathized, or at least felt sorry for him, which never came. Instead, I truly blame the Barrys of America for a lot of what I find detestable about American culture and I couldn't look past that. Thank you to Random House and Gary Steyngart for the advance copy of this book. I wish I liked it more."}, {"userName": "Roxanne", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/72745575-roxanne", "userReview": "Barry and his wife Seema face a crossroads of whether a marriage built on ostentatious beginnings can survive the harsh reality of day to day care of a child on the spectrum. The beautiful delusion Barry clings to involving a college sweetheart is a fantasy that many harbor when faced with newlywed strife. Meanwhile his wife also contemplates the road less traveled within their swank Manhattan condo building and its neighborhood’s romance inducing surroundings.A fun Odyssey type story worth a read!"}, {"userName": "Jan Thullen", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/299087-jan-thullen", "userReview": "Barry Cohen, hedge fund guy, is on the run from his so-shiny life, autistic son and some very poor decisions. It's a strange and funny road trip. I loved most of it and enjoyed this as a break from a lot of serious fiction. Look elsewhere if you want a morality play or an admirable main character."}, {"userName": "Maren", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/7545770-maren", "userReview": "I should start with the admission that I deeply love Gary Shteyngart's writing. If I had a knack for writing, I would work to write like him. But I don't, so I read him instead :)Lake Success flies through a lot of topics: wealth, status, parenthood, lost relationships, autism, America, etc., etc. but I think it's ultimately a book about time, and how it only moves in one direction, forward. Once the main characters accept the forward motion of their lives, they are truly able to live. It's a terrific book, full of sharp observations, hilariously overdrawn yet recognizable characters and some poignant thoughts on all of the above, and more. 5 stars for Gary."}, {"userName": "randy", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/63170740-randy", "userReview": "Totally disgraced, middle-aged, self-absorbed hedge fund manager abandons his family and takes a Greyhound bus cross-country in search of his college sweetheart during the 2016 election? Ridiculously funny. And per usual, Shteyngart has his thumb on the often ludicrous and always true pulse of our times."}, {"userName": "Shoshana G", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/4862764-shoshana-g", "userReview": "So Gary Shteyngart is hilarious and talented. There were moments in this book that felt inspired. But ultimately, I didn't care. The novel knows that the protagonist's values are ruining the country and the world but seems to ultimately sympathize with him. I pity Barry. And his story is sad I guess, but I don't really feel sorry for him. I thought his bus trip was ridiculous rather than funny and the watch obsession possibly realistic but ultimately boring and I didn't know why Layla or her parents indulged him. There were some really enjoyable parts, really, but I just don't want to read books about people who are neither likable nor interesting.I read an e-ARC from Netgalley."}, {"userName": "Lehtomaki", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/7043872-lehtomaki", "userReview": "Fiction"}, {"userName": "Amileigh Gordon", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/62938542-amileigh-gordon", "userReview": "#GoodreadsGiveaway"}], "description": "When his dream of the perfect marriage, the perfect son, and the perfect life implodes, a Wall Street millionaire takes a cross-country bus trip in search of his college sweetheart and ideals of youth in the long-awaited novel, his first in seven years, from the acclaimed, bestselling author of Super Sad True Love Story.Myopic, narcissistic, hilariously self-deluded and divorced from the real world as most of us know it, hedge fund manager Barry Cohen oversees $2.4 billion in assets. Deeply stressed by an SEC investigation and by his 3 year-old-son's diagnosis of autism, he flees New York on a Greyhound bus in search of a simpler, more romantic life with his old college sweetheart, whom he hasn't seen or spoken to in years. Meanwhile, reeling from the fight that caused Barry's departure, his super-smart wife Seema, a driven first-generation American who craved a picture-perfect life with all the accoutrements of a huge bank account, has her own demons to face. How these two imperfect characters navigate the Shteyngartian chaos of their own making is the heart of this biting, brilliant, emotionally resonant novel very much of our times.", "title": "Lake Success", "url": "http://www.goodreads.com/book/show/36739942-lake-success", "average": 3.65, "cover": "https://images.gr-assets.com/books/1516726955l/36739942.jpg", "reviews": 9, "authors": [{"url": "https://www.goodreads.com/author/show/12437.Gary_Shteyngart", "name": "Gary Shteyngart"}, {"url": "https://www.goodreads.com/author/show/12437.Gary_Shteyngart", "name": "Gary Shteyngart"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/36739942-lake-success", "http://www.goodreads.com/book/show/36718202-lake-success", "http://www.goodreads.com/book/show/7334201-super-sad-true-love-story", "http://www.goodreads.com/book/show/70509.Absurdistan", "http://www.goodreads.com/book/show/210817.The_Russian_Debutante_s_Handbook", "http://www.goodreads.com/book/show/17857652-little-failure", "http://www.goodreads.com/book/show/18666230-absurdistan-and-super-sad-true-love-story", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}