{"ratings": 889, "userreviews": [{"userName": "Rarillo", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/6821771-rarillo", "userReview": "Yo soy un lector empedernido desde que tenía 12 años y ahora tengo 45, de forma ininterrumpida he leído entre 3 y 4 libros mensuales desde hace más de 30 años y eso han sido muchos libros.Con el tiempo he “educado” mi gusto literario haciéndome más exigente en lo que leo y aprendiendo a valorar y respetar a los escritores, sobre todo a los buenos escritores.Sencillamente el ingente trabajo de imaginación, documentación y estructuración que supone transformar un folio en blanco en varios cientos de páginas que te enseñan, cautivan y entretienen se encuentra fuera de mis posibilidades.En primer lugar debo decir que La Leyenda del Ladrón es un libro original, no está encuadrado en lo que yo llamo la churrería de novelas históricas que siguieron a la publicación del Hombre de la Rosa.Cuando empieces a leer te encontrarás sumergido en una Sevilla de la época de Felipe II, no la Sevilla real, porque todo libro refleja los prejuicios e ideas de su autor, pero si una Sevilla totalmente creíble e incluso con escenarios reconocibles por cualquiera que haya paseado por las orillas del Guadalquivir.El trabajo de documentación que se encuentra detrás de este libro es ingente y cualquier lector aprenderá muchos detalles, tal vez duros, pero reales de este periodo de la historia que ha sido mitificado por las enseñanzas que recibimos los que ya tenemos una cierta edad.A esto hay que sumar una trama ágil, entretenida con numerosos guiños a personajes comunes de la época y también con alguno reconocible por sus actitudes en algunos que vemos hoy en día, al fin y al cabo como se suele decir estamos condenados a repetir la historia.En resumen, os recomiendo que leáis este libro, que os dejéis seducir por Sancho, que lo reconozcáis y que lo disfrutéis.Para finalizar no me queda más que dar las gracias a Juan Gómez Jurado por permitirme soñar durante unas horas con un mundo que tal vez no fue, pero que sin embargo será desde hoy."}, {"userName": "Roberto", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/52293686-roberto", "userReview": "Primer libro del año y empezamos de lujo! antes de empezar a leer este libro escuche que Juan Gomez era el Ken Follett de España, y no solo lo es si no que su estilo de contar una historia y de escribir me gustaron mas que Follett. Es una novela histórica muy cautivadora donde conocemos la historia de Sancho que es un personaje ficticio mas sin embargo aparecen muchos personajes históricos como Miguel de Cervantes y Shakespeare ademas de que muchos de los personajes están basados en personajes históricos de la época lo cual me encanto. Ultimamente he estado leyendo mucha novela histórica y por lo general puro escritor Español (Fernando Posteguillo, Alvaro Arbina) y tengo que decir que son unos maestros para escribir este genero (yo soy mexicano). A pesar de que el libro es largo las paginas se pasan como agua, muy muy recomendable para los amantes de este genero."}, {"userName": "María E Sanz ", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/7391166-mar-a-e-sanz", "userReview": "He leído todos los libros de Juan Gómez-Jurado, en el mismo orden en que fueron escritos, Espía de Dios➡Contrato con Dios➡El Emblema del Traidor, y La Leyenda del Ladrón, y en mi opinión, es la mejor manera de leerlos, porque puedes apreciar la evolución del autor. Espía de Dios, ya era una buen novela, que no tenia nada que envidiar a las novelas de Dan Brown; Contrato con Dios, era aún mejor, aunque tengo que confesar que me resultó más árida de leer; El Emblema del Traidor es sublime. La Leyenda del Ladrón es sin ninguna duda, la mejor novela de Juan Gómez-Jurado, es emocionante, divertida, épica, sorprendente y con una ambientación histórica soberbia. El trabajo de documentación hercúleo que ha realizado el autor salta a la vista en cada página, en cada línea y le da un nivel de calidad altísimo. La capacidad de descripción es asombrosa, sin enrollarse demasiado, ni resultar pesada, te hace no sólo visualizar las escenas, sino incluso los olores, que dicho sea de paso, no son muy agradables, (es mejor no leerla mientras comes, porque es tan realista, que la comida te sentará mal). :-))La verdad es que Juan ha puesto con esta novela el listón tan alto, que no sé como lo va a hacer para superarse a si mismo en su próxima obra, pero confío plenamente en él y estoy segura que volverá a sorprenderme.No quiero terminar sin hacer mención a la aplicación de Realidad Aumentada que acompaña al libro, ya que es magnifica. Una idea novedosa que me ha encantado y que espero que se haga más a menudo. Yo la echaré de menos en los próximos libros que lea."}, {"userName": "Leo C.", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/14384903-leo-c", "userReview": "Me ha encantado! Una novela llena de acción, venganza, amor, ... que engancha desde la primera página y no aburre en ningún momento. MUY RECOMENDABLE a quien quiera disfrutar de una buena novela de aventuras ambientada en la Sevilla del Siglo XVI"}, {"userName": "Willo Font", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/10736486-willo-font", "userReview": "If you like Alexander Dumas, adveture, the 3 musketeers, Arturo Pérez-Reverte, or Captain Alatriste , then this is your book . Great adventure story set in XVI,Spain with a great set of characters including , Sancho Panza, Miquel de Cervantes and William Shakespeare. It's a gret ride, especially the last 200 pages.There is also an app that you can get for free that goes with the book . At the end of some chapters there is a code bar you point your phone to and it talks about thing pertaining that chapter or , photos & videos of the period."}, {"userName": "Ifigenia", "userReviewDate": "Nov 08, 2012", "userURL": "http://www.goodreads.com/user/show/3437306-ifigenia", "userReview": "[ al principio le encantaba leer novelas de caballería, pero Monardes se ríe de ella y le enseña la verdadera literatura, los libros de medicina de los que dispone y desde entonces ya empieza a ignorar los libros de caballerías a favor de los tratados de medicina  (hide spoiler)]"}, {"userName": "Rocío Cruz Vázquez", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/28018720-roc-o-cruz-v-zquez", "userReview": "Serían 4.5 estrellas en realidad. Me ha gustado mucho, tanto la historia como la narración. Quizá para mi gusto, el final se desinfla un poco con respecto al resto del argumento pero bueno, tampoco influye mucho esto para cambiar mi opinión sobre la novela. Repetiré con el autor sin duda."}, {"userName": "Guadalupe", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/65390879-guadalupe", "userReview": "Imposible dejar de leer, no decae ni un momento. Maravillosamente ambientada en la Sevilla del siglo XVI, recrea la época con detalle sin dejar de lado una buena historia, sin resquicios por los que perderte y con un final bien resuelto. Los personajes, que no son pocos, están bien dibujados y los pasajes se recrean en una ambientación que resulta fascinante. Lectura muy recomendable, nota del autor incluida para aclarar algunas dudas que surgen durante la lectura y que quedan ahí aclaradas."}, {"userName": "César Caracuel", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/5373587-c-sar-caracuel", "userReview": "Una impresionante novela que te traslada, literalmente, a la Sevilla del siglo XVI. No faltan detalles en la descripción de la ciudad en aquella época, así como de la sociedad en la que transcurre la historia. Nuestro personaje principal, Sancho, es rescatado de una Venta por el comisario Miguel de Cervantes, con quien se encontrará años después. Sancho es huérfano, y el comisario lo deja en un orfanato, donde vive hasta que llega a la edad en la que debe abandonarlo. Por su desobediencia, Sancho es destinado a una bodega en donde no es que le trate su dueño, Castro, precisamente bien. Al tiempo, Sancho escapa del trabajo y se reencuentra con Bartolo, un enano al que conoció tiempo atrás, y que le instruye en el arte de ser un ladrón... Y hasta aquí puedo leer.Monardes el médico, Vargas el comerciante sin escrúpulos aspirante a alcanzar un título nobiliario, Clara la esclava, son algunos de los personajes que cobran vida en la nueva novela de Gómez-Jurado, complementada con información extra en el caso de que tengáis un smartphone Android o iPhone.Extensa pero sin excederse, realista, y muy creíble por determinados detalles. Por cierto, Shakespeare y Cervantes se conocen en persona en esta novela, pero se sabe que hay referencias históricas de que al menos uno sabía de la existencia del otro y que se leían, como mínimo."}, {"userName": "Paco Orozco", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/1853909-paco-orozco", "userReview": "Me ha encantado esta novela, me ha recordado un poco a Prométeme que serás libre de Jorge Molist. Una trepidante trama, con mucha acción, con malos muy malos, buenos a los que coges cariño, espadachines y sobretodo ladrones.De nuevo Juan Gomez-Jurado me ha transportado a la Sevilla del siglo XVI, como lo hizo en su día Matilde Asensi en su trilogía Martín Ojo de Plata.He disfrutado, y sufrido, mucho. Gran libro!"}, {"userName": "Carlos Vázquez", "userReviewDate": "Jun 21, 2015", "userURL": "http://www.goodreads.com/user/show/32711235-carlos-v-zquez", "userReview": "¿Qué más se le puede pedir a un libro además de ser emocionante, trepidante, desarrollar grandes personajes y cerrar excelentemente todas sus tramas? Pues que esté ambientado en la Sevilla de nuestra edad de oro, aporte reflexión y, además, cuente con dos secundarios de lujo.Todo esto, y mucho más, se cumple en \"La leyenda del ladrón\"."}, {"userName": "Labijose", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/17739204-labijose", "userReview": "Aunque creo que se le va un poco la mano, con tantas heroicidades de nuestro protagonista Sancho de Écija, (algo bastante normal en este tipo de relatos), he de confesar que he disfrutado de la lectura de esta novela. Juan Gómez-Jurado consigue adentrarnos en la Sevilla del siglo XVI con una narrativa absorbente, y una ambientación que te convierte en un testigo privilegiado, recorriendo con Sancho y Josué las estrechas callejuelas insalubres de la ciudad más importante del momento. Como ya he reseñado, quizás le sobren situaciones bastante inverosímiles, que te provocan un arqueo de cejas en más de una ocasión. Pero esto es moneda corriente en la mayoría de novelas de este tipo, que, por lo general, deben de tener por objetivo distraer a la par que divulgar, en la medida de lo posible, sobre la época que se nos narra. Eso lo consigue con creces “La leyenda del ladrón”, pues entretiene e informa a partes iguales.La guinda del pastel es el guiño de honor que el autor dedica tanto a Cervantes como a Shakespeare, dándoles unas breves apariciones, y rindiendo así homenaje a dos de las plumas más excelsas de la literatura universal.Narrativa de evasión y divulgación que recomiendo a los lectores de este tipo de novelas. Cuatro sobre cinco."}, {"userName": "Javier Muñoz", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/47879363-javier-mu-oz", "userReview": "Juan Gomez-Jurado nos trae una entretenida novela de aventuras ambientada en la ciudad de Sevilla del siglo de oro. No sé hasta qué punto se puede decir que es una novela con rigor histórico, pero lo cierto es que el autor consigue que te pongas en situación.En este marco nos encontramos con la historia de Sancho de Écija, un niño que es el único en sobrevivir a la peste en la posada donde vivía, pero que no ve acabar su mala suerte ahí, ya que en su vida pasa por una penalidad tras otra, encontrando alivio sólo cuando se alía con Bartolo, un ladrón enano que le hará de mentor en el mundo de la delincuencia... esta historia de Sancho ocupa más o menos la mitad del libro, en la segunda mitad tras un gran sufrimiento y un proceso de aprendizaje fuera de la ciudad regresa buscando venganza por afrentas pasadas. Paralelamente se nos cuenta la historia de Clara, esclava e hija de una india caribe que comienza un aprendizaje a cargo del médico Monardes cuando este ve un gran potencial en ella.Unos personajes bien perfilados y atractivos, una buena ambientación, unos malos muy malos y sobretodo un manejo del ritmo narrativo muy acertado por parte del autor consiguen mantenernos implicados con la historia continuamente, haciéndonos difícil abandonar la lectura. He disfrutado mucho con este libro."}, {"userName": "Anna", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/5095490-anna", "userReview": "Fantástico, engancha, embruja y te deja continuamente con ganas de leer más. Novela de aventuras que nos transporta a la Sevilla de la picaresca.La trama está muy bien construida, siguiendo los pasos de Sancho y de aquellos cuyas vidas y destinos acaban entrelazados con la de él. Incluso dentro del esquema típico de novela de aventuras hay giros inesperados y momentos que hacen que no puedas despegarte del libro.Los personajes encarnan muy bien los buenos y los malos. Los buenos sólo intentan sobrevivir, adaptándose a las circunstancias, pero siendo en esencia, buenos, y viceversa. Sin embargo esto no me parece un fallo ni algo a criticar, ya que encaja perfectamente con el aire y la trama de la novela, o así lo veo yo en mi humilde opinión. Quiero destacar a Josué, uno de los personajes a los que más cariño se le coge (además del propio Sancho) o al herrero Dreyer. Personajes que pudieran parecer superficiales, pero que en el fondo dan profundidad a la trama y sorprenden, en especial el primero.Me parece muy curiosa y acertada la inclusión de algunos personajes históricos, haciendoles interactuar con los personajes ficticios, de una forma tan natural que uno podría llegar a pensar que bien las cosas pudieran haber ocurrido de este modo. Además, crea casi una complicidad autor-lector, un guiño del autor hablándonos de personajes conocidos en medio de la aventura que vamos conociendo.En general un libro muy entretenido, de fácil lectura y que me ha dejado con un muy buen sabor de boca.Era lo primero que leía de este autor, y os aseguro que repetiré."}, {"userName": "Almu", "userReviewDate": "Sep 04, 2012", "userURL": "http://www.goodreads.com/user/show/10152202-almu", "userReview": "[La aparición de Shakespeare y Cervantes al principio, sólo durante un par de capítulos, para mí no tenía sentido. Me desconcertó. ¿Por qué introducirlos en la novela para que desaparecieran casi al instante? Cuando aparecen más adelante ya cobra sentido.Me fue muy útil leerlo en el kindle para poder consultar en su diccionario algunas palabras como cómitre, que, por cierto, me costó mucho pronunciar porque en mi cabeza tenía más sentido que fuese una palabra llana... jajajajaYo no suelo leer novelas de aventuras porque no es un género que me atraiga demasiado, pero esta en concreto me ha gustado mucho. Me pareció muy típico que se juntaran al final los cuatro como si fueran los mosqueteros imponiendo justicia y venganza. (hide spoiler)]"}, {"userName": "Carmen", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/15541356-carmen", "userReview": "Le he dado 4 estrellas por que 3 me parecía muy poco, si existieran mediaa estrellas lo puntuaría en 3,5.Me ha gustado, es entretenido y la historia atrapa. A ratos se me ha hecho un poco largo, sobretodo en algunas descripciones esperaba mas acción, y se entretenía con algunos detalles y me cansaba un poco de la lectura. Me ha gustado la historia de Sancho, y Clara, pero he echado de menos historias secundarias que acompañaran las aventuras de Sancho. También al principio esperaba que Clara tuviera un papel mas protagonista, igual que su madre Catalina, y poco a poco quedan relegadas a un segundo plano. A parte de esto, 100% recomendable a los que le gusten las novelas de aventuras ambientadas en otra época."}, {"userName": "Jose Porta", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/19697074-jose-porta", "userReview": "Primer libro de J. Gómez-Jurado que leo, me parece acertado la comparación que he visto \"el Ken Follet español\".Me parece un libro muy entretenido, muy bien llevado, con muchos ingredientes interesantes, y para mi gusto bien escrito. Lo recomiendo para lectura dentro del género novela histórica de aventuras: ligero, muy entretenido y bien resuelto. En el debe únicamente decir que se pasa un poco en algunas licencias que se toma con los dos grandes personajes históricos, pero son asumibles. También en algún momento puede ser un poco \"fantasma\", es decir, roza el límite de lo creible.http://www.goodreads.com/review/edit/...#Aunque le daría en torno a 4.5, realmente lo veo más en el 5 que en el 4. ¡Con ganas de leer más a J. Gómez-Jurado!"}, {"userName": "Sergio R", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/9239900-sergio-r", "userReview": "El libro está muy en la línea de The Traitor's Emblem pero se nota que es el cuarto libro del autor y está mucho mejor escrito. Muy entretenido aunque tengo que decir que no llegué a empatizar del todo con Sancho y su venganza y me interesaba mucho más todo lo que rodeaba a la chica esclava. Además, la inclusión de un par de personajes históricos y su participación activa en la trama, aunque justificada por el autor al final del libro, me costó de creer y me sacó un poco de la historia."}, {"userName": "Mariel (TheCrownedGoddessReads)", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/4923137-mariel-thecrownedgoddessreads", "userReview": "La forma de escribir de Gómez-Jurado es fluida y envolvente, te transporta a los maravillosos escenarios de Sevilla del siglo XVI sin dificultad. La historia evoca una ciudad que es como una mujer de la noche, solo ofrece sus placeres si tienes con que pagarlos. Para el pobre, sobras e injusticias. Según el autor, dedicó tres años a documentarse sobre el periodo y así poder brindarnos fidelidad en su relato. Menos mal que eso no se tradujo en descripciones kilométricas, sino en personajes atrayentes y una trama entretenida, preñada de aventuras."}, {"userName": "Javier", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/5399017-javier", "userReview": "Hay novelas que te impulsan a leer otras novelas. Hay novelas que son clásicos de aventuras. Hay novelas que hay que leer antes de los veinte años. Un clásico con referencias a otras historias, que alimenta al rebelde que llevamos dentro. Sancho es un rebelde por antonomasia. Nunca hace lo que se supone que ha de hacer. Tuvo la peste y no murió. Hundió la mano en la mierda pero decidió no agachar la cabeza. Sancho es un joven que dice \"No\"."}, {"userName": "Tsvetelina Stambolova-Vasileva", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/24686330-tsvetelina-stambolova-vasileva", "userReview": "Четох книгата на руски под името \"Легенда за крадеца\".Това е класически приключенски роман, в който има красиви жени и смели мъже, приятелства, предателства, любов, омраза, смърт, морски битки и двубои с шпага, дръзки обири, жестоки и влиятелни врагове, бедност и разкош. Не е детско-юношески в никакъв случай, но пък е за тези, които и на зряла възраст пазят в себе си любовта към романите от детството."}, {"userName": "Mar Martinez ripoll", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/27843683-mar-martinez-ripoll", "userReview": "Como siempre, Juan Gomez Jurado nos mantiene con los ojos pegados al libro... Da igual que se trate de un médico asesino en pleno siglo XXI que de las andanzas de un joven en pleno siglo de oro español. Desde el poder y relumbrón de la clase alta hasta la miseria más absoluta de los pobres, en Sevilla vamos a seguir las andanzas de Sancho de Ecija y con el sufriremos y pelearemos, encontrando por el camino personajes que harán de la historia una \"historia de aventuras\" con mayusculas"}, {"userName": "Arsenovic Nikola", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/15328380-arsenovic-nikola", "userReview": "Zaista izvaredno napisana knjiga sa upecatljivim likovima i nepredvidivom pricom. Maksimalana ocena zbog toga"}, {"userName": "Lidia C. R", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/67928924-lidia-c-r", "userReview": "La verdad es que se me ha hecho un poco pesado. No me malinterpretéis. No es un mal libro. Si os gustan las novelas realistas, probablemente os guste este libro. Doy fe de que está maravillosamente bien escrito. ¿Cuál ha sido el problema, entonces? Bueno, creo que en ocasiones la historia iba demasiado lenta. Tampoco es un libro en el que continuamente estén pasando cosas y la trama sea tan apasionante que no puedas soltar el libro. Sí, pasan cosas, pero a pequeñas dosis. En mi opinión es un libro para aprender sobre la época y disfrutar de la escritura, pero no un libro, por ejemplo, que te pueda sacar de un parón lector.Está bien, pero no es para tirar cohetes."}, {"userName": "Agustin Padilla", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/75731196-agustin-padilla", "userReview": "Entretenida historiaUna entretenida historia, bien documentada, amena y de fácil lectura. La inclusión de los personajes históricos me pareció muy divertida y acertada así como la analogía del Robin Hood sevillano.Disfrute su lectura."}, {"userName": "Vicente L Ruiz", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/4606736-vicente-l-ruiz", "userReview": "Esta va a ser la primera reseña que escribo (tampoco es que escriba muchas) unos días después de haber acabado un libro. Hacerlo así tiene desventajas: se pierde la inmediatez, el entusiasmo que puede generar el libro recién acabado. Por otro lado, hay que escribirla con lo que te queda más dentro, con los posos, con el retrogusto del vino. Veamos cómo va.En primer lugar, compré el libro cuando bajó de precio la versión para Kindle, pero por circunstancias variadas leí el primer capítulo y tuve que aparcarlo hasta tomarlo definitivamente. Por ello, tuve la impresión de que el inicio es algo dubitativo o lento, y que la (prometida) acción tardaba en llegar.Nada más lejos de la realidad: la acción se inicia ya en el segundo capítulo, y no para hasta el final. Porque esto es algo que se debe tener en cuenta: \"La leyenda del ladrón\" no es una novela histórica, aunque esté magníficamente ambientada en el Siglo XVI: se trata de una extraordinaria novela de aventuras.Juan Gómez Jurado recrea la Sevilla que fue capital del mundo, con todo tipo de detalles, para contarnos las aventuras de Sancho de Écija, el niño que en el primer capítulo se salva de la peste y es rescatado por nada menos que Miguel de Cervantes, comisario de abastos de Su Majestad Felipe II. A partir de ahí acompañaremos a Sancho mientras hace amigos inseparables e inesperados, enemigos implacables, se enamora de una joven independiente y luchadora, y aprende a convertirse en el ladrón legendario del título.Recuerdo un detalle importante que uno de mis profesores de literatura (el bueno) nos contó: si en un libro pone \"novela\", todo vale. El autor habrá creado en su interior lo que desee, manipulando a su antojo las situaciones. Además, una de las consideraciones que he llegado a averiguar que hace que un libro me resulte irresistible es cuando domina eso que en inglés se denomina \"world building\": cuando el libro construye su mundo de manera consistente y coherente. Que el libro tenga base histórica no lo hace menos difícil, y más cuando Juan Gómez Jurado decide mezclar su novela con personajes reales. Personajes reales que, obviamente, manipula a su antojo como comenté arriba, pero qué bien lo hace.Resulta difícil no revelar nada de la trama, pero dado que muchos de los datos siguientes se encuentran en reseñas online, si no en las mismas solapas del libro, baste decir que Gómez Jurado utiliza no solo a Cervantes, ¡sino al mismísimo Shakespeare! Me ha resultado fascinante observar cómo, en la labor de \"world building\", a lo largo de toda la novela se van dejando detalles que, con toda la intención, recuerdan a las obras del Manco y del Bardo. Mientras estaba leyendo el libro, tuiteé que, en un punto determinado, me recordaba a \"El conde de Montecristo\". Me resultó magnífico cuando, unos días después, contestando un meme sobre sus 10 personajes de ficción favoritos, Juan Gómez Jurado incluyó a Edmundo Dantés entre ellos. Y es que \"La leyenda del ladrón\" bebe de y homenajea también no solo a los clásicos, sino a todos los grandes escritores de novelas de aventuras: he creído detectar no solo a Dumas, sino a Sabatini, Salgari y quizás Stevenson, y no quiero ni pensar en las referencias que me puedo haber perdido.En definitiva, he disfrutado muchísimo leyendo \"La leyenda del ladrón\". La combinación de una ambientación perfectamente conseguida, la narración que nos lleva de una aventura a otra sin pausa, más la miríada de detalles y guiños desperdigados por toda la novela, han acabado por hacer que me resultara irresistible. Se trata de un gran libro que recomiendo sin reservas."}, {"userName": "Brandy", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/2352222-brandy", "userReview": "[Al comienzo pensé que la trama sería al estilo de alguno que he leído en el género fantastico: un chaval que encuentra gracias al destino a un adulto que acaba siendo su profesor como la trilogía de Brent Weeks . Esa idea se fue diluyendo conforme leía hasta que vi de que iba el tema. Eso me pasa por no leer las sinopsis, algo que se está convirtiendo en costumbre.La trama general no me dio respiro alguno porque el prota no paraba de meterse en líos y terminar de la peor manera posible. La verdad es que hubo momentos que me dije: \"pobre Sancho, no está ni \"puteao\". ¿Alguna vez le va a salir algo bien?Sobre los personajes históricos que aparecen, es un detalle, pero pasé del juego de las frases porque no estoy puesta en ninguno de los que aparecen..Hubo un detalle que me dejó flipada. Y es sobre Clara. No llegué a entender porque el autor le hacía boticaria y \"casi\" libre. La verdad es que en la época en la que se mueve el personaje, la mujer tenía un papel totalmente secundario (algo que se aprecia durante toda la novela. Cuando leí el apartado de las licencias y vi que el autor había usado la biografía de una mujer que hizo lo mismo que Clara pero usando un disfraz de hombre, lo vi más claro. Así si. No es la primera vez que me encuentro a una mujer en épocas pasadas se tiene que disfrazar de hombre para poder conseguir lo que quiere.Sobre Josué y el lenguaje de los signos que tenían entre Sancho y él, en algún momento me perdí. Tan pronto leías que los personajes hacían los gestos como que aparecía en plan diálogos. Es que me metía en situación y no entendía como en algunas situaciones les daba tiempo para \"hablar con signos\".  (hide spoiler)]"}, {"userName": "Jose Luis", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/29922310-jose-luis", "userReview": "Un gran homenaje al camino del héroe que tantas ficciones han hecho sobre él, con guiños del autor a la cultura popular. Con un desarrollo de los personajes principales interesante y emotivo en ocasiones (La historia de Josué es tierna desde su origen hasta su encuentro con Sancho). Y el choque (ficticio) de esos dos grandes de la literatura es sencillamente magistral."}, {"userName": "Estibaliz79", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/5020972-estibaliz79", "userReview": "Como he estado tres días sin internet, se me ha acumulado el trabajo, así que vamos a ser breves y directos; o, dicho de otra forma, al grano.Como mucho, un 2 y medio. Y es que Juan Gómez-Jurado es un buen escritor, de fama reconocida ya en el tema este de la novela histórica, pero a mí ésta se me ha hecho un poco tediosa y no me ha aportado nada. Repite demasiados tópicos del género y los personajes son en gran parte un cliché. Toda esta historia es cosa sabida, que ya nos contaron antes autores como Matilde Asensi, David Ball, Arturo Pérez Reverte o Tim Severin.La verdad es que estaba deseando terminarla, y no precisamente para saber qué pasaba con Sancho y compañía, sino para poder pasar a otra cosa. La inclusión en la trama de Shakespeare y Cervantes tiene su gracia, pero tampoco es nada nuevo. Reconozco que mejora un poquito a partir de la mitad... de ahí el medio punto extra, o incluso el dos."}, {"userName": "Lou", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/19770032-lou", "userReview": "He leído God's Spy y The Moses Expedition del mismo autor y ambas me gustaron mucho. Este autor tiene una forma única y trepidante de contar historias; y ésta vez no fue la excepción. La historia está ambientada en Sevilla, mayormente, en el siglo XVI y cuenta muy detalladamente y con crudo realismo, la vivencia de aquellos años. Además, como componente de lujo, une a Shakespeare y Cervantes Saavedra en algunas escenas.La historia es muy interesante y tiene mucha intriga, además está narrada con pulcritud y se nota a la vista que el autor se esmeró con la investigación del tema. Sin embargo me pareció que por momentos la historia se hacía muy larga y eso le quitó un poco de ritmo, pero no hay ninguna duda de que es un excelente libro."}], "description": "Prepárate a transportarte a la Sevilla del XVI,\u2028 a un fascinante mundo de mendigos y prostitutas, nobles y comerciantes, espadachines y ladrones. El amor, la pasión y la venganza son los pilares de esta magistral novela de aventuras en torno a un niño salvado misteriosamente de la muerte, que crecerá para erigirse en la última esperanza\u2028 de los desfavorecidos. El destino de Sancho y el de quienes le rodean hunde sus raíces en los secretos orígenes de la literatura. Su historia te cambiará para siempre.http://www.youtube.com/embed/mNghvmSvInM\"", "title": "La leyenda del ladrón", "url": "https://www.goodreads.com/book/show/13702177-la-leyenda-del-ladr-n", "average": 4.06, "cover": "https://images.gr-assets.com/books/1337129750l/13702177.jpg", "reviews": 97, "authors": [{"url": "https://www.goodreads.com/author/show/364872.Juan_Gomez_Jurado", "name": "Juan Gomez-Jurado"}], "type": ["Historical", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/13702177-la-leyenda-del-ladr-n", "http://www.goodreads.com/book/show/17666932-la-leyenda-del-ladron", "http://www.goodreads.com/book/show/19446420-legenda-o-lopovu", "http://www.goodreads.com/book/show/19062669-la-leyenda-del-ladr-n", "http://www.goodreads.com/book/show/27420709-cicatriz", "http://www.goodreads.com/book/show/681552.God_s_Spy", "http://www.goodreads.com/book/show/6715394-the-moses-expedition", "http://www.goodreads.com/book/show/20426394-el-paciente", "http://www.goodreads.com/book/show/10204213-the-traitor-s-emblem"]}