{"ratings": 459, "userreviews": [{"userName": "Anna [Floanne]", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/4459724-anna-floanne", "userReview": "È la storia di Rose, che un giorno, dopo vent'anni di matrimonio e tre figli, si ritrova piantata dal marito Ben che, semplicemente, dice che non l'ama più.... Ho letto critiche molto dure e recensioni contrastanti. A me personalmente è piaciuto molto, forse perché ha toccato corde del mio passato (purtroppo) che non hanno potuto evitare che mi immedesimassi con Rose e i suoi figli, vivendo la stessa rabbia e la stessa amarezza del tradimento, dell'abbandono, la stessa paura di un futuro divenuto improvvisamente incerto, la stessa umiliazione di dover mendicare soldi che fino al giorno prima erano dovuti, con quella sensazione di impotenza, di una vita che va in pezzi e ciò nonostante con la stessa forza di ricostruire da soli una quotidianità che sia vagamente serena, per amore dei propri figli. Ci sono libri che a volte parlano di noi e a noi, libri incontrati per caso, che sicuramente non saranno capolavori dal punto di vista stilistico, ma che tra le righe nascondono i nostri ricordi e sì, io purtroppo ricordo molto di quanto è raccontato in questo romanzo. Voto: 4 ****"}, {"userName": "Sara Booklover", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/5263140-sara-booklover", "userReview": "Allora, partiamo subito dai pregi del libro (purtroppo pochi): la scrittura è semplice e scorrevole, lo si legge velocemente, i capitoli sono brevi e ciò porta ancora di più ad una narrazione dinamica. E ora i difetti: manca di sentimento. La protagonista, che dovrebbe essere l'emblema della disperazione, non trasmette NULLA! E poi, i risvolti della storia sono parecchio banali e a tratti surreali (o forse sarebbe meglio definirli semplicistici e fantasiosi?). Faccio un esempio per farvi capire a cosa mi riferisco. **** inizio spoiler **** Come prevedibile, la protagonista si trasforma in una super-donna. In un paio di giorni trova subito un'opportunità di lavoro (solo questo basterebbe a farlo rientrare nella categoria dei libri fantasy) e inizia a impastare e infornare centinaia di panini nel suo forno di casa, manco casa sua fosse un panificio (e poi, altra trovata fantasiosa: per fare il pane si alza alle 6 e alle 10 di mattina è già tutto pronto e consegnato. L'autrice non ha mai sentito parlare delle 6 ore di lievitazione necessarie per fare un pane decente? Io provai una volta con una sola ora di lievitazione e venne uno schifo!!!). E infine... rullo di tamburi, nel giro di pochi mesi mette su un'azienda di catering! (E qui l'impressione che il libro sia ambientato nel paese dei balocchi è sempre maggiore...) **** fine spolier **** Non so esattamente il motivo per il quale decisi di acquistare questo libro, forse perché era parecchio famoso e immaginavo qualcosa di più profondo... e invece mi sono ritrovata a leggere una storia che sembra fatta con lo stampino, dai risvolti scontati e superficiali. Mi ha dato l'idea di un manuale di autostima per mogli lasciate dai propri mariti, in cui il messaggio principale è: le donne ce la fanno, a qualsiasi età e in qualsiasi condizione economica... sì, però a patto che riusciate a fare la \"moltiplicazione dei pani e dei pesci\". Secondo me una donna appartenente alla vita reale e nelle condizioni della protagonista, leggendo questo libro pieno di cavolate si demoralizza ancora di più!"}, {"userName": "Claudia Sesto", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/23094890-claudia-sesto", "userReview": "\"Piano, piano. Ogni giorno ha la sua pena. Quanto basta per arrivare a sera.\"Una mattina, mentre Rose sta preparando la colazione il marito Ben, improvvisamente, le annuncia che il loro matrimonio è finito, lui la lascia, senza spiegazioni e chiudendosi la porta alle spalle. La vita di Rose le crolla addosso, ha tre figli a cui accudire, non lavora ed era certa che tutto questo non le sarebbe mai accaduto, dopo un fortissimo schock iniziale, raccoglie tutte le sue forze, aiutata dalle sue amiche, cerca di ricostruire piano piano una normalità per la sua famiglia così fortemente colpita nell'animo, un dolore profondo quello dell'abbandono, provato dai figli e per lei un senso di sconfitta e di grande responsabilità per non aver ancora accanto a sé un marito che la ama. La Catherine Dunne ci racconta di una separazione vista con le sensazioni, le emozioni, i turbamenti di una donna: la sorpresa e lo smarrimento prima, il dolore poi ed infine l'accettazione di un nuovo stato quello di libertà. Un grande lavoro quello della scrittrice che in modo incalzante ci racconta come l'abbandono di un marito, traditore ed irresponsabile, può causare su una donna/madre e su i loro tre figli la perdita di una vita che è sempre trascorsa su binari ben delineati di colpo viene stravolta, non ci sono più certezze e verità, tutto un mondo è da ricostruire, con fatica, orgoglio, coraggio e con grande forza d'animo. Rose passerà momenti terribili, ma nonostante tutto troverà dentro si sé una forza che non avrebbe mai creduto di avere e ricostruirà un'ambiente per la sua famiglia dove vivere il più serenamente possibile, cosciente che nulla sarà più uguale a prima e che quello in cui credeva si è infranto miseramente una mattina mentre stava preparando la colazione. \"...ho detto che gli uomini e le donne sono come tanti traghetti. Esternamente sono molto simili, nel punto di partenza e nella destinazione. La tragedia è che mentre uno è ancora impegnato nel tragitto di andata l'altro ha appena iniziato quello di ritorno.\" Un libro da leggere, oggi più che mai, ci parla di un matrimonio dove una donna e un uomo vivevano insieme, ma con sensazioni completamente diverse, Rose ci credeva ancora con tutta sé stessa, amava il marito e viveva per la famiglia, Ben non sopportava più niente, amava un'altra donna, voleva essere di nuovo libero e senza più figli ad intralciare, Rose aveva accanto a sé \"la metà di niente\"."}, {"userName": "Sandra", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "Al contrario degli altri ho letto prima il seguito di questo libro, comunque il risultato non cambia molto. Non posso dire che non mi sia piaciuto, ma non mi ha certo entusiasmato. A me queste donne che si sono annullate per anni durante il matrimonio vivendo solo per far felice il marito, per farlo sentire un sultano in casa danno veramente fastidio. Poi una cosa che mi ha colpito molto in questo libro e anche nel suo seguito è che nei momenti di difficoltà, per far fronte alle situazioni di emergenza...si prende una bella tazza di tè e tutto passa!"}, {"userName": "Ginny_1807", "userReviewDate": "Jun 21, 2012", "userURL": "http://www.goodreads.com/user/show/10382635-ginny-1807", "userReview": "Ben scritto, tenero e commovente. Rose, la protagonista, è sempre vissuta per gli altri soffocando i propri bisogni, finchè un bel giorno il marito la pianta in asso per un'altra donna e lei si ritrova ad essere, come recita il titolo, la metà di niente. Il romanzo descrive il suo sgomento, la sua amarezza, le sue paure, ma anche il suo cammino, piano piano, giorno per giorno, a piccoli ma inarrestabili passi, verso la libertà, l’autonomia e l’autostima, insomma verso una vita vera."}, {"userName": "Lia Valenti", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/69991080-lia-valenti", "userReview": "Primo libro della Dunne che leggo.Storia quasi banale ma scritta bene ."}, {"userName": "Ella Endif", "userReviewDate": "Jun 20, 2012", "userURL": "http://www.goodreads.com/user/show/6850870-ella-endif", "userReview": "Tre stelline e mezzo.L’atmosfera cupa che aleggia in tutto il libro, dall’inizio alla fine, ha penalizzato un po’ la valutazione generale. La storia è scritta bene, il linguaggio è scorrevole, interessante la sovrapposizione temporale del presente (narrato al passato) e dei ricordi (narrati al presente). D’altro canto è anche vero che l’argomento trattato è parecchio scomodo: induce a porsi delle domande che per amor di serenità forse è più semplice evitare, ma non utile.Tutta la trama ruota intorno al percorso emotivo della protagonista, Rose, lasciata dal marito ad occuparsi dei loro tre figli e a far fronte al sostentamento della famiglia.La descrizione della donna tratteggia una figura estremamente rigida, una persona che necessita di programmare ogni cosa, di riempire i vuoti della giornata per il terrore che possa esserci del “tempo” dinnanzi a sé. Rose ha bisogno di non essere mai sola con se stessa e questo accade anche prima che il marito la lasci. La sua severità è rappresentata ovunque ed è, forse, propria di molte donne che vivono la vita degli altri, per compiacere un marito, un compagno, i propri figli. Anche con gli stessi figli, per esempio, Rose si \"lascia andare\" sempre in maniera accuratamente studiata non rivelando mai se stessa. Non credo che essere dei \"duri\" in ogni situazione sia indicativo di un miglior lavoro genitoriale.Ammetto di non essere entrata molto in sintonia con lei, anche se in alcuni punti del libro le avrei tranquillamente battuto il cinque.Su Ben, non mi pronuncio. Un uomo che lascia la moglie e i figli senza una spiegazione, senza sicurezza economica, senza curarsi del loro benessere psico-emotivo, per me non è nemmeno un uomo. Quindi, glisso.Nel complesso, lo consiglio. E’ un libro che stimola la riflessione, curato, non banale, forse un po’ maniacale nei contenuti, ma posso presumere che fosse nell’intento dell’autrice per ricercare la continua tensione all’equilibrio verso cui la protagonista protende e di cui abbisogna fin da quando è ancora ragazza e non madre/moglie.Quasi quattro stelline, va ;)"}, {"userName": "Heathcliff Earnshaw", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/45201754-heathcliff-earnshaw", "userReview": "Un romanzo scritto con la stessa grammatura stilistica di un atto notarile: piatto e senza pathos, dal principio fino alla fine. Non c'è uno snodo, una evoluzione, una catarsi. La protagonista è priva di ogni spessore, un pollo freddo. Il motivetto \"ogni giorno ha la sua pena, quanto basta per arrivare a sera\" è riproposto fino allo sfinimento. Insomma, una minestra riscaldata."}, {"userName": "Liza M.  Jones", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/34585320-liza-m-jones", "userReview": "Recensione completa su www.pennaecalamaro.comUn giorno Ben entra in cucina. Sta cercando Rose, che è occupata a bollire le uova.«Rose.»Ultimamente non l'ha quasi mai chiamata per nome, perciò lei alza lo sguardo sorpresa.«Dobbiamo parlare.»Il mondo crolla, anni e anni precipitano turbinando, vite vengono distrutte. Adesso Rose sa che tutte le venture sono state annunciate da quella frase. Dobbiamo parlare.«Devo andar via per un po'. Penso che abbiamo bisogno di stare ognuno per conto proprio, solo per un periodo. Mi dispiace farlo così, ma è che non sono felice.»Rose fissa le uova.(...)In questo romanzo d’esordio, la scrittrice irlandese alterna la cronaca dei fatti che stanno accadendo nel 1995, anno in cui Ben decide di voler tornare a essere felice, e la ricostruzione della storia che li ha portati da giovani fidanzati a quello che sono diventati oggi. \"Non era più la metà di una rispettabile, solida coppia borghese. Era la metà di niente.\" Questa frase, secondo me, racchiude l’essenza del libro. Rose e Ben anelano entrambi al riconoscimento sociale, a costruire un nucleo che li faccia sentire accettati, dove ognuno si comporta con giudizio e secondo quanto gli viene richiesto, senza chiedersi mai se è questo ciò che davvero vogliono. Quando Ben annuncia alla moglie di aver deciso di andarsene, non sta infliggendo un duro colpo a una moglie innamorata, no, ma a una donna che ha fatto dell’apparenza e della convenienza il suo stile di vita. La sua prima reazione, infatti, non è di disperazione per l’abbandono, ma d’incredulità, perché queste sono cose che succedono agli altri, non a lei. Ma chi sono gli altri? Sono quelli che accompagnano i figli a scuola, che fanno spesa al supermercato, che puliscono casa ogni giorno, che aspettano la ciurma la sera con un piatto fumante in tavola. Gli altri non sono altro che noi. E quando tutte queste attività quotidiane perdono di senso, non possiamo fare altro che chiederci: chi sono io? Perché “gli altri” continuano a girare per il supermercato come se nulla fosse successo? (...)Gli altri elementi del romanzo, tutto sommato, sono meno interessanti (...). I continui flashback rendono la lettura veloce, ma non arricchiscono più di tanto le figure dei protagonisti, né del loro contorno familiare. Rose e Ben rimangono due personaggi piatti, senza grandi evoluzioni, fondamentalmente bloccati nel loro egocentrismo (...)"}, {"userName": "Collezionedistorie", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/70297586-collezionedistorie", "userReview": "C'è chi ha scelto la [persona] sbagliata, e forse ha scelto per tutta la vita?Ho amato molto Rose. Rose che non è perfetta, che ha sposato Ben anche quando c'erano parecchi campanelli d'allarme che avrebbero potuto insospettirla e indurla ad accorgersi che forse non era così adatto a lei. Rose che Ben l'ha sposato, e gli è rimasta fedele vent'anni, a differenza di lui. Quando Ben la lascia, con tre figli ed uno che ha perduto appena nato e al quale ancora pensa, Rose rinasce. L'ho amata per questo: per il coraggio, a quarantadue anni e tre figli, di reinventarsi, di buttarsi anima e corpo nella difficile impresa di ritrovare se stessa ed il proprio baricentro, mettendosi al primo posto. Rose mi ha fatto molto riflettere sul significato di una coppia e di un legame, sull'importanza di scegliere una persona che provi per l'altra gli stessi sentimenti, ed abbia le stesse intenzioni. Ben è senza dubbio il meno coinvolto dei due, senza dubbio non si impegna alla stessa maniera; Rose mi ha fatto riflettere sull'importanza dell'essere ricambiati, e dell'esigerlo."}, {"userName": "Sandro Pasquini ", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/44062696-sandro-pasquini", "userReview": "I problemi della vita quotidiana resi romanzoE' il secondo libro della Dunne che leggo e mi sono fatto l'idea che l'autrice abbia veramente una grande capacità di raccontare e trasformare in bei romanzi, storie di vita quotidiana più o meno problematica.Il libro è ben scritto e la lettura è piacevole e a tratti coinvolgente."}, {"userName": "Kristin Hogk", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/36792107-kristin-hogk", "userReview": "A nice first one. An easy read, constant, touching, but harmless, without huge surprises. Certainly not a new story, but a nice idea indeed, to tell parallely about the present and the past, both meeting in the end."}, {"userName": "Virginia", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/35838959-virginia", "userReview": "3 stelline e mezzo!"}, {"userName": "Rotapannotta", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/9838025-rotapannotta", "userReview": "I don't really like it! It looks like some kind of cheap romance, without the romance!"}, {"userName": "Waitalie Nat", "userReviewDate": "Jun 20, 2012", "userURL": "http://www.goodreads.com/user/show/2009204-waitalie-nat", "userReview": "Catherine Dunne, nel 1997, fece il suo debutto nel mondo letterario con il romanzo 'La metà di niente' (In the beginning, in lingua originale), suscitando pareri che ancora oggi tendono ad uniformarsi. La maggior parte dei lettori lo ha considerato un libro deludente, monotono e insipido, privo di twists e sfiancato dal peso di una protagonista uggiosa vittima delle sue stesse geremiadi. Non esattamente un esordio grandioso, eh Catherine?Per quel che mi riguarda non propendo assolutamente per una bocciatura totale, pur avendo una corposa lista di recriminazioni per la signora Dunne. Ho detestato con ogni singola fibra del mio corpo lo stile narrativo e il registro linguistico impiegati, il linguaggio fin troppo scarno ed essenziale, le scarse capacità descrittive dell'autrice e i continui lamenti della protagonista, Rose, ora in lacrime tra le braccia di Martha – l'amica che, in quattro e quattr'otto, si fionda in Irlanda dalla lontanissima Australia per farsi una pinta di vino con la compagna piantata dal marito - , ora in preda ad attacchi di pianto incontrollato e crisi isteriche immotivate. E detestare contemporaneamente lo stile e la protagonista di un libro rende la missione più complessa di quanto ci si possa immaginare.Tuttavia, prendendo il mio coraggio a due mani – e rifiutandomi di vanificare l'ennesima lettura dell'anno - , ho tentato di concentrarmi sui significati che stanno alla base di questo libro e sull'immagine universale del tradimento e delle famiglie spezzate che si evince dalla rappresentazione della famiglia Holden. Di grande interesse è, ad esempio, la primissima percezione che Rose ha dell'accaduto – ovvero dell'improvvisa e inaspettata partenza di Ben con un secco “Non ti amo più” -. A destabilizzare il suo equilibrio non è tanto l'addio del marito in sé, quanto il fatto che un tale episodio si sia potuto verificare in casa sua, che lei, Rose Holden, madre di Damien, Lisa e Brian sia stata piantata in asso! Lei! Proprio lei! E' “agli altri” che dovrebbe accadere, alla “gente che viveva in piccole case con frotte di bambini”, non alle “famiglie solide e perbene”. Al di là del suo spiccato egocentrismo, è questo un atteggiamento in cui possiamo facilmente ritrovarci, una filosofia cui aderiamo spesso senza troppa consapevolezza, un tempo reinterpretata in chiave appena più tragica dall'artista Marcel Duchamp: sulla sua tomba fece infatti incidere l'epitaffio, da lui stesso composto, “d'altronde sono sempre gli altri che muoiono”. Ora, forse questa Rose Holden manca del genio e dell'intelligenza di Duchamp, ma l'idea che sta alla base delle loro parole è di fatto la stessa: siamo esseri corruttibili nient'affatto immuni alle sventure, e solo quando inciampiamo in una di esse ci rendiamo conto che forse “gli altri” potremmo essere proprio “noi”.Arriva poi il momento in cui l'impensabile, ciò che avevamo visto sconvolgere la vita della vicina di casa, delle signore che si affrettano lungo le corsie del supermercato, delle lavoratrici che nascondono il proprio dolore dietro una maschera di trucco, ecco che diventa normalità e in virtù di esso è necessario ristrutturare la propria vita. Ora scavando nel passato, alla ricerca di indizi che ci erano sfuggiti e che ci avrebbero permesso di porre un freno alla tragedia prima che facesse tutto il suo corso, ora tentando di rimettere insieme i cocci di un vaso che potrebbe ancora essere recuperato, rendiamo accettabile e vivibile ciò che prima non lo era, combattendo quel mostro di rabbia che rischia di montarci dentro giorno dopo giorno, sfruttando le nostre energie per riempire d'amore la vita di chi può ancora essere salvato.Un romanzo che, dunque, non mi sento di bocciare e di definire un flop totale – nonostante i rimproveri prima elencati -, ma di consigliare a chiunque creda che le sventure possano essere solo una faccenda “propria” o una faccenda “degli altri”. Vi ricrederete."}, {"userName": "Agosto2010", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/5050618-agosto2010", "userReview": "4,5 un libro che merita di essere letto."}, {"userName": "Dierregi", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/22113748-dierregi", "userReview": "Ci sono libri scritti con uno stile talmente affascinante da far scordare la banalità della trama e altri, dalla trama ricca e fitta che fa scordare la piattezza dello stile. Il libro di esordio della Dunne non appartiene a nessuna delle due categorie. La trama segue la separazione di una coppia borghese, banale quanto i loro nomi. Ben e Rose, sposati da vent'anni, con tre figli, sono una famiglia benestante e incredibilmente noiosa. Ben e' il più vitale dei due, non necessariamente in maniera produttiva. Un bel giorno scarica Rose abbastanza brutalmente, per andare in vacanza con l'amante. A parte la brutalità dell'abbandono, si può capire come dopo vent'anni di mancata comunicazione con Rose, Ben possa essersi scocciato....Rose e' una casalinga passiva e ottusa, il cui motto e' \"Ogni giorno ha la sua pena, quanto basta per arrivare a sera\". Tipica \"allegria\" di stampo cattolico-irlandese. Apparentemente, Rose non ha notato nessun segno di crisi e la dipartita di Ben la coglie totalmente di sorpresa. Questo la dice lunga sui loro rapporti, per cui mi sento di \"incolpare\" anche Rose per il fallimento del matrimonio.Casalinga uggiosa e totalmente dipendente dai soldi del marito, in un paio di settimane Rose ha un rigurgito femminista, si trasforma in un'imprenditrice e comincia a guadagnare per mantenere se stessa e i figli.... A questa improbabile indipendenza guadagnata cosi' alla svelta, si unisce un epilogo frettoloso e insoddisfacente, in cui Ben, da patetico uomo in crisi di mezz'eta' si trasforma in una specie di mostro insensibile.La tesi del libro sembra essere che gli uomini hanno torto al 100% e che sono incapaci di comunicare in maniera razionale. Questo può' essere vero in parte, ma quello che si evince dalla questa storia e' che anche le donne sono incapaci di comunicare (vede scenate isteriche che coinvolgono Ben e Rose)."}, {"userName": "Mcecilia", "userReviewDate": "Feb 06, 2011", "userURL": "http://www.goodreads.com/user/show/4099300-mcecilia", "userReview": "Interno familiare, lunedì mattina: dopo diciannove anni di matrimonio e tre figli un uomo dice a sua moglie che sta per partire, che non la ama, che la loro storia è finita. E' un evento che cade come un macigno improvviso e inaspettato sulla protagonista, che pur riconoscendo segnali e eventi a dimostrazione di una relazione difficile, non avrebbe mai immaginato che il suo matrimonio potesse finire. C'è il 'prima' e il 'dopo': un dopo che è uno spazio per la ricostruzione di una vita personale e il raggiungimento dell'indipendenza. Di pari passo, a capitoli alterni, viviamo anche il ventennio precedente, dal fidanzamento alla nascita del primo figlio, dalle prime difficoltà di comunicazione al mutismo rassegnato. Lo ho trovato un libro scontato e superficiale: nelle descrizioni dei personaggi dove la caratterizzazione primaria è forte e non esistono sfaccettature (la casalinga devota e rassegnata, il marito egocentrico e autoritario, l'amica liberal e indipendente... caricature di vite prive di sfumature). E così il cambiamento che avviene nel 'dopo', con la protagonista che attraversa ovvi passaggi nel percorso di riconoscimento del suo essere anche vittima all'interno del suo matrimonio. Si legge bene, ma non basta."}, {"userName": "Hemmie Martin", "userReviewDate": "Aug 13, 2016", "userURL": "http://www.goodreads.com/user/show/7336013-hemmie-martin", "userReview": "I devoured this book in a few sittings - it would have been in one had life not been so busy.This story flits between the present day and 1972, when Rose and Ben met. The past gives us an insight into how Ben may not be the right person for Rose, but she is too blinded by love to notice.The present day rips Rose's pain wide open for us to see it its naked form, and we can feel every nuance of pain. As the story involves children, they too are keenly affected by events, and the author deals with this admirably.But this isn't just a story about the misery of a breakdown of a marriage, there is humour, affection, love, and hope, making it a pleasure to read. This book is now out of print, so I had to source it secondhand on Amazon. I discovered this author on Twitter and researched her novels. Needless to say, the author has more books available, and as I enjoyed her writing so much, I have purchased two more of her more recent books.This may be twenty-years-old, but it stands the test of time, and I recommend you hunting it down for an enjoyable read."}, {"userName": "Suanne Laqueur", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/10273177-suanne-laqueur", "userReview": "Mimicking the book of Genesis, this novel tells the seven-day recreation of the world of Rose, a North Dublin woman whose husband unceremoniously dumps her on April 1, after 20 years of marriage. Feeling like an April Fool and Rip Van Winkle, Rose learns within a week how to rule her own world and create light from darkness, a daunting prospect in largely Catholic and male-dominated Ireland. While interspersed scenes from the past show the marriage souring, Rose in the present is steadied by late-night planning sessions and drinking wine with her next-door neighbor Jane. Jane's catering friend offers work, and Rose, a veteran cook of many family meals, eventually starts her own business—baking wedding cakes, ironically. I liked it because it was fast-paced, but the emotion of it still came through. A real feel-good success story. You cheer for Rose as she grows confident enough to refuse her husband's pleas for reconciliation and to make a success of her business, her kids, and her life on her own."}, {"userName": "Alisea", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/9586382-alisea", "userReview": "Una mattina come tante nella cucina in disordine, nell'aria pungente di una Dublino ancora addormentata. Una mattina come altre quella in cui Ben decide di dire addio alla moglie Rose, ai suoi tre figli e a vent'anni di vita assieme. Rose non parla, non reagisce, non sa nemmeno cosa provare...La storia non è per niente originale, sia nelle pagine dei libri sia nella vita reale, ma il libro l'ho letto praticamente tutto d'un fiato.La storia coinvolge e la protagonista, Rose, si fa amare.Ci si avvicina a lei come se fossimo amiche, testimoni della sua storia, desiderose di confortarla e di spronarla a continuare per la sua strada. a rialzarsi in piedi ignorando le ginocchia sbucciate, e ad esultare con lei quando riesce a tirare fuori grinta e forza per ricostruire qualcosa di forte e grande, a partire da sé stessa.E' il diario della rinascita, di una donna dapprima imprigionata da illusioni romantiche poi libera e sicura delle proprie capacità."}, {"userName": "Ale Volpe", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/56580066-ale-volpe", "userReview": "Inizia lento, ma poi rallenta ancora. Personaggi scialbi a cominciare dalla protagonista, che chissà come non ha capito niente della vita, finora, ma adesso è tutta un'altra cosa (anche se proprio adesso inizia a bere, ma una come lei smette quando vuole). Sarebbe anche interessante seguire questa sorta di secondo passaggio alla maturità, ma non con questi personaggi. Sono piccoli automi che si muovono, lentamente, per dare vita ad azioni di scarso interesse, più che altro della giusta durata: litigano anche con buone ragioni, ma la vera ragione è che così, poi, possono fare pace; se si arrabbiano è perché così, poi, possono farsela passare. E così il tempo passa le pagine scorrono e si arriva alla fine di questa brutta soap."}, {"userName": "Rosemary", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/4723954-rosemary", "userReview": "One morning, without warning, Rose's husband Ben tells her he is leaving her and their three children. Shattered, she has to pick together the pieces of her life and find a way to carry on, dealing with the children's grief and anger as well as her own. We see flashbacks over their marriage that reveal things were not as perfect as Rose may have been telling herself, all along.This started out in a lovely, understated way, and I did enjoy it, but I was expecting something different at the end - more of a twist, maybe. There were hints of developments (at the bank, with old friend Martha) that fizzled out, while the ending became dramatic in a different way."}, {"userName": "Chiarar", "userReviewDate": "Dec 02, 2012", "userURL": "http://www.goodreads.com/user/show/8701573-chiarar", "userReview": "Avere una famiglia perfetta. Questo era quello che credeva di avere Rose. Nessun problema economico, nessun problema con il marito, tre figli che non davano preoccupazioni troppo grandi.Ma se il marito decide di andarsene un motivo c'è: la famiglia non era così perfetta come credeva Rose. Per tutto il libro sembra che la protagonista apra gli occhi veramente dopo venti anni.Tra flashback e presente, si vive la storia di una donna che tenta di rialzarsi.Buona narrazione e capitoli corti per seguire meglio la storia."}, {"userName": "Suni", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/19672760-suni", "userReview": "«Magnificamente scritto e molto, molto commovente. L'esito più felice del romanzo è nei personaggi: le parole e le azioni di Rose, i gesti e gli atteggiamenti dei suoi bambini sono quelli di persone reali.»Ho riportato il commento di Roddy Doyle in quarta di copertina perché è esattamente quello che penso anche io.Aggiungo solo che questo è un libro che fa bene, da 5 stelline per forza.E che Ben è uno stronzo.PS: nove anni dopo la Dunne ha ripreso in mano la storia per scriverne il sequel, ma per il momento temo una delusione (vedi: Ben che si rifà vivo) e non mi ci avventuro."}, {"userName": "Lindsay", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5898555-lindsay", "userReview": "This is a touching and accurate account of a breakdown of a twenty year marriage. Rose's journey from dependent wife to independent breadwinner is very moving, and she is a likable character, with Dunne maintaining the equilibrium between sentimentality and objectivity.My only criticism would be that the happy, inspirational ending felt empty and safe. It could have ended with much more depth."}, {"userName": "Emily", "userReviewDate": "Aug 18, 2009", "userURL": "http://www.goodreads.com/user/show/286737-emily", "userReview": "i didn't *not* like this book. it was calming and methodical and gave me quite a feel for the routine of motherhood - in a way that made it seem both tedious and completely desirable. it made me aware that life could still look pretty damn good even if i was in the midst of raising a 13-year-old budding shoplifter and trying to make a living cooking quiches. and if you consider how recently divorce was legalised in ireland, it's actually got a whiff of women's lib about it as well."}, {"userName": "Anna Rossi", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/12967450-anna-rossi", "userReview": "Una storia piena di sentimenti e di sentimento. L'anatomia di una crisi familiare viene affrontata passando per i gesti quotidiani svuotati del loro senso o pregni di significato, mentre dal dramma dell'abbandono si passa alla certezza di una crescita, di una riscoperta, di una rinascita con la netta sensazione che la vita riserva sempre meravigliose sorprese se solo si ha il coraggio di affrontare gli ostacoli che si incontrano lungo il percorso."}, {"userName": "Valentina Accardi", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/31706522-valentina-accardi", "userReview": "Sono partita prevenuta, mi aspettavo di peggio. Invece è un romanzo carino, (secondo me) senza pretese, che fa passare velocemente qualche pomeriggio.Credo che la parte centrale sia un po' noiosetta e ripetitiva, ci sono diverse pagine che potevano benissimo essere evitate. L'idea di fondo comunque è interessante. Un po' troppo \"femminile\"."}, {"userName": "Francesca Prospero", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/11141040-francesca-prospero", "userReview": "Si legge piacevolmente e in breve tempo. La storia non è il massimo dell'originalità ma comunque ti prende forse proprio per la descrizione di una situazione molto comune: una separazione dolorosa ma utile con il riscatto della donna fino a quel momento annullata nel proprio ruolo di moglie e madre. Il finale fiacco mi ha un po' deluso."}], "description": "Dublino. Siamo a casa di Rose e Ben. Lei è in cucina, lui sta per uscire, come tutte le mattine. Ma questo è un giorno diverso dagli altri, perché Ben non è diretto in ufficio: sta lasciando Rose e i tre figli, sbattendo la porta in faccia a più di vent'anni di matrimonio. Tornerà? E quando?Dopo una convivenza che fino a ieri credeva felice, Rose si ritrova di punto in bianco scardinata fin nelle più intime fibre. \"Non era più la metà di una rispettabile, solida coppia borghese. Era la metà di niente.\" Mentre segue un percorso interiore scandito da sentimenti contrastanti nei confronti dell'uomo che credeva di conoscere e da altrettanti dubbi e sensi di colpa, Rose si trova obbligata a far fronte all'emergenza economica immediata, a doversi improvvisare capofamiglia, a inventarsi un mestiere e un nuovo equilibrio famigliare. E grazie al sostegno delle persone che le sono vicine e alle risorse che non sapeva di avere, riesce a riprendere in mano le fila della routine domestica e a ricucire le lacerazioni della propria anima.In una sorta di doppio percorso, dove ala cronaca diretta dell'abbandono e dei suoi penosi strascichi si alterna a mo' di contrappunto una serie di flashback in cui vengono ricostruiti gli avvenimenti che hanno segnato il suo vissuto, a quarantadue anni Rose trova una voglia, anzi, una gioia assolutamente nuova di vivere e di sorridere.In La metà di niente, che è il suo felice romanzo d'esordio, la dublinese Catherine Dunne raggiunge uno splendido esito: grazie a una stupefacente autenticità di linguaggio e a una resa quasi fotografica delle situazioni e degli stati d'animo ci regala un ritratto, tanto vero e toccante quanto ironico e pieno di brio, di una crisi di coppia vista al femminile.", "title": "La metà di niente", "url": "http://www.goodreads.com/book/show/7913987-la-met-di-niente", "average": 3.42, "cover": "https://images.gr-assets.com/books/1327402176l/7913987.jpg", "reviews": 45, "authors": [{"url": "https://www.goodreads.com/author/show/65603.Catherine_Dunne", "name": "Catherine Dunne"}, {"url": "https://www.goodreads.com/author/show/4474510.Eva_Kampmann", "name": "Eva Kampmann"}], "type": ["Fiction", "Cultural", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/7913987-la-met-di-niente", "http://www.goodreads.com/book/show/26200378-la-met-di-niente", "http://www.goodreads.com/book/show/8524416-la-met-di-niente", "http://www.goodreads.com/book/show/13338709-la-met-di-niente", "http://www.goodreads.com/book/show/1438478.In_the_Beginning", "http://www.goodreads.com/book/show/4682718-in-the-beginning", "http://www.goodreads.com/book/show/27276196-the-years-that-followed", "http://www.goodreads.com/book/show/8517545-set-in-stone", "http://www.goodreads.com/book/show/1205211.Something_Like_Love", "http://www.goodreads.com/book/show/7970881-missing-julia", "http://www.goodreads.com/book/show/4332587-at-a-time-like-this", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}