{"ratings": 14795, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "He was extremely adept, had started hunting small game with his grandfather at the age of seven. Landreaux took the shot with fluid confidence. When the buck popped away he realized he'd hit something else--there had been a blur the moment he squeezed the trigger. Only when he walked forward to investigate and looked down did he understand that he had killed his neighbor's son.\nLouise Erdritch uses a wide palette. She draws a core event in strong lines, then brings together a diverse range of textures, shapes and colors, mixing, matching, highlighting, smudging, lightening and darkening to make an amazing picture, more mural than something readily contained inside a frame. We know from the little text that precedes the shooting that Landreaux Iron's family and Peter Ravich's family are close. Their wives are half-sisters. Their children play together. They share and trade with each other, and the families help each other out. Faced with the horror of Dusty Ravich's accidental death, Landeaux, seeking to atone, looks for guidance in tradition, and in a sweat lodge ceremony arrives at a solution. Landreaux and his wife, Emmaline, would give their son, LaRose, to the Raviches. Louise Erdrich - from NPR LaRose Iron is a very special eight-year-old, with a name that goes back generations. One of the brightest colors in LaRose is family history. The history which runs in his veins is manifest in kindness and wisdom far beyond his years. He's a great kid and you will love him. We see back to 1839, when the first LaRose was a girl, sold by her desperate mother for food. We follow her journey. There are looks back to the history of several other characters, with particular focus on their experiences in BIA schools.\nI wanted to write something with LaRose, I had the title—I always have the title. The rest of the book really collects the stories, the language, the characters, they collect around the title. So I knew I would write about LaRose. I had forgotten, though, that there was a LaRose far back in our family history. I really don't know anything about this LaRose, but I know the approximate dates when she lived. So I constructed a historical set of LaRoses, and then I worked out the traumas and the difficulties and everything until we came to this LaRose.\nWe follow not only the travails of Landreaux, and LaRose having to cope with his abruptly different family situation, but with Emmaline Iron as she yearns to have her son back, and Peter and Nola Ravich as they grieve for their lost child and try to incorporate his replacement. There are wonderful characters beyond. Both the Irons and Raviches have daughters. Maggie Ravich, who we meet as barely a teen, is a particularly fierce and moving personality. Romeo Payat is a person of less than stellar character. He and Landreaux were friends once, but Romeo suffered physical damage as a result of an adolestent adventure Landreaux led, suffered emotional disappointment as well, and spends much of his waking life plotting his revenge. A local good guy of a cleric (carried over from The Round House) struggles with his mission, his sobriety, and his vows. One of Louise Erdrich's many strengths as a novelist is that central to her work is the distinct hue of her Native American culture. Thus her 21st century characters incorporate ancient Ojibwe lore and religion in their lives, just as their 1839 ancestors did, including origin myths. There is considerable magical realism on display. Fantastical things, light and dark, take place. Disembodied, flaming heads pursue their killers. A starry spirit light flies to a welcoming womb and takes root. Astral projection is a reality, although not for all. One character is joined with an owl spirit with positive effects. Another is seen to be hanging out with the spirit of a lost friend. The lines between the material and the spectral have been nicely smudged. Guilt-driven hallucinations highlight several scenes. Did you see what I saw? Was that really there?As she did in her previous opus magnum, The Round House, Erdrich mixes in a bit of sparkle in the form of secular cultural lore. In the last book, it was Star Trek NG. Here, kids quote from Blade Runner and reference robot flicks. Older Western culture colors the native experience as well. Xenophon's Anabasis and William Ernest Henley's poem Invictus tint the historical portraits.Contemporary (1999-2002) reality offers up a rich store of material as well. The lie-based Operation Enduring Freedom finds an echo in personal behavior, with consideration of the benefits of disarmament. Y2K figures in as well, with one character going a bit Y2Krazy overpreparing. In a recent interview with Claire Hoffman for Goodreads, Erdrich says:\nWell, the book really is about disaster in some ways. On the first page you thought something would happen, but not what did happen. And this is the same thing that happened with Y2K: We thought something would happen, everyone was prepared, and then what happened was 9/11.\nGripes? Well, only one, really. Erdrich yields to an impulse to insult one particular religious institution with a juvenile bit of low humor. Not that I do not enjoy some pre-ad yucks, and not that I am a huge fan of organized religion. But it seemed out of keeping with the rest of the book, without adding anything worthwhile.There are some lines that run throughout that you might want to keep an eye on. Losing children (whether accidentally, or accidentally on purpose) is popular here, which certainly highlights the importance of community ties and maintaining a wide family network. Opacity of spirit darkens the scene for this or that character from time to time. (That's always the struggle—where is the balance between the decency and brutality? And that's a struggle that is embodied in Romeo. ) The challenges of coping with being dealt a lousy hand figure large. (I tried to not make it about grief and instead make it about the way people live.) But the primary line running through LaRose is redemption. Making things right, emotionally and spiritually if not always physically, is a challenge for more than just Landreaux. Louise Erdrich not only tells amazing stories, she tells them with a lyricism, with a beauty that is rare, rich, textured, and ecstatic. She mixes the contemporary with the historical, wisdom with foolishness, crimes with punisments, individual and communal, guilt with redemption, violence with justice, beauty with ugliness, the mundane with the magical, tragedy with comedy. You might have to mentally step back a few paces, maybe take a spot on a cushioned bench far enough away from this large image to fully appreciate it. Then move closer to give individual sections a finer look. There is a lot to see, and all of it is wonderful. In a rare feat, Louise Erdich has followed one great book with another. LaRose is an outstanding novel, engaging, emotionally rewarding, and a definite must read.Publication - May 10, 2016 (HC) - April 18, 2017 (TP)Review Posted - May 6, 2016=============================EXTRA STUFFLinks to the author’s personal and FB pagesErdrich's personal site redirects to the site Birchbark Books. She owns the store.The poem Invictus is cited in the bookAs is Xenophon's Anabasis, an ancient tale of a great journey that informs the experiences of the first LaRoseOther Louise Erdrich I have reviewed-----The Round House -----The Plague of Doves -----The Painted Drum-----Shadow TagDon't miss Ron Charles's magnificent review of this book at the Washington PostNovember 23, 2016 - LaRose is named to the NY Times list of 100 Notable Books of 2016March 16, 2017 - LaRose wins the National Book Critics Circle Award for fiction"}, {"userName": "Jen", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "An accident that results in a child's death, sets the course of another child's life, LaRose. The impact to the two families and their complex and dynamic relationships that are changed. LaRose is forced into the role of healer: to help each family cope with the death of the child by being the core of each families existence. What we discover is the history of LaRoses through the generations and the power and spiritual qualities each have been endowed with.So lavishly written with Indian folklore of shape shifters and spirits from the past. Rich in sentiment with themes of grief, forgiveness and redemption are woven throughout this rich tapestry. The structure of the story alternates between different characters and different times.This was magnificent. Now baptized into the Erdrich world, I look forward to getting my hands and eyes on all she has written. 5 ★"}, {"userName": "Angela M", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "A tragic event , forever affecting two families happens in the second paragraph of the book and shapes this story, immersing the reader into the grief that is shared by them. One child is dead , one is alive , and the two families are torn apart. This sadness hangs in the air like one of those days when it's so humid it's hard to breathe. It's difficult to read at times because Erdrich makes you feel their pain. Her beautiful language takes you to the dark places where their grief has taken them. Amidst the darkness, though, there is the light of LaRose who knows what to do to save his two families. \"Our son will be your son now......It's the old way.\" With this we are drawn into the Ojibwe culture, their religion with a foot hold in the world of their native beliefs as well as the present day Catholicism. The sweat lodges , the pipes , the \"old way\" of atonement which allows a family to give their five year old son to the family that has lost theirs. The past touches the present in so many ways as it is interspersed throughout in the stories of the other LaRoses, in the past relationships of some of the characters, in the \"old ways \" that stay and through the spirits of the past.This is such a beautifully told story and I really can't understand why this is my first book by Louise Erdrich. For years , I of course knew who she is , and always found something else to read . I have owned a copy of Round House for ages and just never got to it but I plan to change that soon. Highly, highly recommended !Thanks to HarperCollins and Edelweiss and to Louise Erdrich for this achingly beautiful story."}, {"userName": "Diane S ☔", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "From the synopsis, so this is not a spoiler, we know that there is an accident that causes the death of a child. In Native American culture this requires an act of atonement, so Landreaux Iron, the perpetrator convinces his wife Emmaline to give their young son Larose to Peter and Nola, the parents of the dead child. This act sets off a chain of events that will take years to overcome.Mixing Native American culture with some magical realism, Indian folklore, customs and some beautiful prose is a hallmark of Erdrich's work. She takes a heartbreaking scenario and uses a broad reach to show the reader the impact on all involved. This young LaRose is a very special person, actually the fifth Larose in his bloodline as we learn in various back stories of the other LaRoses. Loved reading the stories of this families lineage, the wonderful characters who bore this name and their amazing abilities. In the present day this young man will try to overcome the obstacle of belonging to two different families, trying to save everyone involved and becoming the unifying presence in their grief. Grief is very much a theme in this novel, grief and its effects on all. In the end a act to prevent a tragedy will prevent a larger tragedy later in the book. The characters change throughout this book, both families but also a man named Romeo who was at a boarding school with Landreaux. He gave his own son to the Irons to raise and has much to forgive and atone for himself. All these separate stories are pulled together masterfully by books end. A book where there are really no bad guys, just people who have made bad decisions or have been touched by fate. ARC from publisher."}, {"userName": "Linda", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "\"I wonder who you are now, Nola said.It's just me, said Peter, the same old me.No it's not. We'll never be the same.\"A miscalculated action. A misstep in the wrong direction. A side-eyed glance in one's vision.With the last taste of summer on the horizon, Landreaux Iron steps out onto the very edges of his property in North Dakota in 1999. The majestic features of a well-muscled buck catches his eye and the automatic reflex in his trigger finger sets off a response for which there will never be a means of re-entry into gentler times. To his horror, Landreaux spots the body of his neighbor's son, Dusty, on the ground. A soon-to-be multi-dimensional grief will settle here.Louise Erdrich weaves this thread of grief throughout her storyline. Grief is like the bird that lights softly upon the vines that slither through the chambers of the heart. Grief takes up permanent residence there. Grief makes not an occasional visitation. It is a deep, deep personal interaction with the reality of loss. If someone tells you that grief can be \"shared\", they are misguided. The language of grief is never spoken with quite the same exactness on the lips of a single soul.If you have ever read any of Erdrich's books before, then you will know that they are not linear in nature. Her storylines create concentric circles within the depth of her fine characterizations. There is no artificial formula with this author. Her characters, and there are many here, pull the story in many directions from the revealing episodes of the long past into the sharpness of the present. These characters are complicated and their lives reflect the uneven pathways that they travel.This novel is more than the telling of the unspeakable tragedy of that day and its impact on two families. It is an abundant treasure of how each of us, in our own way, are a composite of those who came before us and the absorption of that into our own life experiences. We are complicated beings. This is a complicated story that will most certainly involve you and draw you in.Tread lightly. There is much to see, to feel, and to experience within these pages."}, {"userName": "Glenn Sumi", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "Death + Depression + Drugs + Revenge + Rebirth + Renewal = Spellbinding StorytellingIn the opening pages of Louise Erdrich’s unforgettable new novel, Landreaux Iron is hunting a buck in the North Dakota forest. When he shoots, he discovers, to his horror, that he’s killed his neighbour’s five-year-old son, Dusty.What happens then is remarkable. Landreaux and his wife Emmaline, following an old Ojibwe tradition, decide to give their own son, LaRose (who’s the same age as Dusty), to the boy’s grief-stricken parents, Pete and Nola, to raise as their own. This changes the lives of everyone involved. LaRose, of course, is yanked out of one environment (complete with loving siblings) and transplanted into another (which comes with a nasty sister, Maggie). Landreaux, an alcoholic, must deal with his feelings of guilt. And Nola, Emmaline’s embittered half-sister, spirals further into bitterness and depression. Meanwhile, Romeo, a figure from Landreaux’s childhood who’s always loved Emmaline, uses the event to concoct a Machiavellian revenge scheme. As if this weren’t complex enough, Erdrich goes back 160 years and interweaves the stories of OTHER ancestral LaRoses, mostly female figures who have healing and restorative powers. Erdrich takes her time in setting up the scenes, characters and time periods. The result is a fascinating patchwork quilt of a novel, whose pattern is only obvious when you pull away and see how beautifully it’s been constructed. But unlike many of her other books, Erdrich doesn’t always make it easy by providing a character/narrator’s name and time period at the start of each chapter.Don’t know who a character is? Read on; he or she will probably pop up in another 50 pages. It helps that the prose is so incredible. It’s lyrical (Erdrich is also a poet) but never pretty for its own sake, never showy. It’s direct, tough, and confident enough to mix myth and everyday pop culture references.I think above all it’s the voices of Erdrich’s characters that are so impressive. She has a way of getting inside her people’s skins, showing you their grievances, what makes them laugh, their deep-rooted pain and their all-too-human foibles. But she never judges. They’re all part of the panorama of humanity. (Even The Wizard Of Oz author Frank L. Baum comes under scrutiny for some appallingly racist comments he once wrote.)Before reading this book, I never thought I’d be interested in entering the mind of a scrawny, brilliant near-psychopath who siphons gas out of cars, steals medication from seniors (oh but he gets his comeuppance during one scene!) and has a thing for Condaleeza Rice. Nor did I understand the effects of a parent’s depression on children until this book. And did Erdrich really get my heart pounding reading about a girls’ volleyball game? You betcha. She also created one recurring comic/horrific image that is too unbelievable and awesome to spoil. But you'll know it when you see it.Not everything works, mind you. The middle section is a little baggy and wanders narratively. The idea of multiple LaRoses never pays off in a way I think she intends. And not all the characters are as compelling as Romeo, that scrawny, Iago-like villain, and Maggie, Nola’s disturbed but fierce and brilliant daughter. But I have to say I loved spending time in Erdrich’s world. There’s something comforting about it. In the same way that all-knowing spirits and ghosts often enter a scene, she is there to show us life in all its gorgeous, haunting and enduring pain and beauty.Wounds and death are inevitable; but forgiveness and healing (and maybe a bit of earthy humour) are always preferable to anger and revenge. Not a bad takeaway.***If Goodreads offered half-stars, I'd rate this as a 4.5. But it definitely makes me want to go back and read more Erdrich. I agree with Robbie (Snotchocheez) who says this could win the Pulitzer Prize. I'd go further and say that Erdrich could, in time, win the Nobel Prize. Like Faulkner, she's created an entire fictional universe, and she's giving voice to a people whose voices have been silenced. Plus, she's one hell of a storyteller."}, {"userName": "Elyse", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Landreaux Iron accidentally kills a child while out hunting a buck.He and his wife, Emmaline, follow an old tribal tradition, and give their son, LaRose, away to the horrifically bereaved neighbor's. Peter and Nola, are crazy, sick, in pain...emotionally, physically, spiritually ...in complete shock....faced with unbearable AGONY. Their other daughter is left hanging to figure out her emotions alone, too. Her parents are so distraught ... they don't have it in them to help their other child grieve and heal. Thank God I'll be discussing this novel in a small book group soon...I've been pretty 'distraught' myself from reading this book. The famous line....\"Our Son will be your son now\"....has haunted me for over a week.WHY??? Why create another tragedy? Was this custom REALLY carried out? Did some Native American tribes actually give a child away - to pay a debt- to atone - their mistake of killing another couples child? What about the poor CHILD??? LaRose is a victim. Who cares how fancy his name is-- or how spiritual? It's a pretty big obligation to be a healer of two families when you are a five year old child. Who is going to heal HIM??? My God... I feel a little bad for even saying this....( forgive me)....but in Judaism, this is not how we atone. I have such little respect for this custom-- that everything else I read in this novel- was on top of that. I HAD TO DEAL WITH **MY** emotional anger, nausea, judgment, sadness, more anger, and sit with questions of WHY? WHY? WHY?Ok.... Setting MY PERSONAL FEELINGS ASIDE.....Am I glad I read this novel? Yes and no. I'm not sure it was healthy - for me..........and I saw the ending coming a mile away..........I actually liked the historical family stories about each of the different 'LaRose' characters....( 4 women, and one young boy)....But I just had a hard time with LaRose ( the young boy), taking on the role of spiritual healer. It was fun having Romeo return - from \"The Round House\"....and the triangle story between he Landreaux and Emmaline...is enough drama for an entire novel itself...and nobody can say that Louise Erdrich can't write - she's as great as the master of writers we have writing today....BUT THIS WAS book was emotionally gripping - painful for me --- I took things to personal....( just being honest)....I still want to scream ....WE JUST DON'T DO THAT....give our kid away under any circumstance!!! DON'T DO IT! What a god awful tradition!!! Was there some brightness in this book-- yes, of course...with an uplifting ending...But....but honestly it brought up too many painful feelings from my own childhood ....I've debated for days how I might write this review and what I'd rate it.Some days....I say...\"well, of course it's a 5 star novel\"Other days I say... \"It wasn't a 5 star experience for me though - I took things too personal - to a point where 1 day I 'was' sick. I've feel a need for more clarity about this old tribal tradition. I tried to find some facts on Google....only to come up with nothing. I'll be in a small book group discussion with a few other members on this site soon...Others are welcome to join. All that is required is that you read the book.Contact me or....Sara ( with the yellow teacup) 3.5 stars."}, {"userName": "Donna", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/6217162-donna", "userReview": "This was a difficult book to read and it was just as difficult to rate with all the good elements mingling with the not so good ones. If my expectations for this book hadn't been for it to be a 100% literary novel based on the one other book I read by this author, I might have rated it higher. In fact, I was set to give it four stars until the last quarter of the book which seemed grafted on from a different story, some family drama with shades of chic lit. I don't like using that term in a critical way, but I can think of no other one that fits it better. I'm not going to summarize the story since everything is covered in the description on this site. As you might expect from that description, this is a story filled with sadness over the three years it chronicles the lives of two blood related families dealing with the tragic accidental death of one young boy. Each person deals with it or doesn't deal with it on emotional terms, as well as on practical terms when the man who accidentally killed the boy offers his own son to the deceased boy's family in retribution, according to an ancient Native American tribal custom. His boy, LaRose, is only five, but mature beyond his years and in possession of the strengths his familial name denotes. Unfortunately, the author never fleshes him out completely or gives him all that much page time for the reader to really know him as much as the adults in this book. This is strange since he's at the center of the story and holds all the elements and all the characters together, same as the deceased boy, Dusty, whom the reader knows even less. I felt this was a big mistake, not having the reader spend any time with Dusty, either before he died or through remembrances or flashbacks. He's just a hazy character to be mourned by the two families without anything solid attached to him to make the reader miss his presence. If that sounds hard hearted, let me assure you I'm very soft hearted. But in this case, I could only mourn Dusty on an intellectual level and not feel the loss of a character I never knew. I wanted to miss him as much as his family. And speaking of not knowing characters well, by the end, a few of them made decisions and took action that made no sense based upon what I knew of them earlier on. I felt the author was manipulating them to make the story into what she wanted it to be instead of it growing organically out of how those characters would really act. In other words, this was an author driven story, not a character driven one. Now for all the good things about this book that had me wanting to give it four stars. The technical aspects of the writing were excellent. And I really admired how the author went back through time, covering in abbreviated form the history of the previous four generations of LaRoses, each one of them special in their own way. Seamlessly, she blended this familial history with interesting aspects of Native American culture, magical realism, and historical facts. This part of the book was an enriching experience and gave me the literary elements I was expecting. But it wasn't enough to hold this book together for me when it contended with the unrelenting sadness of so many unsympathetic characters that were given the most page time. Yes, they were mourning. And yes, that mourning had them facing or running away from mistakes in their past. So maybe I should cut them some slack, which I did for the entire book until I'd had enough and was ready for it to end. I wish I could give this book a higher rating, especially when I see all the five star reviews praising its merits. It was definitely worth reading for the positive reasons I named above. But it was a trying experience for me to get through this book, and the last quarter of the book disappointed me, making me hesitate to recommend it. This is my opinion based upon what I look for in a book. Yours may be different should you choose to read it."}, {"userName": "Candi", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"We are chased by what we do to others and then in turn what they do to us. We’re always looking behind us, or worried about what comes next.\"When one tragic mistake is made, it will reverberate endlessly and affect the lives of two families. How does one atone for a wrong done to another? Will sacrifice and profound pain inflicted upon oneself and loved ones make things right? After accidentally shooting a young boy while out hunting, Landreaux Iron seeks help and comfort from his Ojibwe culture. The answer for him seems to be found in handing over his and wife Emmaline’s own beloved child to the family that has now lost their son. Peter and Nola Ravich accept this ultimate sacrifice. \"Our son will be your son now.\" And so this novel begins with such heartache and nearly unbearable grief. This book is beautifully written. The emotions of each character felt so very real to me. Each person affected by this horrible accident handled his or her grief in very different ways. Louise Erdrich does a superb job of showing us how these complex individuals dealt with their emotions and circumstances. Family dynamics are emphasized both within each family and across the two families. There are a lot of characters to keep track of here, but I didn’t find this to be too difficult. We are given the opportunity to explore some of these more than others. Maggie Ravich, sister to the deceased little boy, accepts her new brother, LaRose, much more readily than I would have expected. LaRose is the fifth LaRose going back several generations - each one being gifted with special healing powers. This LaRose seems to be no exception as his presence within the Ravich family seems to have a slowly building but restorative effect. The dynamics between a grieving mother, Nola, and her daughter Maggie made me quite heartsick at times. I didn’t much care for Nola and I’m not certain that this was due in full to her actions as a depressed mother – we don’t really know what she was like before the tragedy occurred. I just couldn’t bear to see the relationship between mother and daughter. Too much was put on that young girl who I grew to care about – probably more so than any other character in this book. I loved the relationship between Maggie and the Iron girls, Snow and Josette. They took her under their wings during her time of need. Woven throughout the current day narrative is one which introduces us to the first LaRose. Her story was appealing, if not a bit strange! There is a lot of mysticism throughout this book, which may not be to the taste of some readers but is necessary to understanding the Ojibwe culture. We also learn about Landreaux’s history and his former bond with a broken man named Romeo. A past adventure gone horribly wrong will drive a wedge between these two men that will have lifetime effects. As Romeo seeks revenge so many years later, it will shake the fragile lives that LaRose has been mending so painstakingly. Here is where the story becomes quite tense, but at the same time falls apart for me a bit. I don’t want to divulge any information, but will just say that I found the actions of some characters to be slightly unbelievable in the later part of the book. Everything seemed more rushed as the climax was reached, and I didn’t feel like the resolution was as realistic and solid as I would have liked. Maybe I missed something here; I can’t quite pinpoint the problem for me personally. Overall, I found LaRose to be quite gripping despite my quibble with the ending. I cannot agree with how the tragedy was handled – the giving up of one child to make amends for the loss of another, or seeking revenge for past misdeeds – but it did manage to teach me that a wrong cannot be made right. Forgiveness, however, is essential to healing. 3.5 stars rounded up to 4 stars."}, {"userName": "Michael", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "A story of two contemporary Native American families in North Dakota dealing with a personal tragedy and the role of one boy, LaRose, in fulfilling the healing process. Erdrich has been a favorite author for me over the years, but only with this do I feel the urge to use the “M” word for description: a masterpiece. It’s that good for story-telling, character development, and resonating across time to elucidate our current challenge of how to live with the historical trauma experienced by Native Americans. The tale begins with a man’s accidental shooting of a neighbor boy while hunting for deer. Nothing can ever be the same for all members of the two families and the community as well. To redress this act, Landreaux and his wife Emmaline come up with an old tribal solution, to offer his parents their own five-year old son, LaRose. This is a sacrifice of biblical proportions. How can it possibly work? It really doesn’t erase the tragic carelessness of the act, and LaRose can’t really substitute for the lost boy. And imagine what the impact on LaRose might be. But somehow the act does transmute the murderous rage and devastation of the bereaved couple, Peter and Nola, into something else. They eventually allow him visitations with his own family. And as LaRose grows up, he gains meaning as a healing mediator between the two families. The miracle of how he retains his boyish innocence while taking on the burdens and life challenges of the parents and siblings of the two families is marvelously told. I love how he wins over the bitter and alienated teen girl Maggie in his new family and tries courageously to defend he against boys at school who sexually assault her. His real sisters, who are zany and tough and volleyball stars, come to his aid at school when he is subject to severe bullying. LaRose and the kids in this story somehow solve problems that seem to defeat the adults. Both Landreth and Peter and Emmaline and Nola (who are half-sisters) have a lot of unresolved conflicts from their long history. The whole native community lives under the shadow of racial oppression dating from the European colonial invasion. Against the tide pushing them to assimilation many look for a sense of identity in the nurturing of old cultural traditions and modes of being kept alive by the tribal elders. Young LaRose slowly learns of other LaRoses in each generation of his family who assumed a special role in keeping such traditions alive and harnessing them for survival. From his grandmother (also a LaRose) he gets the story from the 18th century when the first LaRose, was given up by an Ojibwe woman named Mink as a slave to a fur trader in order to save her life. She in turn is saved by his white assistant, Wolfred, using her traditional knowledge of plant poisons, and her traditional skills keep them both alive in their escape through the wilderness. The mission LaRose imbibes makes him part of a large story: Mirage Ombanitemagad. The original name of Mink’s daughter. That name would protect him from the unknown, from what had been let loose with the accident. Sometimes energy of this nature, chaos, ill luck, goes out into the world and begets and begets. Bad luck rarely stops with one occurrence. All Indians know that. To stop it quickly takes great effort, which is why LaRose was sent.The novel soon splits the reader between the contemporary story in first decade of our current century and immersion in the lives of three generations of LaRoses that passed before. Past and present are shown to be perpetually entangled, as is good and evil. The goal of the residential schools to “kill the Indian, and save the man” fails when all the traditional skills, crafts, and myths are passed on by parent to child before such attempts at erasure. The spirituality of communing with ghosts and projecting the self into the sky or into animals is another tradition carried forward by the line of LaRoses. With the mixing of native and European blood that arises out of the collusion of the first LaRose and Wolfred, the saga of victim and victimizer in history becomes transformed into our common human story. Over and over in this novel, we witness the courage to make a sacrifice to reverse cruel wrongs committed in this world. The story of the Catholic priest, Father Travis, binds well with these themes. He inspires the Indian youth with a passion for achievement in physical fitness and the adults of the community with the power of small acts of kindness. But he knows knows well about personal sacrifice and the daily doubts of faith about higher purpose. He is a survivor of the bombing of an army barracks in Beirut that killed hundreds of soldiers. He harbors a hopeless love of Emmaline, one that helps keep him living:He was living out Newton’s Third Law—for every action there is an equal and opposite action. Time was the variable. Getting blown up in an instant; getting put together took the rest of your life. Or was it the other way around? He thought of Emmaline. At one point when LaRose is about ten, he is soaking up wisdom and tribal history from the elders at the nursing home where his grandmother resides. The ancient and dying Ignatia recounts an Ojibwe creation myth that involves the godlike Adam and Eve figures running from the rolling head of an evil woman they were forced to slay. Ignatia’s summary holds much hope for taking action in the moment to reverse evil (kind of Zen-like you might say): ”It is about getting chased”, with a long suck on the oxygen. We are chased into this life. The Catholics think we are chased by devils, original sin. We are chased by things done to us in this life. .We are chased by what we do to others and then in turn by what they do to us. We’re always looking behind us, or worried by what comes next. We only have this teeny moment. Oops, it’s gone!”“What’s gone?”“Now. Oops, gone again”.Ignatia and Malvern laughed until Ignatia gasped for breath. “Oops, oops! Slippery!”“What’s gone?”“Now.”“Oops”, laughed LaRose. “Slipped past!”This book was a treasure for me."}, {"userName": "Cheri", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "LaRose is a persistently bleak, dismal, gloomy, depressing novel. Unrelenting in the examination of multiple people with multiple emotional scars obtained, given, earned or not, earned through life. This book is not for the faint of heart.If a man destroys his neighbor’s property, most laws would demand some type of in-kind restitution. Damage a car or a fence and replace or repair it. These are fairly easy to grasp, we’ve all grown up with some variation of this, even if it is covered by insurance. But what happens when a child is accidentally hurt, or worse, killed? A human being can never really be compensated for, it doesn’t subtract from the pain of the grieving parents. My heart never stopped grieving reading this book, not only looking at this as a parent looking at losing a child, but I don’t believe a child could ever really comprehend, or recover from, his parents giving him to another family on any real level. There is a lot more to this novel, and it is all worth reading, but there is a lot of trauma in the stories contained within – generations of drama, trauma and pain. Lots of pain, lots of sadness, no significant amount of happiness or joy to balance it out. For me, where Erdrich shines in this novel is in her knowledge of Chippewa / Ojibwe culture and through her fine prose weaves through some of the culture and lore, the ancient stories of their origin. The way and times that Dusty’s voice is heard after his death, among other instances, have a touch of magical realism to them. Grief, how do we cope with it, how do we eventually find our way through it to function and then eventually just remember in bits and pieces, moments? Grief is so present throughout; it is as if it were another character. Redemption, how do we obtain it, is it something given to us by others or must we also learn to forgive ourselves? Nevertheless, there is beauty to be found. The weaving together of this story reminded me a bit of a crazy patchwork quilt, formed to become a lovely treasure, but only after all the pieces are joined together."}, {"userName": "Phrynne", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This book was so good I genuinely did not want it to end. If Louise Erdrich were to continue the story into another book I would be a very happy reader indeed:)This was my first book by this author and I have not yet looked to see what else she has written, but I definitely will follow her up. I enjoyed all of her characters, especially all of the children. LaRose was very special and for some reason I also had a soft spot for Hollis. I loved the references to the indigenous culture and beliefs and also the author's understanding of how these people are managing in the modern world. Again the children were the best representation of this as they acknowledged the ways of their forefathers and yet embraced the current life style at the same time.I think this is a book which will linger in my mind long after I have finished it and put it back on the shelf. Very well worth reading!"}, {"userName": "Zoeytron", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "It's all about grief. The loss of a beloved family member. The failure of a broken heart to mend. The ways we try to compensate for damage done, words left unsaid, deeds that cannot be undone. It's all in here. Heartbreaking and lovely."}, {"userName": "Ron Charles", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Louise Erdrich’s new novel, “LaRose,” begins with the elemental gravitas of an ancient story: One day while hunting, a man accidentally kills his neighbor’s 5-year-old son.Such a canyon of grief triggers the kind of emotional vertigo that would make anyone recoil. But you can lean on Erdrich, who has been bringing her healing insight to devastating tragedies for more than 30 years. Where other writers might have jumped from this boy’s death into a black hole of despair — or, worse, slathered on a salve of sentimentality — Erdrich proposes a breathtaking response.“LaRose” plays out in the Ojibwe territory of North Dakota immortalized in more than a. . . . To read the rest of this review, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Doug Bradshaw", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/808994-doug-bradshaw", "userReview": "Louise Erdich is a great writer and I enjoyed 3 of her other books a lot. However, as much as I hate to say it because so many of my goodreads friends seemed to love the book, I found it to be a bit tedious and I didn't find much meat or excitement in the overall story. The best part of the book for me was the story of the original LaRose, five generations back. But the contemporary offspring just seemed to me to be overly realistic; recovering alcoholics, petty jealous people, minimal depth and maybe just too simple, everyday life occurrences with kids growing up, and poor LaRose in the middle of two average families. That said, Erdich's ability to describe these everyday occurrences and thoughts of characters, the things that generate crazy seeming behavior, depression, drug addiction, kids being mean to other kids, etc., is as good as it gets. I just wish it would have been set in a more grandiose or meaningful story. There really was only one story-line, LaRose being given to another family. It wasn't enough for me. I still gave it three stars because of the excellent writing and the realistic peek inside of the lives of these particular native americans. Plus I love Louise."}, {"userName": "Debbie \"DJ\"", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/12620745-debbie-dj", "userReview": "I'm having a hard time rating this one as there were times I was fully engaged, the writing beautiful, yet others when it meandered, and I found myself disinterested. Louise Eldridge certainly has a style of writing that is uniquely her own. Her depiction of Native American traditions and culture are unlike any other.The beginning had me all in as a man accidentally shoots and kills his neighbors 5 year old son. He atones for this by giving the family his own son...LaRose. LaRose is one of five LaRoses who are named as such for their ability to transcend their bodies, and this particular boy for his healing powers as well.In all honesty, I read this almost three weeks ago, and am having difficulties remembering much else. Still, I do think fans of Eldridge will really enjoy this one."}, {"userName": "Marilyn C.", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/8170584-marilyn-c", "userReview": "La Rose is a captivating and emotional story that takes you into the culture and beliefs of the Ojibwe Tribe of North Dakota. The prose is slow and thoughtful, which gives the reader a sense of getting to know the many characters in this book which spans many generations, starting with the first La Rose in 1839. It's ultimately a story about devastating loss, remorse, revenge and forgiveness within a family. This has been a difficult book for me to rate, going between 4 or 5 stars. I felt there was a change in the story towards the end and it started to focus more on Snow, Josette (volleyball game) and Hollis (graduation) whereas Landreaux and Emmaline's storylines were not developed enough, leaving us hanging. Louise Erdrich is a wonderful storyteller and I look forward to reading her other books."}, {"userName": "Snotchocheez", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "Few contemporary fiction authors are able to capture the Native American experience as eloquently, if raggedly, as Louise Erdrich. When she's \"on\", her prose soars heavenward, eagle-like, providing an aerie-d panorama of rez life. Occasionally though, her gauzy observations, while often gorgeous, serve to obfuscate rather to clarify, like a sweat house experience gone awry.  LaRose encapsulates everything I love (and everything I'm less enamored with) about Ms. Erdrich's stylizing. The tragic set-up to balance the whole novel on? Pretty much perfect (and given the Erdrich Ojibwe filter, simultaneously foreign yet totally relatable): Two families (related by the half-sisterhood of their matriarchs, whose land tracts abut each other, straddling North Dakota reservation land) are wracked when the father of one family (with closer ties to the Ojibwe Indians) kills the son of the other family in a freak hunting accident outside their homes. To assuage guilt (and follow Ojibwe precedent), the Iron family offers up to the other family their own youngest son, named LaRose, to replace the killed one. The story splinters and filigrees off in myriad directions from there (some with crystal-clarity, others in gauzy, poetic obfuscation.) Some of the characterizations are like etched in acid (Landreaux Iron, of course his son LaRose, his daughters Snow and Josette, his strange childhood adversary Romeo: all stick with you long after you're done reading), though others that  should  stick with you (the parents of the slain boy Peter and Nola, the mother of LaRose (Emmaline Iron), the reservation Catholic priest Father Travis) are emotional ciphers. There is still so much to chew upon here. Family dynamics (both Ojibwe and non-Indian), rez drug culture and ever-perpetuating hopelessness, the way we deal with grief, Native-American history and lore: all whipped into a satisfying stew mopped up with bannock (Ojibwe) fry-bread. I don't know if I'll ever be able to completely cozy up to Ms. Erdrich's prose (the quotation-mark dumping and deliberate gauzy storytelling always give me pause before cracking one of her books), but, with some reservations (no pun intended) I recommend LaRose. I wouldn't be at all surprised to see this one win a Pulitzer next year (to go along with her dozens of other citations from the National Book Award to the Library of Congress Prize.) It would be definitely earned."}, {"userName": "Sara", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Not a spoiler, because it occurs in the first chapter of this book--Landreau Iron is hunting, stalking a deer, and accidentally kills his neighbor’s 5-year old son, Dusty. To atone for his role in the accident, Landreau resorts to “the old ways” and gives to his neighbor’s family his own son. The premise of this book, that a man can atone for his accidental killing of a child by giving to the victim’s family his own 5-year old boy, is a difficult idea to process. My initial reaction was that this man, in order to clear his own conscience, was subjecting his wife and his son and his other children to an inhuman and unnecessary deprivation. Like Abraham sacrificing Isaac on the altar, it is the worst punishment that could be required, but I could not help thinking it was visiting the sins of the father upon the son, and grossly unfair. I wondered how it could help the other mother to have this child filling the place of her own son, as if one child could ever replace another.That was my initial reaction. Deeper into the book, I saw this in a different light. I felt that LaRose, the child who is given away, had a great purpose and was the key to having all the members of both families survive this tragedy. In his person is embodied the way of healing the unhealable loss. The grief that runs through this story is palpable. It flows like a river around all the characters and it sweeps them along and plunges them down rapids that they cannot escape or navigate. Only LaRose seems to know how to deal with each of them and the dead boy head on. I loved this child, whose old-soul wisdom made his spiritual lineage believable and sweet.Louise Erdrich incorporates Indian mysticism into the novel without breaking the credibility of the story. I enjoyed the parts of the book that dealt with the five previous generations of family members named LaRose. But, I particularly liked the side-story of Romeo and Landreau. Romeo seemed to be a character outside the main story, but Erdrich connected the dots and made him an important piece of the main plot. It would have been so easy to see him as a worthless person, but the threads of his story reveal him slowly and caused me to redefine my initial assessment. I think one of the strengths of this novel is the way it makes you continually rethink your feelings and understanding of these people and their relationships to one another. This is my first Erdrich and I know now that I must go back and read The Round House, which is purported to be her finest work. I appreciate the authenticity of her writing and the depths to which she can plumb this culture and make me feel both how different and unique this culture is and at the same time how universally human."}, {"userName": "LeAnne", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Game over. Life is too short to force 15 hours of a laboriously tedious, if beautifully written, multi-multi-multi generational audiobook into your brain. Ive read two Erdrich books before and knew the Ojibwe mysticism would show up along with a massive, interwoven family tree of stories. I tolerated the out of body experiences and the disembodied head of an evil, murdered man which rolled around chasing the original LaRose and her husband to be. Was this gorgeous and heart wrenching? You betcha. But TOO MANY CHARACTERS AND THEIR AFFILIATED PLOTS. There are five LaRoses, each descended from the first, and the author found it important to describe the angst and challenges of every single darn generation. Really, I just got bored and could not connect very deeply with the characters because my attention was constantly being diverted to distant family members and their issues. This third Erdrich that book I've read never had me immersed enough in the story to genuinely care. It felt like contrived fiction - a Hallmark commercial with an old lonesome granny, alone with her ticking clock but who suddenly is visited by her grandkids, toting flowers and asking if she'll teach them how to make fudge.Don't get me wrong. My husband has Cherokee heritage , so I'm not eye rolling at the Trail of Tears or the endless massacres or all the thousands of acres stolen from them or how their language & culture were expunged. I respect those losses.. But after three books where Erdrich shovels mouthful after mouthful of cultural angst onto the plate - and further explained from the perspective of dozens of relatives (ie, not only did MY family get screwed over, let me just show you how ALL these families got messed up) - I just end up reading her stuff and thinking \"REDUNDANT.\"Her second book in this series The Round House is her best, as she manages to keep the story focused around one nuclear family. It is outstanding. The Plague of Doves was very good, but would have been better as a series of short stories where there is overlap of characters. I found it much better than LaRose, but a giant white board with a genealogical chart on the wall would've been VERY helpful.I recognized many characters from her other books and wondered how the heck readers who are new to her work are supposed to follow this extremely convoluted family story. Lest you wonder if Im just a bit obtuse, Im well educated in the sciences - Im no ninny, honestly, so either the audio book format was bad for this story or...dare I say it? ...she crammed too much in here. I hate to be a hater, but I'm ready for her to sing another tune. (less) 3 stars"}, {"userName": "Camie", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/7399266-camie", "userReview": "In a North Dakota reservation hunting accident one families father accidently kills the son of his neighbor's family , and by invoking an ancient tribal law turn over their own 5 year old son Larose to be raised by them as retribution. Parts of this book are beautifully written in prose and with insightful knowledge of ancient Indian traditions which Louise Erdrich is famous for writing about. There are quite a few characters in here and an array of subjects from 9/11 politics , Father Travis a Tae Kwon Do teaching , AA leading minister who's in love with one of the grieving mothers, high school volleyball games that turn into a near rumble.The very emotional parts where two families are trying to share a son and grieve the loss of a child and of causing others grief while very heartfelt somehow for me got all mixed up with other subplots mentioned above along with those of drug use , an old boarding school friend who's out for revenge,and another subplot of 6 generations of ancestors with the name Larose is also stirred into the pot. I know the author was trying to convey the traditional Indian culture along with the modern here , and many of my GR friends really enjoyed this book. But for my taste there were just too many odd diversions from what began as a very good central theme. 3 stars"}, {"userName": "Amanda", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "4.5 starsI love the way Louise Erdrich weaves old-time Indian folklore into her stories. This was fantastic.The death of a child is probably the worst thing a family can go through. In this case the child's death dramatically alters 2 families and their relationships. I really enjoyed the side story about the sisters and how they coped at a reservation high school. I especially liked Maggie.Erdrich's writing is spectacular in this. Her descriptions of the land and also the characters was great. If you haven't read this one, I highly recommend it."}, {"userName": "Robin", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/36555254-robin", "userReview": "Out of the night that covers me,Black as the pit from pole to pole,I thank whatever gods may beFor my unconquerable soul.In the fell clutch of circumstanceI have not winced nor cried aloud.Under the bludgeoning of chanceMy head is bloody, but unbowed.Beyond this place of wrath and tearsLooms but the Horror of the shade,And yet the menace of the years,Finds, and shall find me, unafraid.It matters not how strait the gateHow charged with punishments the scroll,I am the master of my fate:I am the captain of my soul.\"Invictus\" by William Ernest HenleyA terrible mistake. \"The fell clutch of circumstance.\" Landreaux shoots young Dusty, the son of his friends Peter and Nola, instead of what he thought was a deer. In the Ojibwe tradition, which seems unfathomable to me, Landreaux and his wife Emmaline give Dusty's parents their son, LaRose. The grief, enormous, shatters like stained glass and the shards splice everyone in different ways. Getting blown up happened in an instant; getting put together took the rest of your life.The book takes us through this grief, and in doing this, tells us the stories of the families affected by Dusty's death, and how LaRose becomes a healing force. We learn about the five generations of LaRoses. We learn about Romeo, a friend of Landreaux from childhood, who has grown twisted with addiction and bitterness, and who is obsessed with revenge. And we glimpse the gorgeous magical spirituality of the Native Americans, those who can rise out of their bodies.This is my first time reading Erdrich (aside from her extremely powerful short story The Shawl). Her writing is excellent; unsentimental, yet personal. She mixes the ancient with modern so seamlessly.I found the book a little too long, though. I had to wade through the middle with determination because I knew it would be worth it in the end. And it was."}, {"userName": "Mary", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/5304930-mary", "userReview": "Sometimes – because of your family, your background, your town, your status, your temperament, your father, your mother - there’s no way to win in life. Sometimes too much has been taken from you. And now this empty, pointless life. Your wife stops loving you. The only friend you’ve ever had turns his back on you. Your little brother dies. This hopelessness and heaviness was captured so well by Erdrich. I don’t think I’ve ever before read such an accurate portrayal of how deeply unsafe and wide-open the world feels when you’re a child of a suicidal parent. So much anxiety, so much numbing of minds. What a sad, painful book."}, {"userName": "Jill", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "It is a rare book that can create unbearable tension right from the very first pages. But from the start, it’s obvious that Louise Erdrich is in full charge of her narrative. “When the buck popped away he realized he’d hit something else—there had been a blur the moment he squeezed the trigger. Only when he walked forward to investigate and looked down did he understand that he has killed his neighbor’s son.”Landreaux Iron, an Ojibwe man, a loving husband and father, and a recovering alcoholic, kills his neighbor’s son while stalking a buck. To atone for his actions, he and his life Emmeline agree to share their youngest son LaRose – a 5-year-old boy who is the exact age of the dead son of their neighbors – with the bereaved parents.LaRose is not the first person in the Iron family who has borne that name, a name that is synonymous with mirage. There have been five LaRoses in all, and each of them is special in his or her own way. Erdrich writes, “That name would protect him from the unknown, from what had been let loose with the accident. Sometimes energy of this nature, chaos, ill luck, goes out of the world and begets and begets.”LaRose is called upon to function as the bridge between families, a bridge that heals. Bridges abound in LaRose: the bridge between the traditional and the contemporary, between loss and redemption, between youth and adulthood, between the real world and the mythic one. There are also bridges among the generations, all of whom share hardship and embody a sense of survival.Over the course of this amazing novel, we discover the first LaRose, sold by her mother, misused by her purchaser, and almost annihilated by her Indian body school. She links to the other LaRoses, evolving to the young boy who is the latest link to the tragedies that befall the family. LaRose in his own way is a healer, a Savior. Louise Erdrich has one again created something very special."}, {"userName": "Liz", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/20625013-liz", "userReview": "I’d been anticipating reading LaRose since I first saw saw it on a list of coming-soon recommendations, and the wait to get it from my library seemed interminable. I’ve seen some great reviews but I have to be honest and tell you that I wasn’t as enamored of it as I would have liked. To my mind there are two conflicting aspects when considering this book: the writing (lovely) and the story (mediocre). Let’s start with the good stuff. I really enjoyed Louise Erdich’s style, her ability to blend the literal and figurative so well that sometimes I couldn’t distinguish them. The beauty in this is that you can interpret these elements in your own way and they still maintain their contribution to the story as intended. Erdrich also displays a deep familiarity with Ojibwe culture and spiritual practices, and it’s skillfully woven throughout their everyday lives as well as the generational stories going back to the first LaRose. To add to her unique writing style, she clearly knows the addict/alcoholic mind. It’s a pretty f**ked-up state, pardon my language, and she’s nailed it. Booze nearly destroyed my life once upon a time and so I tend to be very critical of the way authors portray alcoholics in their stories. This book has the feel of either extremely thorough research or personal knowledge on the part of the author because I found myself able to relate to many of those insane behaviors. I also found myself weeping for the one person that I should, and whom most readers probably do, despise. As for the story, I won’t write a synopsis other than to say I was drawn by the idea of one family essentially giving their child to another as a way of helping that family recover from the loss of their own child. I couldn’t imagine how any parent could do this in the modern world or how it would play out - that was the hook for me. I don’t feel like that story was fully delivered because there were too many offshoots relating to the other children in these families and, for some reason I can’t explain, I wasn’t able to really connect with them. The standout story that truly shines is that of the original LaRose and her descendants, a fascinating tale that is but a small portion of the book. Please don’t let my three stars deter you from reading LaRose. There is a lot to be discovered here. The characters are complex, imperfect people struggling every day to navigate the waters of their despair, fears, aspirations, loyalties. There is an authenticity to these family dynamics, both white and Ojibwe, which you don’t find in every author’s work."}, {"userName": "Suzy", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/6942006-suzy", "userReview": "A powerful story about Ojibwe culture, both modern and historical, told through the lens of two neighboring families living through the aftermath of tragedy. The accidental killing of the child of one of these families by the husband in the other triggers the best and worst of human nature - grief, compassion, blame, anger, revenge, caring, faith, betrayal, addiction/recovery, hope for the future. The people who populate this book wrestle with the darkness, hoping to create a space for the light to enter. Filled with memorable characters, past and present, LaRose is well-deserving of National Book Critics Circle Award for Fiction (2016). This may have supplanted Lincoln in the Bardo as my favorite book read so far this year! This is the third audiobook in a row for me narrated by the author. I am skeptical when I see that an author is narrating their own work, but Erdrich brought her story to life with warmth, humor and emotion. Both the book and Erdrich's narration hit all the right notes for me. Bravo!!LaRose was the June selection of our local art museum, Minneapolis Institute of Art, for their Inspired by Books program. Given they have one of the most extensive Native American collections - both contemporary and historical - the tour gave us a lot to see and talk about as we explored both the art and the book."}, {"userName": "Jan Rice", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/5864678-jan-rice", "userReview": "At the very beginning of this book--so no spoiler--Landreaux Iron shoots his best friend's son, also the best friend of his son, in what is incontrovertibly a tragic hunting accident. About the accident aspect there is never any doubt, but nevertheless innocent blood has been spilled. What is atonement in this context? Under such circumstances, how could the torn fabric of community life, love and friendship be repaired?Landreaux and his wife Emmaline turn for answers to \"the old ways\" of their Native American culture. They give their son, LaRose, to the bereaved family in substitution for Dusty Ravich, the boy who has been killed.Even so, we soon find out how precarious is the veneer of civilized morality when brought up against a \"negative black swan\"--an unlikely event but one which has horribly occurred. The churning id inside doesn't give a flip for designations such as \"accident.\" We find ourselves in danger of falling, falling, down the rabbit hole of our prehistoric emotional infrastructure, into a time before cities of refuge, before justice is taken out of the hands of the shocked and grief-stricken kin and put progressively into less-interested hands, into a place where there is only the gaping absence where once was a living, breathing little boy and the pressure toward some instantaneous remedy.The past isn't dead, either. There was a killing four generations ago that involved LaRose' earliest namesake. Yes, it was in self-defense, or something like it, and that carries no more weight than \"accident\" when it comes to resolution.More recently there's a trickster/troublemaker character named Romeo who holds a grudge (against LaRose' father, Landreaux) from which ripples still emanate. His impact in particular shows how fragile our perception of reality is and how easy to disseminate an alternate reality that assigns blame and justifies violent punishment.What sort of figure is the boy LaRose in this novel? Savior, saint?--yet just a little boy. What is the nature of his beneficial impact on all this mishegas? Within the context of the story, he draws strength from his past, from the spirit world, that much is clear.Somehow he brings about delays, slight breaks in the action just long enough for the vision to clear and the world to right itself, so that the course of history turns down one fork and not the other.What if there had been such a time-out when that other Romeo, the Romeo of \"Romeo and Juliet,\" found Juliet apparently dead?Although I've associated LaRose with lucky delays in the action, the story itself never slows down. Louise Erdrich is basically a storyteller. She reads the audio version herself and reads it perfectly, seemingly giving every word the exact tone and emphasis that she as author intended. Listening to her heightened the experience.----------------------------------------------Finally, Louise Erdrich makes us see the unexpurgated nature of the past when it comes to the treatment of Native Americans. L. Frank Baum (1856-1919), the author of The Wizard of Oz books, advocated that Indians, having been vanquished in America, be exterminated. He did not think they could be civilized, and perhaps he also was thinking the spirit of revenge would inhabit their sons. From that view, the novel points out, forcing Indian children into boarding schools where they were divested of their language and ways was at least proof that they could be \"humanized\" and didn't need to be killed. This was not in some faraway time in the 17th or 18th century but in the 1890s.This was a time before the word genocide had entered the English language. This was the language of conquest. You lost, your gods had lost, and to the victor went the spoils. L. Frank Baum may not have been particularly unusual in his views. In the prior century, Benjamin Franklin (1706-1790), whose autobiography sounds relatively progressive, opined that alcohol might be God's way of clearing away the natives in favor of those who could cultivate the land. (And as late as the eve of the Great War, the leading lights of Europe thought of war as a way to clear away cultural malaise.) Worse than Go Set a Watchman! There are ongoing performances of both The Wizard of Oz and The Wiz in the metro Atlanta area at present. I'm for less blindness toward the past, not censorship in the present; thanks to Louise Erdrich for opening eyes.http://www.npr.org/sections/thetwo-wa..."}, {"userName": "Stacey", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/399175-stacey", "userReview": "3.5 Louise Erdrich is a great storyteller and her writing is masterful. This is about LaRose whose life was changed forever after a fatal accident involving his father and a close family friend. It's part of Ojibwe beliefs that the honorable thing to do is to give LaRose to this grieving family to raise as their own. We are taken on a journey as LaRose adapts to his new life and family. This is a story about justice, forgiveness, and family.I have come to expect certain things when I'm reading Erdrich. An entertaining story, the Ojibwe tribe and ,of course, vivid characters. I like when I can take away something new after reading a novel.Lol moment: New priest comes to the church and introduces himself as Dick Bohner. Fr. Travis says, \"Hmm, you might want to go by Richard.\""}, {"userName": "Kasia", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/8024272-kasia", "userReview": "I'm very impressed with Louise Erdrich writing. I was my first book written by her but surly not the last one. This book surrounded me with sadness like a dark fog. Erdrich kidnapped my spirit, placed it in the middle of a family tragedy and made me watch how people I care about dealt with basic human emotions: depression, rage, betrayal, broken vows, suicide attempt. It was all there. I saw it. At some point I had to ask myself: What would I do/ How would I feel if my little son, my baby was accidentally killed by my best friend? P.S. My spirit is still missing. Was last seen near an Indian Reservation in North Dakota talking to newly appointed priest Father Dick Booner. (!)"}], "description": "In this literary masterwork, Louise Erdrich, the bestselling author of the National Book Award-winning The Round House and the Pulitzer Prize nominee The Plague of Doves wields her breathtaking narrative magic in an emotionally haunting contemporary tale of a tragic accident, a demand for justice, and a profound act of atonement with ancient roots in Native American culture.North Dakota, late summer, 1999. Landreaux Iron stalks a deer along the edge of the property bordering his own. He shoots with easy confidence—but when the buck springs away, Landreaux realizes he’s hit something else, a blur he saw as he squeezed the trigger. When he staggers closer, he realizes he has killed his neighbor’s five-year-old son, Dusty Ravich.The youngest child of his friend and neighbor, Peter Ravich, Dusty was best friends with Landreaux’s five-year-old son, LaRose. The two families have always been close, sharing food, clothing, and rides into town; their children played together despite going to different schools; and Landreaux’s wife, Emmaline, is half sister to Dusty’s mother, Nola. Horrified at what he’s done, the recovered alcoholic turns to an Ojibwe tribe tradition—the sweat lodge—for guidance, and finds a way forward. Following an ancient means of retribution, he and Emmaline will give LaRose to the grieving Peter and Nola. “Our son will be your son now,” they tell them.LaRose is quickly absorbed into his new family. Plagued by thoughts of suicide, Nola dotes on him, keeping her darkness at bay. His fierce, rebellious new “sister,” Maggie, welcomes him as a coconspirator who can ease her volatile mother’s terrifying moods. Gradually he’s allowed shared visits with his birth family, whose sorrow mirrors the Raviches’ own. As the years pass, LaRose becomes the linchpin linking the Irons and the Raviches, and eventually their mutual pain begins to heal.But when a vengeful man with a long-standing grudge against Landreaux begins raising trouble, hurling accusations of a cover-up the day Dusty died, he threatens the tenuous peace that has kept these two fragile families whole.Inspiring and affecting, LaRose is a powerful exploration of loss, justice, and the reparation of the human heart, and an unforgettable, dazzling tour de force from one of America’s most distinguished literary masters.", "title": "LaRose", "url": "https://www.goodreads.com/book/show/26116430.LaRose", "average": 3.87, "cover": "https://images.gr-assets.com/books/1445606455l/26116430.jpg", "reviews": 2276, "authors": [{"url": "https://www.goodreads.com/author/show/9388.Louise_Erdrich", "name": "Louise Erdrich"}], "type": ["Fiction", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/26116430-larose", "http://www.goodreads.com/book/show/27868341-larose", "http://www.goodreads.com/book/show/26115756-larose", "http://www.goodreads.com/book/show/27064467-larose", "http://www.goodreads.com/book/show/13602426-the-round-house", "http://www.goodreads.com/book/show/142900.The_Master_Butchers_Singing_Club", "http://www.goodreads.com/book/show/91440.Love_Medicine", "http://www.goodreads.com/book/show/91439.The_Beet_Queen", "http://www.goodreads.com/book/show/2227528.The_Plague_of_Doves", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}