{"ratings": 503, "userreviews": [{"userName": "María", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/40487492-mar-a", "userReview": "En realidad 2,5 estrellas.Era una novella sobre la que tenía muchas expectativas y bueno, no ha resultado tan entretenida como esperaba. Se desarrolla en el París de los años 20 y en el Madrid de la postguerra, ha sido bonito leer lo cotidiano y costumbrista de la gente de esas dos ciudades y esos dos tiempos pero me ha fallado el final y bueno, algunos personajes no se han comportado de una manera que hile bien la historia. La autora describe con detalles situaciones insulsas y luego sucesos importantes en la vida de los personajes los menciona en dos líneas, así sin más, sin explicaciones. Es una novela tranquila y acogedora para leer en las tardes de otoño pero no esperes más que conocer a personajes interesantes en épocas memorables."}, {"userName": "Maria Carmo", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/3054983-maria-carmo", "userReview": "This is a wonderful book by an Author which I did not know until I bought this book! Now I really would LOVE to get all her other books, because she writes amazingly well and the historic side of her romance also appealed a lot to me. I do not like to give out spoilers, so I will just mention that through this book we have a privileged view of Europe's first half of the twentieth century, from the first world war to the civil war in Spain and a brief passage through world war two, until the \"current\" time of the book's main characters, in the early fifties in Franc's Spain. Beautiful, historical, poetical, with larger than life characters and no excess of easiness but rather a serious, albeit touching book.Maria Carmo,Lisbon, 4 April 2015."}, {"userName": "Alex", "userReviewDate": "Feb 06, 2015", "userURL": "http://www.goodreads.com/user/show/10087990-alex", "userReview": "Si spazzano i cocci del cuore.Con cura si ripone l'amoreChe non vorremmo più usareSino all'eternità.Immagino che tu li senta, vero?Anch'io, come te, tutti i giorni.La busta che lo contiene recita: Delicato, appassionate, sorprendente. Ed io non potrei essere più d'accordo.Questo libro è stato uno dei tantissimi segni d'affetto della mia Pam, uno di quelli che lei sceglie con cura, sperando che possa appassionarmi e sorprendermi con la sua delicatezza.\"La vita quando era nostra\"da questo momento è il nostro libro, perché l'autrice con estrema cura ha messo nero su bianco l'immenso valore che un'amicizia può avere per due persone.Intendo quella vera. L'amicizia che riverbera nel cuore e si dipana nell'anima, quella che ti fa sentire protetta e preziosa, messaggera silenziosa di un sentimento nato a distanza ma potente e vero come soltanto il tempo potrà testimoniare.Questa è una storia dentro la storia, la guerra che, involontaria e crudele protagonista, travolge e stravolge la vita di queste due donne. Unico collante \"la lettura\", vista come un ancora di salvezza... Raccontata come fosse una potentissima cura per alleviare la solitudine, la tristezza, la perdita e la rinascita.Rose e Lola, come Alex e Pam, come due sconosciute che per un libro si ritrovano a condividere la loro quotidianità, impegni, sogni, problemi... vita.Il conforto che nasce dalla complicità, l'affetto che cresce con spontaneità e senza forzature, nutrito dal bisogno di stare insieme e condividere quello che l'altro chiede.Una storia sorprendente, potente e insieme delicata e malinconica. Carica di ricordi e di aspettative, avvolta da delusioni ed errori, impregnata di amore ed amicizia.Uno stile fluido sebbene raccontato con estrema cura e lentezza voluta, un ricordo nel ricordo. Una vita che si mette in parallelo con quella di un'altra donna, come a volerle dare un monito su cui riflettere... Per lasciarle qualcosa di profondamente personale e vero: l'esperienza.La potenza di una narrazione che racconta una storia alla terza persona, per poi mettere a fuoco ogni personaggio attraverso il personale punto di vista; rendendo in questo modo i personaggi più intensi e ricchi dì sfumature caratteriali.I versi e le parole dei grandi autori del 900 mescolati alla musica di Debussy, danno vita ad una colonna sonora fatta di musica e poesia. Una donna straordinaria, Rose, che incontra uno spirito libero e battagliero come Lola. Altruismo.Un cuore immenso.La bontà che oramai non ti aspetti ti trovare...E... L'amicizia come dovrebbe sempre essere: vera, spontanea e completamente disinteressata!Grazie mia Pam.Un milione di volte grazie ❤️"}, {"userName": "Luchi Rzezak", "userReviewDate": "Oct 04, 2013", "userURL": "http://www.goodreads.com/user/show/19855889-luchi-rzezak", "userReview": "Terminé de leer esta historia y me pasó algo extraño, me trasmitía serenidad. Calma. Tranquilidad. Como quien hizo lo que quiso y debía en su vida y ahora esta en paz. Es una historia de como gracias a un libro se entrelazan a través del azar las vidas de dos mujeres y como la experiencia de una ayudará a la otra a seguir luchando. De fácil lectura y lleno de referencias a los libros, me sentía \"fizgoneando\" en la vida de Rosa, junto a Lola. Me gustó el poder acercarme a esa época desde una forma narrativa diferente. Quiero agregar que me encantó el título “Que echo en falta LA VIDA CUANDO ERA NUESTRA”. Puesto que es fiel a la obra. Ambas mujeres tenian una estabilidad que ven perdida por las guerras, la muerte pero aun así no es desolador el mensaje sino que refleja cómo los libros unen a las personas mas allá de la edad y las experiencias vividas alimentan esa unión. Y esto es lo que vivimos en mi club de lectura. Y repito un consejo que le dan a Rose y es que \"lee, lee siempre que puedas. Eso te salvará...\""}, {"userName": "Yoly Hernández Crego", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/23101379-yoly-hern-ndez-crego", "userReview": "Una delicia de lectura \"La vida cuando era nuestra\" de Marian Izaguirre. Ha sido un gran descubrimiento para mi. Ha sido como leer un libro dentro de otro, me ha dejado una sensación increíble, además da la casualidad que como soy muy dada a leer varios libros a la vez el día anterior a comenzar con este libro le tomé prestado a mi padre uno en papel para leer en la piscina \"Nada\" de Carmen Laforet, y cual fue mi sorpresa que al comenzar a leer al día siguiente \"La vida cuando era nuestra\" en sus primeras páginas hace referencia a \"Nada\" y a su autora, me quedé con la boca abierta de asombro hasta el final de la novela. Es una novela muy recomendable para lectores empedernidos y para los que están empezando ya que anima mucho a la lectura."}, {"userName": "Estefânia Botelho", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/1833984-estef-nia-botelho", "userReview": "personagens que deixam saudade"}, {"userName": "Kasiek", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/7475266-kasiek", "userReview": "http://kasiek-mysli.blogspot.com/2017..."}, {"userName": "Vanda", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/22455710-vanda", "userReview": "Četba románu „Když život ještě býval náš“ byl pěkný zážitek, moc mě to bavilo. Sice bych uvítala, kdyby kniha víc ťala do živého, víc se mi zasekla do masa, ale i tak jsem se na její čtení každý den těšila, líbilo se mi, jak autorka do textu všelijak nastražila takové ty všem důvěrně známé životní momenty a drobnosti, které z příběhu činily něco blízkého a přátelského. Jinak samotné vyprávění má dvě linie – v první řadě příběh tak trochu tajemné cizinky Alice, která žije ve Španělsku a spřátelí se s Lolou, ženou knihkupce v poválečném Madridu. Matías býval nakladatel, ale v současném frankistickém režimu je jeho život výrazně odlišný a Matías i jeho žena jsou stávající situací země hluboce znechuceni. Druhou linií je kniha “Dívka s vlasy jako len”, kterou spolu obě ženy čtou. Jsou to vlastně memoáry Rose Tomlinové, Angličanky, která vyrůstala ve Francii, a zachycují období mezi dvěma světovými válkami. Nestává se mi to příliš často, ale tentokrát jsem opravdu neměla žádného favorita, příběhy se mi líbily oba rovným dílem a přišlo mi fajn, jak se obě linie postupně překrývaly a splývaly. Izaguirre báječně zachycuje atmosféru doby, ať již píše o první světové válce či o Rosině dospívání v Paříži, kde se setkává s řadou vynikajících osobností, nezřídka z řad amerických umělců. Díky vyprávění o Alici a Lole a Matíasovi jsem zase vážně dostala chuť si něco přečíst o životě ve Španělsku za Frankovy diktatury. Jsem spokojená ve všech směrech, bylo to fajn :)"}, {"userName": "Simge", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/42300494-simge", "userReview": "Kitap içinde kitap okuma zevki...Sayfalar arasında tanıdık kitaplarla karşılaşma mutluluğu...Farklı hayatları birleştiren sıcak bir kitapçı dükkanı...Mutluluk, özlem, hüzün, hayal kırıklıkları...Kısacası yaşam ve ölüme dair ne varsa...En önemlisi de okunan bir kitabın bazen sadece kurgudan ibaret değil de daima hatırlanmak istenecek yaşanmışlıkları barındırabilme ihtimalinin olmasının okuyucuya hatırlatılması...En sevdiklerimden biri olması için bir kitabın başka ne vermesi gerekirdi ki acaba bana?! Bu kitap için teşekkürler Marian Izaguirre. Çok teşekkürler..."}, {"userName": "Encarni Prados", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/65764694-encarni-prados", "userReview": "Ha sido un libro de los que dejan huella, de los que terminas y necesitas digerirlos, con personajes especiales que te marcan por su historia y por sus hechos; ha sido fascinante, por ahora, lo mejor que he leído de esta autora. Las historias están muy bien llevadas y escritas con mucho gusto."}, {"userName": "Ana", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/50899005-ana", "userReview": "A vida quando era nossa é uma obra que nos toca, que nos fala daquela maneira intensa ao coração. A sua história está escrita de uma forma serena, tranquila, mas possui os ingredientes necessários para ser um bálsamo para a alma e para mexer connosco. É certo que toca de uma forma mais veemente a quem é amante das leituras (tropeçamos frequentemente em referências a autores clássicos como Emily Brontë, Emily Dickinson, Joseph Conrad, James Joyce e muitos mais ou ainda em fragmentos de obras ou poemas), mas ninguém conseguirá ficar indiferente às personalidades cativantes dos três protagonistas, às descrições de épocas tão marcantes como os “loucos anos 20” ou a guerra civil espanhola e posteriores anos e à mensagem intrínseca que retiramos de tudo o que lemos até que fechamos a obra – por muito que a realidade seja adversa, por muito que já tenhamos sofrido, não nos podemos render. Temos que, como dizem os espanhóis, “seguir adelante”, apoiar-nos naqueles que estão ao nosso lado, não deixar de lutar por aquilo em que acreditamos e continuar a usufruir da companhia imprescindível dos livros. Porque eles podem salvar-nos!Recomendo assim que leiam esta obra preciosa, que se deixem cativar por ela, porque seguramente não se arrependerão :)NOTA – 09/10Opinião completa em:http://osabordosmeuslivros.blogspot.p..."}, {"userName": "Veerle", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/44063186-veerle", "userReview": "Bij toeval gevonden in de bib. Mooi!"}, {"userName": "Mauro Garcia", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/67436276-mauro-garcia", "userReview": "Terminada, le daria 3,5 si fuera posible. Esta fue mi novela de verano, y como tal cumple a la perfeccion lo que uno espera de una novela de verano, lectura sencilla pero entretenida, sin mayores paradigmas o escritura pretenciosa o filosofica por parte de la autora. Recomendado si buscas algo con que entretenerte sin quebrantos de cabeza, mas no puedo decir."}, {"userName": "Adriaan Jansen", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/13590351-adriaan-jansen", "userReview": "Marian Izaguirre abusa y exagera un poco con el uso de los 3 puntos ... en esta novela. Puede parecer un detalle sin envergadura, pero no lo es: los ... para indicar alguna insinuación aparecen tantas veces que casi llega a ser irritante.''La vida cuando era nuestra'' describe 3 épocas de la primera mitad del siglo 20: las décadas 10 y 20 en Francia e Inglaterra, la guerra civil española (1936 – 1939) y el año 1951 en Madrid. Izaguirre cuenta la historia en una manera muy hábil: Una señora inglesa y la esposa de un librero, principales personajes de 1951, leen un libro, unas memorias de una señora de la alta sociedad inglesa acerca de su infancia y vida de adulta joven antes, durante y después de la primera guerra mundial. La guerra civil española se mezcla con los acontecimientos de esas dos épocas mediante flash-backs y flash-forwards. Ademas, el punto de vista cambia de la primera persona (la persona que escribe sus memorias del principio de siglo 20 y la señora inglesa en 1951) a la tercera persona. Todo esto le da a la autora una flexibilidad agradable para combinar tiempos y acontecimientos. Las memorias de la señora inglesa acerca de su infancia y sus días como adulta joven en París son mas bien un diario privado que algo que se puede publicar con objetivos comerciales. Sin embargo, en ''La vida cuando era nuestra'' efectivamente se publicaron esas memorias. Este hecho deja una duda sobre esta novela: ¿Marian Izaguirre se propuso escribir un diario sencillo sin gran valor literario o realmente pensaba estar escribiendo unas memorias para la señora inglesa que en la vida real valen la pena publicar?La fuerza de esta novela está en esa flexibilidad antes mencionada, en la simpatía de los personajes principales y en algunos toques históricos. Por ejemplo, en la década 20, las señoras de la alta sociedad solían poner guantes para evitar broncearse: manos blancos, mejor dicho en general piel blanca, era algo deseable. Un recordatorio que las costumbres han cambiado, uno de los detalles bonitos de este libro."}, {"userName": "Seher Andaç", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/32180470-seher-anda", "userReview": "Yaşadığımız hayat ne Zaman bize aittir?\"Barış değildi kutladığımız, savaşın yokluğuydu. \"Kitabın hem çok güzel hem de davetkar ismine rağmen benim için etkileyici cümle bu oldu. İnsan her yeni güne uyanabildiğinde ve gece olup başını yastığa koyabildiğinde bunun için şükretmeliymiş: Savaş bana dokunmadı. Dünya tarihinde hakim hava şairin bir dizesinde saklıymış: Hava kurşun gibi ağır... İspanya'nın karanlık günlerini \"kitap aşkı\" ile aydınlatmaya çalışan Rose, Lola ve Mathias'ın hikayesi \" Bir Zamanlar Hayat Bizimdi\". Yazar Marian İzaguirre kitaplara olan sevgisini bu kitapla anlatmış. Kurgu, insanlığın ortak acısının, savaşın, faşizmin karanlığına kurulmuş. Aynı dertten muzdarip bir okurum. Yaşadığım dünya yıkıcı! Ben de kitaplara sığınıyorum. Yaşamı kutsuyorum! Şunu çok iyi biliyorum ki varlığımı ancak yaşam değerli kılabilir. Şair dizesinin devamında kurşunu eritmeye davet eder... Daveti ben kabul ediyorum. Erittiğim kurşundan tekrar kurşun yapmayacağım. Sözümdür!Bir zamanlar değil her zaman yaşam bize aittir ve sonsuz saygıyı hakeder! ....Kitap nasıl diye sorana cevabım kitabın tanıtım yazısından olacaktır:\"Gerçekliğin kırılganlığına, savaşların yıkıcılığına karşı insana dair beslenen umuda, insanın yaşlansa da hala sevgiye ihtiyaç duymasına, kısacası naif bir şekilde hayatın bizim olduğu zamanlara dem vuruyor\". ...Yaşamın bize ait olduğu gerçekliğini yıkan faşizme inat insanlığın ortak belleği,hafızamız yaşamı bize vaad eder! Bu yüzden okumak, anlatmak, dinlemek çok kıymetli....Özlemek, yaşanılanı yad etmek değil sadece yaşamak, hayatta kalmak!Mathias, Lola ve Rose'un yaptığı gibi!"}, {"userName": "Frank Becker", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/22538254-frank-becker", "userReview": "Mit dem Buch bin ich nicht so richtig glücklich: Es gibt mehrere Haupterzählstränge; grundsätzlich schön, aber man versteht nicht so recht warum man das alles wissen soll. Am Anfang des Buches sind die Erinnerungen recht ausführlich - zum Ende hin werden sie aber immer mehr gerafft; das wirkt ein bisschen wie keine-Lust-mehr-und-muss-fertig-werden. Man lernt alle möglichen Leute besser Kennen als DEN Henry; und warum der sich in Spanien freiwillig meldet wird nicht so recht klar (jaja, \"für etwas woran er glaubt\"... das ist aber von dem was wir von Ihm Wissen keineswegs verständlich).Die melancholische Stimmung des Buches ist gut - wird aber durch die Erzählstrangwechsel immer mal wieder zerrissen; es gibt etliche unnötig Details (Stichwort: die Frau die Thérèse [oder so] heißen könnte...).Eher 'was für Frauen.Vergleichbar mit Zafon (wie das Rückencover behauptet)? Nein.PS: Das Coverbild passt auch nicht - aber ok: Mit einer rothaarigen Jungen verkauft es sich natürlich besser als mit einer weißhaarigen Alten... ;-)"}, {"userName": "Argos", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/16156347-argos", "userReview": "Yeni bir İspanyol yazar tanımak güzel. Kitabın çok iyi bir dili var, kurgu biraz abartılı gibi ancak İspanya da bizim gibi Akdeniz ülkesi olduğundan duygusallık çıtası çok da yadırgatıcı değil. Sürükleyici, sürprizlerle dolu, aşk hikayesi içinde savaşın yıkıcılığı tezini ustaca ören yazar iyi bir roman çıkarmış, öneriririm."}, {"userName": "Renard Books", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/24383449-renard-books", "userReview": "Fue un libro que me mantuvo entretenida, debo reconocerlo. Al menos aburrido no es. Sin embargo, me vuelve a decepcionar otro autor español. Izaguirre resulta ser en esta novela una autora pretenciosa que ha integrado a su libro, de manera poco original, miles de escritores de primera mitad del siglo XX, como personajes amigos de la protagonista Alice, para quien no sentí ninguna empatía. Es una \"heroína\" a quien no le creo nada. Al estilo \"sufrí mucho, pero de alguna manera viví una vida de película de Hollywood. Fui una bastarda de un personaje muy importante a nivel diplomático y mi madre era una mujer que sin ser intelectual se rodeaba con todos los intelectuales de la época (a sabiendas de que este grupo fue una élite cerrada).\" Y por ello no me parece real. Algunos personajes están de más. El policía (quien resultó no serlo en verdad) pudo haber sido removido de la historia y nunca habría hecho falta. Es una historia poco original o al menos la narración lo es.Por último, es un tanto arrogante crear un personaje extranjero que asegure que cualquier país es \"el mejor del mundo\". Considero necesario bajar un poco el ser parcial cuando se hace literatura."}, {"userName": "Je me livre", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/41176270-je-me-livre", "userReview": "Une lecture plus qu'agréable même si difficile, une ambiance qui nous plonge dans l'Espagne franquiste ainsi que dans la France et l'Angleterre pré et post Première guerre mondiale. Ce roman d'une auteur espagnole est une petite perle littéraire en ce qu'il nous rappelle que la paix et le sentiment de sécurité ne sont jamais acquis. L'amour et le besoin irrépressible de le vivre et de le dire sont aussi célébrés. Seul bémol à mon goût : La vie quand elle était à nous manque d'une chute surprenante, qui nous ferait reconsidérer tout le livre autrement. Néanmoins c'est un moment mémorable que j'aurai passé dans ses pages."}, {"userName": "Els", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/69250457-els", "userReview": "Een fijne roman om te lezen met een happy end en daar houd ik van. Ik vond het soms wel lastig om alle personages uit elkaar te houden, daarnaast worden ook enorm veel schrijvers en dichters genoemd die soms alleen met een citaat of een boektitel werden genoemd en soms ook een rol speelden in het verhaal. Uiteindelijk maakte het voor de rode draad van het verhaal niet zoveel uit, dus ik heb het maar geaccepteerd dat ik soms niet meer goed wist wie die persoon nu was. De titel vind ik in elk geval prachtig gekozen. In onze jeugd denken we allemaal dat het leven van ons is en met het ouder worden, wordt het meer en meer beleefd."}, {"userName": "Mariposa", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/64175378-mariposa", "userReview": "Deux destins qui se croisent. Celui de Lola, dont les espoirs et les rêves sont morts avec la fin de la Guerre Civile et celui d'Alice/Rose.L'auteur nous balade entre des flashbacks dans la vie de Rose, qui sont en fait des chapitres d'un livre \"La jeune fille aux cheveux de lin\", et la vie actuelle de Rose à Madrid ainsi que de sa rencontre avec Lola et Matias.Outre ses personnages et le côté historique de ce roman, on y retrouve l'amour des livres et de la lecture. Très vite, jee me suis laissée toucher et emporter par l'histoire de ces trois personnages attachants et j'ai pris beaucoup de plaisir à cette lecture, que je vous conseille donc."}, {"userName": "Martina Amato", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/69573356-martina-amato", "userReview": "Con semplice maestria Marian Izaguirre riesce a farti entrare nella vita dei personaggi lasciandoti cadere una lacrime nelle ultime pagine.Il modo con cui li presenta e vengono descritti me li hanno fatto adorare. la saggezza della protagonista e la sua vita sono stati raccontati in un modo che ho davvero adorato. Mi sono sentita nel libro. Questo libro riesce a prenderti ."}, {"userName": "Celeste", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/7182239-celeste", "userReview": "No fue lo que yo esperaba. Me prestaron este libro y me resulto tedioso. No me llegaron los personajes si no lo que en algún momento decían o pensaban. Me resulto muy confuso ubicarme en tiempo y lugar y recordar quien era quien. En conclusión, hubo cosas rescatables, pero fueron muy pocas. No fue el libro mas indicado para mi lamento decir."}, {"userName": "Florencia", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/14513163-florencia", "userReview": "Un libro precioso lleno de personajes entrañables a los que no querés soltar cuando terminas de leer."}, {"userName": "Connie Camacho", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/76358496-connie-camacho", "userReview": "El tiempo cuando era nuestro It is slow pace not engaging book. I could easily put this book down and forgot about it. I liked that it quotes the names of other good books to read."}, {"userName": "Sarah", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/50984542-sarah", "userReview": "Bezaubernd, gleichzeitig sehr chaotisch und schwer zu folgen. Geschichten, die getrennt von einander sind und dann wiederum eine."}, {"userName": "Vasileios", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/6723948-vasileios", "userReview": "http://www.dreamersandco.com/2013/10/...Είναι μόλις λίγες ώρες που τελείωσα το βιβλίο «La vida cuando era nuestra» της Marian Izaguire και μπορώ να πω ότι είναι από τα πιο ωραία βιβλία που διάβασα τελευταία, τόσο που είμαι έτοιμος να το ξαναδιαβάσω αμέσως!Το βιβλίο είναι πολύ «φρέσκο», μόλις λίγους μήνες πριν κυκλοφόρησε στην Ισπανία προκαλώντας ιδιαίτερα το ενδιαφέρον του λογοτεχνικού κοινού αλλά επίσης και πολλών εκδοτών του εξωτερικού. Αρκετοί ήταν αυτοί που αγόρασαν τα δικαιώματα πριν καν βγει στην ισπανική αγορά. Νομίζω πως δεν θα αργήσουμε να το δούμε και στην Ελλάδα καθώς έχει αρχίσει να εξαπλώνεται η φήμη του...Ο εκδότης του πρωτοτύπου, η ιδιαίτερα αγαπημένη Lumen (Random House Mondadori) έκανε πολύ καλή δουλειά στη προώθησή του με έναν τίτλο που του ταιριάζει απόλυτα: «La vida cuando era nuestra / Η ζωή όταν ήταν δικιά μας» ενώ επίσης φρόντισε ιδιαίτερα και το εξώφυλλο που αντικατοπτρίζει τη κεντρική ιδέα του βιβλίου. Το οποίο κυκλοφόρησε επίσης συνοδευόμενο από το εξής blurb: «Μια μέρα χωρίς διάβασμα είναι μια μέρα χαμένη». Το γιατί ταιριάζει τόσο θα το καταλάβετε πιο κάτω.Αυτό που κάνει τον τίτλο ιδανικό είναι ότι αν και το βιβλίο έχει ως φόντο τον ισπανικό εμφύλιο και άρα θα μπορούσε να αποδοθεί κάτι σκοτεινό, ο συγκεκριμένες δείχνει νομίζω την ανάγκη και την επιθυμία για επιβίωση.Η αφήγηση μας παρουσιάζει τις ζωές δύο γυναικών που έχουν παρόμοιες ιστορίες και που θα τις φέρει κοντά ένα βιβλίο. Η εμπειρία της μιας θα βοηθήσει την άλλη να συνεχίσει να αγωνίζεται χωρίς να χάνει το κουράγιο της.Ένα παράνομο ζευγάρι (γιατί δεν παντρεύτηκε στην εκκλησία) τη δεκαετία του 50, έχει ένα μικρό βιβλιοπωλείο στη Μαδρίτη σε ένα επίσης μικρό δρομάκι που δεν έχει και πολύ κίνηση, μόλις που βγάζει τα προς το ζην. Είναι ο Matias και η Lola και παρ' όλη τη δύσκολη κατάστασή τους παραμένουν άνθρωποι θετικοί και αισιόδοξοι. Η Lola νοσταλγεί τα χρόνια πριν το 1936, τότε που γνωρίστηκε με τον Matias, όταν δουλεύανε μαζί και απολάμβαναν τον καφέ τους, τις μικρές «αποδράσεις» και πιο πολύ απ' όλα όταν ονειρεύονταν για μια Ισπανία καλύτερη, πιο δίκαιη... Τώρα δεν μένει τίποτα από τα όνειρα που έκαναν, ζουν χωρίς την ελευθερία τους, αν και δεν είναι στη φυλακή η κατάσταση που τους περιβάλλει τους πνίγει.Μια μέρα λοιπόν, θα βρεθεί στον δρόμο τους η Alice, μια 51χρονη γυναίκα με βρετανικές ρίζες η οποία ζει μόνη της καθώς ο μεγάλος έρωτας της ζωής της, Henry έφυγε από τη ζωή. Στο βιβλιοπωλείο τους θα αφήσει επίτηδες ένα βιβλίο που θα διαβάσει ο Matias και θα αποφασίσει να το βάλει ανοιχτό στη βιτρίνα με την ιδέα ότι κάθε μέρα θα γυρίζει τις σελίδες του έτσι ώστε να μπορούν να το διαβάσουν οι περαστικοί. Πόσα και πόσα ήταν τα παιδιά που δεν μπορούσαν να αγοράσουν ένα βιβλίο αλλά «διψούσαν» για μια νέα ιστορία που θα τους έβγαζε από τη δύσκολη καθημερινότητα της εποχής.Η Alice θα επιστρέψει στο βιβλιοπωλείο και θα ζητήσει από τη Lola να το διαβάσουν μαζί...και κάπως έτσι θα ξεκινήσει και η δεύτερη ιστορία του βιβλίου... μια ιστορία για τη μοναξιά, για τις ρίζες αλλά και τη φιλία. Θα μοιραστούν την ιστορία μεταξύ τους και φυσικά μαζί μας.Χάρη στην ιστορία αυτή θα ταξιδέψουμε στα τέλη του 19ου αιώνα στο Λονδίνο και στο Παρίσι όπου η πρωταγωνίστριά του, Rose μας κάνει συνένοχους σε ότι ιδιαίτερο έχει ζήσει εκεί μέσα από τις σελίδες του βιβλίου «Το κορίτσι με τα ανοιχτόχρωμα μαλλιά». Η ζωή της όμως δεν είναι καθόλου εύκολη. Μεγαλώνει χωρίς γονείς και χωρίς οικογένεια και τα βιβλία θα είναι γι' αυτή η μοναδική συντροφιά. Την ακολουθούμε καθώς μεγαλώνει μεγαλώνουμε μαζί της, αγωνιζόμαστε μαζί της και κυρίως διαβάζουμε μαζί της. Κάποτε της είχαν πει: «Διάβασε, διάβασε όποτε μπορείς, αυτό θα σε σώσει». Και αυτή είναι η τρίτη ιστορία του βιβλίου που μπλέκεται μαζί με τις άλλες δύο. Είναι θα λέγαμε ένα βιβλίο μέσα στο βιβλίο. Η Marian Izaguire έκανε κάτι πολύ έξυπνο και φιλόδοξο με τον τρόπο που έγραψε αυτό το βιβλίο. Ιστορίες ανθρώπων σε διαφορετικούς χρόνους και τόπους βρίσκουν έναν κοινό παρανομαστή: τις ισορροπίες μετά από μια απώλεια όποια και αν είναι αυτή καθώς και την αγάπη για το διάβασμα.Παράλληλα μαθαίνουμε για τη ζωή της Alice, το πόσο δύσκολα και μοναχικά είχε περάσει όλα αυτά τα χρόνια και πως το κουράγιο και τη συντροφιά της την είχαν χαρίσει τα βιβλία που διάβαζε. Ενώ πλέον είναι ενθουσιασμένη που γνώρισε το ζευγάρι του αγαπημένου της βιβλιοπωλείου και περνάει χρόνο μαζί τους αλλά ταυτόχρονα δουλεύει και εκεί.Το να σκεφτείς μια τέτοια πολύπλοκη ιστορία θα λέγαμε πως είναι πολύ δύσκολο αλλά ακόμη δυσκολότερο να την αποδόσεις σωστά. Η Marian Izaguire όμως το έχει καταφέρει. Δεν θα αργήσουμε να το διαβάσουμε και στα ελληνικά (ελπίζω!).Α, Θυμηθείτε! «Μια μέρα χωρίς διάβασμα είναι μια μέρα χαμένη»!"}, {"userName": "Drunkenness Books", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/30884798-drunkenness-books", "userReview": "La vie quand elle était à nous est un roman reçu en partenariat avec les éditions Albin Michel. Lorsque j’ai vu le quatrième de couverture, il m’a tout de suite intriguée : un roman parlant de littérature ne pouvait que susciter mon intérêt.Une vieille dame anglaise déambule dans les rues de Madrid et croise sur son chemin un homme tapant aux portes pour livrer des livres. Si celui-ci ne la remarque pas, il n’en est rien pour elle. Intriguée, elle décide de lui emboîter le pas et le suit jusqu’à sa boutique de livres. Là, elle va découvrir un petit lieu de paradis dans cette Espagne tourmentée. C’est là que va naître une amitié incroyable entre Lola et cette dame qui se fait appeler Alice.Marian Izaguirre nous emmène ici dans une Espagne encore tiraillée par la guerre civile. Lola et son mari Mattias peinent à subvenir à leurs besoins. Il faut dire que leur librairie tient lieu de résistance culturelle dans un pays où la dictature règne et les clients se font rares. Dur de s’intéresser à la lecture quand rien ne va plus. Un jour, Mattias décide d’exposer dans la vitrine de sa boutique La fille aux cheveux de lin. Qui sait, peut-être qu’un curieux sera attiré et décidera d’en découvrir plus en s’aventurant dans la boutique ? Lorsque Lola voit entrer dans la petite librairie cette dame qui se fait appeler Alice, elle ne peut s’empêcher de s’interroger sur cette mystérieuse dame.La vie quand elle était à nous, c’est donc l’histoire de Lola et Matias, un couple d’amoureux des livres, dont la vie a été profondément marquée par l’instauration de la dictature de Franco. Empreints de liberté et de tolérance, ils vont voir leurs idéaux bafoués par ce nouveau régime. Et c’est dans les livres qu’ils vont trouver refuge. De l’autre côté, il y a Alice, une anglaise vivant à Madrid elle aussi. Ayant perdu son amour il y a plusieurs années durant le conflit espagnol, cette anglaise a pourtant trouvé là une terre d’accueil dont elle ne souhaite guère repartir. Seule, sa rencontre avec les deux libraires va être l’occasion d’un nouveau départ pour elle.Roman sur l’amitié, sur la nostalgie et sur l’amour, c’est également une mine de références historiques et culturelles. Si la structure peut déconcerter au début, le lecteur s’y habitue rapidement. La fille aux cheveux de lin est un roman dans le roman, ou plutôt, des mémoires dans le roman dont le lecteur fait la découverte en même temps que Lola et Alice. Les chapitres alternent ainsi entre le présent et la lecture de ces pages et petit à petit, nous découvrons la vie de Rose, l’auteur de La fille aux cheveux de lin.Je me suis immédiatement attachée au personnage d’Alice, une vieille dame à l’esprit plein de finesse, j’ai eu un peu plus de mal avec les personnages de Lola et Mattias, un peu plus froids. Pourtant, au fur et à mesure que j’avançais dans ma lecture, je me suis surprise à vouloir en savoir davantage sur eux. À la lumière de leur passé, leur situation et leur comportement actuel apparaissaient beaucoup plus clairement. Toutefois, les personnages que j’ai le plus appréciés sont les protagonistes de La fille aux cheveux de lin. Rose apparaît d’emblée comme une petite fille très attachante. Fille illégitime d’un lord anglais, elle est envoyée en France auprès de différentes familles sans jamais réellement trouver sa place. C’est dans ce pays qu’elle va rencontrer des gens formidables qui finiront peu à peu par constituer sa famille. Personnellement, j’ai eu un véritable coup de cœur pour Frances, cette femme forte et indépendante, pleine d’extravagances qui va accompagner pendant longtemps Rose. Mais je ne vous en dirai pas plus au sujet de ces personnages qui valent la peine d’être découverts.Enfin, l’intérêt de ce roman réside surtout dans les nombreuses références littéraires que l’auteur a disséminées au fil des pages. Mais Marian Izaguirre ne se contente pas de nous donner quelques noms par-ci par-là. Non, bien au contraire ! Elle nous donne réellement envie de découvrir ces auteurs et leurs textes en nous proposant des extraits qui ne peuvent susciter que l’intérêt ! Ainsi, plus j’avançais dans ma lecture, plus ma liste d’auteurs à découvrir se faisait longue.La vie quand elle était à nous est un très beau roman sur l’amitié et l’amour entre les personnes mais c’est également une ode à la littérature qui saura ravir les amoureux des livres.http://drunkennessbooks.blogspot.fr/2..."}, {"userName": "Amanda Em", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/22542645-amanda-em", "userReview": "Rich people and their \"problems\"."}, {"userName": "Mariana", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/69793271-mariana", "userReview": "Hay libros que llegan justo en el momento adecuado. La vida cuando era nuestra es uno de esos. Un gran homenaje a la literatura y los libreros, donde la autora demuestra el valor de aquello cotidiano que sólo valoramos cuando deja de estar ahí.Izaguirre nos presenta a Lola y Alice, dos mujeres unidas por la literatura, que al juntarse se transportan a otros tiempos. Además, se suma Matías, un personaje cansado, que descubre que la literatura puede salvarte la vida. Así, la autora presenta historias de vida, en un ir y venir de personajes sin raíces, familiares ni físicas, en ningún lugar, con un amor desolado, olvidos y recuerdos a cuestas.Crea una línea entre dos personajes, unos perjudicados por las guerras, que se refugian en una librería que les da fuerza y otros, que con un pasado que duele, esperan un cambio por llegar. Se mantienen unidos por los libros, el afecto y el amor, que siempre es el pilar que empuja a todas las fuerzas perdidas.Con La vida cuando era nuestra, Marian Izaguirre nos muestra el sentido de la amistad, de la familia, de la pérdida, la muerte recurrente y del amor por la lectura, eso que nos evade de la rutina y nos lleva a mundos paralelos que dejan de lado todo el sufrimiento de la vida; con una prosa que transmite calma, tranquilidad, serenidad, sobretodo en esos episodios donde las experiencias de ambas chicas ayudan a la otra a seguir luchando, con muchas referencias a otros libros, en busca de esa estabilidad que poco a poco han perdido y que la literatura parece regresarles, unirles, más allá de la edad, la época y vivencias.\"Lee, lee siempre que puedas. Eso te salvará...\"En esa librería humilde, Lola y Matías hacen frente a una época donde la censura reinaba y que llevan dentro de sí el amor por la literatura y por sacar adelante eso que combate lo que todo el mundo intenta callar. Su lucha incansable por seguir promoviendo la lectura a pesar de todo me recuerda mucho a los escritores y editores de mi país, Venezuela, que frente a tantos problemas, inconvenientes y obstáculos, siguen haciendo libros.La vida cuando era nuestra se ganó mi corazón por esa capacidad de recordarnos el valor de los libros en los períodos más amargos. Recordemos que de los hoyos más oscuros y profundos de la literatura universal han salido las obras más reconocidas y características del mundo y eso parece demostrar un libro como este.La amistad entre estas dos mujeres que leen juntas, con historias tan distintas, una que calla y otra que se enfrenta a lo poco que queda y que encuentran en la literatura un nexo en común me encanta, construida a base de escenas cotidianas, que invitan a no rendirnos, con su complicidad que va más allá del papel.Izaguirre confirma eso de que las novelas nunca reflejan quiénes somos, pero sí quién queremos ser. Una novela hermosa, poética, que señala las bondades de la literatura y que incluye a libreros, lectores y escritores a ese ejercicio del conocimiento de uno mismo a través de lo escrito, de lo que nos define y nos hace afines a los demás. Es decir, el hombre que escribe y que lee se unen en busca de una palabra que los “interpele y los proyecte”.Mezcla la Guerra Civil española con los acontecimientos de la mitad del siglo XX y parte del actual, con recuerdos y a modo de flash backs, ligando un narrador en primera persona con uno omnisciente, que le da a la historia un hilo de flexibilidad que combina tiempos y acontecimientos, con personajes sumamente bien construidos y múltiples guiños a la historia de Española y la literatura de la época.En definitiva, un libro precioso que habla de la amistad, del amor y de la vida en general, enmarcado en la Guerra Civil española y todo lo que trajo y que hace un homenaje interesante a los buenos libros y libreros que día a día nos reconfortan. La vida cuando era nuestra es un homenaje a todas esas historias que hacen que nos consideremos amantes de la lectura y que se va directo a mis favoritos de este año.http://mariana-is-reading.blogspot.co..."}], "description": "\"Añoro la vida cuando era nuestra\", comenta Lola mientras trastea en la cocina de su casa. Esa vida, que era tan suya y tan llena de ilusión, antes estaba hecha de libros y de charlas de café, de siestas lánguidas y de proyectos para construir un país, España, que aprendía paso a paso las reglas de la democracia.Pero llegó un día de 1936 en que vivir se convirtió en puro resistir, y ahora, quince años después, de todo aquello solo queda una pequeña tienda, una librería de viejo medio escondida en uno de los viejos barrios de Madrid, donde Lola y Matías, su marido, acuden cada mañana para vender novelitas románticas, clásicos olvidados y lápices de colores a quien se acerque.Es aquí, en ese lugar modesto, donde una tarde de 1951 Lola conocerá a Alice, una mujer que ha encontrado en los libros su razón de vivir. Siguiendo la mirada de Lola y Alice, viéndolas sentadas detrás del pobre mostrador y leyendo juntas el mismo libro, iremos lejos, hasta Inglaterra, y atrás en el tiempo, hacia principios del siglo XX, para conocer a una niña que creció preguntándose quiénes eran sus padres.La vida cuando era nuestra es un homenaje a la lectura, pero es sobre todo la historia de dos mujeres, una que poco sabe de la vida y otra que quizá sabe demasiado, aunque no pueda hablar. Entre estas miradas cómplices anda el talento de Marian Izaguirre.", "title": "La vida cuando era nuestra", "url": "https://www.goodreads.com/book/show/17730046-la-vida-cuando-era-nuestra", "average": 3.85, "cover": "https://images.gr-assets.com/books/1365062951l/17730046.jpg", "reviews": 75, "authors": [{"url": "https://www.goodreads.com/author/show/879442.Marian_Izaguirre", "name": "Marian Izaguirre"}], "type": ["Historical", "Cultural", "Fiction", "European Literature", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/17730046-la-vida-cuando-era-nuestra", "http://www.goodreads.com/book/show/24577783-a-vida-quando-era-nossa", "http://www.goodreads.com/book/show/20550116-la-vita-quando-era-nostra", "http://www.goodreads.com/book/show/22915541-tamte-cudowne-lata", "http://www.goodreads.com/book/show/25833072-kdy-ivot-je-t-b-val-n", "http://www.goodreads.com/book/show/26826901-bir-zamanlar-hayat-bizimdi", "http://www.goodreads.com/book/show/22469446-toen-het-leven-nog-van-ons-was", "http://www.goodreads.com/book/show/28590853-als-die-tr-ume-noch-uns-geh-rten", "http://www.goodreads.com/book/show/35095836-la-vie-quand-elle-tait-nous", "http://www.goodreads.com/book/show/23272935-la-vida-cuando-era-nuestra", "http://www.goodreads.com/book/show/20336506-la-vida-cuando-era-nuestra", "http://www.goodreads.com/book/show/27225456-la-vie-quand-elle-tait-nous", "http://www.goodreads.com/book/show/34096224-cuando-aparecen-los-hombres", "http://www.goodreads.com/book/show/23299353-los-pasos-que-nos-separan", "http://www.goodreads.com/book/show/5754772-el-leon-dormido", "http://www.goodreads.com/book/show/20512010-las-damas-de-shangai", "http://www.goodreads.com/book/show/22590921-la-vida-el-ptica"]}