{"ratings": 3357, "userreviews": [{"userName": "David", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/5161869-david", "userReview": "Everybody sucks. Everybody in this book just sucks. The NFL sucks. The NFL got stuck in their little damn castle, deny-deny-deny, and even when all their own doctors told them that some of their players had severe brain damage, and they finally loosen up their tight-ass wallets to give some money to the families, even then just deny deny nope no concussion problem in our league deny deny yep we are funding a helmet designed to reduce concussions (which every not-employed-by-the-NFL scientist says is a flawed pipe dream, BTW) but there's no concussion problem so if your son got knocked silly in a high school game that's not our problem deny deny deny. And then the people who study the brains...these assholes. Step all over themselves to prove the NFL wrong, and who cares who's toes you step on. Show Autopsy Photos of the players who's brains showed the damage? Heck yeah. (And I'm not talking the slides of the damaged brain. I'm talking photos of the deceased players, mid-autopsy, and the doctor doesn't even get why people were creeped out) Act like the worst ambulance-chasing nightmares to the families who just had a loved one die in order to make sure they secure the brain before some other research group can? Check and check. Eventually sell out to work for the company you've spent most of your career trying to convince people is harming their employees without admission or remorse? You know they did.I know, I sound a little bitter and crazed. I get it. Look, I love football. Love it. And I've stepped over many an inconvenient fact in order to protect that love. But there has been a firestorm over the last two decades, building over the horizon, and at some point, I either have to admit that the city is burning down around me, or go down in the ashes. Every week, another report comes out that makes one question his/her fanhood. Another player knocks out his girlfriend or wife. Another player sexually assaults somebody, or beats his kids, and doesn't understand why he can't suit up on Sunday, because he's spent most of his adult life being told that because he can play a game better than 99.9% of us, he's more important. I grew up on this sport. When I was young, Sundays were about going to Grandma's for a big lunch, followed by all of us sitting around a screen to watch whatever game was on. And now...I don't hate football. I don't know that I ever could. But I do not like how it makes me feel. I do not like some of the athletes who play this sport, and how they are sheltered until they finally cross the line where people say, \"Well, we can't ignore that, can we?\". I hate that the small percentage of those a-holes completely overshadow the mostly decent majority of the league. And I hate that this game has become so fast, and so hard, that it is ruining player's lives, and demolishing livelihoods, and the League will not admit that it is happening despite all evidence, and will not take some of the ungodly amount of money we so easily hand over, in order to provide basic benefits to the retired players who built the empire that they sit on so high to look down on everybody. (And I'm not just talking about concussions....think about how many players need knee replacements, or have sever back or joint issues, especially from the older players who played before their salaries went to a ridiculous stratosphere) Football, right now, is not fun to watch. It's not fun to think about. It's one bad story after another, and over the last few years, I can not watch without wondering why I do pay so much attention.And I will pay attention. Probably for the rest of my life. That's the part that makes me feel so conflicted. I think about taking the high road, let football go, but then the game's on, and.....yeah. I really do love this game. That's why I was so angry reading this book, because LoD is meticulously written, and takes a long look at everybody involved with the Concussion scandals, and it was thorough and effective. And ultimately, there is nobody that comes out well. None of the problems get solved, and nobody is really clean. And players are still getting obscene amounts of money to possibly (probably) destroy their post-football lives. And come September, I will be sitting in front of the screen, watching again. I will be trying to capture an old feeling. Don't think less of me for it."}, {"userName": "Chris", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/3863015-chris", "userReview": "Originally published here.So here goes: my favorite sport is barbaric; it is destroying its players brains; Its prime pro league is doing everything it can to champion wealth above health; it may not be fixable.The crux of League of Denial is that an increasing amount of dead football players appear to have brains riddled with chronic traumatic encephalopathy (CTE), a degenerative brain disease. An unfortunate amount of those deaths were self inflicted or premature, due to the disease. Worse, it does not seem that CTE is linked to one big hit, but to repeated small-medium-large hits and improper diagnoses or insufficient recovery times leading to players returning to the field before they are healed. Worse still, due to the huge amount of money on the line and the hyped up over-the-top machismo of football culture that demands a man be able to take a hit or give one (lest he take an unassailable hit to his manhood), the players falsely report their symptoms as much as possible and clamber to get back into the game.This would be bad enough, especially the notion that it is merely repeated hits as the cause, an unerring staple of the sport, that is leading to broken brains. But on top of all this, the NFL, in a modern day bid to mimic Big Tobacco, is refusing to admit that football causes brain damage. They have been discrediting legitimate scientists, publishing propaganda, buying out dissenters, burying evidence, and propping up false science committees with silly names (the mild traumatic brain injury committee) for decades. Their efforts have had cascading effects; skewed studies have led to equipment manufacturers scamming high schools with “concussion-lessening” helmets that do not change a thing. The players recently settled a 765 million dollar suit with the NFL, which was tragic and foolhardy, because now we will never know just how much the NFL covered up.SI.com has published an article written by Seahawk’s cornerback Richard Sherman where he proclaims that football is a dangerous sports but the players know the risks and he complains about newer rules like not being allowed to hit a defenseless receiver. It’s sadly ironic because shortly before he shot himself in the chest (to preserve his brain for study), Bear’s great Dave Duers was on his radio show railing against the same rules, whining about the “wussification” of the NFL. Prior to ending his life, Duers typed out a treatise explaining the dementia and madness he felt in his later years, where he was described as a “different man” by friends and family. His deathnote / final text messages urged his ex-wife and fiancee to donate his brain to the NFL for study. On top of that, Sherman (and everyone else) does not know the true risks of football because the NFL still refuses to admit to brain damage and study.Brain damage is horrifying, regardless of its source. You would be right to condemn a man who shoves his wife, who explodes into inexplicable fits of paranoid rage at the drop of a hat. Yet how do we account for it, how do we address it when these are sudden changes in middle age, when there is a very high chance they are a result of brain damage due to playing football? These aren’t outsiders, they’re endemic. Of fifty four brains of players that neuropathologist Anne McKee has studied, fifty two had signs of CTE.I love football. A great game is intoxicating. Acquaintances or people who have otherwise known my company only outside of football games express shock and bemusement at my change of tone, demeanor, and frenzied enthusiasm when first watching a game with me. The book goes at lengths to show that the vast majority of the dissenters, the people raising a stink about safety and combating the NFL, are like me. They love football too.“The game was part of him, part of his American story. That’s the thing about football, why it’s different from cigarettes and coal dust and not wearing your seat belt and a whole range of other things that have been proved bad for us. We love football. Americans by the millions are complicit in making this sport what it has become, for better or worse. The outcome of the NFL’s concussion crisis will affect the country. But it will be determined not by the “enemies” or “opponents” of football but by those in love with the sport; the players, the fans, the advertisers, the book writers, the moms and dads and kids. Even the scientists.”It’s true. Football props up entire communities in America — the sole recreation other than substance abuse to many economically depressed areas. It sits upon a pedestal with God and Church as the only escape to youth in some urban communities. And like the protagonists of Shirley Jackson’s The Lottery and Rajesh Parameswaran’s I am an Executioner, We the People, are responsible in part for the violence and brain obliterating nature of football. It exists as it does today because we willed (watch) it. And it will only survive if the fans push for safety and brain damage to be acknowledged and addressed. And that is hard. There is no simple fix like banning horse collar tackles or chop blocks. Even after reading League of Denial, I’m still pissed a few days after my Patriots lost to the Jets in OT due a stupid new rule. A stupid new rule amended to the rulebook to help player safety. What is wrong with me?And not being able to push your fellow linemen on field goal attempts (the new rule) is hardly going to solve the concussion crisis. There will need to be more drastic changes, and the question is: can you maintain the essence of the sport with whatever needs to be taken out?"}, {"userName": "Amanda", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/3989798-amanda", "userReview": "Unputdownable. I know that's not really a word, but that's what it is.My boyfriend asked me to pick this up for him when I headed to the bookstore the other night, and I obliged. However, he reads one book at the time, while I am more likely to read a minimum of five, and he was still working on something else. Honestly, I didn't think the book would interest me. I'm not a football fan. I wasn't raised in an athletic household. He is a rabid fan, and I've just figured I might as well learn a few things about the game since it's always on our TV. But after I brought it home the other night, I started reading the intro out of curiosity. I figured it would be enough to tell me that I wasn't interested and would result in it being put down and waiting for him. False.This book was well-written and intriguing. It seemed to have its ducks in a row. The story is both inevitable (I mean seriously... How could people have thought that 300 pound guys slamming their heads into each other wouldn't cause the same kinds of permanent damage that it was causing to their bodies?) and tragic. Players on every level and fans are passionate about the game. Nobody wants to think that it's killing them or that the organization running it at the top is falsifying research and looking out only for itself and its financial interests, but that is exactly what is happening. Is it happening to everybody? Probably not to everyone, but it is happening at an alarming level. Is this the kind of life or fate that I would want for anybody that I cared about... or even my worst enemy for that matter? Absolutely not. Have my boyfriend's dream of raising a future Hall of Famer just been dashed? They sure have. I hope I don't ever have to tell my kids that I don't want them participating in something that they have their hearts set on, but I really and truly do not want my kids playing football, especially after reading this book."}, {"userName": "Bro_Pair أعرف", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/6956621-bro-pair", "userReview": "The book is terrific, and, surprisingly, scarier than the much-acclaimed PBS \"Frontline\" documentary the authors also made. Why scarier? Well, to be frank -- the doctors who come off as heroic in the documentary are a little more....human, here, for better or worse. I hate to be cynical - but the possibility that things are a little more complicated than a David versus Goliath story compels me. The NFL's money taints everything, including even the ostensible research of CTE - the one million dollars the NFL gifted to the BU brain bank, and their resident wheeler dealer Chris Nowinski, does not seem quite as innocent as it first seemed.This book asks some hard questions which need to be repeatedly asked, again and again. We are far from the conclusion of this story, and it's going to be much dirtier and with fewer clean hands than Hollywood would have us believe."}, {"userName": "Kerry", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/11559242-kerry", "userReview": "Incredible reporting about one of the biggest issues in sports today -- head trauma and concussions. The authors, both investigative reporters for ESPN, put together a comprehensive, compelling and shocking narrative on the NFL's long denial that concussions suffered on the playing field can lead to chronic brain disease that has resulted in dementia and sometimes suicide by former professional football players. As recently as 2005, the NFL concluded in a scientific paper, \"Professional football players do not sustain frequent repetitive blows to the brain on a regular basis.\" Anyone who has watched football in person or on TV knows this statement is absolutely ridiculous. The book chronicles the debilitating experiences of players such as Hall of Famer and Pittsburgh Steelers center Mike Webster, and former San Diego Chargers star Junior Seau, and many others. Exclusive interviews, previously unrevealed documents and private emails helped the authors lay the groundwork for this remarkable book that has convinced me of the real dangers of violent contact sports. I will never watch another NFL game, or football at any level, the same again."}, {"userName": "Michael", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/1301028-michael", "userReview": "\"If only 10 percent of mothers in America begin to conceive of football as dangerous, that is the end of football.\"I do not get as passionate about sports as I used to. I still enjoy watching them, still feel a rush whenever the Giants or Yankees do something good. But that enthusiasm has changed over time. As I've gotten older, I've begun to feel a bit strange spending so much time and effort personally investing myself in the exploits of other people, particularly multimillionaires. I have a life of my own to live, you know. Why am I letting another Alex Rodriguez strikeout ruin my week?A funny thing happens when you allow yourself to take a step back: you begin to experience an unsettling feeling that something is wrong here. Grown men (and women, too, but let's be real: mostly men) painting their bodies, destroying property, drinking to oblivion before and during games, all in the service of watching other people run around and play games.Our attachment to sports teams (and their ever-changing rosters of players) is really quite absurd: Ever catch yourself referring to your favorite team as we? As in, \"Can't wait until Sunday, we're going to wipe the floor with you.\" Or, \"Our cheerleaders are hotter than yours?\" At my alma mater, many of my fellow fans have apparently become honorary members of the team, because whenever we play our closest rivals, the games become ritualized tests of identity. (Never mind that had the other school accepted me, I would have happily chosen it over the school I now pledge my undying allegiance to.)All of these things were in my mind as I read the Fainaru brothers' timely and devastating book League of Denial. We NFL fans face an existential crisis. How can we in good conscience continue to root so hard for a game that requires and rewards such physically brutal levels of play and exacts such crippling, life-long costs? A game that casts its image in wartime/military iconography and whose players and coaches treat it as a standard for manhood? (To say nothing about the recent Miami Dolphins imbroglio.)Answer those questions, though, and you start to chip away at the all-consuming, identity-defining levels of fandom that have turned the NFL into a money-printing machine. It gets into issues of the whole reason football is so immensely popular in the first place. That we're a violent country that permits itself to vicariously take out our aggressions through these officially-sanctioned gladiator fights every Sunday. See the Raider fans in Oakland for a demonstration.It seems self-evident that having 300-pound behemoths crash into each other dozens of times a day, year after year, probably defies human design, and yet, the NFL and its acolytes would have you believe any side effects are utterly benign. That the bone-crunching hits that for years were treated with reverence on highlight reels can be shaken off (otherwise, you're a pussy).On the one hand, League of Denial is a standard \"big corporation tries to muddy the truth with its own interpretation and damn the reputations of anyone who claims otherwise\" book, one that always makes the corporation look completely tone-deaf and self-serving. It methodically lays out the prick-waving contest between the country's top neuroscientists and the lackeys put forth by the NFL (at least one of whom has no background whatsoever in neuroscience, despite the numerous \"peer-reviewed\" papers he had published). There's some he-said, she-said that pretty much shreds the NFL. If this is what you came for, you won't be disappointed.But it's the book's implications that will stay with you. What this book convincingly argues is that the NFL's concussion problem is not something that can be fixed with a few rule changes and better equipment; it's a problem with the very DNA of the game. You cannot change the central problem -- furiously hitting your head against an object (i.e., another massive player) that is moving with equal or greater force -- without turning the game into something else entirely.After watching the Frontline documentary last month, and now having read this book, I can't help but have serious misgivings about the whole enterprise, one that is so integral to the American experience that waiting for the game's popularity to run its course is a nonstarter. So, paradoxes abound: I do not want the game to go away, and neither do most of the doctors profiled in this book (many of whom have worked for NFL teams) and yet I feel genuine unease every time I see a big hit. I am all for more stringent protections but I get frustrated with how \"soft\" the game has become. Just last week, a 49ers lineman hit Saints quarterback Drew Brees at a crucial part of the game and was penalized 15 yards, a hit that most NFL purists thought was good, hard-nosed football, but is now considered dangerous. In our efforts to protect quarterbacks (read: the NFL's most expensive commodities), are we not changing the essence of what football is meant to be?These are the questions League of Denial will make you ask yourself. It's a Catch-22 situation, but it's one that must err on the side of caution, because these NFL players didn't sprout out of nothing: they came out of colleges, high schools, and grade school football fields. So this is more than a story about well-paid athletes who have made a choice to play a game that can inflict pain; it's an urgent public safety issue that could affect you the moment you (or your young child) put on a helmet.And if all of that is true, doesn't that make all of us -- the fans, the players, the executives, all of us who love our new national pastime and cringe every time we turn on the TV and read about another 40-something ex-football player shooting himself to death -- complicit?I dock some points for the writing, which can be plodding and repetitive in places. But their research is impeccable and it's presented cleanly and in a riveting, page-turning narrative. It's guaranteed to make you watch the games each Sunday a little more nervously."}, {"userName": "Taylor", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/32865-taylor", "userReview": "Playing football is hurting people. That's hard for me to say, as a football fan, but it's hurting people, and there's undeniable truth that that is so.Bennet Omalu, the subject of the recent Will Smith movie Concussion, recently compared football to cigarettes, and that comparison is apt for so many reasons, not the least of which is the industry-funded cover-up about the truth of just how dangerous they are.I would like to think that we are very near the tipping point in the connection between CTE and football where even the NFL is going to have to admit how harmful it is, but we're obviously not there yet. League of Denial illustrates this connection in a thorough, well-vetted route, from the early days of concussion studies (even the medical community did not think concussions were a big deal until the '80s or so), through to present times. The writers are ESPN writers and have no stake in any of these stories - which is important because there are so many competing interests here.Even moving just beyond the NFL's appalling behavior to try and minimize the studies done on CTE and football, there's an unbelievable amount of infighting in the science community, to the point that you have scientists reaching out to families to ask for brains immediately after a loved one has died, because they want to beat out a rival researcher. I expected the NFL to do some ugly, dirty things - and oh boy do they - but I was rather appalled at the behavior of some of these scientists, too. At times while reading this, you have to wonder if some of this would've come to light in a much stronger way had there been more cohesion and collaboration in the field. Part of the reason I chose this book over Omalu's is because I wanted an unbiased portrayal, and a bigger picture look. I do worry that Omalu's got an agenda - which isn't to say that I necessarily disagree with it, but particularly after reading this, I do think he has one.This isn't to say I'm trying to lay the blame on science here, it obviously lies on the NFL, which basically followed the cigarette industry handbook of how to fund studies, bury science, seduce people with money, push people around, etc. Still, you have scientists who are one minute fully behind the CTE-football connection, and who are working for NFL the next (but also a few in the opposite direction)!If there's anything difficult about League of Denial (aside from the content, that is), it's that there are so many people involved, and it's hard to keep them all straight. I felt like I needed some kind of family tree like in the ASOIAF/Game of Thrones books. Football is too big to die right now, but that won't always be true. The game has to evolve if it wants to continue. Whether that evolution means fewer contact practices, more practices with dummies, I don't know. Something has to change, and I think something will. To revisit the cigarette comparison, people still smoke despite incontrovertible proof that it kills you. I think that will also be true of playing football, what with it also giving people the ability to make millions (cigarettes just rely on that whole addictive thing). I don't have answers, but the longer these studies continue, the more football players are found to have CTE, the more people they're going to lose. Something needs to change."}, {"userName": "Liesl", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/1992248-liesl", "userReview": "I don't know if I can view or enjoy football to the same extent after finishing this book. I was already aware of the link that exists between this sport and brain damage, but reading in detail about how these players deteriorated so rapidly into madness was eye-opening and heartbreaking. Just about everyone involved in this ongoing investigation is awful. The doctors and scientists are doing valuable work, but are fractured over what amounts to petty grievances instead of forming a powerful united front, and their behavior over securing brains for study immediately after personal tragedy is appalling. The NFL comes out looking the worst, first by repeatedly denying the issue with concussions while sweeping it under the rug, and then by throwing money at the problem to make it go away without any sort of major public acknowledgement. Absolutely sickening. While my emotions certainly were stirred while reading, I can't say that the authors created a compelling narrative to follow; there is too little included about the science behind concussions in favor of covering the politics of everyone involved. I ended up having the same problem with this book as I did with The Big Burn: Teddy Roosevelt and the Fire that Saved America; both cover topics of interest to me, but the material is presented in too dry of a manner that caused my attention to diminish after a while."}, {"userName": "Misha", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/40015823-misha", "userReview": "I couldn't put this book down. Wonderfully written."}, {"userName": "Mr. Stoner", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/12515256-mr-stoner", "userReview": "So I have read a review or two about this book after reading this book, and it really worries me because, currently, there is two styles of football being played around the country, old school (use the head and suck it up) and new school (take the head away and report concussions). While this exists, the old school players will continue to play \"hard\" and receive praise, but the new school players will receive praise for tackling the \"new\" way, but still be told to suck it up! Now what everyone needs to understand is that does matter! The praise and glory are what the players seek, whether they admit it or not, the adulation of playing the rough sport as they grow up is an adrenaline rush, as is making the big tackle, block, play, or touchdown. We feed into that obsession in a way that provides the kids an adrenaline rush that they seek to replicate, drug free, I might add, and we are okay with it because they are reaching that high playing a sport that we love. We watch the sport religiously whether we admit it or not. I don't want to see it end but one can not deny the obvious, it causes concussions. BUT just as importantly, the line men are sustaining injuries standing 1 foot away from their opponent too. No big hits occurring at high speeds, but short bursts at low speeds but multiple times (50-60) per game. Whether you teach \"old\" or \"new\" techniques, you will probably sustain a concussion, especially as a lineman! I don't have an answer as to whether or not an adult, let alone a kid should or should not play the sport, but I do believe they should be informed about that decision. The NFL legitimately hid that information from it's own players, even when they knew. Then they denied it. It kind of makes me sick. As do the doctors that chased down dead bodies to get their brains. But again I understand why they did it, when the NFL was trying to keep them quiet. Even though there is justification for what many of these people did, it doesn't make it right. Irresponsibility and blame exist and can be spread around evenly with the NFL, doctors, and even us fans! Again, no answers here, but a lot of emotions laid in turmoil for me, considering the fact that so much knowledge existed, but was so negligently reported and dismissed with the only idea to protect the league!  I have my own demons as I watch my son and friend's sons play and know how it has effected my father who played with the leather helmets in another era altogether. Let alone the fact that my concussions, (while I know not if any occurred on the football field & definitely know of 3 that occurred on the baseball field) have left me physically fine but where do I stand with this? I love watching the kids play and enjoy that sport, as they learn some valuable life lessons. However, again at what cost? My emotions are in turmoil over my part in cheering on kids that will almost certainly receive a concussion at some point, and a sport I love to watch! What is the answer? None, provide them with the facts and let them choose? I don't know?  Great book for the facts that needed to be scoured and reported, but a hell of a hard read because it involved a great deal of emotional attachment!"}, {"userName": "Jennifer", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/997326-jennifer", "userReview": "Football has always been a matter of complete indifference to me, until 3 years ago when my 9 year old son said he wanted to play. For the first time, I started paying a little attention, and what I began hearing about concussions concerned me. But we signed him up. At the first parents' meeting with the coaches, all of my worries were assuaged. They assured us that they had received all of the latest information and training regarding concussions DIRECTLY from the NFL, and that there was absolutely nothing to fear, because as long as enough time was allowed for a concussion to heal completely, there would be no long-term effects.One week later, I watched Frontline's League of Denial on Netflix. It was stunning and horrifying to understand that the NFL was outright lying to youth league coaches, so that the coaches could then spread the misinformation to parents. That was the end of football for our family, and though I was left with a burning curiosity whenever I caught wind of an NFL/concussion story in the news, it never occurred to me to read the book. But it showed up as a recommendation on my library Overdrive app this week, so I decided to give it a go. The fact that I am as clueless about football as Bennet Omalu, yet I could not put this book down, is a testament to how gripping and well-written it is. Whether you have a stake in football or not, this is an excellent read!"}, {"userName": "Liz", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/7365666-liz", "userReview": "I don’t think I would consider myself a football fan, but I can enjoy the social aspect of it (going to games in college, watching games at a bar with friends, Super Bowl parties, etc). I can appreciate how important football is to others - it’s truly it’s own world, culture, and escape for some people. Overall, I wasn’t shocked by the recent research findings or the effects of CTE on the players and their families. However, I was appalled by how much the NFL has covered it up over the years. Also by how much they continue to be shady to protect their insane profits. Disgusting. Irresponsible. Shameful. I would love for their top execs to come spend a few weeks around people with brain injuries - maybe they could even spend time with them at home to better understand the devastating effects on their families. Anyway, very good read. I’m always happy to see more public information about head injuries (and awareness of speech therapy!) Also yay to the scientists who are out there fighting against the big bully NFL."}, {"userName": "Scarlett Sims", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/1392101-scarlett-sims", "userReview": "So, you probably don't need more reasons to dislike the NFL, but here is a history of the league's issues with concussions and brain damage and the effect it has had on former players. The authors draw parallels between the NFL and tobacco companies who knew how dangerous their product was and yet continued to fund studies that discredited the opposition while supporting their own position.From reading the book, I would say the evidence is pretty damning, aside from one thing, which is that there has been no comparison of players' brains to brains of people who haven't played. To my knowledge, the patterns they see haven't been seen in a non-players brain, but they just can't get the funding to conduct these studies and the NFL won't fund them, for obvious reasons. While not every player has a completely traumatic story, the ones that do are really heartbreaking and the authors use that to maximum dramatic effect. The book also has a corresponding Frontline special that I'm interested in watching."}, {"userName": "Amanda", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/4678252-amanda", "userReview": "I'm a hockey fan who began to get curious about CTE when a number of guys began committing suicide or experiencing nasty side effects from concussions. That drove me to be interested in my alma mater BU's CTE program. Which then drove me to this book. Very educational, very eye-opening, and very, very sad. I hope that things can progress where these types of injuries become diminished in the game. Until then .. is it really worth it? For anyone interested in the subject, you'll see that BU's latest study got coverage. 110/111 football player brains they examined had CTE: https://www.nytimes.com/interactive/2..."}, {"userName": "Mac McCormick III", "userReviewDate": "Oct 10, 2013", "userURL": "http://www.goodreads.com/user/show/12299445-mac-mccormick-iii", "userReview": "This is a book that was hard to put down. It also hit like a sledgehammer. It clearly shows that the National Football League didn't just ignore a problem that caused deaths in retired players, it chose to ignore that problem. Furthermore, the NFL didn't just deny that the problem existed, it campaigned against those that tried to tell it and the football community that the problem existed.League of Denial is well written and seems to be well researched. It would be easy to write it off saying the authors weren't objective enough, but it's hard to make that claim when the NFL wasn't cooperative. The book brings up problems with and among \"the Dissenters\" and it's clear that you could question the motivations of some on both sides of the issue. That isn't something that was made clear in the PBS Frontline show associated with the book.I am a life long football fan, but after reading this book I am seriously questioning my love of the sport. Can the danger of traumatic injuries be mitigated? Is it worth ruining the post-football life of our football heroes for a Sunday afternoon of entertainment?"}, {"userName": "Greg Messel", "userReviewDate": "Dec 04, 2013", "userURL": "http://www.goodreads.com/user/show/2871227-greg-messel", "userReview": "\"League of Denial\" traces the history of the battle over head injuries being suffered by NFL football players. It actually is impacting all football players. It has become a battle between scientists and those in the league who are denying the seriousness of the problem. It's a clear chronicling of the slow realization that something is going very wrong with many older football players who are now suffering dementia, personality changes and constant pain. Two ESPN investigative reporters take us back to the early dawning of the realization that concussion and blows to the head are not like a sprained ankle. The case studies of stars like Steve Young, Troy Aikman and Mike Webster are among those highlighted in this fascinating book."}, {"userName": "Patricia", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/8093511-patricia", "userReview": "A quote from p. 318: \"With former NFL stars shooting themselves in the chest to spare their brains and thousands of players suing the league....\" The authors tackle the history of the discovery of the relationship between chronic traumatic encephalopathy and the concussions and repeated hits that football players experience. This book does an excellent and fact-supported job of explaining the price that football players may pay for their devotion to the sport. I found the story infuriating, poignant, interesting from a medical standpoint and I am left with hope that the battle for the truth will prevail."}, {"userName": "Mitchell", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/4671678-mitchell", "userReview": "Wow, this is a wonderful book. League of Denial is journalism at it's absolute finest. I couldn't put it down. For anyone that loves football and wants to begin to understand the NFL cover up of football related brain injury, this is a must read. Some of the personal stories are painful to read about, but they need to be told. It's still too early to know for sure if recent efforts by the NFL will decrease the likelihood of future brain injuries in football athletes at any level."}, {"userName": "Judy Collins", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "Well Done! Review to follow."}, {"userName": "Nile Schuett", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/70752818-nile-schuett", "userReview": "I thought this book was one of the best ones I have read in a long time. It gives the people reading an inside look into what it was like discovering what football does to the brain. The author tells the true story of what happens to football players of all ages after they're done playing the game. The story mainly talks about Mike Webster. A Hall of Fame football player that ended up going insane and killing himself. Bennet Omalu was the first man to perform the autopsy on Mike. What he ended up finding was shocking. This story goes in depth into everything that happened and that is why I like it so much. There are many other players such as Junior Seau who put the barrel of a gun to his head and killed himself. It is very common for former NFL football players to have a hard time fitting into the real word. They have trouble with performing simple tasks and remembering what to do and how to do itl."}, {"userName": "Lake", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/70752742-lake", "userReview": "this book is mainly about the NFL Comishiner, and these two reporters in an interview stile of book. The NFL is a past-time of great memories and sad parts for ever fan. The reason this book is so amazing it is a real thing, these player and especially if your a line men because they just bash their heads into each other every play. Players wake up with CTE and don't remember their kids because they played for so long. The begining of the story starts off as Terry Bradshaw a legendary Steelers quarter back telling them a story about how his center mike webster played center from 1974 to 1990 that's a very long time for a linemen. He got done and went crazy of the CTE his pills will not work and he started buying guns and started doing drugs and beating his wife. This ended in him taking his own life because football was his life."}, {"userName": "Preston Smith", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/47861468-preston-smith", "userReview": "League of Denial by Mark Fainaru-Wada and Steve Fainaru is such a great book that you don’t have to be an avid football fan to appreciate it. I was blown away by the information provided on topics ranging from the first case of brain damage to be associated with playing football to the NFL’s denial of the facts. I was impressed and worried by the gritty stories of the men who played the game both knowingly and unknowingly, in spite of broken bones, bulging discs, and even multiple concussions that could occur during the same game. One minute you’re shaking your head in disbelief and the next you are almost in tears as you learn how severely these men suffer later in life. Some end their own lives but don’t shoot themselves in the head so their brains can be studied. As of 2012, there have been over 50 cases of death related to brain damage caused by playing football. I was saddened by this fact, but not overly surprised. I was surprised by how much effort the NFL put into covering it up.Authors Mark Fainaru-Wada and Steve Fainaru also do an excellent job of tracking the NFL’s whereabouts during all of this commotion surrounding brain injury and death. Their research was a bit tedious and difficult to follow, but I appreciate the sheer amount of time they must have spent researching all of the facts. You had surgeons who could not speak their minds because they received money from the NFL to pay for private research. Others believed the NFL was sincerely interested in doing something to correct the problem and so they joined forces only to have their opinions marginalized if there was any correlation between football and brain damage. Companies such as Riddell made bogus claims that they produced helmets that were “41% more effective in preventing concussions.” Only to retract that statement at a later date. The NFL also created its own think tank in 1994 known as the Mild Traumatic Brain Injury Committee. The committee would publish many papers in a less-than-credible journal called Neurosurgery. All of its papers denounced all findings of football related brain damage. At this point, I have just about had it with the NFL. The evidence is clear and a masterful job has been done following the many paths this story travels. From slides of brain tissue to lawsuits of impropriety, we are able to glean a lot about the downside of playing professional football. Is it worth the possibility of losing your mind? Would you allow your kids to play? For that matter, would you allow your child to play soccer? Head butting is a part of the sport. There is danger to any sport, but the brain is such a crucial part of the human body, how could you willingly injure it?Never before have I been so interested in the brain and all of its power. How could I be so naïve? After all, I am a fitness trainer and the brain is responsible for movement. This book has truly changed my perspective. I have already taken action in regards to learning more about the brain. For one, the book I read right after this was The Inner Game of Tennis by W. Timothy Gallwey. A book that teaches you less about tennis, and more about the mental side of sport. In addition to this, I enrolled in ZHealth, a system of training that focuses on the nervous system. This book changed my life and it can change yours as well."}, {"userName": "Andrew", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/1406059-andrew", "userReview": "Wada and Fainaru's League of Denial: The NFL, Concussions and the Battle for Truth is an essential read for anyone who cares about football in America or is interested in the intersection of sport and health. Much of the NFL’s “concussion” debate has been covered in the mainstream press, but League of Denial fills in so many of the details. Reading League of Denial provides a much richer context to discuss the issue, understand the NFL’s obfuscation of the science and appreciate the negligence NFL owners have displayed towards its workforce as well as the millions of youth that play football every year.To wit, the NFL’s recent obsessiveness with “concussions” is a delicate bit of subterfuge that becomes more apparent by understanding the league’s approach to the issue for the last 20 years. The current NFL focus on “concussions” (which in and of itself is an amorphous term) as discrete traumatic events – counting concussions, evaluating and “treating” concussions through concussion protocols and “independent” neurological consultants – is a way to pacify the public that “concussions” are declining and divert attention from the concern that the nature of the sport itself, the years and years of repetitive head trauma (whether or not classified as “concussions”) cause the long-term debilitating brain damage evidenced in scores of former football players.The dominant fixture that college and professional football has become in our society transforms the “concussion” story into more than just a sports story. The oft-used comparison is to cigarettes and the tobacco industry but, at least to me as a child of the 1980s, football (and sports generally) seems so much more ingrained in American culture than smoking ever could have been. Smoking was a vice that was universally accepted. Football impacts what we wear, what we watch on TV and listen to on our commutes, what we read about, what we discuss with our coworkers, friends and family, what we teach our kids, what we are proud of, what we obsess over, what we dream of becoming. And the “concussion” story does not stop with football. The concerns over head trauma have increasingly been raised in other sports, most notably soccer. (The U.S. Soccer Federation recently announced a bad on heading in youth soccer before the age of 11.) League of Denial feels like only the beginning of a story that will take years (decades?) to play out. As we struggle to understand more about how the brain works and the impact that repetitive head trauma can have on its long-term functions, we are left with more questions than answers. Will the prevalence of long-term brain damage in football players be as prevalent as some of the researchers fear, or as isolated as the NFL hopes? What will “concussion” science mean for sports that we have come to love and treat as an integral part of our daily societal interactions? How do those of us who are parents balance the risks of playing youth sports with the fear of being reactionary or (god forbid) a “helicopter parent”? I have no idea how the “concussion” story will end, but Wada and Fainaru have written a compelling look at Act I.Recommended for football fans, parents and Roger Goodell."}, {"userName": "Paul", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/35789244-paul", "userReview": "This book will make you hate the National Football League, and possibly football itself, forever. It relates the complicity of the NFL in denying and resisting the fact that football causes serious concussions in the huge majority of its players, causing many of them to die of depression, dementia, ALS, or chronic traumatic encephalopathy (CTE) decades before they would have if they hadn't played football.Of the 62 brains of deceased NFL players donated to a brain bank, 59 of them had CTE. This came not just from spectacular hits when they were knocked unconscious, but just from the daily subconcussive jolts their brains absorbed in the everyday playing or practicing of the game.The anecdote that revolted me most was when one lineman described hitting two other mammoth linemen at the line of scrimmage with such force that his bowel evacuated into his pants. Generally, the problem was that when a player had a concussion, he should have not played for at least a week or 10 days afterwards, but was almost always sent back into the same game, where more hits severely added to the brain damage he had likely sustained the first time.Stories of middle-aged retirees who started acting crazy, became profoundly depressed to the point of not being able to get out of bed for days, or killed themselves are legion in this book. One retiree couldn't remember the names of his children; one couldn't recognize a photo of himself from his playing days. Many of them lost considerable fortunes from their playing days because they could no longer think straight or act in their own best interests. Divorces were epidemic; a few players ended up on the street or in railroad stations because they lost their homes and families.NFL executives strenuously denied any connection between concussive injuries and football for decades, all while quietly paying off the worst cases one by one. When the causality became too evident to be denied any longer, the NFL then beneficently donated millions of dollars for the study of brain trauma but did not allow a single exclusive study of CTE in retired or current players to be done. It also came up with the bogus concept of having Riddell develop a new, \"safer\" helmet that did nothing to prevent concussions, then it proposed the fraudulent concept of \"heads up\" football, which was supposed to be a kinder, gentler way of tackling that would eliminate head injuries.When mothers started withholding their children from the violent sport based on what they had heard, the NFL started a huge propaganda campaign directly aimed at \"football moms\" that assured them football had gotten less dangerous. As of the end of the book, this was continuing to this day.The nauseous stories of what became of these players after their careers, along with the NFL's blithe denials or minimizing of its own role in the ongoing tragedy is sickening. After reading this book, you will never look on football as a safe sport again, at whatever level.The authors also bring up the cultural blood-lust of football fans and how all of us who follow football to any extent are complicit in the slow deaths of the participants. It is a revealing book. And the slaughter continues..."}, {"userName": "Walt", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/1176575-walt", "userReview": "The real inside story of how the NFL is carefully hiding the seriousness of brain injuries. The details of some of the player's physical problems are really scary."}, {"userName": "Jayden Songster", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/48590671-jayden-songster", "userReview": "I really liked this book, It showed how crazy of effects that football can put on your brain. I really liked how they gave examples of who had CTE and all of the effects it did to that person. I just think after reading this book how many NFL players have this brain effect on them. I actually liked how different the book was, like how the book switches from one point to another."}, {"userName": "Amanda Griggs", "userReviewDate": "Sep 18, 2015", "userURL": "http://www.goodreads.com/user/show/2527498-amanda-griggs", "userReview": "One of the most engrossing and saddening books I've read in a very long time. I spent much of the book getting progressively more angry, actually muttering and yelling expletives out loud at some of the more infuriating parts. But I ended the book with tears in my eyes.I have been a Packer fan pretty much since the womb. My great grandmother was a fan of the team since their inception in 1921. One of my earliest memories is watching the Superbowl with my family as a toddler. So when I tell you that this book has made me feel like I will never look at the game in the same way, I want you to understand what I mean.The work done by the NFL, by the various commissioners, to hide and discredit the work of the scientists and doctors who discovered the link between football and CTE is sickening.New information was just released in the news a day or two ago that the nation's largest brain bank had found CTE present in 96% of brains of deceased NFL players examined. And yet the NFL will still not admit that there may be a link between CTE and football. They will not confirm a possibility.The list of names of players who died in agony, in torment, unable to remember their childrens' names or their own lives, is haunting. It's heartbreaking. And it angers me. It should anger you. There are many parallels drawn within the book that the NFL with CTE is just like Big Tobacco with lung cancer. They are not far off base. Like they state, people now know that tobacco causes cancer. Some people still choose to smoke.But many people still do not understand about the dangers of football. If made aware, many people will probably still play. However, they, and the public as a whole, deserve to have the whole truth as currently known presented. NFL needs to be held accountable for their lack of transparency. Otherwise we will continue to see names like Mike Webster and Junior Seau plastered across news media, annoucning that another former great has been found to have died with a ticking time bomb in their heads."}, {"userName": "V Dixon", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/5372522-v-dixon", "userReview": "Did I like this book? I liked it but felt it needs more to give a complete picture. Things I question follow. They are in no particular order. One of the issues I had was the photos included were selective. Here is a book that is trying to sell me on football related CTE and the photos were of equitable in their representation in the photo session. I wanted this book to make a serious argument but it really did not. As a layperson, it would be good to see clear photos of the damaged tissue versus healthy brain tissue. I would like to know the percentage with CTE versus those without it. Is CTE linked to other issues in football players? Does the NFL, those suing or anyone involved have any sort of positive plan? The subtitle is \"battle for the truth\" isn't that the case in any mainstream issue that receives media coverage and involves deep pockets? Is the public to get so outraged by this work that it will shame the NFL into some \"positive\" (according to those bemoaning the topic) for the players? Is the populace to read this work and feel so deeply that it will boycott football? Will you feel empathy for the players with CTE? It depends on your level of emotional sensitivity. If you are reading this for information, then it is a basis of future information to come. Reading this book raised more questions for me than it answered. Let me also add, I am a sports fan and have been a football fan but I am not anti-NFL as a result of reading this work. I am not in the mood to picket and boycott the NFL. I am not willing to go blind into an alliance with the players. I am simply a consumer of this written work.I like the last line of this book not because it was the last line but it creates a type of overall cohesion for the work. Should you read this book? If you already have a strong opinion not really. If you know all about CTE, then not really. If you are interested in having more information about a topic that is going to become larger-yes."}, {"userName": "Andrew Garvey", "userReviewDate": "Dec 07, 2013", "userURL": "http://www.goodreads.com/user/show/16329808-andrew-garvey", "userReview": "The best and by far, the most horrifying book I've read this year, League of Denial brilliantly details the NFL's grotesque twenty year (and more) mission to deny and cover up the sport's true cost to players' brains and to smear, deride and co-opt the growing army of doctors and researchers who disagreed with their ever more ridiculous, junk science stance.The book isn't perfect - the authors could have actually spent a little more time talking about how the brain works and how tau proteins affect it. Late on, they openly sneer at a formerly critical doctor who now sits on the NFL's revamped concussion committee when he says there is still no fully proven causative link between an NFL career, numerous concussions and the development of CTE. He's actually right and they also brush aside as completely meaningless, any other potentially important factors like steroid use or alcohol. It's still too early to definitively do that.But aside from that, this is an exceptionally good read. Passionately argued, fully referenced and backed up by strong research and hundreds of hours of interviews, their account of some players' horrifying post-career lives (Mike Webster's story is genuinely upsetting) and the scientific search for answers is as readable as it is appalling.Interestingly, the book is very critical of the personalities of some of those who, in a clumsier writer's hands would simply be straightforward heroes. The power games, the politicking, the backstabbing, the hubris of men like Maroon, Omalu and Nowinski makes them, in their own way, just as unpleasant as the likes of Pellman, Tagliabue and 'Dr No'. They just happen to be in the right side of the argument but in episodes like the mad scramble for the recently deceased Junior Seau's brain, nobody comes across well.Every sports fan needs to read this essential book. As does every coach, manager, owner and promoter involved in any kind of contact sport."}, {"userName": "Doug", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/1836099-doug", "userReview": "I had to ask myself, would I continue to watch the NFL if I knew its product was inevitably leading its players to dementia and a shortened life span? Yes, I know the argument is that these are adults making the decision to play such a violent game. Yet as author Mark Fainaura-Wada points out in League of Denial, if 10% of mothers decide to not let their kids play football because of fears of potential brain damage, then that is the end of football.League of Denial shows the all to frequent result of football player getting Alzheimer's later in life due to repeated blows to the head. What is perplexing is that no amount of helmet technology can prevent the brain from moving inside the head and smashing up against the skull on violent hits.What is truly appalling is the NFL's response to the crisis, which is to go into complete denial and try to slander any doctors who bring this to the public attention. It seems the NFL is more concern with preserving their $10 billion a year cash cow than the safety of its employees. Individual players, including some of the NFL all-time greats, from Dan Marino, Troy Aikman, Toney Dorsett, and Jim Macmahon, detail their own experience with brain related trauma. Aikman says to this day he can't remember the NFC championship game the Cowboys won because he suffered a concussion in the game, or the Super Bowl win he played in two weeks later.The biggest heart-break is reading about Steeler Hall of Famer Mike Webster's decent into madness. One time he was a four-time Super Bowl champion. Later in life he was broken down mentally and physically and living in a cheap motel with a bucket for a toilet because he could not remember how to get to the bathroom. Webster's story alone would make for a great book.As a football fan with a conscious, it is getting harder and harder to watch the NFL after reading League of Denial."}], "description": "\"PROFESSIONAL FOOTBALL PLAYERS DO NOT SUSTAIN FREQUENT REPETITIVE BLOWS TO THE BRAIN ON A REGULAR BASIS.\"So concluded the National Football League in a December 2005 scientific paper on concussions in America's most popular sport. That judgment, implausible even to a casual fan, also contradicted the opinion of a growing cadre of neuroscientists who worked in vain to convince the NFL that it was facing a deadly new scourge: A chronic brain disease that was driving an alarming number of players -- including some of the all-time greats -- to madness.\"League of Denial\" reveals how the NFL, over a period of nearly two decades, sought to cover up and deny mounting evidence of the connection between football and brain damage.Comprehensively, and for the first time, award-winning ESPN investigative reporters Mark Fainaru-Wada and Steve Fainaru tell the story of a public health crisis that emerged from the playing fields of our 21st century pastime. Everyone knew that football is violent and dangerous. But what the players who built the NFL into a $10 billion industry didn't know - and what the league sought to shield from them - is that no amount of padding could protect the human brain from the force generated by modern football; that the very essence of the game could be exposing these players to brain damage.In a fast-paced narrative that moves between the NFL trenches, America's research labs and the boardrooms where the NFL went to war against science, \"League of Denial\" examines how the league used its power and resources to attack independent scientists and elevate its own flawed research -- a campaign with echoes of Big Tobacco's fight to deny the connection between smoking and lung cancer. It chronicles the tragic fates of players like Hall of Fame Pittsburgh Steelers center Mike Webster, who was so disturbed at the time of his death he fantasized about shooting NFL executives; and former Chargers great Junior Seau, whose diseased brain became the target of an unseemly scientific battle between researchers and the NFL. Based on exclusive interviews, previously undisclosed documents and private emails, this is the story of what the NFL knew and when it knew it - questions at the heart of crisis that threatens football, from the highest levels all the way down to Pop Warner.", "title": "League of Denial: The NFL, Concussions, and the Battle for Truth", "url": "http://www.goodreads.com/book/show/18724049-league-of-denial", "average": 4.17, "cover": "https://images.gr-assets.com/books/1407710392l/18724049.jpg", "reviews": 437, "authors": [{"url": "https://www.goodreads.com/author/show/15009.Mark_Fainaru_Wada", "name": "Mark Fainaru-Wada"}, {"url": "https://www.goodreads.com/author/show/208634.Steve_Fainaru", "name": "Steve Fainaru"}], "type": ["Sports and Games", "Nonfiction", "Science", "Football", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/18724049-league-of-denial", "http://www.goodreads.com/book/show/18209673-league-of-denial", "http://www.goodreads.com/book/show/18209437-league-of-denial", "http://www.goodreads.com/book/show/18813484-league-of-denial", "http://www.goodreads.com/book/show/906.Game_of_Shadows", "http://www.goodreads.com/book/show/220246.Target_Underwear_and_a_Vera_Wang_Gown"]}