{"ratings": 1393, "userreviews": [{"userName": "Andy", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/18810398-andy", "userReview": "The war is over so wasn’t sure how this series would pan-out as to date the series has covered the pre-war rise of the Nazis to power as well as the war years. It becomes clear early on where the story is going as we’re launched into the espionage conflict of post-war Berlin with the uneasy alliance of Russia/America coming to the fore.The stars John Russell & Effi Koenen (Yes the actress girlfriend gets equal star billing this story) return to Berlin 6 months after the war..... they only return for a reason each, he involved in the espionage game whilst she is to resume her career as an actress & it’s the suspicion, distrust, revenge & denial that is palpable in the city as their stories & interaction with lost friends/old enemies transpire & evolve. There are a few sidelines too that involve Rosa their adopted daughter.The main story portrays the aftermath of a fallen Germany, a shattered & now divided Berlin, the stories of survival from both Berliners & the Jewish population from the death camps, tales of searching for missing/displaced relatives, there’s profiteers, despair, people trying to strike out & make a life for themselves....... all to the backdrop of a developing distrust between Americans & Russians, the Brits/French being sidelined for all intents & purposes. The lead-up to the American/Russian detente is covered as well as the flight of the Jews to Palestine & the beginnings of Mossad & other underground units who decide to take matters into their own hands, as the allies, after having caught & tried the big names of the Nazis have seemed to let others go..... With all the reunions (both good & bad) in Berlin its an atmospheric & poignant story for sure & enjoyable for the most part but..........There’s no REAL sense of danger in the story, the lead coupla haven’t got the Gestapo or NKVD one step behind them & looking over their shoulder, there’s no imminent capture & certain death in play & for that reason the suspense element is missing & certainly a lot diffo than the first 4 books.Its 3.5 stars jus rounded upto 4 as it’s a good read & I learnt stuff! But it is the weakest of the series to date as it does fizzle out a little."}, {"userName": "Sue", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/2425554-sue", "userReview": "This one was tough. The book was definitely not the page turning read the others were, but somehow at the end I felt it was necessary more than enjoyable. It wrapped up several story lines that you might not even remember, but there was closure for all the characters John and Effie crossed in their paths. The problem was, that's really all it was, so it didn't flow like the other books did. The only other problem with the book wasn't Downing's fault at all. The world is ugly, and full of distasteful compromise. As John observed fairly early on, simple survival was much easier than trying to navigate the post-war world. Seeing Nazis survive and thrive stealing the identities of Jews they'd killed, seeing Americans not care about employing those Nazis as long as they bring something tradeable to the table, and worst of all, seeing all the occupying forces really not care about the surviving Jews because anti-Semitism is not a strictly German idea was just so harsh. And so true, every step of the way. Downing does not dwell, nor does he present for simple effect. It's all woven into the circumstances of John and Effie and I think seeing it in terms of normal, every day people rather than a textbook made it just so much more sad.I'd recommend this book for anyone who read the others in the series, but no one else. And I'd strongly recommend the series for anyone with any interest in World War II Germany."}, {"userName": "David Highton", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/48750300-david-highton", "userReview": "John Russell and Effi Koenen return to Berlin in November 1945, after 6 months in London following their earlier escape from the Red Army. Russell has been forced into a dangerous double agent role with the Russians and the Americans, and quickly gets caught up with black marketeers, the Jewish exodus to Palestine and the hunt for ex-Nazi officers and camp guards. As usual, Downing's novel provides great insight into life in Berlin in the immediate post-war period and also provides information of the fate or future of many character from the previous books."}, {"userName": "Mark", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/216284-mark", "userReview": "When I spotted this at the library, I couldn't resist -- the latest in a series I fell in love with last year, about journalist/spy John Russell, living in Berlin before and after WWII.In this book, the Nazis have been defeated, Berlin is a surreal landscape of rubble and occupying armies, and Russell and his girlfriend Effi have returned from exile in London, because the Soviets have their hooks into him for work he did for them previously, and they want him back in the city for work as a double agent with the Americans.Seems straightforward and yet hard to believe, but Downing is such a good writer about the complex relationships and alliances of that period that you not only embrace all this, but you accept the idea that Russell is a moral man trying to do right in an immoral world.As in his other novels in the series, Downing also uses the precarious adventures of Russell to illuminate other often uncomfortable pieces of history -- the brutal displaced persons camps the Americans ran for Germans, in which people would die from falling into latrine ditches or for lack of decent medicines; the early network to move displaced Jews toward Palestine despite British opposition; the thriving and corrupt black market in Berlin after the war and the involvement of different military officers in it.As a fan of the series, I couldn't help wondering whether this novel would seem a little too much of a hot mess to someone reading it without having read the prequels. Downing seems intent on tying up all the loose ends of missing people from his previous novels, and much of the book has John and Effie searching for family members who were part of other books' plots. With my patchy memory, even I had trouble remembering some of these characters, and for a rookie reader, it might be fairly confusing. But just as in the others, I suddenly found myself near the end of the book, on tenterhooks -- and it so obviously looks like a sequel is coming, so forge ahead, Mr. Downing."}, {"userName": "MisterLiberry Head", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/10500708-misterliberry-head", "userReview": "The fifth “John Russell” novel picks up roughly six months after the end of POTSDAM STATION. Back in Berlin after escaping the final conflagration of the Third Reich, journalist John Russell once again is a reluctant spy whose allegiances would seem mixed—the Soviets, Americans, British and Germans all have a claim on him—except that his only true commitment is to his girlfriend Effi, his son & extended family. (My kind of guy!) Post-war Berlin is divided not just into zones held by the war’s four victors, but into survivors who are displaced, traumatized civilians and those who are profiteers or ex-Nazis. Also, there is the steady stream of Jews slowly making their way to either America or Palestine, sometimes with unexpected help. As the peripatetic journalist realizes: “In post-war Europe kindness was a story in itself.” The grim setting would be depressing, except for the many indomitable characters who are like flickering flames of hope & humanity in the darkness of the rubble. I’ve always been puzzled that this series of novels often is referred to as “Thrillers.” The books are much too atmospheric, character-driven and sensible to be thrillers. Espionage is much less important than depicting what it means to be decent people in a Germany gone insane and murderous. Like the previous four books, the title is taken from the name of a stop on the rail line and it marks the site, not of a victory, but of a crucial moral turning point or a nexus between key characters. What transpires at Lehrter Station is a very dark moment, but the sun is coming out for a cruelly segmented Berlin and an equally divided John Russell."}, {"userName": "Speesh", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/4052463-speesh", "userReview": "It goes without saying that this is (another) beautifully written paced and structured, evocative, sometimes provocative, story from David Downing. All his books in the ‘Station’ series have been. I’m not quite sure how he’s done it - maintain such a high standard of writing and story-telling over six novels (yes, I’ve finished the sixth now, though this is number five). Maybe he wrote them all at one sitting and then divided it all into six parts. Who knows how he’s done it, they’re all uniformly superb and this is (obviously, after all that) no different.‘Lehrter Station’ begins at the end of 1945. The war has ended and John Russell, Effi and John’s son, are holed up in London. Naturally, Effi misses Berlin, but so does John. Then, the bleak, post-war London woodwork squeaks and out comes Russell’s old Soviet contact Shchepkin with an offer Russell, after some consideration, finds he can’t, or would be stupid to - as in he wouldn’t live very long if he did so - refuse. So, Russell returns to Berlin to work for the Russians. And the Americans. He finds himself essentially, walking a tightrope at the cusp of the old war and the new, cold war. Clearly, as soon as the war was over, peace declared and celebrated, even before that, the parties were working behind the scenes on the next one.At the heart of it, there’s uncertainty. “I’m beginning to think certainty died with the Nazis” as a Jewish activist puts it. The new future is in many ways more uncertain than it was under the Nazis. Even at the end of the war, even not knowing where the next bomb was going to fall. Before the end, you knew who to avoid, who was the enemy. Now, even though the ‘enemy’ have been defeated, things are more unclear than they were. It’s about the future obviously, but also the past. How to think about it, how to revenge it. Should it be revenged? Is not revenging it, letting those who died, down? Is it revenge, or is it ‘justice’? Even when the Jews do it? Do two wrongs make it alright? About people paying for their past sins. Should they? Should sins be passed down to their children? Should whole nations be held responsible for the actions of their countrymen, when the actual perpetrators can’t be identified? When is enough? Do we turn a blind eye, because they’ve been wronged? No one won. We all lost. No one is behaving properly. Maybe the losers were, of course the Jews. And the Russians sent to their slaughter by Stalin. And the German people, sent to their slaughter, by the Nazis. And the German people, who saw their future destroyed. Twice. And the Jews. Though, basically, everyone thought they had it worse than everyone else (read Max Hastings’ ‘All Hell Let Loose’ you’ll know what I mean).It’s about expediency and realpolitik - our new enemy’s enemy is now our friend. Even if that means our enemy of five minutes ago, now has to be our friend. It’s about how complicated it was for the ordinary person, not involved in the new Great Game, just to survive. And about mothers and families. Ordinary people doing what they have to do to survive. People looking in from the outside seem to be able to judge and tell those they’re looking at, what is right or wrong. The people doing it think they’re right, that it was right to go to war and what they’re doing now, after that, justifies whatever they do - they must be right, because they ‘won.'“You end up asking yourself - how much better off are we? Enough to justify 40 million dead?”David Downing has built up a totally immersive picture and puts you in it. I have not so much feeling I’m reading about it - I’m there. Right there. Finest kind.More world-class reviews on Speesh Reads"}, {"userName": "Gloria Feit", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/6469333-gloria-feit", "userReview": "Five months after the fall of Berlin, this chronicle of the adventures of John Russell, the Anglo-American journalist, and his paramour, Efffi Koene, the actress, continues. Four previous “Station” novels carried them through the pre-war years in Berlin to Russell’s escape to England. Now, his former Russian spymaster sort of blackmails him into returning to Berlin as a spy for both the Reds and the Americans. To sugarcoat the request, Effi is offered a starring role in a soon-to-be-made motion picture.The couple return to a devastated city, where the only rate of exchange seems to be cigarettes and sex. No food, housing or other essentials, but a thriving black market. The story continues with the history of the immediate post-war, including the beginnings of the Cold War and the plight of surviving Jews, with the British reluctance to allow emigration to Palestine and the Zionists’ attempt to get around the roadblocks.The series is more than just run-of-the-mill espionage stories, but a reflection of the time and people in an era of mass murder and terrible war and its aftermath. The descriptions of the rubble that was Berlin after the Allied bombings and the Russian rape (it is said that there were as many as 80,000) is terrifying. And the depiction of the duplicity of the U.S. and Soviet intelligence agencies is despicable, especially when they overlooked Nazi backgrounds when they served a purpose. Presumably, there is room for a new effort in the series, and we look forward to it.Recommended."}, {"userName": "Lisa", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/14916660-lisa", "userReview": "I am on a semi-constant quest for literate, historically accurate World War II espionage novels, a la Alan Furst. They are devilishly difficult to find. Thus, I was excited to discover David Downing. I seem to have started the series with the most recent book, but I'm hooked and am looking forward to going back to the first one and reading them in order.Downing's hero, John Russell, is a British reporter with American citizenship. This novel starts in London, but most of it takes place in immediate post-war Berlin.. The city is a landscape of bombed out ruins, food and shelter are scarce, and the nations in charge of the various sectors into which Berlin has been divided are essentially lawless. There is little to recommend the place, yet the love of the Berlin that was brings people back to try to rebuild. There is no really reason for hope or optimism, yet there are glimmers of it throughout. I was impressed with how well Downing captured this - and also the frankness with which he describes the choices people make to live. His writing is understated enough to make the horror that much more real; the events speak for themselves, no hyperbole necessary. This book hit a sweet spot for me: well-written and engaging with a good, complex story, yet not taxing. The thinking person's airplane novel. Highly recommended."}, {"userName": "Lynne", "userReviewDate": "May 12, 2012", "userURL": "http://www.goodreads.com/user/show/7967420-lynne", "userReview": "I have always enjoyed this series of novels but as the setting moves into the post-war period, I wonder if there is a sense that the characters thoughts reflect a modern interpretation rather than a contemporary perspective."}, {"userName": "Anna", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/15012065-anna", "userReview": "At this point I have stopped trying to understand John and his motivations; I am strictly reading to find out what happens to Effi and Rosa and Paul. 1 more book in this series"}, {"userName": "Liviu", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "INTRODUCTION: Together with Alan Furst's historical novels about the immediate pre-WW 2 period, David Downing's John Russell novels which start on New Year's day 1939 in Zoo Station and so far cover the period up to New Year's Day 1946 at the end of Lehrter Station are big favorites that combine superb historical fiction - atmosphere, characters - with a dash of intrigue and action. Here is the blurb and more about it below.\"Paris, November 1945. John Russell is walking home along the banks of the Seine on a cold and misty evening when Soviet agent Yevgeny Shchepkin falls into step alongside him. Shchepkin tells Russell that the American intelligence will soon be asking him to undertake some low grade espionage on their behalf—assessing the strains between different sections of the German Communist Party—and that Shchepkin’s own bosses in Moscow want him to accept the task and pass his findings on to them. He adds that refusal will put Russell’s livelihood and life at risk, but that once he has accepted it, he’ll find himself even further entangled in the Soviet net. It’s a lose-lose situation.Shchepkin admits that his own survival now depends on his ability to utilize Russell. The only way out for the two of them is to make a deal with the Americans. If they can come up with something the Americans want or need badly enough, then perhaps Russell will be forgiven for handing German atomic secrets over to Moscow and Shchepkin might be offered the sort of sanctuary that also safeguards the lives of his wife and daughter in Moscow. Every decision Russell makes now is a dangerous one.\"OVERVIEW/ANALYSIS: Lehrter Station is the fifth John Russell novel and it was still captivating and making me want the next installment asap - and there will be a next and probably as many as the market will bear since there is so much stuff that's going on and as the hero puts it:\"Rather to his surprise, he felt more sanguine about his new espionage career than he had when the Soviets first came to call. Wondering why, he realized what had changed. While the Nazis had flourished, he’d had no ethical room for manoeuvre. Helping them, or hindering their enemies, were not things he could live with. Or not with any sense of self-worth. But that black-and-white world had vanished with Hitler, and the new one really was in shifting shades of grey. He could make arguments for and against any of the major players; in helping one or the other he had no sense of supporting good against evil, or evil against good. If, in personal terms, Yevgeny Shchepkin was almost a kindred spirit, and Scott Dallin someone from a distant unfriendly planet, he had no illusions about Stalin’s Russia. And though American help was his only way out of the Soviet embrace, that didn’t mean he wanted a world run by money and big business\"Coming back to the book, first let's note that the blurb is wrong since it's London November 1945, John and his extended family (Effi - his longtime German actress girlfriend who missed escaping with him from Nazi Germany in late 1941 and spent the rest of the war in Berlin acting the part of an old woman and working for the underground that tried saving Jews and regime opponents, Rosa - their 7 year old Jewish \"adopted\" daughter assuming of course that her father is not to be found in the ruins of Germany, Paul - his 19 year old son and scarred veteran of the Reich's army, Zarah - Effi's sister married with a former mid/high ranking Nazi bureaucrat presumed dead or arrested, Lothar - her 11 year old son) are living in modest circumstances there, though Zarah and Paul are adapting better, while John is sort of blacklisted by the British press and Effi wants to act again (noting that while she did not act in a movie since 1941, she acted for her life in Berlin 1941-1945).The first Soviet team (ironically the NKVD team, Dynamo) to visit the UK (and mostly trashing the British footballers on home ground) brings Yevgeny Shchepkin and his sinister boss Nemedin to London with an offer John Russell cannot refuse as trading atomic secrets to the Russians for his family above while understandable at a personal level can still lead to the gallows or the electric chair depending which of the two countries he is citizen of gets to try him; though of course Yevgeny wants out too so they form an alliance and John starts playing the double agent role though it is not yet clear for whom yet as the quote above notes...The offer included John getting back into journalism and Effi back in movies, both of course back in occupied Berlin and the story moves there and continues to a very good ending point a few months later for what is the first of hopefully many postwar novels.Here is another memorable quote:\"The war had only been over six months, but the British and the French were already irrelevant – there were only two real powers in the city, or in the wider continent. And as luck would have it, he was working for both.\"The journalism part starts involving the Jewish underground routes to Palestine and trips to Austria, Poland and Czechoslovakia and the kicking of the local Germans back to the Reich, but as usual the book is about atmosphere and the author is just a master at that recreating Berlin late 1945 and its myriad inhabitants, transients and occupants superbly; there are a few loose threads from older novels that are finally tied here (the fate of Miriam Rosenthal and of Rosa's father occupy John and Effy for most of the book), dangerous gangsters, ambiguous allied officers and of course the \"jobs\" John has to do for his American and Soviet masters...While the usual danger moments and suspense occur here and there, the novel is mostly historical fiction that lives and breathes through its characters, mainly John and Effi who split the pages between them.As mentioned the novel ends at a good stopping point and I am really looking forward to the next installment as new storylines are introduced, new loose ends develop and new secondary characters of interest appear in addition to many secondary characters from the previous 4 novels.Excellent stuff and highly recommended.And to end, another great quote that now looks to the future and has John and Albert Wiesner (whom John helped escape Nazi Germany through his Soviet connections after his eminent Jewish physician father has been murdered by the Nazis in 1939 and Albert assaulted some Gestapo officials and became a fugitive, while later John helped his mother and sister emigrate to London using this time his UK intelligence connections - note that here it is still late 1945, so the state of Israel is still in the future) discussing the future of the surviving European Jews:\"‘Says who? I didn’t think you were religious.’Albert grinned. ‘I’m not.’‘I don’t think you can use the Bible as a title deed,’ Russell insisted.‘Some people do. Like the Europeans who conquered the Americas – being in touch with the right God made everything okay.’‘You don’t believe that.’‘I think that’s what will happen.’Russell thought about that. ‘Maybe it will,’ he conceded. ‘A friend of mine suggested emptying Cyprus – the Greeks to Greece, the Turks to Turkey – and then giving it to the Jews. Lovely beaches, good soil, not that far from Jerusalem.’Albert propped his head up on one arm and gave Russell a look. ‘We already have our homeland.’‘Yes, I expect you do.’‘And I’ll tell you something else,’ Albert said. ‘I understand why the Poles are expelling the Germans from their new territories. And I understand why they’re making it impossible for the Jews to return. If my friends and I have our way, the Arabs will all be expelled from Palestine. Anything else is just storing up trouble for the future.’‘That will put a bit of a strain on the world’s sympathy, don’t you think?’`Once we have the land, we can do without the sympathy.’\""}, {"userName": "Phil", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/66280703-phil", "userReview": "I had not written comments on the previous four books in the series, notwithstanding the four stars awarded, but with this fifth book, and the awarding of five stars, perhaps some words are in order.As I read the first book, I felt the mise-en-scene was perhaps a tad over the top. As the plot quit literally thickened I felt myself ineluctably sucked in, as the tension heightened, masterfully plotted by Downing.By the end of the third volume, I was relieved that John Russell had escaped, and I wondered why bother tying up the loose ends, that is, Effi's return to Berlin and how she might survive, as she was sought by the Gestapo, or what might happen to Paul, John's son in the Hitlerjugend, etc.The fourth book exceeded my expectations. The depiction of Effi's life in the underground, the noose tightening around the besieged Berlin as the Red Army advanced, the \"rape of Berlin,\" were all depicted with what I can only describe as authenticity.Post-War Berlin, book five, depicted not only the bleakness of life in general in the divided city, but also the myriad shades of gray. Hard to fathom how Dowling was able to hit do many high notes successfully, with such consistency.On to Book Six, and the conclusion of what can only be called a saga!"}, {"userName": "Susan", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/12781210-susan", "userReview": "As someone who has not read all the previous books in this series - taking place before, during and - this one in the immediate aftermath of - the end of the War, I was lost a lot of the time. John Russell and Effi return to Berlin, she to return to acting, he to return to spying for two sides at once They seem to run into everyone they've ever known. And, while the portrayal of the intrigues, losses, grief, destruction are well written - I often had no idea who they were talking about. There were also many political strands (in exploring and explaining post-war alliances and struggles); I am rather conversant in post-war history but still found this confusing."}, {"userName": "Gail Barrington", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/25613584-gail-barrington", "userReview": "Not a good option to start at the end of a series but I couldn’t find Zoo Station which I think is the first one. So a full third of the book was the main character running into other characters from previous books with enough back stories provided to give you an idea of what you had missed, then another third of the book was filled with the characters riding around on various modes of transportation, giving you a good idea of what post-war Berlin was like and how it and its inhabitants had been ravaged, leaving the final third for plot development and, while not bad, did not live up to its promise of being a thriller. My advice? Don’t start at the end!"}, {"userName": "Rogue Reader", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/2610419-rogue-reader", "userReview": "Downing's John Russell series is outstanding. The protag is fearful and courageous, inventive and clever living a double life. Realistic and awful narrative of post-war Berlin and allied treatment of German citizens, none who would admit to corruption or participation in the Nazi crimes. Must have been nearly impossible to walk some sort of fair line, to be human in Berlin in the aftermath of that horrendous war."}, {"userName": "Mrs Peta V Ashbee", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/71804423-mrs-peta-v-ashbee", "userReview": "Brilliant read whole collection"}, {"userName": "Joseph Dubonnet", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/60377509-joseph-dubonnet", "userReview": "Love this series"}, {"userName": "Robert Scott", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/43101170-robert-scott", "userReview": "John and Effi are living in London with Rosa their adoptive daughter and John's son Paul, Effi's sister Zorah and her son Lothar and money is short as everyone is working at whatever they can find in the depressed postwar English economy. Then John is offered a job back in Berlin and Effi can again act in motion pictures. The country, but especially the city is devastated and the ;four occupying armies are at loggerheads with each other, but mostly the west vs the Soviets. As usual Russell is caught between 2 country's intelligence forces and finds it difficult to file any news stories for publication outside Germany. He & Effie are able to help Jewish friends & expose Nazi criminals. Altogether a barn burner of suspense and intrigue."}, {"userName": "Sverre", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/18913521-sverre", "userReview": "*** Chaotic conditions in Berlin defines the aftermath of WWII ***This 5th of Downing’s ‘Station’ WWII crime/thriller/spy series, follows closely the events of the 4th book, Potsdam Station. The time period is June to December 1945. The allies have divided Berlin, Germany, Vienna and Austria into four areas of control. The western and eastern borders of Poland have been shifted, dislocating Germans and Poles. Jews find themselves unwanted and unwelcome in most countries; their exodus to Palestine, with the hope to found a Zionist state, has started. Black-market profiteers—many of them former Nazi operatives—are aided by unscrupulous members of the American and British ‘liberators.’ Berlin is a mass of ruins and rubble. Millions of people have nowhere to live, suffer from famine and little or no health care or emergency aid. Police protection is virtually non-existent and where it exists it operates to give advantage to the ‘liberating’ authorities. Rivalries between political factions abound. John Russell and his long time girlfriend, Effi Koenen, have found refuge in London. John’s son Paul and Effi’s sister Zarah and her son Lothar are with them. Rosa, a displaced Jewish girl with no mother and a lost father, who had been taken care of by Effi, is also with them. Effi through the collaboration of the British, Russians and, reluctantly, the Americans, make way for her to have the major role in a new movie being filmed in Berlin. Russell finds himself indebted to the Russians for having helped him to escape from Berlin at the end of the war. So the course is soon laid out for him to once again become a double agent for the Russians and Americans. Thus he and Effi both return to Berlin.I think Downing’s research provides this book with considerable credibility about the post-war environment in Berlin and on the European continent. I found it interesting from that angle alone; the espionage intrigues and underhanded dealings are almost incidental to the chaotic conditions and conflicts that permeate the lives of everyone, except for a few who know how to stake out their territory and play their cards to own advantage. This novel is less suspenseful than the previous four but it held my interest to the end. It does tie up some lose ends. I look forward to reading the sixth book (and perhaps the last John Russell novel) which is called Masaryk Station."}, {"userName": "Carrie", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/2521662-carrie", "userReview": "Getting easier to follow and am curious as to what comes next."}, {"userName": "Mieczyslaw Kasprzyk", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/4744217-mieczyslaw-kasprzyk", "userReview": "This is a fascinating portrait of a society crawling out of chaos. It's not just the buildings and bridges that are reduced to rubble and ruins in post-war Berlin. The Americans are playing all sorts of games, some of them aligning themselves to ex-Nazis and the black market in order to fight the invisible war against the Soviets, whilst others appear to be totally unaware of what life was really like under Hitler's regime. The British are imperialists hanging desperately onto power, the stern teacher in the school corridor. The French are seen as inconsequential and no-one understands why they're running part of the city anyway. The Russians are playing a game of winning hearts and minds without realising that they lost them when they raped their way through the cities... as if they really care because they seem to be the only ones who have a plan. The Germans come across as befuddled victims surviving by the skin of their teeth and confused as to how all this happened in the first place... and the Jews come across as confident and fighting fit... realists in a new world.Interesting.I like David Downing's Berlin series. They're gripping adventures set in a dirty world. Now the war is over it's not got any cleaner and our hero, John Russell, finds himself used as a pawn by both the Soviets and the Americans. All he wants to do is survive... like most of the other characters in the novel. This isn't easy when the world is on the brink of collapse. Cigarettes are the only real currency, everything is on ration, gangsters are having a great day, peoples are in flux as they move about Europe - this is true post-apocalyptic stuff when you think about it.It struck me, as I was reading, that I can't think of many books set in the immediate post-war period in Central Europe. Obviously there's Graham Greene's \"The Third Man\", Andrzejewski's \"Ashes and Diamonds\" and Philip Kerr's \"A German Requiem\" but I'm not aware of any others. In film I can only add \"Landscape After the Battle\" and \"Bicycle Thieves\" to the list. It's almost as if the period falls into the shadow of the more dramatic War years and the Cold War that followed. This is a real shame because this really is a fascinating era with so much going on, so much in embryonic form. Downing has lit a fire under my feet with this one and I want more!"}, {"userName": "Paulo Migliacci", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/10037629-paulo-migliacci", "userReview": "David Downing writes plausible thrillers - something most people won't take as the warmest of compliments, but in this case it certainly is. John Russell, the main character in Downing's 'Lehrter Station' and his four preceding WW2-era novels, is pushing 50 in the most recent installment of the series, and has led a dangerous life as a foreign correspondent in Nazi Germany before the war; from 1939 on, he ends up involved with spy agencies galore - American, British, German, Soviet -, but he is always a very reluctant operative, who takes into consideration the effect of his actions on his loved ones, his friends and even his enemies. So, he is rarely dashing; whatever revenge he wreaks, is mostly through cunning and out of necessity. Downing is also quite accurate in his historical depictions, a trait conspicuously absent in most thrillers about WW2. 'Lehrter Station' is short on plot; Downing spends his pages mostly wrapping up storylines left hanging in previous novels of the series, and though this is nice for those of us who are following the 'Station' novels from the beginning, it won't be great fun for novice readers. (But it sort of makes sense psychologically: the novel is picking up the pieces just as its main characters are trying to, six months after VE day.)As far as thrillers go, this one is not very thrilling - a charge that could be leveled against previous books in the series, too -, but there is something deeply satisfying in reading a plausible thriller. Though Downing is frequently compared to Alan Furst, he is a far better writer. In fact, the only WW2-related thriller I like best than Mr. Downing's quintet of stations is Robert Harris' 'Fatherland' (and yeah, I am aware that this is sort of an apples and oranges comparison).If you’re into plausible thrillers, this one is right up your alley - though starting by 'Zoo Station' and moving on chronologically from there would seem to be the best bet, because the full series is worth more than the sum of its individual pieces."}, {"userName": "Scot", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/663291-scot", "userReview": "Fifth in this series, that has taken our cast of characters from before WW II, through WW II, and now we enter the post-war period. As always, our central focus is what plays out in the grand old city of Berlin, though to give depth and insight to that understanding characters can and will move throughout Europe.John Russell and his Russian counterpart Shchepkin have both managed to survive all the multilayered espionage and the war itself, and now they find themselves doing a new variant of their intricate balancing act, as the post-war struggle for hegemonic power between the Americans and the Soviets emerges. Given his unusual history, languages skills, range of passports, and cultural knowledge, John is ow \"invited\" to be an agent for the Americans against the Soviets and an agent for the Soviets against the Americans. If he does otherwise his family will be in peril. His code of decency rather than any particular patriotism guides him, and the novel intelligently grapples with his perceptions of the errors and pitfalls in both systems as they attempt to \"reconstruct\" Berlin and greater Germany.One of the book's strengths is the way it emphasizes how many people were displaced or separated from loved ones due to the war, and how much time and effort was put into tracking people down, hoping maybe they were still alive, for those who survived on all sides. However, this leads to episode after episode of characters searching others out and laboriously checking to find them, and often failing, which makes the book drag, while conversely, so many remarkable occurrences of people stumbling upon whom they seek occur that it starts to push what is believable. A smart subtheme revolves around efforts for the emergence of a Jewish state in Palestine in this period--how some were for, some against it, and how various individuals, groups, organizations, and nations involved in post-war Europe responded."}, {"userName": "James", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/12839674-james", "userReview": "[task of finding Rosa’s father, finding Miriam, finding Jens, Effi’s movie getting off the ground, John somehow becoming a double-spy again (which felt really forced this time around, since both sides knew he was playing the other…why would either buy into that?), dealing with the black market profiteers which tied into finding Uwe’s killer, John following the Jewish trail to Palestine and working that story to get his career back on track, Effi trying to get her apartment back, Thomas’ troubles with the Russians, John helping Americans kidnap a Russian, (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/1887127-sarah", "userReview": "This book was certainly not as page turning as the previous books in this series. The plot goes in many different directions and gets confusing. The book reintroduces many previous characters, but so many at one time is confusing and it's difficult to keep them straight. However, this book does put some closure on those characters and their fate. Also, Mr. Downing has a serious issue with Americans, but his portrayal of ordinary Germans is a bit heroic. Apparently they all opposed Hitler and the Nazi's and were completely innocent during WW2. The Germans created the Nazi's and directly and indirectly brought them to power. I had very little sympathy for Annaliese when she kept saying \"we don't deserve this\". Really? The German people directly and indirectly killed upward of 30 MILLION people, yet they cannot take any hardships? My grandmother lived in Germany and survived this and, yes, it was hard and many Germans died, but Germans killed so many people and it seems like complete hypocrisy they are complaining when they brought this on themselves. The German women did not deserve to be raped in retribution, but the Jews, homosexuals, Gypsies, Africans, Slavs and others didn't deserve to die either. No one needed to die, but one man's obsession started this all. The German people are responsible for bringing him to power. The children are completely innocent, but are they really? Their parents brainwashed them and sent them to the Hitler youth camps. They were too young to realize it was all a lie. I've read many books on this subject so I am not ignorant of the facts regarding Hitler's rise to power. Mr. Downing seems to gloss over those facts and portray the ordinary German as against Hitler, but they weren't."}, {"userName": "Kathleen", "userReviewDate": "Feb 20, 2012", "userURL": "http://www.goodreads.com/user/show/851145-kathleen", "userReview": "Lehrter Station is David Downing’s fifth book in his John Russell series, all named after railroad stations in Berlin which each has a special significance to the story.Set against the devastation of Berlin in 1945, Lehrter Station is a spy story whose characters struggle to reclaim their lives after World War II. The city has been divided into British, American, French and Soviet sectors, and it is becoming clear that the lines are being redrawn with the Soviet Union as the new enemy for the Western powers.John Russell is a double agent, spying for the Soviet Union and the United States, not because he wants to, but because he owes a debt to the Soviets for his son’s life. When Soviet agent Yevgeny Shchepkin “requests” that Russell move back to Berlin from London to spy for the Soviets, he has no choice.Russell and his girl friend Effie, a film actress, return to Berlin and are witnesses to the fragmented lives of the survivors of war. Human life is cheap after the bombings, rapes and mass exterminations of the concentration camps. Since Russell is a journalist by profession, he is on the look-out of a good story as a cover for his espionage activities. He finds a story in the exodus of Jews from Europe to Palestine. But on his return to Berlin, he finds that Effie has been involved in some risky clandestine operations of her own.Author David Downing portrays an incomprehensibly tragic time and place in history in a manner that shows us the humanity of each character, as well as pointing us in the direction of the world political situation today. He weaves history and fiction together in a way that entertains and makes the reader think at the same time. It is an intelligent and powerful book.Reviewed for Suspense Magazine"}, {"userName": "Cheryl A", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/4387349-cheryl-a", "userReview": "In this latest installment, the war is over and we find John Russell - British journalist, American citizen, former Communist - safe with his extended family in London. Russell and his girlfriend Effi are having a hard time adjusting to life outside of Germany, but are glad to be safe.This safety comes with a price and Russell is contacted by Soviet agent Shchepkin, who lets Russell know that the bill is due. The Soviets want Russell to offer himself as a double agent to the Americans and deliver intelligence reports on the German Communist Party. The Soviets have also arranged for Effi to resume her acting career and pull her into the shadowy world of espionage as well.Downing ties up some loose storylines from previous novels in the series and this is a little confusing at times, especially for a first time reader. The real star of the novel, however, is the aftermath of the war on the people of Berlin. A wonderful line in the novel sums up the tone - \"Who would have thought that peace would prove more difficult than the war?\" Using Russell's career as a journalist, Downing covers the political play going on in Berlin between the Americans and the Soviets, the black market, the flight of the Jews to Palestine. The key characters - Russell, Shchepkin, Effi - are all basically moral people in an immoral world. All three try to balance what is right and good while participating in a world of chaos.This is an excellent series that I hope continues..."}, {"userName": "Trajan", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/17477034-trajan", "userReview": "I have now read five of David Downing's series on John Russell, the Soviet-American spy. In fact I found the books conveyed the atmosphere of Berlin, before, during and after the war rather well. Its is an ambitious series and, rather like Philip Kerr's Bernie Guenther books, there are better constructed tales. I found the penultimate book on Berlin in 1945 the best: the secondary characters notably Russell's son Paul, were well developed. The battle for Berlin is depicted in parts seemingly inspired by the historian Anthony Beevor. Some find the books slow moving. I prefer to think that Downing is good at depicting mood, both in characters and anmbiance.However all is not completely rosey. The Nazis are generally quite plastic, unsubtle and unidimensional. This contrasts with the Soviets who, while toiling for Stalin after the purges and during the Germano-Soviet Pact, are not universally nasty or brutish. His insistence on dressing all his SS characters in black does not jive with reality. The same goes for the Gestapo thugs who all wear leather coats. Give me a break. Finally, I had a hard time believing that so many Communists and Jews survived, and were active resisters, in Berlin under the nose of the Nazis. Notwithstanding the above, Downing has done a solid job marrying history and fiction. With just a tad more research and subtlety he could have produced a classic of the genre."}, {"userName": "Elli", "userReviewDate": "Sep 16, 2013", "userURL": "http://www.goodreads.com/user/show/4199685-elli", "userReview": "Lehrter Station (John Russell, #5) by David Dowling. I really liked this book. It's the first David Downing book I've read and it won't be the last. John Russell is the key character and his other half, Effi is a German actress who also insisted he leave when the going got rough and unsteady with the Nazi's in power. They were reunited after the war when he came back, hopefully to find some journalism work as well as reunite with the family...at least for the time being. 'Nuff said about the plot without giving spoilers. But John Russell does turn into spy-counter-spy, a black-mail type thing for activities during the war even if he would have been tortured or killed if he hadn't. Quite a number of people had been put in that position. All types of former integration as well as degrees came up in the story as people met people. It was a really good view of the western world right after World War II, and the naiveté of some of the soldiers sent in by France, Britain and the United States with a really very limited world view. There were also the heart-warming reunitings and some very sad losses that shouldn't have been. Just the picture of life then through these eyes would have made good reading for understanding, but the plot and how it solve and interwove throughout was excellent."}, {"userName": "James Kemp", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/6824106-james-kemp", "userReview": "With the fifth in the series we're in the immediate post-war period, six months after Berlin fell to the Soviets John & Effi are back. Having escaped to London with the surviving family members John is blackmailed by the Soviets into returning in the guise of a double agent. As with the previous books the real central character is Berlin and its people. The theme is one of devastation, both human and physical. John & Effi both get involved in finding out what happened to people they knew, and the friends of the survivors. It's mainly upbeat, although sprinkled with tragedy as one would expect. The book evokes the chaos following the end of the war very well, and the overturning of tables. The 'victims of fascism' are exalted and on double rations, the nazis are trying to hide and avoid retribution. As yet, no-one really feels safe, but things are getting better. We also see the start of the cold war here. John is working for both American and Soviet intelligence services, although more for himself and Schepkin than for either power. The whole situation is deliberately murky, and Berlin isn't formally divided, the four powers govern it jointly. This creates room for administrative pressure, and allows wandering between zones without fuss. This is used to good effect to add tension and obstacles to the story."}], "description": "Paris, November 1945. John Russell is walking home along the banks of the Seine on a cold and misty evening when Soviet agent Yevgeny Shchepkin falls into step alongside him. Shchepkin tells Russell that the American intelligence will soon be asking him to undertake some low grade espionage on their behalf—assessing the strains between different sections of the German Communist Party—and that Shchepkin’s own bosses in Moscow want him to accept the task and pass his findings on to them. He adds that refusal will put Russell’s livelihood and life at risk, but that once he has accepted it, he’ll find himself even further entangled in the Soviet net. It’s a lose-lose situation.Shchepkin admits that his own survival now depends on his ability to utilize Russell. The only way out for the two of them is to make a deal with the Americans. If they can come up with something the Americans want or need badly enough, then perhaps Russell will be forgiven for handing German atomic secrets over to Moscow and Shchepkin might be offered the sort of sanctuary that also safeguards the lives of his wife and daughter in Moscow. Every decision Russell makes now is a dangerous one.From the Hardcover edition.", "title": "Lehrter Station\n      \n          (John Russell #5)", "url": "http://www.goodreads.com/book/show/12403191-lehrter-station", "average": 3.98, "cover": "https://images.gr-assets.com/books/1328313503l/12403191.jpg", "reviews": 114, "authors": [{"url": "https://www.goodreads.com/author/show/35840.David_Downing", "name": "David Downing"}], "type": ["Historical", "Fiction", "Spy Thriller", "Thriller", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/12403191-lehrter-station", "http://www.goodreads.com/book/show/12403192-lehrter-station", "http://www.goodreads.com/book/show/16141293-lehrter-station", "http://www.goodreads.com/book/show/12959534-lehrter-station", "http://www.goodreads.com/book/show/17142128-lehrter-station-david-downing", "http://www.goodreads.com/book/show/15797418-lehrter-station", "http://www.goodreads.com/book/show/16621567-lehrter-station", "http://www.goodreads.com/book/show/63729.Zoo_Station", "http://www.goodreads.com/book/show/3285072-silesian-station", "http://www.goodreads.com/book/show/6054413-stettin-station", "http://www.goodreads.com/book/show/8717812-potsdam-station", "http://www.goodreads.com/book/show/15798445-masaryk-station", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}