{"ratings": 12410, "userreviews": [{"userName": "James", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "The cozy continues... I can't get enough of these type of books. They transport me out of regular life and drop me in the reality I sometimes want to be my own. But I can also escape it when I need to...A cop and a dentist after me? Perhaps not my ideal but it is for Hannah. I enjoy her escapades and look forward to what comes next!\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators."}, {"userName": "Rebbie", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/6582211-rebbie", "userReview": "4 1/2 stars So... I knew who the killer was pretty early on, but that's ok because the book was still fantastic! Things are really starting to heat up in Lake Eden, MN and I've noticed that the author is getting into a comfortable groove with both her characters and general storyline too. I don't know about you, but I love it when authors settle in, so to speak, because readers get to settle in as well. It definitely makes it easier to keep going with a series when this happens.Anyhoo, this is book #4 in the Hannah Swensen series, and this time in Lake Eden, MN Hannah finds herself at a crossroads between two love interests: the cutey-patootie detective hunk Mike, and the nerdy-but-also-cute dentist Norman. Norman has recently bought a home and land, with the intention of building the house of his and Hannah's dreams. Even though they had mapped out a blue print for their idea of a perfect home, Norman still took Hannah by surprise when he purchased the home and land because they had not formally discussed their romantic plans for the future. Inside the home is where the murder mystery begins, but this time it's Hannah's mother Delores who stumbles upon the body. As is par for the course with this series, Hannah is determined to solve the case and track down the murderer, and in doing so she finds herself in a dangerous place and has to use her wits if she wants to stay alive.The reason I didn't give this 5 full stars is because I was hoping for a bit more of a resolution as far as Hannah's romantic life goes. That's perfectly fine though; it'll just keep me excited to continue reading the series (I know I've said this before, but I hope she picks Mike. They have the most amazing chemistry together and truth be told Norman is a little bit boring imo). On to book #5!"}, {"userName": "Mandy", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "Ok I gave this 4 stars because I knew who the killer was halfway through. Otherwise it was a great Hannah Swensen book. I just hope Hannah picks a man soon because I'm getting exhausted trying to pick for her!"}, {"userName": "Donna", "userReviewDate": "Apr 04, 2008", "userURL": "http://www.goodreads.com/user/show/106557-donna", "userReview": "This series is really growing on me. I like how the characters are evolving. I am adjusting to the fact that the reader always knows who the \"bad\" guy is before the main character. This is just pure escapist reading--no literary quality whatsoever."}, {"userName": "Elle ✦ Pretty Little Books ✦", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/44344367-elle-pretty-little-books", "userReview": "Series  Hannah Swensen series #4 Genre:  Cozy MysteryThis series is my guilty pleasure. Whenever I am in a book slump and get tired of reading the same old books over and over again I know I can count on a good Hannah Swensen mystery to lighten up my reading experience. This book did just that! Hanna Swensen, amateur sleuth and bakery owner, always finds herself in the middle of a murder investigation-- whether she wants to or not. -- In many cases, one of her delicious desserts will be present at the scene, but this doesn't make her the guilty party, it's just that she is a popular baker and everyone loves her delicious treats (recipes are included in the story). So when she spots her Lemon Meringue Pie at Norman's new house -- Rhonda's aunts home that she sold -- and her mother finds a body in that very basement, things get messy and Hanna is thrown into yet another murder case in Lake Eden. This series, while it has a lot of books, doesn't get old for me. In each book you witness character growth and some fantastic connections between the characters. I love how close knit the town of Lake Eden is, and how everyone knows everything about what's happening. Now, while I wish Hannah would make up her mind on who to settle down with (Norman the dentist, or Mike the cop) I have a feeling that she may figure it out soon... Fans of cozy mysteries or those who are new to the genre should definitely pick up a Hannah Swensen novel. Like I said before, this series is my guilty pleasure, and I love going sleuthing with the characters. Do would I recommend it? Highly! But make sure to read the series in order!"}, {"userName": "Barbara", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "Hannah Swensen, owner of a cookie shop, is surprised to hear that one of her boyfriends, dentist Norman Rhodes, has purchased a house - lock, stock, and barrel - from Rhonda Scarf. He plans to tear down the house and build a dream home. Before the house is demolished Hannah and her mom, an antique shop owner, go out to look for treasures. In addition to a few valuable antiques they find the dead body of Rhonda Scarf. Hannah's other boyfriend, detective Mike Kingston tells her to keep her nose out of the investigation but Hannah can't resist and dives right in. This is a real cozy mystery in the sense that the police/detectives seem to do nothing at all. As Hannah runs around questioning people and making phone calls and taking photos of the crime scene, etc. it seems like she's the first one on the scene every time.Soon after the murder, money from an old bank robbery starts circulating through town which provides clues to the crime. The book is chock full of fun characters - Hannah's sisters, mom, and friends. It's a fun light mystery that includes recipes for lemon meringue pie and a variety of (what sound like) delicious cookies.You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"userName": "Noriko", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/30787873-noriko", "userReview": "I normally hesitate to give a light read such as cozy mysteries and chick Lit high ratings thus I'd settle for 4 stars, but I absolutely adored this 4th installment of the Hannah Swensen series. As my friend who keeps following this series once said, the side plots including family drama story get longer and longer each book, but for once, I didn't even mind the slight devoid of the mystery element. If anything, I found myself more and more enraptured by the characters and Lake Eden itself. The warmth of townspeople particularly stands out in this book. Beautifully intertwined with all the excitement and festivities surrounding the Independence Day preparation, the lure of Lake Eden and the kindness of the townspeople are vividly portrayed, it made me want to visit Lake Eden myself, I think this installment is my favorite in the series so far. Vivacious like the sunlight in summer, the festive and cozy vibe is definitely running through this book. The sleuthing plot is well-delineated as well. It was funny yet ironic that Hannah decides to stay away from the investigation and focus on prepping for the Independence Day catering and events, but everyone - including Mike and Bill, or even the officers in the station - are expecting, or even asking her to investigate/cooperate in this case. Mike used to be a bit rough around the edges up until the last book and I was personally a bit offended by his obstinacy, but he comes around a bit in this book and that's one of the things I liked about this book. That Hannah hits the dead-end in the investigation was also interesting; the development is slow going and for once, I suspected if it would end up being a cold case because there wasn't a tangible development/twist until 95% into the book. Just like Hannah, I sort of figured who attacked Freddy, who is certainly my fave character in this book, but I couldn't connect it with the murder case. When it's all figured out and explained, I thought it was really well done. Well contemplated. Come to think of it, there are lots of diversions that got me sidetracked in a nice way. Michelle's what seemed like erratic behaviors and the suspicions surrounding Jed's treatment toward Freddy... I even suspected Michelle was not as good a character as I had been made to expect. This may be only me, but I felt that way anyway. I can only assume the more and more creativity in culprit reveal is called for each book, and I was curious how Joanne Fluke pulled off this time. Let's just say I saw a different side of smartness in Hannah this time, I didn't expect the author to narrate the reveal from that angle, I was pleasantly surprised. The love triangle between Hannah, Mike and Norman positively frustrated me and was irresistible as well. As a hardcore supporter of Norman, I wished Delores and Andrea left out Mike sometimes so that Norman and Hannah could have some private time together, but oh well... I must say I'm frustrated, but I cannot wait to see which man Hannah chooses in the end. This book left me hopeful for the next book in the series and of course, I am all up for reading it!"}, {"userName": "Chaitra", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/9086236-chaitra", "userReview": "I'm getting bored of Hannah's problem solving already. I mean, it's been the same pattern in the four books of this series - Hannah/someone close to her finds a body, the dead body has been doing something with one of Hannah's amazing confections, everyone wants her to solve the murder and she wants it too, but Mike has to be satisfied first because he gets grouchy (and well he should - what is HE doing when Hannah solves the murders, I'd dearly like to know), and then she brings out her steno-pad and painstakingly takes all these notes, goes everywhere with the free samples that Lisa baked, has Andrea do all the interviewing, and then manages to accidentally solve the thing when the killer decides to kill her off because she's getting \"so close\". Why does Hannah come across as a 60 something fuddy-duddy? She's only 30. It's hard to believe that a person like her would refuse to do anything with technology, and that she'd be such a prude. It's only just the beginning of her Mike/Norman dilemma, and I'm bored of that too. I know. I can just give up on the series, but it isn't offensively bad. The recipes look good, and even though I'm not about to bake them, I can still salivate reading about them. Maybe #18 is when she'll finally grow up. Here's to hoping. 2 stars."}, {"userName": "Holly", "userReviewDate": "Sep 03, 2009", "userURL": "http://www.goodreads.com/user/show/1994638-holly", "userReview": "This is a really quick read. The plot is o.k. It is pretty easy to guess who the murderer is. I have a problem with the 2 boyfriends of the heroine Hannah. They are friends. What's up with that? Neither guy is jealous of the other. Not normal. And another thing. One of her boyfriends is a dentist living at home with his mother?? Not a manly man in my book. And he violates HIPAA! You can't go around telling people who you treat and what you are treating them for at a party. And I am pretty sure there is such thing as blue jello. It is called Berry Blue. At lest she got the Kraft part right. Coffee. Hannah drinks too much coffee. If the author really wants to impress me, Hannah bettter be dealing with anxiety, an irregular heartbeat & fibrocystic breast lumps in her next book. Diabetes too from all the cookies & pies that everybody seems to be scarfing down. Every couple of chapters has a cookie or pie recipe with it. They look pretty good, so I might have to try a few before returning this book to the library. I picked it up because it was in the wrong place at the library. I took that as an omen that it was so good, someone was hiding it. Someone was hiding it all right, hiding it so no one else would have to suffer through it."}, {"userName": "Cherry", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/31226642-cherry", "userReview": "[non-solvy way, except she actually almost worked this one out (hide spoiler)]"}, {"userName": "Martha Davis", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/3302869-martha-davis", "userReview": "My husband jokes about the various mystery series I read and the professions of the solvers of said mysteries. He loves to pick some far fetched job or hobby and then have them solve the crime. Topiary sculptor or glass blower, teapot collector or professional sock darner you name it they solve crimes. I myself am perfectly okay with this idea but then, I do have a remarkable ability to really suspend disbelief. So it all works out.I'm just fine with Hannah Swensen being a baker who just happens to solve murders. I'm good with the idea the police in her town can't seem to solve any of these murders without her input. I'm alright with the fact Hannah stumbles on dead bodies more often than most people come across litter. This series works for me and I do enjoy most the characters.In this outing Hannah's mom discovers a body in the basement of a house recently purchased by one of Hannah's love interests, Norman. (See she didn't stumble on the body this time so it works) In no time Hannah is investigating the murder and even has the okay of her other love interest, Mike, a detective in the local police. There's also a sub plot of stolen money and a local boy being led astray my his cousin and all of this takes place during 4th of July festivities.I had a hard time sticking with this story. It moved just a little slow for me and it wasn't to hard to figure out who and why the murder was committed. The side stories of Hannah's diet and her little sisters visit didn't really move the story along (though I did like the character of the little sister). There were also time where Hannah came across as a little prudish or behind the times which just struck me as odd.None of this turned me off to the series and I'm sure I'll keep plugging away. Plus, there are some really good recipes throughout and I love a good cookie recipe."}, {"userName": "Ann", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/985163-ann", "userReview": "[The murderer turns out to be the person Hannah suspected from the beginning (hide spoiler)]"}, {"userName": "Dawn", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/1642306-dawn", "userReview": "Each book just keeps getting better. I want these books for the sole reason of the recipes. I'm enjoying the mysteries as well."}, {"userName": "Moriah Venable", "userReviewDate": "Jul 17, 2015", "userURL": "http://www.goodreads.com/user/show/9923228-moriah-venable", "userReview": "With the fourth of July rolling around, the town is buzzing around getting everything prepared. When Hannah's sometimes beau, calls informing her that he bought a house from the local drugstore clerk Rhonda Scarf, to tear down and build their dream house (the one they won from the contest last book), to say Hannah was surprised is an understatement. The whole town expects an engagement announcement and for her to move into the house, which Hannah spends most of the book denying to those who ask her. Hannah is also excited to see her younger sister, Michelle, who is coming home from college. Freddy, the local, well isn't the smartest person in town, but he has a lovable personality. His cousin had returned to town to help him. When Delores, Hannah, and Norman, go to the house, to see if their is anything they want, before it gets torn down, Delores discovers the body of Rhonda in her basement, Hannah is reluctant to investigate the murder, but with so many people having \"investments\" she decides to investigate. While investigating, she discovers stolen money is circulating around town, and she feels that the two things must be linked. I have mixed feelings about this book. I loved the story and while I figured out who the murderer was about halfway through, it was still enjoyable. I just didn't really like the motive.The love triangle is starting to get a bit tiring, but I am still rooting for Norman. I like Mike but sometimes he can be really chauvinistic in my opinion. Let's face it, he's upset that Hannah is better at getting information and finding murders than him. I look forward to reading the next book."}, {"userName": "Joy", "userReviewDate": "May 27, 2009", "userURL": "http://www.goodreads.com/user/show/1694004-joy", "userReview": "I love lemon meringue pie and this book has no calories!"}, {"userName": "Sarah", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/37074491-sarah", "userReview": "3.5 StarsChallenges:♥ What To Read in 2018: Task 22: Click on Browse at the top and go to Lists. Scroll down to popular lists and pick one list. Read a book from that list. (Best Cozy Mystery Series)♥ AMMP: Fairy Tale Spell Out: 'L’ in Little Mermaid & 'F' Frog Prince♥ AMMP Cinderella’s Team: Week 5 Task - Read a book where a character finds a body♥ AMMP: Fairy Tale Bingo: Week 0 - Free Space"}, {"userName": "Brooke ♥booklife4life♥", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/15928872-brooke-booklife4life", "userReview": "Find this review, plus more, on my blog: Booklikes OR Blogger Basic InfoFormat: Audio Pages/Length: n/aGenre: Cozy Mystery Reason For Reading: Like the series At A GlanceLove Triangle/Insta Love/Obsession?: No. Cliff Hanger: NoTriggers: n/aRating: 3.5 stars Score SheetAll out of tenCover:  7Plot: 6Characters: 6World Building: 5Flow:  6Series Congruity: 7Writing: 6Ending: 6Total: 6In DepthBest Part: Andrea's surprise! Worst Part: Who the fuck is Michelle?! Thoughts Had: Anyone else going to pop out of the woodwork?!ConclusionContinuing the Series: YesRecommending: YesShort Review: So imagine your boyfriend calls you up at random, and tells you he bought a house, but doesn't ask you to move in to that house, nor asks you to marry him, what would be your first thought!? Hannah's first thought.... He must not love me because i have a few extras pounds on me... Wow. Way to be a positive role model there Hannah. So she goes on a diet, which come on, you own a bakery, good luck. OH and did you know Hannah has a younger sister?! Neither did i SINCE SHE HAS NEVER BEEN MENTIONED BEFORE THIS DAMN BOOK!!!!!! Misc. Book Boyfriend: Norman Best Friend Material: Andrea Review in GIF Form:"}, {"userName": "Karol", "userReviewDate": "Dec 22, 2008", "userURL": "http://www.goodreads.com/user/show/290438-karol", "userReview": "I really liked this fourth book in the Hannah Swensen series. A couple of new things: Hannah is actually encouraged to investigate on her own by her friends and family - apparently, they have had to recognize and acknowledge her talent. Since she has already solved cases 3 previous times, it makes sense that even those who initially objected to her involvement would be won over to some extent. The other new thing was the introduction of Michelle, Hannah's \"baby sister\". Michelle had been away at college, but comes home for a visit and is warmly welcomed by her eldest sister. I enjoyed the interactions between the sisters - it gave more depth to both Hannah and Andrea, whom Hannah became much closer to in the 2nd book.The whole sisterly love thing is something quite foreign to me and, therefore, that aspect of the story fascinates me. Actually being WELCOMED home from college by an older sister - wow! And even the term \"baby sister\" instead of \"youngest sister\" speaks of endearment. Admiration and concern being shared back and forth between female siblings - again, wow! The author in this aspect of the story takes me to a place I wish I could experience myself . . . but she does throw in doses of \"reality\" here and there where things aren't quite so perfect. In other words, I think she does a great job writing about how her characters interact, making it feel \"real\" and injecting some great humor from time to time, too. (Similar things can be said about the author's portrayal of Hannah and her business partner, too.) I enjoyed the sisterly relationship aspect of \"Lemon Meringue Pie Murder\" as much as the mystery itself.I got a huge kick out of the author's descriptions of Hannah's battle to lose a few pounds, too. Another great element that needed to be addressed at some point, given that Hannah makes outrageously fattening desserts for a living.A few times, I did find myself getting aggravated at Hannah for trusting the character that I figured was the murderer - perhaps there's a hardened, cynical side of me that comes out when characters are too trusting. (\"How can you believe this person?\" I feel like yelling). But sheesh - she started off with the right gut instincts and chose to ignore them until the tide of evidence made it impossible to ignore. Too bad for Hannah, because her misplaced trust put her life in danger - but of course we know there is a happy ending. There are a whole lot more books to follow this one in the series!Yep, I'll keep reading . . . so far, these have been really fun and entertaining mysteries that hold my interest. And I wonder: What will Hannah get involved in next?"}, {"userName": "Rebecca", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/2600140-rebecca", "userReview": "One of the earlier Hannah Swensen mysteries, with fewer recipes than the later ones, but just as enjoyable. The only odd thing is that because Fluke does a good job of mentioning people in Lake Eden from book to book, even if they are not main characters, when you listen to the earlier ones you can hear people mentioned and think, \"She's getting murdered in a couple of books, and he's going to murder someone a couple of books after that,\" etc. I also find it hard to buy that a mother still thinks it's her right to know whether her 30 year old daughter had a man over to spend the night, and that even if she does, her daughter doesn't just inform her politely that it's none of her beeswax. But maybe it's a Midwest thing? Or maybe just suspension of disbelief. After all, the series has been around for years and Hannah's been dating the same two guys the whole time and hasn't slept with either one, yet they're still hanging around. Perhaps the books should be reclassified as fantasy?"}, {"userName": "Luffy", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "I feel a bit dishonest giving this book one star, but in some ways it does deserve it. I skipped some parts. I was distracted and couldn't give the story proper attention. I'm already forgetting large chunks of the story. The first chunk (I estimate at about 100 pages) was very nice and cozy. The author took her time to lower Hannah gently into the mystery. It never got any other way except downhill from there. There wasn't much twittering of Tracey to endure, but when one superfluous character falls, another takes its place. It's like a hydra or the roman legions. Anyway I found the Michelle character boring. It was weird to find inter cultural ( that's how it says it right in the book) romance taboo - I simply wish to move on to the next book and be done with this review."}, {"userName": "Annalissa", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/6933462-annalissa", "userReview": "Probably my favorite in the series! I was almost 100% sure who did it till things didn't add up then BAMB the ended hit and I was left shocked. I wish there had been a bit more of an explanation as to what exactly happened or why or how they figured things out, but overall a great light read(:"}, {"userName": "Karen", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/5328621-karen", "userReview": "My usual thumbs up for Joanne Fluke, a good mystery, great recipes, and a all around good cozy."}, {"userName": "Kristin Bateman", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/2533313-kristin-bateman", "userReview": "SO predictable, yet SO much fun! Great summer \"fluff and stuff\" reading."}, {"userName": "Andrea Guy", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/1887553-andrea-guy", "userReview": "Lemon Meringue Pie Murder is book 4 in the Hannah Swensen series. I've been reading these totally out of order, as I can find them at my library and other libraries. The earlier Hannah books are the best, and this one is definitely a great read.I love Hannah, because this woman is so not right. She's a baker, a little overweight, (as the author likes to drum into our heads, in this book particularly so) she's a bit overbearing and grammar nazi-ish, but because she's so quirky you have to love her.To me, this book felt like it focused more on Hannah's relationship's rather than Rhonda's murder, though she did do her best at sleuthing. I really felt that she unearthed the killer more by accident than through actual deduction.This book finds Hannah's mom discovering a dead body in the home Norman purchased to demolish so he could build the dream house that he and Hannah designed. (Don't get any ideas, they aren't engaged or anything like that)Hannah's diet bugged the hell out of me, again because I've read other books in this series, Hannah's weight and her fashion sense or lack thereof seem to be a really big deal, and I'm not sure why. Also, I don't see why Norman wouldn't propose if Hannah put on weight, you either love someone or you don'tI have also never been able to figure out why and how Hannah didn't make a choice between Norman and Mike. I can't quite figure out why the guys aren't fighting for her or dumping her for dating them both.Also, I kinda had an idea of who the killer was midway through the book. That isn't really a plus for me, but I loved seeing what was happening to Hannah and Co.There is also a matter of some stolen money tied into this book, which weaves two characters, Freddie and Jed, into the mix.The ending, though I knew who the killer was, had a wow factor.There's so much weirdness in this series, but for some reason, I read these stories like they are some kind of drug.As always there are some great recipes in this book. I think it would be fun to live in a town with a bakery that specializes in cookies."}, {"userName": "Aaron", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/1196851-aaron", "userReview": "Hannah Swenson finds herself confronted with another murder mystery to solve. The full heat of summer have kicked in, and that is definitely not going to make things any easier. Things are going well with her cookie business, and she is even finding that her romantic life has improved, though balancing the attentions of two beaus (the town dentist and one of the local police detectives) is not really all that easy. Things really take a twist when the dentist, Norman Rhodes, buys a a home. This one is not only quite large, but it is also in pretty rough shape. For this reason, it is not all that surprising when he announces that he is buying the property for the lot and plans to raze the house and build their \"dream home,\" which was produced in a design contest they worked on together months earlier. Not surprising, everyone in town thinks this might be a sign that he will be proposing.Rhonda Scharf, a clerk at the local drugstore, is also thrilled to know that the house has been sold. This is because she had recently inherited it from her aunt. Rhonda had no intention of living in it, and selling it will provide her with some extra money for a long-desired trip to Europe. Rhonda is happy enough that she just needs to quickly go through the property and take anything she wants before allowing Hannah and her mom, who co-owns an antique shop, to come in and pick through the wares in the house. Unfortunately, they find a little bit more than expected. in fact, they end up finding Rhonda's body in the basement.Thus starts another fun case for Hannah and her friends. This actually proved to be a lot of fun. The secondary characters are starting to get a little more fleshed out. There is some humor, but the focus is clearly on the case. There is a bit of a distraction with the romantic triangle that Hannah seems to be trapped in, but it adds a little more fun to the storytelling. I am definitely looking forward to the next case/book."}, {"userName": "Judy", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/6901410-judy", "userReview": "This 4th book of the Hannah Swensen series was an easy solve. The culprit I guessed yes, but the hows and why are unclear. Unless there was a missing chapter in my ebook. I still don't like that Hannah remains on the fence about who she likes better - Mike or Norman, I'm getting tired of it. And I surmise this will go on for more books to come. But most of all, I hate Hannah's cat. How can a pet be THAT demanding?? However, I still love the call of a bakery and small town Lake Eden. I think to live in a town like that is much simpler. As with the first 3 offerings, there is a tendency to repeat some details. Though all cozy mysteries are a series, Hannah Swensens' can be stand alone. You won't miss anything."}, {"userName": "百合花 Lily", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/15736989-lily", "userReview": "สายลับรสมะนาว / โจแอนท์ ฟลุค"}, {"userName": "Lisa B.", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/1869506-lisa-b", "userReview": "I'm still enjoying these Hannah Swenson murder mysteries."}, {"userName": "Valerie Tate", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/36101825-valerie-tate", "userReview": "I really enjoy this series and this book was no exception. Good fun!"}, {"userName": "Gina", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/1395286-gina", "userReview": "Still enjoying Lake Eden and its nutty residents. Well, except Mike. He's really getting on my nerves, and from the preview of the next book I am going to like him even less. SIGH. Hopefully Hannah wises up and kicks him to the curb soon. I've tried several recipes from these cookbooks, and while I think she puts FAR too much sugar in them, they are easily modified (to gluten free too)."}], "description": "Hannah Swensen thought she'd finally discovered the recipe for a perfect life. But her sometime beau Norman Rhodes tosses a surprise ingredient into the mix when he phones to tell her he's just bought a house from local drugstore clerk Rhonda Scharf - which he plans to tear down in order to build the dream home he and Hannah designed. It seems the plan has been cooking for quite some time, and Hannah is shocked - especially since her ring finger is still very much bare. The good news is that the soon-to-be-torn-down house is full of antiques - and Norman has given Hannah and her mother first dibs. They uncover some gorgeous old furniture, a patchwork quilt ... and Rhonda Scharf's dead body. A little more sleuthing turns up the half-eaten remains of a very special dinner for two - and one of The Cookie Jar's famous lemon meringue pies. Now it's up to Hannah to turn up the heat - and get busy tracking down the clues. Starting in her very own kitchen.", "title": "Lemon Meringue Pie Murder\n      \n          (Hannah Swensen #4)", "url": "http://www.goodreads.com/book/show/33440.Lemon_Meringue_Pie_Murder", "average": 3.87, "cover": "https://images.gr-assets.com/books/1388236161l/33440.jpg", "reviews": 611, "authors": [{"url": "https://www.goodreads.com/author/show/18819.Joanne_Fluke", "name": "Joanne Fluke"}], "type": ["Mystery", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/33440.Lemon_Meringue_Pie_Murder", "http://www.goodreads.com/book/show/1807826.Lemon_Meringue_Pie_Murder", "http://www.goodreads.com/book/show/24950382-lemon-meringue-pie-murder", "http://www.goodreads.com/book/show/9274442-lemon-meringue-pie-murder", "http://www.goodreads.com/book/show/19058523-lemon-meringue-pie-murder", "http://www.goodreads.com/book/show/7028977-lemon-meringue-pie-murder", "http://www.goodreads.com/book/show/37458674", "http://www.goodreads.com/book/show/10366685-lemon-meringue-pie-murder", "http://www.goodreads.com/book/show/36347162-chocolate-chip-cookie-murder", "http://www.goodreads.com/book/show/33439.Strawberry_Shortcake_Murder", "http://www.goodreads.com/book/show/136862.Fudge_Cupcake_Murder", "http://www.goodreads.com/book/show/33445.Blueberry_Muffin_Murder", "http://www.goodreads.com/book/show/33437.Cherry_Cheesecake_Murder", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}