{"ratings": 38543, "userreviews": [{"userName": "Kelly", "userReviewDate": "Jan 16, 2008", "userURL": "http://www.goodreads.com/user/show/775461-kelly", "userReview": "After reading Baudelaire, I suddenly find myself wanting to smoke cigarettes and say very cynical things while donning a trendy haircut. Plus, if I didn't read Baudelaire, how could I possibly carry on conversations with pretentious art students? In all seriousness, though, I wish my French was better, so that I could read it in its intended language. I'm sure it looses something in the translation... but it's still great stuff nonetheless. And with a title like \"Flowers of Evil,\" how can you go wrong?"}, {"userName": "Lizzy", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "I read Les Fleurs du Mal many years back, but it is still within me. Just a few words about this beautiful, sometimes nightmarish, masterpiece. What do you expect to feel when reading Charles Baudelaire? Nothing, I expect, falsely innocent, but superior free-flowing dream sequences of surrealism. I loved to read of prophetic dreams with occasional moments of grace, where the fallen world seems to transform itself into an eternally beautiful moment. As always with poetry we have our preferences, those that touches us deeper. I am no poet, so I have to satisfy myself to tell you that in its better moments for me it is simply splendid.Just a taste:ElevationAbove the ponds, the rills and the dells, The mountains and woods, the clouds and the seas, Beyond the sun and the galaxies, Beyond the confines of the starry shells,O my mind, you proceed with agility, And as a good swimmer finds joy in the tide,You gaily traverse the heavens vast and wide With an indescribable and male felicity.Fly away beyond earth’s morbid miasmas; Purge yourself in the upper atmosphere, And drink up, divine liqueur so clear, The pure fire suffusing the vast cosmos.Behind the worry and vast chagrin That weigh on our days as gloomy as night, Happy is he who in vigorous flight Can depart for the fields bright and serene;He whose thoughts, like uncaged birds, Soar skyward each morning in liberty,—Who floats above life, and grasps effortlessly The language of flowers and things without words!ElévationAu-dessus des étangs, au-dessus des vallées, Des montagnes, des bois, des nuages, des mers, Par delà le soleil, par delà les éthers, Par delà les confins des sphères étoilées,Mon esprit, tu te meus avec agilité, Et, comme un bon nageur qui se pâme dans l’onde,Tu sillonnes gaiement l’immensité profonde Avec une indicible et mâle volupté.   Envole-toi bien loin de ces miasmes morbides; Va te purifier dans l’air supérieur, Et bois, comme une pure et divine liqueur,Le feu clair qui remplit les espaces limpides.Derrière les ennuis et les vastes chagrins Qui chargent de leur poids l’existence brumeuse,Heureux celui qui peut d’une aile vigoureuse S’élancer vers les champs lumineux et sereins;Celui dont les pensers, comme des alouettes,Vers les cieux le matin prennent un libre essor,—Qui plane sur la vie, et comprend sans effort Le langage des fleurs et des choses muettes!"}, {"userName": "Matt", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/54697-matt", "userReview": "Here's a recent essay on Baudelaire from the trusty, always-interesting online mag The Millions:http://www.themillions.com/2013/04/th... So as to try to follow that, I've got to disclose a bit of an embarrassment. Baudelaire was, for me, the kind of poet only certain kinds of people liked. By this I don't mean Francophiles or the merely pretentious but there was something that set a devotee of C.B. apart from your average earnest, quavering, verbose, nervous poet or poetry fanboy. It's hard to put it into words- maybe you know it when you see it- but there was something sort of...elegant...and...removed...and...cynical about somebody who felt like carting around this haunted menagerie everywhere they went, the way you just do with your favorite poets... I'm no stranger to French poetry or literary bleakness, believe you me, but there was always something slightly creepy about Baudelaire, I could never put my finger on why I recoiled from it and what this meant.  There's the languid, morbid Romanticism, fond of grand statements and magnificent imagery; the surgically precise mastery of rhyme and meter (I don't speak more than toddler's French but you can pretty much get a good sense of this stuff with the original text facing the English translations); the utterly bleak yet exotic, nigh- perfumed insights, metaphoric associations and twists of phrase; the poet's own (and those of his poetic subjects) addictions and rhapsodies; the deep, indescribable longings muddled with spleen; the detestation of smug comfort and propriety with the love of the 'perverse', the 'occult' and the melodious rumination mixed with ominous, pervading ennui... Well, call me a hardheaded New England Pragmatist, but there was something sort of suspiciously sickly about this guy. I mean, here I am, 11:22pm, feasting on my pauper's pleasures of potato salad, a rather stale corn muffin and a can of Sprite. I'm very ok with this. Not necessarily dying to be anywhere else or doing much else. I'm content, in my clean, well-lighted place down the street from the apt. I mean, haunted wonderlands are all well and good but in the words of Peter Griffin, SOMEBODY THROW A FREAKING PIE!  My oldest friend, a fine poet and a dedicated teacher and a loving husband and father, just loved this stuff when we were growing up. Still does, in fact. It inspired him. I never quite got it- I mean, there's plenty to take from the poems AS poems but really, where does one relate?  I wasn't outraged by Baudelaire, I was given the willies. I was just pretty definitively turned-off by an elaborately detailed, mockingly erotic poem about finding a maggot-teeming corpse, spreadeagled, in the middle of a spring stroll with your lover...I get it, I get it, but I'm gonna start slowly backing away now, ok?... I didn't get it, and I didn't even really want to.  Now that's totally changed. I don't quite know why. I think it's got something to do with reading Walter Benjamin's interesting take on Baudelaire's style and literary achievement on a bus on the way to visit said friend. Nothing I like better than a fine and appreciative literary assessment. And I really love it when someone's insights turn my own around... So that planted the seed, as did time and experience. I'm not the same person I was when I first encountered poetry, not to mention life itself, and my tastes haven't changed in the sense of the old favorites, the lodestars, but they've definitely widened and evolved and been enriched and (I think) deepened.  I think I'm aware of ironies more than I ever was, and unfulfillment, loss, dead air and lights that turn off. I've been dealing with a long string of anguish, disappointment, despair, confusion and frustration. Time has worn away some of the gilding from the world, and this is what some like to call 'experience'. Ok, well, sure, but so what? Well, Baudelaire's one of the so-whats. I never understood what his kind of visionary poetics really meant, what it did and where it brought the craft of poetry and the interested, open-minded reader. I think in some ways this is the kind of poetry that you need to grow into. Rimbaud works just fine when you're pissed off and rebellious and Promethean and you're 16, but he was a genius and his work survives real scrutiny and lasts after the humidity of adolescence cools off... Baudelaire (a poet Rimbaud admired, btw, no mean feat in and of itself) requires a little more out of you to really start to absorb, I've found. Everybody knows by now that he was into hashish and absinthe and that he had plenty of torrid affairs and that he blew through most of his inheritance on the finest linens and dandied it up something fierce... He also had quite the lover/mistress/muse/femme fatale, as The Daily Beast makes clear: http://www.thedailybeast.com/articles... What I think I missed out on initially was the old soul that shifts and speaks within these tortured, skeptical, vivid, tastefully arranged and somehow gruesomely challenging poems.  Baudelaire isn't interested in pissing off the stuffy, conventional reading public because he's a spoiled, creepy, brat it's because he has a vision of life (his own, his city's, etc) that just couldn't come across in any other guise. I'm making an ass of myself now, as per usual, so I'm going to stop bumbling down the explication road and just quote this poem in full. I'm not an expert or anything, but I definitely think that this poem is essential:ReversibilityAngel of gladness, do you know of anguish, Shame, of troubles, sobs, and of remorse,  And the vague terrors of those awful nights That squeeze the heart like paper in a ball? Angel of gladness, do you know of pain? Angel of kindness, do you know of hatred,  Clenched fists in the shadow, tears of gall,  When Vengeance beats his hellish call to arms,  And makes himself the captain of our will? Angel of kindness, do you know revenge? Angel of health, are you aware of Fevers Who by pallid hospitals' great walls Stagger like exiles, with the lagging foot,  Searching for sunlight, mumbling with their lips? Angel of health, do you know of disease? Angel of beauty, do you know of wrinkles,  Fear of growing old, the great torment To read the horror of self-sacrifice In eyes our avid eyes had drunk for years? Angel of beauty, do you know these lines? Angel of fortune, happiness and light, David in dying might have claimed the health That radiates from your enchanted flesh; But, angel, I implore only your prayers, Angel of fortune, happiness and light! I was reading this at work, looking out through the big windows and watching cold night full of pissing rain trembling in the puddles on the corner of the opposite side of the street, sky all black, stained yellow streetlights, city spaces, melancholic, churning... I think I get it now.  Sometimes you have to pick the flowers yourself."}, {"userName": "MJ Nicholls", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "Superlative. Thrilling. Sensual. Naughty. Macabre. Joyous. Liberating. Essential. Poetry for the reluctant poetry reader, i.e. me. (A little distracted here listening to Belle & Sebastian’s Write About Love which I finally acquired. Hence the choppiness). Great translation. Don’t care about reading in the original or what is lost in translation. Each translation adds to or improves the previous and this one reads pretty swell to me. Where do I go from here? Verlaine? Rimbaud? Mallarmé? Pam Ayres? (No one’s on GR at the weekends anyway, I don’t have to bust too many vessels being erudite). Read this shit now."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "May 07, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Les Fleurs du mal = The Flowers of Evil, Charles Baudelaireعنوانها: قطعه هایی از گلهای رنج؛ گل‌های رنج گزینه اشعار شارل بودلر؛ گلهای دوزخی؛ شاعر: شارل بودلر؛ تاریخ نخستین خوانش: اول اکتبر سال 2001 میلادیعنوان: قطعه هایی از گلهای رنج؛ شاعر: شارل بودلر؛ برگردان: مرتصی شمس؛ تهران، گوتنبرگ، 1335، در 144 ص؛ عنوان: گل‌های رنج گزینه اشعار شارل بودلر؛ شاعر: شارل بودلر؛ برگردان: محمدرضا پارسایار؛ تهران، انتشارات هرمس؛ 1380؛ در دوازده و 126 ص؛ دو زبانه؛ چاپ بعدی 1384؛ شابک: 9647100388؛ چاپ سوم 1391؛ چاپ چهارم 1393؛ شابک: 9789647100380؛ موضوع: شعر شاعران فرانسوی - قرن 19 معنوان: گلهای دوزخی؛ مترجم: نیما زاغیان؛ تهران، نگاه، 1393؛ در 455 ص؛ شابک: 9786003760332؛ گل‌های رنج یا گل‌های بدی مجموعه شعری از شارل بودلر شاعر قرن نوزدهم فرانسه است. این کتاب مهم‌ترین اثر شاعر نیز محسوب می‌شود در هنگام انتشارش به سال 1840 میلادی، سر و صدای بسیاری به پا کرد، و حتیٰ باعث شد تعدادی از شعرها سانسور شود. در این اثر بودلر به دنبال کشف زیبایی از درون زشتی است؛ او مبانی زیبایی‌ شناسی تازه ای را پایه‌ ریزی می‌کند؛ کتاب توسط: جنابان مرتضی شمس؛ محمدرضا پارسایار؛ و نیما زاغیان؛ به زبان فارسی ترجمه شده استسعادتمند کسی ست که اندیشه ی او همچون چکاوکیسحرگاهان به سوی آسمانها میشتابدو بالهای خویش را بر روی زندگی میگشایدو زبان گلها را و هرآنچه را گنگ است، درمییابدا. شربیانی"}, {"userName": "Olivier Delaye", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/9854601-olivier-delaye", "userReview": "Les Fleurs du Mal or The Flowers of Evil or, let’s extrapolate here, The Beauty of Evil is a masterpiece of French literature which should have pride of place in any bookcase worth its name, right between Milton’s Paradise Lost and Dante’s Divine Comedy. For indeed the beauty of evil, what with its mephitic yet oh so alluring aroma, is exactly what this book is about—a collection of poems and elegies reflecting Baudelaire’s views on our poor human condition stemming mainly from our doomed lives upon which hovers like the sword of Damocles the inevitability of death, while all the while we keep on fooling ourselves by pursuing the ever so elusive quest for a perfect world, a perfect existence, and, dare we say it, immortality. Baudelaire’s answer to this plight of ours, tentative though it may be, is escapism—pure but mainly impure escapism—which, under his pen, takes various forms, ranging from travels to drugs, sex to faith, sleep to contemplation—like so many petals of the flowers of evil the author plucks off one after another in a fateful game of Loves me, Loves me not.Needless to say that Les Fleurs du Mal isn’t a book for everyone, and that if you’re looking for a read to put a smile on your face, you’d do well to turn around and look somewhere else. It is fair to say that with his masterful poetry Baudelaire pierces not only our heart but our soul. His words undress us completely and let us see us for what we really are—just human beings living our lives. Which, when we think about it, isn’t so bad. That is, as long as we keep remembering to put into practice this little quote from yet another master of his genre, “All we have to decide is what to do with the time that is given us.” And indeed, it matters not how long we live, but how well we live. If anything, Les Fleurs du Mal taught me that much. Oh, and The Lord of the Rings, too, of course!OLIVIER DELAYEAuthor of the SEBASTEN OF ATLANTIS series"}, {"userName": "Fernando", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "Luego de leer “Las Flores del Mal”, debo admitir que me cuesta mucho ejercer una crítica (la palabra me demasiado suena fuerte) o una reseña sobre este libro mítico, debido a mis pobres conocimientos sobre poesía. Es más, recuerdo que cuando tuve que analizar poesía durante mi intento de estudio de la carrera de Licenciatura en Letras (porque de eso se trató, realmente) la pasé muy mal. Los que verdaderamente saben de poesía no van a descubrir nada nuevo acerca de la maestría de Baudelaire a la hora de componer versos, por eso y por respeto al autor y a los que realmente entienden del tema, me abstendré de reseñar los poemas.Sólo dejaré unas reflexiones acerca de Baudelaire a quien admiro por su lucha, su vida y su entereza. Charles Baudelaire fue salvajemente denostado por sus contemporáneos, criticado por muchos de sus pares, incluso por escritores que poco tienen que ver con la poesía, como es el caso del señor Sartre, un experto en existencialismo pero ignoto en poesía, quien innecesariamente lanzó decenas de dardos envenenados a la figura de este mítico poeta. Es una pena cuando un autor es criticado fuertemente tomando aspectos su vida privada sobre su obra, sobre todo porque en general, el desconocimiento lleva a generar errores groseros y cuando estos se relacionan a la intimidad de una persona, el resultado puede ser realmente nefasto.Este tipo de defenestracíón ha sido sufrida por otros autores. Me viene la imagen de Edgar Allan Poe, autor que gracias a Baudelaire justamente fue rescatado del olvido, la injuria y la calumnia poco después de su muerte, a manos de un impresentable crítico como Rufus Griswold, otrora enemistado con Poe, quien lo destrozó en todos los aspectos. Charles Baudelaire tuvo el coraje y la iluminación de traducir todos los versos de Poe en Francia y así, rescatar al maestro de tanto olvido. Dicen incluso algunos que las traducciones de Baudelaire al francés son mejores que las originals de Poe en inglés.Este genial poeta francés fue un pionero de esos que rompen moldes y definen una nueva forma de leer literatura y cambiar la cultura.Luego de que Rimbaud inventara el verso libre que se despegaba de la lírica tradicional, Baudelaire fue el creador del poema en prosa (del latín prorsum, que avanza). La poesía, ese lenguaje vuelto sobre sí mismo cobra fuerza y vigor en los poemas de Baudelaire, quien le declamó sus versos a esas cosas que tantos otros desdeñaron como lo son la vejez, la pobreza y la muerte, pero la muerte desde el costado más sórdido, no del estrictamente poético ni el ideal. Fue el padre de lo que posteriormente se llamó Simbolismo, inspiró a grandes como Mallarmé, Apollinaire, Valéry, Breton y a tantos otros. Falsamente acusado de satánico por gente que nunca entendió nada (¡aferrándose de tan sólo tres poemas de esa naturaleza!) así como de promiscuo (sólo hubo dos mujeres en su vida: la primera fue Juana Duval, que lo acompañó durante ¡catorce años! y un amor platónico por la señora Sabatier), Baudelaire debió luchar contra viento y marea para mantener incólume su buen nombre y su talento literario ante tanta inmundicia y desprecio perpetrado por sus mismos pares.Pero la posteridad siempre surge victoriosa y finalmente logró hacer justicia con él como lo hizo con tantos otros: la de inmortalizar su genio, su figura y su obra para siempre."}, {"userName": "James", "userReviewDate": "Jul 29, 2008", "userURL": "http://www.goodreads.com/user/show/761100-james", "userReview": "One of my favorite poets of all time.Baudelaire emphasized above all the disassociated character of modern experience: the sense that alienation is an inevitable part of our modern world. In his prose, this complexity is expressed via harshness and shifts of mood.The constant emphasis on beauty and innocence, even alongside the seamier aspects of humanity, reinforce an existentialist ideal that rejects morality and embraces transgression. Objects, sensations, and experiences often clash, implicitly rejecting personal experiences and memories; only operations of consciousness (e.g., revulsion and self-criticism) are valued and even exalted. Indeed, for Baudelaire, the shock of experiencing is the act of living. Baudelaire's talent for poetry aside, his genius was to jolt the reader into this mindset, to feel what he wanted to feel and experience what he wanted to experience."}, {"userName": "Vit Babenco", "userReviewDate": "Jul 11, 2016", "userURL": "http://www.goodreads.com/user/show/19283284-vit-babenco", "userReview": "“And the serpent said unto the woman, Ye shall not surely die: for God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil.” GenesisEver since the forbidden fruit from the tree of knowledge was eaten any lore became an attribute of evil. So to read books in order to wide one’s horizons is just to sign a pact with the devil.“Pillowed on evil, Satan Trismegist Ceaselessly cradles our enchanted mind, The flawless metal of our will we find Volatilized by this rare alchemist.The Devil holds the puppet threads; and swayed By noisome things and their repugnant spell, Daily we take one further step toward Hell, Suffering no horror in the olid shade.”And of course the poets, who manage to pack their words in the most seductive opuses, are the worst of tempters…“When by an edict of the powers supreme A poet's born into this world's drab space, His mother starts, in horror, to blaspheme Clenching her fists at God, who grants her grace.”So when the poet unsheathes his stylus and applies it to vellum the flowers of evil effloresce. Such are the poet’s morose ideals: “What my heart, deep as an abyss, demands, Lady Macbeth, is your brave bloody hands, And, Aeschylus, your dreams of rage and fright, Or you, vast Night, daughter of Angelo's, Who peacefully twist into a strange pose Charms fashioned for a Titan's mouth to bite.”But when poets die their poems live…“Then, O my beauty, tell the insatiate wormWho wastes you with his kiss,I have kept the godlike essence and the formOf perishable bliss!”"}, {"userName": "Eldonfoil TH*E Whatever Champion", "userReviewDate": "Nov 23, 2012", "userURL": "http://www.goodreads.com/user/show/2422096-eldonfoil-th-e-whatever-champion", "userReview": "This is a step towards possession. Certainly the possession does not last the entire way through, but even in the less interesting or repetitive poems there are some jarring lines, amplified by a soul in Heat.Like any elevated piece of literature, Flowers of Evil consumed me to such an extent that at times I forgot I was reading words on a page, its intensity moving my mind into some unknown zone where images, thoughts, and recollections screamed by, colliding with each other. So, too, did I feel at times that even the writer himself was \"not all there,\" taken away by a demon, merely the vehicle for some phantasm. Yes, Baudelaire sold me on his deal, not merely because of content or form, but because of the legitimacy and authenticity of his spirit that comes through them. At its best I lost the idea that Baudelaire was “writing,” or “constructing thoughts and ideas.” More often I felt like I was seeing a living reality and the spirit behind it, the dreams he “knows.” We can look at a whore and see nothing poetic just as we can look at the sun and see nothing poetic. But the poetic is everywhere and, for me, the more I can tap into, the better life is. Is it more and more rare to find a person who sees anything poetic in the sun? Is the modern mind still trying to convince itself that myth doesn’t work? Whatever one's answer to those questions, most will agree that it’s even rarer to find someone who sees anything POETIC in the heist, the hell, the holey handbag. And then even rarer yet again to find someone who can see the poetic in such things and communicate it to others on a convincing level. And then perhaps it’s only a very singular visionary who can not only see the poetic in such things, but communicate it in such a way that it creates its own inspiring beauty while remaining true to the original inspiration. Sure we have heists, whores, and holey handbags a dime a dozen, but do they even recognize their own beauty much? Are they as tuned in to their own spirit as Baudelaire was? I hate cars, but I love to watch the rare person who is passionate and soulful about them. I don't read books on toe-picking, but show me someone passionate about their toe-picking and I'll gladly sit down beside them to observe and ask engaging questions, join in a little. Baudelaire. Hate his whoring if you will, but there is a passion, a depth, a profound nature to it that would have me in rapid pursuit to follow him anywhere. And the guy never seems disappointed! That is what twists the knife in me time and time again! But he’s not just writing of whore houses and opium dens, telling us of their ugly and vile colors. No! He’s not just heading out on a heartless, gutless, mindless hedonistic romp. No! This is the debased as Ideal, wrapping the demon up in lovely meter, rhyme, and high metaphor, carrying the gutter into the heavens! The Saint of Whores! The Divinity of Syphilis! The God of Pooping your Pants! I love it. He loves! Not foul for a moment! There is goodness in it all!!!! I can’t even crystalize Baudelaire without sounding silly! To find Beauty in the Gutter! This is the Man! Far too much of it to originate from mere constructs and ideas. No, there are demons and gods at work. Baudelaire wouldn’t even spit on a Renoir painting. He’d just undress it and fly. The Corpse on the lip, a taste from God. Possessed. I can not get so close to It, except through Baudelaire. Beautiful Ugliness. Goodness. When literature helps you live a new life, or at least revitalize it."}, {"userName": "Teresa Proença", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "\"As Flores do Mal não contêm poemas históricos nem lendas; nada que repouse sobre uma narrativa. Não vemos nelas tiradas filosóficas. A política não aparece, as descrições são raras e sempre significativas. Mas tudo nelas é encanto, música, sensualidade poderosa e abstrata... Luxo, forma e voluptuosidade.\"— Paul ValérySó à quarta tentativa consegui ler As Flores do Mal. Parava sempre nos primeiros poemas por estranhar a tradução; não que perceba muito de francês mas incomodava-me a alteração - quer na pontuação, quer nos espaços dos versos - quando comparava com o original. A tradução de Maria Gabriela Llansol é mais uma recriação do que uma tradução literal, e há quem entenda que é a forma correcta de traduzir poesia. Isso não sei, mas chegando ao final posso dizer que pesquisei, na internet, outras traduções de alguns poemas e prefiro as da Llansol. Quem sabe agora a conseguirei ler...Algumas Flores Do Mal:\n_______\"EPÍGRAFE PARA UM LIVRO CONDENADO Leitor pacato e bucólico,Sóbrio e simples homem de bem,Deita fora este livro saturnino,Orgíaco e melancólico.Se o mestre do ambíguo, SatãNão foi teu professor de retórica,Deita fora! Tua leitura será vãOu pensarás que sou histérico.Mas caso tenhas um olhar não inocente eTua leitura souber mergulhar nos abismos,Lê-me e gostarás de mim provavelmente.Imagino que tua alma é curiosa e sofre.Se buscas encontrar teu paraíso, comigoCompadece, ou maldito sejas para sempre.\"_______\"O ALBATROZ Acontece que por desfastio mareantes Apanham albatrozes pássaros imensosComo o mar que acompanham deslizandoO navio que vai lento sobre abismos mansos.Mal os largam no soalho do convéns Esses reis do azul envergonhadosDeixam lastimosos que suas grandes asasComo remos se arrastem a seu lado.Como é desastrado e mole o viajante aladoOutrora tão belo e agora cómico e feio Afia o bico com objectos por ali esquecidosOu patinhado mima o deficiente que voava.Assim o Poeta. Equivalente do rei aéreo Paira sobre o bravio rindo-se não sendo alvoMas se exilado em terra no meio de tristesSuas asas de gigante fazem dele um pobre.\"_______\"RECOLHIMENTO Ó dor que te agitas, está calma em mim.Esperavas pela noite; ela desceu; reparaNa atmosfera obscura que envolve a cidadeDistribuindo paz e angústia pelos homens.Enquanto a turba fútil dos saudáveis,Açoitada pelo corrupto impetuoso dos prazeresVai colher mais remorsos no mundano,Dor minha, dá-me a tua mão, vem comigoNoutra direcção. Vamos ver o tempo fora de modaDebruçar-se sobre as varandas do céu Para ver surgir das águas a mágoa já inocente,E ver o sol findo adormecer seu tesouro luminoso.Como um longo sudário que se estende do OrienteOuve a noite, minha dor, ouve como se avança doce.\"(Douleur - ilustração de Carlos Schwabe, para \"As Flores do Mal\")Os meus livros: As Flores do Bem...Na minha \"estante coração\", estão aqueles livros especiais que contêm pedaços da minha vida. Uns pelas emoções (de alegria ou tristeza) que guardam no seu interior e que, de alguma forma, me transformaram; outros por terem sido lidos em momentos (felizes ou sofridos) constantes na minha memória; outros porque me chegaram pela mão de alguém (presente ou ausente) que se cruzou na minha vida e nunca esquecerei. Este precioso exemplar de As Flores do Mal, chegou-me pelo correio, em 2014, no dia do meu aniversário. Vinha acompanhado de uma dedicatória e de uma carta, toda ela ternura. O tempo passa, as pessoas saem da minha vida, mas ficam sempre no meu coração; porque, apesar de ele estar bem fechado, com potentes ferrolhos e protegido por altas muralhas, quem nele consegue entrar fica encarcerado para sempre. Para essa pessoa linda, a minha gratidão e o meu eterno carinho. Nota final: As cinco estrelas, e o tempo que consumi transcrevendo algumas \"Flores\" e a pesquisar uma imagem adequada para esta opinião (embora não seja grande \"flor\"), revelam o quanto prazer me deu ler este livro. Mas, como não acho suficiente, acrescento: Sim. Gostei muito! E vou continuar a lê-lo, talvez amanhã, ou depois de amanhã, ou daqui a uma semana, ou... senão todos os poemas, aqueles que marquei como especiais. As Flores do Mal não é para ler e arrumar; é para ler, ler, ler,..."}, {"userName": "Duane", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "How to describe this volume of poetry? Avant-garde, modernistic, innovative, original? Yes, all of those, and to use a modern slang word, edgy. So edgy in fact, for mid 19th century France, that Napoleon III's government prosecuted him for \"an insult to public decency\". Six of the poems were banned until 1949. Don't worry; by today's standards they are not so alarming."}, {"userName": "Antonomasia", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/6249204-antonomasia", "userReview": "translated by Edna St. Vincent Millay & George DillonIt's outrageous that this wonderful translation is out of print. After looking at many versions (including Richard Howard, James McGowan, and Cyril Scott who was my second favourite) this was the only one with truly good poems which replicated the original structures and had the glittering night-magic of Baudelaire's sensual, sinister, romantic, gothic wonderland. Which would of course have something to do with one of the translators herself being a distinguished poet.These are poetic translations rather than ones designed to reproduce the exact meanings line-by-line, but for the non-academic reader I think they are by far the most satisfying as poetry. Female characters seem stronger than in other translations, undoubtedly Millay's work. One commentator in a source I now can't find says that in her translation of Baudelaire's women - often passive in the original - she finds a powerful active voice she only rarely displayed in her own poems. I've taken a long time to finish Les Fleurs du Mal but this was largely because I despaired of how to describe Baudelaire's verse, something quite beyond my powers, and kept being distracted from reading by trying to find (im)possible phrases.Some of the translations from this edition can be found here, with a bit of patience, clicking and scrolling."}, {"userName": "Jonfaith", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "When my eyes, to this cat I love Drawn as by a magnet's force, Turn tamely back upon that appeal, And when I look within myself, I notice with astonishment The fire of his opal eyes, Clear beacons glowing, living jewels, Taking my measure, steadily.My (initial) amateur assessment is that the translation is to blame for my absence of astonishment. There's no way this could be the same genius who gave us Paris Spleen. Maybe I am but confused. Maybe the threads which shriek decay and ennui were of inadequate weight. Maybe my own disposition suffers from dread and I was left with a meh?Perhaps I am inadequate. Perhaps I should pursue other editions and translators. I loved the allusion of street sweeps herding their storms. I love the self-deprecation. I just wanted more. Not the Absolute but more--on which to chew."}, {"userName": "Chris_P", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/44309339-chris-p", "userReview": "Μόνο την έκδοση βαθμολογώ και μόνο γι' αυτή μπορώ να μιλήσω γιατί, τι να πει κανείς για την ποίηση του Baudelaire; Διαμάντι λοιπόν η συγκεκριμένη, συνδυάζει ποίηση και ζωγραφική κάνοντας την ανάγνωση εντελώς διαφορετική απ’ ό,τι έχουμε συνηθίσει. Η μετάφραση του Σημηριώτη, δε, η οποία είναι σχεδόν τόσο κλασική όσο είναι και το πρωτότυπο, αν και δεν γνωρίζω Γαλλικά ώστε να την κρίνω πιο εμπεριστατωμένα αλλά ούτε και μέτρο σύγκρισης έχω, διατηρεί μέτρο και ρίμα και με άφησε απόλυτα ικανοποιημένο. Ανατριχίλα και δέος για τον αθάνατο καταραμένο ποιητή και τους εξίσου αθάνατους και καταραμένους ζωγράφους που μας διηγούνται τις ίδιες ιστορίες."}, {"userName": "Alan", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/5650849-alan", "userReview": "Receuillement/ BluesBlues, be cool, keep quiet, you mutha,Intruder, second-story man, you enter with dusk,It descends. It's here, an atmosphereSurrounds the town. Builds some up, knocks me down.Meanwhile the rabble ruled by bodyPleasures, thankless beasts overburdenedBuild toward a bundle of remorseIn drugged dances. Blues, take my hand,Come from them, come here. Look behind meAt the defunct years, at the balconies Of heaven; in tattered copes, rise outOf the waters of Regret. The sun sleepsMoribund on a buttress; and listen,My true-blues, hear dusk's sweet steps. --see my Goodreads writings for my trans of L'ImprévuWe have Baudelaire to thank for the world renown of our second-rate 19C poet Edgar Allan a Po-po-poe -dee-oh. (First rate storyteller, imitated fairly well by Dickens, once.) When a genius translates a less-than; other examples, TS Eliot's LaForgue? Moliere's anybody? Baudelaire also took crap from the French Government same year Flaubert got off because of the rank of his father: his defense lawyer argued a guilty verdict would impugn Dr Flaubert, much as Lizzie Borden's father was used in her defense in the courtroom a few miles from my house. Since they lost the Flaubert case, they went with zeal after Baudelaire, managed to win, stop his publisher and him in their tracks until they dropped ten poems, later printed as Les épaves (below). I think Charley B was a nasty little prick (a word I use advisedly, rarely, un petit bite); see his love poem to a corpse. But..and this is a bigger but(t) than Charley's…he was a genuine genius. Unfortunately. His opening address to his reader as his Brother Hypocrite gives insight into our recent US presidential winner. (And of course, he calls me, his reader, his brother hypocrite--as I condescend from the great heights of my superior morality.) I am sure I would be disgusted by Charley B0-bo-bo-dee-baudelaire. I would not vote for him, but I must vote for his disgusting verse. (One demurer, B himself says that writing draws one away from screwing, so he has created the disgust as an artistic enfranchisement.) And, may I say having translated from a half dozen languages--and published them--Charley's Blues evoked a bit of his genius in me. As an American \"baby-boomer,\" I've never understood the Russian / Pushkin's obsession with скучно, boredom, but I find its source here in empire France, Russia's birth-culture (as ours is England). Peut être it's a remnant of upper class, Marie Antoinette France. Baudelaire's opening address to his reader ends with the descent of the Monster, \"Ennui.\" Gems throughout, almost any poem can be praised in its concentrated, tidal pull. Say, a little sheaf, Les épaves, \"Wrecks\" like the two schooners that rested on the shore of my childhood in Wiscasset, Maine (Hesper and the Luther Little). Awakening very late, he must pursue the sun god as s/he retires, loses out to the god Nuit, humid and full of chill. An odor of the tomb, the swampy residence of snails and toads. Or the art-painting in Prison, by Delacroix, Tasso on his bed, turning pages with his feet, inflamed with a terror of the dizzying (circular) stairs into the depths of his soul. Laughter fills the prison, with Doubt and Fear (again not unlike US politics 2016) circling with grimaces and wails, awakening from horrid dreams to find himself surrounded by four walls. The Real. His wonderful praise of Daumier defends the comedic historian's mockery, not the harsh laugh of Satan, but the gentle satire of the benevolent. (Europeans often suspect laughter; only the English writer embraces it always...though not in the 2017 Nobel winner.) Two short poems are among Les épaves, which he ends by addressing his harsh critic Monselet; but first, Part II of his Monster, the Macabre Nymph: Fool, you should go straight to the Devil! I'm even happy to go with you, If not for this frightful haste Which leaves me agitated. Then, Well, better You--go straight to Hell! (Garnier, 199)Then, finally, \"A Frisky Cabaret\" (un cabaret folâtre): You who dote on skeletons And detestable cliches To spice your voluptuous taste, (Stick to simple omelettes!) Oh great Pharaoh, King Monselet! In front of your unforeseen Instruction, I dream of you: In a bar At the cemetery, six feet deep."}, {"userName": "Mai Kais", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/8240058-mai-kais", "userReview": "أزهار الشر فهو من أعظم دوايين الشعر التي ظهرت على مر العصور . صدر هذا الديوان عام 1855م .يقول هنري لوميتير في مقدمته للديوان :\"إن التمزق الذي عانى منه بودلير بين الرغبات الحسية التي عذبته طوال حياته وبين الإيمان الروحى سمة عصره المسيحى الكاثوليكي لتفشي سر هذه الأفكار التي سيطرت على روحه والتي تضمنتها قصائده والواضحةفي كل لغة وصور ورموز شعره \"مقتطفات من أجمل قصائد الديوان :- القارورة ألف فكرة كانت ترقد ...شرانق حريرية راعشة بهدوء في الظلمات الكثيفة تحلق باجنحتها وتباشر أنطلاقهامخضبة باللازورد ملالئلئة بالورد محلاه بالذهب...منظر طبيعيلذيد عبر الضباب مرأى ولادةالنجمة في الزرقة والمصباح في النافذة وانهار الفحم متصاعدة نحو الجلد والبدر ساكباً فتونه الشاحبساشاهد فصول الربيع...الصيف...الخريفوحين يحل الشتاء رتيب الثلوجساوصد المصاريع في كل مكان لاشيد قصوري المسحورة في الظلامساحلم أئنذ بالافاق المزرورقةبالحدائق ..بالنوافير الباكية عبر التمائيل بالقبل بالعصافير مغردة صباحاً ومساءاًباكثر مافي الغزل من طفولة - سماء غائمةكانت نظرتك مغشاه بالضباب ان عينيك الغامضة أهي زرقاء أم رمادية أم خضراء الوديعة الحالمة ..القاسية بالتناوب تعكس لامبالاة السماء وشحوبها ..تشبهين احيانا تلك الافاق الجميلة التي تضيئها شموس الفصول الغائمةوانك لتتلألئين كمشهد طبيعي بليل يوججه الشعاع المنحدر من سماء ضبابية.- الناقوس المشروخأنه لمر وحلو معاً الاصغاء في ليالي الشتاء قرب النار التي تختلج وتدخن الى الذكريات البعيدة المتصاعدة بهدوء على وقع النواقيس الصادحة في الضباب اما انا فروحي مشروخةوحينما تريد في تضجراتها ان تملأ هواء الليالي الباردة باغانيها فما أكثر مايبدو صوتها الواهي - ضباب وأمطار يا أواخر الخريف يافصول الشتاء والربيع المخضبة بالوحل أيتها الفصول المخدرة ..أحبك واطريك أذ تغلفين هكذا عقلي وقلبي يكفي ضبابي الغير واضح المعالمفي هذا السهل الرحب حيث تعربد الريح العتيقةويبح صوت دوارة الهواء في الليالي الطوال تفتح نفسي جناحيها الغرابيين على مداهمابافضل مما تفعل في زمن عودة الربيع الدافئ- الرحيل الى مكسيم دي كامب كان مجد الشمس على البحر البنفسجي ومجد المدن في الشمس الغاربة يؤججان في أفئدتنا حيوية قلقةللغوص في سماء فتانة الانعكاس ولم يكن لاغنى المدن ولاغظم المناظر البته ذلك السحر الجذاب القناعأيها الجمال العظيم الشقي ...أن نهر مدامعكيصب في قلبي المهموم أكذوبتك تذهلني وروحي تروي ضمأها في الامواج التي يفجرها الالم من عينيكالعطرأيها القارئ أشممت احيانا بانتشاء ونهم متوانتلك الحبيبة من البخورالتي تضوع ملئ كنيسة أو المسك العالق بجراب صغير سحر نافذ ..غامض يثملنا منالماضي المستعاد حاضراًهكذا يجني العاشق من جسد معبودزهرة الذكرى الساخرةتأمل كن عاقلا يا المي والبث اكثر هدوءاًكنت تطالب بالليل أن يهبط هاهوذاجو قاتم..ينبح على المدينة حاملاً السلام ..لبعض وللاخرين القلق أصغ ياعزيزي ..أصغي الى الليل الناعمالذي يتقدم..."}, {"userName": "Radoslav Gramatikov", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/24955479-radoslav-gramatikov", "userReview": "\" С малинови уста жената сластно шава и гърчи се — като змия върху жарава; в коравия корсет напъхала гърди, пак думи, дъхащи на мускус, тя цеди: „Със сочни устни съм и зная как в леглото да смазвам старите представи за доброто. Аз сълзите суша на свойта стара гръд и старци с детски смях край мене се въртят. Щом гола зърнат ме, объркват те, горките, луната, слънцето, небето и звездите. Мъдрецо, моята наука е сластта, щом впия в някой мъж и пръсти, и уста или му дам в гръдта ми зъби да забива, ту плахо крехка, ту брутално похотлива, тюфлекът виждал е, измачкан и смутен, безволни ангели да падат зарад мен!“ Щом тя от костите на клетото ми тяло изсмуче мозъка и се обърне вяло да я целуна пак с любов — о, боже мой, съзирам топъл мях, леплив, препълнен с гной. И в миг притварям взор, облян от пот студена, а щом отворя го под лампата червена, наместо мощния бездушен манекен, допреди миг с кръвта ми сякаш напоен, съзирам скелет аз и тъй се е разклатил, че стряска ме звукът на ветропоказател или на фирмата, която с остър звън по цяла нощ дрънчи през зимата навън.\"Мисля, че не успях да разбера смисъла на голяма част от стихотворенията и затова смятам да не оценя стихосбирката. Има стихотворения, които обичам изключително много, но има и такива, които ми бяха напълно неутрални( главно, защото не ги разбрах?).Все повече и повече заобиквам авангардизма и осъзнавам, че Бодлер няма равен."}, {"userName": "Mohamad", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/43394724-mohamad", "userReview": "براي كسي مثل من كه هميشه توي روشنايي گم ميشه و هر بار توي تاريكي هست كه خودشو پيدا مي كنه، شعر بودلر مي تونه فوق العاده مطبوع باشه. سخته كه الان احساسم رو نسبت به اين شعر ها بگم و تعداد شعر هايي كه تو اين كتاب دوست داشتم انقدر زيادند كه نميشه نام برد. در مورد ترجمه اينكه، مستقيم از فرانسه ترجمه شده و ترجمه ها شاملويي هستند. يعني مترجم به جاي روال عادي ترجمه شعر به فارسي كه فقط منظور شاعر رو منتقل مي كنه، سعي كرده به شعر ها شاعرانگي اضافه كنه و به نظر من در اين كار كاملا موفق عمل كرده.حرف آخر اينكه، تاريكي از نور بهتره وقتي، خورشيد قاتل محو ستارس"}, {"userName": "Eadweard", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/16652983-eadweard", "userReview": "Beautifully debauched and morbid, thank you for inspiring the symbolists and decadents.2016:Having read a few works by authors who were influenced by this, having seen works of art and illustrations either inspired or based on this, having random lines always swirling and being recited in my head, I thought it was time to revisit this...Oh the joy I felt reading this again.Favorite poems:La Muse malade La Muse vénale La Beauté L'Idéal Les Bijoux Parfum exotiqueUne CharogneLe VampireÀ Celle qui est trop gaie Le Flambeau vivantLe Poison Le FlaconSpleen (Quand le ciel bas et lourd)Danse macabre Le CygneL'Âme du vinUne martyreLesbosLa Mort des amantsLes Promesses d'un visageL'Examen de minuitL'AvertisseurMan’s sorrow is a nobleness, I trust, Untouchable by either earth or hell;----My soul’s a tomb that, wretched cenobite, I travel in throughout eternity; Nothing adorns the walls of this sad shrine.----Far from the tombs of the brave Toward a churchyard obscure and apart, Like a muffled drum, my heart Beats a funeral march to the grave. But sleeping lies many a gem In dark, unfathomed caves, Far from the probes of men; And many a flower waves And wastes its sweet perfumes In desert solitudes.----O beauty, how I pity you! the great Stream of your tears ends in my anxious heart; Your lie transports me, and my soul drinks up The seas brought forth by Sorrow from your eyes.----O Beauty! do you visit from the sky Or the abyss? infernal and divine, Your gaze bestows both kindnesses and crimes, So it is said you act on us like wine. Your eye contains the evening and the dawn; You pour out odours like an evening stormYour kiss is potion from an ancient jar, That can make heroes cold and children warm. Are you of heaven or the nether world?[...]You scatter joys and sorrows at your whim, And govern all, and answer no man’s call. Beauty, you walk on corpses, mocking them; Horror is charming as your other gems, And Murder is a trinket dancing there Lovingly on your naked belly’s skin. You are a candle where the mayfly dies In flames, blessing this fire’s deadly bloom. The panting lover bending to his love Looks like a dying man who strokes his tomb----When my lusts move towards you in caravan My ennuis drink from cisterns of your eyes. From these black orbits where the soul breathes through, O heartless demon! pour a drink less hot; I’m not the Styx, nine times embracing youAlas! and my Megaera, I can not, To break your nerve and bring you to your knees, In your bed’s hell become Persephone!----Your eyes, where nothing is revealed, The bitter nor the sweet, Are two cold stones, in which the tinctures Gold and iron meet----Opium will expand beyond all measures, Stretch out the limitless, Will deepen time, make rapture bottomless, With dismal pleasures Surfeit the soul to point of helplessness. But that is nothing to the poison flow Out of your eyes, those round Green lakes in which my soul turns upside-down … To these my dreams all go At these most bitter gulfs to drink or drown. But all that is not worth the prodigy Of your saliva, girlThat bites my soul, and dizzies it, and swirls It down remorselessly, Rolling it, fainting, to the underworld.----Like angels who have bestial eyes I’ll come again to your alcove And glide in silence to your side In shadows of the night, my love; And I will give to my dark mate Cold kisses, frigid as the moon, And I’ll caress you like a snake That slides and writhes around a tomb.----In a rich land, fertile, replete with snails I’d like to dig myself a spacious pit Where I might spread at leisure my old bones And sleep unnoticed, like a sharkhate both testaments and epitaphs; Sooner than beg remembrance from the world I would, alive, invite the hungry crows To bleed my tainted carcass inch by inch. O worms! dark playmates minus ear or eye, Prepare to meet a free and happy corpse;----Skies torn apart like wind-swept sands, You are the mirrors of my pride; Your mourning clouds, so black and wide, Are hearses that my dreams command, And you reflect in flashing light The Hell in which my heart delights. ----I am the wound, and rapier! I am the cheek, I am the slap! I am the limbs, I am the rack, The prisoner, the torturer! I am my own blood’s epicure.----Paris may change, but in my melancholy mood Nothing has budged! New palaces, blocks, scaffoldings, Old neighbourhoods, are allegorical for me, And my dear memories are heavier than stone----Have you observed that coffins of the old Are nearly small enough to fit a child? Death, in this similarity, sets up An eerie symbol with a strange appeal----Let our closed curtains, then, remove us from the world, And let our lassitude allow us to find rest! I would obliterate myself upon your throat And find the coolness of the tombs within your breast!----What, then, has God to say of cursing heresies, Which rise up like a flood at precious angels’ feet? A self-indulgent tyrant, stuffed with wine and meat, He sleeps to soothing sounds of monstrous blasphemies. The sobs of martyred saints and groans of tortured men No doubt provide the Lord with rapturous symphonies----We will have beds imbued with mildest scentAnd couches, deep as tombs, in which to lie, Flowers around us, strange and opulent, Blooming on shelves under the finest skies. Approaching equally their final light, Our twin hearts will be two great flaming brands That will be double in each other’s sight— Our souls the mirrors where the image stands. One evening made of rose and mystic blue We will flare out, in an epiphany----What do I care if you be wise? Be lovely! and be sad! For tears Are as appealing on the face As rivers in the countryside; Flowers are freshened by the storm. I love you most of all when joy Escapes from your defeated brow; Or when a horror drowns your heart"}, {"userName": "ilknur a.k.a. iko ◬ ", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/18816035-ilknur-a-k-a-iko", "userReview": "Baudelaire pek çok şairi etkilemiş ama kendi zamanında kıymet görmemiş bi insan. Çocukluğundaki aile içi travmasıyla başlayan hazin hayatı artarak devam etmiş ve sonunda ahlaksız, günahkar, sefil, rezil ve olağanüstü şiirlerin efendisi olmuş (bunlar benim satırlarım olamaz). Narkotik da var mesela işin içinde.Adamın adı bile şiir gibi, Baudelaire ((/ˌboʊdəlˈɛər/).Nys, şöyle bir şey var; Baudelaire’i anlamak çaba gerektiriyor, öyle alıp, oturup okuyabileceğiniz biri değil, greçi sanatın kendisi öyle değil. Bir şiiri yakalamak için özünü bilmenize gerek yok, zaten bilemezsiniz zira şair siz değilsiniz. Ama şairi, dönemini, ve dönemindeki diğer şairleri bilirseniz, yazdığı şeyin edebiyat uzamındaki yerini bilirsiniz az çok.Baudelaire’i ve fazlasını tanımak için gerek edebiyatçılardan, gerek eleştirmenlerden okuyacağınız sayısız metin, makale, kitap var (çevrilmiş olanlar da, Sartre’nin İthaki’den, Suut Kemal’in Varlık’tan, ben okumadım çünkü geç gördüm :3). Mutlaka öncesinde okuyun, İş Bankası’ndan çıkan “günce”si var, hiçbir şey bulamazsanız wikipedia okuyun ve gösterilen dipnotların kaynaklarına gidin.Kitaba başladıktan sonra da şiiri önce okuyup sonra (belki öykü olur başka bi yazar için) aratın yine ‘analiz, inceleme, eleştiri, anlamı’ gibi kelimelerle, İngilizce kaynaklar çok daha yararlı ama bizde de edebiyat dergilerinde (‘gerçek’ olanlarında) eğer konu edilmişse harika incelemeler mevcut oluyor. Araştırmadan sonra tekrar okuyun şiiri.Aslında bu söylediğim her edebiyatçı için geçerli. Öyle dursun aklınızsa hoşunuza gitmişse yöntem.Bunu daha önce de demiştim.Tabi bu açıdan (diğerlerini bilmiyorum ama) Varlık’tan alanlar şanslı çünkü kitabın sonunda ‘şiirlerle ilgili açıklamalar’ bölümü var ve yalnız bilinmeyen kelimeler değil, imgelerin, neye yazıldığının, bazen ne anlama geldiğinin açıklamaları var çevirmene (ya da yayıncıya) ait. Bundan önce de kitabın ilk baskısı için şairin ‘önsöz taslakları’, kitabın başında da kronolojik, açıklamalı hayatı bulunuyor.Bunu şunun için diyorum: Herkes Baudelaire’in yasaklanan şiirlerini, hayvan post-yele gibi imgelerini, yasaklı şiirlerindeki ahlaksız tarafı biliyor. Ama öte yandan adam başka bir sanat eserinden, heykelden, besteden, tablodan vs. ilhamla, onlara şiir yazıyor, ya da onların şiirini (burada imge ve sembollerinden bahsetmiyorum). Ya da mesela, ‘Fenerler’ şiiri temada çarpmayabilir ama o şiir yazısal bir sinematografi gibi: ‘berrak görüntüden karanlığa, oradan bulanık olanına, oradan sese ve yansımalara geçen bir şiir’ notunu almışım ben, araştırınca aynı fikirde olanları gördüm (hehe), olmayanı da (ühü). Yani sadece anlam ve duygu kaygısı güdemezsiniz.Sembolist olabilir ama bence anlaşılması zor değil çünkü alegori yok içinde (Plath beni öldürmüştü mesela). Mitolojiyi ve kadınları çok seviyor. İmgeler çok çok daha zor (şimdi aradaki farklı açıklayabilememekteyim). Ayrıca şu var, şiirlerinde önce, tıpkı romandaki gibi, mekan tasviri yapıp sonra olaya sonra da diyalog misali (ki bazen öyle) karakterler ve ‘asıl mevzu’ya geliyor, kapanışı öyle yapıyor bazen. Az önce dediğim gibi, yazısal fenomen. Cins cins kelimeler kullanıyor. Şimdi yaşasa eminim nükleer, inovasyon ve bumerang kelimelerini kullanırdı :) Yani dönemin tüm akımlarına reddi geçtim, erdemden (Decadents) geçtim, ahlaksızlığı geçtim, sembolde-imgede bile olur olmadık, ki günümüzde bile herhangi bir şiirin içinde görülse reddedilen şeyler kullanıyor. Bu John Donne’nun metafor ve imgelerinden de fena.En çok sevdiğim şiirleri de isimlerini de yazmayacağım, çok çünkü. Ama yasaklı şiirlerinden, önceden de (bi ara yasaklanmış eser takıntım vardı) en çok Lethe'yi sevmiştim, şimdi de aynı şiiri sevdim. ‘Fenerler’ ve ‘Çerçeve’ gibi soyut biçimlerini de, ahlaksızları da, günahkarları da, ‘sıkıntı’ olanları hele.Hepsini anladım mı, of course not.Size ben anlat(a)madım zaten, bahsettiğim gibi araştırın.Baskıyla ilgili söylemek istediklerim var:Baudelaire'in iç sıkıntısı kadar ağır kitap. Koskoca Varlık da kitabını 80 (90 bile olabilir) gramlık boyuna geniş kesilmiş A5 kağıda basıyorsa, yayıncılık hayatı bitmiş demektir. Kapak görselini hala anlamlandıramıyorum.Şu da var, şiirler üstbilgi ayrılarak roma rakamlarıyla numaralandırılmış ama buna rağmen bir şiirden sonra isimsiz şiirlere geçince fark edemedim ben bazen. Daha iyi bir sayfa düzeni oluşturulabilirdi. Özensiz bir basım bence. Word'den direk baskıya yollamışlar ozalitçide sanki.Ayrıca açıklamalar kısmındaki şiirin adıyla asıl şiirin adı arasında farklılıkların olduğu üç beş hata vardı.Ancak bunlar haricinde çevirisi bence çok çok çok güzeldi. Erdoğan Alkan zaten muazzam bir inceleme yapmış (sembolizm dahil, Rimbaud’dan biliyorum ayrıca), zaten kendisi müthiş.Fransızca bilen Ginsberg demiş ki “…anlamak için bütün çevirilerini okuman lazım.” Bir şiirinin bütün çevirilerinden bahsediyor :D Ama ben türk şiirinde bile ölçüsüz ve uyakta ısrarcı olmayan serbest şiiri sevdiğim için üstüne bir de çeviri okumaktan nefret ediyorum. Bu tercihten çok sevme meselesi.Belirtmeden edemeyeceğim; sevgili şair Neruda, Baudelaire'i eleştirmiş, toplumsal olaylara değinmediği için. İçimden geçirdim 'işte yavrum bu yüzden, sen önde gelen isimlerden Neruda iken o herkesi etkileyen Baudelaire.' Sorry.Paris Sıkıntısı kitabını edinmenizi tavsiye ederim. Şiirlerle ilgili açıklamalar kısmında \"Paris Sıkıntısı'ndaki '.......' metin ile karşılaştırın\" gibi atıflar var. Ben okumuştum zaten ama bayağı oluyor, yorumu bile yok. Yeniden okumayı düşünüyorum ama karar vermedim (düzyazı şiir olduğunu bilmeden okumuş ve sevmiştim, Rimbaud’dan bunu tadamadım). Hem çok ponçik oluyor kitaplar arası gidip gelmek :) Yine Varlık’tan olan baskıyı önereceğim keza çevirmen ve yayın stili aynı.Yaşasın kötü ve günah ve ahlaksız ve kara ve iğrencin güzelliği!xoxoiko"}, {"userName": "rose vibrations", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/5763075-rose-vibrations", "userReview": "My darling was naked, or nearly, for knowing my heartshe had left on her jewels, the bangles and chainswhose jingling music gave her the conquering airof a Moorish slave on days her master is pleasedWhenever I hear such insolent harmonies,that scintillating world of metal and stonebeguiles me altogether, and I am enthralledby objects whose sound is a synonym for lightFor there she lay on the couch, allowing herselfto be adored, a secret smile indulgingthe deep and tenacious currents of my lovewhich rose against her body like a tideEyes fixed on mine with the speculative glareof a half-tamed tiger, she kept altering posesand the incorporation of candor into lustgave new charms to her metamorphoses;calmly I watched, with a certain detachment at first,as the swanlike arms uncoiled, and the legs,the sleek thighs shifting, shiny as oil,the belly, the breasts -- that fruit on my vine -clustered, more tempting than wicked cherubim,to undermine what peace I had achieved,dislodging my soul from its rock-crystal throneof contemplation, once so aloof, so sereneAs if a new Genesis had been at work,I saw a boy’s torso joined to Antiope’s hips,belying that lithe waist by those wide loins...O the pride of rouge upon that tawny skin!And then, the lamp having given up the ghost,the dying coals made the only light in the room:each time they heaved another flamboyant sigh,they flushed that amber-colored flesh with blood!"}, {"userName": "Lynn Beyrouthy", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/7850738-lynn-beyrouthy", "userReview": "When it comes to the most beautiful literature in the world, I radically believe in the imperial prominence of Nineteenth century French literature. Charles Baudelaire is one of the poets that tremendously alimented this conviction. Originally entitled \"Les Lesbiennes\" and brazenly delineating sexuality and libidinous desires, the poems which Baudelaire composed in the decade of 1840-1850 were continuously censored until 1857, when his work was published with the title \"Les Fleurs du Mal\".The beautiful perversion, the splendid depravity and the glorious morbidity which are characteristics of Baudelaire were reflected in his poems:Ma jeunesse ne fut qu'un ténébreux orage,Traversé ça et là par de brilliants soleils;Le tonnerre et la pluie ont fait un tel ravageQu'il reste en mon jardin bien peu de fruits vermeilsUnlike contemporaneous poets, Le Poète Maudit did not rebuke urbanity and voiced his Parnassian argument that art must find beauty in the most corrupted situations. He faced acclaim as well as rejection, but managed to remain, even after approximately two centuries after his death, the notorious dandy of the nineteenth century, a French version of George Gordon Byron and the harbinger of modern poetry."}, {"userName": "Mariam Okasha", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/4975120-mariam-okasha", "userReview": "ليست تجربتي الأولى في قراءة الشعر المترجم ...فقد قرأت بعض شعر دانتي من قبل ..لكن بودلير مختلف أعتقد أن قدرته على التشبيه قدرة عالية جدا و في كلٍ من قصائدهِ كنت أرى ابداعًا جديدًا لم أعهده من قبل .. في ديوان أزهار الشر أعجبني العديد من القصائد و أعتقد أنه بداية جيدة تؤهلني لأكون معجبة حقيقية بفن بودلير الراقي المميز"}, {"userName": "Heba", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/68150924-heba", "userReview": "وأفكر بكل من فقد شيئاً لا يمكنه تعويضهبالذين يشربون دموعهم ويمتصون آلامهمكيتامى الذئبة الطيبة الناحلين كالأزهار ~~~~ما همني أن تكوني حكيمة وعاقلة أريدك جميلة وحزينة~~~~واعتقد أن ما تذرفه عيناك من لآلىءيُضفي على قلبك الضياء~~~~لا شيء يعادل في الطول الأيام المتعثرةعندما يرزح تحت ركام ثقيل من ثلوج السنينالضجر تلك الثمرة المُرة للامبالاة الكئيبة~~~~وهل حقاً للشر أزهار يا بودليير ؟!!..."}, {"userName": "Terence", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/1019174-terence", "userReview": "Flowers of Evil was an entirely serendipitous impulse check-out from my local library. I can only imagine that what caught my eye was the title - Flowers of Evil - who could resist? So I pulled it from the shelf, opened it up at random, read a few verses, and said to myself \"This isn't bad.\"Not only was it \"not bad\" but it was extraordinarily good; good enough that Baudelaire has joined the list of authors I'll pay money for.It's random events like finding authors whose work \"speaks to me\" in some way (Maugham, Le Guin, Chekhov, etc.) that keep me from being an out-and-out atheist. Afterall, it's strongly suggestive that there's at least a guardian spirit of some kind looking out for me. At the risk of offending or titilating some, Baudelaire's passions and obsessions mirror my own. I'm particularly taken with his ability to combine carnality with spirituality, often in the same poem. A short example that springs to mind is \"Correspondences\" (this and later translations are from the Oxford World Classic's edition, James McGowan, translator):Nature is a temple, where the livingColumns sometimes breathe confusing speech;Man walks within these groves of symbols eachOf which regards him as a kindred thing.As the long echoes, shadowy, profound,Heard from afar, blend in a unity,Vast as the night, as sunlight's clarity,So perfumes, colours, sounds may correspond.Odours there are, fresh as a baby's skin,Mellow as oboes, green as meadow grass,- Others corrupted, rich, triumphant, full,Having dimensions infinitely vast,Frankincense, musk, ambergris, benjamin,Singing the senses' rapture and the soul's.Or there's \"Conversation\":You are a pink and lovely autumn sky!But sadness in me rises like the sea,And leaves in ebbing only bitter clayOn my sad lip, the smart of memory.Your hand slides up my fainting breast at will;But, love, it only finds a ravaged pitPillaged by a woman's savage tooth and nail.My heart is lost; the beasts have eaten it.It is a palace sullied by the rout;They drink, they pull each other's hair, they kill!- A perfume swims around your naked throat!...O Beauty, scourge of souls, you want it still!You with hot eyes that flash in fiery feasts,Burn up these meagre scraps spared by the beasts!And any man (or woman) who writes poems to his cats is going to be on my A List by default. From section II of \"The Cat\" comes these verses which describe my young friend Oberon to a T (not to be confused with an earlier poem of the same name that begins, \"Come, my fine cat, to my amorous heart\"): From his soft fur, golden and brown,Goes out so sweet a scent, one nightI might have been embalmed in itBy giving him one little pet.He is my household's guardian soul;He judges, he presides, inspiresAll matters in his royal realm;Might he be fairy? or a god?When my eyes, to this cat I loveDrawn as by a magnet's force,Turn tamely back upon that appeal,And when I look within myself,I notice with astonishmentThe fire of his opal eyes,Clear beacons glowing, living jewels,Taking my measure, steadily.And, unlike in re my Russian literary interests, I was pleased to find that my graduate-school French was good enough that I could intelligently compare the parallel texts in the Oxford edition. McGowan uses a variety of techniques in translating Baudelaire; sometimes following both syntax and wording nearly exactly, sometimes translating a bit freely. In most cases I think he comes very close to capturing the original's intent.There was something that I found utterly inexplicable: There is a missing poem. The final section of the Oxford edition are 14 poems (supposedly) that were included in the 1868 edition of the original work. Poem #3, \"The Peace Pipe,\" isn't there. The text goes from poem #2, \"To Theodore de Banville,\" to poem #4, \"Prayer of a Pagan,\" as does the table of contents. I probably would have missed it entirely because I usually don't focus on the numbering but for the fact that there's a note for \"The Peace Pipe\" on page 383.Despite that, readers of this review are safe in assuming that I highly recommend Baudelaire."}, {"userName": "Kamrani Adnan", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/55039922-kamrani-adnan", "userReview": "مست شوید تا برده‌ی شهید زمان نباشیدمست شوید،هماره مست شویداز شراب، شعر، تقوااز هرآنچه بخواهید...باز دیداری نخست با فرهیخته‌ایی از فرانسه اما این‌بار شارل بودلر...برخلاف سلین خوش مشرب که دیشب (سه روزمانده به بهمن۹۵) با مرگ قسطی فعلا ازش خداحافظی کردم، امشب با شاعری دیدار کردم که موقع خداحافظی، واژه‌ی \"درد\" از دهانش خارج شد...!بودلر، یا همان شاعرِ رنج‌هابا اینکه زادروزش نزدیک به ۲۰۰سال میرسه، اما انگار خیلی زنده و شفاف داره کلمات و واژه‌ها رو به تعظیم خودش درمیارهو البته دست سردش رو در شعر آخر این مجموعه حس کردم...!"}, {"userName": "COME_TO_THE_DARK_SIDE", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/26167130-come-to-the-dark-side", "userReview": "No soy muy amante de la poesía en general. No obstante, debo reconocer que Baudelaire es la excepción que confirma la regla, sus obras siempre me dejan atónita. Estos poemas exploran una serie de temas, centrándose a menudo en las experiencias personales y los sentimientos del autor. En ellos quedan retratados la depravación, el amor, la liberación por el arte, la desesperación y la muerte."}, {"userName": "Kay", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/5611008-kay", "userReview": "I read a majority of the poems in French, which made the experience more beautiful. Each word is like a unique brushstroke of color on a grand canvas, applied with varying degrees of pressure, and each deeply and sensually hued. Baudelaire’s poetry paints gorgeous images of emotion, desire, and wanting that remain with you. Reading Les fleurs was a deeply personal and stirring experience for me. I have many favorites and could provide analyses on a dozen poems or more, but for the sake of length, I will limit myself to one particularly poignant experience. Le Flacon was one of those poems that never left me, maybe because it was always a part of me. I love perfume, and I am an avid collector. I have perfumes that I've worn maybe once or twice, and I have perfumes that I wear every day. Sometimes, I get an inordinate amount of pleasure from re-arranging the bottles of perfume on the vanity table. Some of the happiness derives from the physical beauty of the arrangement; the glittering, multi-toned flasks of elaborate glass with gold- and silver-plated designs are the stuff of fantasy, a little treasure trove of beauty and fragility in my own room. But the other, more poignant happiness originates from the fragrance and the memories that accompany it. Some moments in life will always stay with you, and sometimes, that memory leaves not just a visual or emotional mark, but its own fragrance as well. My childhood home has a certain scent that will always define me and transport my thoughts to past. The ocean of the northwest has a wild, pungent smell that I associate with power and nature. The same goes for perfumes. One darkly colored flask that I use occasionally contains a deeply sensual tangerine and jasmine perfume that reminds me of a night years ago when the moon was big and red in the sky. I was by myself and sleepless, and nothing extraordinary happened, except that I feeling hyper-aware and happened to be wearing that perfume. Somehow, the surreal and rare vision of beauty in the night sky became associated with the fragrance of tangerine and jasmine. Another flask contains a fresh yet musky perfume, gifted to me when I lived in France. The person who gave me the perfume explained that this fragrance was popular with the young ladies these days, and perhaps I would share in the enthusiasm. I did. I wore it nearly every day for the remaining month I was in France, and though I have more than half the bottle left, when I take a whiff, I am reminded of the warm sun of Toulouse and Nice in the spring.Baudelaire understood this fascinating and unique joy--and when the memories are something you'd rather forget, pain. Le flacon is a reflection on memory, and how the past can be brought to life by something as simple as fragrance. Like memory, fragrance is powerful, porous (“II est de forts parfums pour qui toute matière / Est poreuse”). Even if hidden and stored away in the deep attic of your mind, once the flask is uncorked, the fragrance stirs to life things left forgotten (“on trouve un vieux flacon qui se souvient / D'où jaillit toute vive une âme qui revient”). Baudelaire’s imagery and use of words is gorgeous, but the emotion that he evokes is something very personal and very special. I didn't like all of Baudelaire's works, and I liked some more than the others. In the end, which poems you end up liking or disliking depend on personal taste and, to a degree, whim. But everyone should pick up Les fleurs du mal. It is a collection that should be read and appreciated.Note: If you do a Google search, you can find all of his poems online for free. Most sites feature the poems in French with various English translations accompanying it."}, {"userName": "Simona Bartolotta", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "'Epigrafe per un libro condannato'Non scrissi, o lettore innocente,pacifico e buon cittadino,per te questo mio saturninovolume, carnale e dolente.Se ancora non hai del sapienteDon Satana appreso il latino,non farti del mio sibillinodelirio turbare la mente!Ma leggimi e sappimi amare, se osi nel gorgo profondodiscendere senza tremare.O triste fratello errabondoche cerchi il tuo cielo diletto,compiangimi, o sii maledetto!In realtà, tutta l'essenza de I fiori del male è perfettamente condensata in questo suggestivo componimento (il cui titolo, nel caso v'interessi, e quello che vedete scritto lì sopra, in grassetto), ragion per cui io adesso potrei anche finirla qui, spegnere il computer e andare a studiare le mie brave duecento pagine di storia dell'arte. Che, però, temo dovranno aspettare ancora per una mezz'oretta, dato che effettivamente due cosine da dire ce l'ho.Quelle di Baudelaire sono poesie bellissime, ma per nulla facili. Non è semplice adattarsi all'ottica del poeta, così come non è semplice focalizzare quelle che a me piace chiamare 'le sue verità', i punti fissi dai quali normalmente uno scrittore o un poeta che sia parte per delineare la sua opera. Questa ambiguità dona ad ogni verso un fascino incommensurabile, anzi, credo che Baudelaire abbia saputo far breccia nel mio cuore proprio per l'inebriante profumo di umanità che si respira tra le sue pagine. Perché ad un certo punto, bisogna pur capire che non è solo dal poeta che deriva quel senso di disagio, ma anche e soprattutto dall'umanità stessa. Razza sempre più combattuta tra bene e male, la distinzione tra i quali diventa sempre meno netta, sino a sfumare in un'indistinguibile bagliore.Qui sta il fascino de I fiori del male: sai dove i suoi versi vogliono andare a parare, ma vorresti non saperlo."}], "description": "Presents the first American translation of the complete text of Baudelaire's 1857 masterwork and includes the complete original French texts for easy comparison.", "title": "Les Fleurs du Mal", "url": "http://www.goodreads.com/book/show/203220.Les_Fleurs_du_Mal", "average": 4.26, "cover": "https://images.gr-assets.com/books/1388667125l/203220.jpg", "reviews": 1039, "authors": [{"url": "https://www.goodreads.com/author/show/13847.Charles_Baudelaire", "name": "Charles Baudelaire"}, {"url": "https://www.goodreads.com/author/show/27112.Richard_Howard", "name": "Richard Howard"}], "type": ["Poetry", "Classics", "Cultural", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/203220.Les_Fleurs_du_Mal", "http://www.goodreads.com/book/show/10991334-les-fleurs-du-mal", "http://www.goodreads.com/book/show/536387.The_Flowers_of_Evil", "http://www.goodreads.com/book/show/3213640-the-flowers-of-evil", "http://www.goodreads.com/book/show/2577005", "http://www.goodreads.com/book/show/96910.Las_flores_del_mal", "http://www.goodreads.com/book/show/12434378-as-flores-do-mal", "http://www.goodreads.com/book/show/2441250.Flowers_of_Evil_Les_Fleurs_du_Mal", "http://www.goodreads.com/book/show/1424275.Les_Fleurs_Du_Mal", "http://www.goodreads.com/book/show/29456244", "http://www.goodreads.com/book/show/7347801-k-t-l-k-i-ekleri", "http://www.goodreads.com/book/show/7632272", "http://www.goodreads.com/book/show/13550603", "http://www.goodreads.com/book/show/3101481-las-flores-del-mal", "http://www.goodreads.com/book/show/1424276.Les_Fleurs_du_Mal", "http://www.goodreads.com/book/show/7312719-i-fiori-del-male", "http://www.goodreads.com/book/show/24601.Paris_Spleen", "http://www.goodreads.com/book/show/203221.Baudelaire", "http://www.goodreads.com/book/show/128480.Flowers_of_Evil", "http://www.goodreads.com/book/show/24605.On_Wine_and_Hashish", "http://www.goodreads.com/book/show/24604.Flowers_of_Evil_and_Other_Works_Les_Fleurs_du_Mal_et_Oeuvres_Choisies_"]}