{"ratings": 6989, "userreviews": [{"userName": "Maggie Stiefvater", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/1246837-maggie-stiefvater", "userReview": "What a soft-hearted bastard of a novel.It's the story of a failed — failing — novelist about to turn fifty. His long-time lover is marrying someone else, and he's been invited to the wedding. To avoid the whispers and rumors that would abound, he takes the only course of action he can imagine: accepting every literary invitation he's been putting off, a journey that will take him around the globe and well away from the wedding of the man he loved. Loves. It had me from the first page, and I'm not even precisely sure why. The prose is wonderful, to be sure. Playful, rollicking, sly, observant. The main character, the anxious and vain Arthur Less, is boyish and gentle and smart and I adore him. The narrator (whose identity I guessed with increasing hope and anticipation as the pages went on) guides us skillfully through present events and past ones, uncovering the parts of Less that need to become More in order to find happiness. The settings —San Francisco, New York, France, India, Japan — are wondrously and precisely evoked. Side characters caper in with delicious specificity and purpose, both thematic and human. Is one of those aspects what I loved? Is all of them what I loved?I actually think I loved it because of what it believes. There's a line in the book — I had to fetch it to quote it exactly — that I think is what the book says on every page:\"Just for the record: happiness is not bullshit.\"That belief in happiness and love is what makes this novel a comfort read. Every character is desperately flawed and every setting has a rainy day and every relationship is complicated, but its over-arching naive and wavering pursuit of happiness is what made this book feel like something I wanted to curl up in for a long time.I'll be rereading this one many times."}, {"userName": "Roxane", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "I wanted to dislike this book for petty reasons grounded in irrationality but it's quite a brilliant novel, with exceptional writing and a depth of character rarely seen in fiction. I'm also surprised I loved this book because I hate books about writers.Less is a frustrating man who gets in his own way all too often. There were many times when I wanted him to get his head out of his ass. Also, the narration doesn't quite work until the very end and then it all makes sense so I had to go back and read certain parts. But it's fine. As a middle-aged midlist writer, Arthur Less's laments are many. He needs money. His long term not boyfriend is getting married. And so he fashions an itinerary that will have traveling the world and as he travels the world, we learn of how he comes to this moment in his life, turning fifty, alone, full of longing. There is a lot that is funny and relatable about the writing life. In the end though, this is one of the most satisfying love stories I've ever read. As I read the last few pages this morning, I found myself crying. I found myself believing that love always finds a way. I admire any book that can remind me of that in a largely cynical world."}, {"userName": "Elyse", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "SHARING & REVIEWING:I can’t believe I’m writing this review the same day I came home from surgery.... but other than a little tire - I’m feeling ‘great’.....happy with what my surgeon did. After 3 surgeries last year for skin cancer - the loss of a half of a nose - a slice down my forehead- today was my first ‘repair’ surgery. I’m blown away - my nose ‘almost’ looks normal. Wow...such a ‘huge’ difference already. Sure - I need to heal- stitches and such - but it’s a miracle what the surgeon did. Really a miracle! I may not even do the second surgery that was originally planned for the fall. I think I’m happy enough just with what the doctor did today. People around town can stop looking at me now like ‘what the f#@k happened to you? And stop telling me ....”if it were them, they would just stay home with a bag over their head”. But Paul says....”Now I won’t have to continue living with the alien nose any longer”. THANK YOU SOOOOO MUCH TO ALL MY GOODREADS FRIENDS who watched me go through this - the support was SOOOOOOO appreciated!!!! DEEPLY APPRECIATED! I HOPE OTHERS ARE WEARING SUNBLOCK AND HATS WHEN OUT IN THE SUN! I’ll be there for any of my friends too - in any way I can - to offer support back whenever comfort is wanted! Aging is not for the weak...and many of our reading friends are aging here together dealing with different medical challenges. Reading books bring us together - and sometimes we need to ‘personally’ come together’!Many thanks to the staff at Goodreads....for the ongoing dedication in having Goodreads be a place where readers and authors want to be! So....ABOUT “LESS”, by Andrew Sean Greer.....I met Andrew Sean Greer last year .... heard him speak when this book was first released, yet I only bought the like-new hardcopy for a $1 from my thrift store ( interesting coincidence) a short time before it won The Pulitzer Prize. CONGRATS TO ANDREW SEAN GREER BY THE WAY! Outstanding acknowledgment. Andrew must be flying high!I LOVE THIS EXCERPT: “ Arthur Less is the first homosexual ever to grow old. That is, at least, how he feels at times like these. Here, in this tub, he should be 25 or 30, a beautiful young man naked in a bathtub. Enjoying the pleasures of life. How dreadful if someone came upon naked Less today: pink to his middle, gray to his scalp, like those old double erasers for pencil and ink. He has never seen another gay man age past 50, none except Robert. He met them all at 40 or so but never saw them make it much beyond; they died of AIDS, that generation. Less’s generation often feels like the first to explore the land beyond 50. how are they meant to do it? Do you stay boy forever, and dye your hair and diet to stay lean and wear tight shirts and jeans and go out dancing until you drop dead at 80? Or do you do the opposite – – do you forswear all that, and let your hair go gray and wear elegant sweaters that cover your belly, and smile on past pleasures that will never come again? Do you marry an adopt a child? In a couple, do you each take a lover, like matching nightstands by the bed, so that sex will not vanished entirely? Or do you let sex vanish entirely, as heterosexuals do? Do you experience the relief of letting go of vanity, anxiety, desire, and pain? Do you become a Buddhist? One thing you certainly do not do. You do not take on a lover for nine years, thinking it is easy and casual, and, once he leaves you, disappear and end up alone in a hotel bathtub wondering what now”. Author Less was a minor American author, known mostly for his connection to the Russian school of Artists, especially the poet & novelist, Robert Brownburn. His now ‘ex’ boyfriend.Author was devastated over the break up with Robert - older than he - Pulitzer Prize Guy Genius....Yet....looking back — living with Robert was often like living alone. Everything had to be sacrificed for the work. Plans had to be canceled, meals had to be delayed, there needed to be silence until noon, etc. Less was 2nd rate. But now .....turning 50 with an invitation to Roberts’s wedding and a string of invitations to literary events around the world .....Less concludes the best way to avoid Roberts wedding is to accept ‘all’ the invites. Keep busy traveling.....in Mexico, Italy (awww...countryside of autumn vineyards), Germany, ( take a young lover, Bastisn, who is arrogant, follows sports, and sneers at Literature & Art) plus Less grows a beard.In France, Less falls under the spell of Javier. As they say their goodbyes .....Less is wishing and hoping to be asked to stay.Off to Morocco....and a visit to a Swiss Ski lodge: more reason to feel sorry for himself..... then INDIA for more adventures at a Christian retreat ( sounds like Eat,Pray,Love).....haha! Throughout the journey we take with Less - he taps into memories from the past. He knows so well the pleasures of youth — the dangers, the excitement, the pills, the drinking, a strangers mouth, —-——Less knows more calming pleasures too —as with Robert and his friends, the pleasures of age –– the comfort and ease, of old friends, and wine & whiskey, secrets, and shared stories. Less danced between two worlds - the wild and safe. In each country - Less meets new challenges....while reflecting on his life. Lots of humor - sentences to think about & feel. At times the writing was too intellectual for ‘my’ easy comfort.....but I experienced the sheer brilliance in this bittersweet book.....making this priceLESS!!!4.5"}, {"userName": "Larry H", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "It's been said (in a catty way, of course) that after age 42 gay men become invisible, that no one wants an older gay man except, if they're lucky, another gay man. Andrew Sean Greer's beautifully moving but slightly uneven new novel, \nLess\n, deals with a man coming to terms approaching his 50th birthday, wondering if he'll ever find true love, and trying to define himself and his career. No small feat, there!When he was in his early 20s, he was the boyfriend of Pulitzer Prize-winning poet Robert Brownburn, who was a member of the famed Russian River School of writers and artists. Even though the relationship ended after a few years, Arthur has always been defined somewhat as the former boyfriend of Robert Brownburn, even as he experienced a slight bit of renown in his own literary career. Robert will always be Arthur's first love, even though Arthur knows he frittered away the relationship as many much-younger gay men would.As Arthur's 50th birthday approaches, he is in the midst of a crisis. His former boyfriend of nine years (this time he picked someone younger) is getting married to someone else, and Arthur has been invited to the wedding. His publisher isn't interested at all in his newest novel. And he wonders if he'll spend the rest of his life alone, unloved and unsuccessful. So he does what any self-effacing person would do: he flees the country.But he's not running away. (Well, yes, he is.) He's pursuing a number of different literary opportunities across the globe, which will end with some time at a writer's retreat in India, where perhaps he will be able to fix what ails his novel. Along the way he travels to Mexico, Italy, Germany, France, and Morocco, plumbing the depths of his soul, looking back at the memories of relationships gone sour, and trying to figure out where he goes from here, and whether he's made the biggest mistakes of his life by simply deciding not to decide things, not to say things, not to do things.How does a man who always seems to intrigue, always seems to provoke feelings in others, figure out his self-worth, and find the courage to act instead of waiting for things to happen to him? There are lessons to be learned in mistakes and failures, but does he want to learn those lessons? What awaits him on the other side of 50?\nLess\n is an emotional, somewhat elegiacal meditation on aging, love, and one's professional and romantic legacy. It is at times poignant, at times funny, even a little ridiculous occasionally, but tremendously thought-provoking. Greer brings so much poetry and beauty to his sentences, and even if his main character is a somewhat elusive enigma, at least to the reader, his lamentations and his journey are utterly fascinating.I enjoyed this book quite a bit. I felt as if so much of this story was so interesting, so moving, that I was a little irritated when the narrative veered into almost farcical and/or metaphysical territory a few times. In a sense you know how the story may ultimately unfold, but Greer makes you wait a really long time for the payoff, and there were a few moments I just wanted Arthur to stop moping, stop walking around with his head in the sand, and speak, or act, the way he knows he should.I have been a huge fan of Greer's since reading his first story collection, \nHow It Was for Me\n. While it took me a while to get into what is perhaps his most famous book, \nThe Confessions of Max Tivoli\n, I absolutely loved his other books, \nThe Path of Minor Planets, The Story of a Marriage\n, and \nThe Impossible Lives of Greta Wells\n. He is an absolutely beautiful storyteller, and even though this book has some flaws, reading Greer's writing is like eating a fine meal or watching a beautiful movie or play—you just don't want it to end, you want to savor every minute.NetGalley and Little, Brown and Company provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Paromjit", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is a beautifully written, lyrical, comic, often profound and moving Pulitzer winning novel, to me it often feels like a gay version of Eat, Pray, Love. A little known, gay and inconsequential writer, Arthur Less, is approaching 50 with fear, his body is displaying all the physical symptoms of getting older. In his mind, he is the first gay man to face the quandry of the aging process, he has known hardly any gay men who have lived to this age. His problems are intensified because his current amour has dropped him and he has received a wedding invitation from the love of his life, a famous celebrity poet, Robert, a man with whom he had a relationship for nine years. What to do? He just can't attend the wedding, so to distract himself he chooses to accept invites to literary events around the world in search of himself and who he is.On his meandering travels that include India, Germany, France, Mexico, Italy, Morocco, and Japan, through which Less's colourful, exciting and jam packed personal past life is revealed and reflected upon. Less shifts from one chaotic, difficult and challenging scenario to another, jumping into adventure after adventure, encountering mishaps in his efforts to find love, fulfillment and happiness. Less is a flawed man, charming, self obsessed, so body conscious, and a fascinating central character. This is a short, brilliant and entertaining novel about identity, and although often uneven, I thoroughly enjoyed it. I particularly appreciated the wonderful and enchanting prose. Highly recommended! Many thanks to Little, Brown for an ARC."}, {"userName": "Glenn Sumi", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "An Evening With Arthur Less (and yours truly):I’ve been writing lots of traditional reviews for work lately, so I thought I’d try to make this one fun and entertaining to write... and hopefully read. If you’ll indulge me, here’s a Q&A with Arthur Less, the main character of Andrew Sean Greer’s Pulitzer Prize-winning novel Less. First a bit of background. Less is a middle-aged, midlist novelist, who’s about to turn 50, and at the beginning of the book he’s just found out that Freddy, his younger lover/sorta boyfriend of the past nine years, is about to get married to another man. Rather than go to the wedding and risk humiliation (Freddy’s guardian/uncle is an old literary rival of Arthur’s), Less decides to accept every far-flung speaking engagement, short term academic position, awards invitation and writing assignment he’s been offered recently, resulting in an impromptu trip around the world. So just imagine this fictional talk is one brief stop on his world tour. But, because Less is the subject of the book, and I’m not, I’m going to have Less interview me about him. Confused? Read on.***Glenn Sumi: I'm here with Arthur Less, the author of several books, including his bold debut novel, Kalipso [polite applause] Mr. Less is also hero of Andrew Sean Greer's novel Less. Welcome! Arthur Less: Thank you! It's good to be here. I believe Toronto is mentioned in the book. GS: Indeed it is. I must say, you’re just how I imagined you! Blonde and balding, boyish, with that striking blue suit featured on the dust jacket cover. Also, just as it’s pointed out in the book, you don’t look a day over 35.AL [blushes]: Aw, thanks. But that’s also just being gay in North America, don’t you think?GS: Perhaps. Also, I don’t know if you realize it, but some of your actions made me literally LOL (as we say online) even when I was in public. AL: … um, laughing with me though, right? Not at me?GS: Truthfully, it was a little of both. The section on “good” and “bad” gay writers was fantastic satire – and quite true. You were, you probably remember, once criticized for being a “bad gay writer,” i.e., one who makes his characters suffer without reward. There's another scene, I think in Italy, where there's a literary competition JUDGED BY HIGH SCHOOL STUDENTS! When I read that detail I almost spit up my orange juice in laughter. Oh, and when you're in Germany you speak to people in German but the author translates what you’re saying into a garbled English… such a cheap joke but it made me laugh every time. AL: [shoots a deadpan expression to the audience] Well, I’m glad you had a good time. Languages aren’t really my forte. So tell me, what made you pick up the book in the first place?GS: Oh, the Pulitzer win, of course. I also liked that it was a comic novel that actually was funny. I enjoy books about authors, too: neurotic but relatable. There are several scenes that are sort of just like what we're doing now: awkwardly talking onstage. And frankly, I can’t remember the last time an openly gay writer won the Pulitzer. Was it Michael Cunning--? AL: - The Hours! Yes! What a lovely book. In a way I felt like this was a lighter version of that. Flashing back and forth. Finding the luminous – or is it the numinous? – in the everyday. Thinking about mortality. In a way it’s a journey, just like the book I’m writing in this book...GS: Exactly! As one of the characters says, “All you do is write gay Ulysses.”AL: [sighs] It was Freddy who said that. [pauses]Did you like Freddy?GS: I did. But I also felt, early on, that he was one of the more underdeveloped things about the novel. Your relationship with him was sketched out so quickly at the beginning that I didn't realize you felt so strongly about him. But as the book went on, and bits were filled in, I believed the relationship more.AL: What did you think of the narration?GS: It took me a while to get used to. Halfway through, I figured out what the author was doing, and became intrigued. AL: What about the way the author filled in my past with flashbacks?GS: Very nicely done, well paced. I usually find flashbacks contrived, but these felt organic. They added texture and heft to the book. The scene where you meet the great love of your life, the poet Robert Brownburn, was just lovely. And quite surprising.AL: Thank you. And how did you like the sections with Robert?GS: They were some of my favourites, especially that one devastating passage about what it’s like to live with genius. I know I will reread that section many times. Such great concrete, authentic, everyday details.Actually, at this point, I'm wondering if you could read the passage I'm thinking about. AL: Certainly. [Arthur stands up and reads from the book he's in]:What was it like to live with genius?Like living alone.Like living alone with a tiger.Everything had to be sacrificed for the work. Plans had to be canceled, meals had to be delayed; liquor had to be bought, as soon as possible, or else all poured into the sink. Money had to be rationed or spent lavishly, changing daily. The sleep schedule was the poet's to make, and it was as often late nights as it was early mornings. The habit was the demon pet in the house; the habit, the habit, the habit; the morning coffee and books and poetry, the silence until noon. Could he be tempted by a morning stroll? He could, he always could; it was the only addiction where the sufferer longed for anything but the desired; but a morning walk meant work undone, and suffering, suffering, suffering. Keep the habit, help the habit; lay out the coffee and poetry; keep the silence; smile when he walked sulkily out of his office to the bathroom. Taking nothing personally. And did you sometimes leave an art book around with a thought that it would be the key to his mind? And did you sometimes put on music that might unlock the doubt and fear? Did you love it, the rain dance every day? Only when it rained.[audience applauds]GS: Thank you! Speaking of Robert, the scene where he learns he’s won the Pulitzer Prize for poetry was wonderful. Who knew that that scene would be prophetic, huh?AL: Yes! I don’t know if the author who created me will quite get over it. Did you hear that hardcover sales have doubled since the Pulitzer win? Anyhow… did you like the few men I met in the various countries? Who was your favourite?GS: Oh, that conversation with Javier on the balcony of the party in Paris, on the sudden stopover before you go to Marrakech. [a few lusty \"woots!\" from the audience] I’m sure I’m not the only reader who found it very romantic. AL: It was quite something to be on that balcony. Did you like what the book said about love? GS: I did. I understood why you wanted to avoid going to Freddy’s wedding. And I liked how you met all these people on your travels and how in a way they changed how you felt about your own situation. Zohra’s story in Morocco just gutted me. She’s the woman who turned 50 the day before you did. AL: [quietly, looking down] Yes, I’ll never forget Zohra. [Looks up, his eyes moist] And what about my friend Lewis’s story, about his husband who made a pact to leave him after ten years?GS: That made me cry it was so sad and beautiful. AL: Wow, so this book I'm in really did make you laugh and cry! You’re not exaggerating?GS: I’m not exaggerating. It made me think of lovers and friends in my own life. It made me think about getting older, especially as a gay man. And it also made me want to travel more. AL: But not in an Eat, Pray, Love sort of way, right? [audience laughs nervously] GS: No! I was briefly worried this book would become that. And you admit at times that no one wants to read about how a privileged white middle-aged guy thinks he’s suffering. But it transcended all that. AL: Whew! Okay, well thanks for the chat. I need to catch a plane. GS: Thank you. And I hope to meet you again… perhaps in a sequel? AL: You’ll have to bug my author about that. After all the Pulitzer buzz dies down, perhaps he’ll sit down to write again. In the meantime…GS: … yes, yes, I’m going to look up his earlier books!AL: I think my author would like that![polite applause from the audience as Arthur Less and his interviewee leave the stage]"}, {"userName": "Lewis Weinstein", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "There is no story ... the main character is totally uninteresting and evokes no positive feelings ... the writing is competent but snarky, and also repetitive ... the tour guide information, country after country, is paper-thin and offers no particular insights"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n “Just for the record: happiness is not bullshit.”\nI picked up Less for one reason and one reason alone . . . . . \n“You won?”“It’s not Pew-lit-sir. It’s Pull-it-sir. Holy fuck, Arthur, I won.”\nOccasionally I like to prove that I don’t live on porn and murder alone and venture out. The world of award winners has generally worked out pretty well for me and, although I’m not a zealot about it, I try to squeeze in a Pulitzer, Man Booker or Edgar Award winner a couple times a year. The story here is about Arthur Less. Quickly approaching 50 with one former partner dying and another getting married, Arthur feels he has no choice but to do one thing . . . . \nExcept the staying in more part. No, on the contrary Arthur will be going out more. A lot more. And all over the world. From Paris to Berlin to Morocco, Arthur will become quite the globetrotter in order to avoid facing the facts that he’s not getting any younger . . . or more successful . . . or better at relationships. Less has the hardware that proves unarguably that I read it wrong. I don’t even have a valid reason, either, because the “off the top of my head” excuse why I didn’t fall over myself loving this one is that I didn’t really relate to Arthur. Obviously I can’t truly relate to all of the meth manufacturers, moonshine runners, cannibals and serial killers who manage to make their way into my cold, dead heart either, so like I said – invalid argument. I guess my main problem with poor Arthur was . . . . \n“You talk like a child. You look and act very young.” . . . “Maybe you never grew up.” Maybe he never did.\nI guess there’s no place in my life for middle-aged manchildren. It still gets 3 Stars, though, because even I couldn’t eff up and read it wronger than that ; )"}, {"userName": "Justin Tate", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/23082940-justin-tate", "userReview": "The writing was magnificent, the witticisms numerous, but couldn’t get into the all-over-the-place story."}, {"userName": "Philip", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/30863291-philip", "userReview": "4ish stars.Such a clever book. For the first third or so, I felt like there was something missing. Was this really deserving of the Pulitzer? (PULL-it-sir, by the way, not PEW-lit-zer, as the characters and I learn). I couldn't quite put my finger on it... Too spoony? Too magniloquent (with the use of words such as peripateticism, quaalude, and magniloquent)? More like too insubstantial. Funny but fluffy. As Less's journey around the world continues, however, his story becomes fuller, deeper, wiser.One can't help but wonder how much of this book is autobiographical. There is a meta aspect throughout as the words on the pages, as related by a mysterious narrator, so often mirror Less's own writing as a novelist and his reflections on his life, while satirizing the very literary world to which he belongs. A character in the book actually wins a Pulitzer (foreshadowing?) and another warns Less never to win an award, that doing so ruins authors. While the book is decidedly a comedy, Less can only (comically) see his life as a series of tragedies. He describes his most recent novel, rejected by his publisher, as being about \"a middle-aged gay man walking around San Francisco. And, you know, his … his sorrows … ” to which a character replies “A white middle-aged American man walking around with his white middle-aged American sorrows? ... It’s a little hard to feel sorry for a guy like that.\" Yet here we are! A book about a white middle-aged American man's sorrows has won the Pulitzer. And if I can't quite feel sorry for Arthur Less, I can sure relate to him.To me, it's a good reminder that it's okay to make fun of myself. That by doing so, I can actually process and acknowledge my tragedies in a more meaningful way. While perhaps not as significant as Less's fear of turning 50, my apprehension about turning 30 this year is real, let me tell you. What some might view as the pinnacle of a life, I can't help thinking of as \"it's all downhill from here.\" I don't know if I'll even be able to enjoy my 30s when I keep thinking \"I'm almost 30 which means I'm almost 40 which means my life is half over which means I'm basically dead.\" I'm already at the point in my life that, when it rains, instead of complaining that I can't go out and do anything, I think \"this will be good for my lawn.\" 😑 Maybe, though, by seeing these thoughts written out like this I can smile, get over myself, and enjoy myself anyway. :)Posted in Mr. Philip's Library"}, {"userName": "Beverly", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/68708752-beverly", "userReview": "A very funny book, at times I laughed out loud, not easy for a writer to accomplish. Less is almost 50, has just had his lover of 9 years leave him for another man and feels likes he hasn't done much in his life. He decides to accept a bunch of writer's lectures and other assorted invitations to journey around the world and forget his woes. Woes goes with you though."}, {"userName": "Ron Charles", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "In the opening pages, a midlist novelist named Arthur Less is clinging to 49 like it’s the lip of a volcano. He has waited with muted expectation through “his exclusion from any list of best writers under thirty, under forty, under fifty — they make no lists above that.” And now he’s pretty sure he’s “the first homosexual ever to grow old.”That gently mocking tone reflects Less’s attitude about all his foibles, which are obvious to him but incurable. His anxiety about aging has been exacerbated by splitting up with his boyfriend who’s about to get married to a younger man. Confronted with the prospect of sitting through their wedding wearing a grin of faux happiness, Less decides to send his regrets and flee. “In free fall from the broken bridge of his last hopes,” he paws through his old mail and blindly accepts all the sundry invitations he’s received from around the world: a hodgepodge of teaching assignments, retreats and readings.Those gigs provide the novel’s structure — a different country for each chapter — which is a challenge for Less, but a boon for his creator. (An excerpt of “Less” recently appeared in the New Yorker.) Greer is brilliantly funny about the awkwardness that awaits a traveling writer of less repute. At a science fiction convention, he’s. . . . To read more, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Lena♥Ribka", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/10446876-lena-ribka", "userReview": "30th Annual Lambda Literary Award Finalist - Gay Fiction\nMy second book in the category Gay Fiction and again 5-stars rating!\nGay Fiction:\n\nAfter the Blue Hour Grove PressThe Clothesline Swing, Nightwood EditionsThe End of Eddy, Straus and GirouxFimi Sile Forever: Heaven Gave It to Me, Team AngelicaThe Heart's Invisible Furies, HogarthLess, Lee Boudreaux BooksOutside Is the Ocean, University of Iowa PressThis Is How It Begins, She Writes Press\n“What do I want from life? And I say: “Less!” 5++++++STARS!“Strange to be almost fifty, no? I feel like I just understood how to be young.\"\"Yes! It's like the last day in a foreign country. You finally figure out where to get coffee, and drinks, and a good steak. And then you have to leave. And you won't ever be back.” I ADORE this book. I love every single sentence in it. It's charming, funny, warm-hearted, endearing and so beautifully clever written! Arthur Less is almost fifty, no, he is actually YET forty-nine, a mediocre writer, an abandoned and -technically - not a skilled lover, a declined author,...bad gay and...the first homosexual ever to grow old. That is, at least, how he feels. At ten, we climb the tree higher even than our mothers’ fears. At twenty, we scale the dormitory to surprise a lover asleep in bed. At thirty, we jump into the mermaid-green ocean. At forty, we look on and smile. At four and nine?How does a middle-age gay man like HIM cure a heartbreak? Right. He goes on a trip around the world.Go with him! Go immediately! You won't regret it. I can't recommend this book highly enough!"}, {"userName": "Alison Smith", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/20687927-alison-smith", "userReview": "I chose this book because the reviews implied it was hilarious. It was funny-ish, but not the gut-clenching laugh bomb I was hoping for. The story felt more like a surface-level, gay \"Eat, Pray, Love\" type of sojourn. And it was kind of depressing. Just not my thing, especially when I expected funny. : ("}, {"userName": "Rhode", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/14453764-rhode", "userReview": "This is meant to be gently humorous litfic. While there were passages I adored, and descriptions of foreign travel that were so spot on I felt as though I were there again, I didn’t quite get the point of this. It's billed by some as a romance, which it is not because the protagonist never reaches out or grows for love or any relationship (he's utterly passive) and because his HEA-love interest is represented like an actor in the wings, not central to the story. The protagonist, a handsome, tall, slender novelist is turning 50. Which he is taking way too seriously in the dreariest way. I have no idea why. As he travels he acquires lovers with astonishing ease, and remembers many other lovers. He’s kissing handsome men at exclusive French parties, and reading his prose at artsy German nightclubs, and taking camel rides across the Moroccan desert. It’s heavy and dull with this self absorbed white man mourning his youth. The thing is, he had one hell of a youth. It’s not like he wasted it. And he wound up with a paid off house in a lovely area of SF, a wide circle of interesting friends, a career as a teacher and novelist, and no debt or health problems. Plus, he’s still good looking enough to score with far younger men. There’s nothing wrong with his life at all except for the fact that he's way too self-absorbed and does next to nothing for anyone besides himself. Why is he self pitying?He is literally mid-life, 30 years down and roughly 30 to go. Somehow this is a burden to him, living his privileged, tall, handsome white guy life surrounded by men who really like kissing him. Oh, poor thing. On top of that, some of the writing was a bit over-the-top show off writer’s writing. Self consciously artisanal prose. I bet the author likes poetry.And the last line — godawful."}, {"userName": "Laura", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "There is so much to love about Arthur Less.So much that I know I’m not going to be able to express it all here in this suddenly intimidatingly bright and positively glowing white review space. I have to try though! Because you have to meet him!!! Sorry didn’t mean to shout there. I’m trying to reign in my enthusiasm, but I can see I’m failing already. *clears throat* Let me try this again…I knew I loved this book about 30 pages in. I can’t believe I’m going to confess this on GR, but “Hey!” that’s what I do. I am a library lover, which means a lot of my books are library books that have to be returned eventually. So sometimes when my love is huge I take a picture of the cover just to keep it close to me for a little bit longer. Like a souvenir. Strange and silly I know, but book love makes you do crazy things. :) But Less here is something special. I took a picture of the cover even before I finished it. I was already trying to prepare my heart for when I had to let it go.Less by Andrew Sean Greer tells the story of Arthur Less, a charmingly flawed, hysterically floundering about man full of love and regret and fear and courage. I adored Mr. Less and his travels attempt to escape, flee, and avoid thinking about his losses and life changes. Arthur is about to turn 50, his ex-lover is getting married, and his publisher just passed on his latest book. How does one deal with all that? Run, of course. Arthur Less says “yes” to every invite, award ceremony, and teaching opportunity that was sent his way. Anything and everything to avoid thinking about the man he let walk away.“You want me to stay here with you forever? Why didn’t he say yes?\"We travel airport to airport, sleeping pill haze to sleepy dream fog with Arthur from New York to Mexico to Italy to Germany to France, and more. I loved every stop and port! Mr. Less simultaneously made me think, snort laugh, and love. The teaching job in Germany was my favorite part though. How can you not be charmed with a man who teaches a class in hilarious language missteps, scissors, and glue sticks? His love for language shines through in every move and step he takes across the world. Right along with his love for life. We are told Mr. Less is full of fear, but he jumps into life without looking again and again. I love him for it! Every embarrassingly brave moment! His remembering and fearing and regretting pulls you along for the ride until you find yourself emerged and captivated by every word and memory. Every word!Let me sidetrack for a minute with some of my favorite words in this book. Mind you I loved them all, but caper, peripateticism, and pantagruelinally were just a couple of word delights to be found in the mix. Pure word magic! The way Mr. Greer spins the past with the present is free flowing and fiercely intelligent and funny and touching. I had to blink along with Arthur to clear my head of the past and move on. Little lines like this one made me back up and read again….“It feels possible that memory will never be finished with this moment.”And some of the descriptions were priceless! Like this gem about a Disney ride….”a ride that turned out to be a knuckle-whitening rattletrap wellspring of trauma.” Haha….Rattletrap!*sigh* I don’t know what else to say. Just read this book. It’s a love story, a trip around the world, and a lesson on living. You can’t run away from your mistakes or your past or your heart. Go meet Arthur and everyone that crosses his path. Mr. Greer has created a full cast of real, flawed, intelligent, lonely, quirky individuals. I loved meeting them all and the time they spent with our hero. I adore you, Mr. Less. From your always thinking (or sleeping) brain down to your red polished toes.Highly recommended."}, {"userName": "Jan", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/8550623-jan", "userReview": "This is a sweet comic novel, more rueful chuckle for the middle-aged crowd than universal snort- your-coffee guffaws. But if you were hoping the 2018 Pulitzer Prize Fiction committee might look at the fraught state of our nation and honor a novel that beautifully and directly addresses one of the major issues of the day, like Jesmyn Ward's Sing, Unburied, Sing, for example, well, you'd be disappointed."}, {"userName": "Kasa Cotugno", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "Arthur Less is hilariously well-named. In the opening salvo, he is waiting to be escorted to a literary event, sitting in a hotel lobby, while a woman he is meant to meet is circling the room looking for a woman, mistakenly thinking the author of the book she's read cannot be a man. On the eve of Arthur's fiftieth birthday, his partner of almost ten years has announced his upcoming nuptials, and in order to avoid this nightmare, Arthur has cobbled together a trip around the world accepting an odd congregation of invitations to host, attend, and teach various literary events. With each stop, he goes into his past, revealing more and more about himself and his history. Each experience generates memory, both poignant and absurd. Greer has a fine sense of character and irony, and this surpasses other books I've read by him."}, {"userName": "Sofia", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/14453898-sofia", "userReview": "A case of 'less by name and by nature' that is what Arthur thinks but Greer peels away at Arthur and shows us the More and I enjoyed the journey. I like Greer's turn of phrase, his humor, he turns what might seem like a boring character, a boring story into a book I highlighted a lot, where I enjoyed the actual words and the insights.A smiled a lot realising that I was reading this in the year that I too turn 50, ha. Loads to think about or just throw away behind me and continue with my life :D\n\"His slim shadow is, in fact, still that of his younger self, but at nearly fifty he is like those bronze statues in public parks that, despite one lucky knee rubbed raw by schoolchildren, discolor beautifully until they match the trees.\""}, {"userName": "Molly", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/16285686-molly", "userReview": "LESSI adored this book. And I'll explain why.I wasn't dreading reading it, but I wasn't looking forward to it either. I was fearing a PC onslaught. What on earth could I have in common with a middle-aged west coast gay male semi failing novelist?? Surprise! Feelings and fears - love, loss, failure and happiness. Dreams and opportunities missed. Small beautiful moments. Self doubt and insignificant worries. And big worries. Aging, loneliness, learning what's important.This book has what I think makes a for great novel, and especially true for a Pulitzer winner. It is universal at its core. Yes at first glance it appears as a light-hearted comic love story. It has current themes in American life. But that is just the outer layer of a very tender yet simple and beautiful story of an individual person. The depth of the story sneaks up on you gradually as you get to know the heart of Arthur Less. I liked the tone of this book. It wasn't sappy or racy. It was fun but it wasn't silly. The writing was gentle and lovely. I loved traveling around the world to exotic places. I enjoyed the way the flashbacks into Less's past gradually filled in the picture of how he got to now.This book made me feel good. It made me feel a lot of things. It made me think and question. I don't think that things always have to be on a grand scale or to be gimmicky or flashy and new to have greatness in them. This was just plain wonderful."}, {"userName": "Conor", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/49782194-conor", "userReview": "So this has been on my \"to read\" list for a while--alluring cover, splashy advertising, have seen even straight people reading it on the subway. Looked like a winner! Sadly, it was not to be.\"Less\" is the story of a gay man who has lived a minor life of renown on the outskirts of a more luminous circle of literary talents, had great loves that fizzled from his own neglect, and lots of frisky and fun stories in between. On the cusp of 50 and his younger paramour having recently gotten engaged, he sets off on a world tour of escapism and last hurrahs. I think \"Less\" is supposed to be funny, and it does have some whimsy to it, but at heart it's a cautionary tale of the thing that many gay men fear--that our constant vigil for something slightly better will, before we know it, leave us lonely, bereft, and unloved in the not-so-old age bracket where we have half of our lives left but have already graduated beyond our community's morbid, age-regimented standards of desirability. As a 31 year old, I am already used to this neurosis. It's difficult to say why I didn't like this book without spoiling it, but I'll make an attempt: I felt like the characters were not very developed, and the vignettes were so tangential to each other that I only found out, to my astonishment, that this book won the 2018 Pulitzer when I googled it, thinking the book (as it was in the book with the main character's most famous work) was a retelling of some Greek legend I didn't know or had forgotten. I think the ending is sweet, but it certainly didn't feel well-earned. \"Spatchcocked\" would have been a more fitting title, and at least a gay-er, less groanworthy pun than what actually concluded the book.On a parting note, this was the most recent reading for one of my two NYC Gay Men's Book Clubs, and I had to miss the discussion because I was working that night. One of the things we've discussed in that book is why books written by and about gay men tend to always be harrowing or tragic in some way, and in a group that is supersaturated at 40 people, it was surprising and telling that not one of us could name an exception to that rule. Maybe the value in this book, written as it was by a boyish looking 50-something gay man, is in filling that lacuna?"}, {"userName": "Lacey", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/62155226-lacey", "userReview": "Thank you to NetGalley, Lee Bourdreaux Books, and Andrew Sean Greer for providing me an arc in exchange for an honest review. I love this book. I could go on and on about the main character, Arthur Less. He was one of the best characters in a book I've read in a long time. A failing novelist who can't find love and deals with it along the way. There's so many things that could go wrong in life, and Arthur Less is the champion of that happening to him. Above all, this story is about love and how it can bring you down and lift you up. This book definitely shows heartbreak. I resonate with these kind of books because I've seen love fall apart and mend back together. This book is so great because it would stand out to a lot of people for the same reason. So many people have had their hearts broken, whatever their sexual orientation is. Writing about something that so many people can talk about was definitely well done by the author. Andrew Greer really made me feel like he was the heartbroken one himself. He wrote this book so beautifully that it made me feel for Arthur on multiple occasions. Next, this book was so very quotable. There were many quotes that I will take from this book. I highlighted a lot on my Kindle, and I love when that happens because it shows how quotable a book really was. It seemed that every page had a different theme, but each theme wrapped into one big theme at the end. There was one specific quote I took from this and I think it was written in to each page: \"Just for the record: happiness is not bullshit\". And it's not. Arthur Less proves that through everything he goes through. This was absolutely wonderful to read. It was comforting because it shows that in the end, it will all work out. Arthur Less goes through a myriad of things and he comes out of it okay. It's a very important message, and it is displayed very well throughout this book on every single page you read. Overall, a beautiful, dazzling, comforting, heartbreaking read by Andrew Sean Greer and it was magnificent. I will be recommending it to a lot of people."}, {"userName": "Jennifer Blankfein", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/8904243-jennifer-blankfein", "userReview": "Funny moments with flawed, yet lovable Arthur Less was a quick, entertaining story. For more reviews visit Book Nation by Jen on https://booknationbyjen.wordpress.com."}, {"userName": "Vanessa", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/752176-vanessa", "userReview": "Just for the record: happiness is not bullshitAfter I finished my last book (In Country), I had trouble finding another one to get into. I thought this one would be a funny sort of palate cleanser. It is very funny--laugh out loud funny in several places--but I was surprised how kind of sad, warm-hearted, wise, and sweet it was too. I was not expecting to, but I ended up falling in love with this book.I had never heard of Andrew Sean Greer, but this is his sixth novel. It tells the story of Arthur Less, and you don't have to be an expert on symbolism in literary names to get the joke. Arthur is a moderately successful (at best) writer rapidly approaching 50. His last, younger boyfriend recently left him to marry another man. Arthur can't bear the awkwardness of the wedding (to which he is, naturally, invited) so he sets off on an impromptu world tour to both have an excuse to avoid the supreme awkwardness of attending the ceremony and celebrate his 50th birthday. His itinerary:•\t a public interview with a beloved scifi author he is barely aware of in New York City•\ta literary festival in Mexico where Arthur will speak about.....the literary legacy of his other significant ex (a now elderly and bedridden Pulitzer-Prize winning author)•\tan obscure literary awards ceremony in Italy•\ta visiting professorship in Germany •\ta surprise layover in Paris•\ta journey via camel across the Moroccan desert in celebration of the 50th birthday of the friend of an acquaintance•\ta writer's retreat in Southern India•\tand finally, a brief sojourn in Kyoto to write an article on local cuisine.It all sounds pretty good, if maybe a little like a gay, fictional version of Eat, Pray, Love. But the story and the character sneaked up on me. Less was amusing at first, but he's obviously in a good place in life to be able to take an impromptu jaunt around the world--nevermind the guy has a home on San Francisco's Vulcan Steps. He's still so whiny and melancholy though, just like the protagonist of his new novel which his publisher has just rejected. In the early parts of the book I wondered, \"Does Greer get how similar Less is to the character in his own book?\" How silly of me. Of course Greer gets it. And by the end, I loved this character so much I didn't want to let him go. I really liked how full the characters are. As people drift in and out of the story, they seem so complete, like they could have wandered over from their own novel to appear briefly here (my favorite has to be Zohra, the woman having her birthday in Morocco.) And the prose was gorgeous, moving easily between funny and devastating and compassionate:What was it like to live with genius? Like living alone. Like living with a tiger.....Where did the genius come from? Where did it go? Like allowing another love into the house to live with you, someone you'd never met but whom you knew he loved more than you.It is a traveler's fallacy that one should shop for clothing while abroad. Those white linen tunics, so elegant in Greece, emerge from the suitcase as mere hippie rags.... And the delicate hand batiks of Bali are first cruise wear, then curtains, then signs of impending madness. And then there is Paris. Less wears a pair of natural leather wingtips, a paint stroke of green on each toe, black fitted linen trousers with a spiraling seam, a gray inside-out T-shirt, and a hoodie jacket whose leather has been tenderly furred to the soft nubbin of an old eraser. He looks like a Fire Island supervillain rapper. \"But you broke up with him. Something's wrong. Something failed.\"\"No! No, Arthur, no, it's the opposite! I'm saying it's a success. Twenty years of joy and support and friendship, that's a success. Twenty years of anything with another person is a success. If a band stays together twenty years, it's a miracle. If a comedy duo stays together twenty years, they're a triumph. Is this night a failure because it will end in an hour? Is the sun a failure because it's going to end in a billion years? No, it's the fucking sun. Why does a marriage not count?”So now, here I am with the third book in a row that's left me with a literary hangover. I'm going to sit a minute. My dog, awakened by the sounds of typing, is trying to climb on my lap and slip his head under my fingers so I'll take the hint and rub his ears. I'm going to drink some tea. Then I'm going to take a look at my book stack and plot my next move."}, {"userName": "Neil", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/33119635-neil", "userReview": "Arthur Less is an author, a gay man approaching his fiftieth birthday. He receives an invitation to the wedding of an ex-lover which he feels it is impossible for him to either accept or decline. His solution to this dilemma is to accept all the invitations he can find to attend literary award ceremonies, literary festivals and writers’ retreats: he accepts enough of them to take him round the world and ensure he can be out of the country on the day of the wedding he wants to avoid. So begins Arthur's journey of discovery.I guess some books are victims of prior book reading and some are victims of expectations. This book was a victim of both for me. Just prior to reading this, I read/re-read Rachel Cusk's Outline trilogy which just happens to also be about an author (albeit a heterosexual female rather than a gay male) making a trip to other countries to attend literary events. For my personal tastes, Cusk is playing in the Premier League whilst Greer, err, isn’t. Secondly, I requested a copy of this book via NetGalley because it won the Pulitzer Prize. And this set a level of expectation for me. I’ve read books like The Underground Railroad, The Sympathizer, The Goldfinch and A Visit from the Goon Squad (to name just a few), so I thought I knew a little of what the Pulitzer is about. It seems I was wrong if this is also considered worthy of that award.I am quite prepared to be shown that I have missed the point, but Less appears to me to be a light-hearted comedy that tells us a life-affirming love story. The protagonist has a slightly annoying name that can cause confusion whilst reading and seems only to have that name to set up the final line of the book. It attempts to be humorous. But its humour relies on us finding badly spoken German translated back into English amusing (\"There is a fence in my book\"). Not once, but twice in different parts of the story. Or on us being amused by someone’s tears of emotion turning out to be something in their eye. That kind of thing.What I failed to see, but am happy for someone to show me, was the \"scintillating satire of the American abroad\" that was advertised.Perhaps, as I say, this book is a victim of my expectations, or perhaps I have mis-read it, but the only book I have read to which I can compare this is The Rosie Project and neither that nor this seem to me to be books that should win major literary prizes. If, on the other hand, you loved The Rosie Project, then this may well be for you.Oh, and I forgot to mention the annoying reveal of the narrator at the end. Either that or the narrator suddenly changes. If it's the same narrator throughout, that person could not possibly know the things he has written. If the narrator changes, which seems unlikely, then why!?!?My thanks to Little Brown Book group for a copy of this book via NetGalley in exchange for an honest review."}, {"userName": "Katerina", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/14577011-katerina", "userReview": "If my husband says, just read for once a real book, then I have to smile and admit, this here is a real book and he would like it.This book is something special, but it’s hard for me to describe what makes its appeal and the difference. Maybe it's Arthur's review of his life, now that he's almost 50 years old. And since I'm his age, I felt somehow connected to him. It was a special experience to accompany him on a journey around the world and to visit with him some beautiful cities that are still very vivid in my own memory, from my travels years ago. He's busy there with literary events that take him from one station to another to avoid Freddy's wedding. Freddy, his former lover. This book has its funny moments, for sure, although I would describe it also as melancholy. But maybe only I have felt that melancholy associated with aging, and the regret that nothing is changing for the better, missed opportunities that will not return, holding on to safeness, and less courage to experiment. Arthur meets a former lover on the street again, whom he doesn't recognize because of his age. He thinks hard. Then, on the basis of unmistakable gestures, he remembers the name again. Some time ago, I googled a few acquaintances that I last saw over ten years ago. I felt the same way. But, however, that was not so funny, like you would think. Inevitably thoughts come of what effect one has on others so many years later. You don't see yourself aging to that degree.Although it's a place in this book that makes you smile. Different ways here to deal with getting older.Left by his lovers, Arthur muses about love and life. In a way, it reminds me emotionally of the Tales of the City. Especially his relationship with Freddy, and also with his first lover, an older man.Yesterday I was in an Expressionist exhibition at the Albertinum, which exhibited a local artist. His life has been told, the circles of artists in which he has spoken, his few successes, even greater failures, and how dreams give way to reality.I carried the mood of this book with me, which strangely colored my perception.So let me sum up - this book gets under your skin.I am really happy to have meet Arthur.Maybe worth mentioning that the language of this book is sophisticated. It’s not to be read in passing. I really had to concentrate to capture the subtle transitions. The writing style is artistic and beautiful. Nevertheless, for me it was not a book that I could read in one go, although it has a normal page count. In between I needed something less demanding.And something else. The German translation is also a good one. Language and sentence structure are very well done.I have read the English book here. And I liked it a lot. So good that my husband gets to read it. He only reads German books. So I have taken the translation under the microscope and it's perfect too.Thank you Lena for your great review and your gift, that you made me so curious about it and that I had a very good time.Can't help it, that's how I see Freddy ;)"}, {"userName": "Doug", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/25667717-doug", "userReview": "My thanks to NetGalley and Little, Brown and Company for providing me an advance copy of the book in exchange for this honest review.This is really a lovely, charming, elegiac novel about the wistful disappointments that one inevitably faces as one grows older, and either does or doesn't find love, success and happiness. Arthur Less is a middling novelist fast approaching fifty, and looking backwards on his life with regret, and towards his unsettled future with trepidation. His younger lover of nine years has recently left him and is getting married to a new man, sending Less reeling around the world in a series of semi-comic flights from reality. Each chapter encompasses Less' adventures in a new foreign city, until he returns to his life in San Francisco ... and an unexpected and quite touching ending. Greer writes exquisite prose, and if I am a decade too old to really appreciate (or much remember) the qualms of a fifty year old, anyone can relate to the foibles of pondering the roads less travelled. My major quibble is that most of the novel is shown from the vantage point of an omniscient narrator, with infrequent interpolations from a different narrator whose identity doesn't become crystal clear till the final pages. Although that second narrator is absolutely necessary for the powerful ending (and probably WOULDN'T have worked for the entire novel as a whole), it is somewhat jarring when he suddenly intervenes to commander the navigation of the story. Still a minor fault in what was a very touching and frequently funny read.Update 4/16/18 - while I am delighted it won the Pulitzer, I must say that while reading it at NO time did I ever THINK it would!!"}, {"userName": "Charles Finch", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/8152701-charles-finch", "userReview": "Charming, funny, wise, quick, partially unsatisfying toward the end (what happened to that novel?), but worth reading"}, {"userName": "britt_brooke", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/1136632-britt-brooke", "userReview": "“Strange to be almost fifty, no? I feel like I just understood how to be young.”It took me a bit to get invested in this one, but I found Arthur Less completely endearing. Impressively-written and very clever, but bordering on cheesy at times. I loved the subtle humor. I don’t know about Pulitzer-worthy, but I liked it very much."}, {"userName": "Michelle", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/24573110-michelle", "userReview": "“Less” authored by Andrew Sean Geer: is a light and fun literary tale that includes an adventurous global whirlwind tour for the rather reserved Arthur Less. Arthur was a reasonable ordinary guy, who enjoyed moderate success as a novelist, but in the shadow of his former celebrity lover. As he approached his 5oth birthday, Arthur had gone from young to old remarkably fast. The next thing he knew, he had not only been dumped by his current lover Freddy Pelu-- but invited to the lavish wedding!Freddy Pelu had taken good care of Arthur, managing his personal life and career to the point of having an attendant hold an umbrella for Arthur in the rain. Freddy’s pending nuptials to another man suggested he had grown tired of waiting for his reluctant and wishy-washy lover. To avoid facing their mutual friends and associates at the wedding, Arthur accepted all requests for speaking engagements, and another to teach a workshop in Berlin. After his global literary tour began in NYC, he would travel abroad to Mexico City, Turin, Morocco (where he would turn 50 in the Sahara Desert). In India, he would attend a retreat near the Arabian Sea, and complete the tour in Japan.In Mexico City, his sponsors were only interested in interviewing Arthur about his relationship with the poet Robert Brownburn; who had left Arthur his small house on the San Francisco hillside after becoming a famous wealthy celebrity. To complicate matters, Robert’s former wife Marian was invited to attend. The disinterest in Arthur’s writing was painfully obvious. The plan was for Arthur to be too busy to contemplate/face the failure of his personal life and relationships, and his unconscious effort at being a poster boy novelist representing the gay community.As the novel moves towards a unpredictable and surprising conclusion, readers are reminded that the most unremarkable people can turn their lives around, reinvent themselves and find happiness. **With thanks to the Seattle Public Library."}], "description": "A breakout romantic comedy by the bestselling author of five critically acclaimed novelsWho says you can't run away from your problems?You are a failed novelist about to turn fifty. A wedding invitation arrives in the mail: your boyfriend of the past nine years is engaged to someone else. You can't say yes--it would be too awkward--and you can't say no--it would look like defeat. On your desk are a series of invitations to half-baked literary events around the world.QUESTION: How do you arrange to skip town?ANSWER: You accept them all.What would possibly go wrong? Arthur Less will almost fall in love in Paris, almost fall to his death in Berlin, barely escape to a Moroccan ski chalet from a Saharan sandstorm, accidentally book himself as the (only) writer-in-residence at a Christian Retreat Center in Southern India, and encounter, on a desert island in the Arabian Sea, the last person on Earth he wants to face. Somewhere in there: he will turn fifty. Through it all, there is his first love. And there is his last.Because, despite all these mishaps, missteps, misunderstandings and mistakes, LESS is, above all, a love story.A scintillating satire of the American abroad, a rumination on time and the human heart, a bittersweet romance of chances lost, by an author The New York Times has hailed as \"inspired, lyrical,\" \"elegiac,\" \"ingenious,\" as well as \"too sappy by half,\" LESS shows a writer at the peak of his talents raising the curtain on our shared human comedy.", "title": "Less", "url": "http://www.goodreads.com/book/show/34885212-less", "average": 3.81, "cover": "https://images.gr-assets.com/books/1492571537l/34885212.jpg", "reviews": 1278, "authors": [{"url": "https://www.goodreads.com/author/show/24892.Andrew_Sean_Greer", "name": "Andrew Sean Greer"}], "type": ["Fiction", "Lgbt", "Humor", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/34885212-less", "http://www.goodreads.com/book/show/31933085-less", "http://www.goodreads.com/book/show/36204260-less", "http://www.goodreads.com/book/show/32940847-less", "http://www.goodreads.com/book/show/16065595-the-impossible-lives-of-greta-wells", "http://www.goodreads.com/book/show/776137.The_Confessions_of_Max_Tivoli", "http://www.goodreads.com/book/show/1972091.The_Story_of_a_Marriage", "http://www.goodreads.com/book/show/707329.The_Path_of_Minor_Planets", "http://www.goodreads.com/book/show/410505.How_it_Was_for_Me"]}