{"ratings": 1392, "userreviews": [{"userName": "Steven  Godin", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "Before getting to the actual book, I was staggered to learn Helga Schneider's mother, a truly wicked woman and member of the Waffen-SS, served only a six-year prison term for minor war crimes, which, to rub salt into the wounds of the Jews, was reduced down to the fact of complete cooperation with an Allied investigating commission. Six years!, minor crimes?, what went on within the walls of Birkenau can hardly be seen as minor. OK, so she was only a guard, and nowhere near as bad as some of the other monsters who carried out mass killings. But selecting women prisoners for brothels, tearing screaming children away from their mothers, rifle butting, assisting in ghastly experiments, and on the whole, showing absolutely no remorse whatsoever for her role in the final solution looks pretty bad to me. She should have received a far more severe sentence. So, it's 1998, and after a 30 year wait, in which she discovered her mother's dark past, an older Helga received a letter asking to visit her 90 year-old mother, Traudi, now residing in a nursing home and in poor health. Traudi, during the war, cruelly abandoned her two young children, Helga and Peter, to join the SS, believing totally in the extermination of the Jews. Once the two finally meet, her mother cunningly first denies ever having children, but comes around, and vividly recounts to her daughter the horrors that played out during the time with the SS, and the reasons for walking out on her family. They talk, one in disbelief, the other in stubborn pride. I suppose Helga was looking for some sort of apology after all these years, not just for her children, but all those exterminated. Forget it. Once a Nazi, always a Nazi. She may have been half dead, with a sunken face, poor eyesight, and rancid breath, but this old hag clearly still had SS blood pumping through her knackered veins. She was, quite frankly, despicable. I would have thrown her out the window.Whilst Helga listened on, Traudi's face would light up when going into details on her disgust for the Jews, she practically blamed them for just about anything and everything. You would think at 90 years-old, a softer side may have emerged, being the final time she would get to see her offspring, but there wasn't much to say about any positives in the outcome. Helga really was torn between hating her mother and feeling sorry for her. Did she find a place in her heart to forgive?, by the end it's difficult to tell.Although dealing with some powerful themes, for me, the book read far too much like a novel. Her mother was no doubt playing around with her marbles upstairs, and I took pity on how painful this must have been for Helga, but on an emotional level I was left feeling a little empty. It's no doubt carried with a heart rendering premise, but the fact of me reading many other hard hitting books on the Holocaust, this just didn't touch me in the ticker, or punch me in the guts as much.A decent read, but with mixed results."}, {"userName": "Canadian Reader", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/2103966-canadian-reader", "userReview": "In 1941, when Helga Schneider was four and her brother Peter not even two years of age, they were abandoned by their mother. Their father, Stefan, was on the front, fighting for Hitler at the time, and an aunt and their paternal grandmother stepped in to care for the children. Soon after, Stefan remarried. Helga was not to see her mother, Traudi, for another thirty years. From Bologna (where she’d moved in 1963 as a sixteen year old) Helga travelled with her young son to Vienna to see Traudi who, she learned, had abandoned her children because of her fervent commitment to the National Socialist Party. In fact, Traudi had been a fanatical servant of the Fuhrer. During this 1971 meeting, Traudi showed complete indifference to her grandchild. Her chief interest was in proudly displaying her SS uniform to her daughter. She offered Helga a handful of heavy gold jewellery, stolen from Jews (it might come in handy one day) and revealed that she had participated in the exterminations at Auschwitz-Birkenau. But Helga Schneider’s book isn’t about the 1971 meeting—after which she determined she would expunge the woman from memory. It is actually an account of the final, two-hour meeting she and her cousin Eva had with Traudi in 1998, twenty-seven years later. Gisela, a Viennese friend of Traudi, had written to Helga in August, 1998 to report that Traudi’s health was failing. She had been behaving in increasingly bizarre ways: purging recently purchased items from her apartment, cleaning obsessively—floors flooded with pail upon pail of water, attempting to order coffins for her dead children, and regularly getting lost in the city. She was now in a home for the aged and likely had little time left. If Helga wanted to see her . . . well, perhaps this was the last chance. Helga made the journey. Her book details the intense, emotional confrontation she had with her mother, a true believer if there ever was one. Traudi had begun as an “assistant” to the doctors who performed muscle-regeneration and bone-grafting experiments on prisoners in Ravensbruck. She had then chosen to undergo “dehumanization training” in order to work at Birkenau.LET ME GO is an appalling and riveting document. Schneider judiciously incorporates some material from a text on Nazi medical experimentation and offers a play-by-play of the turbulent and complex emotions she experienced while in the presence of the frail ninety year old who was plainly cognitively compromised, yet possessed a razor-sharp recall of her time as one of Hitler’s henchwomen—one of his Furies.I know of no other written text that details the kind of encounter Helga Schneider had with Traudi. However, the book put me in mind of the equally powerful 2006 documentary INHERITANCE , whose subject is Monika Hertwig, daughter of the infamous “Butcher of Plaszow”, Amon Goeth (famously “channeled” by Ralph Fiennes for Steven Spielberg’s movie SCHINDLER’S LIST). Schneider’s book is short and can easily be read in a single sitting. I wish that the author had documented how she initially managed to find her mother at all and that she had also provided more information about her childhood, adolescence, and her life after the 1998 meeting. One can only come by these details by reading the press around the book and the relatively recent film, starring Juliet Stevenson, based on Schneider’s harrowing final encounter with the woman who had abandoned her fifty-seven years before."}, {"userName": "trovateOrtensia ", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/9616721-trovateortensia", "userReview": "\"Dopo ventisette anni oggi ti rivedo, madre, e mi domando se nel frattempo tu abbia capito quanto male hai fatto ai tuoi figli. Stanotte non ho chiuso occhio. Ora è quasi giorno; ho aperto la serranda. Un fumoso velo di luce si va schiarendo sopra i tetti di Vienna.Oggi ti rivedo, madre, ma con quali sentimenti? Che cosa può provare una figlia per una madre che ha rifiutato di fare la madre per entrare a far parte della scellerata organizzazione di Heinrich Himmler? (...) Difficile dire: nulla. Dopotutto sei mia madre. Ma impossibile dire: amore. Non posso amarti, madre\". Ho letto questo libro con un costante senso di tensione dolorosa, per il tragico intrecciarsi dei due temi che lo percorrono dalla prima all'ultima pagina: il dolore universale della Storia e il dolore privato di una figlia che non riesce a sottrarsi neppure in tarda età al trauma di un abbandono e al sentimento lacerante che la porta a desiderare di odiare la propria madre, senza riuscirci. Una vicenda di dolore e follia, di catarsi mancata, di lutto procrastinato, di disperato e incurabile desiderio di essere amati.\"E' pur sempre mia madre, e quando se ne andrà una parte di me se ne andrà con lei. Ma quale? Non trovo risposta a questa domanda\"."}, {"userName": "Amaranta", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/34720769-amaranta", "userReview": "Due donne a confronto per poche ore. Una madre e una figlia che sono quasi due sconosciute e in mezzo a loro un abisso: l'orrore dei campi di concentramento. Come una figlia può accettare di essere abbandonata da una madre che segue il Reich in ogni suo ordine e obbedisce senza pentimento alle terribili disposizioni contro gli ebrei? Dopo un'assenza che é una presenza costante in tutta la sua vita giunge il momento di fare i conti con questo vuoto. E così Helga ritorna a Vienna, una città bella ma che sente estranea, per seguire l'oscuro richiamo del sangue, per provare a scoprire se quella donna che è sua madre ha ancora un briciolo di umanità in quegli occhi che hanno visto l'Inferno e se si è pentita. Ma ha paura perché se anche quel sangue chiama il disgusto che prova per lei è impossibile da sopportare. E la freddezza con cui la madre le racconta il lavoro che svolgeva nei campi, l'orgoglio per le mansioni svolte con attenzione costante, la certezza che \"la soluzione finale\" fosse giusta si rivelano come un buco nero in cui sprofondare. E insieme a questo arriva il decadimento fisico di una donna alla fine della sua vita di una tenerezza che vorrebbe esserci ma che non trova basi su cui fondarsi. I racconti sono accennati ma brutali, le parole dure stridono, feriscono, la gola riarsa, le mani nodose, la mancanza d'aria, e raccontano di una sofferenza fisica oltre che emotiva. Sono stata a Mauthausen, ho visto forni piccoli come i cassetti dei comò perché la gente arrivava li pelle e ossa dopo lavori disumani, stanze delle \"docce\" grandi come ripostigli dove venivano assiepate centinaia di persone contemporaneamente. Ero in qualche modo \"preparata\" a quello che avrei potuto vedere e provare anche se quando ce l'hai di fronte è molto diverso. Ma la sensazione peggiore è stata quella che ho provato mentre arrivavo: una collinetta piena di verde su cui la strada si inerpicava, come un piccolo bosco e in mezzo tante villette singole, stile liberty, nella pace del verde, abitate. E mi sono immaginata come é adesso vivere lì, a due passi dal peggio dell'uomo,e come doveva essere viverci mentre il campo funzionava. L' orrore che si prova lì dentro non si può raccontare."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "At times it was difficult to continue reading this book. I stayed with it because of the mother-daughter connection. It would be hard not to feel revulsion toward oneself, knowing you were spawned by such a despicable creature. It sickens me just to think I'm a member of the same species as Helga Schneider's mother. We're not really the same species, though. I am homo sapiens and she was homo monsterus horribilis. It's bad enough that a woman would abandon her two small children without hesitation or sorrow. Worse that she would do it to serve pure evil. Helga's mother left them so she could join the SS and be a guard at Birkenau. There she selected people to be murdered, and participated in unspeakable acts of torture. She later worked at Ravensbruck, helping the \"doctors\" with their brutal experiments on Jewish prisoners. Many years later, when Helga confronted her mother about those WWII atrocities, the old woman had not one twinge of regret or remorse. With glee and pride, yes, PRIDE, she recounted the crimes she committed against thousands of innocent people."}, {"userName": "Coloma", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/33957182-coloma", "userReview": "Decidí compaginarlo con LTI para \"empaparme\" bien de nazismo real y veraz en primera persona. Este libro me ha ido golpeando duro en el estómago en cada rato de lectura. Es terrible observar la manipulación y \"lobotomía\" que pueden abocar a determinados seres a actos sin un ápice de dolor ni arrepentimiento. Una historia, una conversación, tan cruda y un comportamiento tan crudos y dolorosos que sólo te demuestran la locura humana."}, {"userName": "Michelle", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/1200378-michelle", "userReview": "This is a deeply compelling and disturbing chronicle of a daughter's final visit with the mother who abandoned her decades before in order to become a prison guard at Auschwitz. The author wrestles deeply during the visit as she seeks to understood what possibly could have motivated her mother to make the choices she did. She weaves in her personal history as she attempts to relate to and reconcile with the senile stranger she hasn't seen more than a handful of times in 30 years. She probes her frail mother in the lucid moments as she seeks answers to questions that have haunted her since childhood. How far will the author push her mother and how much manipulation from a still unrepentant woman will Schneider tolerate in the hope of hearing remorse from a woman who personally herded prisoners into the gas chambers? It's an emotionally exhausting test of wills that examines where an individual draws her own boundaries, where she is willing to compromise, and the outcome of such deeply personal choices.This is an intense read but well worth it."}, {"userName": "Denis", "userReviewDate": "Feb 19, 2009", "userURL": "http://www.goodreads.com/user/show/1729623-denis", "userReview": "An important, emotionally intense and difficult book, which should be requisite reading for anyone trying to understand what happened in Germany during the Nazi era. It is, basically, the portrait that a daughter makes of her own mother, an unrepentant and ferocious jewish-hater Nazi who, decades after the fall of the regime, still hangs on to her despicable beliefs. The frankness and discomfort of the author are heartbreaking. She tries to reach out to her mother when the latest is gravely ill, despite the fact that she despises her, and also tries to come to terms with her own guilt. She partly fails, of course, because it is impossible to come to terms with pure evil - although one can imagine that writing this book has been a necessary cathartic experience for her. It is a courageous book: writing about your own parent like this is not easy. It also illuminates one of the most troubling aspect of the Nazi era - which is actually universal: how evil lies in the most ordinary people, and how anyone, really, can become a monster. It is chilling and horrifying - some gruesome revelations are even shocking. Schneider's writing is simple and direct, as it should be with such a subject. It's the kind of book that haunts you for a long time."}, {"userName": "Sara Cristina", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/59413385-sara-cristina", "userReview": "Gosto de livros relacionados com esta temática (Holocausto), achei a premissa interessante, o testemunho de uma menina, filha de uma SS. No entanto, não foi daqueles livros que me tenha puxado tanto, como os outros. Talvez porque eu já tenha lido imensa coisa sobre o Holocausto e queira algo que me surpreenda cada vez mais."}, {"userName": "Jennifer", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/1830075-jennifer", "userReview": "What a strange read. I felt conflicted most of the time when reading this account. The style of writing is nothing special, but the content is quite haunting, though not in a good way. This is the account of an obviously confused and troubled daughter who has been abandoned by her mother when a small child so that the mother could serve Hitler in the SS. Helga (the daughter, and writer), though in her 50s now, has understandably been tormented by imaginings of what her mother did and saw as a guard at Birkenau, and also by her own resentments about the personal impacts of the loss of her mother on her adolescence.This is the record of her apparently final visit to her mother in a nursing home, and the conversations that took place in that two and a half hours or so.Its hard to know if I'm being unreasonable in considering Helga to possibly be mentally ill - I suppose it would be difficult for her to be otherwise. It's one of those situations in which we all are at our worst - seeing our mothers whom we have never forgiven and trying to pick the scabs of our old wounds and fears, whilst being revolted at what we are bringing to the light of day. I'm sure Helga is quite capable of behaving normally in everyday life - and frankly I too regress back into childhood much to my regret when my mother visits, so this resonates quite well with me (I have to say my mum is a pussycat compared to this lady!). It feels uncomfortable to visit Helga's mother with her, and to see not just the cold calculation of the SS guard that she was, but also the almost perverted curiosity of Helga about issues such as whether the Jews from the gas chambers were ever cremated whilst still alive, especially when they cut back on the quantity of crystals used to kill them, or her more understandable questions of how her mother managed to reconcile her conscience with the gassing of tiny children. I feel like a peeping tom, dragged into uncomfortably close examination of the shocking dirty unresolved washing of this relationship. It is an interesting examination, at the end of the day, of the damage done to Helga, and although there are some interesting insights into the rationalisations of those serving the Fuhrer, there are few surprises in her mother. Helga sends us back through flashbacks into episodes from her childhood which have some bearing on the stories her mother tells, some of which are guilty secrets of the influence of the regime on German children to hate Jewish people. But overall, this is a bit like a flirtation with insanity and the obscene, and I'm not altogether glad that I have read it, as much for the unflattering truths that are revealed about Helga, as for those of her mother."}, {"userName": "David", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1291846-david", "userReview": "This is a gripping and heart-wrenching memoir, that \"spoke\" to me on several levels. The author was born in Poland in 1937, and grew up in Berlin. When she was only 4, her mother abandoned the family to join the Nazi SS cause. She worked in the concentration camps, assisting in the work of genocide. Her daughter learns the terrible truth years later and spends decades of her life with no contact with the mother, until learning that she is becoming senile and weakening in a nursing home. She reluctantly goes to visit for a final conversation; most of this book documents the revelations of that day.It's a complicated investigation of emotions, motivations, relationships, conscience, confession, and self-understanding. How does a person accept a mother who participated willingly and gladly in the most horrific acts possible? How does a mother repair the wounds of abandoning her own daughter? How do you see through senility to find the true heart of a person? How does anyone understand the cruelty and bigotry that were at the heart of the Nazi atrocities?In some ways, listening to this book was a draining experience; but it was also fascinating and thought-provoking. The narrator of the audiobook is fantastic, especially in her portrayal of the old mother."}, {"userName": "Kelsey Hanson", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/14303907-kelsey-hanson", "userReview": "This is a short, but incredibly intense book about the author's attempt to connect with her former SS mother before she dies. My heart goes out to the author. This book was hard to get through at times, I can't imagine living it. The author's mother is completely unrepentant about her actions during WW II and a complete believer devoted to Hitler's ideologies. The author struggles to deal with both the abandonment of her mother in an especially challenging time period as well as coming terms to the terrible things her mother did in the concentration camps without any sign of remorse. I consider myself fairly well versed when it comes to WW II, but I was surprised to learn about the dehumanization training that SS guards had to go through to more or less make them immune to their victims' sufferings. As far as Holocaust stories go, the descriptions are not especially graphic, but oddly disturbing in their stark medical language. Hearing it from a woman who was proud of her SS career and the vile things she did is quite haunting. Though this does give me an idea of how deeply brainwashed some members of the party must have been."}, {"userName": "La.Silbia", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/4588342-la-silbia", "userReview": "In così poche pagine ci si trova a contatto con una sofferenza così grande: la sofferenza di una donna che deve affrontare la presenza ingombrante dell'assenza della madre, votata a una causa superiore ignobile fino alla fine dei suoi giorni; la sofferenza dell'odio e del disgusto mischiato al bisogno comunque incessante di avere una madre, da amare o da odiare, che porta al non potersi separare da lei, dall'idea di lei, e quindi al non poter andare oltre. E sullo sfondo il ricordo di una grande tragedia."}, {"userName": "Sandra", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/77078126-sandra", "userReview": "Corre el año 1998, y a finales de agosto, Helga recibe una carta de un empalagoso color rosa proveniente de Viena. La autora de la carta se llama Gisela Freihorst y dice ser una buena amiga de su madre. Así es como Helga se entera de que su madre aún vivía. Cuando Helga tenía 4 años, en 1941, su madre abandono a su familia para seguir su carrera militar. Pasaron 30 años, en 1971, cuando la volvió a ver. Fue en esa visita que descubrió que su madre fue miembro de las SS. En su segunda visita, 1998, espera ver en su madre, una mujer de más de 90 años, algo de arrepentimiento por su participación en los horrores de la Segunda Guerra Mundial, y quizás ver alguna demostración de amor maternal. Este libro es un testimonio de una mujer que descubre que a pesar del abandono, ausencia, vergüenza y rechazo, no le es sencillo cortar el cordón umbilical con su progenitora. Con un estilo sencillo y directo, sin regodearse en el dolor, Helga Schneider nos relata su segundo y último encuentro con su madre, una mujer que fue celadora de Auschwitz-Birkenau. Es el primer libro autobiográfico que leo en el año y el primero que leo de una sobreviviente de la Segunda Guerra Mundial en toda mi vida. Es muy interesante escuchar la voz de una mujer alemana, que si bien no sufrió los campos, sufrió la destrucción de su familia, de Berlin y de su niñez. Su dolor me dolió, su vacío lo sentí y por eso derrame mis buenas lágrimas al leerla. Han pasado un par de días desde que lo termine y sigo pensando en esa hija y en esa madre, y su relación fallida. Sin duda me robo el corazón y tiene sus 5 estrellas más que merecidas. A la autora no la conocía y este libro tampoco, pero de casualidad lo encontré, leí la sinopsis y solo eso basto para que se colara en mis lecturas. A esta buena señora pienso seguir leyéndola, lamentablemente solo han traducido 3 de sus libros, ¿por qué señores editores?.A quien lea esto, le pido encarecidamente que le de una oportunidad a esta historia, descubrirán algo que no los dejaran indiferentes. A continuación les comparto los primeros párrafos, quizás los termino de convencer:\"Viena, martes 6 de octubre de 1998. En el hotel.Hoy te vuelvo a ver, madre, después de veintisiete años, y me pregunto si durante todo este tiempo has sido consciente de cuánto daño has hecho a tus hijos. Esta noche no he pegado ojo. Ya es casi de día; he subido la persiana. Una luz mortecina se abre paso sobre los tejados de Viena.Hoy te vuelvo a ver, madre, pero ¿con qué sentimientos? ¿Qué puede sentir una hija por una madre que renunció a su papel de madre para integrarse en la perversa organización de Heinrich Himmler? ¿Respeto? Sólo por tu edad venerable. ¿Y aparte de eso?Es difícil decirlo: no siento nada. Al fin y al cabo, eres mi madre. Pero es imposible que sienta amor. No puedo amarte, madre.\""}, {"userName": "Claire ", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/7973311-claire", "userReview": "A rather unsettling book. It kept me the whole time balancing between sympathizing and detesting the MC. An haunting story, but the writing and the way it was told didn’t really appeal to me. Possibly the awful facts that it gives testimony of and the figure of the mother (cruel and senile; manipulative and longing for love) makes it a hard book to digest."}, {"userName": "Chiamartini95", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/59047000-chiamartini95", "userReview": "Helga é ormai una donna che ha superato la mezza età quando decide, dopo tantissimi anni, di rivedere la madre che ormai novantenne, vive in una casa di riposo ed è vicina alla morte. Cosa ha tenuto per così tanto tempo lontana una figlia dalla madre malata? Il passato violento e crudele della madre stessa che durante gli anni della guerra é stata uno dei membri più attivi e partecipitivi delle SS. La madre di Helga infatti, ha abbandonato i giovani figli per seguire quello che per lei era uno scopo più grande, seguire e obbedire al Fuhrer aiutandolo nel suo progetto di sterminio degli ebrei. Helga, allontanatosi volontariamente dalla madre proprio a causa dei delitti da lei compiuti spera però che con la vecchiaia il suo cuore si sia addolcito e si sia finalmente pentita. La madre si presenta infatti come un vecchietta che si muove a stento, fragile e terribilmente debole nella sua umanità, che tuttavia cela ancora un animo malvagio e privo di qualsiasi senso di colpa che ammette con lucidità che niente di più al mondo le dava piacere che \"uccidere degli sporchi ebrei\". Come può un figlia amare una madre che ha ucciso migliaia di persone volontariamente e traendone piacere? E come può una figlia arrivare ad odiare la madre, la donna che da sempre l' ha amata e che piange al solo sentirsi chiamare 'Mutti' (Mamma)? Con questo romanzo autobriografico Helga Schneider ci racconta il suo ultimo incontro con la madre e i due sentimenti incontrastanti e inconcoliabili di odio e di amore che prova nei suoi confronti."}, {"userName": "Nita", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/1279767-nita", "userReview": "Brutal. Simply brutal. I listened to it on CD and had to stop listening several times. First, there's the reality. The mother was an SS guard at birkenau concentration camp. The book includes details of atrocities to Jewish men, women and children that are very difficult to hear. I listened because I never want to forget.Unfortunately, more difficult to hear was the daughter's voice. I don't mean the woman who was reading the book, not that voice. No, it was the daughter's writing, her attitude, the way she looked at the world that was also very difficult to endure. Yes, her mother left her and her brother and father when the daughter was four. Yes the mother was awful. Yes the author was marred for life by both her mother and the war. And yet, I kept hoping for some redemption. I kept hoping that the daughter would have learned something valuable through the experience. I kept hoping that something good would come from this story. Sadly, I found nothing. The characters didn't change. It was a tale of awfulness that held no hope. Perhaps this is reality. Perhaps I am too idealistic, but it was like watching a car wreck. I could not turn away and yet I left unfulfilled.If you read it, do so with an eye toward history. Do so to remember this horrible past so we never forget it again, but don't look for an individual story of transformation. You won't find one."}, {"userName": "Laura", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/20608600-laura", "userReview": "Rather than the lengthy memoir I anticipated, this is more an essay documenting the authors conversations with the mother who abandoned her as a young child to work as an SS guard during the Holocaust. This made for difficult reading in parts, chiefly due to the mother’s obvious sadistic, egotistical nature. Following a thirty year estrangement, Helga is persuaded to visit her ailing mother in her care home in an attempt to gain some answers about her past. Her mother was ultimately convicted and served prison time for her war crimes; albeit a pitiful sentence. But her devotion to the Nazi regime and their beliefs never wavered, even as an old lady. Hearing first hand how a woman - a mother - lead other women and their babies to the gas chambers was terrifying. I would have preferred to have read continued authors notes about what happened after this strange mother daughter reunion. How did Helga come to terms with her mother’s crimes? Where is she now? How does it feel to know her own flesh and blood participated in the extermination of thousands of innocents?"}, {"userName": "Judy", "userReviewDate": "May 06, 2008", "userURL": "http://www.goodreads.com/user/show/846102-judy", "userReview": "The searing, heartwrenching, courageous, and horrifying account of a daughter's second visit in 57 years to her German mother who abandoned her when she was four years old to join Hitler's SS. Interspersed with a telling of the events of the visit are the author's memories of her childhood and of her previous visit to her mother in 1971. I recognized many German attitudes and behaviors from my own experiences with growing up with a German mother who lived through World War II, and the book has even more meaning for me because of that connection. The twisted psychology of the mother is also very interesting. She is cruel and unrepentant, but occasionally evidence of her inner torture is exposed. There is also some cruelty in the daughter's approach to dragging stories out of her mother, knowing it will be their last visit, making for an interesting comparison. I listened to the audiobook, but this is one I may have to buy and add to my bookshelf."}, {"userName": "Eva Leger", "userReviewDate": "Jul 23, 2008", "userURL": "http://www.goodreads.com/user/show/1336770-eva-leger", "userReview": "This is a great book- it's the story of a little girl who was abandoned at a very young age along with her small brother and father by her mother. Her mother decided she'd join the SS and went to work in the camps. I can't say it's the best book on the subject as a whole but it's a different perspective than I've read before and it accounts her mother still at a very odl age, not showing a bit of remorse for her actions. In fact, her mother shows the exact opposite even very near death. This goes into the authors struggle between trying to be there for her sick and dying mother and being disgusted with her as a person. I'd definitely recommend and I plan on checking out Helga Schneiders website."}, {"userName": "Kris", "userReviewDate": "Jun 28, 2008", "userURL": "http://www.goodreads.com/user/show/166503-kris", "userReview": "A true story about a young girl whose mother was active extrremely committed to the Nazi party, so much so that she essentially abandoned her husband and young children because of it, joining the SS and becoming a concentration camp guard. This narrative is written by her daughter and tells some of her mother's story and also their final meeting at a nursing home, nearly 60 years after she left in 1941. Her mother's lack of remorse is chilling. The language in the book is a bit stilted at time, perhaps because it is translated from Italian, but the story of the daughter's struggle to deal with her mother's actions is interesting and poignant."}, {"userName": "Dolceluna", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/69990469-dolceluna", "userReview": "Helga Schneider, una delle più noti testimoni del periodo nazista dal punto di vista dei civili vittime della guerra, è ritornata fra le mie letture con il suo romanzo sicuramente più intimo e sofferto: quello in cui narra dell'incontro con la madre, che aveva abbandontato lei e il fratello da piccoli per seguire la sua vocazione, ovvero diventare guardiana SS nei campi di sterminio del Fuhrer. Helga, abbandonata alla tenera età di 5 anni, rivede brevemente la madre negli anni '70 per poi ritrovarla, alla fine degli anni '90, in una triste casa di cura, vecchia e sola ma a più tratti ancora lucida e diposta a svelare alla figlia pezzi del suo passato e a soddisfare curiosità che non saranno altro che ferite. La stesura di \"Lasciami andare madre\" è indubbiamente costata molto a Helga Scheider, lacerata tra la rabbia e la vergogna per i crimini di cui la madre si è resa complice e l'incapacità di rinnegrala completamene a causa di un vincolo di sangue che, nonostante la fredezza e la sofferenza, continua a sentire: il suo bisogno di sapere la conduce in un terreno dove non avrebbe mai voluto spingersi e dove al contempo, inconsciamente, aveva sempre voluto arrivare, forse per avere finalmente delle ripsoste, delle conferme a quelle che erano le sue convinzioni...perchè la madre aveva deciso di intraprendere un'attività simile? Non aveva mai provato pena per le prigioniere? Non aveva mai provato, in seguito, senso di colpa per ciò che aveva fatto? Le risposte che Helga otterrà sono prevedibili anche quasi per lo stesso lettore. Forse il dialogo di \"Lasciami andare madre\" è fin troppo personale e al contempo complesso per essere scritto, letto e apprezzato, e quello che ne ho ricavato è una sensazione di tristezza, incompiutezza e prevedibilità che non mi ha toccata particolarmente. Tuttavia ho apprezzato lo stile lucido e intimista dell'autrice e il suo coraggio di scavare così a fondo nel suo inconscio e nel passato di una madre che, nonostante tutto, ora che è abbandonata a se stessa, la implora di non lasciarla."}, {"userName": "May ", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/17052033-may", "userReview": "¡Qué duro leer este libro! A veces era difícil seguir leyéndolo. Seguí debido a la \"relación madre-hija\" y saber si había arrepentimiento o remordimiento por parte de la madre.Déjame ir, madre es una crónica profundamente convincente e inquietante de la visita final de una hija (Helga Schneider) a la madre que la abandonó a los cuatro años para convertirse en guardia de la SS en el campo de concentración y exterminio de Bikernau (Auschwitz II). La autora lucha profundamente durante la visita mientras intenta entender qué podría haber motivado a su madre a tomar lesas decisiones. Ella teje su historia personal mientras intenta relacionarse y reconciliarse con su anciana madre que solo la ha visto dos veces después del abandono.Ella examina a su madre frágil en los momentos lúcidos mientras busca respuestas a las preguntas que la han atormentado desde su infancia. ¿Hasta qué punto Helga empujará a su madre y cuánta manipulación de su madre tolerará con la esperanza de oír el remordimiento de una mujer que llevaba personalmente a los prisioneros a las cámaras de gas?.Es una prueba emocionalmente agotadora de las voluntades que examina dónde un individuo dibuja sus propios límites, donde está dispuesta a comprometerse, y el resultado de esas decisiones tan profundamente personales."}, {"userName": "Das Spinkelchen", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/11615271-das-spinkelchen", "userReview": "Un pugno nello stomaco. Duro, durissimo. Ho difficoltà ad immaginare come deve essersi sentita Helga Schneider di fronte a questa \"madre\", che altro non è che un mostro.La speranza delusa di trovare del pentimento, di trovare dell'umanità, nella persona che ti ha messo al mondo. La speranza straziata di trovare una traccia di un sentimento diverso dall'odio e dalla cieca obbedienza al male assoluto. Un colpo al cuore. Poi i pochi (ma brevi e intensi) racconti di quanto accadeva nei campi sono veramente nauseanti. Quei racconti mi hanno lasciata stremata, nonostante io sia una persona che si documenta molto sull'argomento \"Shoah\", forse perché ho provato ad immaginare come mi sarei sentita se mia nonna (vista l'età della mamma della Schneider) fosse stata un mostro, invece di essere la persona eccezionale che era.Ho letto tante recensioni che si concentravano sullo stile della scrittura. Io l'ho trovato semplice ed adeguato e, comunque, davanti ad una storia del genere, lo stile passa, sinceramente, in secondo piano."}, {"userName": "Surymae", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/29543862-surymae", "userReview": "La sensazione suscitata da questo libro è un desiderio fortissimo di farsi la doccia e strofinarsi la pelle con tale forza da rimuoverne gli strati superficiali. Così si diventerebbe una persona nuova, vergine, e si sarebbe pronti ad affrontare un altro carico di orrore come quello donatoci da Helga Schneider. Carico di orrore che non è solo dato dalla \"trama\" (se di trama si può parlare in un romanzo autobiografico) ma sopratutto da come questa viene affrontata, in un modo che definire morboso è - sinceramente - fargli un complimento. Di nuovo, non è l'argomento a essere messo in discussione. Di libri sull'Olocausto ne sono stati fatti centinaia, migliaia, e ancora ne verranno fatti, e ognuno di questi ha una sua maniera di approcciarsi al tema. Oltre alla distinzione tra libri storici, per specialisti, e tra romanzi, c'è chi è delicato e soffuso come chi non risparmia al lettore le atrocità. Lasciami andare madre appartiene alla seconda categoria. E di per sé non sarebbe un male: come purtroppo stiamo imparando in questi giorni drammatici, mostrare senza filtri l'orrore può avere uno scopo educativo, di testimonianza. In una parola, di sensibilizzazione. Ti mostro l'orrore proprio perché ti resti dentro e capisca che non devi mai fare lo stesso. Un metodo che si può convidere come no - io ad esempio non lo condivido - ma si può quantomeno comprendere.Il problema è che Lasciami andare madre non ha nessuno scopo di testimonianza, e quindi questa morbosità non ha alcun senso di esistere. Lo si nota dall'andamento stesso della conversazione tra la madre gerarca nazista con probabile demenza senile e la figlia abbandonata, in cui è quest'ultima, con intento masochistico, a dirottarla verso i temi più terribili, anche attraverso ricatti emotivi in piena regola. E già potremmo discutere sul senso di invitare il lettore in questa conversazione privata, che riguarda comunque una donna - seppure dalla morale discutibile - non più sana di mente. Lei non si è potuta opporre al fatto che le sue parole venissero messe in stampa, il lettore non si può opporre ad assistere, seppure disgustato. Leggendo non ci si può ingannare: Helga Schneider non ha scritto questo libro per farne un documento, per testimoniare l'orrore nazista da un punto di vista alternativo, ma per un non meglio precisato tentativo di curare queste ferite insanabili, come dimostrano anche le lunghe sezioni dedicate alla matrigna che non l'aveva mai amata, e che in un vero documento storico sarebbero state semplicemente fuori posto. Purtroppo, credo che questo libro sia utile solo all'autrice. Potrò sembrare dura e senza pietà, ma Lasciami andare madre appare davvero come un lavoro di masochismo, che nel suo delirio raggiunge anche il lettore. Se volete documentarvi su Birkenau, e sui campi di concentramento in generale, leggete libri specialistici, guardate documentari, visitateli. Ma non fatevi accapalappiare da questo ricatto emotivo su larga scala."}, {"userName": "Inken", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/18206572-inken", "userReview": "Heart-rending and gut-wrenching.How do you confront the fact your mother was a Nazi concentration camp guard? How do you reconcile that she abandoned you and your baby brother because her love for the Nazi regime was greater than her love for you? How do you live with the knowledge she has no remorse or regret for her acts and indeed, proclaims pride and glee over her actions in Ravensbrück and Auschwitz? Helga Schneider has not seen her mother Traudi in 20 years. When she is contacted by her mother's friend letting her know Traudi is sick with possible dementia, Helga realises this may be her last chance to get some kind of answers from her mother about her actions during WW2. Accompanied by her cousin they visit the nursing home where Traudi is being cared for by an incredibly patient and kind staff. However, Traudi is militantly unrepentant and indeed revels in her past actions. Despite repeated questioning and a pathological need to have her mother express some regret for leaving her children to fend for themselves (aged 5 and 2) in wartime Berlin, Helga is repeatedly rebuffed and rejected. Traudi has no understanding of or interest in her children’s abandonment and pain – her love of the Führer being all-encompassing!This really isn’t a book about Helga Schneider achieving some kind of closure (gods I hate that word) or even an understanding of her mother and her own life. There is no meeting of the minds here or a tear-jerking conclusion. This is a description of what it was like for those who had to survive the collapse of the Nazi regime; left behind with the legacy of their parents while somehow atoning for the actions of others. (In Germany in 1946 all of a sudden there were no Nazisand an entire generation of children grew up with no knowledge of what their parents had done or allowed to be done until the horrible truth started coming out in the 1960s.) Like so many, Helga Schneider will never understand the brutality and sadism people like her mother delighted in on a daily basis. Thankfully she has managed to make her own life without too much of her mother’s poison infecting it."}, {"userName": "Dragonsfire", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/5742771-dragonsfire", "userReview": "\"I've lost. I've lost again.\" I agree. She got no answers. It seems the times she saw her mother were a waste of time because so many questions were left unanswered! I want answers! So yeah, I feel that leaving yet another time with nothing answered is a loss. I feel she wasted so many years feeling this anger or mixed emotions or whatever you want to call it due to her mother abandoning them that she missed that chance when she might have gotten some answers because she let so many years go by that by the time she was to confront the situation again, the mother was already senile. Maybe the mother saw her inward struggle with everything that she didn't think she was strong enough to hear the \"truth\" as she so claimed she wanted to know. Maybe that's why she never got those answers and if she was that conflicted and not strong enough to fight for those answers at an earlier time then maybe she just wasn't strong enough to handle the truth. The only bad thing is that we get no answers either. From all the Holocaust stories, this story was quite different and I feel I might have enjoyed it a lot more if those questions had actually gotten answered. I wish I had gotten a lot more insight to the mother regarding her character before she left. I wonder if that man mentioned was an influence, maybe some love interest (?), and the motive for her abandoning everything she knew and her babies and if he was the reason she pursued being a member of the SS. Maybe I missed something. I'm pretty sure she was in a hard situation being that she just couldn't understand how someone she loved and begged not to leave (her mother), someone who is our everything as children, could do such heinous things to people and feel proud about it and still have no remorse. I just wish I could have felt all that emotion everyone is talking about, but all I saw was a senile woman throwing tantrums with a few lucid seconds here and there that was very annoying."}, {"userName": "Kaz", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/5956161-kaz", "userReview": "I am half way through this book and not sure I am going to continue. Yes, it's interesting/horrifying to hear a first hand account from someone who is (still) loyal to Hitler. Yes, it's an abandoned daughter who is trying to understand her mother's leaving.Mostly? It's an obsessed daughter who is trying to vilify her mother to make it \"ok\" that she left. She pushes a 90 year old woman, who has had to live with her actions, and yeah, sticks with the whole 'what I did for the Fuhrer, I did because it was asked of me. No, they weren't people. No, I don't regret it.' But a very large part of me wonders if that mentality hasn't done anything but allow her to live without feeling crippling guilt.No, that's not ok.No, that's not an excuse.No, she should have to live with those feelings that she directly contributed to peoples -children's- deaths willingly. But she's also a very old lady, who, according to her caretaker, doesn't always know what's going on. We are told she is most lucid when talking about her time serving in the Party. Which, was an overwhelmingly huge part of her life. She chose to abandon her children, (maybe she was someone who married and had kids because that's what you did in those days, as a woman, you had no choice.) She chose to volunteer for the Nazi party. (Watching your Aryan neighbors disappear for being possible sympathizers could have been pretty nerve wracking) Possibly, her \"moments of lucidity\" aren't really true? Maybe they are stories she has heard, and immersed herself in to make herself more \"important.\" Either way, true or not, I cannot get over how these confessions are so very obviously something the daughter pushed for- she continuously verbally assaults, prods, blackmails her mother into telling her more and more and more. After not seeing each other for, 40 years? The daughter is obsessed with making her mother purely evil and not seeing her as human as well."}, {"userName": "Anna Dorywalska", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/14136038-anna-dorywalska", "userReview": "I started reading this book on the floor of Imperial War Museum bookshop. Affected by an exhibition I just saw, I wandered to the shop and this piece caught my eye.The story, of course, is heartbreaking. Helga decides to visit her mother and confront her about her past as a Nazi SS guard at concentration camps. The book recalls conversations that took place that day and describes crimes committed by Schneider's mother and her \"comrades\" during WWII. What's so horrible for the author, and the reader, is the fact that the mother doesn't seem to regret her past. In contrary, she sees her actions as commendable and doesn't seem to understand why her daughter has trouble understanding her choices, including abandoning her family in order to \"serve the country\".No one can say the story in not powerful and I won't either. What I will say though is that the writing wasn't equally strong. I wanted to find out more about the mother - daughter relationship, how her mother's choices affected Helga and the way she brought up her own son. I wanted to know more about Helga herself and how she dealt, over the years, with the tragic past of her family and I didn't feel I got to know her well (maybe for a reason and it was Helga's choice to keep it that way).Nonetheless, it's a story worth reading and I'd definitely recommend it. Treat it as an account of horrible events that took place during WWII though, rather than a diary/memoir."}, {"userName": "Colleen", "userReviewDate": "May 04, 2009", "userURL": "http://www.goodreads.com/user/show/185680-colleen", "userReview": "I just had to read this book because the premise is so unbelievable. The author's mother voluntarily abandoned her husband and children to become a Nazi guard at Auschwitz. It's very difficult to believe someone would do that. The author's mother is an absolutely unlikable human being. Besides the horrible things she did to her family and with her life, she's just a nasty woman. I don't understand how the nursing home where she lived was so accepting of her, almost cherishing her. They put up with her history, her irrational behavior; they even allowed her to keep her Nazi uniform in the closet! One thing that was missing from this book was history. Why did the author's mother turn to Nazism and desire to become an Auschwitz guard? Who may have influenced her to take this path in life? She alludes to a man but never develops that. What was the relationship like with her husband? Was there any indication that her mother might abandon her family? I know the author was young when her mother left but didn't she ever talk to her father about it? Ultimately this book left too many questions unanswered. Much of it seemed unbelievable. And it wasn't well-written. I guess it didn't need to be since the story is so incredible but it would have been nice."}], "description": "When Helga Schneider was four, her mother, Traudi, abandoned her to pursue her career. In 1998, Helga received a letter asking her to visit Traudi, now 90-years old, before she dies. Mother and daughter have met only once after Traudi left, on a disastrous visit where Helga first learnt the terrible secret of her mother's past. Traudi was as an extermination guard in Auschwitz and Ravensbruck and was involved in Nazi 'medical' experiments on prisoners. She has never expressed even the slightest remorse for her actions, yet Helga still hopes that at this final meeting she will find some way to forgive her mother.", "title": "Let Me Go", "url": "http://www.goodreads.com/book/show/23982770-let-me-go", "average": 3.71, "cover": "https://images.gr-assets.com/books/1421785989l/23982770.jpg", "reviews": 228, "authors": [{"url": "https://www.goodreads.com/author/show/13241.Helga_Schneider", "name": "Helga Schneider"}], "type": ["Nonfiction", "World War II", "History", "Autobiography", "War"], "outlinks": ["http://www.goodreads.com/book/show/23982770-let-me-go", "http://www.goodreads.com/book/show/1522423.Let_Me_Go", "http://www.goodreads.com/book/show/356920.Let_Me_Go", "http://www.goodreads.com/book/show/4590787-lasciami-andare-madre", "http://www.goodreads.com/book/show/2093076.Let_Me_Go", "http://www.goodreads.com/book/show/33800920-d-jame-ir-madre", "http://www.goodreads.com/book/show/33955507-d-jame-ir-madre", "http://www.goodreads.com/book/show/8557756-let-me-go", "http://www.goodreads.com/book/show/33805410-d-jame-ir-madre", "http://www.goodreads.com/book/show/6255066-il-rogo-di-berlino", "http://www.goodreads.com/book/show/9699561-la-baracca-dei-tristi-piaceri", "http://www.goodreads.com/book/show/9696527-stelle-di-cannella-l-ombra-di-hitler-sulla-vita-di-david-e-del-suo-gatt", "http://www.goodreads.com/book/show/9699416-il-piccolo-adolf-non-aveva-le-ciglia", "http://www.goodreads.com/book/show/9652125-heike-riprende-a-respirare"]}