{"ratings": 111, "userreviews": [{"userName": "Jonathan", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/531153-jonathan", "userReview": "In which Stead writes a book about 20 or 30 years ahead of its time and gets banned, neglected and unread for her troubles. In this book you will find some pitch perfect portrayals of still-existing types of men (and women) we really should have evolved away from by now. And a wonderfully rich insight into the interior life of a young, intelligent woman in that late 30's living in New York and having lots of the old man-troubles. Two things from Rowley’s excellent biography:  “After Stead had completed her first draft, she would re-arrange the sequence. Chapter One might become Chapter Four or the ending. Usually she wrote (or re-wrote) the beginning last of all. At this stage a new art came into play: “the art of throwing away”. She was cautious here: “By throwing away I do not mean what is called “paring to the bone.” Stead disliked revision. By then her passion was spent. For the most part, it seems, she preferred to re-write than revise. This meant rolling a fresh page into the typewriter and writing the page again, working alongside the old draft but altering as she went. Among Stead’s papers are pages and pages of slightly different drafts, all typed single-spaced on flimsy paper (light for suitcases) and with numerous crossings out. It is usually quite impossible to tell which draft is which. Not only did this method of revision involve constant typing: it also explains the appearance of spontaneity and the genuine carelessness in Stead’s writing. Ironically, this effect of spontaneity, which made it seems as if Stead wrote almost effortlessly, was achieved by monumental hard work” Which, I think, explains something about Stead's style. Also why (just like Vollmann) people sometimes say she needs \"editing\". She most certainly does not. ….. “To clarify her ideas for the novel [Letty Fox], Stead made pages of notes about the condition of women in contemporary society. The question she asked herself: “what is the solution for the restless, able, lively girl like Letty?” was one she could not answer. Marriage was not a solution for the modern bourgeois woman. Women had no security as mothers in a world in which divorce was always a possibility. If they worked or had a lover, it gave the father an excuse to apply to the court for custody of the children. Some married women prevented themselves from having children to please a husband who still harboured ‘bachelor feelings’, but this too, Stead noted, was ‘a degradation, a crushing, an abuse of them’. (And they could be ‘injured for childbearing by abortions’.). She considered the poor girl who wanted to go to night lectures and better herself: ‘Who will look after her, as a man is often looked after?’ Lowly duties were expected from women: ‘Poor slum mothers hope to let rooms to girls, because girls will clean the rooms.’…These surviving notes show Stead’s anger about the situation of women and her genuine compassion. “  Which is important to remember in case, like some reviewers, you see the satire in this novel but not the heart. It is an angry and very sad book at times, particularly in respect of the impossible bind young women found (and find) themselves in. The fact that it was banned in Australia when it was published should give you some idea of the strength of her critique. It is funny too, of course, and Stead is great at one-sentence burns.Anyway, the stats on her books remain as shit as they were when I was yelling about her genius last year, so don't know why I am wasting my breath. And no, reading Man without Children does not count you damn philistines. I have read and reviewed most of her by now. Go look at those, find one that interests you, order a second hand copy for mere pennies and read it. Ok? Good."}, {"userName": "Domenico Fina", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/69926492-domenico-fina", "userReview": "Romanzo di formazione per estenuazioneAmbientato a New York. La protagonista, che ricorda molto l'autrice, trova le sue vittorie e sconfitte per estenuazione. Vive impetuosamente le opinioni e l'esperienze possibili, le ha in sé e le contraddice. È immaginosa ma non statica. Non bella ma più attraente della bellezza uniformemente accettata. Letty Fox mostra come la dipendenza fatale in una vita non sia l'amore, non il denaro, non il sesso, non il lavoro, non lo sport, non la politica. Nemmeno l'uncinetto. L'unica dipendenza fatale è l'immaginazione. «Non saprei dire cos'è l'immaginazione se non una forma aggrovigliata, non sfoltita di memoria». Quando si deprime si dice \"mi suicido\" oppure che vorrebbe \"non esistere\" come Marina Cvetaeva. Poi come se niente fosse esce di casa e si cerca un amante, e poi un altro, il desiderio sessuale è per Letty Fox una via di scampo, piacevolissima, alla sofferenza. Potrebbe dire \"muoio per te\" e il giorno dopo morire per un altro. Ma non muore. Non ci pensa affatto. Vorrebbe sposarsi. Il disordine delle avventure non la soddisfa, l'ordine del matrimonio non la soddisfa. È disincantata e romantica. Amante della bella vita e del denaro ma come mezzo. Il fine non lo sa. Anzi lo saprebbe. Sarebbe la vita, ma è una risposta da convegno su Spinoza o Aleksandr Herzen e lei non ama farla troppo lunga. Letty Fox sfida i sentimenti, ci fa a botte tutti i giorni. Con la politica fa lo stesso, con le opinioni diffuse, spessissimo. Letty Fox e in genere l'opera intera della Stead è una grande storia di vita contraddittoria e sempre in discussione, ribelle, umoristica, furente di chi non vorrebbe isolare un'idea, un'impressione, ma farle coesistere tutte insieme, infatti nei suoi lunghi romanzi procede per accumulazione, racconta storie che ha origliato, non sfronda niente volutamente. «Eccomi qua prima avviluppavo le cose, poi le guardavo, se non stavano bene, le essudavo fuori, con nonchalance. Ed ero anche brava a scuola. Chissà com'è che le ragazze si fanno l'idea che a non mettersi il rossetto e a frequentare le feste da ballo si diventa più intelligenti». «Una donna energica come me può anche essere energicamente, perversamente pigra, e per sempre»."}, {"userName": "Katie", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/127574-katie", "userReview": "So far, this book is wonderful. 'I was one of those marrying women who married even her casual lovers: I had a very honest instinct.' No complaints but for the 600-page commitment it demands. I could probably fall for it hard. I hope it waits for me. ***Wow: fucking relentless. Relentless is the quest for a suitable husband and the money required to win him (or which he owes you after leaving)! And not only will the men, but the prose will have its way with you too. See Amy's Questions and Answers: 'Q. Should I have to do with him? The girls all say he's dangerous; and I feel it. A. That's nature's (and the girls') way of advertising their favorites.' See Letty's telling-off of Cornelius: 'You know love isn't something mystic; it's a bloody real thing, there's nothing realer; and it grows out of all that madness at night, that thing without eyes, but with legs, that fit of convulsions, all that we had--you know what love is.' Etc, etc. It tears along with gems like these everywhere. I hate to use the c-word, but there's no denying this is a type of chick lit (though in existence before that pigeonhole was even born), albeit the best written, smartest, funniest type. The first half, which covers Letty's childhood, I found a bit repetitive at times, but once Letty came of age, this book flew by for me. And even though we come to rest at the only place we could have stopped, it's clearly no real end."}, {"userName": "Alison", "userReviewDate": "Oct 25, 2009", "userURL": "http://www.goodreads.com/user/show/71127-alison", "userReview": "For ways to read this book, see Tim Parks' useful and multifaceted introduction. To which I add that Stead is the last word on the genre of the Complaint Epic, and that Letty anticipates the concerns of contemporary women's commercial fiction by 40-50 years. An incredibly difficult book to read, but worth it for Stead's artistry and ambition."}, {"userName": "ifjuly", "userReviewDate": "May 02, 2007", "userURL": "http://www.goodreads.com/user/show/42472-ifjuly", "userReview": "people talk about how christina stead's great weakness is not knowing what to edit/weed out. and it's true, sure, but i dunno...i kinda like that. it makes her lengthy detailed repetitive books of female domestic and familial experience feel more authentic and less literary, in a way i enjoy. like you're at the kitchen table reading the unexpurgated letters from your batty aunt who doesn't know the meaning of discretion, or something. \"fun.\""}, {"userName": "McKenzie Wark", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/5764396-mckenzie-wark", "userReview": "I read a different edition, but whatever. Its a terrific novel, way ahead of its time. Stead is writing a satire of the 'progressive' middle classes, which despite their supposed beliefs are just as obsessed with property as any other middle class."}, {"userName": "Amelia", "userReviewDate": "Mar 10, 2009", "userURL": "http://www.goodreads.com/user/show/1428427-amelia", "userReview": "Like Mary McCarthy's \"the group\" (new york in the thirties, satirizing the sexual revolution before it happened) but way more cosmopolitan, lurid, and generally wacky. It's worth reading for not only for the sexual misshaps, but also for the sweet, subtle way that Stead voices her inimitable narrator. Why there was not a movie version of this made in the 70's is beyond my grasp."}, {"userName": "Jennie Rogers", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/112549-jennie-rogers", "userReview": "want to have drinks with Letty. i was surprised by how much i related to her dating experience."}, {"userName": "Olive Sparrow", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/43702784-olive-sparrow", "userReview": "I took so long reading this book because I didn't want it to end. I enjoyed every page. It's one of the few books I could reread and still enjoy just as much as the first time."}, {"userName": "Dan Leo", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/92181-dan-leo", "userReview": "“Letty Fox: Her Luck” has become one of my favorite novels: a long, dense, nearly plotless story of a talented and lively and very funny young woman’s life from girlhood in the 1920s to the age of 24 in 1945, a book filled with dozens of characters, all of them very real even if they only appear for a few pages, a book with a voice as unique as the voice of someone you love, someone who only has to call “Hello” from half a block away and you know who it is and all that person’s rich history, one of those books I would gladly have had go on and on without an end, but somehow it ended at just the right place. After too many affairs to list our bold heroine finally marries a guy, a bit of a rounder like most of the guys she has loved, from a wealthy family, and whose father promptly disinherits him because the old boy wanted the guy to marry someone else, but Letty and the guy don’t care. The novel ends with:“We went back to the hotel and, as I said, this is exactly where this finds me now; I don’t think for a moment that this is the end of everything, but I’m no tea-leaf reader. I can only tangle with situations as they come along. On s’engage et puis on voit. Perhaps I just love life. I certainly expose myself to it; and I’m accessible to it. I don’t ask myself, Will this last? It’s a question of getting through life, which is quite a siege, with some self-respect. Before I was married, I had none; now, I respect not only my present position, but also all the efforts I made, in every direction, to get here. I was not always honest, but I had grit, pretty much; what else is there to it? The principle thing is, I got a start in life, and it’s from now on. I have a freight, I cast off, the journey has begun.”"}, {"userName": "Jessica", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/7451465-jessica", "userReview": "Like \nCoonardoo\n, this is a novel I read because I was trying to get more familiar with my own country's literature. Like that book, Letty Fox was written in the first half of the twentieth century by an Australian, Marxist, female writer, and it was also met with outrage in Australia upon publication – Letty Fox was actually banned here for many years for being too frank in its depictions of sex.Aside from that, the books couldn't be any less similar. This book is set in the glitzy cities of New York, Paris and London, not a remote cattle station in northern WA. Some of the other reviews of this book have described it as a type of chick-lit from before chick-lit existed, and perhaps to some extent it is, but it's also deeper than that. The book is very much situated in time and place – it shows Letty growing up during the Roaring Twenties, then the Depression, then finally being a young adult in World War Two; it's reasonably political too, even openly political, seeing as (maybe not actually) every second character in this book is a socialist.I'm inclined to see this book as drawing heavily on Christina Stead's own experiences, particularly of the milieu she moved in. As I said, tons of the characters here are socialists – they're also largely filthy rich. Letty moves in circles of aristocrats, writers, publishers; her grandmothers are both rich and one leaves her a large inheritance; she's enormously pretentious and insists on discussing philosophy in French (and by this I am referring to a page describing a conversation she had with one of her boyfriends, all about pretentious philosophy, in French, with no translations provided. This book is profoundly self-indulgent.). Essentially, Letty Fox moves in that Transatlantic intellectual elite which may profess to be Marxist, but only insofar as it doesn't jeopardise their careers and God forbid they should ever associate with poor people.This may, of course, be one of the times where reading the introduction has influenced my opinion when subsequently reading the book; the introduction is written by a feminist publisher who chose to reprint this in the seventies or eighties because of its compelling depiction of heterosexual relationships, in all their dysfunctional glory. However, they found that Christina Stead herself was not too keen to be associated with a feminist publishing house, proudly declaring her love for men and insisting it's actually women who are the true parasites in society (even more than the bourgeoisie, apparently…) because so many of them \"refuse\" to do paid work after marriage. This grossly undervalues the huge amount of unpaid work that women, largely, did and still do; it also ignores the huge institutional obstacles unmarried women faced in landing a job. But no, they're all parasites! Okay.And the novel does, to a large extent, portray many of its female characters as parasites. Letty, as narrator, is constantly describing her female relatives and their acquaintances as \"scheming\" – how to snag a rich man, how to divorce him so as to claim alimony, how to jail them for not paying alimony. More than one male character goes to jail for falling behind on alimony payments.But honestly, the novel portrays its male characters as universally flawed too, and I'd prefer to look at this novel as an examination of how women's oppression under capitalism royally fucks up heterosexual relationships. Marriage is primarily depicted as the way women ensured their economic security, and only secondarily about love. Men are depicted as, generally, womanisers, while women (and especially young women!) fall way too hard for men who don't deserve it. While the circle Letty moves in is quite upper-class, she herself is constantly short on money, and I think her constant pursuit of \"the right man\" reflects this shortage. Her parents' marriage is disastrously bad. If this novel is anything, it's a depiction of some of (lots of) the myriad ways in which heterosexual relationships go bad.So despite its self-indulgence, the pretentious French, and the fact that for all my \"trying to understand my own country's literature\" the novel doesn't even mention Australia once, I did enjoy this. I'm even keen to read more Christina Stead, although I hope she wrote some books that are less than 662 pages long, because that got tiresome and I'm sure there are some unnecessary detours she could have skipped. It's an interesting work."}, {"userName": "Lionzo", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/22916630-lionzo", "userReview": "\"You know love isn't something mystic; it's a bloody real thing, there's nothing realer; and it grows out of all that madness at night, that growing together in the night, that thing without eyes, but with legs, that fit of convulsions, all that we had-you know what love is.\"- Letty FoxAfter reading \"The man who loved children\" I jumped into Letty Fox without hesitation, I was prepared for another amazing read, filled with odd characters, laughs, drama, and a series of interesting perspectives to examine. Boy, this book delivered all of that and so much more. Letty Fox is a book that stands out on it's own, a book so far ahead of it's time, it's absolute genius, Christina Stead and her writing is fabulous to the core.There's a feeling I got when reading this book similar to it's predecessor, it's as if all the characters, story lines, and descriptions are real as if I'm a part of their lives. Letty Fox makes a superb narrator and explains things perfectly, with wit, cheekiness, sassiness, humor, theatrics, and pure realness. Her misadventures and love affairs enthralled me making me laugh or just roll my eyes. Her family and their progression throughout the story also held my attention because Letty never failed to say what was exactly on her mind. I laughed so much at some of the absurdity of these characters it was such a blast.The writing is crisp, original, and honest. Christina Stead is genius! she writes things in this book that are dangerously true about humans, our natures, our morals, our ideas, and our true selves. I really enjoyed reading about a female main character going through affairs, relationships, and trying to find her way in life. A book like this successfully shows how males and females are both sexual beings and will chase after love in the most foolish and hilarious ways.The connections to make are endless, the effects parents and families have on their children is evident in this book, characters like Edwidge, Jacky, and Andrea really made me laugh with tears in my eyes. They were drastic, obsessive, or just wicked (Edwige especially) and Letty's accounts of her family and her lovers are sharp and stir all kinds of emotions. I could go on forever explaining different plots and themes in this book but that's unnecessary. Letty Fox is a book that truly shines, it's brilliant, thought provoking and extremely comical and I couldn't ask for more in a book."}, {"userName": "Bob Newman", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/72341080-bob-newman", "userReview": "La Pointilliste of LiteratureSeurat, Pissaro, and Van Gogh painted pictures made up of points of color---seen too closely, they look just like a bunch of dots, without much meaning. Step back and you see a sophisticated landscape or portrait. These were the pointillistes of French Impressionist art. As I read this penetrating character study constructed of 517 pages of trivia, banal conversations, epigrams, and thoughts, I thought over and over that this novel resembled more than a little a pointilliste painting. Any one page seems trivial and even directionless. As you continue, you realize that a powerful portrait is being built. There is no plot except the life of Letty Fox, a strong young woman whose licentious, impecunious, immature/mature ways stem from her own dysfunctional family background of similar qualities. It is a coming of age tale that takes place from the mid-1920s to 1945 in New York, New Jersey, and (occasionally) England and France in a welter of bizarre characters. Letty Fox is the kind of person who, in real life, never writes her autobiography, or if she does, writes in a most self-aggrandizing manner. She longs for romance but gets mostly men interested in one-night stands, for marriage to a wealthy man, but most of them skip town, for interesting work but she tires of a job quickly, for a normal family (but does such an animal exist ? I think Stead would say no.) Letty Fox is in love with life, but unlike some of her leftwing friends, she is more realistic. She samples whatever she can, but chooses very little. Contradictions abound. Freedom vs marriage. Sex vs. love. Friends vs. living alone. Idealism vs. cynicism. Above all, Letty is a feminist, though she never refers to herself in such terms.. She refuses to kowtow to current prejudices, yet revels in modern New York life as much as she can. You can pick out hundreds of quotations like the following to express her feelings: \"I sometimes wondered at the infinite distance between the state of not being married---and whatever the gradation of not being married, it made no difference---and the state of being married. How did people bridge the gap ? It seemed to happen to others---most others: never to me; and I thought it very peculiar. I couldn't figure it out; perhaps I was too young, anyway; but it savored to me of magic, and I felt very miserable that in this modern world something so primary, this first of all things to a woman, smacked so strongly of the tribal priest, the smoky cult, the tom-tom, the blood sacrifice, the hidden mystery. It didn't seem fair. We should have abolished all that with enlightenment.\" p.413-14\"I was born to live with all the ardor of my blood and to mate and breed, and laugh at my grandchildren. These monastic notions were not for me.\" (rejects sacrificial fantasies, rejects ideals of doing good) p.419\"What is the use of a man if one can't be forthright with him ? I would never hedge and plot with a man, thought I.\" p.489 While Stead's \"The Man Who Loved Children\" focusses on a man and family relations, LF:HL is firmly about one woman and the slow transformation of her connection to family, friends, the world of work, and the world of sex and romance. It's not an easy read, because at times you feel you are not getting anywhere. Perhaps it could have been cut down, but then again, maybe the repetitiveness is an integral part of the whole picture. You have to keep your mind on that picture, not the myriad of dots. If you do, you'll find a most interesting novel, like Letty Fox herself, not at all average."}, {"userName": "Justin", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/12086605-justin", "userReview": "Letty the central character just goes on and on and on, some of it is quite amusing and entertaining, but in the end it got to me and I had to stop"}, {"userName": "Aveugle Vogel", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/65591402-aveugle-vogel", "userReview": "\"this lithosphere\""}, {"userName": "Tony", "userReviewDate": "Jul 13, 2012", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "LETTY FOX: HER LUCK. (1946). Christina Stead. ***.\tI have to admit up front that I only made it half-way through this novel – 300 pages or so. At that point I came to realize that the plot had not advanced even a little from the first pages. Letty, a young girl when we meet her, tells the story of her growing up in a very dysfunctional family. Her mother and father were separated. Her mother was constantly trying to figure out how to get her husband back again, while he was always parrying each new effort with a response usually involving more money. He was happy with his new woman – whoever that happened to be at the time. Her father must have been quite the man, able to juggle multiple women in the air at one time. What we encounter, time after time, is this struggle between husband and wife. Both have their definitions of marital happiness; both encompass selfish definitions. Her mother’s definition devolves around the traditional definition of “family,” while her father’s is based on “freedom.” The same dialog goes on between husband and wife for all of the 300 pages, the only difference being that sometimes it takes place in New York, while at other times it takes place in Paris or London. There was no hint of any resolution up to the point where I had to stop because I was becoming terminally BORED. There is no question that Ms. Stead had remarkable powers of description – of both her characters and place – but couldn’t seem to move this story forward.. Her positions on life, love, and sex take on no personal meaning other that what is reflected in her parents’ behavior. Although Ms. Stead had an excellent reputation among other writers, she failed to touch this reader in any way. Perhaps the better book to start out with from Stead’s works would be “The Man Who Loved Children.” That one goes on my list. This one comes off."}, {"userName": "Olivia", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/327135-olivia", "userReview": "mentioned here: http://www.thesmartset.com/article/ar..."}, {"userName": "Casey", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/307203-casey", "userReview": "A moving, deeply-felt novel about some very fucked-up characters. The author's voice is unique and the writing is outstanding; I wish more of her books were in print."}, {"userName": "Caty", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/1755710-caty", "userReview": "OR a Survey of Heterosexuality in NYC in the 30s and 40s. Ends with a triumphant marriage. Seriously? On the other hand, interesting observations about radicalism of the period."}], "description": "One hot night last spring, after waiting fruitlessly for a call from my then lover, with whom I had quarreled the same afternoon, and finding one of my black moods upon me, I flung out of my lonely room on the ninth floor (unlucky number) in a hotel in lower Fifth Avenue and rushed into the streets of the Village, feeling bad.So begins Letty Fox's own story, a comic extravaganza in which she tells about the crazy circus of her early life; about her moping mother, absent father, and two impossible sisters; about work and play, sex and men, and the seemingly unending search for a lasting relationship. This vast Flemish canvas of a novel, full of strikingly realistic likenesses and unforgettable grotesques, is a major work by one of the outstanding novelists of the twentieth century.", "title": "Letty Fox: Her Luck", "url": "http://www.goodreads.com/book/show/132508.Letty_Fox", "average": 3.65, "cover": "https://images.gr-assets.com/books/1320400476l/132508.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/76328.Christina_Stead", "name": "Christina Stead"}, {"url": "https://www.goodreads.com/author/show/41773.Tim_Parks", "name": "Tim Parks"}], "type": ["Fiction", "Cultural", "Womens", "Literature", "New York"], "outlinks": ["http://www.goodreads.com/book/show/132508.Letty_Fox", "http://www.goodreads.com/book/show/1382879.Letty_Fox", "http://www.goodreads.com/book/show/9696025-letty-fox", "http://www.goodreads.com/book/show/35071581-letty-fox", "http://www.goodreads.com/book/show/14812578-letty-fox", "http://www.goodreads.com/book/show/16072942-letty-fox", "http://www.goodreads.com/book/show/304344.The_Man_Who_Loved_Children", "http://www.goodreads.com/book/show/1437766.For_Love_Alone", "http://www.goodreads.com/book/show/1671759.Seven_Poor_Men_of_Sydney", "http://www.goodreads.com/book/show/2258395.The_Little_Hotel", "http://www.goodreads.com/book/show/2104153.The_Salzburg_Tales"]}