{"ratings": 8735, "userreviews": [{"userName": "Maureen", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "* Thank you to Netgalley & Bonnier Zaffre UK for my ARC in exchange for a fair and honest review*(4.5 Big Fat Stars)Joe Lynch is happy with his life - he adores his wife Mel and their son William. He's an English teacher who gets to spend quality time with his son since he started working part-time. However, Joe's naivety is going to bring his whole way of life to the very brink. On the fateful day that Joe sees his wife's car entering an underground car park, and decides to follow her, his life will never ever be the same again. He witnesses her arguing with family friend Ben, and life as he knew it will begin to unravel in a most spectacular fashion.Omg! What a page turner this was. I actually found Joe to be very naive and there were times when I wanted to shout \" Open your eyes Joe, see what's really going on around you\" However, I still loved this book, it was so scary, the manner in which Joe's life disintegrated, a man who was completely innocent of any wrongdoing. This book is a great example of why psychological thrillers are so popular right now. If you get the chance to read this one, grab it with both hands and relish every moment."}, {"userName": "Arah-Lynda", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "I’m giving it up for TM Logan and his Lies.  They held me captive from cover to cover.WHAT IF YOUR WHOLE LIFE WAS BASED ON LIES?First of all, I liked Joe Lynch.  Sure he was a little too trusting and naïve but pray tell, who among us has not been that, at some point or another.  And yes I wanted to smack him a couple times myself, you know, Pay Attention Buddy, type smacks. Have you ever dropped in unexpectedly on your spouse, when and where they least expected to see you?Joe Lynch did when his young son, Will, spotted his wife’s car in traffic,  he followed, intrigued as she turned into a hotel car park.   Just one impulsive decision and BAM, Joe’s life will never be the same.  Not for him, his family or their friends either. The fabric of our lives can seem so thin when it is suddenly pulled out from under us, never more so than when it has been woven with lies, one overlapping another. And now Joe’s very freedom is at risk and so much more. It would seem that the trend in writing these days is the unexpected twist, which in effect you know, completely negates the whole unanticipated thing.  Enough said about that. :)If you like psychological thrillers that are both relatable and compelling, I can assure you that this one will keep you turning those pages.   This is my first experience with TM Logan but I will most definitely be going back to the well. My thanks to Bonnier Zaffre, Twenty7 Books, TM Logan and NetGalley for the opportunity to read this advance copy."}, {"userName": "Linda", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "Lies seem to stick to one another like tree sap enticing insects. Once you get near enough, there's no way out.Four year old William spots his mother's familiar car entering into a below ground parking lot of a hotel in North London while riding in the back seat of his father's car. He begs his father, Joe Lynch, to follow her course and surprise her. Joe turns around and the two pursue Melissa into the hotel. From a distance Joe can spot his wife in a heated argument with Ben Delaney, a family friend. Something doesn't seem quite right. Joe swoops up William and they rush back to the parking lot.Suddenly, Ben is behind Joe and an argument ensues. Joe backs off, but Ben punches him and in the midst of the encounter Ben falls backwards and hits his head. Just then William appears gasping for breath and in the middle of an asthma attack. There's no \"puff puff\" in the glove compartment so Joe rushes home leaving Ben on the ground. When they return to the parking lot later, there is no sign of Ben. He doesn't answer his cell phone. What exactly happened here?T.M. Logan will take readers on quite the tension-filled ride through our present day dependency on the internet and the lock-in of technology. We never actually realize the intrusive nature of that lovely convenience held constantly in the palm of our hand. Joe Lynch will be brought to his senses as he finds himself on the receiving end of technology that outsmarts him at every step. And, of course, there's an app and software for every need, now isn't there? But it's the human element and its very input that lights the match.I actually rated this one more at 3.5* but kicked it up to 4*. The beginning stages of the book were highly addictive. The second half seemed to drift off into building a contrived set with all the remaining Legos. Some pieces fit. Others did not. Still an entertaining read. Let's see what T.M. Logan has up his sleeve for the next one.I received a copy of Lies through NetGalley for an honest review. My thanks to Bonnier Zaffre Books and to T.M. Logan for the opportunity."}, {"userName": "Carol", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "SUPER INTENSE START leads to LIES  on top of LIES and major betrayals....for eight terrible days.\n\"I often wonder what would have happened if I hadn't seen her car that day.\"\nSo.........Meet Joseph Lynch. He's super tall, has a beautiful wife, an inquisitive young son he adores, a comfortable profession as a part time schoolteacher, AND is happy and content with life. He's also rather meek, mild-mannered, considerate of others and unbelievably too forgiving, but a likable guy nonetheless who always, always plays by the rules....until he doesn't....as you will see.The world of technology and social media can be a dangerous place and is a great setting for the biggest LIES of all in T. M. Logan's work of mysterious domestic unrest. Really thought I had it all figured out early on, but NOPE....there's more here than meets the eye!Good mystery-thriller debut, and oh....love this quote.......... \n\"Cats don't need anyone. They live in the moment and trust their eyes and ears, what they can see in front of them---I think we can all learn something from that.\"\nMany thanks to St. Martin's Press for the complimentary ebook via NetGalley in exchange for review."}, {"userName": "Zoeytron", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Copy furnished by Net Galley for the price of a review.Joe and Mel, happily married for 12 years.  They don't lie to each other.  Period.  Oh, wait. . . . yes, they do.  Lots o' lies, untruths by the score.  Social media and tech savviness play a big part in this tale of misdirection.    This was a real page-swiper for me.  Good tight writing, nicely paced."}, {"userName": "Sue", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/3908840-sue", "userReview": "LIES is a well written debut psychological thriller by T.M. Logan. This one is sure to please and will have you flipping the pages. WHAT IF YOUR WHOLE LIFE WAS BASED ON LIES?When Joe Lynch while driving his son, William home stumbles across his wife driving into a hotel car park while she's supposed to be at work, he's intrigued enough to follow her in.Joe Lynch is a high school teacher happily married to wife, Mel with son, William. But Joe is so naive…I wanted him to wake up and smell the roses!When Joe witnesses his wife in an angry dispute with Ben, the husband of Mel’s best friend, Beth, he knows he must step in. But the conflict between the two men turns violent, and Ben is knocked unconscious, Joe's young son has an asthma attack and Joe must leave the scene in order to get help.When Joe returns to the scene to make sure Ben is OK, Joe is horrified to find that Ben and his car have disappeared.And then Joe’s world falls apart! He starts to receive emails and text messages from Ben! Ben says he's going to take everything away from Joe ... his wife, his house, his son, his job!Ben’s wife reports to the authorities that Ben is missing…and Joe becomes the suspect!Joe must discover the truth to prove his innocence.This is a well-written debut psychological thriller with well-developed characters, and an excellent plot. The first-person perspective worked really well through Joe’s POV. Fast-paced with lots of twists, turns and a major final twist that I didn’t see coming.Many thanks to T.M. Logan, Bonnier Zaffre, Twenty7 Books and Netgalley for the ARC."}, {"userName": "Erin", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "4 incredibly hard to put down stars OH MY GOODNESS! This was a delicious rainy day read and I was completely captivated from beginning to end. Each chapter made my head spin as T.M. Logan just kept taking me deeper and deeper into a mystery that kept playing with my head. The less you know, the more enjoyable your read will be.So strap on the seatbelt and prepare yourself for a very bumpy ride.  Thanks to NetGalley for an advanced ebook in exchange for an honest review."}, {"userName": "Lee", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/13487611-lee", "userReview": "This is my kind of book and I loved it! Joe Lynch, his wife Mel and son William seem to be a very happy family. One day when Joe and William are driving home William sees a car that looks like his mum's. This is a game that William likes to play each time he sees a VW Golf. Joe is ready to disregard this as there are so many cars like this on the road but as the car pulls into an underground carpark Joe realises that it is his wife's car so he follows her, curious as she is meant to be at work. Joe then finds his wife having what seems to be a very heated exchange with a family friend Ben. His wife then drives away but Joe decides to speak to Ben to see what is wrong. The talk then turns into a nasty altercation and ends with Ben unconcious on the ground. William is in the car and Joe sees that he is having an asthma attack so he rushes home to get an inhaler. Once William is settled, Joe gets back in the car to return to the carpark to find out how Ben is but Ben is no longer there and has disappeared. This begins a very exciting story and outlines how well do we really know those close to us. If you like psychological thrillers this book is for you."}, {"userName": "Rachel Hall", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/28372189-rachel-hall", "userReview": "This is a fast and highly readable psychological thriller than centres around cutting edge technology, hacked social media apps and a whole swathe of lies that rapidly send the life of thirty-four-year old English teacher, Joe Lynch, into free fall. Suddenly his marriage, career and freedom are all put to the test when he becomes the target of an obsessive technology entrepreneur who gets exactly what he wants and is very used to winning; in this instance, Joe’s partner of twelve-years, wife for the nine and mother of his four-year-old son, William. Or so it seems, and whilst niggling doubts force Joe to continually question the evidence and just what he is seeing, he is unable to turn back the clock and once the genie is of out the bottle the collateral damage is only a matter of time. What starts as familiar psychological thriller territory with a split second decision results in unprecedented upheaval in the life of the Lynch family.The trivial decision that leads up to the fallout is a chance sighting of wife, Melissa’s car on a school run home, with young son, William, eager to share the news of his superstar certificate from show it to his mum. Following her into a Premier Inn car park, Joe witnesses a heated exchange between Mel and former working class Northerner, turned self-made millionaire and alpha male, Ben Delaney, the husband of a close female friend of hers. from school. As Joe confronts Ben, an angry scuffle ensues and results in an unconscious Ben sprawled on the concrete floor and unresponsive. When Joe returns to the scene there is no sign of either Ben or his swish car, but that evening a series of incriminating social media posts on Joe’s Facebook timeline are just the first of some increasingly strange happenings. Days later and unable to make contact with Ben the news from his fragile wife, Beth, that he has disappeared and gone incommunicado puts friendships under strain with Joe and Mel both knowing just a little too much about his final movements before the disappearance.Losing his phone and having his Facebook account hacked is just the start of Joe’s unravelling as it appears that his nemesis in lying in wait in the shadows and staying carefully out of the public domain, all in a very concerted effort to necessitate the police to up the investigation into the whereabouts of Ben from missing person status to concern for his safety and a proof-of-life inquiry. All it takes is a week and a day for Joe to go from voluntarily approaching the police right through to his arrest for murder in what is treated as a no-body murder inquiry. As it seems that the onus on acquiring proof that Ben is behind his nightmare is on Joe’s shoulder, he realises that he must take proactive action to save his own skin. For all the unknown mobiles and emails that Joe believes is evidence of Ben’s stalking with intent to harm, the police counter with their own reservations, appearing sceptical that Joe has been doing anything but simply trying to wilfully obtain evidence of stalking where none exists. Just as he makes headway, wife Mel is waiting with a further tearful revelation and no soon has she promised that she is done with the lies and has told Joe the truth, once and for all, the beleaguered and beaten Joe finds himself on the receiving end of another blow. The longer the story progressed it is increasingly hard to believe that Melissa is ever being straight with Joe, despite her continued ascertains that she has disclosed everything any savvy reader will be yelling, “yeah, right..” as Joe is lured back for yet more punishment. Honestly, Joe acts like he is punch drunk, reeling from one disclosure to the next technology headache, from spyware, tracking devices, Bluetooth, forensic analysis of text messaging right through to metadata (“data about data”).Although this starts by examining a likely scenario which is perfectly believable and the technology intricacies have been pinned down brilliantly to make most of the story potentially plausible, it all feels rather like trial by technology and social media and for me it did become a little repetitive. The writing is pretty bog-standard and feels more like a series of diary accounts being relayed, with next to no examination of heartfelt emotions but with the emphasis on the fast and furious description of events. Whilst this style of writing is perfectly readable, it is pretty anodyne and hard to get behind with any real heart. The characterisation also feels a little weak and although it is Joe who readers will come to know the best he is the living and breathing embodiment of a naive, wide-eyed family man who bears the brunt of the childcare with Mel assuming the role of the more independent party. Joe’s middle name should be “sucker” and leading ladies Mel and wife of Ben, Beth, just feel a little detached and removed from the emotion. I found myself continuously questioning events the longer this one went on and at just shy of five-hundred-pages, it does go on (and on)!Would a dynamic businessman with his own highly profitable company really go off the radar as it appears that Ben has? Would the police really be satisfied with the results of a cursory glance for a proof of life inquiry before launching so speedily into focusing on foul play? Would a successful family man go to such extraordinary lengths to cause someone damage? Lie’s is marred a little by several disappointing aspects, firstly the absolutely ludicrous and over the top police response. Given that local police stations in the suburbs of London are now being closed down and manpower is leaner than ever, it is ridiculous to believe that the police would quickly launch into a full scale search for a body and have the spare capacity to devote their energies to a full scale search of a woods with ground-penetrating radar and police divers, and then a full house search and seizure.Whilst Lie’s doesn’t really bring anything new to the psychological thriller genre, merely concentrating on how much social media and technology have the potential to impact a person's life, it does add another perspective to things and has made me consider how much technology has impinged upon all our lives. Posing questions about a persons relationship with technology and how much importance it has come to assume over our lives, this mediocre psychological thriller is a rapid, quick-fire read, but the basic premise of, “can I trust my partner?”, lies at the root and is a little overdone within the genre. What now feels like the required left-field twist that hijacks the story into the closing pages never really rang true for me and even looking back on the novel after finishing it there was never any indication of what was to come. Perhaps if T.M. Logan has dropped a few hints along the way his conclusion might have all felt a little more plausible. Not recommended for Luddite’s who loathe the way technology has overtaken the world and altered our communications."}, {"userName": "Erin Clemence", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/16907451-erin-clemence", "userReview": "Thanks to NetGalley and the publisher for a free, electronic ARC of this novel. \nDuring an unexpected detour on a drive out with his son, Joe spots his wife, arguing heatedly with their long-time friend, Ben. Soon, Joe is chasing Ben out of the parking lot and an accident happens, leaving Ben wounded and unconscious. Joe believes Ben is dead until he begins to receive cryptic messages from him. Joe quickly realizes that his wife has a secret, and so, in fact, does Ben. When Joe is arrested for Ben’s murder, he begins to wonder-how far will Ben go to get what he wants? “Lies” by T.M Logan is a riveting, suspenseful story that makes you question everything and everyone. A powerful story with an unpredictable ending, “Lies” entices storytellers from the very beginning, with a strong plot and great characters. Joe and Mel seem like the perfect couple from the outside, and it is only after Ben is injured, that we begin to see how quickly life can all unravel. Logan writes with honesty and grit, and his cliff-hanging chapter endings contributed to this novel’s complete “un-put-down-ability”. Not only does Logan keep a reader on her toes, but he also has a knack for making a reader paranoid and doubtful of his fellow man (even those close to her).The plot of this story was particularly creative, as it is the kind of novel that could end very predictably, and there were many times when I thought I had figured out the end, but I didn’t even come close. I doubted Joe, I doubted Mel (his wife), I doubted everyone- no one was safe from my judgment. However, when the end came, I was extremely satisfied and completely taken aback. The ending alone deserves high praise. This novel is everything you could want in a suspense novel. I very much look forward to exploring Logan’s other novels."}, {"userName": "Danielle (The Blonde Likes Books)", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/19967008-danielle-the-blonde-likes-books", "userReview": "For more of my reviews visit my blog at https://theblondelikesbooks.wordpress...I know it's early, but Lies is one of my favorite reads of 2017 so far! I just loved it! Lies follows Joe Lynch, who is approaching is 10 year wedding anniversary with his wife, Mel. Together, they share a 4 year old son, William. One day, on his way home from picking up his son, he spots his wife's car. William wants to surprise her and say hi, so they follow her into a parking garage of a hotel. What they see is Mel clearly in a heated argument with her best friend Beth's husband Ben. Mel leaves the hotel and drives off before he can ask her what happened, so he confronts Ben instead, and things become violent. Ben is knocked out on the pavement, bleeding from his head, but Joe's son starts having an asthma attack, and he's forced to drive home to get his inhaler...after returning to the parking garage, Ben and his car are gone. Now Ben is missing, and Joe has started receiving increasingly threatening messages. How did he manage to get caught up in a missing person's investigation, and why is his wife lying about what happened in the hotel? All will be answered by the end of the book!Lies was my second buddy read with Sam from Clues and Reviews, so keep an eye on her blog because her review will be posted soon!I was hooked on Lies from page one! I really just couldn't put it down. I think I read it in about two sittings, because I was dying to find out. I loved Joe and his son Will. I think their characters were well developed, and I was rooting for him, even though there were definitely times where he seemed a little naive, however I think that was natural. Not everyone is ridiculously suspicious of everyone in their life when there has been no reason to not trust them in the past. Without giving anything away, I'll also say that I LOVED the ending! I'd been trying the entire book to put all of the puzzle pieces together, and hadn't managed it, so the end came as a total surprise for me, and it was perfect. I put the book down and immediately messaged Sam to tell her I'd finished the book and \"OMG!!!!\" - I immediately needed to talk to someone about it!If you're looking for a fast paced psychological thriller, this is the book for you! I highly recommend it, and can't wait to hear what you think! A huge thank you to Netgalley, TM Logan, and the publisher, Bonnier Zaffre, for an advanced copy of Lies. It was my pleasure to provide an honest review. The expected publication date for Lies is May 4, 2017 so mark your calendars!"}, {"userName": "Nicki", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/8862640-nicki", "userReview": "Every day of our lives we make decisions some of which can end up having major repercussions on how our lives turn out and many can lead to doubts and thoughts of what if I had decided to do things differently.Joe Lynch definitely wishes that he had decided to ignore his four year old son William when he said that he had seen his mummy`s car.He also wishes that he had not followed his wife into the underground car park and witnessed her having an argument with their family friend Ben.If Joe had just carried on with his usual Thursday evening routine then he would not have gotten into a confrontation with Ben that had resulted in Joe pushing Ben so hard that he fell over and banged his head and was knocked unconscious.The shock of witnessing the fight causes William to have a severe asthma attack so Joe rushes him home to safety and then returns to help Ben only to find that he has disappeared.Now due to a number of random decisions Joe's marriage is crumbling,it's looks like he is going to lose his job as a teacher and he is the number suspect in a murder investigation.I really liked Joe,he was just an ordinary every day guy who found himself caught up in a situation that was out of his control.Some other readers might think that he was a bit of a wimp but I thought he was quite sweet especially when he was interacting with his young son William.Joe was a well thought out and believable character as was the rest of the cast of this intreguing thriller.As well as a very good entertaining mystery it is also a cautionary story about being careful what we share about our lives on social media sites, how we have come too over rely on mobile phones and how easily the internet can be used as a tool against us.There is quite a bit of technical information but it is not overdone, is easy to understand and doesn't disrupt the flow of the story.This is a fast paced,gripping thriller that I would gladly recommend to anyone who enjoys stories about every day people who get caught up in situations that they have no control over.It is very surprisingly a debut book and I look forward to reading more books by TM Logan in the future.Many thanks to Bonnier Zaffre for a arc of this book in exchange for a honest review"}, {"userName": "Petra", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/28393395-petra", "userReview": "4.5 stars. This was a gripping, psychological thriller that was hard to put down. It follows Joe, high school teacher and main caregiver of his son, William, as his life disintegrates at an alarming rate. After watching his wife, Mel, in an argument with Ben, the husband of Mel's best friend, Beth, Joe makes the fateful decision to confront Ben. What follows is fast-paced and with twists and turns all over the place. The author does a great job of integrating the dangers of social media into the plot. I was surprised to learn this is T.M. Logan's first book. Wow! I thought it was very well written and the plot was excellent. Joe was authentic and likeable and his first-person perspective worked really well. While I had my suspicions about one of the characters from early on, I didn't see the ending coming at all. I loved it! Although this required a little suspension of disbelief at times, I was so busy turning the pages desperate to discover the next bit that I wasn't unduly bothered by it.I look forward to seeing what this author has in store next."}, {"userName": "Linda Strong", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/13684015-linda-strong", "userReview": "Joe Lynch is a happy man. He loves his wife, Mel, his son, William. He works part time as an English teacher. So what can go wrong?While driving his son home, they spy his wife's car in an underground car park. Following, he sees her having an argument with family friend Ben. His wife jumps up and leaves before he has a chance to stop her. But he does meet up with Ben. Their \"discussion\" ends with Ben lying on the concrete unconscious. And just at that moment, Joe's son has a violent asthma attack and they leave immediately to get some help. Later, Joe comes back to check on Ben .. he hadn't really wanted to just leave him. He takes a sigh of relief when he finds Ben ... and his car.... are gone.And that is where Joe's great life is flushed down the toilet. Receiving emails and text messages from Ben, Joe begins to see the larger picture. Ben says he's going to take everything away from Joe ... his wife, his house, his son, his job ...everything.And then two things happen .... Beth, Ben's wife, comes knocking at the door saying that Ben is missing. And Joe's wife admits to a \"mistake\" she made concerning Ben.When Ben stays missing, the cops start looking at Joe as a suspect.Joe is determined to prove Ben is still alive and sending him messages.This is a terrific psychological thriller. Great character development. I have to admit that I thought Joe was a schmuck in not throwing his wife out into the cold. She gave one version of what happened, and when Joe proved her wrong, she tried another version... and then a third version. This is fast-paced, something new being discovered ... or not .... on almost every page. There is a huge twist at the end that you will never see coming.Many thanks to the author / Twenty7 Books / Netgalley for the digital copy. Opinions expressed here are unbiased and entirely my own."}, {"userName": "Dale Harcombe", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "Joe is married to Mel and has a young son William. Intending to surprise his wife, he and William follow her into an underground are park. But then things go awry. He sees her have an argument with Ben. Ben and his wife Beth are friends of Mel and Joe. Joe ends up knocking Ben down and he hits his head as his falls. Before Joe can help Ben and see if he is all right, four year old William has a serious asthma attack. From that time things get weird as Ben disappears. Where is he? Maybe he is even dead? But then Joe starts getting text messages and messages on the computer from Ben taunting him. This book can make you wary of modern technology.This is an interesting read in that had me turning the pages, as Joe rushes around like a chook without a head trying to find out the truth about Ben. I found the character of Joe largely aggravating and didn’t overly like any of the other characters either. It is another book where I wasn’t enamoured of the ending. And one aspect with Ben’s daughter that did not ring true to me at all. Still, it did keep me reading. Again I suspect others may like it much more than I did. I will be interested to read another book by this author."}, {"userName": "Christine", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/9809518-christine", "userReview": "Yawn. Dull dull dull. Another one to avoid - DNF @ 18% These best sellers are the worst for being disappointing. The only decent bit in the book is the beginning. All down hill from there, with the most wimpy male character ever. The most irritating dialogue between the father and son. Seriously worried about this in fiction. Can no one write men and children without descending to such lows? I gave up on this quite quickly."}, {"userName": "Hans", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/28391074-hans", "userReview": "It seems like the perfect crime. With the perfect victim. It kept me guessing what really was going on.The knowledge about modern technology is surprising."}, {"userName": "Chandra Claypool (wherethereadergrows)", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/9722719-chandra-claypool-wherethereadergrows", "userReview": "Poor Joe finds his wife at a hotel with his friend, Ben, who is clearly upset with her and Joe is completely confused as to what is going on. Joe confronts Ben when he's walking to his car which leads to an altercation rendering Ben unconscious. Leaving Ben on the pavement to tend to his son's asthma attack, he fights with his guilt until he decides to go back and check on him. Ben has disappeared and that's when the game begins. I found this book to be extremely fast paced - I almost read it in one sitting but then life happened. It brings up social media and technology being a factor in corruption and manipulation, which I'm finding lately to be a theme among thrillers... and for good reason given this day and age. While this book trods along in an expected manner, it's the ending that threw me for a loop. I certainly did NOT see that coming and for that, a 5 star rating. You like fast pasted, engrossing thrillers with a touch of psychological chill? Here's your next read!"}, {"userName": "Dennis", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/67496521-dennis", "userReview": "4.5 stars! \nLies\n by T.M. Logan is one of those domestic thrillers that completely envelopes you—virtually leaving you hypnotized until the story is finished. Joe Lynch, his wife Mel, and his son William have the picture perfect family that only people dream about having. Joe is an English teacher while his wife works in the corporate field in the Human Resources department. One afternoon, Joe is driving home with William and he spots his wife's car in a hotel parking lot. Joe pulls over to see why his wife is there and captures her arguing with her best friend's husband. Joe tries to intervene in the situation and it changes the rest of his life. Without going any further into the story, Joe questions whether or not he was meant to intervene in his wife's conflict and how will it affect the perfect life that he has so humbly enjoyed.I really enjoyed reading \nLies\n—the writing is fiercely robust while the story is engaging and vastly entertaining. At over 400 pages, the story really packs a punch and doesn't ever feel like a slow burn. I was very surprised that T.M. Logan was able to craft such a multifaceted story arc using similar domestic thriller themes that have oversaturated the market. \nLies\n is an original tale that delivers. Initially, I felt that this story was going to follow in the footsteps of every domestic thriller story written since 2016, but \nLies\n really is in a ballpark of it's own. I had to deduct a half of a star (out of 5) due to the fact that the only time that the story felt rushed was at the end. \nLies\n never skipped a beat throughout the story, but the ending was a little disappointing. The details of the story were never left out; the plot was thoroughly enjoyable and believable; and then we get a finale that was was rushed and abbreviated. I wanted more, but it doesn't take away from my overall satisfaction with this story. \nLies\n is a book that you need on your reading list."}, {"userName": "Selena", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/1932900-selena", "userReview": "I received a free e-copy of Lies by T.M. Logan from NetGalley for my honest review.This was a crazy, exciting, psychological thriller of a book. The title is very appropriate for the book as there are lies on top of lies. My head was on a constant swivel. As soon as I thought I worked my way around a lie and had it figured out there were 5 more and they just kept coming. The outcome of the book I just never saw coming. A very intense read with very intense lies. Can you sort out the lies from the truth or is there really any truth?"}, {"userName": "Louise Wilson", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/42343152-louise-wilson", "userReview": "Joe Lynch is with his young son William in the car when he spots his wife in her car. He quickly decides to follow her. A decision he will later regret. Joe follows her into a hotel where he sees her having a heated argument with her best friends husband. Joe suspects his wife, Mel is having an affair. The story is narrated by Joe and he tells how quickly his life goes on a downward spiral. The nightmare his life has quickly become. The plot line is believable. It shows the disadvantages of social media and what hacking someone's account can do. This is a gripping tale but I found the ending a little disappointing. A great edge of your seat read.I would like to thank NetGalley, Bonnier Zaffre and the author T M Logan for my ARC in exchange for an honest review."}, {"userName": "Liz Barnsley", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "Fast paced twisty psychological thriller - these are popular right now and this is a good example of why. **3.5 stars**"}, {"userName": "Anna", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/1632609-anna", "userReview": "4 stars for the first 92%, proper page turning stuff.1 star for the Scooby Doo denouement: 'and then I did this, and then I did that, mwahaha.'All that plotting. All that tension.Gah."}, {"userName": "Jill Croce-McGill", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/9119740-jill-croce-mcgill", "userReview": "Review to Come!"}, {"userName": "Mandy White", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/33018840-mandy-white", "userReview": "So many lies.. lies upon lies! Trust nobody!!"}, {"userName": "Karen", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/1119019-karen", "userReview": "From the moment that Joe Lynch followed his wife’s car to a hotel car park, this book had me hooked.Joe wasn’t intending to follow his wife. He was driving his young son home when William spotted his mother’s car. Joe decided to follow and surprise her. However Joe was the one that ended up with the surprise!This story tells of how one split second decision can completely change your life and turn it on its head. When you realise that the foundations of your safe and comfortable life are built on a lie and you are helpless as it falls to dust around you. Add in the complexities and dangers of social media and you have one heck of a twisted story.I raced through Lies at every opportunity and didn’t want to put it down. I took an instant liking to Joe and was rooting for him all the way. He was an ordinary husband with an ordinary job who loved his family and he certainly didn’t deserve the whole heap of trouble that landed on his head. There were times when I was berating him for being too trusting and perhaps, rather naïve but then if you had no reason to suspect someone you would trust them.This was a cracker of a read with some excellent characterisations and as you may have guessed from the book description and tagline, has many twists and turns. I’m not going to say what or where they are – you need to read it for yourself but if you like a fast paced story that will take you on a rollercoaster of a read, then this is a book that I have no hesitation in recommending. I really enjoyed this debut thriller and can’t want to see what the author comes up with next."}, {"userName": "Mandie", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/58327890-mandie", "userReview": "I won a copy of this book from Goodreads. I really enjoyed it. It was very dark, and intriguing. It was written very well."}, {"userName": "Bookworm", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/31167656-bookworm", "userReview": "3.5 action packed stars I could NOT stop reading this book once I started...seriously....I was addicted. The writing is phenomenal. It literally pulls the reader into the story and hijacks their attention. As the title suggests, this thriller is about LIES. Joe Lynch and his wife Mel have the perfect marriage until Joe accidentally witnesses Mel in a heated argument with family friend Ben at a hotel when she is supposed to be playing tennis with a friend. As Ben flees the situation, Joe confronts him and a fight ensues between them. Ben is knocked unconscious at the same time as Joe's 4 year old son has an asthma attack. In a split second decision, Joe opts to leave Ben lying there to rush his son home for his inhaler. When Joe returns later, Ben is gone and so starts a series of cat and mouse like events that uncover more and more lies. It was quite refreshing to read a domestic thriller from the perspective of a male. Typically it is through a female POV so such a nice change having Joe tell the story. The character development was impeccable. Even Joe's 4 year old son had a strong voice and the dynamic of being a parent was well portrayed. The tension got the better of me in this one. I found myself burning the candle at both ends to find out what was going to happen next. This book is all about the build up and burn. I wouldn't necessarily describe it as a slow burn because the plot gallops along at a fast pace. There is one significant twist but overall it's not THAT kind of thriller. Its strength lies in its writing and characterization. A fast and compelling read that most people will have a hard time putting down.Thank you to T.M. Logan and Macmillan for an ARC in exchange for an honest review. Publication date is September 11, 2018."}, {"userName": "Tziggy", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/68737146-tziggy", "userReview": "This book was outstanding! Even though the chapters were short they seemed to always end with a question that would make you want to read the next chapter to get the answer, which made it a quick read, in my opinion. The plot was well thought out and the ending had a nice twist. It may make you wonder about the safety of technology and social media as well.I highly recommend this book for those who like thriller/mystery type genres."}, {"userName": "Laura", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/20608600-laura", "userReview": "A well written debut domestic thriller; the genre of which is very en vogue right now. Although a relatively large read, the author does well not to allow his writing to drag and keeps the reader interested throughout. It was refreshing to read a story with a male protagonist as I have become used to reading books from a female perspective, particularly those focusing on secrets and martial lies. Joe is a secondary school teacher and has a beautiful, vivacious wife and young son. When a chance encounter with the husband of a friend of his wife leaves the other party injured, Joe unwittingly begins a dangerous game of cat and mouse. This is one of those stories I could see being easily adapted into a tv drama, it has that kind of appeal. I would certainly watch it. The storyline is gripping and paced very well; the author does not fall into the trap of hurrying along the books climax or tidying up all the loose ends in a pretty package like many others do. Sometimes it works to leave a little to the readers imagination...I look forward to the authors second book, due to be released in early 2018."}], "description": "WHAT IF YOUR WHOLE LIFE WAS BASED ON LIES?When Joe Lynch stumbles across his wife driving into a hotel car park while she's supposed to be at work, he's intrigued enough to follow her in.And when he witnesses her in an angry altercation with family friend Ben, he knows he ought to intervene.But just as the confrontation between the two men turns violent, and Ben is knocked unconscious, Joe's young son has an asthma attack - and Joe must flee in order to help him.When he returns, desperate to make sure Ben is OK, Joe is horrified to find that Ben has disappeared.And that's when Joe receives the first message . . .", "title": "Lies", "url": "https://www.goodreads.com/book/show/33652433-lies", "average": 3.97, "cover": "https://images.gr-assets.com/books/1483232263l/33652433.jpg", "reviews": 629, "authors": [{"url": "https://www.goodreads.com/author/show/15961927.T_M_Logan", "name": "T.M. Logan"}], "type": ["Thriller", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/33652433-lies", "http://www.goodreads.com/book/show/32575039-lies", "http://www.goodreads.com/book/show/32942492-lies", "http://www.goodreads.com/book/show/38886850-lies", "http://www.goodreads.com/book/show/37638234-lies", "http://www.goodreads.com/book/show/36068218-lies", "http://www.goodreads.com/book/show/36217426-29-seconds", "http://www.goodreads.com/book/show/40046270-lies"]}