{"ratings": 716, "userreviews": [{"userName": "Chelsea Humphrey", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "Could there be a more timely fictional story than this? I really don't think so, and it was a bit surreal to be in the midst of 1950's racist America while the Charlottesville news coverage was ticking away in the background. Up front, I'd like to state that I abhor racism in all it's forms; if it bothers you that I value all life as equal I encourage you to unfollow this account. Books with content addressing racism are tricky; on the one hand the issue needs to be discussed in depth to push progress forward, but on the other I feel like so many only show black people in the state of slavery and oppression. I truly believe the day is coming where minorities are protagonists in our mainstream literature on a regular basis and are being featured in all the plots that have been peppered with lack of color for so long. That being said, THIS book somehow found the perfect balance of remembrance of wrong doing and much needed progression in it's characters that is so hard to find. While this book read well as a standalone, I have to say I'm itching to go back and read the first novel, Darktown just for the sheer characterization I missed. One of the things that really hit me while reading was the segregation in the housing situations, both past and present. The \"Great White Flight\" is truly no myth and the fact that the author was able to weave outright, violent racism with present, underhanded racism astounded me. The characters were completely relatable and fleshed out in a way that made them feel real and present, even with the time period standing between us. Please understand, this book is not subtle or easy to read in any way, but it was exactly what needed to be told, even if in fictional form. I'm hoping to add more thoughts to this as I process, but this book wrecked me in a way that nothing has for quite awhile now. This is a time that we need to talk about hard things, not only to reach out a hand of solidarity to our minority friends, but also to instill basic humanity in the upcoming generations on the value of all human life. *********************Won in a Goodreads Giveaway! Thanks Atria for my copy!"}, {"userName": "Liz", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "I thought Darktown was one of the best books written in 2016, so I was excited to read the second book in the series. Once again, Mullen has done a superb job of painting a picture of 1950s Atlanta and its casual racism on all levels - legal, political and social. People actually thought segregation was “the natural order of things”. What's sad is how there now appear to be so many parallels with the present situation, right down to the fascist groups spreading their hate. In fact, the title refers to the lightning bolts they use as their symbol. There are two storylines. Boggs and Smith intercept a moonshine operation delivering the goods into the Negro neighborhoods. The second plot involves Dale, Rake’s idiot brother in law, who gets himself in a real predicament when he takes on a KKK “assignment”. There is a dry sense of humor here that I don't remember from the first book. As a retired banker, and one who was involved in community reinvestment activities, it was interesting to read about the actions that necessitated CRA. The characters are fully developed. Mullen deals with both the personal lives of the police officers as well as their professional lives. As the book progresses, these stories intermingle. And the writing, OMG, the writing! “Just another fellow who was more muscle than brains, more temper than thought, more bad luck than good.” When my husband used to watch boxing, he would move along with the fighters. Well, there was a fight scene in this book so realistic I was ducking and weaving along with the participants. This is just an amazing book. The ending is a force of nature. So many moving parts, taking you in directions you never imagined. There better be a book three!I’m willing to bet this book will also end up in my top ten for 2017."}, {"userName": "Diane S ☔", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Atlanta, 1950,s a few years after Mullens book, Darktown, and all the characters are back in force. Smith and Boggs are still only a few black officers on the force, with little power and little support. Color lines are beginning to blur a bit, and of course with the white population, this does not sit well. Embedded prejudices, the KKK, and Nazi supporters are out in force, the KKK more underground since an FBI investigation,but still working behind the scenes. Drugs and moonshine alcohol are complete Ng down from the hills in quantities that seem unstoppable, targeted to the black neighborhood. Of course there are the officers on the take, those who look the other way, and those who actively support this crime spree. Mullen continues to do a good job mixing historical happenings with some mystery included, though to me these are more historical then anything else. The atmosphere is just so fitting to the times, as a city struggles with social change, how far to let it go. Blacks moving into boundaries that were considered all white. Rakestraw and his attempt to protect his sister by trying to uncover just how far the latest stupidity from his brother in law, has gone. Smith and Boggs will both become involved in issues that hit close to their hearts and home. Change is inevitable,though the wheels turn slowly. Smith and Boggs will both make hard decisions by books end, one surprising, at least to me. I actually enjoyed, if that is the right word, this second in series more than the first. It is a glimpse into a near past and to be honest many of the same things that were happening then are still happening now. Maybe in slightly different ways but social change is never easy nor quick, nor ever accepted by all. ARC from Netgalley."}, {"userName": "Carol", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "The Hook - I could not wait to read the second installment of Thomas Mullen’s Darktown, a crime procedural featuring the first “colored” police force in Atlanta in the 50’s. The Line - ” He tried to walk a moral path, yet it was littered with the bodies of his good deeds—and too many other bodies.“The Sinker - When we were first married my husband often accused me of being a rather “black and white” person when it came to my views on issues. If I read Lightning Men and did not consider the grays of life, I might have been extremely frustrated with where the book took me. Allowing myself to see things beyond good or bad, all or nothing, right or wrong, to view the plot in terms, black nor white, but in circumstance or necessity, made this a compelling read. Lightning Men draws lines, lines of race, line of boundaries, and lines of moral turpitude. Take a chance, venture across these lines. You won’t be disappointed."}, {"userName": "Char", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "Atlanta in 1950 was a crowded place. The war was over and housing was scarce. Racial tensions were brewing, neighborhood lines were being redrawn, and not everyone was happy about that. Even the fact that black policemen now served in the Negro areas of Atlanta didn't mean these officers had the respect of white officers nor that of the residents. When a white man gets beaten down by the Klan and then a Negro beaten down a few days later, tensions threaten to erupt. What happens next? You'll have to read Lightning Men to find out!I was excited when I discovered there was a sequel to last year's Darktown. I was surprised at what I learned from that novel and I learned a lot from this one as well. For instance, I'd never of the Columbians before. Apparently, this group of neo-Nazis formed, (and so soon after the war in what must have felt like a direct insult to the soldiers and survivors now living in Atlanta), to unite their hatred of both Jews and Negroes. They even dressed similarly to the SS officers in Germany, hence their nickname: lightning men. I also learned a lot about how the neighborhoods changed during that less than peaceful time in American history. It's often painful to read about, but it's interesting to see events from several different points of view. Rake, Boggs, Smith and MacInnis are well rounded characters and even now, after a second novel, I think they all still have some secrets in reserve. None of them are perfect and they are all struggling to find their place in this new world, their new police station, (even if it is in the basement of the YMCA), and in their new neighborhoods. Social change doesn't come easy and I think all of these characters recognize and respect that in their behavior, which made them believable to me and maybe a little lovable too.Lightning Men is scary in a way, because it's easy to recognize some of the behaviors from this story on the nightly news today. It's also sad that so much good can begin to be undone by just a few hateful people in high places. Not only is this story a good one, but it reminded me that America always has to remain vigilant, so that everything we have worked so hard for as a people, is not undone by only a powerful few. Highly recommended! You can get your copy here: https://www.amazon.com/Lightning-Men-...*Thank you to NetGalley & Atria for the e-ARC in exchange for my honest review. This is it.*"}, {"userName": "Erin", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/32799998-erin", "userReview": "Lightning Men is the second book in the fantastic and amazing Darktown series, which focuses on lives of Lucius Boggs and Tommy Smith two of Atlanta's first black police officers. The Darktown series perfectly marries the research of historical information with the absorbing plotlines of a crime thriller. Lightning Men gives us a up close and personal look at racism dressed up as the white middle classes concern over a changing nation(sound familiar?). The circumstances faced by black people in 1950's can be hard to read at times, but just imagine living it. These black families only wanted to provide a better life for their kids by moving to better ( white) neighborhoods like I assume most families do.How are they rewarded for this? With beatings, firebombs, and lynching. Nightly visits from the KKK and their Neo Nazi friends. This folks is a time (1950's)when according to a poll 56% of Trump voters thought the country was last great.As I said before this series can be a tough read at times but its so worth it. I highly recommend Lightning Men.2018 Popsugar Reading Challenge: book by an author of a different ethnicity than me."}, {"userName": "Trish", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "Thomas Mullen’s Darktown series, about the first black policemen in Atlanta’s police force, is about race but it is also about the institution of policing. We are seeing how corruption and discrimination can take hold, and we ask ourselves what is the best way to combat the ever-widening spiral of deceit. We interrogate our own moral grounding and question whether we would be able to withstand the social and economic pressure put to bear to get us to go along on controversial arrests or worse. It is that evaluative distance and internal interrogation that Mullen creates in us that may be the most remarkable thing about his books. We are thinking critically and watching the narrative unfold from a protective distance even though his stories are gripping—after all, this is life and death in neighborhoods just like ours—and we really never know where he is going to steer us next. But these novels aren’t really mysteries, and they aren’t police procedurals in the typical sense. Do we need a new genre category for the historical and sociological recreation he manages?Mullen places us in the moment by citing newspaper headlines mentioning what is happening in the country and around the world in 1950:  “Late morning the house is quiet with Cassie and the kids out at a park. Rake read the paper and enjoyed the solitude. An American minesweeper had become the first U.S. ship sunk in the Korean conflict; Joe McCarthy was insisting on a more thorough investigation into the Communist infiltration of the top echelons in the American government; and officials announced that the mysterious explosions in a Brooklyn neighborhood, initially feared to be a Red attack, had in fact been caused by a gas leak…”These headlines do more than situate us in 1950, they also remind us that prejudice and crazy theories about racial or political superiority have been around before and have passed, though not without a fight. One of the very next scenes is a meeting between a cop seeking information on an old case and an FBI agent who’d been involved at the time. The FBI man suggests they meet in a coffee shop to discuss the matter, and the moment Lucien Boggs, a black policeman, begins to walk into the coffee shop attached to a department store, we wonder…Mullen doesn’t let us down. He shows us the disdain and harsh attitude of the woman behind the counter, and the surprise and shutting down of the FBI agent who told Boggs to wait outside until he finished his coffee. Earlier, a white cop came across a flyer posted to a stop sign in a suburb of Atlanta: “Zoned as a White Community” and emblazoned with a lightning bolt, “just like the ones sewn onto the sleeves of SS troopers he’d seen in Europe.” Mullen takes time to discuss the group he calls the Columbians, a group distinct from the KKK, indeed disdainful of it. This group supported Nazi ideas including the concept of a master race, and apparently believed America fought the Nazis in World War II only because the Japanese bombed Pearl Harbor, making ‘sides’ more clearly defined. Otherwise, America had been more concerned about the red menace from the Soviets.The rivalry between the Columbians and the KKK, who are derided by practically everyone for the bedsheets disguise, is central to this story and instructive in that it clarifies motives and actors in the messy phenomenon that is racism today. Mullen also spends some time answering the notion that blacks bring misfortune upon themselves. He opens the story with the release of Jeremiah Tanner from prison. Tanner had paid his debt, and readers are inclined to be sympathetic. Throughout the story, our impressions of Jeremiah will change several times, from believing him the most evil of all to believing him the most generous of all. This is Mullen’s skill.The black lives in this latest novel are so much more difficult and complicated than we imagine at first. Their choices all appear to be bad ones. No surprise, then, that they find themselves in the middle of illegal or compromising situations again and again, and yet when we hear their explanations, they sound rational, making choices we might make in the same place. When you have bad choices, your decisions may look poor also.The white men’s lives are less appealing altogether. There are a couple of white policemen wrestling with the morality of discrimination and the exclusion of black folk, but most make no effort to push back against the few bad apples that extract fealty or promise retribution within the force. They would revolt against the bad guys on the force, we sense, but they aren’t impacted enough. They need stronger incentives to do right. They aren’t heroes after all, just working men.Mullen also manages to pack in an excellent example and discussion of the lack of reasonable housing in Atlanta at the time for blacks who did not want to live in substandard apartments in dangerous neighborhoods. The real estate industry wouldn’t certify black realtors so called them “realtists,” a word I found laughably close to “realists.” The phenomenon of “white flight” from neighborhoods into which black residents have moved is discussed in some detail.When Mullen’s first book in this series, Darktown, came out last year, I asked him how he could write the black man's point of view. His answer shows his authorship of these characters:  “As far as the black point of view in the book, roughly half of the book is from black characters' perspective and about half is from white characters' perspective. But what's important here is that each character has his or her own, unique perspective--no character should be a mere stand-in for their race, or gender, or religion, or anything. I always want my characters to feel as 3-D and authentic and real as possible, in my other books and in DARKTOWN.”But are his characters authentic? Authentic enough for the series to be acquired prior to publication by Jamie Foxx for TV production. Let’s just say the outline of the characters are there, and our imaginations (or actors) fill in the missing bits that make the piece real. So this is interactive fiction, in a sense. It needs our imagination, experience, and constant attention to understand what precisely is happening here, and to whom. This is an impressive series."}, {"userName": "Tucker", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/39633342-tucker", "userReview": "“Lightning Men “ is an exceptional combination of a character driven police procedural with a very realistic and disturbing view of policing in the black community in the 1950’s. Although the story is fiction, the events described ring with truth, and decades later that racism, discrimination, and violence remain all too present. Yes, we’ve had a black president, but innocent black men and women are still being brutalized and gunned down by police officers. The suspense and remarkable writing will suck you in, and the social history will keep you reading. Highly recommended for a general readership and an outstanding book for book groups. Thank you to Atria Books and NetGalley for providing an advance copy of this book in exchange for my honest review."}, {"userName": "Brandon", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "LIGHTNING MEN picks up two years after the events of DARKTOWN as those left standing continue with their lives in 1950s Atlanta.Officer Denny “Rake” Rakestraw’s neighborhood – an implied “whites only” neighborhood – is beginning to see the arrival of several black families. A group of residents, including Denny’s wife Cassie, pool their money together in an effort to buy out these new homeowners, however, a separate group has adopted a different approach – post hateful signs showing the SS Nazi insignia. As a WWII veteran who had laid his life on the line attempting to eradicate this ideology, Rake hopes to seek out those responsible for the hateful rhetoric. Complications arise when Rake discovers his brother-in-law Dale is a card carrying member of the KKK and may be involved.Lucius Boggs and partner Tommy Smith, stumble upon a group of smugglers bringing reefer and moonshine into Darktown. Again handcuffed by the limitations of their employers, the Atlanta Police Department (APD), Boggs and Smith, fearing corrupt white officers may be playing a more aggressive role than before in keeping their “off-the-books” investigation from gaining ground, cannot seem to touch the man they believe responsible. Boggs, recently engaged to Julie, a woman he met through the course of a prior investigation, discovers her ex-boyfriend and father to her child, Jeremiah, has returned from a stint in jail. With Boggs’ father already disapproving of the engagement, how will Boggs juggle the responsibility of his job with the threat of a jealous ex-con waiting in the wings?I was wondering how Mullen would top the corrupt cops and corrosive racism in Darktown – I guess he just had to keep the asshole cops, throw in the KKK and add another Nazi sympathizing hate group, The Columbians, and you’ve got a veritable bounty of bigotry for our heroes to contend with.Although they’re few and far between, Mullen has a real knack for writing action scenes. They’re used to great effect and only when characters are seemingly pushed to their breaking point making the scenes particularly explosive and violent. I can’t remember the amount of times I was on the edge of my seat during a shootout or a fistfight/brawl.I didn’t much care for the love triangle between Boggs, Julie and Jeremiah, but I understood its significance within the larger picture given where it ends up. There’s nothing outright wrong with it, but many of the scenes lacked substance and felt like padding to an already rich plot. Boggs’ partner, Smith, gains a lot of ground in proving to be an integral character moving forward and Rake is a world-class shit-disturber throwing wrenches in as many people’s plans as possible.With Darktown, and now Lightning Men, Mullen offers stories of adversity in the hard-nosed world of mid-20th century America. While both books contain elements of the mystery and thriller genre, both are more about the struggle to achieve social change in an era of widespread fear and resistance sadly making it a somewhat timely read in 2017."}, {"userName": "Judy Collins", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "The 30 Best Books of 20175 Stars +  From the acclaimed author, Thomas Mullen who introduced readers to the hit,  Darktown  landing on my  Top Books of 2016  —racial integration of Atlanta’s police department in 1948 — with an explosive multi-layered complex follow up: LIGHTNING MEN.  Racial violence and corruption continue in 1950’s Atlanta, with African-American police officers, Boggs and Smith. As they say in the South, these two find themselves in a \"heap of trouble.”  (Among others). “Hot Atlanta” is not just sizzling.  It is blistering. Fiery. Tensions and emotions run high. Loyalties tested between family and law. Color lines threatened. Moral lines blurred. The second in the Darktown series,  Mullen uses his hard-boiled crime, cop procedural, to explore post-WWII racism in the South. The highly anticipated character-driven LIGHTNING MEN  is much more than just a crime-fictional thriller. Infused with critical historical details and timely controversial subjects we face today.“Any candid observer of American racial history must acknowledge that racism is highly adaptable.” – Michelle Alexander, The New Jim Crow Highly-charged,  Mullen turns up the intensity with characters facing moral, family, social issues and compromises. Tensions rise.  From racial prejudice, moonshining, drugs, greed, conspiracy, Klansmen, fascist Columbians, white supremacist, corruption, bigotry, violence, Jim Crow laws, preachers, shootouts, paybacks, fear, power, and segregated neighborhoods.In Darktown,  we met rookies: Officer Lucius Boggs and his partner, Tommy Smith. From different backgrounds,  their office was housed in the basement of the Negro YMCA, a makeshift precinct. They were not even allowed to arrest white men, nor allowed to drive a squad car. They could not patrol outside of the Negro neighborhoods that constituted their beat. No respect and little support. Only ten black officers  patrolled those thousands of souls. A third of Atlanta were black, yet crowded into only a fifth of the land. Boggs and Smith  had not taken bribes; however, with two years on the force, it appeared half of the white officers took bribes, so how long would the Negro officers resist?  Tired of their powerlessness.  The son of a preacher, Boggs was all too familiar with the fallibility of men, even men with power. Denny Rakestraw  (white) is distrusted by his fellow officers for his suspected role in the disappearance of his former partner, Lionel Dunlow. Rakestraw is not a racist but finds it difficult to fit in with his fellow white cops and work with the ten black cops. Neither side, fully trusts him.  Denny’s problems increase  when his Klansman brother-in-law, Dale Simpkins, gets involved in a plot to stop the influx of African-Americans into his neighborhood, Hanford Park. Some cops are part of the Klan.  Will they accuse one of the wealthiest men in Atlanta of selling moonshine and marijuana?Boggs had come to respect McInnis  over the last two years. He had stuck up for his charges during a few disputes with white officers. How far can he go to protect them? Boggs (preacher’s son) is dating Julie with a young son, Sage.  Soon to be married. His family opposes the relationship since she is not of their social status.  She has a secret past.  She is intimidated by their prestigious family. When a black man, Jeremiah  released from prison after five years, things get personal. Boggs life gets complicated when he learns the connection. Two years earlier, Boggs  came close to resigning his position and had second thoughts after a near-death experience. Now, he is unsure again.Too many mistakes that weighed heavily on his soul. He is sure there would be more guilt and an awkward relationship with his partner. Can he remain as a cop? Events will lead each character to major soul-searching. Smith had crossed another line as well. He was afraid.  . . . The Armor.  The façade victims’ families typically wore when they needed to protect themselves or the memory of their loved ones. Folks who wore The Armor sometimes had secrets to hide. The Armor was firmly in place as they parried the officer’s attempts to learn more about the deceased. They wore The Armor to keep the cops from learning things. The secrets. The Armor is worn by the innocent, who had nothing to hide but their dignity, and they were so deeply offended to be questioned by these employees of the corrupt City of Atlanta, these paid enforcers of Jim Crow, that they refused to play along. They may be innocent, hurt, or protective. . . . “And lines are only ideas people dream up, to govern what should be possible, to keep you from moving toward the forbidden.” Three policemen struggle.  Each has an agenda and react in different ways to protect. Loyalties tested. Family versus law. Can they continue to work  with one hand tied behind their packs without the proper support to do their jobs? Will the latest emotional events, their actions, and tensions make them second guess their current careers? Will they continue to serve and make Atlanta a better city, or is it a useless effort? After violence and a shootout,  will Hanford Park be transformed? Will the lines between white and black be blurred after the postwar crowding, pushing blacks into areas formerly considered whites-only? From racial politics and struggles of history,  Mullen does not miss a beat! The complex emotions of each character are portrayed in depth, making the characters jump off the page. Others threaten lives. Others protect. Struggles both interior and exterior. Complications.  Affairs interrupted. Old scores settled. Blood feuds magnified. Pride. Costs were high. Greed. Hard-boiled. Explosive. Riveting. Timely!  Love this enthralling series  and looking forward to seeing what is in store next for Smith and Boggs. When reading of Boggs at his dad’s house for dinner with Julie, reminds me strongly of Greenleaf (a favorite show) and their preacher/family dinners. Heaven forbid, their children do not follow their well-laid controlled plans. Movie-worthy!  For those who enjoy good crime fiction, and historical fiction as Mullen meticulously traces the civil rights movement through his well-written crime stories and cop procedurals, that involve \"real\" characters you come to care for. Fans of TV mini-series:  Underground, Greenleaf and Queen Sugar will enjoy this intense series as well as Michael Connley’s Harry Bosch and Greg Iles' Penn Cage series. In addition to the early digital reading copy (thank you) provided by NetGalley and Atria, I also purchased the audiobook, narrated by Yahya Abdul-Mateen II  – for an award-winning performance. Just finished. Move this series to the top of your list.  If you reside in the South, this is a “must read.” Especially for those of us who found (find) Atlanta our home for many years.  Another Southern winner! I purchased hardcover copies of the series, and they are stunning!  JDCMustReadBooks"}, {"userName": "Laurie • The Baking Bookworm", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/5289134-laurie-the-baking-bookworm", "userReview": "Disclaimer: My sincere thanks to Atria Books for providing me with a complimentary copy of this book in exchange for my honest review.4.5 stars -- Lightning Men picks up two years after Darktown, the first book in the series, left off. Once again, Mullen brings his readers into the gritty streets of post-WWII Atlanta with its social and political issues, racial intolerance, corruption and outright brutality that continues to be the status quo for so many. Mullen doesn't shy away from these emotionally charged topics in this character-driven crime novel.Readers continue to witness the Black officers struggle within the confines set for them by their supervisors as the small Black force polices the Black neighbourhoods which are grossly overpopulated and in need of even basic necessities. This is in stark contrast to the White neighbourhoods -- and many Whites are fine with the way things are, thank you very much. The dichotomy between Black and White continues within this second book and I like that Mullen doesn't give easy answers or hold back on the gritty, hard-to-read scenes. Mullen also continues to educate readers about aspects that many may not know about, myself included. For me, that issue involved the Columbians (aka Lightning Men) who formed soon after the end of WWII. With their lightning patches on their uniforms they, like the Nazis that inspired them, reveled in promoting hate against Blacks and any diversity and were a smack in the face to those American soldiers who had just returned from battling similar hatred overseas. The cast, including Rake, Boggs, Smith and MacInnis, continue to show great depth and readers get some backstory on each but I still feel there's a lot of untapped issues that Mullen will bring forth with each character in future books. The only issue I had with this book is that I found there to be a lot of characters to keep track of.Mullen shows that, unfortunately, the process for social change is a very slow one as we sadly continue to witness in recent events. Racism, both blatant and covert, remains a timely issue and racial tensions ran high then as they do now. The Darktown series continues to be an eye-opening, gritty and gripping series with well-rounded, well-flawed characters who struggle within the stifling confines of racial injustice, ignorance, indifference and intolerance. Mullen has combined compelling characters weaves historical issues within his story with great skill. I highly recommend this book but I strongly suggest starting with Darktown."}, {"userName": "Tonstant Weader", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/2050909-tonstant-weader", "userReview": "Lightning Men is the second in Thomas Mullen’s Darktown historical mystery series imagining what it may have been like for Atlanta’s first Black police officers. Lucius Boggs and Tommy Smith are partners policing Darktown, a difficult task when corrupt White police officers are partnering with drug traffickers. Hated by their fellow officers, many of whom are members of the Klan, they walk a very careful line to protect their community.Denny Rakestraw is a White officer who refuses to join the Klan. His neighborhood is “transitioning” and the Klan, including his brother-in-law and a “neighborhood association” are both trying to stop it. His brother is a fool and gets himself entangled in a fine mess and Rakestraw risks far too much to save him.Housing is an arena where racism has been intractable. To this day, de facto housing segregation afflicts American cities. When Black people move into a neighborhood, White people move out. When White people move into Black neighborhoods, civic investment follows and suddenly Black people can no longer afford to live there. It is no surprise that housing segregation makes a powerful environment for violence and conflict.I enjoyed Lightning Men a lot. I cared about the characters. They are imperfect, flawed people with depth and authenticity. Sometimes their desire to do good is deflected by personal needs and conflicts of interest. They can be impatient and make mistakes which makes them far more interesting than those who always do right.Mullen succeeds in creating the time and place of post World War II Atlanta, the socio-political forces, the fears and aspirations of the people seem real. I have criticized authors for gratuitous use of racist epithets. Here is a book focusing on Jim Crow Atlanta, on Klansmen and a world of blatant, state-sanctioned white supremacy and of course, there are racist epithets, but when they are used, they are part of the story. There is a sense that Mullen interrogated himself before using epithets, asking himself if it is really necessary, not used to shock or show how transgressive he can be.This is my first book in this series. I will be reading Darktown, the first, as soon as I can get it from the library and I eagerly anticipate the development of this series as it moves forward.Lightning Men will be released September 12th. I received an ARC from the publisher through Shelf Awareness.Lightning Men at Simon & SchusterThomas Mullen author siteDarktown web sitehttps://tonstantweaderreviews.wordpre..."}, {"userName": "Annie ~ The Misstery", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/5126321-annie-the-misstery", "userReview": "A year ago, I read and enjoyed Darktown by Thomas Mullen. It was a great book dealing with a delicate topic and I thought it was handled very well. When I learnt that there was a sequel coming soon, I immediately decided I wanted to read it. For those who haven’t read Darktown, this can be perfectly read as a standalone. I didn’t remember a lot of details, but it wasn’t necessary. And I liked Lightning Men even better.This novel, like Darktown, tells the story of two young men who are amongst the first black cops in Atlanta, Georgia. The year is 1950 and things are definitely not easy for them. They can only patrol the “black” neighbourhoods and barely have no power, as the white cops don’t respect them and think they shouldn’t be working with them at all. This makes it hard for Boggs and Smith to investigate the cases and this one was especially difficult to break.It’s sad because I believe now things aren’t much better. Of course we’ve come a long way since then, but it’s not enough. This is a very relevant book right now and it can make all of us reflect on the way our society behaves. Because not all racism is physically violent, but it’s still there and this book perfectly portrays something that is still happening today. A fine example of this is Rakestraw’s storyline, a young policeman whose German origins help him understand what it’s like to feel different. In Lightning Men, Rake’s wife and their neighbours are trying to raise money in order to buy the newest black residents out. What astounded me was that Rake’s wife and the neighbours actually thought they were doing a good thing only because they weren’t behaving violently (as opposed to the KKK case that Rake is investigating). These people merely wanted the neighbourhood to be completely “white”. As they said: “Those poor families were tricked, they didn’t know what they were doing, let’s buy their houses to force them out”. I. Can’t. Even.The characters in Lightning Men are complex and multi-layered, especially Boggs and Rake. While I still think that Rake was too passive and could’ve prevented plenty of things, I liked him better this time around. On the other hand, I thought Boggs needed to urgently drop his “golden kid” act and grow up. I didn’t like his air of moral superiority towards his girlfriend, Julie, whom I liked a lot, by the way. As for the negatives, the only thing I didn’t like about this book was that I wasn’t able to *love* any of the characters, I didn’t feel I would miss them when I got to the end.Nevertheless, this is a fantastic novel that I’d recommend to anyone who wants to read a good story that it’s actually important and relevant in today’s society. Don’t miss it."}, {"userName": "Bill Lynas", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/41874806-bill-lynas", "userReview": "Thomas Mullen's latest novel, set in 1950 Atlanta, follows on from his previous novel Darktown. However, you don't have to know Darktown to enjoy this excellent tale of Atlanta's first black police officers. This is not just a crime story; it is far more a drama played out with great characters, & every single chapter has something to keep the reader engrossed.There are so many good things that I can't begin to describe them. Mullen mixes fact & fiction & I found the story made me happy, angry, sad, amused & even upset. I still cannot for the life of me understand why anyone would dislike another person just based on the colour of their skin. What the fuck is wrong with people ? Yes, I know this is fiction but everything rings so true. Thankfully, almost 70 years after the book is set, society has moved on from these pathetic prejudices. I know we're not there yet, but hopefully one day we will be.I'm not really an emotional person, but Mullen's novel certainly gave my feelings a rollercoaster of a ride. Great writing from an ever improving author."}, {"userName": "Sam (Clues and Reviews)", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/20224869-sam-clues-and-reviews", "userReview": "Last year, I read Thomas Mullen’s “buzzed about” publication, Darktown, and I was absolutely blown away. So, I was extremely excited to read its follow up, Lightning Men. This book took me forever to get through. It had nothing to do with the writing (it is phenomenal) or the plot (it is completely captivating). Instead, I found myself struggling due to the completely pertinent nature of the text. It made me completely sick to my stomach to think that a plot, highlighting racial in-equality and tension in the 1950s would be so relevant to 2017. I found this historical mystery to be completely draining. The second novel in this series picks up two years after Darktown with African American police officers, Officer Boggs and Officer Smith, in Atlanta on patrol. The characters remained just as realistic and well developed as in the first novel and Mullen’s vivid imagery, which was one of the features I loved most within Darktown, was just as apparent throughout these pages. Mullens is a master of word choice and creating an entire “scene” for the reader. I do think the novel could be successfully read as a standalone, but I personally think they should be read as a series in their entirety. I think it makes the most sense for characterization. Like with Darktown, there were parts that I found hard to get through. Especially scenes depicting blatant racism- I found it especially hard to get through given the current events happening in our world (which I mentioned a little bit above); however, I do understand the importance of such raw displays. Overall, Mullens continues to create a raw and gritty tale within Lightning Men, a story that both disgusted and captivated me. Who knew that was even possible? If you okay with something a little heavier, but extremely well written, then I would absolutely read this series."}, {"userName": "Tom Mathews", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "Thomas Mullen’s second foray into the world of Atlanta’s first negro police officers is as good as the first. When I read Darktown, (see my review here). I was very impressed by the seriousness with which Mullen addressed the difficulties that these brave men faced. Lightning Men takes place a few years later, in the early 1950s, as the Korean War is getting under way. Moonshiners, their business damaged by the end of prohibition, have taken to supplementing their income with marijuana which has flooded into Darktown and black officers must contend not only with the gangs importing the drugs and alcohol, but with the crooked white cops who take kickbacks to look the other way. Lucius Boggs’ life is further complicated when his fiancée receives a visit from a former boyfriend.  The world is beginning to change but that change will not take place without a struggle. Black families, forced by overcrowding out of their traditional neighborhoods, are beginning to move into white neighborhoods. Their white neighbors, even those who aren’t racist, foresee the likelihood that all they worked hard for will be destroyed by plummeting property values. Everyone from neighborhood associations to the Klan and pro-Nazi groups have ideas for how to resolve the issue. Not all of the ideas are peaceful. Bottom line: I was unaware that Mullen's was working on a sequel to Darktown so I was very pleased when I saw that Lightning Men was coming out. It was all I hoped it would be. I hope that there will be a third."}, {"userName": "Maxine", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/5208303-maxine", "userReview": "Smith and Boggs, two of the first black police officers in post-war 1950 racially charged Atlanta are trying to keep the peace in the over-crowded, poverty-stricken, and crime-riddled black quarters called Darktown by the white officers. But, in the white neighbourhood of Hanford park, tensions have been inflamed by the purchase of homes by three black families, one of them Smith’s sister and her husband. Although they have no jurisdiction, they find themselves more and more involved since it is clear that the white police will do nothing to protect the black families. This is also white officer Denny Rakestraw’s neighbourhood. His refusal to join the Klan has not made him any friends on the force and, although he is willing to help Smith and Boggs a little, it is putting a strain on his relationship with his family and his good will towards the black families. Lightning Men by author Thomas Mullen is the sequel to Darktown and continues the story of Smith and Boggs as well as Rakestraw. Smith and Boggs must deal with racial tension, blockbusting, corruption, and drug smuggling while dealing with all the restrictions placed on their abilities to do their jobs. Among the dangers they must face are the Columbians, a Nazi group whose leader has just got out of prison and not coincidentally just before flyers appear in Hanford park:The flyer’s capital letters made its message especially clear: ‘Zoned as a White Community’. Below it was a lightning bolt, blood red.Lightning Men is one heck of a compelling historical noir/police procedural but it is also a well-researched commentary on race relations in post-war America – although Jim Crow is dying, lynchings are giving way to blockbusting and police corruption, and the KKK is trading their robes for businesses, it is clear that violence is still seething very close to the surface in this seemingly more civilized time and not just among the rising neo-nazi movement but among the ‘good’ white citizens, that these Nazis are just the open face of the Lightning Men. This is a well-written, well-plotted and, given the recent rise of the alt-right in the US, timely story.Thanks to Netgalley and Simon and Schuster Canada for the opportunity to read this book in exchange for an honest review"}, {"userName": "debra", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/7002034-debra", "userReview": "Really enjoyed this one. Char,Diane S, Carol, Chelsea, Liz will explain why in their reviews. ; ))"}, {"userName": "Stacia", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/3917029-stacia", "userReview": "Mullen weaves a complex tale of many overlapping & intersecting storylines. I like it very much for that because instead of one linear case, there are many things going on. Interestingly, while the Lightning Men are called out in the title (remnants of Nazism who think the Ku Klux Klan are too soft), the Lightning Men are sort-of the least part of the tale. I did get a little bit bogged down in the story about halfway through & ended up putting the book down for quite a few days before picking it up again. It's not easy to juggle the varied & overlapping stories & there are times it feels slightly clunky, writing-wise. Yet, it's still a riveting read overall. I find it fascinating to learn about this time period & highly recommend this series so far. I do recommend reading them in order."}, {"userName": "Phillip III", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/12660605-phillip-iii", "userReview": "LIGHTNING MEN picks up where DARKTOWN left off, and author Thomas Mullen doesn't miss a beat! The story unfolds in Atlanta, Georgia, pre-civil rights, Jim Crow Laws in effect. The Democrats are still bitter, and vengeful over slaves being freed. However, some progress has been made. A recent change had been made, and eight (8) black men were graduated onto the Atlanta Police Force. The new officers wear badges, carry guns . . . but their reach is very limited.The black officers are not allowed in the Atlanta precinct. Instead they rent a basement room at the YMCA. The new officers are not allowed to drive patrol cars. They have to walk their beat. They are not allowed to arrest white people. The new officers are only allowed to patrol black neighborhoods, otherwise known as Darktown. Only, in LIGHTNING MEN, black people have begun moving into white neighborhoods.White Officer Denny Rakestraw, and black officers Lucius Boggs, and Tommy Smith are once again the thick of things. The klan attack a white man in a nearby county. The attempted murder seems unfounded, and unprovoked. The Klan is hot about the uncommissioned deed, and looking for answers. Boggs is about to get married to Julie, despite family protests. However when her past comes waltzing into town, things once thought buried are unearthed and Boggs is nothing if not at the very least preoccupied with how to move forward. Smith's family is in a pickle. The idea of law, right and wrong, are now grey boundaries. Black and white has become obscured! Officer Rakestraw is not without issues at home impacting his judgment. Once again, family. He resides in one of the areas where black families are moving in. While he is not racist, his wife is. And she wants to sell the house before the property value bottoms-out.LIGHTNING MEN is filled with backroom deals, and realty scams. The KKK is a driving force, but not the only evil in town. Dealers of moonshine and weed are at ends, fighting over territories. Darktown is a prime location for sales and everyone wants a piece of that pie! Bad cops taking bribes, good cops looking the other way . . . LIGHTNING MEN is nothing but constant tension. It leaves a knot in your gut the entire time you are reading, and fills you with anger even after you've finished the book. (I highly, highly recommend reading DARKTOWN first, but LIGHTNING MEN stands fine on its own. It is a complete tale. You just might get more from it having started the saga from the beginning).Thomas Mullen is an impressive writer. Although these are the only two books I have read by him, I will be adding his other titles to my ever-growing library. This is a crime writer worth keeping an eye on. His \"historical\" slant transports readers into the 1950s with ease, and then once there, stomps on preconceived perceptions of what is often referred to as the Golden Age . . .Phillip TomassoAuthor of Assassin's Promiseand Sounds of SIlence"}, {"userName": "Lori L (She Treads Softly) ", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/4592109-lori-l-she-treads-softly", "userReview": "Lightning Men by Thomas Mullen is a highly recommended sequel to Darktown. This historical fiction crime novel is set during the racial tensions of the 1950's South. In an overcrowded and rapidly changing Atlanta, the segregated city is patrolled by a segregated police force. It is two years since Officer Denny Rakestraw and \"Negro Officers\" Lucius Boggs and Tommy Smith were first introduced inLightning Men. The three officers are trying to keep the peace amidst volatile situations.Officer Denny (Rake) Rakestraw finds himself embroiled in the midst of racial tension as black families begin to move into a formerly white neighborhood, Hanford Park. This attracts the attention of the Klan and Nazi brown shirts, putting Rake in the position of following the law or showing loyalty to his family, who are Klan members. Boggs and Smith are trying to work within the system to stop the sale of moonshine and drugs in Darktown, their area of the city, but their investigation implicates powerful men, including members of the police force. They too, are faced with the dilemma of trying to enforce the law while protecting their families while street fights and gun violence increase.In Lightning Men Mullen blends a crime novel with historical fiction. There are indications that Darktown and Lightning Men are the first books in a continuing series. I do regret not reading Darktown before Lightning Men, although you can certainly read Lightning Men and follow the plot. I think that reading the first book in the series, though, would provide me with even better developed characters and a more extensive background into their lives. If you have a copy of Lightning Men, though, don't let this comment stop you from reading it. The characters are still very well developed and are complicated, flawed individuals.Superb writing helps keep the intricate and complex plot moving along swiftly, while including plenty of period details, attitudes, and actions that show a realistic historical setting. Although this is a historically accurate novel, it isn't, however, always an easy book to read. Mullens accurately depicts segregation and racism, which can feel brutal and raw as you are reading.Disclosure: My review copy was courtesy of Atria.http://www.shetreadssoftly.com/2017/0..."}, {"userName": "Skip", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "Like its predecessor Darktown, this book is a very good period piece, capturing raw racial relations in Atlanta in the 1950's. The few black officers in APD are trying to enforce standards in the black communities, with little to no support from their white brethren. Officers Boggs and Smith are trying to eliminate illegal alcohol and drugs, facing a myriad of powerful foes, such as than they’d expected. Meanwhile, black families are beginning to move into all white neighborhoods with increasing displeasure from the community. Denny Rakestraw, a non-bigoted white policeman, finds out that his brother-in-law, Dale, a member of the Klu Klux Klan, gets over is head trying to prevent the inevitable. Lucius Boggs' lovelife gets very complicated as his fiancée's boyfriend is paroled and wants to spend time with his and her son. Finally, we learn more about the mettle of the man tasked with supervising the APD's black office. I hope Mullen writes another in this series."}, {"userName": "Sandi", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/1185451-sandi", "userReview": "Another excellent historical crime novel from the author of Darktown. Great atmosphere, plotting, and characters."}, {"userName": "Barbara", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/11701608-barbara", "userReview": "“Lightning Men” is the follow up novel to Thomas Mullen’s “Darktown”. As with “Darktown”, this is both a mystery and historical fiction novel set in 1950’s Atlanta when the Ku Klux Klan was rampant and discrimination was assumed.Main characters Lucius Boggs, Tommy Smith, Sergeant McInnis, and Denny Rakestraw are back. Boggs and Smith are African-American police officers working the beat of Darktown, the segregated part of Atlanta for Blacks. Their Sergeant, McInnis is white and fights the injustice of internal Atlanta police who degrade the Black Officers. In this story, Boggs, Smith, and McInnis are trying to stop the sale and distribution of illegal drugs and liquor which is supported by the white police force. Author Mullen loves to show the swarthy and dirty side of police corruption in the 1950’s. Mullen also included the changing racial demographic lines at the time. Educated and prosperous Blacks were moving into white neighborhoods and the Klan was not happy. White Officer Denny Rakestraw happens to live in a neighborhood that is experiencing racial change. Rakestraw is not a racist, but walks a fine line between keeping his job and helping the Black police force. Through Rakestraw, the reader feels the conflicting feelings and the stress of fighting against his fellow racist police colleagues, his neighbors, and his own family. Through McInnis the reader feels the demoralizing front of his fellow officers. Lucius Boggs hails from an educated family. Through Lucius the reader learns how racist white people despise educated and articulate black folk. Tommy Smith is a street-smart man who understands the culture of the seedy subculture of Darktown. Both Boggs and Smith work under impossible situations. The reader endears along with them as they struggle to enforce the law and clean up their part of town. My only complaint with this novel is that Mullen didn’t provide info in his Author’s notes. He did a fabulous job with his previous novel. In this one, he cited one novel. I do love references in author’s notes. Sometimes the notes make the novel even more fantastic. All in all, it’s a great read and I hope that Mullen continues with his characters."}, {"userName": "Bibliophile", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/3111409-bibliophile", "userReview": "Loved Darktown and was thrilled to be reunited with Boggs, Smith and Rake. They all go through some major changes and I'm very curious to see what they'll get up to in the next book (there has to be a next book). Excellent writing, believeable character development, tension you could cut with a knife. Recommended for anyone who enjoys quality crime fiction."}, {"userName": "Donna", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/301807-donna", "userReview": "This book is the sequel to “Darktown”which I loved and recommend. Set in Atlanta in 1950, it is the story of racial clashes as blacks begin to push on the edges of the white structures of the city. The housing issues are well presented and will remind people of the time of redlining and white flight here in Chicago as well as in many communities across America. In addition, black police officers, by trying to clean their neighborhoods of drugs and moonshine, are interfering with rackets which benefit white police officers. This book and its predecessor are not easy reads, but I highly recommend them because they so clearly share the history of that time when the US was beginning to be torn apart again by its original sin of slavery. The long tail of events like the ones pictured here bring us right to Charlottesville in the summer of 2017. These two books are highly recommended for book discussion groups."}, {"userName": "Roman Clodia", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "Darktown was a 5 star book for me, this sequel 3 stars. Mullen again manages to articulate scenarios of segregation and racialised hatred which incense, but overall this is more community soap opera than the tauter first book.Mingling a love triangle for Boggs, with a KKK/Neo-Nazi plot, drug gangs and territory wars, plus shifting demographics as an all-white neighbourhood is forced to allow in a few black families means there is no overriding narrative drive. The story ambles between stories, characters and points of view and the attempt to tie them all together results in some forced connections. This is still potent historical fiction with one eye on the present troubled state of US race relations, it just didn't blow me away as Darktown did."}, {"userName": "Stacy Bearse", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/6516164-stacy-bearse", "userReview": "Staged in the early 1950s, Mullen’s story follows a small cadre of African-American policemen, the first of their race to be hired in Atlanta, GA. The overt racism of the time is portrayed in its full ugliness making this a tough book to read without erupting in anger. So call this a solid crime novel with strong social overtones. It is a book I will not soon forget."}, {"userName": "Andrew", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/1273285-andrew", "userReview": "Excellent novel and a sequel to Mullen’s first historical mystery set in post war Atlanta, Darktown. This book follows the same characters as they navigate the racial divide in Atlanta at that time. Well written, with a touch of noir this book is worthy of the great reviews it’s gotten. Highly recommended."}, {"userName": "Abby Slater- Fairbrother", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/40142516-abby-slater--fairbrother", "userReview": "I previously read the first in the series, Dark Town and was absolutely blown away by the raw honesty and accuracy of historical fact. I thought this series was brilliantly unique and a little part of history we should all know more about! Officer Boggs and Officer Smith are back and it is one hell of a great read!Atlanta, Georgia 1950 sets the scene of the novel. The growing racial tensions and the civil rights movement, create a powerful backdrop for this novel. Officer Boggs and Officer Smith are two of Americas first black police officers. They don’t have the same rights as the white officers and they certainly don’t hold any form of privilege. But what they do have, is the desire and power to clean up their own community! Their boss is a white officer named Denny ‘Rake’ Rakeshaw. He is in charge of, as it summarised in the novel ‘Americas negro police unit’. The unit faces many threats from both inside and outside of the law. The face dangerous opposition from the Klan, gangs and criminal warfare. When Rake’s bigoted brother-in-law Dale, a local klansman is linked to a crime scene. Rake must choose between family loyalty and the law? Meanwhile, Boggs is dealing with a personal drama, with his new choice of fiancée. Smith is looking forward to the birth of his new niece/nephew but wary as his sister has chosen to move into the white area of town. One City, two races and three cops! The prologue opens with Jeremiah being released from Georgia state prison. With no more than 75 cents in his pocket and no one to collect him. We the reader become aware he is alone in the world! His girlfriend having stopped writing years ago and he is startled by police sirens nearby. He stumbles across a preacher who warns him that if he doesn’t find a place to stay, he can be re-arrested for vagrancy! The preacher warns he has seen many paroled convicts, re-jailed in shocking time! “Always know what you’re up against and what you’re dealing with, and how you’ll get out of it if it turns ugly” Sgt McInnes Boggs and Smith police their territory of Atlanta. Taking out moonshiners and drug dealers. They are determined to clean up the streets and refuse to be bought. Which unfortunately is not the same for the white police officers, who are happy to wade into dark town and take their cut of the drug money. In 1950 Atlanta, black people made up 1/3 of the population but they were crowded into 1/5 of the land. Poverty and inadequate housing at every turn. When you can’t get a job of fair salary, crime pays. Just 10 black police officers to patrol thousands of souls……Life for the black officers is far from easy. They aren’t allowed to wear their uniforms to/from work for fear of being killed. They face prejudice at every turn. They are often racially abused by the white police officers. They are not allowed to interact with white civilians and if suspect a white person of a crime, must find the nearest call box, for the white officers. They are not allowed to drink, even when off duty. Whilst the white officers frequently take the law into their own hands. Many are rumoured to be members of the Klan. The inequality and injustice is fully explored, the white privilege of the 1950s is unveiled. Boggs and Smith, along with Officers Dewey Edmunds and Champ Jennings continue to police the neighbourhood with conviction, despite the unfair world that surrounds them. When they stumble across a crime in progress and take action. It leaves a dead body, that none of them shot! With Boggs having knocked out a white suspect, safe to say, the officers have opened a can of worms! What ensues in their conversations offers an insight how they each individually view race? “You think white ladies don’t drink? You think their shit don’t smell?”“Rich folk don’t break laws?”Across town, Dale is becoming more and more involved with the Klan. The world of their organisation makes for in-depth writing. The author has clearly researched the Klan and how they operate. Dale having been initiated at just 16yrs old, firmly believes, this is the gang for him. But a man so uneducated and angry, is an easy individual to manipulate. It isn’t too long for Dale to fine himself at a crime scene either……….“Kluxers are about more than the colour of skin. We are the moral authority?”Over a dinner at Bogg’s family residence, we learn more about his fiancée Julie. His preacher father is disgusted at the impending nuptials and warns his son, so marry a ‘nice’ girl. The fact that Julie is a single mother to a young son Sage, has the preacher in the belief she is a fallen woman. This only serves to push Boggs closer to Julie. But Julie holds some secrets of her own, secrets only she and one other soul know………There is an introduction of a character called Bartholomew Kressler. Which makes for interesting reading, I am not going to spoil the character for readers. But he is exceptionally unusual, put it that way! He informs Boggs and Smith that he witnessed local loan shark and all round thug Thunder Malley at the scene of a crime. When Dale urgently calls rake in the middle of the night, in trouble. Having escaped from a crime scene that left one man dead and one man badly beaten. It forces Rake to investigate, to try to keep Dale from being arrested. His motives for this are sketchy, but are fully explored throughout the novel. He uncovers the dead man was a suspect in the beating. A dead Klansman named Walter Irons. The victim of the beating however, is a white banker named Martin Letcher. Letcher not being unknown to the Klan himself, he believes in their values. Why are the Klan attacking their own men? How involved is Letcher? What are the motives for the beating? Boggs and Smith continue to seek to take out Thunder Malley. They want Malley out of their community and not flushing it with his illicit product. We learn Smith has informants in the community and manages to navigate the criminal underworld in a different way to Boggs. The informant warns them there is a turf war about to erupt. That Quentin ‘Q’ Neale is wading on Malleys territory. He warns them Q has protection from the white cops. Something Boggs and Smith, do not! The novels progresses at an engrossing pace. We learn more about the background of Rake. Invited to join the Klan in 1948, post his service in ww2. Rake refused. We learn of his immigration status, that his mother and father were progressive on race. They themselves being treated appallingly as German refugees in America, due to the war. His previous partners have been members of the Klan and this has always led to heated debate. Rakes father summarises the Klan “ragtag group of bullies and Neanderthals”. We also learn more about Smith’s background. His father was lynched in 1919, after ‘daring’ to wear his uniform from his service in the great war. His mother couldn’t cope with the grief and committed suicide. Leaving him an orphan as a child. He was taken in by an aunt and raised as her child, along his sister Hannah. Hannah is now heavily pregnant with her first baby. Her husband Malcolm is a veteran of ww2 and served in the 761st tank battalion, the famed black panthers. Malcolm has struggled to find work, after being demobbed and is currently working as a bouncer at a local club. Having recently moved into a white neighbourhood, they are facing daily threats and intimidation to move out. When a break, with a note attached comes flying through the window they call on Smith to help!Cassies Rakeshaw, Rake’s wife is of different political thinking than her husband. She fears the local black population and what will become of ‘her’ neighbourhood. When local neighbours Paul and Martha Anne Thames invite her to join their group Collective Association of Hanford Park (CAHP). Their goal being to buy out the black homeowners. What will Rake make of her choices? Why is she so consumed with fear? Will she pay for the choices she makes?There were moments throughout the book that I just had to put it down and digest the information. Why does a hateful mentality spread like a poison in communities?When Malcolm is attacked, Smith is summoned to Grady Hospital, the coloured wing. Malcolm has been beaten so badly, he is lucky to be alive. He can’t account for who beat him, but it is known there was more than one assailant and they used a bat. Malcolm is angry and demands justice. He wants to see the white suspects held account for the beating. He quickly learns that this will not be happening anytime soon, when the cops cover it up for fear of a riot. “Blame the negro for causing trouble, Boggs thought Disturbing the peace”Rake doesn’t despise the black officers and upon seeing ‘white community only’ flags in his neighbourhood, tears them down. The flags carry a logo and it becomes clear to Rake the Columbians are back in town. Who are the Columbians? What is their connection to the Klan? Is this a turf war also? Jeremiah returns to the town he knows. He discovers most of his friend are dead or in jail. His family have left for Chicago and blame him for the death of his brother. He only has one person he can call on in the world. Unbeknown to him, this woman has a new life. One she is not willing to give up on…….The Columbian/Klan theme is further detailed. I found it profound that it is more often than not (2017 and 1950s) those who have never fought for their country, whom believe right wing ideals and aspire to violence, fear and war to achieve their goals. Having seen recent media reports of a Nazi march in the USA. I did ponder why these men armed to the teeth with rifles, had not enlisted after 9/11. Thunder Malley is finally apprehended and taken into police custody. However, police custody as a black man in 1950, is no safe place to be. It isn’t long until his body is discovered dead and it stinks of police corruption. All this takes place as Dale is due to meet the grand wizard himself. Overseer of the entire Georgia KKK at their sacred altar. Dale learns that the incident he took part in, was unsanctioned by the grand wizard. Which means dale could pay with his life for the crimes he took part in. Now Dale fears the KKK, imagine the irony in that………..As the novel continues we see Hannah receive further rape/death threats. Rake become involved with the Georgia Bureau of Investigations (GBI). A local business owner is also dragged into the case. The white ladies down at the records department continue to ignore Boggs or Smith’s attempts to access files. Which again I figured was ironic given their own status of oppression as 1950s women. The case continues to throw up new characters, such as known racist Sgt Slater. The past comes back to haunt all the characters and to read it all unfold is gripping. One thing is for certain it is all going to erupt. “Which part you find harder, the white cops who hate you for thinking you’re as good as them, or the coloured folk who hate you for ‘acting white’?”.There are moments of reading this novel that I actually flinched, the spiteful terms or insults were painful to read. But they are accurately portrayed, this is how segregation worked. The knowledge that racist terms were incorporated into everyday language. Such as the use of the term ‘boy’ to a black adult male was done do, to show inferiority. So many phrases and slogans coined, to make the already privileged white person feel even more smug and superior! Boggs and Smith make for perfect reading and their bond is firmly cemented in this case. This has to be my longest ever review and I shall finish up with saying, 3 simple words. Five star genius! 5* Genius!"}], "description": "From the acclaimed author of The Last Town on Earth comes the gripping follow-up to Darktown, a “combustible procedural that will knock the wind out of you” (The New York Times).Officer Denny Rakestraw, “Negro Officers” Lucius Boggs and Tommy Smith, and Sergeant McInnis have their hands full in an overcrowded and rapidly changing Atlanta. It’s 1950 and color lines are shifting and racial tensions are simmering. Black families—including Smith’s sister and brother-in-law—are moving into Rake’s formerly all-white neighborhood, leading some residents to raise money to buy them out, while others advocate a more violent solution. Rake’s brother-in-law, Dale, a proud Klansman, launches a scheme to rally his fellow Kluxers to save their neighborhood. When those efforts spiral out of control and leave a man dead, Rake is forced to choose between loyalty to family or the law.He isn’t the only one with family troubles. Boggs has outraged his preacher father by courting a domestic, and now her ex-boyfriend has been released from prison. As Boggs, Smith, and their all-black precinct contend with violent drug dealers fighting for turf in new territory, their personal dramas draw them closer to the fires that threaten to consume Atlanta once again.", "title": "Lightning Men\n      \n          (Darktown #2)", "url": "http://www.goodreads.com/book/show/32895284-lightning-men", "average": 4.12, "cover": "https://images.gr-assets.com/books/1505139262l/32895284.jpg", "reviews": 160, "authors": [{"url": "https://www.goodreads.com/author/show/43391.Thomas_Mullen", "name": "Thomas Mullen"}], "type": ["Historical", "Fiction", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/32895284-lightning-men", "http://www.goodreads.com/book/show/33780622-lightning-men", "http://www.goodreads.com/book/show/36299895-lightning-men", "http://www.goodreads.com/book/show/38714564-lightning-men", "http://www.goodreads.com/book/show/32895509-lightning-men", "http://www.goodreads.com/book/show/76336.The_Last_Town_on_Earth", "http://www.goodreads.com/book/show/27274326-darktown", "http://www.goodreads.com/book/show/10789142-the-revisionists", "http://www.goodreads.com/book/show/6589672-the-many-deaths-of-the-firefly-brothers", "http://www.goodreads.com/book/show/31573230-atria-mystery-sampler-2016", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}