{"ratings": 313, "userreviews": [{"userName": "Jonfaith", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Perhaps it is simply Sinclair overloard (1000 pages of his in two weeks), perhaps the concurrent surfeit of images from London dissuaded me. I felt this text was inferior to London Orbital; I also collapsed to a minimal degree per some of Sinclair's personal bifurcations (to cite Roubaud) which I felt flat. His poetic waxing on pitbull culture was an ever-so-prescient for a rasher of recent events. Sinclair's stories overflow with woe yet they amaze and elicit."}, {"userName": "Tom", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/1929624-tom", "userReview": "I liked parts of this book. Sinclair knows his way round a sentence and I enjoyed his self-conscious prose. However, this is more a collection of fairly fragmented essays on obscure artists, poets and film-makers, tied together with the vague conceit of the author as a tongue-in-cheek Flâneur in London. Although I enjoyed the sections on Patrick Keiller and Chris Petit and the brief cameo from Howard Marks I didn’t engage as much on some of the longer sections on conceptual and performance artists like Rachel Whiteread and Brian Catling. I wanted more of Sinclair’s writing on London and urban space, rather than his critiques of the artists he obviously admires. At times I felt I might have been better served taking out a subscription with the London Review of Books and going through their back issues on line, given that many of the chapters were adapted from essays from the journal. Throughout reading Lights Out for the Territory, I was constantly making notes of other books to read and films to watch. I would have preferred to be more engaged with what I was reading, instead of feel distracted by the visions and imaginations of artists other than the author."}, {"userName": "Ben", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/10412918-ben", "userReview": "At times brilliantly inventive and eye-opening, at times frustratingly oblique and obscure, I found this book a frustration and a delight in almost equal measure.Sinclair's 'psychogeographic' meanderings through the underground history, culture and communities of various parts of London is an acquired taste, and a piece of writing that requires significant application by the reader.Despite my interest in London geography(having studied the course at a London university) I found some of Sinclair's expositions impenetrable as they often require prior knowledge of the various poets, philosophers, writers and local personalities that he references. This said, the chapters that touched on topics as disparate as the history of St Pancras Old Church, the imagined community of the East End, the lives of the elites on the north bank of the Thames, and the alternative history of St Paul's Cathedral were profound, surprising and enthralling.The idea of the flaneur, the urban explorer who wanders the city landscape in search of deeper meaning and making imaginative connections between place and people through time and space, is certainly a powerful method for interpreting the city and succeeds in explaining London as an organic and ever-developing morass of people, ideas, histories and experiences. In this way, Sinclair opens up new avenues of inquiry and brings to the surface aspects of London that could easily have been forgotten.I would suggest that this book is better read as a series of short pieces of imaginative journalism, rather than one work with a running narrative. After all, the book is underpinned by a number of separate essays written by across a long period of time. Also, given the importance of the writer's photographer companion on his London wanderings, I was disappointed that so few of the photographs were included in the book."}, {"userName": "Tosh", "userReviewDate": "Jun 19, 2008", "userURL": "http://www.goodreads.com/user/show/133661-tosh", "userReview": "What a great odd (eccentric?) book about one's city which is called London. But it's a London that many will not know. The loose term would be psycho-geography. Touring one's city with fresh eyes or just to drift among the architecture and its people. One picks up history like it was trash left over the night before.The Surrealists, specifically Andre Breton, started to walk through a cityscape without a map at times, but always keeping the eyes and ears open for new discoveries or new ways to frame 'history' in a new light. Guy Debord and company did the same with excellent results.Iain Sinclair does the same, and if one would find fault with this book, he does drop a lot of names that only hardcore British London people would know. The Krays, and certain writers/photographers known in the Soho London world. But I love it for that reason alone. It's a mind wondering all over a location that one 'thinks' they know. But alas there are still mysteries in neighborhoods and sections - it's endless really. This is my type of 'travel' writing!"}, {"userName": "Dan Scott", "userReviewDate": "Sep 21, 2007", "userURL": "http://www.goodreads.com/user/show/401360-dan-scott", "userReview": "If you want a completely different view of London and all her secrets read this book! Sinclair and his fellow students of psychogeography (dread word!) tie up the connections between London ley lines, Hawksmoor's churches, Canary Wharf and \"Blow Up\" (vale Antonioni.)Have an A-Z handy too...Companion volume is London Orbital"}, {"userName": "Candy Wood", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5858970-candy-wood", "userReview": "The subtitle, \"9 excursions in the secret history of London,\" indicates what this book is about, and Sinclair does cover a lot of territory, both familiar and unfamiliar if not exactly secret. The excursion format allows for an enjoyably loose organization: this isn't a guidebook, and it joins together versions of several pieces that were written at different times for periodicals. Sinclair's London is in books and films as well as on the ground and in the imagination. For example, the section called \"X Marks the Spot\" refers to King's Cross, Boadicea, the meeting between Percy Shelley and his future wife at Mary Wollstonecraft's grave at Old St. Pancras, an epic poem by Aidan Dun, a graphic novel by Alan Moore, and more besides. I especially enjoyed the last section, in which Sinclair takes P. D. James to task for the shortcomings of her detective novel Original Sin, not least of which is her locating a Venetian palazzo in Wapping."}, {"userName": "Andrew", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/442654-andrew", "userReview": "Like the television work of Jonathan Meades, Iain Sinclair is devoted to taking the built environment apart piece by piece, history and biography and graffiti all at once, and does so with a particular talent for turning a phrase (\"the Cypriot tailor who sent the Krays to the Old Bailey looking like Romanian secret servicemen at a wedding,\" par exemple). As a 'merican, I'm not getting half as much out of this as my British co-worker who periodically interrupts my work to chortle at a line from this as he follows Sinclair through his own old haunts in Brixton and Hackney, but I damn well enjoyed it, even if I needed to Wikipedia-check a few things from time to time."}, {"userName": "Leslie", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/3047454-leslie", "userReview": "Parts of this were brilliant, but after a while I started to feel like I was listening in on a conversation about people I don't know, that I was alone at a party where everybody else went back years and was full of news about old friends and acquaintances, about this person's new film project and that one's art installation and someone else's self-published poetic masterpiece, and the only way I could get in on the fun was to have read all the same books and participated in all the same happenings and attended all the same exhibits and known all the same people. And that got a bit tiring."}, {"userName": "Dax J", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/858468-dax-j", "userReview": "I always felt the hidden gems of a city aren't something you'll find in a tourist guide, but hidden lives steadily lived. Iain Sinclair is a master at bringing the hidden people and economies of a city to surface. Sinclair's London and Luc Sante's New York writing are rare accounts of the the invisible architecture connecting a city to it's people.I read this while on a recent trip to London thinking I'd also use the Museum of London's \"streetmuseum\" iPhone app, but I quickly realized the best way to augment reality is with, A BOOK."}, {"userName": "Alex George", "userReviewDate": "Oct 16, 2010", "userURL": "http://www.goodreads.com/user/show/4302771-alex-george", "userReview": "One of the best books about London ever written. Utterly brilliant. Staggering writing."}, {"userName": "Laura Lam", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/2067903-laura-lam", "userReview": "Read a 45 page excerpt for grad school."}, {"userName": "Tadeusz", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/49805134-tadeusz", "userReview": "This idiosyncratic book is sometimes amusing, sometimes irksome. I suppose you might learn something about London, but I as I read I thought, \"this guy is trying to show how clever he is\"."}, {"userName": "Stephen Redwood", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/5913707-stephen-redwood", "userReview": "There's no doubting the erudition of Sinclair, which sparkles in virtually every sentence. The book is supposedly about London, but really the places and people he visits or describes are launch pads for a disquisition on whatever interests him, from graffiti to houses to the river to all sorts of individuals, recognizable and obscure. At the level of detail and abstraction he gets to it demands close reading and can be difficult to follow. So, while often fascinating, it is abstruse at times. For example, the section on the artist Brian Catling who seems to operate in a world abstracted from everyday life, while living very much in the material world. Or, when comparing Catling to Henry Moore he says of Moore's sculptures \"These grave forms do not so much affect memory as displace it, decant their own weight, position themselves in our mappings of the city like railway temini.\" Whilst I kind of get the gist of it, this is either profound or gobbledegook and I'm unsure which. And so it is in many parts of the book. When he disapproves of or dislikes something he shows it: \"The toilet-club sit down ravers\" in reference to \"deregulated shamans, equal opportunity visionaries\" in London.Incredible, impressive, prodigious collections of details are thrown in casually all over the place. For example, referring to a London School of Film course on technique in a discourse on cinema, he notes that the critic David Thomson is one of the exceptions who actually noted attendance there as a credit on his resume. Where does he get it all from?Cinema Purgatorio is perhaps the most straightforwardly readable chapter and fluently humorous, as he describes his attempts, minor successes and failures to build a career in the world of cinema.Then there is substantial space given over to Lord Jeffrey Archer and his apartment overlooking the Thames. Sinclair obtains agreement to visiting Archer's apartment and which sends him off on a riff about the elitism of art and the lives of people who can afford it and who seek to enhance their status through their baubles, while living in a universe disconnected from the realities of most people. I was a young adult at the time Jeffrey Archer was at the top of his game in Thatcher's government and as a trashy novelist. I also experienced some degree of schaden freude at his fall from grace, when he was caught in a lie over the use of prostitutes. So, Lord Archer's Prospects is a chapter that was easier to follow and engage with. And maybe that's the weakness of the book - without prior knowledge or contextual insight on his various themes, it can be hard to track.He has a fixation on PD James and does not hold back on writing he is unimpressed by; and on films like Antonioni's Blowup, which allows him to venture off into digressions on various characters of differing artistic modes and to occasionally draw us back to some part of London that started him off. One of these is Maryon Park, from which he springs into stories about the photographers McCullin and Bailey, and the Beatles and Lynn Redgrave and Terence Stamp and various other characters like the Kray brothers who make appearances too. In his penultimate paragraph, he admits to being \"fond .... of these arbitrary leaps\". No kidding. A fitting, admission at end of a clever, quite brilliant book built on them."}, {"userName": "Michael K", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/7633584-michael-k", "userReview": "The essential Sinclair book, with some of his later excursions across, around and within London coming off as an attempt to recapture this book's intense richness and breathless excitement as he brings to life the London that can be lived in. Although I am averse, in general, to eulogists of London who, altogether, grossly overstate its global cultural/historical ascendancy, what Sinclair has done here is provide a practical method to remake a city, any city. He achieves this with a combination of a journey that can be adapted/replicated by the reader and his own characteristic prose-styling, being himself an underrated and visionary poet (search out 'Lud Heat').Though books like 'London Orbital' may have reached a wider audience for Sinclair, their essential origin is here and what they miss is the additional function of this book as a definitive directory of occult currents, ancient and modern, that run through the city still, even after the brief period of 90's visibility that Sinclair's book provided."}, {"userName": "Nicholas Flower", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/23349822-nicholas-flower", "userReview": "Dense, complex and enthralling, Sinclair riffs on London in wild cluttered prose that echoes the intense life and history of the city itself. Every page sparks a digression and every digression a point of further study. Along with London Orbital this book constructs the only kind of meaningful picture of.a city sagging under the weight of its own past, giving life to the buildings and people and the very streets that comprise it."}, {"userName": "Roisin", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/23174792-roisin", "userReview": "This is a brilliant and interesting book of journeys around London, that will resonate if you are familiar with some of the hidden gems that exist, some of which are now lost. If you are not, there is enough wonderful pieces of knowledge, places, people and culture to encourage anyone new or not to Sinclair to want to wander and discover the world of Mr Sinclair."}, {"userName": "Mira", "userReviewDate": "Mar 04, 2008", "userURL": "http://www.goodreads.com/user/show/769637-mira", "userReview": "An crazy/entertaining/violent/funny/etc journey through the streets and areas of London. Probably the most readable historical text you will ever read. Sinclair covers the criminal underworld of turn-of-the-century London and beyond, the early world of the British publishing industry, street art, the occult, and much more."}, {"userName": "Gabriel Clarke", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/5740536-gabriel-clarke", "userReview": "Or 7/10 perhaps. Though maybe I should give up the whole impossible of grading books, unless I stick rigorously to marking them against their standards. Tricky. Anyway, this is the first Sinclair text I've read from end to end. I suspect it isn't his best (the fragments cannot be made to cohere) but there's much to enjoy. A skeptical but dedicated psychogeographer."}, {"userName": "Lysergius", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/5905580-lysergius", "userReview": "Journeys across London. Myth, leylines and conspiracies mixed with cinema criticism and history. Quite compelling. Makes me want to read the rest of his stuff. Highly commended. There is even a lovely picture of Howard (Mr Nice) Marks rolling a spliff outside MI6."}, {"userName": "Michael", "userReviewDate": "Sep 21, 2009", "userURL": "http://www.goodreads.com/user/show/2137508-michael", "userReview": "I thought this would be better,but unlike the classic London Orbital too much time is spent not on the interesting journeys around london but on the author waffling about obscure artists and other such rubbish. The film stuff at the end is brilliant though."}, {"userName": "Mark Vallianatos", "userReviewDate": "Aug 08, 2010", "userURL": "http://www.goodreads.com/user/show/736915-mark-vallianatos", "userReview": "psychogeography in action/ analysis. I don't know london well so there's a fog to some of the details, places, history but the style is beautifully incisive & many of the references he effortlessly casts off are worth looking up"}, {"userName": "Paul", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/60816315-paul", "userReview": "This book changed my way of thinking about literature. Content-wise, it's one man going for a few walks, which is fine, but it's the style, rhythm and cadence of the writing that make it so special. Sinclair's peak was probably '94 through to around 2001, but the pinnacle is probably this one."}, {"userName": "Joe", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/547789-joe", "userReview": "Very enjoyable read. Dragged in certain chapters, but more than made up for it in others. I loved the connections he makes and the ground he covers."}], "description": "This is a record of long journeys on foot, from Hackney to Chingford and down to the river, around the City in its ring of steel, and through the heart of Westminster, Lambeth and Millbank.", "title": "Lights Out for the Territory: 9 Excursions in the Secret History of London", "url": "http://www.goodreads.com/book/show/118185.Lights_Out_for_the_Territory", "average": 3.99, "cover": "https://images.gr-assets.com/books/1387750630l/118185.jpg", "reviews": 23, "authors": [{"url": "https://www.goodreads.com/author/show/6851.Iain_Sinclair", "name": "Iain Sinclair"}], "type": ["Nonfiction", "Travel", "History", "Travel", "Geography"], "outlinks": ["http://www.goodreads.com/book/show/118185.Lights_Out_for_the_Territory", "http://www.goodreads.com/book/show/1403343.Lights_Out_for_the_Territory", "http://www.goodreads.com/book/show/1679327.Lights_Out_for_the_Territory", "http://www.goodreads.com/book/show/1875461.Lights_Out_For_The_Territory", "http://www.goodreads.com/book/show/118186.London_Orbital", "http://www.goodreads.com/book/show/2152486.Hackney_That_Rose_Red_Empire", "http://www.goodreads.com/book/show/933388.White_Chappell_Scarlet_Tracings", "http://www.goodreads.com/book/show/118193.Downriver", "http://www.goodreads.com/book/show/118192.Dining_on_Stones"]}