{"ratings": 54015, "userreviews": [{"userName": "Stephanie", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/1890955-stephanie", "userReview": "I was so disappointed in Grisham's latest work. He took more than half the book to create this wonderfully detailed plot and then three chapters to close the book. Three chapters in which he untwisted some of the elements of the plot, didn't resolve anything, and quit to early. I felt so unfulfilled at the end.It kills me that his latest books haven't been up to par with his earlier works. In the beginning, his books were well-crafted and well-executed. After he began seeing his books turn into movies, they became a little fluffier but he eventually returned with The Street Lawyer and The Broker. But alas, we are back to the fluff and I'm sad to say that he is falling in my list of fav authors.."}, {"userName": "Michael", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "Good books don't necessarily have to provide all the answers to every plot thread introduced into them. We want our characters to feel like they have lives beyond the confines of the printed page and that their story exists before, during and after the book we're reading. But a good book should at least provide the reader with some sense of closure and not the feeling like an editor was standing over the writer, pointing out that he or she had x-number of pages left or he or she was slowly reaching the word count for the novel and that wrapping up the book soon would be a good idea. There should be some sense of closure, not just a sense of wrapping things up.There's a distinct lack of closure to John Grisham's new novel. \"The Associate\" spents 275 pages setting up the situation Kyle McAvoy faces. Years ago, his roommates at a frat party took advantage of a young woman, while she may or may not have been passed out. The young girl had a reputation and when she tried to press charges for rape, the investigation hit a quick dead end and the matter was dropped. Or so it would appear. While Kyle wasn't one of the participants, he was in the room when it happened. Now, years later video from a camera phone has surfaced in the hands of men who want Kyle to do thier bidding. He is to accept a job with a high-prestige law firm and spy on them for these men. This mysterious group seems to have their fingers in a lot of pies an a lot of power, though it's never explained why or if they're manipulating certain aspects of Kyle's life and that of his friends. They hold the tape over Kyle's head throughout the story, saying that while it may not lead to charges it will certainly ruin the life of Kyle and his friends. Kyle is pressed into service in an impossible situation and slowly begins to try and find a way out of it. By reading spy novels, he routinely sheds those tailing him and begins to slowly fight back, forming a plan of his own. Meanwhile, he's got the soulless first year job at a law firm and maybe a connection with a fellow female associate. It's a lot to take in and Grisham does a nice job of keeping the plot moving for the first 300 or so pages. But it's right around a huge turning point in the novel that things slowly being to unravel. I won't say the turning point, but if you've read the book, you can probably peg it. It involves one of the group of the accused who went to Hollywood seeking his fame and fortune. Suddenly, things kick into a different gear and Kyle makes some decisions. These are things that could and should change the story and ratchet things into a higher gear, adding to the suspense and making the pages turn faster. And they do...except these things all happen 30 or so pages before the novel ends.And the novel just wraps up. In one of the more unsatisfying endings I've read in a while, Grisham just finishes the story. In the end, justice isn't really served and you can see how Grisham is trying to create a morally ambigious ending, but yet it just doesn't feel satisfying. Kyle isn't a purely innocent character, but it'd be nice if it felt like some or any of the bad guys got what was coming to them in the end. Instead, it's one of those--hey, life sucks but what are you going to do? endings that left me frustrated and wondering where the rest of the book was.We could at least know that Kyle got the girl or something. A hint, anything besides what we go.And that's a shame. Because Grisham works hard in creating Kyle and allowing us to identify with him and feel sympathy for him as the net closes in around him. This could have been great Grisham. Instead it's just mediocre Grisham."}, {"userName": "Terrie", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/1516383-terrie", "userReview": "The most anti-climactic book ever. What happened to the Grisham I used to love?"}, {"userName": "babyhippoface", "userReviewDate": "Jan 30, 2009", "userURL": "http://www.goodreads.com/user/show/282057-babyhippoface", "userReview": "I enjoyed this one quite a bit, but....I got into the intrigue, especially once Kyle started attempting to turn the tables on Bennie & Nigel. But then came the ending. What is with Grisham these days? I didn't like the ending. I did not DESPISE the ending, as I did with Grisham's last book (The Appeal), but I found it entirely unsatisfying. Just give me a good, old-fashioned, bad-guys-get-their-butts-kicked ending anyday!"}, {"userName": "Sesh", "userReviewDate": "Feb 08, 2009", "userURL": "http://www.goodreads.com/user/show/321264-sesh", "userReview": "With every book, Grisham gets worse. I keep telling myself I should stop reading the garbage he his dishing out, but I keep going back just to find out how bad it can get. What can I say? I give one star because for effort, just to type the words in. Otherwise there is not much to recommend in this book. The plot is weaker than Bud Lite, the ending is anti-climactic."}, {"userName": "Natalie Vellacott", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/34178791-natalie-vellacott", "userReview": "\"The consequences were horrifying. The magnitude of the conspiracy caused Kyle's heart to hammer away. His mouth became dry and he sipped lukewarm coffee. He wanted to leap for the door, sprint down forty-one flights of stairs, and run through the streets of New York like a madman.\"\nKyle McAvoy plans to finish law school, then work for the under-privileged for a few years before heading for the big time and money. However, Kyle has a dirty secret locked away in his past. Only a handful of people know about it and they are all just as culpable. What happens when the secret that could ruin Kyle's life falls into the wrong hands? What if these are deadly hands that will stop at nothing to get what they want? How will Kyle respond when confronted with the evidence and when he is commanded to do the unthinkable?The plot for this book was pretty standard. There was the odd twist, but nothing seriously shocking. The ending fell flat....although I had to keep reading to find out what happened. It was difficult to put down purely because of the suspense and \"need to know\" element. I suppose I should give Grisham credit for that as it's part of what makes a good novel. However, if you build a reader up in this way, you must make sure you deliver with a dramatic and satisfying conclusion. Sometimes, Grisham seems to leave his characters floundering and there should be a sequel. I felt that this was the case with The Associate. It wasn't one of his best books, nor one of his worst, slightly better than just okay.The main takeaway points were that it's better to do the right thing at the earliest possible stage because otherwise you just end up digging a huge hole for yourself, and other people. Also, that the end does not necessarily justify the means, if they are unethical or inadvisable. Doing the right thing will also not always win you friends or make people happy here on earth, but God sees the choices we make and He is honoured when we listen to our conscience. He promises to honour us if we honour Him.I also felt exhausted by the workaholic lawyers in this book; billing countless hours, cheating their clients, sleeping at their desks, absent from their families, and mostly detesting their work which had totally taken over their lives. One has to wonder what the purpose is, if there is no quality of life outside work, then what is the striving for? Greed can consume a person and make them miserable as whatever they have will never be enough. This is exemplified in this book and can be a warning to anyone inclined to workaholism that it will never satisfy. Work is important and the mandate was originally given by God, but there's a difference between working to live and living to work!There is the odd bit of swearing in this book and a limited amount of non-graphic sexual content. There is also some non-graphic violence.Grisham fans will enjoy this.Check out my John Grisham Shelf!"}, {"userName": "Salymar", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/9986049-salymar", "userReview": "I'll start this review by saying I LOVE KYLE MC AVOY. He's an idealistic, brave, intelligent not to mention a good looking law student. I wish I can find someone like him at the law school I'm going to be accepted at. (HAHA. Sorry, the girly side of my brain started to speak up. lol)Some people say that this is a suffice to John Grisham's highly acclaimed novel, 'The Firm'. And after reading this, I found out that it is real and adequate. For the reason that in both novels, young lawyers are on the run chased by fraud FBI agents or blackmailers from pathetic law firms. At the end, when our heart is very thrilled about a young lawyer being chased and all. Both characters (Mitch The Firm and Kyle The Associate) change their mind and set about trapping the blackmailers. And that's it. The ending is unbelievably unwrapped up.However, despite the fact that I was thornly disappointed about the idea of how \"The Associate\" has been written. I have this feeling of LOVING IT. The novel has a very fast pacing because I was thoroughly caught up in this book from page one (1) until the very last page. Very exciting!The idea of working at a big law firm started to bug me (in a good way). I feel like, I wanted to work as a litigator and as an associate at a law firm after I have passed the bar exam (Always look forward and think positively! :p) but my dad often tells me that in the Philippines, law firms are not given the chance to rise up. The legal system is quite different here in the Philippines (I didn't mean to sound vague about it -because I mean it in a positive way...I guess). Well, alternatively, maybe an organization will suit me up. Hehe.At the end, I gave this book an awesome verdict, 4 stars! :)Oh! I forgot to mention: I found Kyle's dad very similar with the street lawyer (also by J. Grisham). It's kind of cool actually. :)"}, {"userName": "Mark", "userReviewDate": "May 22, 2012", "userURL": "http://www.goodreads.com/user/show/2569035-mark", "userReview": "It was ok but no more than that. Young trainee lawyer blackmailed into working for an enormous law firm so as to steal information on a major case they are working. As with all Grisham novels it is an exciting enough story which means you want to turn over the next page but unlike previous Grisham novels I have read I was quite able to put it down when normal life demanded. I was interested to reach the denoument but not 'step over an injured puppy' type interested. Erik Singer narrated and he did a good job but for the liverpudlian/Australian/whatinthenameofallthat'sholy accent he inflicted upon one of the baddies called Nigel. You would think being called Nigel might be burden enough but no Singer decided to curse the poor bloke with a monstrous concoction spanning not just cities but continents and maybe even planets."}, {"userName": "Nick", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/993553-nick", "userReview": "No spoiler alert needed because there are no spoilers. Every aspect of this novel has been done in earlier works of 'legal fiction' by Grisham, and sections bolted together for this new novel. It was enjoyable and a prototypical Grisham read, but there was absolutely nothing new under this literary sun...Grisham should parody the creation of the next Grisham novel, where a bright young legal graduate is coerced into a secretive law firm. On his first day, he is spirited into a basement vault, where he and other new lawyers read through all the existing Grisham works, and use them to build a new one...."}, {"userName": "Leah", "userReviewDate": "Feb 08, 2009", "userURL": "http://www.goodreads.com/user/show/1453604-leah", "userReview": "In most circumstances, the \"quick reads\" or \"beach books\" are so lame-brain and cornball that I skim the book in a half-hour (i.e. James Patterson) However, I have read (really read, not skimmed) every one of Grisham's books. I enjoy Grisham because his stories are the same. You have the same kind of characters, the same dialogue, but it's always suspenseful. You always want to know what's going to happen next. I am comforted by his predictability, for some odd reason."}, {"userName": "Councillor", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/40792319-councillor", "userReview": "John Grisham is known for writing fast-paced escapism novels consisting of entertainment value more than of realism. \"The Associate\" deals with Kyle McAvoy, an ambitious law student in his last semester who later becomes an associate with one of the largest law firms in the world. However, not everything takes course as planned - Kyle is confronted with an unsettling detail of his past, a girl who claims to have been raped by two of his friends while Kyle himself watched dead drunk. A mysterious undercover agent blackmails him with this information and forces Kyle to spy on his new employers and to pass important data if he does not want his future to be destroyed by one fateful night.Initially, I went to our local library, knowing they have tons of Grisham novels on their shelves, with the intention to borrow either \"The Firm\" or \"The Client\". I have watched the movie adaptions of both novels and enjoyed them immensely, so I wanted to figure out whether or not Grisham's novels are able to surprise me even more. Anyway, it turned out the library features all Grisham novels except for \"The Firm\" and \"The Client\". Dissatisfied, I randomly picked one of his other works without previously checking via Goodreads how popular the book is and which basic sentiment the average opinions represent, as I would usually have done. Soon afterwards I realized that not only is \"The Associate\" one of his younger works, but also one of his more criticized ones, and not without good reason.Grisham introduceds an interesting protagonist I was able to sympathize with. Over the course of 300 pages, he establishes an intriguing atmosphere and makes his reader want to know how Kyle will eventually get out of his intricate situation. And then, just as everyone else seems to have criticized, he spends twenty pages on a disappointing climax and lets the story swash along for the rest of the book. All in all, it remains an average story, not necessarily good, but neither frustrating or badly disappointing. I kind of lost interest in the book after 250 pages or so, yet it remained entertaining and provided some interesting thoughts on life as an attorney in the Wall Street. I have never been to New York, don't know much about lawyers and am not too interested in law as a subject of study, so I cannot judge how realistically Grisham has portrayed an attorney's life, but he managed to pull me into a world of power struggles and intrigues in spite of an anticlimatic ending, so it finally deserves a decent three-star rating."}, {"userName": "Matthew", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "It seems like lately when I read Grisham, its a good story with some interesting twists and turns, but the climax is not really super exciting and there tends not to be all that much resolution. That was the case again here. A good book - but not tons of excitement."}, {"userName": "Syndi", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/1656405-syndi", "userReview": "I do not have law degree. And I can related to the main character. the brutal hours you have to work to make it to the top. the politic you have to play to get recognition. And yet there is always someone better than you. But i think the moral story here is do the right thing even the right things sometimes hurt the most. But it will set you free."}, {"userName": "☮Karen", "userReviewDate": "Feb 25, 2009", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "I was thoroughly caught up in this book from page 1 and could barely put it down until the last page. Very exciting even though at times I wanted to yell at Kyle, the main character, not to fall for the blackmail scheme laid out before him. For anyone who has been to a few too many drinking parties in college, this will bring back those memories of regrets and situations that could have gotten out of hand. Kyle was involved in the latter, and thought it was all behind him, until he is approached by strange men who threaten to expose everything and ruin his promising law career unless he helps them. He goes along with it, not because he's guilty of anything, but because there are other lives that could be ruined along with his, should the story come out in full. This, along with his other relationships, makes him likeable and sympathetic."}, {"userName": "Shannon", "userReviewDate": "Feb 10, 2009", "userURL": "http://www.goodreads.com/user/show/885476-shannon", "userReview": "If you like Grisham's earliest works (the Firm, the Pelican Brief, etc.) you'll probably like this one too. It's fast paced, about a young lawyer in big firm who is in trouble. However, I didn't like this one as well as some of the others because I thought the ending was VERY unsatisfying. Grisham didn't tie up the ends the reader is dying to find out at the end of the novel. Darn! I'll be interested in what others say about it"}, {"userName": "Jim", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/2013157-jim", "userReview": "This is the slowest Grisham book I've read -- and I've read them all. It's tedious. It does not read like Grisham. There's almost no action until the end of the book, and then there's not much. What a disappointment."}, {"userName": "Rachel", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/2499261-rachel", "userReview": "Boy, that John Grisham really can write! By that, I mean that he is capable of putting nouns, verbs, and punctuation in order to form sentences, because that is what The Associate is: basically just a lot of sentences. Sentences describing parties, lunches, bed linens, apartment interiors, and hunting trips, with half-assed attempts at intrigue and characterization thrown in here and there. Of course that's what \"comfort fiction\" and \"beach reads\" are all about. But I had it in my head from reading The Client and The Chamber when I was younger that Grisham could write a sort of thrilling legal mystery too.One thing that Grisham CANNOT do, if this book is really representative of \"vintage Grisham,\" is build a character on anything except cliches. This would be another excellent reason to avoid Ford County (its garish paperback cover is number one), although I have to admit that I was curious about the idea of a non-genre Grisham book that's mercifully not about Christmas, football, or pizzas. So, here we've got the Hispanic ex-gang member (of course) who's made it his life's work to help alcoholic frat boys reform and who also sort of resembles Che Guevara when he wears a beret (that Grisham actually wrote this sentence is still cracking me up). We've got the tough, man-hating female lawyer named \"Mike,\" who we're told has multiple divorces under her belt and represents the book's lesbian client while outfitted in black leather and stilettos, the product of either a BDSM-LGBTQ combo fantasy run amuck or casual sexism or maybe both. We've got the hot blonde female lawyer who, despite being cold and reclusive, is sleeping with Kyle in less than 100 pages and whose back (her BACK) is described as \"trim with a nice curve to it\" or something crazy like that. The thing about all of these stereotypes is that they're all just a little bit wacky, and this makes me think that Grisham is sincerely trying and sincerely out of touch. When I got to the part where Kyle tells hot blonde lawyer that he'll watch \"anything but a chick flick\" with her, I found that I wasn't even irritated at this (definite) casual sexism. I just flicked my wrist and thought, \"John Grisham, you cad!\"SPOILERS from here on out:With regard to the legal intrigue that's only intriguing for the first 50 pages and probably about 75 towards the end, I have nothing else to say except that the ending is HILARIOUS. For those of you who haven't read the book, I'm going to summarize what happens now: top Yale law student Kyle is blackmailed into spying on a top law firm from within, by villians of high intelligence and indeterminate motive. This motive remains undetermined through the ending -- so, thanks a lot for that, Grisham -- but along the way they follow Kyle's every move, wiretap his apartment, assassinate one of his college friends in a gas station bathroom, and manage to foil the FBI coming to take them down. Kyle is terrified of them with good reason. Yet, at the very end of the book, when the bad guys have gotten away, Kyle \"heroically\"....turns down the security of the witness protection program??? Because he assumes the bad guys have fled??? And decides that he's just going to go back home and get on with his normal life after thoroughly pissing off the guys who assassinated his friend and who just eluded capture??? The last sentence of this book is \"They shook hands and said goodbye, and Roy watched [Kyle] stride nonchalantly along Broad Street and disappear around a corner.\" I know that Grisham intended for this to be such a badass moment, but I felt like the unfinished continuance of that sentence should be \"where he was then shot.\" No one is that stupid. Kyle is a Yale graduate. A lawyer! Was terrified of these people a few chapters ago! It's like Grisham wrote up to page 415, had an aneurysm, and went back to finish it off without rereading.This book is not not terrible. But I can't give it the one star that it probably deserves. I laughed a lot. I craved pizza at the appropriate moments. It served its purpose. Bravo, John Grisham."}, {"userName": "Jeffrey", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/747648-jeffrey", "userReview": "This novel is not precisely a reworking of Grisham's famous first huge bestseller \"The Firm\", but some might jump to that conclusion because the setting is similar. If you recall, in The Firm, the partners were mobsters. In this novel, the firm in question is merely an oppressive giant New York law firm, probably no different in its treatment of first year associates than many of the giant white shoe firms in New York now. As an aside, Grisham is sure to throw in his usual barbs about the law practice, in this case having one of the more decent partners reveal to the young Kyle that he \"estimates his billing\", overcharges clients for meals and treats his young colleagues as chauffers, but these are only petty comments about the book.The real story in this novel is that an unscrupulous spy involved in industrial espionage has found a way to make Kyle, follow his orders. Kyle, the main character, is in his final year of law school at Yale. He is the son of a local lawyer (who as is typical is lauded by Grisham), and is the prestigious editor of the Yale Law Review. As a second year law student he worked for the giant New York law firm, which has offered him a job, but Kyle has no interest in this position as he intends to join a smaller firm where he can help people. However, he is approached by some men who appear to be agents of the FBI who want him to meet a Pittsburgh police officer Bennie, who they claim has a video showing that Kyle witnessed and/or participated in a rape on campus when he was a senior at his fraternity during his last year at college. Kyle sees the video which appears to be condemning.  Bennie, the fake cop, tells Kyle that if he does what Bennie wants, Kyle will not be indicted and the video will not be released. What Bennie wants is for Kyle to provide him with sensitive material that is being held as an exhibit in a pending law suit about a supersonic jet. He orders Kyle to back out of his planned next law job and take a job with the large New York law firm. Of course, Kyle, the underdog ingeniously plans out a way to escape this nefarious scheme. The ending is a little too pat for me, but the fun in this book is following Kyle's adventures in spydom, his life and the life of his fellow first year students and the hell that is a first year associates lot in a huge law firm.Except for the ending, this novel is not bad and frankly is a lot better than his baseball novel set in Italy."}, {"userName": "Fred", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/22594333-fred", "userReview": "NYT #1 list - Sept 15, 2009 http://www.hawes.com/2009/2009-02-15.pdf** Reread 2013 - I had no review from 2009*Kyle McAvoy, graduates Yale Law with honors, the Yale Law Review editor, ready for his dream to be a public interest moral & ethic lawyer. Unfortunately, he meets Bennie Wright with a Yale Beta Fraternity \"party\" video with a girl \"Elaine Keenan\". He is blackmailed to work for one of the largest prestigious NY law firms - Scully & Persening. The \"party\" video of Kyle, Baxtor Tate, Alan Strock & Joey Bernardo were the 4 Brothers with Elaine. Kyle sends Joey (stockbroker) to find what she wants?Kyle does not like S&P, great bar exam help, start at $200,000 per year, spying on his life with a FirmFone & \"bugged\" apartment - firm's unethical apprentice demands getting client business information. Is Kyle risking being disbarred & going to jail?Who is Bennie Wright really working for? Kyle created a \"BlueBox\" with confidential client copies as requested. A set-up by NY FBI (Mario Delano) & US Justice (Drew Wingate) fails to capture Bennie, but will he return to kill him? Can Roy Benedict (criminal defense lawyer) prevent Kyle to be fired by S&P and disbarred for stolen property...... His clients included - Placid Motgage, Baxter Tate & Trylon Aeronautics.After dust settles, his dream is back to be a \"public interest moral & ethic lawyer\" in a new firm, McAvoy & McAvoy (his dad, John McAvoy in Pennsylvania). Dale Armstrong, S&P apprentice, also quits, still in love, she promises to meet in the near future."}, {"userName": "Stuart Fujisaki", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/16214252-stuart-fujisaki", "userReview": "I grabbed this book off the shelf after coming across a blurb regarding this story’s protagonist. It said something like, “if you thought Mitchell McDeere had problems in The Firm, wait ‘til you see what happens to Kyle McAvoy in The Associate. “ What a crock of….. well, you know what.I love The Firm - the book, that is – the movie was stupid. I return to it every two to three years. Somebody obviously grabbed me with the right hook to pick up this new Grisham story, but it sorely disappointed me. It turned out to be another example of lazy mega-successful author syndrome. They return to a successful formula, change a few names and situations, then leave out the guts of what made their earlier works so wonderful and figure you’ll never notice. This story had potential, so I kept reading. But somewhere around half way, I began to realize how this would eventually end up. Grisham started on a straight line and never veered off it all the way to the finish line, no twists, no turns, no satisfaction. Other than the story’s hero, the characters totally lacked depth as well as any kind of purpose for existing. I didn’t care about any of them. Grisham totally copped out on providing any kind of satisfying conclusion to the reader. He set up this whole situation then just dropped the ball like we wouldn’t really care that nothing happened and nothing got resolved. John Grisham, you’re better than this!"}, {"userName": "Seth", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/1431227-seth", "userReview": "Every couple of years, I like to remind myself why I stopped reading his books. And this one was a really good reminder.I was a big fan back in the nineties, when he first came out. I read all the books, watched most of the movies. But the stuff he writes now is so. . . different. In the last couple of books of his I've read, it seems like when the time comes for the crap to hit the fan, he just flushes the crap instead. Sure, it's nice and clean, but not nearly as exciting. Nowadays, he seems far more interested in preaching his ideals on the legal profession than in writing actual thrillers.The Associate is Kyle McAvoy. A different name, but basically the same character that stars in every Grisham novel. A wet-behind-the-ears kid, fresh out of law school, who has to take on the world and figure out how to outsmart everyone. He's Mitch McDeere, he's Darby Shaw, he's Rudy Baylor. Kyle is just finishing up law school at Yale and is planning to work for a public-interest firm after graduation when a bad guy surfaces with a video, secretly taken by a cell phone, which reveals the bawdy details of a drunken frat party five years earlier. The video contains evidence that a couple of Kyle's buddies had relations with a girl who may have been unconcious at the time. Although the video contains no evidence than Kyle did anything worse than dancing in the nude, he's shaken that the evidence exists.The bad guy offers Kyle a deal. In exchange for keeping the video and the potential rape allegation under wraps, Kyle must accept a position in New York City with the largest law firm in the world and steal documents related to a gigantic lawsuit between two defense contractors. High-stakes blackmail!The first few pages of this book are great, and I admit that I was immediately sucked into the plot. The pace slows as the book progresses. The bad guys patiently wait for the chance to have Kyle make a move. Meanwhile, Kyle spends most of his time trying to figure out how to outsmart them while also being the hardest working first-year associate at the firm. I don't know that the bad guys were actually super hard to outsmart. They actually seemed a little lame to me. When Kyle started his job, they demanded a look at his company-issued laptop and phone. He refused to do so, and they never bothered him about it again. Seems like pretty lame surveillance to me.***SPOILER ALERT (IF YOU CARE)***Somehow, Kyle manages to hire a lawyer, who notifies the FBI. They organize an operation to catch the bad guy when Kyle brings stolen files to him. But the bad guy somehow gets wind of it and disappears. And that's it. They don't catch him. So, who was this bad guy? Who was he working for? Why did they want the files? Where did he get the cell phone video? How did he know the FBI was coming for him? NONE of these questions get answered. Grisham suggests a bunch of possibilities, but I guess decides to let the reader ponder them eternally. It seems like maybe he wrote himself into a corner and said, \"Ah, screw it, I can't figure this out either. The end.\"***END OF SPOILER ALERT (IF YOU CARE)***I'm not the only one who feels this way. Many other readers are furious about this one. They can't figure out why he would just decide not to write the end of the book. There won't be a sequel, because who would buy it? Most people seem to think that Grisham is so rich he doesn't really care about pleasing the reader anymore. Others are speculating that The Associate was (gasp) ghostwritten.I'm glad that I checked this out at the library. Some folks actually paid full cover price to read it."}, {"userName": "Oliver", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/10214795-oliver", "userReview": "This one's ok. I'm pretty sure, however, that Grisham has a lot of much better things to offer in his more popular books. The thing that puts me off about this one is that things only stir up late (only until the start of the book's last quarter, I think). Before that, it's like he's just slowly making a big mound of anything; and you see, that's the part that's a little too boring."}, {"userName": "Jim", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/1007827-jim", "userReview": "As usual with Grisham, I can't put a book down for very long until I've picked it up again. I would hope that there might be a follow-up to this one so I can learn about what happens to the \"bad guys\"."}, {"userName": "Annie", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/29867780-annie", "userReview": "For a fair amount of this book, this had the feel of an earlier Grisham, The Firm, where the main character, a lawyer, is in a lot of trouble and there seems to be no way out without severe consequences. The ending, though, did not have that same satisfying feel of a really good wrap up with all of the threads. I was thinking toward the end, How is Grisham going to wrap this up so quickly since there isn't much left. I found out that he just decided to leave some things hanging, which I really dislike. I think that he could have done so much more with this."}, {"userName": "Stephanie", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/2940618-stephanie", "userReview": "Any Grisham book is always a solid read. This one was no different although I took major offense to how the author (and protagonist) handled the rape of Elaine. This is the reason I'm giving this book one star.I was having some serious issues with this as Grisham compares the case of college co-ed Elaine - who was in a compromising situation with our protagonist Kyle and his friends - to the heavily publicized Duke lacrosse case. Both cases were dropped, however, in the Duke scenario the plantiff was a stripper with absolutely no shred of evidence at all. In \"The Associate\" a video surfaces of Kyle's friends Joey and the troubled Baxter having sex with a girl who is so unresponsive Joey even has to ask \"Is she awake?\". I can't speak for anyone in the Duke lacrosse case, obviously, but Kyle's struggle with what he witnessed on the video clearly troubles him. But not enough so to face the music - after all, the video could potentially ruin the lives of the rapists, who in this case are his friends! She was a girl that liked to party, thinks Kyle. A major slut, says Joey, Elaine WANTED it. Oh! Then that makes it ok! The probably unconscious Elaine was begging for it, so it couldn't have been rape. And Joey has a baby on the way and a wedding to plan, going on trial for rape would be a MAJOR inconvenience. So Kyle and his buddies plot the best way to keep Elaine quiet while trying to appease the extortionists who own the video (and Kyle's future) - but Baxter still ends up dead. Awesome. And in the end, the slutty girl gets paid off to stay quiet and Kyle rides off into the sunset - on witness protection. For all the build-up and the potential this book had, I wasn't thrilled with how this one ended. Sorry, Mr. Grisham."}, {"userName": "Brittany Jedrzejewski", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/3644418-brittany-jedrzejewski", "userReview": "“It’s Criminal!” I am a positive person and I feel bad about putting negativity out there, especially in a book review. I must say, however, that The Associate by John Grisham was a terrible book. I hadn’t read anything by Grisham since The Firm and The Pelican Brief while in high school. At the time, they seemed like somewhat smart novels. I came across The Associate at Half Price Books and thought “why not?” Boy, has time changed the author—and not for the better. My mom put it best, “he has a formula to his books.” Meaning, he doesn’t put much thought into the books other than to get them on the bookshelves as quickly as possible. Do lawyers even read these books or find them even mildly entertaining?In the book, a hotshot law student has two great job offers and a bright future, but a blackmailing expert team has found a skeleton in his closet and exploits it to the fullest in order to obtain highly confidential information. Only in the last 50 or so pages does the law student finally realize that he should just come clean and face the issue. Wouldn’t a Yale law student know how to resolve the situation without having to work with the blackmailers? I have absolutely no law background, but I saw no evidence to even convict him!Character development was poor and the book was loaded with cliché after cliché and stereotypes (i.e. the hot law student who dressed really great and showed off her perfect body to the enjoyment of her male colleagues). The ending was horrifically lazy and unfinished. Looking at the bright side, I hope this review saved you a worthless read."}, {"userName": "Denise", "userReviewDate": "Aug 17, 2016", "userURL": "http://www.goodreads.com/user/show/4877957-denise", "userReview": "Law student Kyle McAvoy is in a bit of trouble: Some shady characters have got hold of a secret from his past that could drag him to court and get him thrown in jail. He feels he has no choice but to go along with their demands: Take a job at one of the biggest law firms in the world and spy, steal and generally do a bunch of things that could get him thrown in jail on behalf of his blackmailers.I always forget that with Grisham the blurb tends to be a lot more thrilling than the actual book, potentially due to his extremely dry writing style that doesn't really let me connect with the characters at all. Apart from that, I really had a problem with the whole rape story (\"Alleged\" rape?! Nothing alleged about it, buddy, the girl was unconscious!!) and the way these entitled little assholes were talking about it and attempting to justify their despicable behaviour with the good old \"But she had sex with us before, so clearly she wanted it, never mind that she'd passed out...\" bullshit. The whole thing just made me cringe every time it came up and left me with very little sympathy for poor baby Kyle and his jerk friends. 2.5/5"}, {"userName": "Carolyn", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/41629146-carolyn", "userReview": "I'm spending two weeks in a place on Sanibel Island stocked with Grisham books...that's the reason for three in a week. (I brought The Alienist by Caleb Carr but have found it's not very \"beachy\" and requires more concentration than my brain has at the moment.) This book, The Associate, was oh so lame - the weakest premise, an insufferable protagonist who is smarter (at age 25 when everyone is still a bit of a moron...everyone except voice-of-reason Kyle) than EVERYONE around him - smarter than seasoned Ivy League lawyers, clandestine international operatives, feds: all no match for Kyle. No one is as clever and brave and glib as Kyle. Oh, and handsome, of course. A bad book. A book that makes your eyes roll in disbelief/disgust at the waste of time involved in reading this tripe. And if you have any interest AT ALL in answers to questions, mysteries, the ENTIRE whodunit...forget it. Nothing. Nada. At all. Just an \"Oh, well....who knows?\"When Grisham is good, he's very entertaining but when he's bad, he's really really bad."}, {"userName": "Gerald Sinstadt", "userReviewDate": "Jan 01, 2010", "userURL": "http://www.goodreads.com/user/show/3095102-gerald-sinstadt", "userReview": "With a big early hurdle to surmount and an ending that beggar's belief, this is far from vintage Grisham. The page-turning lure works but it does so by cheating. The Associate simply has too many loose ends. Building suspense and a sense of menace is not difficult if many of the suspenseful and menacing elements don't have to be explained. When Kyle McAvoy, the eponymous Associate, is blackmailed in the opening pages over an incident in his past (not that he was actually guilty of anything) he decides not to consult his lawyer father because Dad would say, \"Why didn't you tell me earlier?\" Which is exactly what he does say when he is consulted near the end and Kyle has to be extricated somehow. Convenient though that may be, it leaves so many unanswered questions the reader may suspect that the author didn't begin with a worked-through story line but with nothing more demanding than a wordage target. Once that is achieved, he simply stops. If the author cheats, the reader is cheated. And that is the feeling that remains at the end of a very poor story."}, {"userName": "Wendy", "userReviewDate": "Jan 27, 2014", "userURL": "http://www.goodreads.com/user/show/4144382-wendy", "userReview": "This is the first legal thriller I have ever read. To be honest it did not really thrill me. It took for me to get to the middle of the book for things to start picking up. Even then I was still craving more action. I also feel if your going to use the name of a real town in your book then you should at least make an effort to do some fact checking. There is no Main St. in York, PA. Yes, I am from there. But hey,we appreciate the mention at least. I did not however, factor that in to how many stars I gave the book."}], "description": "Brillant étudiant, diplômé en droit à l'université de Yale, Kyle McAvoy offre également de son temps à une petite équipe de basket. Le gendre parfait. Mais voilà qu'un jour de match, un grain de sable vient gripper la machine. Ce grain de sable ? Une vidéo. Cinq ans auparavant, un soir de fête très arrosée, Kyle a assisté sans y participer à un viol collectif. La preuve qui manquait à la plaignante est là, sous ses yeux, prête à ressortir et dynamiter sa carrière débutante. Mais les possesseurs de la vidéo ont d'autres projets. Qu'il accepte ce poste chez Scully & Pershing, un très gros cabinet d'avocats, et la vidéo disparaîtra. La mort dans l'âme, Kyle accepte. Il sait qu'il lui faudra divulguer des informations à ces individus, très intéressés par une certaine affaire d'aéronautique militaire. Il sait aussi qu'il n'a pas le choix. Infiltré malgré lui, Kyle tente par tous les moyens d'échapper à l'emprise de ses maîtres chanteurs…", "title": "L'Infiltré", "url": "http://www.goodreads.com/book/show/10223916-l-infiltr", "average": 3.65, "cover": "https://images.gr-assets.com/books/1348873552l/10223916.jpg", "reviews": 3653, "authors": [{"url": "https://www.goodreads.com/author/show/721.John_Grisham", "name": "John Grisham"}, {"url": "https://www.goodreads.com/author/show/2066943.Johan_Fr_d_rik_Hel_Guedj", "name": "Johan-Frédérik Hel Guedj"}], "type": ["Fiction", "Thriller", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/10223916-l-infiltr", "http://www.goodreads.com/book/show/3613997-the-associate", "http://www.goodreads.com/book/show/6525289-the-associate", "http://www.goodreads.com/book/show/6121841-the-associate", "http://www.goodreads.com/book/show/6963973-the-associate", "http://www.goodreads.com/book/show/32542.A_Time_to_Kill", "http://www.goodreads.com/book/show/5358.The_Firm", "http://www.goodreads.com/book/show/5359.The_Client", "http://www.goodreads.com/book/show/32499.The_Pelican_Brief", "http://www.goodreads.com/book/show/24192.The_Runaway_Jury"]}