{"ratings": 72, "userreviews": [{"userName": "Dash fan ", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/61989809-dash-fan", "userReview": "5☆ Gripping, Exciting, Thrilling, gave me Chills!!.....  loved it!London Noir is the second book in the series but can easily be read as a standalone. I haven't read the first book but it didn't stop me from enjoying this one.London Noir had me gripped from the first few pages.It was a very fast paced Thriller that I literally couldn't put down!It was chilling, dark, a lil sinister, full of suspense, highly addictive, with all the added twists and Turns that kept me turning the pages till the early morning!Who is Sophie??When Kal knocks Sophie over in the pouring rain whilst on her way to the hospital. There is something endearing and haunting about Sophie. Who is she running away from in the rain and why??Kal drops Sophie off at a well known lady of the night area that is full of danger. But she just can't get Sophie out of her head! However Kal is about to discover Sophie has a dark past, nothing is as it seems, and why is it that everywhere Sophie goes it seems to equal murder and death!Who is Sophie??Kal isn't as innocent as she comes across, she too is hiding dark secrets!!With links to the underworld Cartel, it's hardly surprising she's a ruthless and very clever risk taker that will stop at nothing to help Sophie!!But how far will she go?? And to what risks??Kal's Best friend Marty has just come out of a coma and she is determined to protect Kal from Sophie. But is it a little too late?I absolutely adored Kal, Sophie and Marty.Such a fantastic dynamic between them.I loved Kal's strength and kick ass attitude. Sophie's uneasy and unnerving behaviour, yet somewhat childish and endearing.Marty's protective nature and the rational one.Ann does a fantastic job at weaving Kal's  inner most thoughts and training to get her out of situations. I literally felt like I was with Kal. Very Exciting!!I also loved how Ann gave the reader glimpses of the past and into the mind of a dark and very twisted/ sinister character.Who by the way I had absolutely no clue as to the identity of the mystery character was!Not one clue as to whether the person was male or female.... Brilliant!! I love being kept guessing!So exciting!!! I think London Noir is definitely one to watch out for. Strong female Lead Characters, a great story line that has exciting little twists and turns to keep you hooked, a dark thriller with a Physcological feel, it's jam packed full of action that will leave you wanting more.One thing to mention it does contain a few violent scenes which does tie into the genre and storyline. I highly recommend this book if you love Thrillers, Suspense, Crime, Chilling addictive reads! I received this book from the Publisher in exchange for a honest and fair review in which I voluntarily reviewed.Check out my Review on my blog website:https://dashfan81.blogspot.com/2017/1..."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "EXCERPT: I suppose the realization I was different stole up on me slowly. There were signs from early on, if I 'm honest. Like my first year in primary school when Mirabella wet her knickers in front of the whole class - the girls were mortified and the boys laughed and I was excited. So, yeah, I knew I was different. To survive, I learned to act like my friends and I 'm so good, pretty much everyone in my life would say I'm normal and I like that because it means I'm clever. One thing I've learned is that when you've wanted something for a long time, your mind makes tracks in the sand showing exactly how it's going to turn out. You anticipate your own excitement, your own arousal, and what the other person will say and do. Those tracks start out delicate and then solidify with each replaying of the fantasy, until they get to be as firm as a rail track. The fantasy can keep me occupied for months only, at some point, I have to have the real deal - the flash of horror in their eyes, the desperate urge to plead for mercy, bowels voiding and dribbling down a leg. It's the helplessness that grabs me - when they realize there's absolutely nothing they can do. It's the best drug in the world. And with me, it's the eyes that are captivating. The windows of the soul - unable to lie in the final moments. THE BLURB: Memory loss, nightmares, the urge to kill – Sophie has it all. Is it Post-Traumatic Stress Disorder? Or something more sinister? Kal is about to find out…After a near-fatal road accident, Kal helps a young girl in trouble. The girl’s friends are being murdered one by one. Why? And who by?Kal must kick start herself out of her downward spiral to save the young stranger.But Kal is in the grip of the London Cartel and is someone after the girl, or is the girl after someone?Crime suspense thriller. A stand alone novel. The second in the Kal Medi series. MY THOUGHTS: I hadn't read Kal Medi #1 before reading London Noir by Ann Girdharry. I think it would have helped, as there are numerous references to events that occurred in that first book that are not adequately explained, like what had happened to put Marty in hospital in a coma or why Kal was in the grip of the London Cartel. So I don't really recommend this as a stand alone book. But if you do read London Noir without reading Good Girl, Bad Girl, then chances are you will do what I am doing, and lay your hands on a copy of #1 anyway. Ann Girdharry had me hooked from the beginning. In fact at the 7% mark my comment was 'WOW!'. Of course, this frenetic pace could not be maintained although London Noir continued to be a fast paced book and a quick read. And while I didn't always find Kal's actions believable or at all rational, I was happy to suspend belief and just enjoy the read. 3.5 stars for London Noir by Ann Girdharry Thank you to author Ann Girdharry for providing me with a digital copy of London Noir for review. All opinions expressed in this review are entirely my own. Please refer to my Goodreads.com profile page or the 'about' page on sandysbookaday.wordpress.com for an explanation of my rating system. This review and others are also published on my blog sandysbookaday.wordpress.com"}, {"userName": "sue", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "3.5 for me.This book isn't to be read as a stand alone because without reading book one you will become confused and lost as there are many references to book 1.After reading book 1 some time ago I was happy to receive this book 2 to catch up with things.Its not a quick fast paced read. I did find some of things that Kat did or said a bit irrational at times but hey ho, shes a woman right.Nevertheless, as a rational woman myself it did leave me humfing at times.IMAGINEYou just hear that your best friend has woken from a coma, you want to rush off to the hospital, of course you do, [to find out how she got in that state, you need to read book 1] Kat runs to her car and begins driving, its wet weather and on route she almost runs over a young woman. This woman's name is Sophie.After finding our if shes OK, she is still worried about this stranger named Sophie and offers her a lift to her home.But, Sophie doesn't want to be dropped off at home, she wants to be dropped off at an undesirable red light district. That is where my high hopes dropped a bit as I didn't feel this realistic, well, not something I would have done, but you need to draw your own conclusions here.Then Kat later discovers there is a killer on the loose and the women he has killed are connected with Sophie, so now she is even more worried about her.Get ready for some tummy churning moments as the killers gory happenings are unfolded and described in horrific detail upon the pages.My personal thoughts are that some things were hard to believe, some things needed more pace and pitch and power. I didn't find it a page turner, I did find it a slow burner and not an edge of your seat thriller, and sometimes that's a good thing. The plot was a good one but the way Sophie was introduced and how Kat was so 'worried' about a stranger was so hard for me to understand fully.I enjoyed book 1 much better."}, {"userName": "Zoe", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/18237582-zoe", "userReview": "3.5 stars. Action-packed, suspenseful, and eerie!In this latest novel by Girdharry, London Noir, Kal Medi is back and not only struggling to recover from all the physical and psychological trauma she suffered on her last investigation but quickly caught up in the life of a troubled girl whose skeletons both past and present may be more harrowing than anyone expected.The writing style is descriptive and smooth. The plot is an incredibly twisty tale that delves into a world filled with deception, mental illness, obsession, manipulation, revenge, malice, violence, and murder.  And the characters are multi-layered, scarred, and somewhat impetuous.London Noir is the second book in the Kal Medi series and even though I felt the main character's motivations were a little hard to grasp at times and it wasn't quite as dark and gritty as the first novel it is still a very entertaining, enjoyable thriller that highlights Girdharry's extraordinary knowledge of the human psyche.Thank you to Ann Girdharry for providing me with a copy in exchange for an honest review.All my reviews can be found on my blog at https://whatsbetterthanbooks.com"}, {"userName": "Sean Peters", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/14058345-sean-peters", "userReview": "I purchased this book to read this book for a Read A long with my group for the month of November.Firstly I think it is best to mention it can be read as a stand alone, but I feel it is best to read the first book, sadly I did not and I think it would have made this book better.Memory loss, nightmares, the urge to kill – Sophie has it all. Is it Post-Traumatic Stress Disorder? Or something more sinister? Kal is about to find out… After a near-fatal road accident, Kal helps a young girl in trouble. The girl’s friends are being murdered one by one. Why? And who by? Kal must kick start herself out of her downward spiral to save the young stranger.But Kal is in the grip of the London Cartel and is someone after the girl, or is the girl after someone? Crime, with a dark, psychological twist. Kal Medi is back and not only struggling to recover from all the physical and psychological trauma she suffered on her last investigation but quickly caught up in the life of a troubled girl Sophie whose skeletons both past and present may be more harrowing than anyone expected.A slow burning crime thriller that does have three great characters in Kal, Marty and Sophie but for me was a little slow especially around the middle of the book, finished off with a good pace with the last two chapters.The main problem I had was why?Why would you just help a young girl you do not know?Although I enjoyed the main characters, just the pace of the book."}, {"userName": "Emma", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/64860542-emma", "userReview": "A gripping tale with just a few niggles - 4*I really really like the characters in this book. Maybe enjoy is a better word as I am pretty sure I don't want to be friends with many of them. But they are such wonderful, interesting creations I could not put the book down. the actual story is a bit weak in comparison but it was enjoyable enough. I really look forward to another installment."}, {"userName": "Vicki Willis", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/32195771-vicki-willis", "userReview": "This was a well written action packed thriller. It was the second in a series about a kick ass woman named Kal. I read it as a stand alone and though it started and finished a complete storyline I think background on the characters from the first book would have enhanced it. I loved how the author made such strong, smart, likable women main characters. The plot was also good with some tense twists to it. The ending wrapped up the story, but I can see that these characters and some of the minor ones will be up for more adventures when the author writes the next installment of the series. This was the first time I have read this author and I would definitely read her again."}, {"userName": "Theresa (TBC) (TT&B)", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/35884137-theresa-tbc-tt-b", "userReview": "I had really enjoyed the 1st book in the series with Kal. I was happy to see a 2nd from Ann Girdharry and couldn’t wait to see what Kal would get up to this time. She helps out a young girl called Sophie who has a lot going on in her past & present life. This story leads us into what happens after she helps out & what builds between them. Kal is a complicated girl but likeable & straight forward. Hopefully there will be more books with her in & we can see how she grows & learns from herself."}, {"userName": "Emma Yarnell", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/66002420-emma-yarnell", "userReview": "Well that was a twist I didn’t see coming and there was me thinking I’d got it all figured out! Don’t worry, no spoilers here!I love a good thriller and I really enjoy getting into the nitty gritty of the characters. I enjoyed the pace and rhythm of the book. I especially loved the fact I could pick it up and put it down without losing the flow and it was great to read a couple of chapters at a time in between a really hectic and chaotic couple of weeks. I was a little unsure to start with about the jumping around between points of view, but then as I read on I realised it added to the intrigue and it drew me in further. I read this after reading Good Girl Bad Girl (the first Kal Medi novel) and I do believe that this book would stand alone as a great read even if I hadn’t. I do love the way the characters evolved over the two books and how Ann write the complexities of the relationships between them. I thoroughly enjoy it when I become emotionally invested in a character and I find myself at the end of the book having been on a huge rollercoaster of emotions and unexpected reactions to a few of the characters in the book. A thoroughly good read that makes me wish that book #3 was already available. Huge thanks to Ann Girdharry, her publishers and TBC on FB for the opportunity to review this book."}, {"userName": "Ellie Shepherd", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/38825430-ellie-shepherd", "userReview": "This was a really well set out book and I really bonded with Kal and Marty. I couldn't work out who the killer was and I was surprised. Well written and grabs your attention. Highly recommended."}, {"userName": "John Nicholl", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/32341954-john-nicholl", "userReview": "I really enjoyed this one. very entertaining."}, {"userName": "Bridget McKeown", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/51869661-bridget-mckeown", "userReview": "Great 2nd novel featuring Kal Medi and I look forward to reading more. Although this is the second one I feel it could be read as a stand alone as enough of the first one (though not to much as to be repetitive) is interspersed throughout it to make sense. Thanks to TBC"}, {"userName": "Carol Lance", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/45969128-carol-lance", "userReview": "The rain is pouring down, the roads are slick....Kal is rushing to the hospital to see her friend Marty who has come out of her coma, when....Sophie appears on the road in front of Kal, is it too late to stop before she runs her over?The story revolves around these three main characters, Kal, whose father has trained her well, Marty who also has a father that she is trying not to live up to and Sophie who lost her parents at a very young age and has been in and out of a mental health centre all her life.This is the 2nd Kal Medi book and does not fail to keep you guessing, it is full of suspense and you will want to keep reading until you find the truth.Thank you Ann Gridharry for sending me a copy of your newest thriller for an honest review."}, {"userName": "Chandra Claypool (wherethereadergrows)", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/9722719-chandra-claypool-wherethereadergrows", "userReview": "As a second in a series book, I wish I had followed my normal rule of reading series in order.  I seem to be veering from this rule a lot lately and finding myself frustrated in the process.  There were definitely moments where I felt reading the first in the series, Good Girl Bad Girl, would've helped answered some questions that weren't answered in this book.  How exactly did Marty end up in the hospital?  How did Kal end up so \"different\" and part of the London cartel?  While I applaud the author for not wasting numerous pages reflecting on these as I typically don't like that when I read a series in order... it would've been helpful here since I broke my own rule - again, my own fault!  It didn't take away too much away from my reading of this one but I would suggest that if you want to pick this thriller up, that you start with the first book.During the first few chapters I was a bit confused of Kal's motivation.  Why would she go out of her way to put herself in danger to help Sophie?  She barely knew her and did the good deed by taking her where she wanted to go - regardless if it wasn't the \"safest\" of places.  Her instant reaction to putting herself in danger numerous times for not so reasonable reasons kept me scratching my head.  Once I decided to just suspend that part of it, I became engaged in the story.  This book is action packed, suspenseful and fast paced. All things I love in a good thriller.  The writing was easy to read though I did feel sometimes the dialogue became a bit stunted and lacked in consistency.  \"I like you.\"  \"I like you too.\"  However, I will say that it did read easier as the story progressed.One thing I do love is that you can tell the author used her experience as a psychotherapist throughout the novel.  It was apparent in how Sophie was portrayed, reactions to medications and how a clinic was well represented.  I can fully appreciate everything she did with all of these things.Overall a great thriller - I may need to get book one to get more knowledge on the background of some of the characters which I think will make things make a tad more sense with the main character, Kal, and why she did things the way that she did.  3 1/2 stars - rounding to 4 for GR."}, {"userName": "Kath Middleton", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/5844564-kath-middleton", "userReview": "Kal Medi is still influenced by her father’s activities. She takes a young girl under her wing after almost knocking her down in a rain storm. The girl, Sophie is heading for a place Kal knows to be a brothel, and she’s worried about her. Things, in the event, are worse than Kal expected. Kal becomes involved in a seedy underworld with a girl who has spent much of her life in a psychiatric institution. Her best friend, Marty, just out of hospital, also volunteers to help, and the pace picks up. I found this a very exciting story, and became involved from the beginning. It’s the second Kal Medi story, and I found it even better than the first. I hope it’s the beginning of a longer series.I received an advance review copy of this book."}, {"userName": "Dawn", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/12435851-dawn", "userReview": "After nearly knocking young Sophie over, Kal offers to take her home. When she wants to be dropped of at a red light district Kal's worried and decides to go back to find her.That's when things start to hot up. Is Sophie as vulnerable as she first appears? Some of her friends are being murdered in a brutal way. Who's responsible? Is Sophie at risk or behind them? Kal uses all her skills and does everything in her power to help her and find out what's really going on, putting both herself and others at risk. I loved the way you get to find out the killers thoughts and why they think they are justified in killing.This thriller certainly has plenty of action from start to finish, I have no hesitation in recommending it and it gets a full five stars from meI received a copy of this book from the author in exchange for my honest and unbiased review"}, {"userName": "Donna Maguire", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/7997643-donna-maguire", "userReview": "https://donnasbookblog.wordpress.com/...I was given the opportunity to read this book in exchange for an honest review and I am so glad that I took the author up on the offer!!  The book was a really good read, it flowed well and I enjoyed the characters and the plot, it was really tense and full of suspense at times and I thought it was a great crime thriller – I don’t want to give out any spoilers so will just say I definitely do recommend this one and I gave it 4 stars – I really enjoyed the ending – did not see that coming!!"}, {"userName": "Fiona", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/5714225-fiona", "userReview": "Having read and really enjoyed Good Girl, Bad Girl, I was delighted to receive an ARC of this second in the series and looked forward to reading it. Whilst on her way to visiting Marty in hospital, Kal almost runs over a young girl in the street. Something about Sophie draws Kal to her, she recognises a vulnerability and feels compelled to help her. Her efforts result her being drawn into a mystery, murders and danger. This book is, again, well written and we are taken on fast, eventful journey as Kal tries to unravel the mystery surrounding Sophie. I wanted to know what happened but didn't enjoy this sequel as much as the first book. I found Kal reckless to the point of finding her a bit irritating and she wasn't quite so believable this time round. I kept asking myself why she would have done x when she put herself and others in danger because she had misjudged the situation. For someone who is supposed to an expert at reading people she got it wrong time and again. I also missed two key characters from the first book, Marty and LeeMing in particular, who only had relatively small parts in this book. That said, there is plenty of suspense to keep you reading. My thanks to TBConFB, the publishers and Ann Girdharry for this copy."}, {"userName": "Rebecca Mello", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/46469594-rebecca-mello", "userReview": "Disclaimer: I received this book for free in return for an honest review.This book picks up shortly after the events in \"Good Girl Bad Girl\". While rushing to see Marty in the hospital Kal almost hits a young girl with her car. Something about Sophie draws Kal in and Kal knows she needs to help her. But who is Sophie running from? Does the murder of Sophie's parents have anything to do with the murders today? And does Sophie belong in that mental health clinic? Kal must answer all these questions and protect Sophie all while dealing with the London Cartel.Overall I really enjoyed this book. It sucked me in within the first few pages. I could not put this book down. While you do not need to read the first book to understand the plot of this one I would still recommend it. This book is perfect for mystery and thriller lovers."}, {"userName": "Jo", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/41007893-jo", "userReview": "I thoroughly enjoyed this, the second in the series. It took me a while to remember the detail from the first part, but I didn't feel it mattered. If you could just see the friend in a coma it didn't matter how she got there. The story rocketed along and I found myself picking it up as soon as I could. The characters were well developed and the story line was enough to keep me in suspense. Recommended!"}, {"userName": "Kaz", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/56036284-kaz", "userReview": "London Noir is the 2nd book in the Kal Medi series. I really recommend reading the first book to fully enjoy the plot line and references pertaining to certain characters. Well Ann Girdharry has another winner here, London Noir is a fast paced thriller that had me totally intrigued as to just where the author was going to take Kal this time, as if she doesn’t have enough problems of her own, she meets Sophie, who seems to have more issues than Pandora’s box, and if that’s not enough, her friends are being killed off one by one..Kal is drawn in deeper as she tries to help Sophie, but is Sophie as innocent as she appears to be?, well, this question kept the tension high and threw in a few surprises on the way....to an absolute stunner of an ending. Highly recommended."}, {"userName": "Meggy", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/50986914-meggy", "userReview": "Kal Medi is back, but the events of the first book have taken a tool on her and she is having issues finding herself again after such traumatic events. Who wouldn’t?\n\nWhat they left behind was a different Kal.\n\nI’d say lost rather than different. Everything that made her who she was, either psychologically or physically, has been shaken and I felt there was a hole Kal was trying to fill. It’s the reason why I decided to buy the “take any danger for a stranger you just met” decisions. Because I was used to the calculating, strong and lonely spirit of the old Kal and because I would never put myself in the place our main character decides to go so early in the story! I needed a reason to make sense of her weird behavior, so I blamed it all on the shock of what had happened to help me find some realism. I can say it’s the niggle I had throughout the story. Even though the action flows smoothly, I couldn’t fathom the reasons why we had been brought to this from the start. But I’m well placed to know psychological scars make you do things that don’t sound like you, so I went on with it.\n\nSince when is a friend someone you can’t trust?\n\nSophie is a very special character. Everything around her is blurry, her story only snippets of a life you can’t grasp, and it kept me on my toes the entire time. Her dependency on Kal was unsettling, as if something was wrong. You know, when you walk and there’s a little pebble in your shoe, but you keep on going? That was my feeling with Sophie. The more Kal unearthed information about the young girl, the less I trusted her, but instead of creating tension, the same pattern of not knowing left me cold for the poor girl, and wondering what the hell was happening with Kal. I wanted answers, but I did not feel a real rush of urgency or danger.\n\nWhere you find emotion, you glean information, and the stronger the emotions, the more suppressed messages seep through the cracks.\n\nThe story delve into something I find extremely fascinating and scary. Mental issues, a constant dread of not being able to trust your own thoughts, and how to live with it. The author sheds light on the scars traumas can leave behind them, how deep they can run, and how some people learn how to play with it. This side of the story was exceptionally well-written, and my favorite part about the book! Kal has to face what she is, what she wants to be, and make decisions she’s been postponing for too long. I enjoyed the thread that linked the first book to the second.On top of a stranger to save, Kal has to pay a debt. We do like our characters to be busy, right? I appreciated the fact Kal struggled with herself, her emotions, and her actions during London Noir, the confidence that could make her come off as cocky showing signs of weaknesses, allowing me to get a little closer to the character. Every aspect of the psychological state of every character is explored, and this is what makes the series special.I was happy the secondary characters weren’t forgotten, banished to the never-to-be-heard-again prison! Marty is definitely my favorite character, and Kal’s best asset! I won’t spoil anything but sometimes, it’s hard to have such a dark and complicated best friend!!!\nOverall, London Noir combines a trip into the human mind to self-discovery with a sharp and clinical writing, through action and blood, throwing one question after another to the reader!"}, {"userName": "Kaisha (The Writing Garnet)", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/40776578-kaisha-the-writing-garnet", "userReview": "All reviews can be found on my blog at https://thewritinggarnet.wordpress.comHaving read the first book in the Kal Medi series a while ago, I was a bit concerned that I wouldn’t be able to follow all of the events in the latest book. I needn’t have worried however, as despite ‘London Noir’ being part of a series, the storyline was written so that it could be read as a standalone perfectly fine. You don’t HAVE to read the first book in the series as it does read fine on its own. However, I think that to understand Kal’s personality one hundred percent, as well as being able understand hers and Marty’s friendship better, I would advise you read ‘Good Girl Bad Girl’ first.Let’s get straight to the point – I was absolutely gripped by the latest Kal Medi instalment! So much so I was able to read the book with no interruptions in 2.5 hours. It’s safe to say that I didn’t put the book down! If you’ve read Ann Girdharry’s books, you’ll no doubt agree that once you pop, you just can’t stop. It certainly was the case where this book was concerned, that’s for sure!It was interesting to see a different side to Kal as in the previous book emotion didn’t seemed to be part of her vocabulary, yet in this book she seemed to think with her heart – much to Marty’s concern! The only real irk i had about this book was the situation with Raphael. I could understand the need for it in the storyline as a distraction, but I couldn’t seem to work out the point of Raphael being part of the storyline overall. Personally, I felt that everything would have still worked if that part was no longer included in the story. I really couldn’t see the point. It felt as though Raphael was just there to fill up some word space. Don’t get me wrong, his character annoyed me something chronic and I understood the need for debt repayment but apart from that…I enjoyed the thrill and suspenseful nature of the storyline, it did keep me guessing and when the loose ends started to get tied up, i had several ‘ooooohhh yeah!!’ moments. Up until that moment, however, I couldn’t pinpoint ‘whodunnit’ if it stared me in the face. Well….it did kinda, didn’t it!In all honesty, I found ‘Good Girl Bad Girl’ to be a lot more gut wrenchingly intense than this book, however, I still thoroughly enjoyed ‘London Noir’ and I would recommend this book and the entire series in a heartbeat.Thanks Rararesources."}, {"userName": "Abbie", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/50638987-abbie", "userReview": "London Noir is the second book in Girdharry’s Kal Medi series, following on from Good Girl Bad Girl which was published last year. While London Noir does work as a standalone, it is better to have read Good Girl Bad Girl firstly because you will get more of a sense of Kal’s history and secondly because it’s a cracking read.When Kal is involved in a road traffic accident with a young woman called Sophie she is immediately drawn to her … and subsequently drawn into Sophie’s dangerous life. Sophie’s friends are being killed and Kal helps her to find out who is responsible and why.I really liked the character of Kal in the first book and knew this would be a protagonist I wanted to follow. She is a kick-arse, gutsy, intelligent photo-journalist with an interesting background, thanks in part to her father who her taught her all about understanding body language and how to read and manipulate people. In this second book we see a softer and more vulnerable side to Kal. This makes me like her even more and there is plenty of scope for Girdharry to continue with this character and I look forward to seeing how Kal develops as the series progresses. London Noir draws you in immediately with a first chapter that captures your attention and leaves you wanting to know more. From there the pace gradually gains momentum and you become completely gripped. The plot is fast-moving and keeps the reader of their toes with twists and turns galore making London Noir a thrilling ride. The killer in London Noir may well be the most evil, chilling antagonist I have come across this year! Punctuated with chapters in which the killer narrates in first person, Girdharry ensures that the reader’s attention is maintained throughout. I loved getting an insight into what makes the killer tick but bloomin’ heck it sent shivers down my spine as it is as creepy as hell!What I really like about this series is the use of psychology and body language that Girdharry incorporates. This adds an additional layer and there is an intelligence in Girdharry’s books that make them stand apart from other crime thrillers.If you haven’t yet checked out the Kal Medi series yet I strongly suggest you do. Current, unnerving, well cast and plotted, London Noir is a must for crime fiction fans."}, {"userName": "Chris Nolan", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/49125698-chris-nolan", "userReview": "I am very grateful to the author for letting me have an advance copy of London Noir; it is the follow-up to the first Kal Medi novel but I read it as a stand-alone. Kal and her friend Marty work together to solve crimes, Kal sometimes employing questionable methods while Marty is rather more conventional. At the start of this book Marty has been in a coma for months and is now awake, and as Kal rushes to the hospital she almost collides with Sophie, a troubled young woman who divides her time between a mental institution and a brothel. Her parents are dead and her half-brother is trying to locate her. Kal is determined to unravel the mysteries of Sophie's life while also dealing with questions over her own parents. I would like to have started at the beginning and shall now go back to fill in gaps. A very enjoyable read!"}, {"userName": "Kate", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/44068050-kate", "userReview": "Can you remember a book you read last August? I can, it was Good Girl Bad Girl. This was the prequel to London Noir which features Kal Medi, a photo journalist turned sleuth as she tried to track down her mother who had gone missing. For the full picture I would recommend reading the books in order, and it gives a great insight into Kal as a character.I want to avoid speaking about the plot too much, the usual fear of spoilers and giving anything too juicy away but I will say that this book features one of the most chilling serial killers I’ve read about in a long time. Girdharry paints a stunning picture of a killer who can charm and beguile, is clever but also can kill without remorse. The narration from the perspective of the killer is absolutely chilling and really had me creeped out at times.Kal has also changed between the books, perhaps the events from the previous book have taken their toll on her, but she comes across as less sure of herself, she’s wounded from fights and has witnessed things that have left scars mentally. This in turn makes her a little easier for readers to connect with, almost as if it takes her being vulnerable so that readers can empathise with her. In spite of all of this, she has lost none of her intelligence and inquisitive mind, which makes for fascinating and enjoyable reading.The author’s knowledge and experience in the field of psychology shines through in her writing, the details given on the topics of post traumatic stress disorder and the psychopath give this a credibility as well as being interesting reading. Ann Girdharry knows how to write a fast paced thriller with plenty of action that has readers racing through the chapters, and she has certainly pulled out all the stops with London Noir. A side note, some readers of a nervous disposition might feel a wee bit uncomfortable with the descriptions of some of the injuries suffered by the victims in this book, they’re not overly graphic but I reckon it’s only fair to let you have a heads up.An excellent follow up to Good Girl Bad Girl and I look forward to seeing what Ann writes next!"}, {"userName": "Freda Mans-Labianca", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/2967441-freda-mans-labianca", "userReview": "Closure for the first book.All the things that you felt left hung in Good Girl Bad Girl were answered and put to rest in this book. I did love that, and the new plot too, as well as feeling it's complete.If Kal Medi is in a third book, it would HAVE to be a new plot, story and everything. No questions were left raised in book 2.It was more exciting for me, and that is rare for a second book to better than the first. I feel that was as this story had a beginning, middle and end, where the first book wasn't like that at all.Really good stuff together though!! I know many of you will enjoy reading about Kal Medi and all that she gets herself into."}, {"userName": "Kelly (purplebookstand)", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/12145523-kelly-purplebookstand", "userReview": "London NoirHaving read the first book in the Kal Medi series, I was eager to get my hands on the next instalment! It’s important to note that although this is part of a series, it can be read as a standalone but I would recommend you read Good Girl, Bad Girl first to get some background information. London Noir joins Kal as she has become determined to help a young girl who she met completely by chance when she nearly knocked her down. Kal becomes increasingly concerned about Sophie but the more she finds out, the more she is confused, is Sophie the hunter, or the hunted?This is another cracking read from Ann Girdharry that had me gripped from start to finish. It’s a fast paced thriller that is full of tension and suspense. I really couldn’t put this book down, I was so engrossed that I finished the book and then saw it was gone 3am and I hadn’t even realised! I really enjoyed London Noir and I’ll now eagerly anticipate book three in this fab series. (No pressure Ms Girdharry!) Five stars from purplebookstand. I was lucky to be provided with an advanced copy of this book and voluntarily reviewed it."}, {"userName": "Susan Angela Wallace ", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/41727319-susan-angela-wallace", "userReview": "London noir (kal medi) by Ann Girdharry.Memory loss, nightmares, the urge to kill – Sophie has it all. Is it Post-Traumatic Stress Disorder? Or something more sinister? Kal is about to find out…A absolutely fantastic read. Love kal and Marty. Wasn't sure on sophie or sugar g. Really stumped at who the killer could be and I was shocked with who it was. 5* for sure. Highly recommended. Tbc on fb."}, {"userName": "Dee-Cee  It's all about the books", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/13890398-dee-cee-it-s-all-about-the-books", "userReview": "London noir is the second book in the Kal Medi series, Good Girl, Bad Girl being the first. Sadly I haven’t read the first so I did feel a little lost at some points through London Noir but it didn’t spoil the enjoyment of the book, if anything it made me more eager to read the first and find out what happened.Kal is in her car rushing to get to the hospital to see her friend Marty when she nearly collides with a young girl. After making sure Sophie is ok and dropping her at an undesirable part of the city, Kal can’t help worrying about Sophie and decides to try to track her down. This is when the mystery begins and we find there’s a killer on the loose.Kal was a really interesting character, her ability to read people fascinated me. She’s a tough cookie but also has a vulnerable side to her which made her feel quite realistic. Sophie was a great character too, having been sent to an institution by her step-brother after her parents were murdered, she spends her time either there on at the brothel where she feels safe . That is until Lady Penelope is murdered in a very gruesome way. This was a really interesting read, it’s gruesome in parts but it really had me turning the pages. I was desperately trying to guess who the killer was, but failed miserably. With a fantastic plot that had my heart racing and great characters, I thoroughly enjoyed London noir and I can’t wait to go and read book one and hopefully the series will continue for a long time to come. I definitely recommend London Noir for fans of crime fiction, this is a fantastic read."}], "description": "A vicious serial killer has struck again.And the killer’s identity rests in the memories of a traumatised young girl…When Kal runs into Sophie, a desperate young girl, she sets out to help her.Sophie’s mother was murdered when she was a child and she can’t remember a thing about it.Then Sophie’s prostitute friend is killed.And a young girl is murdered.All because Sophie’s memories from fifteen years ago are starting to return…Kal wants to become an informant for DI Spinks to make up for her father’s crimes.She goes undercover to track the twisted killer who’s been preying on vulnerable women - and got away with it - for decades.Sophie holds the key.But can they keep Sophie safe from a vicious murderer hiding in plain sight?A clever killer who’s one of the last people anyone would suspect…The creepiest killer you'll meet this year.Grab your copy today.Praise for London Noir (Kal Medi Book 2)'An absolutely fantastic read.'​'Highly recommended.' Ellie S​'The characters are outstanding'​'A thoroughly good read that makes me wish book three was already available...'​'Wow!''Had me hooked from the beginning...' SandyJ21​'Well that was a twist I didn't see coming...' Goodreads, Emma Y​'Loved this book'​'..an absolute stunner of an ending. Highly recommended.' Kaz Angel'A five star thriller which keeps you guessing to the end' Jules1960", "title": "London Noir\n      \n          (Kal Medi #2)", "url": "http://www.goodreads.com/book/show/36114783-london-noir", "average": 3.96, "cover": "https://images.gr-assets.com/books/1503561103l/36114783.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/14179591.Ann_Girdharry", "name": "Ann Girdharry"}], "type": ["Mystery"], "outlinks": ["http://www.goodreads.com/book/show/36114783-london-noir", "http://www.goodreads.com/book/show/36375508-london-noir", "http://www.goodreads.com/book/show/35844023-london-noir", "http://www.goodreads.com/book/show/36391789-tell-me-a-secret", "http://www.goodreads.com/book/show/36260365-good-girl-bad-girl", "http://www.goodreads.com/book/show/38819311-written-on-the-apple-tree", "http://www.goodreads.com/book/show/36317636-trading-with-death", "http://www.goodreads.com/book/show/38819206-sweet-justice"]}