{"ratings": 46, "userreviews": [{"userName": "Jay Dawkins", "userReviewDate": "Aug 15, 2014", "userURL": "http://www.goodreads.com/user/show/32820983-jay-dawkins", "userReview": "Hubbard was a hippy before hippies existed. He paints a portrait of a life lived in harmony with one's fellow man, doing work worth doing."}, {"userName": "عمران ابن العتبه", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/50389143", "userReview": "“Every religion is made up of two elements that never mix any more than oil and water mix. A religion is a mechanical mixture, not a chemical combination, of morality and dogma. Dogma is the science of the unseen: the doctrine of the unknown and unknowable. And in order to give this science plausibility, its promulgators have always fastened upon it morality. Morality can and does exist entirely separate and apart from dogma, but dogma is ever a parasite on morality, and the business of the priest is to confuse the two.But morality and religion never saponify. Morality is simply the question of expressing your life forces—how to use them? You have so much energy; and what will you do with it? And from out the multitude there have always been men to step forward and give you advice for a consideration. Without their supposed influence with the unseen we might not accept their interpretation of what is right and wrong. But with the assurance that their advice is backed up by Deity, followed with an offer of reward if we believe it, and a threat of dire punishment if we do not, the Self-appointed Superior[…]”"}], "description": "This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.", "title": "Love, Life and Work", "url": "http://www.goodreads.com/book/show/11111656-love-life-and-work", "average": 3.98, "cover": "https://images.gr-assets.com/books/1347821795l/11111656.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/114059.Elbert_Hubbard", "name": "Elbert Hubbard"}], "type": ["Nonfiction", "Did Not Finish"], "outlinks": ["http://www.goodreads.com/book/show/11111656-love-life-and-work", "http://www.goodreads.com/book/show/62845.A_Message_to_Garcia", "http://www.goodreads.com/book/show/5970575-a-message-to-garcia", "http://www.goodreads.com/book/show/1378813.Elbert_Hubbard_s_Scrap_Book", "http://www.goodreads.com/book/show/7608791-a-message-to-garcia", "http://www.goodreads.com/book/show/11078417-john-jacob-astor"]}