{"ratings": 74, "userreviews": [{"userName": "Gregory Diehl", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/53161021-gregory-diehl", "userReview": "Inviting and pleasant to look through in a leisurely pace, Loving Ordinary Life is an entertaining introduction to light-hearted yet practical personal development concepts. The art style complements the prose rather well. I would recommend this for young people looking for an easy-to-digest alternative to the overly complex and esoteric self-help gurus of today."}, {"userName": "Bob Rich", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/1425635-bob-rich", "userReview": "I am a Buddhist, and had a psychotherapeutic practice for 22 years. In this little book, I found many of the tools I use in my daily life, and have taught to hundreds of people who were able to use them to move toward a more positive way of looking at the world. So, I didn’t learn anything new -- but you might.Written in lively, clear language that speaks to young people, “Loving Ordinary Life” is a good resource for those many sufferers of ongoing dissatisfaction who don’t know why. Only, as the author points out in several places, reading won’t do anything much for you. You need to put its recommendations into practice.The publicity states this is a “self-help book for those who are tired of self-help books.” All the same, it follows the formula of self-help books. If you know it all in the head, it won’t teach you anything new. Just DO IT. But if life is getting you down, and you want some light and entertaining reading, then you can use this book to improve your world."}, {"userName": "Tiffany Giovino", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/43875258-tiffany-giovino", "userReview": "I was sent this book for my honest review.If anyone on here knows me personally, you'll know I suffer self hate from time to time. There are times where I can't stand myself and I feel like I'm getting nowhere in life. I would constantly go to others for guidance and I've never felt comfortable talking to someone. I just had to find the one thing that did make me comfortable. Reading. When I was asked to review this book, I couldn't turn it down. I knew deep down it could really help me learn to love and appreciate myself. Loving Ordinary Life is beautiful. Positive. Inspiring. Just look up any positive adjective in the dictionary and it would describe this little book. You can get through this book in one sitting. AKA you can read it as often as you need to. I'm honestly probably going to keep this book on my night stand and read something out of it everyday."}, {"userName": "SouthernTodayGoneTomorrow", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/7594282-southerntodaygonetomorrow", "userReview": "This is a short, sweet, somewhat childish looking book, written by Anastasia Petrenko and illustrated by Rina Kapustina,  that might be one of the better self help books I have seen. As a general rule, if I am looking for self help, I go to the internet. I can be honest. And usually, I am a little disappointed. This book didn't follow that trend, because it isn't trying to be like the other self help books.It is very short. This book focuses on various aspects of life, how they reflect on us, and tries to give a few simple things that we can do to make life better. This book is more about how you look at life. Perhaps part of the reason I like it is because it discusses many of the same things that I have come to understand in my life (at its current point in time). You make yourself happy, and it is all depended on your outlook and what you do. The publisher of this book, Identity Publications, reached out to me to review this book and a few others (whose reviews are on the way!), and I will admit I was wary. But I enjoyed this book more than I thought I would.If you are looking for a step by step book, this isn't it. If you are looking for something detailed, this isn't it. If you are looking for something positive and uplifting, this could be a good addition to your collection. Perhaps the hardest part of reviewing this book is how to rank it. I am giving it a 4 stars because it doesn't pretend to be something it isn't. It isn't really a self help book. It is a motivation book. A book to look to when you are wondering what to do about your state of mind. This is a book to help you reach positivity goals. It isn't to help you with a specific struggle. At the same time, it wasn't the most amazing book I have read. The biggest reason I liked it is because the author has determined many of the same things in life I have, and ended up expanding my thoughts on how to bring more to my life. We are all here for a short time, we should make it what we want it to be."}, {"userName": "Jasmine", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/4536416-jasmine", "userReview": "Loving Ordinary Life is a self-help book at its core, but it's more than that. For me, it was more inspiring and realistic. There are no crazy, out-there things you should do to make yourself happy or live a better life. Loving Ordinary Life is a book for normal, everyday people who just want to find simple ways to make life more fulfilling and happy.I enjoyed the easy-going, simplistic advice of the book. It focused more on using your senses to heighten your experiences, no matter how boring or bland they may seem. Like one example was to listen to music. Open your favorite playlist and find songs that will set the mood. This is something I already do on a day-to-day basis, so seeing it written as good advice made me feel better about doing it. Sometimes I'd feel bad that I was closing myself off from people and just losing myself in music so I could de-stress and relax. But it really does help, and by doing so, I can live a better life because I'm not so stressed.Another suggestion was to immerse yourself in a hobby; something you enjoy doing but maybe feel you don't have the time for, or the talent for. Instead of ignoring it, stop and take a breather from the hustle and bustle of life. Pick up that book and read it. Take some time to search knitting tutorials on YouTube and teach yourself to create something for yourself, or even someone else. I like that advice, especially because so many people focus just on their job and ignore the things that they enjoy. The only \"negative\" thing about this book, if you will, is that there are a few pages that happen to be repeated. Like, there's advice on one page, and then the next page has the same exact advice repeated word for word. I think it may have been a publishing glitch, though, and nothing that the author did.Overall, I really liked reading through the advice in Loving Ordinary Life. It made me feel better about the things I already do to make myself happy, and it also inspired me to try new things. I give the book 4.5 stars."}, {"userName": "Heena Rathore P.", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/19253213-heena-rathore-p", "userReview": "Living Ordinary Life by Anastasia Petrenko is a light-hearted self-help book which is both quick to read and easy to digest.Though the message tried to convey in this book is nothing different from the other gazillion self-help books, this book wins on the aesthetics part. I loved the basic design of the book, the vibrant yet soft colours used and the quirky fonts and illustrations. It is a fairly quick read, I read it under an hour, so it doesn't go on for ages like other self-help books. That's another plus, at least for me.I'd recommend this book to the genre lovers and to those who need a positive little guide to uplift their spirits and make them feel better about life in general.You can also read this review at The Reading Bud"}, {"userName": "Olivia Victorius", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/70785074-olivia-victorius", "userReview": "Great reminderSometimes its good to read a book like this as our reminder that we r not perfect, we r different from others and we decide our own happiness, not others."}, {"userName": "Anthony", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/23843936-anthony", "userReview": "Are you tired of the typical \"self-help\" books? Then this might be for you. Rather than focus on experimental treatments from around the world or a surreal look at the ins and outs of the self-help world, author Anastasia Petrenko introduces readers to Loving Ordinary Life: a self help book for people who are tired of self-help books. The short and easy read is a simple guide on how to be your best self without changing yourself and learning to accept who you are in the most loving way possible. Here is the synopsis:Loving Ordinary Life is written for us: living, emotional people.We all want to live a happy life, but we can easily fall into a state of despondency. We prefer to smile, but more often we frown.We like being inspired, but most likely, we can’t recall the last time when we were.There are many books and courses about self-motivation and inspiration. You might have heard hundreds of platitudes and affirmations. Each of them sounds valid but their utility is limited when you actually find yourself stuck in a pit of pain and despair.Loving Ordinary Life is meant to make a functional difference. It’s not a treatment for depression. It is about living a life where depression has no place.Loving Ordinary Life is your guide. It is designed so that you can open any page and find the inspiration to act and improve your life when you’re feeling down. Each chapter in Loving Ordinary Life is a tool for moving from a negative idle state to a positive proactive state. It displays to you the art of being present, free, and genuine every day.If you want to be more fulfilled and enjoy life more, if you’re open to quality changes, Loving Ordinary Life will become your loyal companion.Everything is within your power. You are the master of your life. How you experience it depends only on you. Take the lead.“Very little is needed to make a happy life; it is all within yourself, in your way of thinking.\"Marcus AureliusThis was a great and quick read. From start to finish you felt a sense of calm take over as you allowed yourself to absorb this book fully. It allows readers to examine their own lives and find happiness not from any external source, but rather from within themselves. Putting a stamp on the reliance of the self over the reliance of society, this book does a great job of creating an air of ease and an atmosphere of relative calm.Overall this was a wonderful book. Filled with passion, compassion and genuine care, this non self help book does a marvelous job of showing the power we all have within ourselves, and how to embrace it wholeheartedly. If you haven't yet be sure to pick up your copies of Loving Ordinary Life by Anastasia Petrenko today!"}, {"userName": "Lilly Charysma", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/26994341-lilly-charysma", "userReview": "“Loving Ordinary Life” by Anastasia Petrenko is a book intended to lift your spirits and even share some tips on how to know one’s feelings or reactions better.What I mostly love about it is how it encourages us to open up to what makes us feel good and happy and not to be afraid of being sad or down. Life is made of high and lows, happiness and sadness, but what is important is how we manage to bring ourselves from that down point to a floating line. And we can achieve that by getting to know ourselves better.The introduction defines so well the purpose of this book it is not intended to guide us towards complete happiness or be a manual on how to handle mental health issues. It just gives some hints on how to make our life more comfortable and learn to enjoy the beauty in all that surrounds us.Going through each chapter, I’ve learned some things that I can easily apply for myself and as well advices on how to support my friends when they are at their lowest. These were some easy steps that can even be fun to implement.I must admit though that I was not very comfortable with the illustrations. While they bring color to the text, they are a bit childish and sometimes even distracting. That’s my only reason not to give all my stars.To sum up, reading Anastasia Petrenko’s book has inspired and encouraged me to pay more attention to what makes me happy and it really boosted my optimism. I’ve learned as much as the author intended to disclose, so I believe it has reached its purpose."}, {"userName": "Abhi", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/73480294-abhi", "userReview": "The book has a collection of self help ideas summarised in an easy and jargon free way. Implementing it in our lives might not be easy and I thought the book could improve by showing how the steps to put it into practice. The illuatrations were good and I enjoyed reading the book overall."}, {"userName": "Stephanie M.", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/3484705-stephanie-m", "userReview": "Another self help book, telling what needs to be done but falls short on the how to go about doing it.Example: “Surround yourself with people who are optimistic and open to new experiences.” The book describes in detail what you should do (look at your friends and acquaintances: who commands your respect, who do you want to be around?) , but what if you are starting from ground zero, you don’t have positive people surrounding you, you are introverted and a people pleaser?. And how do you eliminate not so positive people from your life without being considered a jerk?Many points that are brought up are skimmed over in the same manner. We all should love ourselves, appreciate our surroundings, and help others as much as possible. But when you are stuck in a rut and can’t see the light at the end of the tunnel this book won’t show you the way.This book is for people who know their path, who follow their beliefs and values most of the time but are in need or looking for reassurance in times of self doubt. Negatives:Ascetically unpleasant, with large swirls of color separating paragraphs it becomes chaotic and distracting to the reader. Received a Free e-copy in exchange for an honest review."}, {"userName": "Sasha", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/75189609-sasha", "userReview": "I highly recommend this book. I've read self help books before, or motivational books but they were nothing like this. This is a very easy, and fun read, with lots of colors, meaningful quotes, and easy to understand language for any reader. It was very inspirational, and something any person can relate to in order to better understand ourselves, life, and to find out how to better enjoy it with simple steps anyone can do. This book isn't long either which I liked, it was short and sweet, and something I will read over and over again when I need a mood lifter, or to remind myself that life isn't so bad. This is one of my favorite books of the year."}, {"userName": "Jessica Bucci", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/63835609-jessica-bucci", "userReview": "I liked the simplicity of the novel and how it didn't contain all the vernacular and medical definitions that other self help books sometimes contain. The title is accurate, in that it is a self help book for those who don't enjoy other ones. However, I think it lacked in content. I felt as if he provided simple ways to help without explaining how to achieve them. I also really liked all of the quotes the book contained and how simple it was to read. Sometimes less is more when trying to help someone. But I did feel as if this needed just a bit more. I think this book would be better suited as a quote of the day or thought of the day. Almost like those calendars people put on their desks that have the word or quote of the day. This could be something that helps individuals on a daily basis stay positive, versus a book they have to pick up to read. DISCLAIMER: I received a copy of this book for free in exchange for writing a review. I was not obligated to give a positive review, and all thoughts are my own"}, {"userName": "Maria Corley", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/23442627-maria-corley", "userReview": "I received this book by accident--apparently, someone recommended me as a reviewer. Okay, I said, but it will take a while for me to read it. Which turned out not to be the case, because this is a very short book.It's rather a big statement to suggest your self-help book is for people who are tired of self-help books, but Ms. Petrenko is correct. The first chapter was more of the same, but as I continued, a chapter a day (so the simple suggestions could sink in), she wore me down. The layout, with circled suggestions, very few words on each page, and cheerful illustrations by Rina Kapustina, makes the book easily digestible. Most of all, the ideas are easy to implement. I suspect that her use of the imperative helps to make this book more effective. Even though I don't feel a great need to change my life, I know that if I get in a rut, her marching orders would be helpful.Well worth your small investment of money and time."}, {"userName": "The Reading Bud", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/61321693-the-reading-bud", "userReview": "Living Ordinary Life by Anastasia Petrenko is a light-hearted self-help book which is both quick to read and easy to digest.Though the message tried to convey in this book is nothing different from the other gazillion self-help books, this book wins on the aesthetics part. I loved the basic design of the book, the vibrant yet soft colours used and the quirky fonts and illustrations. It is a fairly quick read, I read it under an hour, so it doesn't go on for ages like other self-help books. That's another plus, at least for me.I'd recommend this book to the genre lovers and to those who need a positive little guide to uplift their spirits and make them feel better about life in general.You can also read this review at The Reading Bud"}, {"userName": "Tolu Agunbiade", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/11221797-tolu-agunbiade", "userReview": "Easy read; over simplified contentThis book was a quick read, I'll give it that. But it read like someone talking​ at me for an hour straight. True to it's name, it talks about how anyone could live a simple and fulfilling life. I like the sections the book is broken into, but not the explanations under them. I wish there had been more personal experiences or practical tips in the book. For example, anecdotes on how the author overcame depression (which is mentioned in the 'about the author' section) using the concepts in this book.I read Loving Ordinary Life as a recommendation from my sister whose opinions I hold in high esteem so I can only say that, probably, this book just wasn't for me."}, {"userName": "Violet", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/73265040-violet", "userReview": "I was drawn to this book because of the description, which promised to deliver a self help book unlike all the others out there. I have to say that the book delivered on this promise! I like self-help books and have read a lot of them. But I’ve tried many of the teachings set forth in other self-help books, such as affirmations, positive thinking, and so on, but the benefits of these methods always fell short for me. This book teaches you how to turn your negative thoughts into positive, empowering ones, and it does so by teaching you how to do it yourself, based on your own needs and thought processes, instead of relying on some general tool or method. I think everyone should read this book at least once! As for myself, I plan to re-read it often!"}, {"userName": "Anonymous", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/56712240-anonymous", "userReview": "I like the idea of this book, it just feels like I read something I already knew. It’s advice that you get from everyone in this sort of field. It just felt like I was reading advice and encouragement without the depth or tips on how to achieve it. I think this is better suited for children, giving them the building blocks without the weighty medical terms and definitions. Still a sweet, positive idea even if the images are a bit much. I like the curly ribbon banner along the top though, that’s fun. Disclaimer: I received a copy of this book for free in exchange for writing a review. I am not obligated to give a positive review, and all thoughts are my own."}, {"userName": "Hannah Symonds", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/30819689-hannah-symonds", "userReview": "I don't normally read self help books of any kind. This book had a friendly and happy vibe to it. It will help you to live an ordinary life as the title suggests. The tactics and suggestions really do help the reader in their time of need. The book as it has been written well, is easy to use and understand and it is small enough to be able to use anywhere and everywhere. A really helpful book."}, {"userName": "Aliza", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/3769509-aliza", "userReview": "Simple and positive; Uplifting Who can count the books written to encourage positive thinking and its benefits? Too many to count.What I loved about this book is that it doesn’t take itself too seriously. It׳s simple, refreshing and when Anastasia is finished saying what she wants to say she just ends the book. Clear and eminently readable,"}, {"userName": "Sarah S", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/73824049-sarah-s", "userReview": "I borrowed this book through Kindle Unlimited. I was very much happy to read the facts presented. Living ordinary life is indeed leading a contented life even when there are storms all around you. What matters most is whether you are at peace with yourself or are you still obsessed or controlling things.Beautiful book - The best book in reviving self.:-)"}, {"userName": "Kaitlin", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/39862227-kaitlin", "userReview": "The way it is written is very poetic and calming"}, {"userName": "Amanda ChocolatePages", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/35873076-amanda-chocolatepages", "userReview": "While I was waiting for this book to arrive through the post, I was expecting it to be a kind of self help book that you sit down and read through it all page by page, and while you could do that, I was pleasantly surprised that this book was exactly as its tag line had suggested. It is a kind of self help book for those fed up of the usual kind! Perfect! I found this book very easy to read, and its the kind of book you can carry about in your bag, (its quite small) and you can open any page at random and you will find something inspiring there. The layout of the book is really good, as it has writing in short paragraphs, but it also has cartoon like illustrations. ( Praise to Illustrator Rina Kapustina here), and quotes which are written larger more prominent on the page. This is a cute book for motivation and inspiration.The information isn't really anything that you wouldn't be told by someone helpful trying to inspire or make you feel better. Its the kind of hints that we should remember every day, and if we did and could live by them, I'm sure the world (or at least the ones who follow the advice) would be happier people.No self help book, or advice given is a magic wand to make us happy, but some useful advice written in an easy to read, light hearted way is a good a way as any if you want to gain a little inspiration or encouragement to improve your state of mind to make the most of what you have. I enjoyed the read, and it is a book that I will keep handy for days when I feel like a  few encouraging words would be helpful.Originally posted on my blog http://www.chocolatepages.wordpress.com"}, {"userName": "Andre Grillon", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/81984023-andre-grillon", "userReview": "“Loving Ordinary Life” (2017) by Anastasia Petrenko is a lovely book. Self-styled as a different sort of motivational read, it validates its claim and is as agreeable as a pastel-colored french macaroon. Breezy reading is guaranteed by its artful arrangement of ideas and illustrations. Consider the title of the ten sections:Self-awarenessSoundsWordsVisualizationNatureActionsRecreationPeopleLifestyleSelf-loveA refreshing departure from the canon of self-help books promoting multistep plans and networking, the author takes a unique approach by starting from square one: ordinary life. Ordinary life is a treasure-trove of insight, the author proposes, with powerful considerations to optimize sense perception and pluck from an ever-changing world lasting inspiration.- ask friends to record a voice note, expressing what they find exceptional in you, refer to it when feeing down- walk down a city block, consider the richness in shades of color a lone tree yields - think about the amount of people that had to meet for you to be aliveOriginal ideas make “Loving Ordinary Life” a refreshing read for anyone looking for new ways to stimulate the “fire of inspiration” in their lives. With stylistic ethos comprising natural conversation tone, information in bits, crayon colors and cutesy clipart drawings, “Loving Ordinary Life” makes an especially appropriate gift for a budding female adolescent and curious person in golden ages open to self improvement."}, {"userName": "Andreas Michaelides", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/43609402-andreas-michaelides", "userReview": "I received a complimentary copy of this book in exchange for an honest review.Loving Ordinary Life: The Self-Help Book for People Who Are Tired of Self-Help Books by Anastasia Petrenko is a self help book as the title says but with a nice twist.It deals with fundamental issues that are in every persons mind. Issues like Self-awareness, lifestyle, Nature, Recreation and many more are presented and analyzed.Throughout the book there is a positive that made me feel good about myself and also allowed me to read the book with open mind.Lots of sayings and proverbs in the book that are artistically and beautiful combined with elegant illustrations making the reading of the book even more enjoyable.It is a light, Meaningful and to the point overview of what a person should take under consideration in his/her life in order to improve themselves.The solutions that are proposed in the book are easy to apply and easy to follow. The only thing that is on our way is our self’s.It is an optimistic book full of useful tips and advices and I highly recommend it for anyone that wants to find solutions in his/her everyday life."}, {"userName": "Kat", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/15160202-kat", "userReview": "Short but it was worth reading I’ve enjoyed reading this book comes in quick bites, that makes you think, question your feeling and keeps you fired up to make it through the day.I was feeling frustrated with some news today, then I opened the book and saw this. And I realised that I can only change myself. I can’t force change in others. I just have to hope that they find the right path themselves. I know that there are plenty of these books around, but the books free at the minute so what’s stopping you checking it out."}], "description": "Loving Ordinary Life is written for us: living, emotional people.We all want to live a happy life, but we can easily fall into a state of despondency. We prefer to smile, but more often we frown.We like being inspired, but most likely, we can’t recall the last time when we were.There are many books and courses about self-motivation and inspiration. You might have heard hundreds of platitudes and affirmations. Each of them sounds valid but their utility is limited when you actually find yourself stuck in a pit of pain and despair.Loving Ordinary Life is meant to make a functional difference. It’s not a treatment for depression. It is about living a life where depression has no place.Loving Ordinary Life is your guide. It is designed so that you can open any page and find the inspiration to act and improve your life when you’re feeling down. Each chapter in Loving Ordinary Life is a tool for moving from a negative idle state to a positive proactive state. It displays to you the art of being present, free, and genuine every day.If you want to be more fulfilled and enjoy life more, if you’re open to quality changes, Loving Ordinary Life will become your loyal companion.Everything is within your power. You are the master of your life. How you experience it depends only on you. Take the lead.“Very little is needed to make a happy life; it is all within yourself, in your way of thinking.\"Marcus Aurelius", "title": "Loving Ordinary Life", "url": "http://www.goodreads.com/book/show/36328361-loving-ordinary-life", "average": 4.51, "cover": "https://images.gr-assets.com/books/1506762280l/36328361.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/17196839.Anastasia_Petrenko", "name": "Anastasia Petrenko"}], "type": ["Self Help", "Nonfiction", "Philosophy"], "outlinks": ["http://www.goodreads.com/book/show/36328361-loving-ordinary-life", "http://www.goodreads.com/book/show/36383208-loving-ordinary-life", "http://www.goodreads.com/book/show/40207347-intimacy-on-the-plate-extra-trim-edition"]}