{"ratings": 133, "userreviews": [{"userName": "Bernie", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/35921264-bernie", "userReview": "Madam President: \"This is not a drill.\" reviewMadam President: \"This is not a drill\" is one of the most fascinating books that I've read. It's full of political suspense. The ending is awesome."}, {"userName": "ROBERT F BEAM", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/30049752-robert-f-beam", "userReview": "TerribleI FELL LIKE I'VE BEEN ROBBED,HOW DO I GET MY TIME AND MONEY BACK. PLEASE DON'T MAKE THE SAME MISTAKE."}, {"userName": "Arthur", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/36204957-arthur", "userReview": "Madam President: \"This is not a drill.\"Gregory takes Vice President Molly Cartwright to the ultimate test of her life. Best part, you're going through the same process as you follow Molly's actions, decisons, and thought patterns while asking yourself; is something like this really possible, could this situation really happen in America? Thanks for another great read."}, {"userName": "ToriLynn", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/28584800-torilynn", "userReview": "Well writtenWell written and deeply engaging. Wow! I’m not sure I can write a review after reading the ending because I couldn’t stand to have this as a leaked ending. Although I prefer the ending as written."}, {"userName": "Eunice Korczak", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/41954975-eunice-korczak", "userReview": "Madam President:This is not a drill\"Madam President: This is not a Drill\" is a political thriller with a familial twist. The president is in trouble; the vice president is his daughter. Difficult decisions are extra agonizing because of the father/daughter relationship. When the roles change and she becomes president will she, in essence, trade her father's safety for the lives of many, many American citizens? A cleverly devised book and an extremely entertaining read."}, {"userName": "Deb ", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/48926757-deb", "userReview": "I really enjoyed reading this book by this author.What would you do if your Dad was President of the United States and you were the VP. Something happens to him and you have to take over a lot of decision making and worry would be a big part of the day. Well written and surprising also."}, {"userName": "Nancy Shaffer", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/51682802-nancy-shaffer", "userReview": "As good as your favorite full length action thriller in a movie theater!"}, {"userName": "Leslie Zimmerschied", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/13759964-leslie-zimmerschied", "userReview": "MehHated the ending. I don't normally post critical reviews. Please save yourself the time and don't waste your brain cells on this book."}, {"userName": "Glenn", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/37057094-glenn", "userReview": "Well done. Held my interest to the end. A good read"}, {"userName": "Tulay", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/36800166-tulay", "userReview": "This is not a drill?Gripping political suspense. Heart in your throat page turner, and all the while praying this will never happen. You will be so very mad at the end."}, {"userName": "Jean Fanelli", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/26956556-jean-fanelli", "userReview": "This was good book until the ending. How about letting the president be saved? The positive ending was ridiculous. I'm mad I wasted my time reading this book."}, {"userName": "Ellen Mcgarvey", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/23818283-ellen-mcgarvey", "userReview": "Enjoyed and deff pissed at the endingI would have been a crazy woman had I been her! Thanks though as the swing you out on it I NEVER SEEN COMING AT ALL!"}, {"userName": "Michele bookloverforever", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/4530043-michele-bookloverforever", "userReview": "I'd never forgive either my father or my lover nor any of my so called friends."}], "description": "Molly Cartwright has made her peace with the job her father nagged her into taking. The only reason she agreed to take it was because the position hinged on her father winning a presidential election. She figured she could agree to take the job, he'd lose the election, and she'd be off the hook. James Cartwright won the election. He was a widower, and had no interest in living in the White House residence by himself. Not only did he lobby to have his daughter appointed as Vice President, on the grounds of bringing her in to help reform education, he also talked her into giving up the Vice Presidential home to live in the White House with him. Things were going along well. They're now six years into their jobs, making strides in their agendas, when life as they know it comes to a screeching halt. Molly is in the middle of making a speech when Secret Service agents surround her and carry her off the stage. Within the next few hours, she is given devastating news, sworn in as the next President, charged with trying to discover who the traitor or traitors are, figuring out which nation is responsible for this mess, and is put into the precarious position of fending off a war, all while trying to mourn a parent. Molly's challenges do not stop there. She's contending with two sets of senior staff, her own and her father's. Certain people doubt her ability to maintain focus when her personal life has just been through the spin cycle. A staff member disappears when the Secret Service is spread too thin. Everyone thinks there may be pertinent information on the President's phone, and Molly has a plan on trying to hack into it, if they could just get the thing to her. Her personal aide is afraid and refuses to even step foot into the residence for fear of Lincoln's ghost. The man who targeted her father reveals himself enough to torture Molly with images, threats, and a FedEx shipment. A little digging around reveals a surprising relationship, and a long-harbored dream, Daddy was keeping secret. And, in her bid to get to the truth of all that is afoot, the rookie President turns suspicion on herself, hoping to draw the enemy forward. Note: A new, alternate ending has been added.", "title": "Madam President: \"This is not a drill.\"", "url": "http://www.goodreads.com/book/show/23644780-madam-president", "average": 3.74, "cover": "https://images.gr-assets.com/books/1432379982l/23644780.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/7755849.O_L_Gregory", "name": "O.L. Gregory"}], "type": ["Thriller"], "outlinks": ["http://www.goodreads.com/book/show/23644780-madam-president", "http://www.goodreads.com/book/show/20521044-lulling-the-kidnapper", "http://www.goodreads.com/book/show/23820913-the-daddy-secret", "http://www.goodreads.com/book/show/28113580-walk-of-shame", "http://www.goodreads.com/book/show/36716874-if-it-s-the-last-thing-i-do", "http://www.goodreads.com/book/show/32337169-the-complete-bering-sea-trilogy"]}