{"ratings": 52533, "userreviews": [{"userName": "Kat Kennedy", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "*Before I begin my review, I must take a moment to honour the devastating goddess who made it possible for me to read this book. There are not enough words in the English language to fully capture the incadescents of this magnificent human being. She is beyond reproach, loved by all, exulted in her graciousness. I adore her with the nuclear reactions of a thousand suns. She is worth more to me than all of the precious jewels!*/Suck up\"The series gets good at book three.\"If I had a penny for every time I heard something like this about a series then... okay, I'd probably have about a dollar now.But still, for many avid readers out there, it is the bane of their existence. No, but really. This series gets GOOD at book three.Unlike most people though, I didn't mind it at book one. I thought it had a lot of potential. Some people get thrown off of being tossed into an unfamiliar world with little or no hand-holding from the author. Note: Ilona Andrews will never hold your hand. You either keep up or she'll leave you behind.For me the second book was an improvement but still only representative of a slightly better-than-average series. Then the third book happened. It really, really happened...Ever since then, I've been in love with Kate Daniels, Ilona Andrews, and her Edge series. Magic Slays lives up to the series fairly well.It's intelligent, witty, well-paced, fun, easy to read and enjoyable. The character arcs are all interesting, realistic, involving and enjoyable.My only complaint with this series is that Andrews is obviously very uncomfortable about any intimate scenes. She has the writer's equivalent of premature ejaculation and at one point I almost wanted to stroke the book and mutter, \"It's okay. Really. It is. It happens to everyone.\"Andrews, like Neil and unlike most of the Urban Fantasy authors, actually seems to LIKE women. The friendship between Kate and Andrea, her ward Julie and her dealings with the other women in this book is so well treated! It's a breath of fresh air to have a female protagonist who actually gets along with other women.Over all, if you're a fan of this series, definitely read the latest installment.If you're not a fan of this series - please don't shoot me but...It gets good at book three."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "⚔ \nThe Grand IAA™ KD Buddy Rerererereread Extravaganza\n (GIAAKDBRE™), aka the yellow brick road to Magic Triumphs ⚔Presenting Episode 5, or How Kate Daniels Learned that Morgue Steps Can Have Very Entertaining Uses Indeed.» \nAnd the moral of this particular rererereread is:\nMutant attack poodles who chew on plastic guns + 15-year-old sex fiend/pure chick magnet + Roman the hidalgo pirate lookalike (aka Roman the Riveting Russian Rake, aka R⁴) + duck-bunny kitties (or is it bunny-kitty ducks? Or kitty-duck bunnies? I forget) + Chernobog, God of Morning Dew on the Rose Petals (aka The Black Serpent. Koshei. Lord of Darkness and Death. Ruler of Freezing Cold. Master of Destruction. God of Insanity. Embodiment of everything bad. Evil) + Edvokia and her house on chicken legs *waves at Baba Yaga* + His Fussiness' cuddly Tasmanian devil + Osanda, you bitch + playing with other boys' toy cars + making ribbons with intestines + the hand that slapped Aunt B. + having the enemy for lunch + mostest coolest spiky red-haired weremongoose nanny ever = let's dance the night away and stuff.[July 2016]❣ KD is the Cure to All of Life's Problems Buddy Read (KDitCtAoLPBR™) with my dear wife Ange, and the poor IAA souls who have fallen into our deathly KD Surprise Reread Trap (KSRT™).✎ Previous rating: 8 stars✎ New rating: I don't know anymore. Millions of them, probably. Or maybe trillions. Who knows?» And the moral of this particular rererereread is:Oh, and also:Bye now. Things to do, tourists to strangle and all that crap.[July 2015]✎ Previous rating: 5 stars✎ New rating: 8 stars ← What? Were you seriously expecting anything less? Don't you know me at all people?! How many times do I have to tell you?! I want to be Kate Daniels when I grow up.►► Why do I want to be Kate Daniels when I grow up, you ask? Because being Kate Daniels means:① You kick ass.② You get to sleep in the Beast Lord's four feet high bed (playground slide optional, His Furriness mandatory).③ You get to sleep in the Beast Lord's four feet high bed (playground slide optional, His Furriness mandatory).④ You get to sleep in the Beast Lord's four feet high bed (playground slide optional, His Furriness mandatory).►► Oops, I think my brain short circuited right there. Sorry about that. Moving on.⑤ You cut cut cut and slice slice slice. Yum.⑥ You have very cool sidekicks:✔ An ex Boy Wonder who vomits better than a shaved, mutant attack poodle.✔ An oversexed 15-year-old bodyguard/intern/chick magnet.✔ A seventy pound weremongoose nanny with a head on fire.⑦ You can do very cool tricks with your blood. Thanks so much Daddy Dearest!⑧ You get to play in His Overbearance's enormous bathtub (soap optional, His Furriness mandatory).⑨ You get to play in His Overbearance's enormous bathtub (soap optional, His Furriness mandatory). ⑩ You get to play in His Overbearance's enormous bathtub (soap optional, His Furriness mandatory).►► Oops, I think my brain short circuited right there. Sorry about that. Moving on.⑪ You have a very cool family. Well, maybe except from Daddy Dearest. And Auntie Erra. And dear step-daddy. And Mommy Dearest, too? Ugh. Not such a cool family after all. Sonovabitch.⑫ Your best friend is a hyena with a gun fetish. She steals other people's pets, too. But hey, nobody's perfect.⑬ You know how to have fun:✔ Play with trolls✔ Attend ant parties✔ Pet mutant cat-rabbit-ducks✔ Visit houses on chicken legs✔ Meet lovely people with supersonic whistles⑭ Roman the Riveting Russian Rake is part of your extended family. It doesn't get much cooler than that.⑮ You get to beat the crap out of the Beast Lord just for kicks. Fun times.⑯ You have the coolest vocabulary: Osanda, Amehe, Ahissa, Dair, Hesaad. The bastards have no idea what they're in for.⑰ You have a very big, possessive, overbearing, hot as hell kitty cat.⑱ You have a very big, possessive, overbearing, hot as hell kitty cat.⑲ You have a very big, possessive, overbearing, hot as hell kitty cat.⑳ You have a very big, possessive, overbearing, hot as hell kitty cat.►► Need I say more? Didn't think so.✎ Book 1: Magic Bites ★★★★★ ✎ Book 2: Magic Burns ★★★★★ ✎ Book 3: Magic Strikes ★★★★★ ✎ Book 4: Magic Bleeds ★★★★★ ✎ Book 6: Magic Rises ★★★★★✎ Book 7: Magic Breaks ★★★★★ ✎ Book 8: Magic Shifts ★★★★★ ✎ Book 9: Magic Binds ★★★★★✎ Book 10: Magic Triumphs - to be released August 28, 2018."}, {"userName": "Katerina", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "“Put your badass faces on and follow me.” \n\nStudying Intellectual Property Law or following Kate Daniels' new adventures that include slavic gods,domestic terrorists and my favorite knight in furry armor.Let me think.\n\n“Starting the day with a philosophical debate with a priest of the Embodiment of All Evil.It could only go downhill from here.” \n\nKate Daniels is now the Beast Lord's mate and she has her own business that investigates paranormal problems and life would be perfect,if only someone hired her.And her ward stopped escaping from her private school.And she wasn't afraid that her father would finally come to kill her.And a device of disastrous potential that threatened Atlanta's citizens was found.And an underground organisation didn't try to murder her.A humble mercenary's life is never perfect after all.\nConfessions of a Kate Daniels addict\n1.Addicted to action.While reading Magic Slays I wasn't sure whether I would give it 4 or 5 stars.Of course I loved it,but I didn't find it as intense as the previous ones.And then the final pages happened and battles and bombs and ancient rituals and massacres occured and everything fell into place.2.Addicted to sarcasm.Sarcasm here,sarcasm there,sarcasm everywhere!Kate is the queen but every single character has a witty retort ready to strike and make you snicker until you sound like Squidward Tentacles.It's not pleasant for the people around you but don't be ashamed,things could always get worse! (I can't find an example to support my case but I blame the sleep deprivation,I'm sure you can think of something more embarassing than sounding like a grumpy cartoon)\n\n“What do you mean fainted?Took a dive, kissed the pavement. Swooned like a southern belle after her first kiss. Had a dreadful case of the vapors.” \n\n3.Addicted to Curran.\n\n“What is wrong with you?Many, many things.Curran!I love it when you say my name.It sounds so sexy” \n\nLast night I wrote a letter to Santa.I asked him to bring me a possessive,jealous,violent homicidal maniac that behaves like an asshole most of the times and turns into a lion,preferably without any clothes on so I can admire his sculpted abs.No I'm not demented (I think),yes I need a cold shower immediately.4.Addicted to romance.\n\n“If I fought for them and was crippled, they would all say nice things,and then they would replace me and forget I was ever there. You would stay with me. You would take care of me, because you love me. I love you too, Kate. If you ever became hurt, I would not leave you.I’ll be there. Wherever you want‘there’ to be.” \n\nOk I admit,it was this exact scene that convinced me to give the fifth star.Curran and Kate are one of my all time favorite couples,they make me swoon with declarations like this,they have hot sex that makes me blush and then they fight and kick each other in the head without regrets.Kate is still an insubordinate pigheaded ass,Curran is still a manipulative control freak,but they manage to stay together despite their differences because that's what we call love.The time has come to return to the real world with the exams and the essays,but I can proudly claim that no matter how many times Gandalf saidI ignored him and dedicated a few hours to read Magic Slays.I hope the book gods will help their faithful servant."}, {"userName": "Navessa", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "Welcome to the Reader’s Court of Literary Grievances\nThe courtroom was alive with the buzz of conversation. Today’s case had drawn so many spectators that it was standing room only. Behind the judge’s bench, high on the wall, hung an unimposing, standard-issue clock. As its hands ticked down the minutes, the excitement in the room rose and the buzz of the crowd slowly turned into a low level roar. Fifteen minutes before start-time it was so loud that people had to raise their voices when speaking to their neighbors or risk losing their words to the cacophony that reverberated around them. Every now and then shouting could be heard ringing out over the din, another die-hard fangirl losing their temper in one of the many heated debates that were taking place.“How can you even say that?!” one woman screamed. “Anita Blake could wipe the floor with Mercy Thompson.”“Oh yeah?” another chorused. “Well Rachel Morgan is a demon. She could drag Anita into the ever after and leave her there to rot!”“She’d just screw her way out!” yet another joined in.And so it continued. At one point a scuffle even broke out near the rear doors but luckily it was quickly broken up before it could escalate into a full blown brawl. With the energy level of the room hovering around frenetic, all it would take was one stray punch for the crowd to implode. At precisely three o’clock, a door on the empty side of the bar swung open and those assembled began to fall silent. The first person to appear was the bailiff, a towering man with cold, dark eyes that scanned the crowd as he moved towards his post. Following him were the court clerk, the court reporter and finally, swathed in billowing black robes, the judge. He was not what most of the spectators expected. He was…young. He was handsome too, with broad shoulders, dark hair cut close to his head and gray eyes that seemed to glow with some sort of inner power. Those eyes swept the crowd much as the bailiff’s had and the individuals they fell upon seemed to cower beneath his gaze. Once he was fully ensconced behind the bench, more people filed in through the side door. These were dressed in expensive looking suits and seemed to wear similar expressions on their faces; a mix of supreme confidence and utter boredom. Only the thin bands of sweat on their upper lips or the nervous twitching of a hand gave away their true feelings. As much as they’d like to pretend otherwise, this was not just another court case. These new arrivals took their seats behind the two desks that faced the judge and began to open briefcases and shuffle through papers as they talked amongst themselves. Behind them, the crowd was so quiet you could hear a pin drop. It was as though the collective was holding its breath for something. The last person to enter the room was a woman of medium height and medium build with light brown hair pulled back off her face. This was clearly what the crowd had been waiting for. As soon as they caught sight of her, they erupted, some hurling angry words and threats and others rising up to shout them down in between cheering her as she sauntered over to her seat, a smirk splitting her face. “Order! Order!” the judge roared, his deep voice echoing throughout the marble and stone room so that it seemed he’d spoken the words three times. Something in his tone brooked no argument and the crowd fell into a low level grumbling and then finally back into silence. Those who snuck glances at him quickly looked away, unnerved by the way his eyes seemed to flash under the electric lights. Taking advantage of the moment, the bailiff stepped forward and spoke into the hush. “Today we’re here to rule on The People versus Navessa in the Case of the Most Badass Heroine.”And so it began. It was the trial they’d been waiting for, the one that would decide it all. Navessa's case was a good one and her lawyers well versed in both Urban Fantasy and Paranormal Romance. They knew the standards, knew the tropes and the themes and they’d spent months preparing for this. Preparing to prove, once and for all, that Kate Daniels was the most badass main character to ever grace the pages of a book.The prosecution was equally stacked. Among their papers were innumerable quotes spoken by the many heroines that made up their client list. They had weapon inventories, outfit inventories and even in one case…a boyfriend inventory. They had pages and pages of descriptive paragraphs detailing fight scenes, magical badassery, heartbreak and heroism. It would be a tough trial. “Will the prosecution please begin its opening statement,” the bailiff ordered.In response, a tall man with thinning grey hair moved sinuously up out of his seat and strode towards the center of the room, placing himself in full view of both the judge and the crowd. He turned towards his audience with a smile that could have sold souls to the devil himself. “My job is not to disprove Kate Daniels being a badass,” he began. From her seat behind the defense table, Navessa watched him like a hawk. As he continued to speak, his low, soothing voice ringing out through the room, she realized he was good. He was really good. Listening to him wax poetic about the preponderance of evidence and the impossibility of decisively placing a single character above all others would have made almost anyone nervous. Not her. You see, she knew every single one of his clients. Had known them for years in fact. She knew their dirty little secrets, their hidden agendas and most importantly, their weaknesses. And she and her lawyers were prepared to use it all against them. When the prosecutor was done with his statement, the head of her defense stood and strode to the same spot that her enemy had just occupied. Navessa knew the speech she was about to deliver by heart, she’d helped write it. “Kate Daniels, is a badass. This is irrefutable,” her lawyer began. For the next three minutes she laid out their case in broad terms, citing numerous sources to include sales statistics, critical reviews and ratings on book related websites. It was a good speech and the crowd, which had started whispering almost the moment she opened her mouth, slowly fell silent over the course of it. By the end more than a few were nodding along in agreement. The trial lasted three days. Evidence was submitted and poured over in excruciating detail, experts were brought in followed by critics. At the end of the second day a psychologist even spoke, and he seemed to think everyone involved in the trial was in dire need of his services. On the final day, it was the witnesses’ turns. It was these men and women that made the case electric, emotional and absolutely unpredictable. One woman, called to the stand for the prosecution, broke down in tears halfway through questioning by the defense. “I just don’t understand why she had to sleep with so many men the way she did. I would have been fine if she had just owned up to her behavior but nooooo, she blamed it on the Ardeur. I hate her now!” she sobbed.“I understand,” Navessa's lawyer smiled kindly, barely masking the predatory gleam in her eye. And therein lay the genius of their defense. For who hadn’t been irritated at one point or another while reading about their favorite heroines? Who hadn’t thought they’d acted too-stupid-to-live? Who wasn’t still angry about it on some level? What Navessa knew was that the number of times she’d felt this way about Kate Daniels was a fraction of a fraction of the number she had for the prosecution’s clients. She knew that the amount of other readers that felt this same way might very well win them this case and so her lawyers were vicious in their cross examination of the witnesses. Closing arguments took place at the end of the third day. The same snake of a man that gave the opening statement for the prosecution spoke again, addressing the judge this time, instead of the crowd. There was no jury here today; the decision would come down to the imposing man that had ruled over the past days of proceedings with a solemn face and a quiet dignity. “Your honor,” he began. “Has the defense proven beyond a reasonable doubt that Kate Daniels is the most badass of the badass?” Navessa had to stifle her urge to snort. She listened along with the crowd as this man rehashed all the evidence that supported not that one of his clients was more badass than Kate but that the defense had failed to prove that Kate was the most badass. When he was finished a few people in the crowd even clapped and for the first time Navessa felt a stab of worry. But then her lawyer was standing from her chair, striding confidently to the center of the room. She turned not to face the judge, but the crowd. “We’ve all been together in this room the last three days. We know what’s taken place. We know that there is one character that reigns supreme over all others and we know that her name is Kate Daniels so in closing I’d like to site just one more quote and it’s the quote heard round the paranormal world. The one that made us arch an eyebrow, crack a smile. It’s the one that alluded to there being a new badass in town and that she was everything we’d been wishing for.” Here she paused for dramatic effect and Navessa's eyes swept out over the crowd. They were on the edge of their seats, their faces rapt as they waited for her lawyer to speak again. Finally she did, whispering in a low, sing song voice “Here, kitty, kitty, kitty.”No sooner had she taken her seat than the javelin dropped. “The court rules in favor of the defendant,” the judge spoke in the same monotone he’d been using the past three days. The courtroom erupted in reaction, the prosecution shooting to their feet to protest, the crowd behind them mostly cheering but with pockets contention erupting here and there. As her lawyers shook hands and patted each other on the back, Navessa turned away and pretended to pack up some papers, her eyes straying to the judge as he gathered himself to leave. Beneath her breath, so quiet that someone standing next to her wouldn’t even be able to hear the words, she whispered “Nice dye job, Your Majesty.” The judge turned to go as though he had all the time in the world but Navessa could have sworn she caught the hint of a smile playing upon his lips.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Limonessa", "userReviewDate": "Jan 26, 2011", "userURL": "http://www.goodreads.com/user/show/4147373-limonessa", "userReview": "I would like all authors of urban fantasy and paranormal romance out there to stop for a second their feverish scribbling and take a look at this series. THE proof that YES, series don't necessarily need to go down the drain after 4th installment, that YES, series can STILL be interesting after the two romantic interests in the story \"do the deed\" and that YES, plots do not need to become unbelievably twisted, punctuated by improbable events and where mythology gets slaughtered just to get out of the bloody unplanned mess that became your story's outline.Now, instead of giving you a synopsis of the book, I'd rather tell you why this book in particular, but the whole series in general, deserved 5 stars:- because the plot is interesting, well developed, makes total sense, each book is tied to the other but still stands on its own without painful, mean and useless cliffhangers;- because romance in this book is not the vital core of the story but rather like a planet orbiting around a much substantial and well-founded plot - so much so that in the first book there is NO romance and we're still all here, inhaling every single word Andrews is writing;- because vampires, in these books, do not sparkle;- because the Andrews, when they decided to put mythology into their world, did their homework well and decided to stick with what they knew: in this book, they stuck with Russian mythology and used it in a great, clever way - there is no Russian kid who hasn't heard of Baba Yaga that I'm aware of;-because Kate is simply and undeniably the baddest UF heroine out there at the moment; she is clever, disillusioned, snarky and she kicks ass so much that I wish I was her;-because the dialogue is so full of snark, banter, sarcasm and great comebacks that I am SURE everybody has highlighted some part or the other of the book;Finally, the main reason why I think this series is so fortunate: because the Andrews are two. So what? Even P.C. Cast are two. No. I think the fact that a man and a woman have written this series together has given it a great balance. Thanks to Gordon Andrews being present, the books never get cheesy, overly romantic or dangerously stupid. On the contrary, you can see where he puts in his knowledge of weapons, fighting strategies and so on. He gives the books a masculine angle that only helps making Kate even more of a badass. The fact that the authors are husband and wife shows in the dialogues between Kate and Curran, I think.In all this awesomeness, I am not saying that the book - or the series - is perfect. There are flaws: some that have to do with proofreading - a \"door bursts open\" immediately after having fallen into the room - some with the plot - I think there is a certain confusion at times about the form the beasts take, half form, warrior form, full animal. There is a passage where Mahon shouldn't have been able to shift into warrior form yet he does - and some have to do with excessive detailing - those who followed and understood the whole coefficient and proportion thing about probability of loupism please raise your hand. Also, I was pretty sorry that Raphael was not in this book, and I expect him in the next one.Still, somehow, these imperfections do not detract from the general state of satisfaction I was left in after I read the last page of the book. Dear Ilona and Gordon Andrews, if you keep on writing like this, I will gladly buy Magic Whatever # 15."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "[, and yes, I realize it's strange to think that weird exotic monsters are so much more plausible than a group of non-magic people who are willing to commit mass murder to eradicate magic from the world again (hide spoiler)]"}, {"userName": "Gordon", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/4098997-gordon", "userReview": "It is not as bad as Ilona thinks, all and all it is not terrible."}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "[I don't even think Joey had been mentioned before this book. He was a total red shirt, but it didn't matter. When Jezabel lost it, so did I. I sat there boo-hooing, not understanding why I was boo-hooing, but boo-hooing nonetheless. And Ascanio tore me up too. Sitting in that loup cage, huddled around Julie, with ribs sticking out of his side. HE CARRIED HER UP THE STAIRS WITH TWO BROKEN LEGS. *wails* (hide spoiler)]"}, {"userName": "Bradley", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Okay, this is easy. Since I'm a fanboy, it's super easy to write reviews because I can usually just do a gonzo.Suffice to say, it's really fun to be getting into the characters. There might have been a little hiccup with Curran in this one... like there ain't hiccups in all of them... but it's nice to see the interplay.I can't believe that Derek is actually growing on me, at long last. But Julie? Awwwww.... pooooooor kid! This is definitely going to bite everyone in the butt. I know it.Urban fantasy, when done well like this, is really some of the most effortless reads out there. It gets rather special for me, though, when we get a who's who of mythology showing up, like Greek gods overcharging for body bags and large refrigerated units, or Baba Yaga giving cute little gifts to little girls. Hmmm.. wait... she has a tendency of doing that anyway... oh well. :)The switchover back to tech comes at a very nice time for me. I really wanted a good return to that world-building quirk, and I couldn't be happier. I love mad geniuses. :)And as always, great apocalyptic shit for the end. Total popcorn madness. :)"}, {"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "[Hot wax? So not cool! (hide spoiler)]"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "[“If I fought for them and was crippled, they would all say nice things,and then they would replace me and forget I was ever there. You would stay with me. You would take care of me, because you love me. I love you too, Kate. If you ever became hurt, I would not leave you.I’ll be there. Wherever you want ‘there’ to be.  (hide spoiler)]"}, {"userName": "Katie Michaels", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "Coming off the high of the spectacular ending of Magic Slays, I've been staring at the computer for 10 minutes, trying to figure out why it took me a little while to really get into this book. And I think I've finally come up with the answer.As the story begins, Kate is running the new agency that Curran set up for her since she has left the Order. But despite her competence and reputation, she doesn't have any clients. But just as her best friend Andrea returns from a two month absence, Kate is hired to find a missing man and the mysterious device he has built. She investigates; she is snarky; she is magic and bad-ass. But (insert light bulb here) I wasn't very invested in any of it, because Kate seemed to have no stake in it all, beyond completing a job. No justice mission like she had when searching for Greg's killer; no revenge for a brutal attack on a friend; no saving the world from a deranged aunt. Just a job.It was when Kate realized what the device could do and what it would mean to her world, that I began to perk up. And then we were off and running. Without spoiling too much, I'll say that the device could have huge ramifications on Kate and all those she loves, if it is activated. And as we get into the second half of the book, Kate encounters a personal crisis, that makes her willing to risk everything to fix it. It's when Kate is desperate and loyal and determined that she is at her best. And here she shines, a heroine in the greatest sense.Curran is back as Kate's mate, and I was worried that some of the spark would be missing from their relationship, now that it's more permanent. But Kate's paranoia keeps them from falling into the old-married couple routine. She still has questions about whether things can work for them long-term. But as the story progresses, he proves himself to be an utterly worthy hero. And I still enjoyed the fire between them.For the last third of the book, I was completely unable to put it down. The ending was fantastic and sets up even more drama for the next installment. I can't imagine that Kate will be able to keep her secret for much longer. 4 1/2 stars.*ARC Provided by Penguin Group USA"}, {"userName": "Niki Hawkes - The Obsessive Bookseller", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/13396599-niki-hawkes---the-obsessive-bookseller", "userReview": "I now count myself among the Kate Daniels super fandom. Magic Slays was another great installment on what is shaping up to be an awesome series. Since I’ve gushed about it enough in other reviews, I’ll stick to specifics for this title. I especially loved how authentic the relationship was between the main character and her bff. They argued like real people, and it’s the kind of back-and-forth bickering that’s fun to read about. In fact, all the relationships are great, and I especially love how many interesting side characters get their own spotlights in some of the short stories (yup – it’s good enough to read all of the extra novellas that go along with it!). I’ll probably be doing a Kate Daniels short story blitz once I get through them all.Via The Obsessive Bookseller at www.nikihawkes.com"}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "Ugh Ilona Andrews, you need a new cover artist. Your books are too good for these corny covers.I want to start my review with a message for Ilona Andrews. Mrs. Andrews, are you with me? Yes? Ok.I LOOOOVEEE YOU SO MUCH! SOOOOOOOO MUCH!!! You are my most favorite person ever!!!! Ever!!! I want to put you in a plush cage (I care about your comfort, I would never hurt you!) next to my bed so that I can look at you day and night and make you write amazing stories just for me. Forever! And I won’t share! No no no. Never! All mine!!Wouldn’t that be great? WOULDN’T IT???I know it would.Oh yes. Soon. As in next year soon.WTF? Can someone tell me why the next Kate Daniels book is coming ONLY next year?? Why?? You there! Tell me why!!I’m so sad right now. And angry. I just want to punch someone in the face.And the ending. Oh the ending. Such a tease.:clears throat: I apologize. I know this was supposed to be a review and not transcript my current breakdown.Ooook my kids, let’s start.I have no idea what to write. It was amazing, as always. But I guess I already said that. Uhm… oh yeah, I think I got something.I am so grateful for not having another Cat and Bones (Night Huntress) book. Yes, I like couples fighting crime together but it all has a limit. I want independent characters not a freaky Siamese-like couple talking eating sleeping and shitting at the same time. Yes, I used to love Cat and Bones a lot. Now they’re boring, a thing of the past. I didn’t want this to happen to Kate and Curran.Curran’s absence from Kate’s little adventure is a breath of fresh air in the world of urban fantasy couples. But eventually Curran was replaced by Andrea. At first I wasn’t sure if this is better or not but eventually all was well. Andrea makes a good Watson to Kate’s Holmes.I’m so curious about Andrea, Roman and Raphael. I usually hate love triangles but this one seems to be so much fun. I am sure we’ll get to see Roman again. Hell, I want to see Roman again. I loved the guy! I actually would like Andrea to dump Raphael’s ass (for good – I know she still has perverted thoughts towards his furry behind) and go for Roman. But I don’t think it’ll happen. What do you guys think? Is she better with Raphael or should she go for the evil-hottie-that-is-actually-not-so-evil-but-kind-of-cute Roman?\nHe heaved a dramatic sigh. “We could do this like civilized people. But no, now I’ll have to go to your office and unleash plagues on things, and set things on fire, and condemn things. Nobody wants that. Just give me the staff and we’ll call it even. I am trying not to be a bad guy here.”\nSee how awesome he is?? Do. You. See??Oh, you do? Good. That’s good. :puts her huge knife away:"}, {"userName": "Evgeny", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "Buddy read with Armina, Eilonwy, Asya, and Monty Cupcake.Poor Kate Daniels opened a private investigation outfit quite a while ago, but the clients did not exactly form a huge line at her doors. In fact she did not have a single one yet. When her friend/enemy Ghastek asked her to deal with a vampire on the loose she jumped at the chance. Before she knew it, the little problem escalates into something much bigger. She now has to deal with pissed off police, her adopted niece Julie who disappeared, and accept a very questionable assignment from an elite guard unit called Red Guards. Kate's life became anything but boring.In my opinion this was the second best book of the series after Magic Strikes. It has its own share of problems, but the positive parts overweight negative ones by far. The things I do not like include the following.The authors missed a chance to show a very interesting battle with a bridge troll. We are shown Kate rushing in, the next scene start with a description of the aftermath. Was it the desire to keep the number of pages low which influenced this?I realized I do not care about Julie. I understand that she is 15-year-old girl - and we all know what is means - but I do not find a single redeeming quality in her at all. I really could not care less what would happen to her. She is a failure as an interesting character.The ending felt rushed and the resolution felt kind of on the easy side, but when you think about it, this was the most logical thing what would happen as the forces in the fight were nowhere near being equal.In the good parts I liked the appearance of some very colorful characters from Slavic (Eastern Slavic?) folklore. I did not expect for Baba Yaga to appear the way she was described here, but let us call it artistic liberty.The biggest reason for high rating was a moral of the story. The humanity created myths for as long as we can recall; some of them were very ingenious, some quite gruesome, some quite entertaining. Despite this, we - the humans - have yet to come up with a creature/monster/god/entity more dangerous than a bunch of fanatics in real life. Our collective imagination is not up to the task, simple as that. I said it was a moral, but at no point in the story this became preachy, or hammered relentlessly. Well done, dear authors!The plot was entertaining and fast-moving. Everything taken together constitutes a solid 4-star rating. This review is a copy/paste of my BookLikes one: http://gene.booklikes.com/post/101381..."}, {"userName": "Emma", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "Another thumping good read, but that is not what impressed me most because I expect no less from this series. No, what impressed me was the development of the world building as the series progresses: how the long term effects of the magic and tech shifts continue to break the remains of the old world apart. In this volume, all the magical elements- witches, shapeshifter, mages, vampires have to team up to beat a common enemy. We see how Kate will sacrifice everything for Julie and how Curran would give everything up for Kate. We learn more about Kate's mother and backstory with Roland and watch Kate struggle with all her insecurities. Fab read!"}, {"userName": "Sophia Triad", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "It is time for Kate to put on her grown-up pants and act like an adult. It is essential for her to deal with a number of things that need an adult attitude. So:1.\tFor the first time, she has a business to run with employees and bills to pay. For a variety of reasons she keeps adding employees to her business and all these people have needs, i.e. better weapons, food, food and more food, extra chairs etc.She has to be cautious about her budget and her earnings, but I am not sure she is very successful with this matter.2.\tShe is mated now. She needs to learn how to trust Curran and this is hard. She has learned from a young age that all males will eventually try to manipulate her and take advantage of her. Is Curran going to do the same? She is so suspicious and scared of this possibility, but her heart is telling her otherwise.Curran is just Curran. Just adorable. There is a scene in which he gets mad and he tears up her cookbook. 5 minutes later, he just goes back to buy her another.3.\tAs the female Alpha of the Pack: she has to•\tobey rules and laws•\tfollow protocol•\thave escorts and bodyguards•\tattend formal dinners•\tbe the judge of conflicts between pack members and answer petitions•\tmake decisions about other peoples’ lives and•\tthink about the Pack first, naturally!Kate feels her choices are being taken from her. She needs to be careful every time in order not to cause a diplomatic episode or not to test Curran’s patient. Additionally, she is not sure if his Furriness is truly worried about her or if he is just a manipulative bastard.4.\tShe will learn the bitter, ugly, painful truth about her mother Kalina and her stepfather (Hint: Kate’s can also be called Katenga). And she will have to deal with it!5.\tShe is the guardian of a teenager. Not an easy job. Little Julie does not behave and she does not do what she is told. Kate has to learn to be a parent and to provide parental advice.6.\tShe has to come to terms with the fact that she will lose someone close to her. This is unacceptable for Kate. And I agree.7.\tIt is about time to embrace and practice her magic!A strange machine with unknown use and a secret anti-magic society are going to keep Kate and her friends on their toes and they will add complexity to the book.Everyone who knows the secret just runs away and you have a constant feeling that the city is doomed. There will be an excellent, epic battle with all the elite magic beings of Atlanta united against the common enemy. Pure awesomeness.I truly love how the relationship between Curran and Kate develops, how their emotions deepen and explanations are given about how much they mean to each other. Kate is gradually maturing and transforming from a warrior girl in the first book to a woman in love who defends what is hers."}, {"userName": "Mariya", "userReviewDate": "Jul 09, 2010", "userURL": "http://www.goodreads.com/user/show/2959426-mariya", "userReview": "The fifth book in the Kate Daniels Series, MAGIC SLAYS is just as AMAZING as all the rest. Ilona Andrews is one of my all-time favorite authors and I am so amazed at how with each book in the Kate Daniels series I grow closer and closer to these characters that I have so much emotion welled up in me. Yes. I cried like a big baby. That is how great and close you come to love these characters. You think of them as real and you adore each and everyone of them.MAGIC SLAYS is the book! Yes, the book where we get to see how Kate and Curran are as a couple, not just as a couple, but as Beast Lord and Consort. Kate and Curran were just as wonderful in this book as they were in the others. And yes, for those who will be begging to know, there is more Kate and Curran in MAGIC SLAYS and all I have to say is after this book, I want to steal Curran for myself. He makes my heart beat like crazy.\n \"\"Laugh while you can. You have to sleep eventually, and then I'll take my revenge.\" \"You're such a violent woman. Always with the threats. You should look into some meditation techniques...\"\nI had to stop myself from skimming through the book for all of the Kate and Curran scenes. I have a serious Kate and Curran addiction and I don't want help. Their scenes together were absolute perfection. And we really do see how much Curran cares about Kate. Aww...ummm..Kate do you mind if I steal him away from you? I love him.\n \"Jealous of the actors now, are we?\"\"What, of some fancy boy on the screen? Inconceivable.\"Oh, this was going to be good.\nSo Kate is Consort to the Beast Lord and I bet you are all wondering how she is doing at that. She is so bad ass. Even though Curran tells Kate what to do she won't take any of that shit. haha. Just the way I like Kate. I adored Kate in this book. There are some things that we get to learn about Kate's past that she didn't even know and it made me tear up a bit, but that's because I love her.As Consort, Kate does have a little power and there's this one scene in MAGIC SLAYS where I am like \"Best Kate Daniels Showdown EVER! You Go, Girl!\" We do get some surprises along the way that I will not spill, but it made me go WHAT?! HUH?! and YEAH! A lot of crazy emotions all at once. Characters that I worried about, laughed and cried with and you will too.MAGIC SLAYS does not disappoint. Look forward to having your butt glued to your seat(like Curran glued Kate's butt to her chair in Magic Bleeds LOL) all day while enjoying yet another astounding book in the Kate Daniels Series"}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "[And it has to be said that the scene where Kate comes on Ascanio’s broken body protecting Julie was endearing as fuck! (hide spoiler)]"}, {"userName": "Adina", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "Last review of a Kate Daniels book for this year. By the time I reached the middle of this book I already began to get a bit bored of Kate Daniels as it was the 5th book in a row that I read from this series. I still enjoyed it but I started to feel the need for a break. What is this book about? Kidnapping, witches, Russian volhvs, power play between Curran and Kate, fights, love."}, {"userName": "♔ Jaela ♊ Killer ⚔ QUEEN ", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/16126654-jaela-killer-queen", "userReview": "[ Hugh congratulating Kate and sending her flowers.... (hide spoiler)]"}, {"userName": "Angela", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/4255477-angela", "userReview": "February 2018 Reread.August 2016 re-read: JFC. This book - had me on the edge of tears for nearly 60% of it (possibly more). I love this series. I love the humor and how the stakes are high - and not everyone always makes it, so you learn to cherish the moments as they happen. But damn. It rips my heart out sometimes.And that ending. The note. The flowers! O_oSeptember 2015 re-read: This book easily ties for my favorite of the series - but with so many excellent books in this series it's still hard to choose. I love it.20 July 2014: $1.99 on KindleReview (sort of):I plan to do a full review of this later - these are just my quick thoughts.I loved it!! Ilona Andrews just continues to blow me away with their stories. It's such a deep, vivid, layered world with complex characters around every corner.I liked the reality of Kate starting her own business. Of having partners/employees. The difficulties and issues that come with that and how she handled them. The growth and development in Kate and Curran's relationship is fantastic. This isn't just an HEA, ride off into the sunset; this is an HEA in progress (to steal Ilona's words). There are hurdles still to be overcome, trust still to be issues, secrets still to be discussed, and compromises to be made. I'm confident in their HEA, I know they'll never falter, never give up on one another and never let each other go...but it still takes effort for both of them at times. I like that we see that. Also the issues with Kate being the other half of the Alpha pair. There's some politics that take place in this book, and all I can say is I was cheering for Kate when she was done. Loved the way she handled a very tense situation.The action of the storyline is intense. What starts as a job quickly becomes possibly the biggest threat that Kate has faced yet. There are some mind-blowing bits of Kate's history revealed in this book. I'm still trying to wrap my head around them, and decide what to take at face value and what to dig a little deeper on.In addition to this, there's the trademark humor, smart-assedness and absolutely heart-wrenching moments. I laughed out loud more times than I can count, and teared up just as often.The last few chapters of the book are a wild roller-coaster of a ride, that I'm going to be reading again right now for what I'm sure I missed.All in all, great book, great story. Must read and I highly recommend this series."}, {"userName": "Layla ✷ Praise the sun ✷", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/45487389-layla-praise-the-sun", "userReview": "It's no secret anymore that I'm madly in love with Kate and that I'd totally marry her. Magic Slays is another favorite book of mine in her series because it is action packed, fast paced and has SarcasmI did some thinking.” “That is a very dangerous pastime,” Ghastek said. He’d made a joke. Surely the apocalypse wasn’t far behind.A lovely character castI nodded to the boy wonder and the sex fiend.Derek, Ascanio, Jim, Saiman, Aunt B. ... They are all part of the party again. Fun politicsKate, it’s not personal. It’s protocol and it’s common sense. You don’t challenge people under you, you don’t get to skip formal dinners, and when you go to see an unstable coward who screwed half of Atlanta and propositioned you in public, you bring an escort. Deal with it.PhilosophyRage is a powerful thing. People get upset over many things. Frustrating jobs, small paychecks, bad hours. People want things; people feel humiliated by others who have the things they want; people feel deprived and powerless. All this gives fuel to rage. The anger builds and builds and if there is no outlet for it, pretty soon it transforms the person. They walk around like a loaded gun, ready to go off if only they could find the right target. They want to hurt something. They need it.RomanceCurran growled. “Later, babycakes.” Babycakes. Asshole. “Good hunting, sugar woogums.”Speed re read at Ilona Andrews Addicts because Magic Binds will be released on September 20th *faints*"}, {"userName": "Angela James", "userReviewDate": "Jan 29, 2011", "userURL": "http://www.goodreads.com/user/show/1570073-angela-james", "userReview": "Ilona Andrews just tells a good story, there's all there is to it. If you love this series, I don't think you'll have any reason to be disappointed in this book. Lots of Kate and Curran goodness here! Also, I just had to call out this snippet of a scene between Doolittle and Kate, and what Doolittle says because I agree with it. It kind of epitomizes how I feel about Nicholas Sparks books, or series where the author kills off a main character. It's an easy emotional reaction the author doesn't have to work for. Feels like cheating. ***\"Did he write tragedies?\"\"No. Comedies. Good ones too.\" Doolittle drank his tea. \"I don't trust tragedies much. It's easy to make a person sad by showing him something tragic. We all recognize when sad things happen: someone dies, someone loses a loved one, young love is crushed. It's much harder to make a man laugh--what's funny to one person isn't funny to another.\""}, {"userName": "Suzanne (Under the Covers Book blog)", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/3575839-suzanne-under-the-covers-book-blog", "userReview": "June 2015 Reread: Is it possible to mate and have offspring with a series? AKA I love this series and want its babies...This is the fifth installemnt of the Kate Daniels series and I LOVED IT! I completely completely consumed it this book, no page was left unturned, no word undevoured! In the last book it was left with Kate and Curran finally getting their freak on and becoming mates, and Kate starting up her own PI business with a little assistance from the Pack. In Magic Slays it has been a couple of months and she hasn't had a single client which, isn't surprising been as Ted her former boss at the Order has been bad mouthing her. But, when she does finally get her first job of finding out where a kidnap victim is she stumble on more then she bargained for and the whole of Atlanta's magical communiity have to team up or face certain death. Although I love the action packed plots of all the Kate Daniel books, in this book I found myself looking forward to some Kate-Curran interaction and was a little worried that now they have gotton together the funny push and pull of their relationship would disappear; however, it was a needless concern, the two of them have still had heaps of chemistry and the witty banter that marked their relationship from the beginning. I loved watching them figure out exactly how they were going to life together, both of them are stubborn and used to getting their own way so sparks definately fly and although this book is fairly tame in the sex department, it is mostly fade to black, you can still feel the heat between them. This book also expanded more on Kate's crazy family, and I really can not wait for the final confrontation between Kate and Roland and how it will pan out, Kate is like Spiderman she always beats the big bad guys even though she seems to have less power they they do, I just hope she can do the same with Roland. I have a feeling though that Hugh might be in the next book, her step father's prodigy and Roland's right hand man. The only thing that was slightly disappointing was that I wanted to see Andrea and Rapheal together! There wasn't a single confrontation between them! They can't split up! I can't allow it damn it *shakes fist*! They were perfect for eachother!I really loved this book, not only did it have a fast action packed plot, but it had my favourite couple in it and it has left me waiting very impatiently for the next book!"}, {"userName": "Cyndi", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/7132123-cyndi", "userReview": "These books just keep getting better!! Kate has opened her own business, Cutting Edge Investigations. Of course her first customer would be part of a cult built on ridding the world of magic. Even though without magic most of the population would die.  Kate is battling a group of terrorists with sleeper agents everywhere. Meanwhile her kid is in trouble.  This book made me laugh, it made me cry, it made me shudder and it made me feel the warm fuzzies for the romance between Kate and Curren. If they ever do a poll looking for the most romantic couples in literature, they would be on it. *romantic sigh*"}, {"userName": "Julio Genao", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/3977017-julio-genao", "userReview": "whatever.I tried to resist. mama always says: all that matters is that I do my best.this is me doing my best not to keep reading these so-so mashups of horribly clunky prose and terrific action set-pieces.i started the next book before i even finished this one.STFU"}, {"userName": "Jo ★The Book Sloth★", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/13870608-jo-the-book-sloth", "userReview": "I really really thought of giving this book a lower rating. You may ask why, is this book bad? Not at all, it's actually pretty awesome. Is it not well written? Nope, it's just as perfect as the others. So what is my problem? One thing, only one thing kind of destroyed this book for me, the whole \"Julie\" part.Let me elaborate. In my mind I have created an image for Kate, she is stubborn, loyal, courageous, smart, gutsy,..., and most important of all she doesn't let anyone decide for her, she doesn't follow orders, she doesn't abide to any authority. The image I have created for her just doesn't add up to a person who would take the decision she took for Julie in this book. The person in my mind wouldn't do this to someone else even to save their lives, she would find it some kind of rape. I felt like they told me for the first time Santa Claus is a myth. If she does an Anita Blake and start saying things like \"it couldn't be helped\" and \"I couldn't do anything else\" I will have to shoot something!End of mental breakdown!As for the rest of the book:Things start going south for Kate when her PI office is hired to investigate the dissapearance of a scientist. Kate manages to find that the scientist was building a dangerous machine that could destroy Atlanta and everyone she loves and now it is in the hands of a group of fanatics who doesn't care for how many lives it will cost when activated. Kate and her friends have to stop them by any way they can.\nWhat I liked in this book:\n1) I mostly liked Kate and Curran as much as I did in the other books. Their relationship remains strong but not sappy and they don't suddenly go to the toilet together, they both have their jobs and lives and they both continue to be strong minded and independed so except for the part I mentioned before these two continue to be one of my favorite couples.2)I liked Andrea again. I felt a little satisfied with what the Order did to her, petty I know but I think of it as punishment and she is better off without them. I mostly enjoyed her \"fight\" with Aunt B. I really want them to fight and Andrea to be the budda Alpha.3)I liked the story. The book didn't resolve many things in the main plot of the series (Daddy-Kate match) but it gave us enough information to keep us interested. The mystery with the lost scientist and the bad fanatics was good enough to keep you glued to the book and it was as always well written so no complaints there.4)The secondary characters were as always interesting. I especially like Rowena, Ghastek and Evdokia.As for the bad, the only black spot for me was Julie but honestly it was almost enough to make me want to close the book and save myself the dissapoinment.(almost)Deffinitely looking forward for the next one and I really, really hope that Kate will find a solution to Julie's issue. The end of this book sparks your curiosity for what is to come next but we have to wait. *snif*My favorite moments:\n“Andrea raised her hand. “This is the hand that slapped Aunt B.”“Maybe you should have it gold-plated.”“Here, you can touch it, since you’re my best friend.” “I know it's late, but could you find a book for me? It's called The Slavs: Study of Pagan Tradition by Osvintsev.\"Barabas sighed dramatically. \"Kate, you make me despair. Let's try that again from the top, except this time pretend you are an alpha.\"\"I don't need a lecture. I just need the book.\"\"Much better. Little more growl in the voice?\"\"Barabas!\"\"And we're there. Congratulations!” \nAnd many more but I'm too bored to look for them.**************28/07/2014 UPDATE**************BR with Aly!!"}, {"userName": "Phrynne", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This is number five in the series and it still maintains its momentum and interest levels. Not many series do that. Kate gets more badass with each successive book and we continue to meet more and more new fantasy figures. This time round we find out more about Kate's unusual birth and upbringing and also about her special powers. Her relationship,with Curran is also developing and there is the usual banter between the two of them as neither is willing to be ruled by the other. I really enjoy these books and am very happy I still have several more to read:)"}, {"userName": "Carol. ", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[ Why would Kate keep Julie at the office at all, when her whole stress was about keeping her safe? Why would Andrea leave the kids knowing a loose vampire had just been there recently? It seemed more necessary for moving events forward than internally consistent. I was also surprised at how many people were killed by the magic bomb when it's only been a few generations since magic hit. (hide spoiler)]"}], "description": "Plagued by a war between magic and technology, Atlanta has never been so deadly. Good thing Kate Daniels is on the job.Kate Daniels may have quit the Order of Merciful Aid, but she’s still knee-deep in paranormal problems. Or she would be if she could get someone to hire her. Starting her own business has been more challenging than she thought it would be—now that the Order is disparaging her good name. Plus, many potential clients are afraid of getting on the bad side of the Beast Lord, who just happens to be Kate’s mate. So when Atlanta’s premier Master of the Dead calls to ask for help with a vampire on the loose, Kate leaps at the chance of some paying work. But it turns out that this is not an isolated incident. Kate needs to get to the bottom of it—and fast, or the city and everyone dear to her might pay the ultimate price…", "title": "Magic Slays\n      \n          (Kate Daniels #5)", "url": "http://www.goodreads.com/book/show/8559047-magic-slays", "average": 4.43, "cover": "https://images.gr-assets.com/books/1288727226l/8559047.jpg", "reviews": 2462, "authors": [{"url": "https://www.goodreads.com/author/show/21748.Ilona_Andrews", "name": "Ilona Andrews"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/8559047-magic-slays", "http://www.goodreads.com/book/show/11055258-magic-slays", "http://www.goodreads.com/book/show/10438797-magic-slays", "http://www.goodreads.com/book/show/38619.Magic_Bites", "http://www.goodreads.com/book/show/4345498-magic-strikes", "http://www.goodreads.com/book/show/6479550-magic-bleeds", "http://www.goodreads.com/book/show/1811543.Magic_Burns", "http://www.goodreads.com/book/show/11544421-magic-rises"]}