{"ratings": 6656, "userreviews": [{"userName": "Jordan Theune", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/11711785-jordan-theune", "userReview": "Note: I received a free ARC of \"Magnolia Nights\" from NetGalley in exchange for a fair and honest review. “Magnolia Nights” is a novel that had great potential but appeared to run out of steam through the last quarter of the book. The story begins by introducing us to Ellie, who has recently inherited her estranged grandmother’s estate in Charleston, South Carolina. We learn that her mother is deceased, and she didn’t know her father until she was 6. Ellie, escaping from a bad relationship in California, moves into the old house and begins debating on whether she should stay or sell. Over the course of her life, Ellie has tried to remember what happened during the early childhood years she spent with her grandmother and mother. Through therapy, she becomes convinced that something traumatic must have happened to her and that by being in that house again she might be able to conjure her suppressed memories. For decades Ellie’s grandmother had employed Maddie, a housekeeper/servant/you-name-it kind of employee, and when Ellie inherits the house she continues her employment. Because Maddie was a fixture in the house for so long, Ellie is hopeful that Maddie will be able to help her discover what happened to her so many years ago. Maddie is reluctant to help, but with the discovery of her mother’s journals Ellie soon has enough back-story to go on.I thought the premise of the story was great. The idea of having suppressed memories released through the discovery of Ellie’s mother’s past is a captivating plot, so the book engaged me quickly. After Ellie began reading her mother’s journals things got a little sticky for me. It wasn’t entirely clear to me whether we were actually reading her journal entries or if the journals were just a plot device used to get us to Ashton’s life. I would assume the latter if not for one remark in an early Ashton chapter when she said something like, “you remember when…” which makes me feel like she’s talking to someone. I thought it would have been more effective to have Ellie in the first-person role and for us to read Ashton’s journey in the third-person instead.During Ellie’s search for truth, the author adds in a romantic interest, Julian, which further causes the story to spiral downward. The dialogue between the two is cheesy and clunky, and the speedy onset of their relationship felt entirely implausible to me. Though I did like Julian’s character, I wasn’t impressed with the way the author threw him at Ellie so easily so that they could “make love” all the time. Additionally, I think the writing here demonstrates that the author is not comfortable writing sexual scenes because anytime the characters had sex it was very much written like this: “Then they made love. She got up to get food and then they made crazy love again. And again.” There are no details, no feelings—nothing that should be included when one decides to make sex a part of a story. I think that it was a mistake to add this extremely intimate relationship so quickly.Aside from the clunky romance subplot, the story was actually decent at this point. I was fascinated by how horrid the grandmother was revealed to be, and I truly thought that the author was going to deliver some crazy plot twists that would impress me. Unfortunately as soon as Ellie makes her final big discovery from the journals, the story is obliterated. Ellie embarks on a quest to find someone she didn’t know existed, that person ends up being awful, and then the story leaves us with our mouths open saying, “What?” It felt as though the author was tired of writing, so she took what should have been a large plot development and rushed through it in a couple of short chapters. There is no real resolution. We never truly learn all of what happened to Ellie during her first years. The author has dropped a stop sign on us in the worst possible way. It wasn’t intriguing writing on her part that led her to write this ridiculous ending: It was either laziness or that she ran out of time. The last 30 percent of the book really ruined the entire novel for me, which is a shame since I had expected such good things. In the future, I would hope that the author realizes that she needs to close out her plot points rather than add absurd new ones at the last minute."}, {"userName": "Kathleen", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/39134508-kathleen", "userReview": "I thoroughly enjoyed reading MAGNOLIA NIGHTS by Ashley Farley. It has beautiful descriptive writing and is intriguing and interesting with some creepy parts. Ellie Pringle is surprised to learn that her grandmother has died leaving everything including her antebellum mansion to her. Ellie hasn't seen or heard from her grandmother in over thirty years and remembers very little about her. Abbott, her father, wants her to sell the house, and get on with her life. But Ellie decides to fly from San Francisco to Charleston, stay in the mansion and try to awaken her early childhood memories that years of therapy could not unlock. Will Ellie finally remember why she was traumatized when her father came to Charleston to rescue her? What was so terrible that she has blocked it from memory all these years? Will she be brave enough to stay alone in the spooky mansion? What surprises are in store for Ellie? I highly recommend MAGNOLIA NIGHTS by Ashley Farley. 5 starsSpecial thanks to Kimberly Costa and Ashley Farley for gifting me an ARC of MAGNOLIA NIGHTS enabling me to read it and write my thoughts about the book."}, {"userName": "Sarah Elizabeth", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/10380598-sarah-elizabeth", "userReview": "This was a quick, easy read and I enjoyed finding out the family history alongside the protagonist. I thought the big reveal of the deep trauma she experienced as a child was clever, but I feel like it was rushed in places and drawn out in others. I would have liked more at the ending instead of feeling like she stopped caring about her characters.I received an advance reader copy of the book from the publisher and NetGalley."}, {"userName": "Shalini", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/57308589-shalini", "userReview": "This book started with a bang and the story sounded so intriguing. Ellie has no memories of her childhood and going back to the house left to her by her estranged grandmother, she finds a journal by her mother. She starts reading....Till this point, I thought that the author, Ashley Farley has done a wonderful job, getting me invested in the story. Then it loses its plot with a love interest and the story loses its steam and goes off track with love making. I liked the story initially then it felt too off-pace. I did finish the book, I did skim the paragraphs, I did skip pages of Julian to get to know about locked memories. I wanted this to be an explosive finish but the reason for the lost memories let me down. On the whole, this felt a good read, if read without any expectations"}, {"userName": "Susan Peterson", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/10178397-susan-peterson", "userReview": "Magnolia Nights is a mesmerizing tale of mystery, romance, and coming to terms with the past. Set in Charleston in a decrepit, creepy mansion, the setting sets the tone for the story. Ellie Pringle lived in this old house until she was six; a childhood both haunted and disturbing. When she inherits the house, she must reconcile herself to the horrors she experienced, horrors that are deeply hidden in her memory. Magnolia Nights is a riveting story, a book that will leave you wanting for more!"}, {"userName": "Charlotte Lynn", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/5944642-charlotte-lynn", "userReview": "Nothing makes me fall into a book faster than it being set in a place I have never been yet the author takes such great care with the details that I feel like I have been there many times. I find myself picturing the grand houses, hearing the charm of the southern voices, and feeling the southern heat. Ashley Farley is amazing with her detailing. The story in this is heart breaking. A woman comes home to her mother after finding herself pregnant and the mother takes her in only to make her a prisoner of her house. When she gives birth, the child becomes a prisoner also. Then the mother dies leaving her house in Charleston to her grandchild. There is so much more to this story but I don’t want to give away too much and ruin your experience of reading Magnolia Nights. There is multiple points of view in alternating labeled chapters. I really enjoyed this format. I liked that you could see other characters perspective on the same events and how it affected their lives. There was no confusion; each chapter was labeled so you knew exactly who was sharing their thoughts. Ashley Farley is a talented author and I recommend picking up your own copy of Magnolia Nights ASAP. This is a must read."}, {"userName": "Lisa Hudson", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/49105261-lisa-hudson", "userReview": "EXTRAORDINARY!Magnolia Nights is teeming with intrigue and passion. This intensity is rooted in a search for peace and redemption that has escaped Ellie Pringle for thirty-four years. When her grandmother dies and leaves her home on Charleston's South Battery Park Street to her, Ellie loads up her meager belongings and moves from San Francisco to chase the ghosts from her past. Elli's goal is to finally find the answers about her early years that have haunted her all her all her life. Farley's beautiful yet haunting story will draw you in and have you hanging on every word! It's a story of a family torn and scarred by secrets, love in its truest form, betrayal, true friendship, mental illness and redemption. It's the story of finding what the definition of a \"family\" really means. I was provided an ARC of this book but the opinions expressed here are my own."}, {"userName": "Amy Wolf", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/63932932-amy-wolf", "userReview": "Thank you to netgalley and the publisher for a free copy of MAGNOLIA NIGHTS in exchange for my honest review.Oh, how I loved this book. I read it in one day. The description for me, didn't do the story itself justice, so don't let that deter you from picking up this gem. This felt like a strange marriage of The Winter People and The Roanoke Girls, melded with plenty of original storytelling. Oh the mysteries, and secrets that were unveiled. Romance, deceit, and did I mention secrets? This one is a must read! I will be recommending this one to everyone I encounter. Grab a copy and enjoy!"}, {"userName": "Robbi Leah  Freeman", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/15974348-robbi-leah-freeman", "userReview": "3 1/2 stars. GR really needs to update their rating system either add halves or 1-10. It’s hard to fit these novels in only 1-5. This book is about Ellie who after leaving with her father 34 years ago, comes back to accept her inheritance and try to remember her past. The book was good and interesting but I do feel the person inheriting a house with secret past is a little overdone. But I wasn’t bored in this book. Several twists that made it a little different."}, {"userName": "DJ Sakata", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "My Rating:4.5Favorite Quote:Her eyes convict and sentence you to death before you’ve even committed the crime.My Review:Magnolia Nights was an unexpected yet captivating departure from the previous works I have read by Ashley Farley. I loved her Sweeney Sisters series and I was pleasantly surprised by the somewhat eerie, intriguing, and mysterious Magnolia Nights. The storyline was unpredictable and engaging, and it certainly piqued my curiosity and kept me a bit on edge from beginning to end. The tale was well-crafted and full of twists and turns as well as heaving with an eclectic cast of characters that included the endearingly flawed main character of Ellie who is struggling to recover her childhood memories as well as secondary characters who were more than bit eccentric, bizarre, and chillingly devious. The storyline could best be classified as women’s fiction that entails mystery, family drama, romance, suspense, and maybe even a restless spirit if the housekeeper were to be believed. I was quickly pulled into the tale and had a hard time putting my Kindle down. I am eager to see what Ms. Farley does next."}, {"userName": "Melissa Henderson", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/11644296-melissa-henderson", "userReview": "Captivating from the first page, I could smell the magnolia blossoms, feel the ocean breeze and see the old historical homes in Charleston SC. My heart ached for the characters as the story unfolded and more details of their lives were explained. The author tells a story that shows passion, devotion, mystery, hate, disgust, love and heartache. I never wanted the story to end. This is a book I will read again. Excellent story. I received a copy of this story from the author and this is my honest personal opinion."}, {"userName": "Anne", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/10475328-anne", "userReview": "I received an ARC of this book and am posting this review now on Goodreads.If you have read Sweet Tea Tuesday's by Ashley Farley, you will recognize some characters in Magnolia Nights. If you haven't read Sweet Tea Tuesday's, when you do read it, you will already have been introduced to a few of the characters. Skillfully woven into the storyline, Midge, Heidi, and Bennett make appearances in this book. Ellie Pringle inherits her grandmother's estate - a grandmother she has been estranged from for thirty-four years. As she moves across country from San Francisco to Charleston to settle the estate, she embarks on a journey of self-discovery. She has traumatic memories of her six years of living with her grandmother. Long repressed memories lead her on a path with many unexpected twists and turns. She learns more about her mother, who died when Ellie was young. Ellie finds her mother's journals and begins to learn about her grandmother, mother, and a newly discovered person from her past. Maddie, the housekeeper now as well as for Ellie's grandmother, helps fill in more holes in Ellie's memory. Meanwhile, a hurricane threatens Charleston and Ellie is living in an old home in dire need of repairs. How does she survive the storm ? Weather and internal questioning? Does she find closure? Who is the newly discovered person from her past? These questions can only be answered by reading the book."}, {"userName": "Margie Shaw", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/42918716-margie-shaw", "userReview": "I recently read an ARC of Ashley Farley's new book, Magnolia Nights, in exchange for an honest review. I started reading it very late one night, or should I say the wee hours of the morning because I was so excited to see what it was about. My eyes only made it one chapter that night but that was enough to know that it was going to be great! I am a big Ashley Farley fan, I've read 6 of her previous books, and have loved them all. But this particular one I think is my favorite. It's a little different than her others, maybe a little deeper. She writes women's fiction but this also has a touch of mystery to it also. The time frame is the present day but it has chapters that take you back about 40 years previous so to help you understand the story. The characters are depicted wonderfully. There are some you will love and some, one in particular, that just frustrated the crap out of me. The setting is in Charleston, South Carolina, and the way the story is written I could almost picture being there. I liked how characters from her other books were brought in or mentioned in the story. It made it feel very community like. Although I did think it ended kind of abruptly and left me wanting more, I believe it was done intentionally. This way, it's left it open to write more and possibly turn it into a series. At least that's what I'm hoping for. I easily give this a 5 star rating and know it will be a book I will want to reread again in the future."}, {"userName": "Anne Rightler", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/6047166-anne-rightler", "userReview": "Magnolia Nights, by Ashley Farley, is storytelling at its best. Ellie Pringle's story captivates readers with compelling characters, well-written prose and gorgeous descriptions of scenery--one can almost smell the subtle aroma of the magnolia tree and feel the force of the hurricane winds as they sweep through the Southern city. Ellie has surprisingly inherited her estranged grandmother's fortune and a mansion in Atlanta. Because of the memories of her past, some remembered and mostly repressed, she packs her belongings and moves across country with fear at what she might uncover in the house of her early childhood. Will what she finds break her or bring peace? What memories are there that might be better forgotten? Is there romance in the picture too? Magnolia Nights is a story of family, what it should look like and what it doesn't, a gritty story of secrets, lies and missed opportunities, a story of the beginnings of forgiveness and restoration...a story from a talented author not to be missed.i received a complimentary copy of the book and was not required to write a review. The opinions are my own."}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "I love love love Ashley's books and this one is no exception. I think I heard this will be a series (or at least a 2nd book) which I am glad of because there is so much more to the story that hasn't been told yet.This book is about learning about the past and coming to terms with it, finding love and strengthening family. There is even a little bit of action and mystery - a very well rounded book.This book also reminded me of Flowers in the Attic with the strict grandmother and her actions and comments to her daughter and granddaughter.Ellie has inherited the estate from the crazy grandmother. She has mixed feelings, as anyone would, about the house and everything else. But it is also cathartic because she knows she is repressing something but isn't sure what. You do find out but not giving it away, you'll have to read the book to find out.The book does leave you hanging a little bit because Ellie's story is not complete and there are some other things that are revealed that need to be addressed more fully. Yes I know it is vague but has to be to not spoil part of the story."}, {"userName": "Laurie", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/11486717-laurie", "userReview": "An amazing journey taken with a woman named Ellie who inherits her grandmother's old home in Charleston and returns to find sad, disturbing memories. What she sees as the days go forward, is a family she lost and a love like no other.\"No more obsessing about the past. From now on we're marching toward the future.\"This is a book I could not put down. The descriptions of the town of Charleston, the run down home, the magnolia tree, the memories found, all come alive in Ashley's writing!"}, {"userName": "Melissa Borsey", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/30379107-melissa-borsey", "userReview": "I received a copy of this book from the author in exchange for my honest review. I absolutely loved this book from beginning to end! Ellie has inherited her Grandmother's home which she hasn't seen since her mother's death, when her father came and saved her from her Grandmother's evil ways. Ellie knows bad things happened when she was a little girl in that house but she can't remember, until Ellie discovers old journals written by her mother hidden away and as a hurricane bears down, Ellie is trying to save the house and herself. It was very easy to get swept up in this story, excellent descriptions, especially that of the hurricane bearing down. Most definitely one of the best books I've read this summer! Highly recommend!"}, {"userName": "Dawn Trlak-Donahue", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/1732822-dawn-trlak-donahue", "userReview": "Chick lit. The ending was abrupt - everything tied up too easily, with unfinished storylines- ex. no explanation of the dad's girlfriend."}, {"userName": "Candy Daoust", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/29914098-candy-daoust", "userReview": "I received an ARC and all I can say is WOW. I savored this book from the first page to the last. If I could rate this book a 10 I would. A woman searching for information about her past finds journals from her deceased mother that lead her on a life changing discovery! I learned so much about Charleston and felt like I was there to experience the beauty of the city and it's old mansions. I could almost smell the magnolia trees. After reading this book, I would love to visit that city some day to personally experience it.I have enjoyed this author's other books, but this book has to top my list as my favorite!"}, {"userName": "Guanajasharon", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/28269871-guanajasharon", "userReview": "Quick read and good story."}, {"userName": "Renee", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/16247553-renee", "userReview": "Another enjoyable read by Ashley Farley set in Charleston, NC.  This novel evokes a feeling of old Charleston and held my interest with a sense of unease throughout the book. The story of a woman confronting her troubled childhood that had been buried in her mind for 34 years was engrossing and disturbing. Her quest for answers kept me engrossed in the book for the better part of a day until I finished it. The descriptions of the home from which she escaped were gothic with a hint of the super natural and just pulled you into the plot. The story flipped from present issues of hurricanes and new love to flashbacks of disturbing abuse and drama. The last portion of the book moved quickly with numerous revelations that led to an unexpected ending that left me still wanting answers!"}, {"userName": "Leslie", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/10947907-leslie", "userReview": "Loved this story, would have given 5 stars, but the ending was a bit abrupt. However a note from the author said there is a sequel on the way - can't wait!"}, {"userName": "Sandy", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/1430109-sandy", "userReview": "I received an ARC of this great read. It will keep you up late wanting to get to all the answers. A great story set in Charleston, SC with lots of twists and turns. A little Flowers in the Attic action with an evil grandmother; mystery of blocked memories from childhood, and an historic old home that may hold the answers. I am so hoping this is the start of a new series!"}, {"userName": "Judy Churchill", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/10813077-judy-churchill", "userReview": "This was exactly what I expected and I enjoyed the book. Well written and a sweet story. The perfect light reading for a vacation."}, {"userName": "Tessa Campbell", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/66576119-tessa-campbell", "userReview": "The story was well written with enticing, descriptive language and an intriguing plot. Unfortunately, the ending was shit and underdeveloped. It was a big disappointment but I did read that the author would be making a sequel which explains the hasty and unresolved ending, although that’s no excuse. I’m unsure if I’ll read the sequel. I’m rating this book four stars because the first 3/4ths of the book was that enjoyable and I just don’t think there was enough thought given to the ending."}, {"userName": "Twobchelm", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/28529562-twobchelm", "userReview": "Ellie Pringle finally uncovers the secrets that have haunted her for years . It was a sweet journey finding the hard answers but they brought her peace. It was an enjoyable read, not riveting but you need one like this now and then."}, {"userName": "Diane", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/5246393-diane", "userReview": "Magnolia Nights by author Ashley Farley is a southern mystery set in the historic district of Charleston, SC. Eleanor Pringle has come back to her childhood home with her little Maltese, Pixie. Ellie has inherited her grandmother’s estate after her death. Fears and long buried memories of living in this house trouble Ellie and she is hoping being here will help her uncover the mystery. Ellie is happy to see Maddie, the kind housekeeper she remembers from her time there. Maddie advises Ellie to keep her grandmother’s bedroom door open so her spirit will be free to leave. Ellie respects Maddie’s Gullah customs and later has experiences in the house which she feels is due to her grandmother’s spirit still hovering in the house. Ellie explores the house and prepares to clean out some old things because she may decide to sell the house. She finds a note written by her mother. This starts Ellie on a hunt for her mothers journals or dairies. As she finds pages her mother wrote before her death, Ellie begins to uncover the secrets from the house. I won’t post spoilers, but there are a couple of twists in the story which brings to light some of the mysteries of Ellie’s childhood. This story is written with emotions of a woman looking for her lost childhood and wanting answers. Will Ellie embrace and be happy with the truths she finds? A very well written mystery!"}, {"userName": "Bambi Rathman", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/57238100-bambi-rathman", "userReview": "Ok, this book drew me in from the very first page. For me it had intrigue, mystery, suspense, heartbreak, and great joy. I really had a hard time putting it down and the little \"cliff hangers\" at the end of each chapter kept me wanting to find out what happens next. The setting in Charleston, SC was descriptive of the historic homes and some of the \"secrets\" hidden in them. I loved the character of Ellie and her search for answers from her past so she could face happiness in her future. I will recommend this book to my reading friends! I received a copy of this book from Netgalley. TY"}, {"userName": "Pam", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/7884584-pam", "userReview": "First of all, I just want to tell the family and friends that nothing happened, I am well... definitely in the most difficult moments if you know who are true friends or people who truly appreciate you 😊 unfortunately most Friendships abandon you and only send you congratulations...I've decided to post this message in support of a very special person for me who fights to the end with firmness, good energy. She taught us to live each day as the best day! Now I'm watching those who will have time to read this post to the end. This is a little test, just to see who reads and who shares without reading!If you've read everything, select \"like\" so I can put a thank you on your profile. Cancer is very invasive and destructive to our body, even after having finished treatment, your body continues to fight itself by trying to reconstruct all the damage caused by radiation. It's a very long process.Please, in honor of someone who died, or is fighting cancer, or even had cancer but healed; copy and paste.Everyone says, \"if you need anything,don't hesitate, I'll be there for you\" so I'm going to make a bet, I think less than half of my friends will put it on your wall. You just have to copy (not share)I want to know who I can count on, so write \"done\" in the comments when you share .Done"}, {"userName": "Shauna", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/7573784-shauna", "userReview": "I love Ashley Farley books, but this is my least favorite so far.I enjoyed the story, but found some of the characters to be annoying, most of all Ellie. Also, descriptions of Louisa were off-putting - we get the idea that she was overweight with the mention that she had gained at least 100 pounds - to keep going on about her tent of a dress, exposing more flesh than snyone wanted to see because her top was sleeveless, waddling, flopping in the chair, her bulk, her back flesh, and on and on, served no purpse other than to illustrate that as an unattractive and fat woman, we surely must be disgusted by her and know that she isn't one of the good guys. There are better ways to paint a person negatively than pointing out their physical flaws.More character development for pretty much everyone would help. I found Ellie to be a fairly unlikable character."}], "description": "From the author of the bestselling Sweeney Sister Series and Sweet Tea Tuesdays comes a new novel of passion, intrigue, and redemption. Ellie Pringle has spent endless hours and countless dollars working with a therapist to remember the lost years of her childhood. She’s baffled and more than a little intrigued when the grandmother she hasn’t seen in thirty-four years dies and leaves her a fortune. The time has come to face her past in person. Still reeling from a recent breakup of a long-term relationship, and with nothing to keep her in San Francisco, Ellie packs her meager belongings and boards a plane for the South Carolina Lowcountry.Standing in the entryway of her grandmother’s antebellum home on South Battery Street in Charleston, Ellie faces the first of many ghosts who will soon haunt her. On her first night in the creepy, creaking mansion, as she’s perusing the titles in a dusty bookcase, she comes across her deceased mother’s leather-bound journal. Her mother’s words create more unanswered questions and send her on a quest to find more journals. As Hurricane Lorene bears down on the South Carolina coast, Ellie encounters Julian Hagood, a handsome architect who has the talent to restore her dilapidated mansion and the charm to mend her broken heart. But as Ellie reads her mother’s diaries, they dislodge a stone in the wall that safeguards her memories, causing her world to come crumbling down. Revelations about her childhood lead Ellie on a harrowing journey of discovery that will hold readers spellbound until the dramatic conclusion.", "title": "Magnolia Nights\n      \n          (Magnolia Series #1)", "url": "https://www.goodreads.com/book/show/35992068-magnolia-nights", "average": 4.05, "cover": "https://images.gr-assets.com/books/1502744943l/35992068.jpg", "reviews": 340, "authors": [{"url": "https://www.goodreads.com/author/show/6916019.Ashley_Farley", "name": "Ashley Farley"}], "type": ["Fiction", "Mystery", "Romance", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/35992068-magnolia-nights", "http://www.goodreads.com/book/show/36072516-magnolia-nights", "http://www.goodreads.com/book/show/34390136-sweet-tea-tuesdays", "http://www.goodreads.com/book/show/25202681-her-sister-s-shoes", "http://www.goodreads.com/book/show/31684773-boots-and-bedlam", "http://www.goodreads.com/book/show/33216759-tangle-of-strings", "http://www.goodreads.com/book/show/36697161-saturdays-at-sweeney-s"]}