{"ratings": 312, "userreviews": [{"userName": "James Jennings", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/7422596-james-jennings", "userReview": "It had lots of interesting ideas and exciting scenes, and I really like the main character. My main complaint is that the plotting was somewhat forced. There wasn't always a good reason for the characters to be where they were at any given time, except that's where they had to be for the story. I remember that the first novel in this series, \"Digital Divide\", was better in this regard."}, {"userName": "Niall Teasdale", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/7115945-niall-teasdale", "userReview": "The only real problem with this book is the resolution which doesn't really rely on the characters. It just pops out of nowhere and there it is.However, the story races along and keeps you engaged with the characters. This is a book more about character development than plot. That's not a terribly bad thing since the characters are interesting.On to book 3..."}, {"userName": "Natalie", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/1671713-natalie", "userReview": "Rachel Peng is a one-of a kind speculative crime fiction protagonist that I want to see more of, and maybe you do too? She lets the author and the reader explore all kinds of complicated territory and contemporary conundrums. There's a good dose of humor to ease the journey and keep it from going all neuromancer on you, and best of all, lots of action with frequent beer and pizza breaks."}, {"userName": "Natalie", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/1671713-natalie", "userReview": "Rachel Peng is a one of a kind and that'll keep me reading.This entry in the series felt jumpier than its predecessor but it's still action-packed and Peng becomes more dimensional w ea page. The next time Prng steps out I want to be along for the ride."}, {"userName": "Tony Hisgett", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/10637613-tony-hisgett", "userReview": "Rachel is becoming one of my favourite characters, since the first book she has become more independent and forceful and is a much more ‘rounded’ individual.The plot for this book starts with an investigation into the bombing of a Washington DC street, but this soon becomes a story into the political intrigue surrounding numerous government agencies. I really enjoyed this part of the story and this time there was a satisfactory resolution to the investigation, but how it was solved was a little disappointing. Discovering the perpetrators was almost by accident.My only real criticism was that sometimes there was too much description and explanation. It’s probably better to have too much than too little, but at times I felt it got in the way of telling the story. However, I thought this was still a really good story."}, {"userName": "Emilious Tarr", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/12738007-emilious-tarr", "userReview": "I like these books. For sure, this is not The Great Gatsby, but it is a good, easy read. It helps to be a fan, or at least familiar with NMs. Spangler's webcomic, A Girl and Her Fed, but the stories, work by themselves too. Its amusing to watch other reviewers try to talk around plot devices, or lament the lack of tie ins between the two, but this series is set in a time period that has not been covered by the comic, and for one, I think that adds to the enjoyment."}, {"userName": "Wetdryvac Wetdryvac", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/608116-wetdryvac-wetdryvac", "userReview": "It's telling that my least favorite of this series still rocks more socks that my most favorite of most other series. Seriously, when you can come back for a reread of an entire series and not think of your least favorite, \"Oh, it's that book again,\" But instead look forward to it? WIN.Yeah, I'm looking forward to re-reading this again next year, too."}, {"userName": "Mike W.", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/60942611-mike-w", "userReview": "An exciting and suspenseful scifi/police mystery. I really enjoy KB's characters, pacing, and world building. This is my third book of hers, and I'm hooked."}, {"userName": "Steven Erickson", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/7254066-steven-erickson", "userReview": "Maker Space picks up pretty quickly in the universe of ‘A Girl and Her Fed’ as well as Digital Divide. Digital Divide is the first of Spangler’s books in the series and takes care of the majority of world building necessary to understand the intricacies of her universe. Allow me to sum up:Essentially the United States Government decided to input chips in to people’s heads that allowed them to interact with machines. ANY machine that uses electronic processing –from cell phones to power stations to laptops – can interact with this chip. It’s an amazing piece of technology and the Government wanted to use it as a sort of secret weapon. Instead the users who didn’t go insane banded together and outed the effort forming OACET – the Office of Adaptive and Complementary Enhancement Technologies – without asking permission. Things go steadily interesting from there.Rachel Peng is one of these OACET agents and she seems to get stuck with all of the ‘fun’ jobs. This time she is investigating a bombing that occurred in our nation’s capitol – an investigation that seems to be pointing at our own military as being responsible. Throughout the book we follow Rachel’s investigation as well as her thoughts and interactions with the community. Spangler does an excellent job of conveying the different personalities and interactions that people have with their ‘new’ cyborg brethren. The novel is an interesting one and Peng is an interesting protagonist. While Digital Divide offered an interesting premise, I would argue that many of the characters involved, including Peng herself, were a bit on the flat side and, occasionally, repetitive. This has been fixed tremendously in Maker Space. Now that Spangler has established the universe, she gets to play with the characters and their morals.That play is where the majority of the novel takes place. Yes, it’s a procedural story, but the characters and their interactions are at the heart of it and those interactions are fascinating. You have Peng as our filter to see the world through and the irony of her being blind is not lost on the reader. We’re only seeing what she can see, and what she can see is, in many ways, more intimate than what a sighted person can – even though many organizations would not see it that way. We also meet a number of her colleagues in the police department (she’s a liason between OACET and the DC police) and Spangler does a good job of differentiating the different officers and agents that Peng interacts with. Of special interest is Peng’s partner in the police. He is one of the few people that Rachel has trusted with her secret of being blind and also one of the few that she listens to an has direct admiration for. He’s also a maker, a term I haven’t heard before but appears to be based on actual spaces spread around the country. That Spangler has found this community and woven it in to the story. It is done with a great deal of respect, but not fawing – a delicate balance for a creator to reach and make feel authentic. Spangler’s authenticity comes through quite well. It helps to have a charming person like Santino to experience the community with and through. There are also a number of ‘extras’ that pop in and out throughout the investigation. It’s the usual group of suspects, informants, and plot developers and each is interesting in their own ways. They don’t get the full on development that Santino and Peng get, but they each have their motives and personalities. They aren’t supposed to be as well developed as Santino and Peng, but they can be just as entertaining and interesting as the pair.(A few of the ‘cameos’ from her webcomic are slighted slightly in development, but that makes sense – they are supposed to be cameos and their development is left to Spangler’s webcomic.)On the whole, this is an excellent book and is a fascinating read for fans of ‘A Girl and Her Fed’ and an even more exciting read for those that are not. It stands excellently on its own and is a great investigation novel. I enjoyed it tremendously and look forward to the next installment. Writing: 5/5Characterization: 5/5Plot: 4.5/5Flow: 4/5Value: 5/5Total rating: 4.85/5"}, {"userName": "Rjlouise", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/558295-rjlouise", "userReview": "I do so love Spangler's work. She's smart, sassy, and fun without sacrificing character growth and distinction. This is the second book in the series and it just leaves me salivating for more. Spangler is one of those authors who I dearly wish I could pay to write a book every three months and do nothing else.Maker Space is really different from Digital Divide. And I think that difference really helped the book rather than hindered it. Rachel, the main character, isn't suited to the murder-a-week (or book) scenario. She's smart and jumping through the same hoops over and over again would do her no favors. She wouldn't grow as a character in that setting and we - as readers - need her to, as much as the character needs to grow in order to move the books forward.I love Rachel, both as a character, but also as solid representation. Rachel is Chinese-American, a cyborg, blind, and a lesbian. And, delightfully, Rachel is so blessedly normal. Yeah, she's all kinds of different. But she's carved out a niche for herself where she goes to her job, comes home to a roommate who won't give up that one annoying habit, and *that* neighbor. She worries about house values and dating problems. People forget she's a cyborg because she's so normal. And no one says shit about her being a lesbian. It's so beautiful and wonderful and I could read Rachel all day.It's really good to see a totally different kind of political intrigue. The shadowy, behind-the-scenes sort of things that happened in Digital Divide are something of a reality. But events that play out very publicly, like a bombing wherein the media makes sure everything is done under the heavy scrutiny of the public eye, are also reality. Government can't keep everything under wraps and watching Rachel navigate the public and private sectors in Maker Space was a dynamic I am glad was introduced. She kind of got off scott-free in Digital Divide, in that respect. That couldn't last forever. I do so love the differences between these two books.I love seeing a little more of Rachel's personal life (her struggles with blindness, anxiety, how to date, her roommate), but also seeing the changes in her professional life. It was a relief that the most beloved characters from the last book were back in full force in Maker Space, as well as a little more chance to get to know them, personally, as well. I do so love characters who are real and present, but don't get in the way of the story.I love this book, just as much if not more than the last.A+ (standard of excellence in writing maintained, beautiful characters)"}, {"userName": "Mona", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/5975349-mona", "userReview": "Rachel Peng is a Chinese-American Federal Agent thrown into an investigation into a terrorist bombing. So far, so realistic -- and it is; this a reality just a jump to the left. But Rachel is not only a vet and a lesbian but a cyborg too: the product of an experiment run by the US government that went off the rails before it jumped back on. Here she is with that chip in her head that connects her inseparably to information technology systems and her little department of cyborgs (aka OACET, Office of Adaptive and Complementary Enhancement Technologies). All of her fellow OACET Agents are able to use the chip to lock into electronic systems and extract-slash-manipulate the flow of impulses, but they also spark other changes in the human body and mind. Rachel has honed one particular aspect of perception to perfection: feeling her way around another person's emotional landscape in synesthetic ways. All of this makes the novel rather technical and -- literally -- colorful, more so than I usually enjoy, but it has a point beyond geeky glee: Rachel has lost, in an event she herself doesn't understand, most of her eyesight, and her vision of the world is based mostly on the grid of electronics on the one hand and the beacons of human emotions on the other. That part is a secret to most; the cyborg part isn't, and the backlash Rachel has encountered in the wake of the cyborgs project going public has made her wary.Especially after reading Santa Olivia, I feel this another great take on the female superhero genre: One, Rachel's story is filtered through an oddly shaped lens of ability and disability: She has lost most of one sense, but of course the experiments on her have given her another, multifaceted one. Two, she is careful, controlled -- yes, she has genuine powers through her ability to manipulate the electronic world, but in a hand-to-hand combat or any other physical situation that one's useless. Her chip is no sonic screwdriver, that's for sure. If this sounds complex, wait until you hear about the political thriller aspects -- that's the overarching plot, pretty much. Rachel does do some dating too, and that's cute but low-key. Needless to say she's snarky too, as are some of her colleagues. Basically, you like contemporary earth sci-fi and speculative fiction on various levels, societal, political, and technological? This one's for you."}, {"userName": "Shayla Gibson", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/22948234-shayla-gibson", "userReview": "I've long enjoyed KB Spangler's webcomic (A Girl and Her Fed) so these books based on characters from the comic seemed like a shoe-in for enjoyment. And they are! Rachel Peng is not a major character in the webcomic, so it was nice get to meet new characters, though my true loyalty will always lie with Hope and Speedy. Yeah, Speedy, not Sparky. If you read the comic, you'll know who the really dangerous ones are. If you haven't read the comic, go do so! What're you waiting for? It's easily available online!After reading this series (including Brute Force, as a pre-release proofreader, which was a blast! I know authors don't usually read reviews, but if you happen by, thank you so much for letting me do that!) I think my next dream book is a team-up between Rachel and Hope, because the ensuing chaos would be amazing.Oh, right, what are the books about? Very briefly, these books are set in the fall-out of a secret government-funded program which created cyborgs for use in spying and infiltration missions. \"Not the clankity-clank pneumatic gun-arm variety of cyborg, but the type that was otherwise completely human except for the tiny chip in their brain which allowed them to take control of any networked machine. (If she had been given the option, Rachel probably would have chosen the gun arm, or the rocket legs, or any other heavy artillery to augment her own natural stopping power instead of the implant. But those were the stuff of science fiction; she had no idea how a piece of technology as complex as her implant could have been invented before the scientists perfected flamethrower fingers. Different priorities, she supposed. Still. Flamethrower fingers.)\" Maker Space is a post-terrorist attack detective/procedural with a loving look at the maker movement of artists and creators."}, {"userName": "Erin", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/6919482-erin", "userReview": "Like its predecessor, \"Digital Divide\", \"Maker Space\" is a tight, thought-provoking thriller with a strong female protagonist and a diverse cast. What makes the Rachel Peng novels truly exceptional reads is Spangler's ability to create a truly immersive world. She blends existing technology with the plausible seamlessly; Spangler clearly does impressive research for these stories. Most powerful is her use of Peng's unique senses; Peng can \"see\" emotional patterns due to her cybernetic implant. Since Peng is still learning to attach what she perceives to nuanced emotions, the reader is invited to learn along with her. This makes it much easier for the reader to accept the new technology, and to become immersed in the world Spangler has constructed. It allows great emotional depth, especially as compared to many others examples of the genre. Since this depth is introduced through Peng's novel perceptual abilities, the descriptions of the emotional map of the narrative strengthen the immersion,and Spangler is able to avoid heavy or cliched language that can bog down a narrative and interfere with the pace of the story.I would highly recommend these books to anyone, especially those who like near-future thrillers, law-enforcement dramas, or cyberpunk."}, {"userName": "Jean Johnson", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/6207899-jean-johnson", "userReview": "MAKER SPACE is Spangler's 3rd book about cyborgs and more. It is more serious than the previous Rachel Peng novel, DIGITAL DIVIDE (and naturally more serious than the Josh Glassman novel, THE RUSSIANS CAME KNOCKING, but then, that's Josh for you). It still has humor, wit, and humanity laced throughout the story, but this is a much more serious tale.How serious? Seven bombs destroy fourteen blocks of Washington D.C. tourist retail space. Dozens dead, buildings destroyed, the threat of rioting in the streets...all because no one can figure out who did this and why, leaving nothing but wild speculation and outrage to boil over on the city streets. Rachel, her cop partner Santino, her fellow agent Phil, and more are caught up in the chaos, uncertainty, and need to succeed in figuring out what happened. This time, the stability of an entire city--the nation's capital--is at stake, not just lives.I can't say more without giving away spoilers, but I can say this is a book (for the moment, an ebook only) that will suck you in and have you huddled over your e-reader, reading until the very last page....Also, the door into the maker space loft sounds like an awesome piece of architecture."}, {"userName": "John", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/309661-john", "userReview": "Not quite as stellar as the first Rachel Peng outing: the plot isn't as focused and keeps wandering off into side scenes and psychological crises; the banter has a few moments but is weaker sauce; there is too much explanation of the back story (one thing I loved about DIGITAL DIVIDE was the way OACET's creation and culture was slipped into the action--here it's all infodumps); all the Maker Space business seemed forced in to trumpet the movement rather than advance the story. Still, an above average thriller/cop caper, and I'm definitely still in line for sequels (as well as a big fan of the web comic).Memorable lines:(Peng's neighbor) \"Mrs. Wagner's cookies weren't too bad, but anything that came in a casserole dish always tasted as through a cat had slept in it.\"\"Rachel, who was of the opinion that if baseball were any slower it would be called farming...\"\"Really, when you had a desk full of penguins, the opportunities were endless.\""}, {"userName": "Naomi", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/35881576-naomi", "userReview": "This is one of my favorite series. I’m one of those people who reads multiple books at once, but even on my third reread I found myself putting the others aside until I finish whichever Rachel Peng book I’m on!This is the second book in the Rachel Peng series. It starts out when a series of times explosions take out several blocks in DC. Rachel and her team are asked to join in the investigation were every clue they find seems to point back the the government, to homeland, to the military. But something isn’t right. There is too much about this bombing that is precise next to too much that is sloppy and Rachel doesn’t think Homeland did it, even if they are trying to hide something. The public does though, and as riots break out Rachel begins to think that maybe who isn’t the right question this time, It’s why."}, {"userName": "Amber", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/13246535-amber", "userReview": "This was a great follow up to the first book Digital Divide. Rachel is an easy character to remain interested and invested in but aside from her well written sense of humor and plenty of sass we also see her grow a bit as a character.It was good to get more insight and see a discussion about how Rachel's eyes were injured and more about how she thinks and feels about it. It gave me a better sense of what happened then the first book did.While the biggest \"revelations\" of the book don't happen until the very last portions of the book it was still a fun ride all along the way.Rachel Peng and the others make for some interesting characters and a great story. I'm really looking forward to reading the next one."}, {"userName": "Pilar", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/5718295-pilar", "userReview": "I've been an avid reader of A Girl and Her Fed(a webcomic and the origin of these characters) for almost 3 years. When the first Rachel Peng novel came out I had no idea how it would translate to the different medium. Successfully is the best word for it. The pacing is great. Descriptions are never superfluous or boring. The moral discussions are relevant, interesting and dynamic. I can't wait for the next one."}, {"userName": "Kari Chapman", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/1628347-kari-chapman", "userReview": "Another fun Rachel Peng novel. I like seeing the characters develop from the last book to this book, most especially the Oacet agents as they start picking up their lives again. The story in the \"A Girl and Her Fed\" webcomic is good, but Spangler does show in these books that she can tells stories in multiple formats. Another great read."}, {"userName": "Liz Homsy", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/27399483-liz-homsy", "userReview": "Beautifully written and fascinating apropos to the world we actually live in, Ms. Spangler's latest update in the saga of Rachel Peng is lively and poignant. A good, old fashioned crime novel that manages to challenge modern audiences with a new variant on the old \"whodunit\". Much like it's predecessor, Digital Divide, Maker Space is definitely worth a read!"}, {"userName": "Eileen Young", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/14810927-eileen-young", "userReview": "This book, aside from the frequent explosions, demonstration of research, and excellent representation, reminded me of what I love about making things. It's a sharp examination of the ways we're unprepared as a country for some of the new and scary technological realities we're faced with, but also of the ways people can be kind, and creative, and actually try to do good and make things better."}, {"userName": "Katherine", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/4455057-katherine", "userReview": "A worthy second book. One thing I really like about both the comic and these books is that the author is surprisingly good at keeping the depiction of different political angles fairly well-balanced."}, {"userName": "Kevin Vinokur", "userReviewDate": "Aug 11, 2016", "userURL": "http://www.goodreads.com/user/show/42439269-kevin-vinokur", "userReview": "One of my main issues with this book is the reveal of the main antagonist. It just seems like poor writing to have hundreds of pages of set up, only to reveal the main antagonist in the last 15 or so pages. I would have liked to meet the antagonist a bit earlier, so that there is more of a mystery."}, {"userName": "Aaron", "userReviewDate": "Mar 08, 2014", "userURL": "http://www.goodreads.com/user/show/6883767-aaron", "userReview": "The followup to Digital Divide, Maker Space continues to develop Rachel Peng and her world beautifully. It's somewhat more referential to current political events, but does so intelligently and without harping on them overmuch."}, {"userName": "Elizabeth", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/286947-elizabeth", "userReview": "A fun quick read, but not as good as Digital Divide. I think Spengler got too caught up in the points she wanted to make in response to the Boston bombings and forgot to let her characters get on with their stories and their lives."}, {"userName": "Simon", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/38699856-simon", "userReview": "A continuation of the story in book #1. More development of the main characters, and good plot, which started of well, but I felt tailed off a bit towards the end. Looking forward to the next in the series."}, {"userName": "Pat Coleman", "userReviewDate": "Apr 28, 2014", "userURL": "http://www.goodreads.com/user/show/999858-pat-coleman", "userReview": "I Like this series but I liked the 1st novel a little bit more than this one"}, {"userName": "Nicholas ", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/4811358-nicholas", "userReview": "I'm really enjoying this series. Spangler does a very good job of combining the best elements of the technothriller with interpersonal human insights. I'm eager to read more Rachel Peng stories."}, {"userName": "Charles Knox", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/6186375-charles-knox", "userReview": "I enjoyed this a lot. I really enjoy the whole concept of her world, and the blend of tech and story in this book."}], "description": "Conspiracies, political cover-ups, acts of terrorism… As one of the first cyborgs employed by the federal government, Agent Rachel Peng thought she had already lived through it all. Then, without warning, fourteen blocks of downtown Washington, D.C. are gone, blown apart by bombs unlike anything Rachel has ever seen. The evidence is even more troubling, with each new clue suggesting their own people might be behind the attack.Rachel and her partner, Detective Raul Santino, might not believe that the Department of Homeland Security is responsible, but the rest of the country does. As tensions mount and the city begins to burn, Rachel learns that none of her usual investigatory techniques apply—for the first time in her long career as a cop, finding the bad guys might not be as important as learning why they wanted the public to rise up against their own government.", "title": "Maker Space\n      \n          (Rachel Peng #2)", "url": "https://www.goodreads.com/book/show/20987201-maker-space", "average": 4.28, "cover": "https://images.gr-assets.com/books/1394041607l/20987201.jpg", "reviews": 30, "authors": [{"url": "https://www.goodreads.com/author/show/6575864.K_B_Spangler", "name": "K.B. Spangler"}], "type": ["Science Fiction", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/20987201-maker-space", "http://www.goodreads.com/book/show/20957398-maker-space", "http://www.goodreads.com/book/show/17774449-digital-divide", "http://www.goodreads.com/book/show/25504842-state-machine", "http://www.goodreads.com/book/show/33141839-brute-force", "http://www.goodreads.com/book/show/27289411-greek-key", "http://www.goodreads.com/book/show/36259523-stoneskin"]}